{"response": [{"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Jul 07, 2010", "message": "\"Area 51 is designed to build up momentum for a site prior to launch\"\n\nI wish that was true. But the reality is that the commit phase is tailored specifically to drain the site of any momentum it may have had. Apart from the Web Apps and maybe gaming sites, everything else is going to spend long enough in that phase to drain away the interest and momentum it had. A commitment made a month ago just doesn't matter. People have forgotten that they've committed, they've moved on, they've found answers to their questions elsewhere.\n\nIt's designed to attract the wrong crowd: rather than appealing to expert users, who want to ask and answer questions, it appeals to.... wait for it.... Meta.Stackoverflow.com users. People who don't really care about questions in any specific area, but just enjoy hanging around and feeling that they're part of SO/SE and that their opinion matters.\n\nThe kind of person who's willing to commit to using a site which *may* get launched at some indeterminate point in the future is not a person who simply cares about the subject matter. It's a rep-whore who thinks \"oh wow, being one of the early members on a StackExchange site? Sweet, imagine the headstart I could be getting\"."}, {"author_name": "Mike P", "gravatar_hash": "741479460f222ef63dd714c4b1da29e1", "author_url": "http://mikepascucci.com", "date": "Jul 07, 2010", "message": "Thanks a lot for including a link to my blog post within your post. I looked at my traffic stats and appreciate the \"bump\" and hope that others enjoy the content that I post.\n\nI would definitely agree that the design aspect of the site also plays a very important role in success.\n\nMike P"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jul 07, 2010", "message": "I agree 101% with jalf"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 07, 2010", "message": "> A commitment made a month ago just doesn’t matter. \n\nSure it does. Like any process of government, it takes a bit of time. We send emails to let people know of critical milestones like \"the site went to private beta\", so there's plenty of notification as things happen.\n\nIt would be very odd to expect community members to be sitting on Area 51 with their fingers hovering over the browser refresh button.."}, {"author_name": "womp", "gravatar_hash": "e159cb326f8d203488d3d9d0e5e98a46", "author_url": "http://www.womps.net", "date": "Jul 07, 2010", "message": "The lolcat you choose for the error page is the second most important design element for a new Q&amp;A site."}]}