{"response": [{"author_name": "x3ja", "gravatar_hash": "3b3abfafc9c2ac70c5130b2ba47e9b8b", "author_url": "http://x3ja.co.uk/", "date": "Jul 12, 2010", "message": "\"Similarly, dashes reek of desperation.\" - You really do take every opportunity to have a go at that site don't you? :)\nGood article though, hopefully we come up with something better than just WebApps for http://webapps.stackexchange.com"}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": null, "date": "Jul 12, 2010", "message": "Similarly, don't use multi-word names where one word is plural and the next one starts with 'ex'..."}, {"author_name": "Joel Spolsky", "gravatar_hash": "95e6837f350869bfb44e069a98885c58", "author_url": "http://stackoverflow.com", "date": "Jul 12, 2010", "message": "Right, and don't include Whale Fart as any part of your domain name."}, {"author_name": "ideasculptor", "gravatar_hash": "c672c7d37826acfd7760a0c1dceb3c4f", "author_url": null, "date": "Jul 12, 2010", "message": "\"Similarly, don’t use multi-word names where one word is plural and the next one starts with ‘ex’…\"\n\nWhat's wrong with my website - fungiexplained.com?"}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Jul 12, 2010", "message": "If there were a chess.stackexchange.com you'd make me the happiest typing monkey in the world"}, {"author_name": "jean moniatte", "gravatar_hash": "f420a8332d816e2bdbe9c955a065790c", "author_url": "http://www.ugal.com", "date": "Jul 12, 2010", "message": "www.instantdomainsearch.com is a very good tool to find if a domain name is available."}, {"author_name": "Aiden Bell", "gravatar_hash": "60f28d36c1439f965e2fb55419621968", "author_url": "http://stackoverflow.com/users/104040/aiden-bell", "date": "Jul 12, 2010", "message": "I sort of disagree here.  I want to see a coherent 'series' brand ...   but then again, if SE spin-offs turn out crap and have horrid standards of content then maybe detachment is best (save damaging the perceived quality of SO etc)"}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jul 12, 2010", "message": "Hm, if the series is reputable (like O'Reilly) I'd personally feel better about getting a book in it than some random book about the subject.\n\ncaptcha: unionize wage"}, {"author_name": "Barrett", "gravatar_hash": "3f8ad722c7eef6f904df7f0ce7c3437e", "author_url": "http://www.barrettj.com", "date": "Jul 12, 2010", "message": "@ideasculptor \"What’s wrong with my website – fungiexplained.com?\"\n\nI started reading it and following the instructions but then the text got all wavy and caused my hand to melt with the mouse..."}, {"author_name": "Colin C.", "gravatar_hash": "2cee378b447f0f3605d0b5b06a005074", "author_url": null, "date": "Jul 12, 2010", "message": "What is \"a reasonable amount of money\"?"}, {"author_name": "Jason Punyon", "gravatar_hash": "c88159de92d664d35761fe5828cc5ccd", "author_url": "http://jasonium.com", "date": "Jul 12, 2010", "message": "@BlueRaja:  If you will it, it is no dream.  \n\nhttp://area51.stackexchange.com/proposals/7551/chess"}, {"author_name": "Aymeric", "gravatar_hash": "5536047005b677aed0ac5aa01f471a88", "author_url": "http://aymeric.gaurat.net", "date": "Jul 12, 2010", "message": "@x3ja: Well spotted :)"}, {"author_name": "Ryan Tate", "gravatar_hash": "6c08091427764bcb7e0623c69603c27c", "author_url": "http://ryantate.com", "date": "Jul 12, 2010", "message": "The jargon suggestion hearkens back to the days of biz/tech magazines for Silicon Valley. The first one, in 1989, was called \"Upside,\" which at the time sounded fairly insidery given that most Americans did not own stocks or mutual funds. The second one, in 1993, was called Red Herring, named after the nickname for disclosures given to venture/angel investors. These magazines each lasted about 10 years; the gold rush copycatswith generic names like Business 2.0, Industry Standard and (shudder) eCompanyNow lasted on average about 10 weeks. (OK, more like three years; you get the idea.)"}, {"author_name": "Portman", "gravatar_hash": "8d1b72efe7ffa105425d8c7325be747c", "author_url": "http://www.portmanwills.com", "date": "Jul 12, 2010", "message": "And yet the #1 book in the \"Baking\" category on Amazon is:\n\"Ben &amp; Jerry's Homemade Ice Cream &amp; Dessert Book\".\n\nhttp://www.amazon.com/gp/bestsellers/books/4196/\n\nThe \"...for Dummies\" brand is a strawman: powerful brands like Ben &amp; Jerry's CAN cross industries and influence purchasing behavior. See http://en.wikipedia.org/wiki/Halo_effect.\n\nA better justification for individual domains on SE2.0 sites is that \"StackExchange\" is not a strong brand and wouldn't influence behavior across the myriad audiences that are being targeted.\n\nBut if, for example, StackExchange were acquired by Google, I bet you would switch to a global \".GoogleQA.com\" domain in a second."}, {"author_name": "Robert Cartaino", "gravatar_hash": "9dfd656461a1d0a2db33f3ed4183f4c0", "author_url": "http://stackoverflow.com/users/98786/robert-cartaino", "date": "Jul 12, 2010", "message": "@Kyle Cronin:\n\n>if the series is reputable (like O’Reilly)\n\nIf the Stack Exchange brand name turns out to be so strong that it trumps any possible advantage of being a vertical community, the blah.stackexchange domain will still work. It will always work.\n\n"}, {"author_name": "Adam", "gravatar_hash": "207958aa5ac1c42448070dbab3f2dd87", "author_url": "http://stackoverflow.com/users/284685/adam", "date": "Jul 12, 2010", "message": "Can we have both the subdomains and top level domains? Personally, I have a Chrome extension on stackapps (http://bit.ly/aW5opg) and Chrome Extensions need all domains that will be used to be specified at installation. Right now I have *.stackexchange.com specified and that works fine. Besides I'm sure if the publisher could afford it he'd publish the books under both the series name and the individualized version. Just as one company will sell soap under several different brands to appeal to different customers."}, {"author_name": "Robert MacLean", "gravatar_hash": "bf2af16812228b5a54daeb30c96efaf2", "author_url": "http://www.sadev.co.za", "date": "Jul 12, 2010", "message": "\".coms are a million times better than other TLDs.\"\n\nI would love to hear a reason for that. I get the thing that if I say go to the StackOverflow website without telling the URL people will assume a www. prefix and a .com suffix. \n\nHowever most people, especially in the rest of the world (i.e. not america) where we have gotten used to other TLD's, will generally ask what the domain name is. \n\nAdditional reasons why .com isn't always best:\n- For certain industries other TLD will be a million times better, for example: .aero for anyone doing a stack exchange site on planes for instance. \n- Free your mind to find fun new names that use the TLD, like bit.ly\n- If you look at the cost and crowding that exists in the .com TLD getting something meaningful isn't always an option or easy."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Jul 13, 2010", "message": "I'm curious about the reasoning for .com as well.\n\nYes, .com is a million times better than some of the more obscure TLD's. I'd rather die than use a .name or .co.au or .ly (bit.ly notwithstanding).\n\nBut I don't get why something like .net is necessarily worse than .com\n\nAlso, I totally agree with the decision to not make a \"series\" of sites. Cooking, programming and typography don't really have much in common. \n\nBrands might carry a lot of weight in some cases (as other commenters mentioned, Ben&amp;Jerry's is a brand that most Americans associate with good ice cream), but I wouldn't trust a Ben&amp;Jerry's book on hairstyling or gardening."}, {"author_name": "Wouter Simons", "gravatar_hash": "4aeb4d6ebd34a5bcc7b48de60a2bd137", "author_url": "http://chiphacker.com", "date": "Jul 13, 2010", "message": "Good article. I agree that a separate domain name for a separate site is a good idea.\n\nI wonder about using the power of branding without using the domain name. I use chiphacker.com a lot and I enjoy the community of embedded engineers that is forming there. What I noticed is that the only real way to see it is a stack overflow framework site is because of the layout and system used.\n\nShouldn't there be a reference to the stack overflow website proudly proclaiming that chiphacker.com is part of a bigger network of similar sites? Perhaps:\n\n\"This site is a member of\n     StackExchange\n Communities for all!\"\n\nUse the value of the brand on all the branches and develop umbrella policies regarding acceptable behaviour and such.\n\nAnyone visiting a relatively small site like chiphacker.com would be able to quickly see that it is an active community of enthousiasts like all the StackExchange sites. Clicking through on the logo could lead to an overview of all communities branched off from the original stackoverflow site and more information about the team behind the framework etc."}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": null, "date": "Jul 13, 2010", "message": "I've never heard of chiphacker until just now. It also doesn't contain the bottom banner referring to other SE sites. Seems like a fake to me."}, {"author_name": "Scott W.", "gravatar_hash": "7a03f436e9458527368e5eaa45f85d40", "author_url": "http://moms4mom.com/", "date": "Jul 13, 2010", "message": "I suggest this domain name search tool: http://www.psychicwhois.com/ (unfortunately it doesn't work on all browsers)."}, {"author_name": "Rob Sobers", "gravatar_hash": "e1be130ba20bb013c0e700c0d7b5cf14", "author_url": null, "date": "Jul 13, 2010", "message": "I agree that the individual brands are more powerful, but it also can't hurt to associate each brand with the stack exchange mothership in a subtle way.  Pixar films have their own beautifully crafted identities, but they also leverage the Pixar reputation.  It's a great one-two punch."}, {"author_name": "frymaster", "gravatar_hash": "5b9d566b05196d7cc17e833abae67f21", "author_url": null, "date": "Jul 13, 2010", "message": "\"I’d rather die than use a .name or .co.au or .ly (bit.ly notwithstanding).\"\n\nFunny - in the UK, there's no stigma attached to .co.uk at all.\n\nOn the other hand, I'd only use .co.uk for a _company_ based in the _UK_ - for sites not associated with a country, imo you always want one of the \"generics\" - .com, .org, .net - and .com is more popular.\n\nMy phone's browser, when typing in a URL, has a button that adds \".com\" with a single press.  They didn't include one for anything else like that"}, {"author_name": "Wouter Simons", "gravatar_hash": "4aeb4d6ebd34a5bcc7b48de60a2bd137", "author_url": "http://chiphacker.com", "date": "Jul 13, 2010", "message": "\"I’ve never heard of chiphacker until just now. It also doesn’t contain the bottom banner referring to other SE sites. Seems like a fake to me.\"\n\nPerhaps that is the entire issue then. For this site is listed from the Area51 place many times. I doubt it is a fake."}, {"author_name": "Sachin", "gravatar_hash": "18b716943596e24bd580c08d5cc2a1f3", "author_url": "http://qtp.blogspot.com", "date": "Jul 13, 2010", "message": "dashes are always preferred for two or more words"}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Jul 13, 2010", "message": "In Poland the best TLD to use is .pl, by far."}, {"author_name": "Amrinder", "gravatar_hash": "056b246184e4c0126138c0509eb200b9", "author_url": "http://www.standardwisdom.com", "date": "Jul 13, 2010", "message": "Blog over at dreamhosts also mentions \"who represents\", \"experts exchange\" and \"Pen Island\" as bad domain names.\n\nI am just saying."}, {"author_name": "Jeff", "gravatar_hash": "6d81d6dc131240aff73b92c2777f1737", "author_url": null, "date": "Jul 13, 2010", "message": "But the dummies books are well-done! Have you ever read chess for dummies?\n\nMan those are the best books to start just about any subject. Although I think \"X-for-beginners\" would be more accurate, it would not have been as catchy."}, {"author_name": "Michel Billard", "gravatar_hash": "7a72ffed0a1cd0141f4da8587624092c", "author_url": "http://www.crossbrowser.net", "date": "Jul 13, 2010", "message": "I find it funny that you think series of things usually end up being second best (or worse), but all you are doing by making each site have its own domain is hiding the fact that each site IS part of a series.\n\nIt makes sense though to give each site its own domain because once non-programmer/developer sites start popping up it won't make sense to attach them to the stackexchange brand."}, {"author_name": "fahadsadah", "gravatar_hash": "e5d82305b8c36003b65ea6d6b2de39a0", "author_url": "http://disconnectedneuronactivity.wordpress.com/", "date": "Jul 13, 2010", "message": "I would laugh so hard if as a result of this post, the food SE2 site was named burntchicken.com"}, {"author_name": "Ed", "gravatar_hash": "930c44ab50049062b4b2bb8c8b61adec", "author_url": "http://esmilde.com/disc", "date": "Jul 13, 2010", "message": "Of course .co.uk and .pl is fine for your countries... but not for StackExchange sites."}, {"author_name": "Paul Nathan", "gravatar_hash": "fc3225dc3119500fcbf7af646a83c914", "author_url": null, "date": "Jul 13, 2010", "message": "I found a really pretty name for my web site in Old English.\n\nAbout three weeks later, I was trying to give it out over the phone and I realized that it just was a Bad Idea.\n\nPlease, for the sake of everyone who wants to talk about it, make your domain name (1) spellable and (2) speakable. Don't be like me. :-)"}, {"author_name": "Teej", "gravatar_hash": "4882618e75f402b2726bf3ac5d0a31c5", "author_url": null, "date": "Jul 13, 2010", "message": "Let's do it one way!  No, let's do it another way!\n\nGuys - what's wrong with doing this BOTH ways?"}, {"author_name": "Teej", "gravatar_hash": "4882618e75f402b2726bf3ac5d0a31c5", "author_url": null, "date": "Jul 13, 2010", "message": "Sorry for not being clear -  both ways as in chess.stackexchange.com and chessforsmarties.com pointing to the same site?"}, {"author_name": "Vince", "gravatar_hash": "67cafe2c4f74121a4cd5575f3b5c068a", "author_url": null, "date": "Jul 13, 2010", "message": "For lawyers: www.antichrist.com\n\nFor investment banking queries: www.ivyleaguetoolshed.com"}, {"author_name": "Vince", "gravatar_hash": "67cafe2c4f74121a4cd5575f3b5c068a", "author_url": null, "date": "Jul 13, 2010", "message": "Oh and here's one for video games: www.lifelongvirgin.com\n\nyour welcome"}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Jul 13, 2010", "message": "\"Funny – in the UK, there’s no stigma attached to .co.uk at all\" \n\nFor UK-centric sites, sure. Perhaps I should've been a bit more precise and said that I wouldn't use such a domain for a site intended for a global audience."}, {"author_name": "krauses", "gravatar_hash": "27e252c27ec655d1c5c4234956f465c6", "author_url": null, "date": "Jul 13, 2010", "message": "Your thought process is flawed.  Of course, if I had a choice between \"PHP for Dummies\" or \"PHP for Beginners\" published by Apress, I would buy the Apress book 100% of the time.  \n\nBut I think a good series will win the majority of the time.  \n\nCan you think of any product that you've bought recently that wasn't part of a series?  Would the iPod, iPad, or mac book pro be as popular if they didn't come from the Apple series?  No single Android phone comes anywhere near the cult like following that the iPhone enjoys. \n\nYou're right about Americans want the top of the line, but discounting products from a series was a bit short sighted.  Stackoverflow.com would probably be a trusted series.  It has a loyal following and if they created another useful product and put it under the stackoverflow's banner, they'd probably have a winning series."}, {"author_name": "Gye Greene", "gravatar_hash": "748a01e87a6635688871a3f7dddbb032", "author_url": "http://gyegreene.blogspot.com/", "date": "Jul 13, 2010", "message": "Dummies books well done:  Not always.  I have \"Woodworking for dummies\", and although it's well-structured, it contains several factual errors (maybe not apparent to newbies; but spotted by me, as an intermediate woodworker).  \n\n\"Dashes are always preferred for two or more words\":  I'm old-school -- I don't allow anything except numbers, A-Z, a-z, and underscores in my filenames -- **or** domain names.   ;)\n\n--GG"}, {"author_name": "Ward", "gravatar_hash": "f347c53c9cb1ddcb816daeb22aaf89c8", "author_url": null, "date": "Jul 13, 2010", "message": "&gt;&gt;&gt; I'm old-school\n\nFor domain names, _really_ old school would be to only allow A-Z, a-z, and -  Underscores were a newfangled addition."}, {"author_name": "Jasper Bryant-Greene", "gravatar_hash": "c3fae645d097f534bb8b8796ce3724ac", "author_url": null, "date": "Jul 13, 2010", "message": "Underscores aren't valid in domain names."}, {"author_name": "Vilx-", "gravatar_hash": "be412a5d681ab90dd2b4245fcabc32a9", "author_url": null, "date": "Jul 14, 2010", "message": "This reminds me of the time some 10 years ago when we tried to pick a name for the new server at my school. We also did a brainstorming/survey among the visitors of the computer lab. The result - the most mundane name got the most votes. There were several great, original names in the list, but each gathered only a few followers. So I'm a bit skeptical about this idea. Average something among the masses and you'll get something average. Excellent things are not found in the masses."}, {"author_name": "MarkJ", "gravatar_hash": "1f3ce1ae1497058e8efd34a05dbdee22", "author_url": null, "date": "Jul 14, 2010", "message": "With the greatest respect to whoever invented it, \"StackExchange\" is a rubbish brand name. Totally meaningless brand names are fine - Google, Amazon, Fog Creek! - provided they are obviously meaningless. StackExchange sounds like it should mean something, but it doesn't. It is only meaningful to StackOverflow users, and we're trying to reach out to real people now :) That's why individual domain names are better."}, {"author_name": "Robert MacLean", "gravatar_hash": "bf2af16812228b5a54daeb30c96efaf2", "author_url": "http://www.sadev.co.za", "date": "Jul 14, 2010", "message": "@Ed \"Of course .co.uk and .pl is fine for your countries… but not for StackExchange sites.\"\n\nMaybe I want a StackExchange site for tourism in Poland then it would make a ton of sense for the .pl extension. \n\nPoint is that the idea .com is best always, is flawed. It is best often, but as with the name attention and time should be devoted to it to make sure."}, {"author_name": "Vortico", "gravatar_hash": "6cd5090839b1021f85bd329e1ed09264", "author_url": "http://stackoverflow.com/users/272642/vortico", "date": "Jul 14, 2010", "message": "The .se TLD (Sweden, http://en.wikipedia.org/wiki/.se ) could be used as a pseudo-URL shortener for SE sites, much like Google uses goo.gl to redirect to certain company pages.\n\nImagine typing \"baking.se\" to redirect to \"bakingoverflow.com\". This would not only strengthen the brand of StackExchange but make the address easier to type and relate to other SE sites."}, {"author_name": "Claude", "gravatar_hash": "4d5c69eef753f657456afa62c55270e5", "author_url": "http://Montpetit.net", "date": "Jul 15, 2010", "message": "Nah...Doman names or SO 00's...\nThink mygroup.stackoverflow.facebook.com instead."}, {"author_name": "Ben Ackles", "gravatar_hash": "0176a8671679725dda97388536e35474", "author_url": "http://benackles.com", "date": "Jul 15, 2010", "message": "Don't you think you're encouraging squatting?\n\nI don't entirely agree with the TLD argument. It seems like it could dilute your brand. God forbid you're confused with competing qa sites such as Mahalo.com. The quality of your content is so much better."}, {"author_name": "Ercan", "gravatar_hash": "7c9c7460f02d274e69b86c509e50097f", "author_url": null, "date": "Jul 16, 2010", "message": "I think the .net TLDs became rubbish right after Microsoft .NET. They now sound like the site has to be about some \"technical\" stuff.\nAlso, among the already mentioned ones, country specific TLD is also very common in Germany (.de)."}, {"author_name": "PSUnderwood", "gravatar_hash": "a2ce97168ca32e29bcc7fd97dcdb6a01", "author_url": null, "date": "Jul 16, 2010", "message": "I believe pornographic magazines would go in the 700s, or (for more text-based works), the 800s."}, {"author_name": "felix", "gravatar_hash": "ea3d530684e6ac7110d158d33c592f64", "author_url": "http://comments.deasil.com/", "date": "Jul 19, 2010", "message": "\"American audiences, generally, don’t trust series.\"\n\nIs this something that you've read some research or other on, or did you just make it up? Given the number of series out there, it doesn't seem to add up, so I'm just curious if someone has actually studied this."}, {"author_name": "Ed", "gravatar_hash": "930c44ab50049062b4b2bb8c8b61adec", "author_url": "http://esmilde.com/disc", "date": "Jul 20, 2010", "message": "I think the difference between trusting series and not is whether you're an expert in the subject or not.  When looking for a topic I don't know much about, I trust a series I've read other books on because it's probably good, but if it's a topic I'm an expert on, I can tell what's good or not by the content, and in that case a 'series' book means it's probably for beginners.  StackExchange is meant to lean more towards the 'expert' side, so it makes sense in this case."}, {"author_name": "Nate", "gravatar_hash": "82672978d0ccb5752038523264f2f473", "author_url": null, "date": "Jul 22, 2010", "message": "This reminds me of an article I read not too long ago (can't find a link, sorry) about Midol's brand. Midol is mostly just acetomenophen, the same ingredient in a host of other OTC pain medications. However, their marketing presents them exclusively as a remedy for menstrual discomfort. This specialized branding gives consumers the impression that Midol is THE choice for menstrual discomfort, and as a result it enjoys a sizeable market share in that area. The article argued that it's better to be seen as THE solution for a specific need than it is to be seen as a general solution for many different needs."}, {"author_name": "Mike", "gravatar_hash": "40ae9225ba30ec54c91d430b2c921e03", "author_url": "http://www.domainsatretail.com/", "date": "Jul 30, 2010", "message": "Short domains are great if you want to brand it yourself. If your looking for search engine help, then keywords always make the domain pop out to a searcher looking for information.\n\nDefinately .com though. I would never really buy any other domain extensions unless it is country specific, or I have a brand and don't want squatters."}, {"author_name": "Ben Amada", "gravatar_hash": "497362af250bc8231b7f582a3c7c9742", "author_url": "http://allben.net/", "date": "Jul 31, 2010", "message": "In most cases, I think a series *is* better.  Assuming the brand is a strong brand, I feel more comfortable within that series since I know there is a certain level of standards being enforced.  It also automatically gets reputation and authenticity points.  There's a lot of junk out there that is on standalone sites which you won't find at branded locations.  By \"junk\" I mean either low quality, untrue statements, ulterior motives, etc."}, {"author_name": "Brendan Miller", "gravatar_hash": "16cb3584428bed67b10a33f628d5b009", "author_url": "http://catphive.net/blog", "date": "Aug 03, 2010", "message": "I actually really dislike having so many different stack overflow sites. It's annoying to ask a question on stack overflow, only to have someone try to tell you it really belongs on some other site.\n\nI'm not going to spend the time to check 3 QA sites. Usually if I ask a question on server fault, I forget about it, because I never visit that site. From a users perspective additional sites add zero value. It would be better if you guys just figured out how to scale stackoverflow, and ditched server fault and the other sites."}, {"author_name": "Super Aardvark", "gravatar_hash": "1be1b7cb305fab96dda8fc3b2ad591d2", "author_url": null, "date": "Aug 04, 2010", "message": "\"Right, and don’t include Whale Fart as any part of your domain name.\"\n\nThere goes my idea for a stackexchange site for marine gastroenterologists."}, {"author_name": "Mark Kaiser", "gravatar_hash": "8db2ca745f13a0f7961280ecd17d6e4e", "author_url": "http://softwarecheese.blogspot.com", "date": "Aug 31, 2010", "message": "There's no reason that you can't do both - brand individually, and provide a sort of catalog subdomain at xxxxxx.stackoverflow.com that redirects and/or masks appropriately.   \n\nChoosing individually branded now is a good step, especially given the limited influence of the stack overflow brand.   Once some of the individual sites start to rack up market credibility, you can definitely redirect some of that back to the \"series\" name.   \n\nWhale Fart."}, {"author_name": "Francesco Gallarotti", "gravatar_hash": "0c51caa689a5e7c5cb302d0769383115", "author_url": "http://www.gallarotti.net", "date": "Sep 06, 2010", "message": "may I suggest http://lastpawnstanding.com/ -- for a chess Q&amp;A :-)"}, {"author_name": "Ken", "gravatar_hash": "97d540da0aee796ba07e9420099552b4", "author_url": null, "date": "Oct 02, 2010", "message": "\"If you had no other information, which would you buy?\"\n\nI'd buy the one that didn't call me a dummy.\n\n\"When they see a shelf full of yellow dummy books, they mostly say, “yeah, a bunch of second-best books.”\"\n\nOr they say, \"!%@#$ my life ... even my bookshelf is calling me a dummy, 30 times over\".\n\n\"American audiences, generally, don’t trust series.\"\n\nI find that a strange conclusion to draw.  I would have said, \"Americans looking for authoritative information, don't trust books whose titles insult them\".  If James Peterson had titled his book \"Hey Moron Did You Forget the Yeast Again?\", I wouldn't have cared how good or unique it was.\n\nThe Dummies series was remarkable in that it was perhaps the first time (and certainly the most successful) that a book got away with this, and didn't utterly fail in the marketplace.  In the same way that startups shouldn't look to emulate Microsoft (because there's only one Microsoft, or ever will be), new websites shouldn't look to learn naming rules from such a uniquely-named series.\n\nIf the \"dummies\" book wasn't part of a series, I'd still rather have the one that didn't say \"for dummies\".  And if there was a book from the O'Reilly series available, I'd rather have that than pretty much anything else you put next to it.\n\nNow, I don't know that \"stackexchange.com\" is the right 'series' here, but I think a good top-level brand could be fine.  Everybody I know (techies and non-techies alike) use *.google.com services, even the services of theirs that are crap.  Wikipedia/Wiktionary/Wikiquote/etc are usually far better than even specialized websites, and I'll always go to them first if they have an article."}, {"author_name": "Tanvir Gaus", "gravatar_hash": "568ad8624185b1232ffe3f02df1bc70d", "author_url": "http://www.tanvirgaus.com", "date": "Nov 21, 2010", "message": "@jean moniatte - The http://www.instantdomainsearch.com is posted to GoDaddy.com so this tool is not a good one but the one that \"Scott W.\" sugessted - www.psychicwhois.com is a good one. it shows the registered or available instantly."}]}