{"response": [{"author_name": "a_m0d", "gravatar_hash": "ea6c23846a2ce0df1dcf549d55ee166d", "author_url": null, "date": "Jul 12, 2010", "message": "Thanks for this - its a great improvement.\n\nRegarding the new accepted answers badges, could you please explain them a little better?  I really can't understand exactly what you mean when you say \"Zero score accepted answers - more than 5 and 20% of total\""}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": "http://stackoverflow.com/users/20654/oscar-reyes", "date": "Jul 12, 2010", "message": "Me neither, you can tell the description comes from a programmer mind, because it make 100% for him, but when documented, it doesn't quite match. \n\nI mean, the description sounds like:\n\n acceptedWithZero &gt; 5 &amp;&amp; acceptedWithZero &gt; ( total / 5 )"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 12, 2010", "message": "> “Zero score accepted answers – more than 5 and 20% of total”\n\nYou have more than 5 zero score accepted answers, and zero score accepted answers make up 20% of your total accepted answers.\n\nYou can see why we didn't include the full text here, I hope.. :)"}, {"author_name": "a_m0d", "gravatar_hash": "ea6c23846a2ce0df1dcf549d55ee166d", "author_url": null, "date": "Jul 12, 2010", "message": "Sorry, I get it now. I assume that the \"zero score accepted answers\" are those which were accepted by the asker but have not been upvoted.\nAlso, would we \"lose\" (if that were possible) the badge if people suddenly upvoted our answers after the badge was awarded?"}, {"author_name": "jdhardy", "gravatar_hash": "ad24799da38da64c3b51b745087d60fd", "author_url": null, "date": "Jul 13, 2010", "message": "I think the zero upvotes might be too low a threshold - generally an accepted answer will also get an upvote from the asker, I would think.\n\nMaybe I'm just bitter because if it were 0 or 1 I'd be one accepted answer away from the Unsung Hero badge :)."}, {"author_name": "Tom", "gravatar_hash": "57e5e6066ca2c99d6a2a997ba30bcaf4", "author_url": null, "date": "Jul 13, 2010", "message": "Bloody finally."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jul 13, 2010", "message": "Excellent improvement"}, {"author_name": "Colin Pickard", "gravatar_hash": "463ef1b716cb5d6db0f5b43a07dd06d4", "author_url": "http://cpickard.net", "date": "Jul 14, 2010", "message": "Finally, I have a badge that Jon Skeet does not (and never will have)."}, {"author_name": "Tony", "gravatar_hash": "886427a445a180eb6618d77ee4ec4894", "author_url": null, "date": "Jul 14, 2010", "message": "logically I never understood why this feature wasn't there in the first place. I get notices that I got some kind of badge and i was never able to find out right there for what question. You said it was part of the game/fun. Sorry but I am not into this kind of games so i never wasted any time trying to find out. I am not into badges anyways."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Jul 15, 2010", "message": "Tireless and Unsung Hero sound like counter-intuitive badges.  In my experience, *most* posters will give a correct answer an upvote in addition to marking it as correct.\n\nMeaning that it's exceedingly rare to have a 0 upvote answer.\n\nNow, you've given people a reason to attempt reverse vote farming..."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Jul 15, 2010", "message": "Maybe not as rare as I thought... I have at least 20 0-vote accepted answers.  However, I have considerably more than that of 1-vote accepted answers."}, {"author_name": "Ryan", "gravatar_hash": "7500b505d8af63260b704b4e31b4a148", "author_url": "http://www.iactionable.com", "date": "Jul 16, 2010", "message": "Tireless and Unsung Hero don't really seem to fit the mold of encouraging desired behavior, especially with the X% of total requirement. In order to get it you might have to limit your participation in more popular categories or answer more questions with users who accept answers but don't vote on them (and hope they accept but don't vote). Shouldn't you instead try and find a way to encourage at least the question asker to vote for the answer they are accepting? I wonder how much of this is driven by people wanting to keep their % of questions with accepted answers number up. \n\nMaybe I'm just bitter from being a day or so away from getting Tumbleweed and then having someone leave a comment. I shouldn't have been disappointed that someone actually participated on a question I asked."}, {"author_name": "Joni", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Jul 21, 2010", "message": "\"In my experience, *most* posters will give a correct answer an upvote in addition to marking it as correct.\"\n\nYou're forgetting that new users can accept but cannot upvote due to lack of rep. So it's not *that* uncommon.\n\nI'm also interested in what a_m0d asked - is it possible to lose the badge after subsequently receiving upvotes? Also, are accepted answers (with 0 score) you posted to your own questions counted for this? Probably shouldn't be, eh?"}]}