{"response": [{"author_name": "mmyers", "gravatar_hash": "49f3a2065659f5b4efa05ae29bd0856a", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Jul 22, 2010", "message": "Will it be possible to migrate questions from Meta.SO to these other metas? Currently, all the meta sites are black holes for questions."}, {"author_name": "cannontrodder", "gravatar_hash": "10701e62fff85c082ba4cb2a08258479", "author_url": null, "date": "Jul 22, 2010", "message": "I thought you were losing your way with Stack Exchange but you've really turned this around and the new sites are excellent. I'll never doubt you again!"}, {"author_name": "Maxim Z.", "gravatar_hash": "319bd6ef9c9c8d876f731150cb4951c7", "author_url": null, "date": "Jul 22, 2010", "message": "With the new Super User and Server Fault metas, how do we decide whether to place a question on a site-specific meta or on MSO? Is the rule of thumb basically considering whether a question applies to more than one site?"}, {"author_name": "Smashery", "gravatar_hash": "04c4396f3d538f5aad32adb496467de3", "author_url": null, "date": "Jul 22, 2010", "message": "Where should bug reports be placed, then? I found a bug with meta.gamedev.stackexchange (for some reason not reproducible in any of the other meta sites I've looked at). I placed a bug report in meta.gamedev.stackexchange, but it doesn't seem to have been noticed. Should we be placing bug reports in meta.stackoverflow, then?"}, {"author_name": "matt", "gravatar_hash": "35fe1d8db79d0f9d10c87a0cbc4096af", "author_url": null, "date": "Jul 22, 2010", "message": "Sac-town for the Ewoks, how appropriate. Don and Mike would be so proud. That is, if they could make sense of any of this."}, {"author_name": "Charlie Somerville", "gravatar_hash": "bcb6acc9d0d9bef99e033b36c3d32ca9", "author_url": "http://charliesomerville.com", "date": "Jul 22, 2010", "message": "Calling the parent site 'parent' seems very... programmerish to me. I think a more accessible term for the wide audiences you're aiming for would be 'main site'."}, {"author_name": "Midhat", "gravatar_hash": "4c3faf6ee10a90c46875a5e5c9d8b637", "author_url": null, "date": "Jul 23, 2010", "message": "meta.stackoverflow.com is Washingon, DC \n\nYou are never gonna get farther than 50 metas!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 23, 2010", "message": "@cannon thanks!\n\n@smashery sorry about that, we lost track of that one bug request somehow on gamedev. Should be fixed now.\n\n\"I think a more accessible term for the wide audiences you’re aiming for would be ‘main site’\"\n\ngood idea -- \"parent\" vs. \"main\". Some say \"meta\" is too geeky but I don't agree with that. I can support \"parent\" though. I worry though that \"meta\" and \"main\" look way too similar as links.\n\n\"how do we decide whether to place a question on a site-specific meta or on MSO?\"\n\nIf it's about Stack Overflow *specifically* or an engine issue that affects all sites equally and universally as an \"engine issue\", then open it on meta.so."}, {"author_name": "Edan Maor", "gravatar_hash": "10aae09a71c08efc29b09b7a9cf8706d", "author_url": "http://www.loopycode.com", "date": "Jul 23, 2010", "message": "I like the way rep is inherited from the parent site (I noticed it without this post).\n\nHowever, I didn't know that the meta site doesn't affect reputation.\n\nThis is a pretty important thing, considering that it lets you vote and post more \"freely\", without worrying about rep.\n\nSo why not make it more obvious? Especially for us users coming from Stack Overflow, it behaves differently than expected, so it would be well worth pointing it out on the site itself."}, {"author_name": "Phil Pursglove", "gravatar_hash": "ee753c26051b3cc45094e20aa73b93a1", "author_url": "http://philpursglove.blogspot.com", "date": "Jul 23, 2010", "message": "Should the 'meta' links in the footers on SF and SU still link to MSO?"}, {"author_name": "Richard", "gravatar_hash": "95e28ac250c4604a6f9d7e34705c3259", "author_url": "http://rjcox.co.uk", "date": "Jul 23, 2010", "message": "It feels odd to get yearly on upvoting, having only just visited -- but makes sense with the shared rep.\n\n&gt; For now we are leaving meta.stackoverflow.com grandfathered in\n\nI think serious consideration should be given, once SE sites start moving out of beta, to the \"master meta\" being meta.stackexchange.com, and SO having its own. This would mean moving the current MSO as is (with all its SO specific Qs, but then this is already true for SU and SF Qs) and creating a new fresh MSO for SO alone.\n\nIn this way meta.stackexchange.com can focus on being the cross site and neutral ground where the other SE sites can come together without the distraction of SO specifics.\n\n&gt; meta.stackoverflow.com is Washingon, DC \n\nIndeed, but Washington is not also a state capital. Unlike say London (capital of UK /and/ England)."}, {"author_name": "Stefan Plattner", "gravatar_hash": "7847006dbf49f1722b07c8da396f1275", "author_url": "https://twitter.com/splattne", "date": "Jul 23, 2010", "message": "Great, thanks! \nStefan\n\nPS: I guess the news is worth a post on http://blog.serverfault.com/ ?"}, {"author_name": "badp", "gravatar_hash": "c81f585328c241594864f888f1154025", "author_url": null, "date": "Jul 23, 2010", "message": "At least we're not Detroit.\n\nhttp://www.youtube.com/watch?v=oZzgAjjuqZM"}, {"author_name": "paddy", "gravatar_hash": "539797c278ca74e367a99ca133f4b181", "author_url": null, "date": "Jul 23, 2010", "message": "Just a suggestion, but as you move away from more technical sites to the great unwashed of the interwebs, the term 'meta' might not be so well understood.  \n\nI'd suggest that you rename the link to something more generic, e.g. site discussion."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 23, 2010", "message": "> I think serious consideration should be given, once SE sites start moving out of beta, to the “master meta” being meta.stackexchange.com\n\nThis can't happen until all SE 1.0 sites are decommissioned, as meta.SE is the support site for SE 1.0.\n\n> as you move away from more technical sites to the great unwashed of the interwebs, the term ‘meta’ might not be so well understood\n\nI'm ok with doing a tiny bit of education, since we have to educate people about how the Q&A format is supposed to work. (or deprogram them from Yahoo! Answers, I guess)"}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Jul 24, 2010", "message": "You knew I'd weigh in with my two cents right?\n\nWell, I can honestly say that this will help alleviate some of the SF/SU-specific questions from Meta. I don't think the difference will be noticeable right away... but it'll come with time.\n\n(Captcha: 'this momentum'.... weird)"}, {"author_name": "Kyle Brandt", "gravatar_hash": "392ee4063cc5e6cc4d0cdb5f658bcfa8", "author_url": "http://www.kbrandt.com", "date": "Jul 24, 2010", "message": "@Stefan:  Thank you for the good idea :-)\n\nhttp://blog.serverfault.com/post/854083522/meta-serverfault-com-a-place-to-talk-about-server"}, {"author_name": "Abel Braaksma", "gravatar_hash": "80e497ec2173c1a6a4f28f0aec5a77a8", "author_url": "http://www.undermyhat.org", "date": "Jul 26, 2010", "message": "To me, the word \"Meta\" implies something bigger, something that came before, something superimposed, that encompasses everything.\n\nUsing \"parent\" for the main site then somehow juxtaposes the meaning of \"meta\", instead of what is implied by \"parent\": that there's a parent/child relation.\n\nI've always considered the main forums the children of the meta's, which is where eggs are being hatched to become little twingly birds when they are allowed to leave the nest. Maybe \"(family) heirs\" or \"descendant\", instead of the ill-reversed \"parent\"?"}, {"author_name": "John Woo", "gravatar_hash": "611e5654f2845882dbb9b0c1af317f95", "author_url": null, "date": "Jul 27, 2010", "message": "Posts like this are why I love this site."}, {"author_name": "Lasse Vågsæther Karlsen", "gravatar_hash": "1b11262da6d1cd26b1b0bc99a2620cee", "author_url": "http://blog.vkarlsen.no/", "date": "Jul 30, 2010", "message": "How about \"careers\"? Will this side-site be transplanted onto the stackexchange sites as well? careers.photo.stackexchange.com for instance? Perhaps for some sites it would be a bit weird to consider a career in the topic (careers.sex.stackexchange.com?) but many sites might benefit form having a dedicated site to job listings and searching. I'd imagine you could close down whole swats of craigslist with a move like that."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 01, 2010", "message": "@lasse if the audiences are professional and can benefit from it, we will potentially develop careers.* sites for them."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Aug 02, 2010", "message": "@Abel Braaksma:\n\nMeta for a site contains the metadata for that site."}]}