{"response": [{"author_name": "Sam152", "gravatar_hash": "d9d3bffa0ca503c495b2461881688467", "author_url": null, "date": "Jul 09, 2010", "message": "I really like the way different designs are being played with, while keeping true to the SO way. I'm glad you hired some someone to create unique designs for each of the Stack Exchange sites instead of just tweaking some of the CSS a little."}, {"author_name": "Alex Andronov", "gravatar_hash": "542f45519ec27c8147da98b9226f331c", "author_url": "http://www.gamboling.co.uk", "date": "Jul 10, 2010", "message": "Robert just a thought on the blog theme here. With lots of people posting now it would be really neat if the author could be up at the top. No biggie though."}, {"author_name": "John Ferguson", "gravatar_hash": "b67e77f0ebfd02feab11af0a6175e0dc", "author_url": null, "date": "Jul 10, 2010", "message": "\"Prefer non-hyphenated names.\"\n\n:)"}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Jul 10, 2010", "message": "I think that #1 and #7 will be that absolute essential questions that determine the life or death of any of these communities.\n\nKeep us informed of whatever publicity efforts you detect within these communities.  The Gaming crowd might not follow the Food and Cooking meta site (and vice versa) but both might gain from hearing of the other's successful promotions, even though they are unlikely to be directly reproducible."}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": "http://echoreply.us/tech/", "date": "Jul 10, 2010", "message": "Robert, why not start off every new meta site with these questions already present, but owned by the 'Community' user?"}, {"author_name": "Robert Cartaino", "gravatar_hash": "9dfd656461a1d0a2db33f3ed4183f4c0", "author_url": "http://stackoverflow.com/users/98786/robert-cartaino", "date": "Jul 10, 2010", "message": "@Tim Post: \n>why not start off every new meta site with these questions already present\n\nWe considered that (it may happen, you never know). But there is something to be said for letting the community ask these questions of themselves. There is more a sense of ownership when the community takes it upon themselves to ask (and resolve) these questions... rather than just answering some \"form letter\" we post as part of a requirement by us.\n\nHence, the idea of the blog post to urge users to ask these questions of themselves.\n\n\n@Alex Andronov: I agree. With the proliferation of guest bloggers, we need a better way to identify who is speaking.\n\n\n@John Ferguson:\n> “Prefer non-hyphenated names.” :) \n\nHa! I was wondering if anybody would pick up on that."}, {"author_name": "Jon", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jul 10, 2010", "message": "\"celebrities in their field\"\n\nCelebrities... I think not.  You guys wouldn't be anywhere withou the community, so please with the sounds of your trumpet already."}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Jul 10, 2010", "message": "@Jon\n\nYou are right, the community is what makes SO great, and the team has been singing that refrain from the beginning.  But there is a reason, beyond good software, than such an excellent community has gathered at this particular site.  \n\nSo don't miss this key point:  Joel and Jeff ran an excellent extended promotional campaign, through their blogs and podcasts.  Robert is making it very clear that the SE team is not able or willing to do the same for each and every SE site . . . but someone has to do it."}, {"author_name": "furrykef", "gravatar_hash": "744b845df3d341a7f5009fe1b30ec80e", "author_url": null, "date": "Jul 11, 2010", "message": "Without communities, there wouldn't <em>be</em> celebrities. You can't be famous in any sense of the word unless there's a community in which you are famous.\n\nSo I think saying \"You guys wouldn't be anywhere without the community\" is stating the obvious in more ways than one."}, {"author_name": "Davidh", "gravatar_hash": "d18676ccb3ab109bae406958d07f603f", "author_url": null, "date": "Sep 02, 2010", "message": "Can't post on the domain name yet but why not Ubuntu.us ?\n\nIt could only be hosted in the us but if thats not a problem it be a nice simple name! .US!"}]}