{"response": [{"author_name": "Alexander Kojevnikov", "gravatar_hash": "bd319cfb666b090230d12d3d3284d018", "author_url": "http://versia.com", "date": "Apr 28, 2008", "message": "You're an optimist, Jeff! :P It should take some time before you will see any significant load on this server.\n\nBTW, why have you chosen Windows/IIS and not Linux/Apache? ASP.NET I suppose?\n\nAnyway, good luck with your venture, I like the idea very much!"}, {"author_name": "James Devlin", "gravatar_hash": "8ca7425c8a9da807b9bf6934f10d59fa", "author_url": "http://www.codingthewheel.com", "date": "Apr 28, 2008", "message": "As if Linux/Apache is (or should be) the default? It's not 2002 anymore! Windows/IIS is a first-rate server platform! By the way Jeff, looks good, and eagerly anticipating the new site.."}, {"author_name": "Michael", "gravatar_hash": "a83ecb74b1e755f9d34cd6599a8e6e18", "author_url": "http://www.Stum.de", "date": "Apr 28, 2008", "message": "Excuse the ignorant question, but why only so little RAM? Will it also run the database or is the a pure Web Server Slave?\n\nAnyway, I am anticipating stackoverflow, the annoying \"Please pay to see this answer that may help you\" Expert Sey Change ads keep polluting Google search results quite heavily :("}, {"author_name": "Salman", "gravatar_hash": "9af868b673e089e603b242c995e5593a", "author_url": "http://www.csharpfriends.com", "date": "Apr 28, 2008", "message": "Jeff,\nThat server is pretty impressive, I checkout out crystaltech's site and they don't seem to have a server with simliar specs? \nThe closest one was $350/month"}, {"author_name": "Eddie", "gravatar_hash": "db9af07e3524e2fa63530959d9948825", "author_url": null, "date": "Apr 28, 2008", "message": "I don't know why commentators keep questioning Jeff using IIS/Windows Server. It clearly works fine and Jeff has experience in that domain, so why should he flipflop to Apache/Linux when he has a perfectly suitable solution that he has heaps of experience with?"}, {"author_name": "Mat", "gravatar_hash": "c0389b4b6d15258ada2d27de1b0dc9b8", "author_url": null, "date": "Apr 29, 2008", "message": "@Eddie: Absolutely.  I develop on the LAMP stack and have years of experience with it.  Even if you proved to me that ASP.NET on IIS was a vastly superior choice I'd still use Linux.\n\nWhen starting your own business you are already taking a lot of risks and learning new things all over the place. It would be pretty foolish to compound the problem unneccessarily."}, {"author_name": "Moya", "gravatar_hash": "c05bbb76cc8b9a160f3af3f48c40e275", "author_url": null, "date": "Apr 29, 2008", "message": "&gt; That server is pretty impressive, I checkout out\n&gt; crystaltech’s site and they don’t seem to have a\n&gt; server with simliar specs?\n \nIt's the \"RAID 5 Dual Quad-Core\" option. \n\n \t  \t2  1.8GHz Intel® Xeon® Quad-Core\n\t  \t271GB SAS Hard Drive\n\t  \t2GB RAM (expandable*)\n\t  \t1,250GB Bandwidth\n\t  \t$200 adCenter Credit\n\t  \t10 server(s) available\n\n$500 per month"}, {"author_name": "Karl", "gravatar_hash": "6f448664cd294829b9ed0cd356f91cb1", "author_url": "http://www.codebetter.com/", "date": "Apr 29, 2008", "message": "We've used Rackspace a lot in the past, and while they truly are fanatical, in most cases the premium isn't justifiable (unless you're a shop with zero I.T. competencies).\n\nWe've switched over to SoftLayer recently and have a very similar set-up - it appears to be slightly cheaper, and SoftLayer appears to be better recognized - haven't been with them long enough to say for sure though. I will say this: they have an awesome iSCSI feature that we use to store all types of stuff on, and are currently experimenting with using it as the storage location for our MySQL database. \n\nOf course, hosts are a dime an dozen and it's easy to find a good one :)"}, {"author_name": "Ray", "gravatar_hash": "862ef90b81f9d7f365c85d8173d54beb", "author_url": null, "date": "Apr 29, 2008", "message": "Michael, you realise that for experts exchange you just scroll to the bottom to see the answer without paying?\n\nYes their site really annoys me too, and am looking forward to stackoverflow. Is going to be interesting to see it built up as well, and am glad that Jeff and Joel are documenting the process."}, {"author_name": "Michael", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "May 01, 2008", "message": "@Ray: \"Michael, you realise that for experts exchange you just scroll to the bottom to see the answer without paying?\"\n\nThat does not work anymore since quite some time. They now removed it, and it only shows:\n\"All comments and solutions are available to Premium Service Members only.\n\nStart your 7 day free trial and see for yourself why Experts Exchange is the easiest and most proven technology resource in the world. Get Started\n\nAlready a member? Login to view this solution.\"\n\n\nPreviously, you could use Google Cache to view the answers before they decided to make them available to premium members only, but now more and more sites fall out of the cache."}, {"author_name": "Michael", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "May 01, 2008", "message": "Ignore that last comment, apparantly it is now possible to scroll even more down to see the solution. Never realized that, thanks for the tip!\n*blush*"}, {"author_name": "Bob Rose", "gravatar_hash": "6353a567e99015a1d70cedee7ac7dc1c", "author_url": null, "date": "May 05, 2008", "message": "Very cool, I found this from Joel's site.  Looking forward to seeing it up.  Have you looked at using Google App Engine or Amazon's cloud environment?  Would be a nice proof of concept to build and host this as a cloud application.\n\nDisclosure: I work for Google (not the App Engine team, though). ;-)"}, {"author_name": "Ted Glick", "gravatar_hash": "8ac1af2b7ebaea0eb4dc0305aa62ab58", "author_url": null, "date": "May 07, 2008", "message": "Love you guys, love the concept, I look forward to each new podcast, and I'm looking forward to watching this venture develop (pun intended).\n\nOne small critique.  Joel, for the love of God, please stop stepping on Jeff during the podcasts!  Let him finish his sentence, *then* you speak.  I appreciate your enthusiasm, but in our civilized world, this is how it works--we take turns talking.  We don't interrupt another speaker because it's annoying to the speaker and the listener(s).\n\nPerhaps there are meetings and support groups for this affliction?  Interrupter's Anonymous?  \"Hi, my name is Joel and I'm an interrupter...\"\n\nSeriously, you're both brilliant and I appreciate your enlightening words in any form.  Thank You."}, {"author_name": "Chris Lively", "gravatar_hash": "e2e5ae48ba8cb80b89bbc5fb14c8f8f8", "author_url": "http://www.livelyconsulting.com", "date": "Aug 06, 2008", "message": "I find it interesting that you link to an article on paying only $1750 for a solid piece of hardware, then turn around and rent a similar server for $500/month..."}]}