{"response": [{"author_name": "Sean", "gravatar_hash": "caaaf05cd3770dd82548cf3ada462bf9", "author_url": null, "date": "Apr 22, 2008", "message": "Thanks for the podcast. It explained what I saw as the largest hurdle that you two will face: How do you make this site better than other Q&amp;A sites?\n\nMaintaining content so that correct answers remain correct (or, are later corrected) is the key. You could have dancing monkeys in the background and I would still visit the site for up-to-date answers."}, {"author_name": "Martin Marconcini", "gravatar_hash": "81605bd0acefe569da6f9d93a684b156", "author_url": "http://gryzor.wordpress.com", "date": "Apr 22, 2008", "message": "Why do you use 20 queries. 0.277 seconds. to display this simple page? :) Jeff you can certainly do better than that. :)"}, {"author_name": "John Lawson", "gravatar_hash": "2d8ec7d21d76283c4de46d19adb9ecdd", "author_url": "http://erator.blogspot.com", "date": "Apr 22, 2008", "message": "Looking forward to more podcasts and more great content from two of my favorite programming bloggers."}, {"author_name": "Tim McNeil", "gravatar_hash": "73824acea976c386f909a595ced9c092", "author_url": null, "date": "Apr 22, 2008", "message": "Jeff &amp; Joel,\n\nI'm a regular reader of your blogs both of which I enjoy.  But I am hearing-impaired and podcats just don't do much for me.\n\nTx!\n\nt."}, {"author_name": "Anonymous", "gravatar_hash": "be2692d3028119761c7260f9fc35464b", "author_url": "http://www.anonymous.org", "date": "Apr 22, 2008", "message": "It would be better if you guys can just blog about the main points covered in your podcast. Like for example, how would this site be different from CodeProject?"}, {"author_name": "Dave Katz", "gravatar_hash": "4cb141e99bdd537a4207788d7e99bf5b", "author_url": null, "date": "Apr 22, 2008", "message": "you should name the podcast stackoverflow++"}, {"author_name": "kevin", "gravatar_hash": "af0c0f120ded1fa94dee488bd6b70f5a", "author_url": "http://scribesonic.com", "date": "Apr 22, 2008", "message": "Guys, great podcast. reminds me of gruber's and benjamin's \"The Talk Show\" and the free form style. \n\nJust a suggestion (if you have the time) - provide a summary and links to the items you discuss in the podcast is a great feature for the users.\n\nMichael Trier over at \"This Week in Django\" does a great job with this. Here's an example - http://blog.michaeltrier.com/2008/4/22/this-week-in-django-19-2008-04-20"}, {"author_name": "Josh", "gravatar_hash": "df1f85da7222e067d4544f314e833ea5", "author_url": null, "date": "Apr 22, 2008", "message": "Great podcast!!! I'm excited about the community and the other podcasts to come.  Keep up the good work."}, {"author_name": "Vincent", "gravatar_hash": "dfb823ad59e37aaa21f94924a064523d", "author_url": null, "date": "Apr 22, 2008", "message": "Really looking forward for www.stackoverflow.com. The idea of depreciating threads when new technologies come out or by versioning things will be good. I am sick of finding old 2000 articles/tips about XML and .NET Framework 1.0.\n\nInteresting podcast, but it sounds a bit too diggnation like. Stop talking about everything and talk about the product itself."}, {"author_name": "Bil Simser", "gravatar_hash": "ccd2cb208bf8f9e680d5a96ba5f62065", "author_url": "http://weblogs.asp.net/bsimser", "date": "Apr 22, 2008", "message": "Hi guys,\n\nBrilliant podcast. I love the 20 minute discussion on minimalist design. I'm all about this and really like the things you guys brought up around hardware design. Site is nice and clean. Keep the model, it just works."}, {"author_name": "Nathan Bowers", "gravatar_hash": "8ef1faca1032b44b8ca486a4e52501ed", "author_url": "http://nathanbowers.com", "date": "Apr 22, 2008", "message": "I listen to a lot of podcasts and these are my most persistent gripes with them:\n\n1) No way to permalink to specific times in most players. If I want to link to you I'd much rather link to the relevant portion. GoogleVideo (not YouTube oddly) does this with a simple #permalink syntax.\n\n2) Limited or absent shownotes. In a perfect world the main points of the podcast would also link to the permalinks described above.\n\n3) Audio quality. You guys did a good job, but the volume and quality was a little uneven. Maybe see Leo Laporte's page on how he produces podcasts.\n\n\nTwo thoughts your site design:\n\n1) Where's the explicit \"Subscribe to podcast\" button? \n\n2) I like that the site design is minimal. Only complaint: the comment text is light gray on white.\n\nReally enjoyed the podcast, looking forward to more!"}, {"author_name": "Name", "gravatar_hash": "7daf6c79d4802916d83f6266e24850af", "author_url": null, "date": "Apr 22, 2008", "message": "While I understand that XHTML is all the rage among web 4.0 sites such as this, why declare it as the doctype when you send the page using the \"text/html\" MIME-type? If you want to use HTML, just declare as HTML."}, {"author_name": "Zorro", "gravatar_hash": "b7616e9e390ba2fb0842cf47e4374760", "author_url": null, "date": "Apr 22, 2008", "message": "It looks promising.  As information grows, you may need to consider recruiting experts in different areas to maintain the information and make sure it remains accurate and up-to-date.\n\nThanks for the podcast!"}, {"author_name": "Mike", "gravatar_hash": "29d7c49f6f174710788c79011219bae1", "author_url": "http://www.mangst.com", "date": "Apr 22, 2008", "message": "No, 45 minutes is definitely not too long.  Keep it that way!"}, {"author_name": "Brian", "gravatar_hash": "7eb788f6132eac5f7b8ca5b43924ad42", "author_url": null, "date": "Apr 22, 2008", "message": "Two idols together in one podcast, awesome.  It was great listening, keep up the good work!"}, {"author_name": "Fábio Gomes", "gravatar_hash": "5c951404673ae426a82c0b0e1f385d34", "author_url": "http://yacoding.blogspot.com", "date": "Apr 22, 2008", "message": "@Dave Katz\n  you should name the podcast stackoverflow++\n\nYes, but first they need stackoverflow+ so it can evolve to ++ :)"}, {"author_name": "Adam", "gravatar_hash": "803804d09f56d522d90478a2277effbb", "author_url": null, "date": "Apr 23, 2008", "message": "Podcast player app doesn't let you skip forward.\n\nLove the radio talk show aesthetic.\n\nCould use a notch at about 3k."}, {"author_name": "DonLiang", "gravatar_hash": "252c60f0cdf03b491051908155612a61", "author_url": null, "date": "Apr 23, 2008", "message": "Awesome!I like this website and all podcasts here. And specially, I want to say thanks to the translator. As a international reader of your site, English is not my first language, so it seems that there are some difficulties for me to understand what you say in the first time. So, the transcript is useful and helpful."}, {"author_name": "Prakash", "gravatar_hash": "f1623049a1ce2d0b6d21a840c49829e1", "author_url": null, "date": "Apr 23, 2008", "message": "Its really a great idea! I am really excited and have a very good feeling that this will turn out to be very cool &amp; useful to the developer community. \n\nI've been constantly reading both your writings for a long time. And its really nice and interesting to associate a voice for your wordings.. Joel sounds as authoritative as he writes. Jeff has stronger effect with writing.. I feel this is the case with many.. \n\nanyway, I'll stay tuned and contribute my 2 cents, ofcourse, in writing, not speaking ;)"}, {"author_name": "rogthefrog", "gravatar_hash": "b8f5d14de79c34efc885a26852f1ee95", "author_url": "http://www.rogthefrog.com/b/2008/04/stack-overflow-a-promising-ide.html", "date": "Apr 23, 2008", "message": "This is a very interesting concept. I wrote up a few suggestions on my blog, although I'm sure you guys are awash in requests already.\n\nhttp://www.rogthefrog.com/b/2008/04/stack-overflow-a-promising-ide.html"}, {"author_name": "Jess Robinson", "gravatar_hash": "ec4eb9ff86a6c9ba57ba1ddc6f6bd2a2", "author_url": null, "date": "Apr 23, 2008", "message": "Well, the idea and the website all sound quite interesting, but I failed to listen to the 1st podcast all the way to the end.. After about ten minutes I realised I wasnt really picking up on any useful/interesting points, and it droned a bit.. I just got bored.\n\nI'll go attempt to read the transcript now. I hope there's an edited version somewhere too."}, {"author_name": "Derek Morrison", "gravatar_hash": "9fed4b48a3837b75946b616fdffe7bfe", "author_url": "http://derek-morrison.com", "date": "Apr 23, 2008", "message": "Oh no! I have a lot of respect for Joel's writings and yet now I see that he's kind of a bad conversationalist!  Maybe it was just his mood or the time of day, and I'm hoping this gets better. While I liked the general content, I was irritated to hear Jeff's calm and logical  speech interrupted and derailed at several points by Joel's semi-rambles.\n\nI deeply appreciate the effort and hope that you guys continue - I just would really like to see improvement here (but really, I guess, can you change the way a person converses? :) This seems to happen in many podcasts, I suppose, just as it happens in many conversations."}, {"author_name": "Adam", "gravatar_hash": "138ff4551a1195871e9b1b18d8a1c504", "author_url": null, "date": "Apr 23, 2008", "message": "I've been reading both Joel's and Jeff's blogs for awhile, but never heard them speak.  Their voices don't match the ones I've made up in my head for them. It's a a little weird and I'm not sure I'm prepared for it."}, {"author_name": "Craig Ogg", "gravatar_hash": "b96fa9456e2ceb16aa29863f5e534004", "author_url": "http://blog.clubgrub.com/", "date": "Apr 23, 2008", "message": "I think the correct link for the podcast only feed should be:\n\nhttp://blog.stackoverflow.com/index.php/feed/podcast\n\nThe link that is in the sidebar now and on Joel On Software doesn't work (it returns the same thing as index.php alone)"}, {"author_name": "Chris", "gravatar_hash": "5796cb83a9abf0244d4e2eb295999368", "author_url": null, "date": "Apr 24, 2008", "message": "Great content, but the audio quality is really bad. Please get some good mic's!"}, {"author_name": "Chris Atkinson", "gravatar_hash": "79dd74fb116dcd01bbeb8294b76b88b1", "author_url": null, "date": "Apr 24, 2008", "message": "Fantastic job guys, i look forward to future episodes."}, {"author_name": "ralph", "gravatar_hash": "3968de1c6f604a9846f2219889e7cbd1", "author_url": "http://www.embeddedincork.net", "date": "Apr 25, 2008", "message": "When playing the podcast using the in-built player I just get speeded up 'chipmunck' noise.  I've tried with both IE and Firefox on Vista as well as using the popup player.  Not sure where the problem lies, but just thought I'd let you know in case it's affecting more people than just me,\nRalph"}, {"author_name": "FM", "gravatar_hash": "139cb628cee330640f9bccee52608c06", "author_url": null, "date": "Apr 26, 2008", "message": "Hey guys, I just wanna say that was so good, I felt like having a chat with my geeky friends in pub in this saturday night (it's a good thing!) and just want to let you know that was so good. \n\nAlso stackoverflow ideas seems like quite nice one, wiki sort of functionality can provide some great benefits.\n\nNow moving to the second podcast..."}, {"author_name": "George", "gravatar_hash": "10cd46e2fadb04e1e000aa8af1f8c0e9", "author_url": null, "date": "Apr 27, 2008", "message": "Sounds like this project could be very promising.... although the podcast was a bit stream of consciousness.  It was nice to hear that someone else has the same frustrations I've had - webpages with no DATESTAMP.  Even some \"online magazines\" omit this (I guess they don't want to seem \"dated\".  It would of course also be helpful to give the version/release number of the language/software in question and even a link to the vendor or standards body documentation when appropriate.\n\nSmall nit - I think it was Jeff that said \"OS Ex\"... the approved, Jobsian pronunciation is \"OS TEN\".\n\nGood luck."}, {"author_name": "Hass", "gravatar_hash": "8dd91d1af82a6e207d2cb348db78ee01", "author_url": null, "date": "Apr 28, 2008", "message": "Regarding the discussion of Vista:\n\nI really like Vista. Yes stuff has moved but I think it is much more intuitive to use and it took me no time at all to adapt. A bit like Office 2007 and 2003. The ribbon is confusing to begin with but it is so much better once you get used to it!\n\nThe photo-album is also a great application with tagging. The search indexing function is also great. \n\nI think the problem is that advanced XP users aren't willing to invest the time needed to learn the new system (although they invest more time in learning Leopard)..."}, {"author_name": "McDowell", "gravatar_hash": "cf02ac6dae1a5494913e0c0c9d9956d7", "author_url": "http://illegalargumentexception.blogspot.com/", "date": "Apr 28, 2008", "message": "This is an interesting idea, but I would like to hear more about the scope of the project. How do you envisage the process of problem solving working? I would like to see some examples, even if they are fairly idealized and abstract.\n\nI can see a number of issues and have a few ideas, but it is difficult to judge their applicability because the proposal is very vague."}, {"author_name": "Will", "gravatar_hash": "9a0bc802c772e5e5fdf8c76ffa81bbca", "author_url": null, "date": "Apr 28, 2008", "message": "I look forward to the website and hope that it is innovative. \n\nFYI: The angle at which the wall and ceiling meet is 90 (not 45)."}, {"author_name": "miguel", "gravatar_hash": "807912de050ae79b60c39830eb91d38c", "author_url": null, "date": "Apr 28, 2008", "message": "it's a lock certain guarantee that stackoverflow will be my favorite web site."}, {"author_name": "Sébastien", "gravatar_hash": "3197aa6cd4214fa0839e66bda0246438", "author_url": null, "date": "Apr 30, 2008", "message": "Thanks for the podcast, it was really interesting/funny to listen to you two. \n\nI enjoy reading your blogs and I hope you'll bring more good things on the stack before the overflow ;)"}, {"author_name": "Telcontar", "gravatar_hash": "2e4370b1aedee8c3fbaacfcb7519f16e", "author_url": null, "date": "Apr 30, 2008", "message": "I only write to thanks the persons who transcibe the podcast. i'm from spain and i'm not very good undestanding english conversations or writting it, but i read english well.\n\noh, and stackoverflow is such a great idea. i hope i cna contribute in java area ( but sorry, desktop is my speciality)"}, {"author_name": "Tal Einat", "gravatar_hash": "cd6aae9615c3b36130e2470902833a72", "author_url": null, "date": "Apr 30, 2008", "message": "Late in replying, but still...\n\nYou mentioned two things programmers do when they hit a problem - ask a mailing-list/forum or search Google. I just wanted to jump in and say - don't forget IRC channels!\n\nGood luck, looking forward to seeing this idea grow :)"}, {"author_name": "Jason", "gravatar_hash": "419c5124df7830315c268181978944ae", "author_url": "http://blog.jasonnussbaum.com", "date": "Apr 30, 2008", "message": "Hey - great job, guys. This is a really excellent thing you're doing.\n\nJoel - your issue with the Dell and WMI memory hogging could be caused by Dell's Quickset software. I'm running an XPS M1710 and was having similar issues until I got rid of Quickset (running Vista Ultimate).\n\nHope that helps you..."}, {"author_name": "benc", "gravatar_hash": "f3bfbe6f862c6a104cc9196c1270fe10", "author_url": null, "date": "May 12, 2008", "message": "I'm hoping we can have pages that discuss various topics about implementing things that are very common.\n\nFor example, I'm amazed how many people store phone numbers as numbers in their database.\n\nOr how many people have really bad hostname validators. For example, stackoverflow++ is (sadly) not a valid domain name."}, {"author_name": "aristo", "gravatar_hash": "9ef70ae2dd5d2ac960125115cf80b32f", "author_url": "http://www.aristo-samar.com", "date": "Jun 09, 2008", "message": "I was very excited reading about this site at work.\nI can't have streaming media at work so I had to wait to get home and start first cast.\n\nNo offence please... I had to breake first partt.\nIt is great in terms in content and technical value and so on...\n\n..but is sucks. Simply because you two don't go along.\nIt is not nice to listen it. It looks like you both competite each other. It st not a friend talk. It is \"who is more funny, professional and so on\" talk.\n\nReally no offence. It sucks for me. I dont see long future for this unless you not gonna change something here.\n\nI read Jeff's blog for years now and I enjoy it. So, it is not another stupid angry person, who wants to say something bad or swear a bit and let others see that. I am really not like that.\n\nMaybe I just was expecting something different.\n\nI will of course listen to all of the casts, only because it is something I will learn from I hope...\n\nMariusz"}, {"author_name": "Peter Bromberg", "gravatar_hash": "71eb496730e6b1c90eea75f84a939849", "author_url": "http://petesbloggerama.blogspot.com", "date": "Sep 09, 2008", "message": "Guys, I am interested in what Stackoverflow is but I really think podcasts suck. I don't think I've ever listened to an entire podcast, they are so linear like TV. You can't search them, and google can't index them. How about a good old fashioned blog post?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 10, 2008", "message": "Peter, check out the wiki transcriptions of each podcast:\n\nhttp://stackoverflow.fogbugz.com/default.asp?W4"}]}