{"response": [{"author_name": "Daniel Pritchett", "gravatar_hash": "c7ecd0a49930872f14eb226ac9c813ac", "author_url": null, "date": "Apr 29, 2008", "message": "Embedded audio speed is all wonky, only the download link worked properly for me.  Otherwise I am happy.\n\nNow help me figure out how to enjoy podcasts with a screen-less MP3 player (1st-gen shuffle)!"}, {"author_name": "Nick Malaguti", "gravatar_hash": "bbb5a65a42baeda94f609b94e13fdf73", "author_url": "http://baudrate.wordpress.com/", "date": "Apr 29, 2008", "message": "Oh c'mon, what's wrong with Lisp?\n\nOn a more serious note, thanks a lot for your response to my question. I assumed that things were better on the outside, but from what you've said I guess I should appreciate the academic atmosphere. I'll definitely look into that book, I think it'll be a great help in a lot of areas here.\n\nAlso, thanks Joel for the offer of free FogBugz for a semester. I had signed up and played around in it but was worried about a monthly charge. I'll drop you a line as soon as we get started."}, {"author_name": "Brian Mitchell", "gravatar_hash": "bcb1f0bbff7f075c9d783be7ab92372a", "author_url": null, "date": "Apr 29, 2008", "message": "On the difference between computer science and software engineering, a quote that always comes to mind is the one from dijkstra, \"Computer Science is no more about computers than astronomy is about telescopes.\""}, {"author_name": "Vishnu Vyas", "gravatar_hash": "a7478c8203f42fed060b2f2de7935328", "author_url": "http://vishnuvyas.com", "date": "Apr 29, 2008", "message": "The uses of recursion is not just limited to compilers, it is used in lots of common algorithms that most people take for granted - a good example is quick sort, a very common sorting algorithm. \n\nOther algorithms, such as a binary search, next permutation, algorithms on trees and graphs, etc.. can easily be expressed using recursion."}, {"author_name": "Merus", "gravatar_hash": "b7e35651f25986c1c6f61ffca814b640", "author_url": null, "date": "Apr 29, 2008", "message": "Recursion's commonly used for trees, and because trees turn up everywhere in computer science (file systems, for example), recursion turns up everywhere.\n\nDon't make the mistake I made in one of my interviews and claim that recursion is interesting but not that useful!"}, {"author_name": "required", "gravatar_hash": "a87455bedb0a978f57ecd736a687a511", "author_url": null, "date": "Apr 30, 2008", "message": "&gt; The transcript wiki for this episode is available for public editing.\n\nAmazing. You really expect other people to do your work for you."}, {"author_name": "Jeff Atwood", "gravatar_hash": "e9da1ed3cdab00371ed1c2ff4520907c", "author_url": "http://www.stackoverflow.com/", "date": "Apr 30, 2008", "message": "> Embedded audio speed is all wonky\n\nI was able to repro this in a virtual machine of XP running IE 6. The culprit is an out-of-date flash installation -- try updating your Flash at\n\nhttp://www.adobe.com/shockwave/download/download.cgi?P1_Prod_Version=ShockwaveFlash"}, {"author_name": "Bernard", "gravatar_hash": "5f0f45f18483a469c48afabf02663d57", "author_url": null, "date": "Apr 30, 2008", "message": "'Required', this is the internet, people will or they won't. No one is forcing anyone to do anything they don't want to do."}, {"author_name": "Hass", "gravatar_hash": "8dd91d1af82a6e207d2cb348db78ee01", "author_url": null, "date": "Apr 30, 2008", "message": "Regarding the logo, I like this one best:\n"}, {"author_name": "Hass", "gravatar_hash": "8dd91d1af82a6e207d2cb348db78ee01", "author_url": null, "date": "Apr 30, 2008", "message": "This time with the link:\nhttp://99designs.com/contests/6774/entries/436307.gif"}, {"author_name": "Hass", "gravatar_hash": "8dd91d1af82a6e207d2cb348db78ee01", "author_url": null, "date": "Apr 30, 2008", "message": "Too late with the Logo posts - please feel free to remove them.\n\nRegarding the podcast; It seems that Joel talks about 70% of the time, maybe you guys should have some kind of chess-stopwatch to make sure you get even amounts of airtime ;)\n\nOtherwise the best podcast yet so I might just carry on listening..."}, {"author_name": "Calvin", "gravatar_hash": "a472c9f07de061f0735adcb1e46ada1f", "author_url": "http://tehdevs.net", "date": "Apr 30, 2008", "message": "^I agree that Joel talks most of the time.  \n\nGot really tired of hearing about FogBugz, Wasabi, etc., too."}, {"author_name": "Mr. Shiny &amp; New", "gravatar_hash": "d78a43ac94c1c0d6cf5740efd7574928", "author_url": "http://eternalephemeron.blogspot.com", "date": "Apr 30, 2008", "message": "Re: Computer Science vs. Engineering: Engineering in Canada is a regulated profession and generally has a specific meaning beyond the type of \"science\" that is involved: a civil engineer isn't just physics major and isn't a construction worker but is in between and is also regulated; not just anyone can call themselves a civil engineer and build a building.\n\nAt University of Toronto we have two related curricula: Computer Engineering (with Software Engineering as an optional specialization) and Computer Science.  A computer engineer grad can take some tests and become certified as a Professional Engineer which confers additional responsibility.  In the software world this responsibility is largely wasted but may one day be required for certain high-risk projects such as safety-critical systems.\n\nComputer science is about the fundamentals of technology, such as recursion vs iteration, performance, etc.  Software Engineering is about engineering: risk management and mitigation, and how to guarantee success in a project.\n\nAs for the rest of the Computer Engineering curriculum it differs from Computer Science in that there is a broader focus on hardware and building things and working in teams, whereas the computer science curriculum is structured differently and has fewer required courses.  In CE almost every single course is technical, in CS you only need a certain fraction of your courses to be part of your \"major\"."}, {"author_name": "Ian Patrick Hughes", "gravatar_hash": "78897c96c45c02fa88b191c854fa83a8", "author_url": null, "date": "Apr 30, 2008", "message": "I am fully behind StackOverflow and everything it hopefully will become. A lot of improvement between podcast 1 and podcast 3, for sure.\n\nNot to sound too harsh, but hopefully this does not become another Fog Creek sales vehicle."}, {"author_name": "Peter Turner", "gravatar_hash": "edfa1f5a3274d9d6faa2035e6cd32077", "author_url": null, "date": "Apr 30, 2008", "message": "2 things for the record, from a guy whose read the first chapter of TeXbook.\n\nThe K isn't silent in in Knuth\n\nand the X is pronounced (ck) in TeX  (because it's Greek obviously).\n\nHar Har, I don't remember which of you guys said that but now that we can hear you we know you're a poser. Just kidding, I'd to the same thing if I hadn't stumbled across that info.\n\nLove the podcast, I listen at work (where I program in php and delphi [ouch on both fronts eh?])."}, {"author_name": "Patrick Pelletier", "gravatar_hash": "566e0ab0119d534d05abbcf61d316d28", "author_url": null, "date": "Apr 30, 2008", "message": "I think it is essential as a programmer to know what recursion is and how to use it at least in a basic way.\n\nWe often say that been a programmer isn't about knowing how to write code in a particular language but also about been able to easily and rapidly learn a new language and write software in it fast.\n\nWell, the use of recursion is obviously necessary in some fonctionnal or logical languages."}, {"author_name": "required", "gravatar_hash": "a87455bedb0a978f57ecd736a687a511", "author_url": null, "date": "Apr 30, 2008", "message": "&gt; No one is forcing anyone to do anything they don’t want to do.\n\nhttp://en.wikipedia.org/wiki/There's_a_sucker_born_every_minute"}, {"author_name": "Jeff Atwood", "gravatar_hash": "e9da1ed3cdab00371ed1c2ff4520907c", "author_url": "http://www.stackoverflow.com/", "date": "Apr 30, 2008", "message": "Also, I agree that Joel's mic is somewhat.. er.. sibilant in this episode. We'll be more careful next time."}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Apr 30, 2008", "message": "I didn't find working on teams in college to be similar to working on teams in Real Life. The main difference is that in RL when you get assigned to a team you know your role and what you're responsible for. In college there's a painful feeling out process where everybody tries to divvy up the work but doesn't know quite how to do that.\n\nOnce all the students figure out their areas of responsibility it becomes good practice, though."}, {"author_name": "Jordan", "gravatar_hash": "4d2dc5fbbf0b4ecaff7a35b14a43035f", "author_url": null, "date": "Apr 30, 2008", "message": "Wow, sibilant, I had to go look that one up.\n\nOn the Joel vs. Jeff airtime issue, I actually felt that this episode was a lot more even-keeled than the previous two. Listening to the other episodes it felt like The Joel Spolsky Show With Special Sidekick Jeff Atwood. This episode really felt a bit more like Jeff was \"the host.\"\n\nWhile the running gag of pitching FogBugz every time bug tracking / project management comes up might get old, I don't really feel like the show is a big sales pitch or anything. Here's a guy who's built a product and a company, and so it's going to play a big part in his bag of experiences from which he refers. If this was a podcast with Bill Gates, would you be complaining that he was always talking about how they do things at Microsoft?\n\nI hope you two don't get too much grief for the whole ASP.NET thing, as someone looking from the outside in, it's really a pretty nice platform. I think so many people begrudge it mostly because 1) It's Microsoft and 2) for awhile it was pretty freaking expensive to do a proper full-featured ASP.NET setup (Windows Server 200X, SQL Server, Visual Studio). Obviously the \"Express Edition\" stuff has lowered the barrier to entry, but it can still be expensive."}, {"author_name": "mish", "gravatar_hash": "b5cba17e50604a046e39f1e9402d8649", "author_url": null, "date": "Apr 30, 2008", "message": "On the aspect of lock in for google web apps/amazon web services (and maybe microsoft trying to play catch up).  In the long term I imagine we'll have some lowest common dominator API that will be available from all the major suppliers, and will be required for smaller players to come into the market.  Indeed the API may be the google or amazon API - there could be an open source project to reimplement any API or protocol that becomes important enough, even if the API isn't publically documented (it's been done enough times with Microsoft stuff - WINE, mono, samba ...)\n\nThen other companies could set up to provide alternative suppliers, competing on price, reliability, reputation ...  You'd need serious cash to set up as a competitor, but the likes of Red Hat, Novell or Rackspace might well be able to.\n\nGoogle and amazon will doubtlessly continue to have their own apis (used by their internal projects) and extensions to the standard api, but there will then be some way to have an alternative supplier.\n\nAs to how long this all takes to play out, who knows.  \n\nFor regular updates on the business of cloud computing, I can recommend Nick Carr's blog - http://www.roughtype.com/"}, {"author_name": "alto maltés", "gravatar_hash": "49653b4d686c57ff6c68dc19f709356f", "author_url": "http://99designs.com/contests/6774/designers/245307", "date": "Apr 30, 2008", "message": "“Is there any real world use for recursion?”\n\nOf course there is real world use for recursion. We tackle tasks recursively all the time. You take a sip of our drink, and then drink the rest. You take a look at your calendar, do the first task, then take a look at the remaining tasks, and do the first task, etc. When there are no tasks left, you’re done.\n\nIf you really think about it, you will find that many times the recursive solution is the most natural of all. If a computer program is a reflection in code of the natural solution to a problem, then that program is going to be easy to understand."}, {"author_name": "Daniel Auger", "gravatar_hash": "f97b7e79724c89674a2b8d886589c111", "author_url": "http://mynerditorium.blogspot.com/", "date": "Apr 30, 2008", "message": "I've actually had to use recursion to solve some pretty basic problems day-to-day working with ASP.NET. Here is a good example: \n\nSay you have a page that's made up from user controls that are loaded dynamically based off of multiple templates stored in a database or a config file. Say another requirement is that these controls need to be able to persist their state for later on down the road (perhaps weeks later). This being the case, the user controls implement an IPersistable interface. To add another knot, say each control may or may-or-may-not be a composite of other controls including other IPersistable controls.\n\nWhen the user is done doing their business, we want to call the IPersistable.Save() method on all of the controls that support it on the page. Since the page is made up dynamically, the developer cannot deterministically single out which controls to save so the developer has find these controls. However, the .NET Page.Controls.FindControl(...) method only allows you to traverse one level deep. Therefore a good way to make sure you persist every control on the page that can be persisted is to create a recursive function that takes a control as the argument. If that control is IPersistable, then it calls the Save() method. Then, either way the if statement went, the method calls itself for each control in that control's.Controls collection. Since Page is a Control, you can use the Page as the argument when you initially call the function, and you'll end up recursively calling the function on every control in the page."}, {"author_name": "alto maltés", "gravatar_hash": "49653b4d686c57ff6c68dc19f709356f", "author_url": null, "date": "Apr 30, 2008", "message": "Computer scientist, software engineer, electrical engineer, … whatever — who cares about names? I mean, can we really draw a line between any of these, and do we really want/need to draw it? Ok, suppose we draw it. Then, what happens? We make illegal for a “software engineer” to use recursion, for an “electrical engineer” to write software or for a “computer scientist” to design a circuit?"}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.blogspot.com", "date": "Apr 30, 2008", "message": "I don't know if you did anything differently, but this podcast didn't have any of the weird skipping/fast-forwarding glitches for me that the first two did. Good stuff.\n\nAs an OCaml programmer (and, I must admit, an academic computer scientist), I was a little taken aback when you said that recursion is useless in the real world... I use it every day!"}, {"author_name": "Michael", "gravatar_hash": "6d694c8bf7fbebd7a67ddc74a5018133", "author_url": "http://blog.elsdoerfer.info", "date": "May 01, 2008", "message": "Jeff, it's true that the new flash version will solve the issue, but if you want to make it work for older versions as well, encode at a multiple of 11.025 kHz. Search for Chipmunk effect for more info."}, {"author_name": "Charles Roper", "gravatar_hash": "93fc84c261cdce2e2f1d64c8e531ecb7", "author_url": null, "date": "May 01, 2008", "message": "Regarding font rendering, I twittered about this recently:\n\nhttp://snipr.com/26mc6\n\nUbuntu delivers the best of both worlds, it would seem. Now if only MS would open up their core fonts again."}, {"author_name": "Roy", "gravatar_hash": "5af302dde60a6ada2180e5728d3b85bd", "author_url": null, "date": "May 01, 2008", "message": "Joel does not have a radio voice..  He hurts to listen to.  Just let Jeff do the talking and Joel can listen quietly....there now everyone's happy ;)"}, {"author_name": "Aaron", "gravatar_hash": "396cd6ee9714c6543652a316ff233563", "author_url": null, "date": "May 01, 2008", "message": "About font antialiasing and such - I once had a monitor die on me about the time I had to write a bunch of midterms.  I ended up buying a cheapo ENORMOUS Sun CRT for forty bucks.  That thing sucked - it was blurry, it had a low refresh rate, and it weighed about a hundred pounds.\n\nI wanted a big monitor because I do audio mixing.  So that's why I had to get it.\n\nEventually, I got used to the display.  At first, it was really hard.  Blurry text all the way, especially since I have a Mac and so it's a little blurry anyway.  \n\nOf course, once I bought an LCD, the difference was like the difference between reading something written by a dull crayon versus a ball point pen.\n\nMy point is that people can get used to things.  If you never looked at a Mac for ten years, then tried to use one, it might seem a little weird.  I've never spent too much time away from either major OS, since most jobs I've had used PC's and I've always had a Mac at home.  Thus, neither rendering system bothers me.\n\nAnyone ever use the Control-mouse-wheel trick to zoom in on OS X text?"}, {"author_name": "Jivlain", "gravatar_hash": "cc4b382c9cf5750773e569859a0c205b", "author_url": "http://jivlain.wordpress.com/2007/09/01/why-you-shouldnt-use-linkbuttons/", "date": "May 02, 2008", "message": "I thought the sound quality was much better with this episode, good stuff. \n\nOne thing on using ASP.NET, which I'm sure Jeff already knows: be careful about using LinkButtons! The things completely break middle-clicking/control-clicking and other ways of opening links in new tabs."}, {"author_name": "Robb", "gravatar_hash": "a935cc0027b8f7d74f8c2ca5d773cd46", "author_url": null, "date": "May 02, 2008", "message": "I've just finished listening to the 3rd podcast fantastic stuff guys keep it up.  I'm really looking forward to what you implement with stackoverflow.com.\n\nOn a side note after listening and reading the debate over should a beginner learn C/C++, I've decided to dig out my on lecture notes from university and have a refresher session over the next couple weeks its been a while and it will no doubt be painful but fun. \n\nAnd it's always tabs over spaces..."}, {"author_name": "Steve", "gravatar_hash": "9b159638838d6521d869c9cc5dd1d963", "author_url": null, "date": "May 02, 2008", "message": "I disagreed with a bunch of things ... which I'm a bit surprised at:\n\na) Re recursion: We often use it in website building when we want to display a tree of something. A typical programmer here (where we make internal and external websites) will use it once or twice per year. It's also a very effective hiring filter.\n\nb) Lock-in on Google App Engine: GAE is basically just Python/Django with stuff removed. A bunch of people are implementing this environment outside, so apps can be moved out to EC2. e.g.: http://jchris.mfdz.com/code/2008/4/announcing_appdrop_com__host_go\n\nc) Lock-in on EC2: This one's easier, as EC2 has more pure virtual machines. Switch your app to run on some dedicated servers by moving the code over. Just make sure your dedicated boxes are Linux, or you have to host a VM per box.\nThat won't let you use neat stuff like RightScale, and scale insanely like Animoto, though ... http://blog.rightscale.com/2008/04/23/animoto-facebook-scale-up/"}, {"author_name": "Brian", "gravatar_hash": "f90297a2abf496fbd032252f4dcbfa4e", "author_url": null, "date": "May 02, 2008", "message": "Can you guys introduce yourselves at the beginning of every show? Not like a full introduction, just your names would be fine. I always forget, then spend the next hour trying to figure out which is which."}, {"author_name": "Mark Tiefenbruck", "gravatar_hash": "5022e8f0a0c5572cc979ccb74bbf753f", "author_url": "http://mark.tiefenbruck.org/", "date": "May 02, 2008", "message": "I really like the motivation here, since I occasionally have the same problem with finding useful information. However, there's one issue that I haven't seen addressed anywhere, and that's how you intend to solve the chicken and egg problem: why would somebody choose to ask a question at a site with no activity, and who's going to be sitting around waiting for it?\n\nI'm an admin for a math messageboard ( http://math2.org/mmb/ ). In my experience, about half of our regulars came to the board because they wanted to discuss something they were studying for fun, and the rule of reciprocity ( http://www.rickross.com/reference/brainwashing/brainwashing20.html ) forces them to answer a few questions in the meantime.\n\nI would suggest building a user base by focusing on entertainment: either promote general discussions on programming or have challenges like http://projecteuler.net/ or http://codegolf.com/ . If you go for the latter, I would recommend having users post problems themselves, rather than a central authority. You shouldn't have any trouble attracting people to that kind of forum, given your existing readers."}, {"author_name": "Sean T. McBeth", "gravatar_hash": "2d598f70b2bd1d828a195ced8abd7e9e", "author_url": "http://www.seanmcbeth.com", "date": "May 02, 2008", "message": "If you don't want a focus on religious discussion, maybe you should stop putting so much focus on the topic of religious discussions. Just don't tolerate them.\n\nOn recursion, the applicability of recursion varies between languages. Most C-like languages implement recursion on the stack, which can severly cripple  the technique with pushes, pops, and that nasty limitation that this site is named for. Most dynamic languages are much more clever about their recursive function calls and don't have a huge performance hit because of it. \n\nOn learning C/C++, I'd like to provide my own (limited) experience. I toiled with C for a while in highschool before going to college, where they taught us C++ for our first two years, and then I transfered to a school that did nothing but Java to finish my degree. I really never learned how to work with pointers in C or C++ until some time in college when I got interested in scripting languages and started writing simple Turing machines. I think this is significant, because it put me *outside* of the framework of the machine, whereas coding in C puts you *inside* the framework of the machine. When I was forced to consider how to build the machine instead of how to placate the machine, I think I gained a much more intimate understanding of the machine, instead of just taking it for granted, and could move on to understanding how to solve problems with the machine."}, {"author_name": "Deepak", "gravatar_hash": "14f89ec6dc2aad3658d47eb45723fbfa", "author_url": "http://mndoci.com", "date": "May 02, 2008", "message": "I don't necessarily agree on the Google/Amazon discussion.  If I was starting a company today, especially one which needs access to compute cycles every now and then, Amazon would be my default option (since it's much more than a platform for web apps).  The cost works, it's essentially a VM in the cloud, with a really cool pricing model.  Yeah, it's early days, but I think they're more than ready for prime time (at least Amazon is).\n\nHardware and compute cycles are hardly something you can compete on (Google is an exception)."}, {"author_name": "Luís", "gravatar_hash": "326b108ffcc42f27628703b0c11ed239", "author_url": null, "date": "May 04, 2008", "message": "Joel's comment about Lisp was pretty lame. :-) Go learn Common Lisp! (Instead of just telling other what languages they should learn just because <em>you</em> know them.)"}, {"author_name": "Gary", "gravatar_hash": "2f76614a6d2648078882558669350ccd", "author_url": "http://happyappa.googlepages.com/", "date": "May 05, 2008", "message": "\"I don’t know if you did anything differently, but this podcast didn’t have any of the weird skipping/fast-forwarding glitches for me that the first two did. Good stuff.\" - Chris Conway\n\nSame here. This was the first podcast that both displayed the podcast length properly in my player and didn't have the glitches mentioned above.\n\nIs there a QA dept I could follow up with, Mr. Atwood?"}, {"author_name": "Sean T. McBeth", "gravatar_hash": "2d598f70b2bd1d828a195ced8abd7e9e", "author_url": "http://www.seanmcbeth.com", "date": "May 05, 2008", "message": "re: bitching about Joel's Lisp comment.\n\nHoly Zeus, you people have no sense of humor."}, {"author_name": "Sean T. McBeth", "gravatar_hash": "2d598f70b2bd1d828a195ced8abd7e9e", "author_url": "http://www.seanmcbeth.com", "date": "May 05, 2008", "message": "I fully believe that a person can be both an academic researcher and a practical implementor. I work as a generic software contractor, nothing special in the work I do, but I have used almost every concept I learned in my CS courses in my daily work. I have used linear algebra to optimize my logic structures, I have used relational algebra to optimize my databases, I have used algorithmic analysis in my documentation to justify time I spent refactoring portions of time-critical code. It is specifically my solid grounding in Computer Science that makes me a valuable developer for my company.\n\nI submit that, if you believe a certain topic isn't applicable to \"real world development\", you haven't gained the necessary understanding of the material in order to be able to include it as another tool on your belt. A carpenter doesn't start a project asking himself, \"how will I ever use this hammer?\""}, {"author_name": "Luís", "gravatar_hash": "326b108ffcc42f27628703b0c11ed239", "author_url": null, "date": "May 05, 2008", "message": "@Sean: notice the smiley. The suggestion was serious, though."}, {"author_name": "shawn", "gravatar_hash": "f878a55e08bacee0af48852c29a02dc7", "author_url": null, "date": "May 05, 2008", "message": "i wrote a recursive function to generate website breadcrumbs from a sitemap xml file just before i listened to the podcast ;p \n\ni would like to hear more about your experiences with mono. maybe i could get it into a audio question sometime this week."}, {"author_name": "no more java", "gravatar_hash": "4f384e9f3e8e625aae72b52658323d70", "author_url": null, "date": "May 06, 2008", "message": "Is there no RAR version for this format? I'm unable to download it in MP3 format because of you know what."}, {"author_name": "Grumpy", "gravatar_hash": "5567163b5c1db3ac92c85b5e03d73435", "author_url": null, "date": "May 06, 2008", "message": "Podcasts are lame.\n\nIt takes forever to get any information across, and they require a positive commitment of time; you can't just slide into listening to one like you can, say, reading a web page and composing a rant about podcasts.\n\nAnother problem is that you can't really edit.  Your competition for space on my iPod (and hence in my brain) includes tons of painstakingly edited excellent NPR content.  This podcast is people speaking off the cuff, and very few people come across better that way than if they have some time to edit their stuff.\n\nFinally, I was thinking to myself \"Wow, I never notice poor audio quality, but Joel sure does sound tinny\" as Joel was boasting about how he'd ditched all his good audio gear.\n\nI'm sure this podcast is a lot of fun to do, but you'd get more space in my brain by spending an extra hour a week continuing to write well."}, {"author_name": "scott_s", "gravatar_hash": "dc25fc3f18bbff60da1cb4bcb373a4fd", "author_url": null, "date": "May 06, 2008", "message": "C is basically portable assembly. Learning it has value if you want to understand what's going on at the hardware level, but you don't want to spend the time to learn how that particular hardware's language."}, {"author_name": "scott_s", "gravatar_hash": "dc25fc3f18bbff60da1cb4bcb373a4fd", "author_url": null, "date": "May 06, 2008", "message": "Also: there is plenty of research in CS in interfaces. It's an entire field called Human Computer Interaction. CS research has changed in the past several decades, and not all research is theoretical. Try browsing the proceedings of ACM and IEEE conferences."}, {"author_name": "Eugene Katz", "gravatar_hash": "6b8e59e3f68ce65c940a9ad8816e52b8", "author_url": "http://sharepointblogs.com/ekatz", "date": "May 08, 2008", "message": "It's funny, I was just reading about recursion in the latest issue of the VisualStudio magazine.  Nothing fancy; just a way good to accomplish an everyday task.\n\nhttp://visualstudiomagazine.com/columns/article.aspx?editorialsid=2599"}, {"author_name": "Duncan Wilcox", "gravatar_hash": "c381ef8ac1032d9ee9507edce50d457a", "author_url": "http://duncanwilcox.com", "date": "May 09, 2008", "message": "As \"Merus\" notes, recursion is commonly used to iterate over trees. And there's on sort of tree we use all the time: the DOM.\n\nDuncan"}, {"author_name": "Jeanne", "gravatar_hash": "564a3b591409db9fb3cb7358400d0587", "author_url": null, "date": "May 21, 2008", "message": "Another use of recursion is in making deep clones of objects."}, {"author_name": "Excuse...", "gravatar_hash": "6f6ec4124abb40aa9c8aa98625edd5e4", "author_url": null, "date": "Sep 11, 2009", "message": "<a href=\"http://bmwsparepart.blogspot.com\" rel=\"nofollow\"> Parts BMW 325e Parts BMW 325ix Parts BMW 535i Parts BMW Engine Parts BMW Alternator</a>\n<a href=\"http://buy-used-carss.blogspot.com\" rel=\"nofollow\">Buy Used Cars. Used Jeep Used Kia Used Lamborghini Used Land Rover Used Lexus Used Lincoln</a>\n<a href=\"http://dasgutteauto.blogspot.com\" rel=\"nofollow\">das auto. buy mazda. Mazda History\n«Mazda» (Mazda Motor Corporation, in the 1927-1984 Toyo Kogyo Company)</a>\n<a href=\"http://alltheaudia4vehicles.blogspot.com\" rel=\"nofollow\">All the Audi A4 Vehicles. buy used cars in Canada. What are the advantages of buying a used car from Canada?  Every year from the A4 you know that this vehicle type, the sporty performance and comfort and an invitation to the cabin. </a>\n<a href=\"http://best-dining-and-restaurants-in-new-yo.blogspot.com\" rel=\"nofollow\">Best Dining and Restaurants In New York City</a>\n<a href=\"http://test-for-adolescent-girls.blogspot.com\" rel=\"nofollow\">test for adolescent girls. Have you kissed a guy. Have you kissed a girl? Have you kissed a guy without braces? Have you kissed a guy with braces?</a> \n<a href=\"http://howtoovercomedepressionn.blogspot.com/\" rel=\"nofollow\">How To Overcome Depression. You should know the different types of depression</a> \n<a href=\"http://freecarpetcleaningservices.blogspot.com/\" rel=\"nofollow\">Free Carpet Cleaning Services. Importance Of Regular, Professional Carpet Cleaning very high</a> \n<a href=\"http://bmwsparepart.blogspot.com/\" rel=\"nofollow\">Bmw Spare Part. BMW History</a> \n<a href=\"http://kinderfreundliche-ferienwohnung.blogspot.com/\" rel=\"nofollow\">Kinderfreundliche Ferienwohnung. Mit 2 separaten Schlafzimmern, kompletter Babyausstattung vom Kinderbett bis zum Flaschenwarmer ist alles vorhanden, was\nman fur einen stressfreien Familienurlaub benotigt.</a> \n<a href=\"http://womens-polo-shirt.blogspot.com/\" rel=\"nofollow\">Womens Polo Shirt. Here are our Women's Golf, Sports &amp; Polo Shirts.</a> \n<a href=\"http://magic-encyclopedia.blogspot.com/\" rel=\"nofollow\">Magic Encyclopedia. Eine geheimnisvolle Reise voller wunderbarer Magie erwartet dich!</a> \n<a href=\"http://kaufenauto.blogspot.com/\" rel=\"nofollow\">kaufen auto. Kostenlos Inserieren und Autos aus Ihre Nahe kaufen und verkaufen.</a>"}, {"author_name": "ルイヴィトン コピー", "gravatar_hash": "75a19b51f44abe3a2b55de290d60fec9", "author_url": "http://www.lv-star.com/Louis-Vuitton.html", "date": "Jan 28, 2010", "message": "I’m unable to download it in MP3 format?thanks"}]}