{"response": [{"author_name": "Guy", "gravatar_hash": "aa81a6370a42b90429370bcf2dfad2e8", "author_url": null, "date": "Sep 30, 2008", "message": "Is it the responsibility of the questioner to offically accept an answer, or the community?\n\nCould the questioner have one of those \"top of the screen notification\" bars drop down if you have any questions that have answers and upvotes but where you've not accepted an answer?\n\nCould this be highlighted in your stats page?\n\nCould you have a badge awarded to people (given the right level of reputation) select the most appropriate answer for \"old unanswered\" questions?"}, {"author_name": "Schalk Versteeg", "gravatar_hash": "6aca0640f153e86a8a41c073768c46a3", "author_url": null, "date": "Sep 30, 2008", "message": "Can a user set his own criteria for what he consider as unanswered for ex. 3 answers, 3 upvotes in total.\nor 3 answers with no question having more than 2 upvotes."}, {"author_name": "zurvan2", "gravatar_hash": "fdd2cee0ff73e9805b94654e4d7418d3", "author_url": null, "date": "Sep 30, 2008", "message": "OK. This is related to your \"wiki\" concept here. The fundamental shortcoming of the \"forum\" organization is that independent answers can't easily be combined into one coherent \"answer\" or article. \n\nWhat you've got now is aksmefi with bells on, but you really need to get a bit more encyclopedic. There's a good opportunity here for more hierarchical organization, too... Like, more than just tags. \n\nYou could have all the questions on Java Threading grouped together, and have the individual questions and answers more like a FAQ."}, {"author_name": "kogus", "gravatar_hash": "e54ed1fefe18a37dabb29cc44dfd89ac", "author_url": null, "date": "Sep 30, 2008", "message": "Answered and un-answered should always be the opposite of each other.  If you've defined \"Unanswered\", then \"Answered\" is simply !UnAnswered."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://www.johntopley.com/", "date": "Sep 30, 2008", "message": "So unless I'm mistaken there's now no way to easily find all the questions that have no answers at all?"}, {"author_name": "Gary Fleming", "gravatar_hash": "1b5863cbb2d0009e78eaa85ea89fe2a6", "author_url": "http://solitude.vkps.co.uk", "date": "Sep 30, 2008", "message": "A little outside of the scope of defining unanswered itself: if you want to reduce the number of unanswered questions (which I assume is ultimately the goal) then you have to make it easier for people to find unanswered questions for which they have domain knowledge.\n\nTo that end, I'd say that adding an \"unanswered\" tag would be greatly beneficial. If I know about, say, \"Java\", then I can create a view of unanswered Java questions without all that other stuff I don't know getting in the way."}, {"author_name": "zigdon", "gravatar_hash": "e112c5bd87795b142bd95e985f5205f2", "author_url": "http://peeron.com", "date": "Sep 30, 2008", "message": "Shouldn't the number of upvotes needed to count as \"answered\" be related to the number of upvotes on the question?  If a question has +10 votes, and the best answer has +1, I wouldn't count it as a good answer!"}, {"author_name": "Mike Stone", "gravatar_hash": "c8ba7ccacc70a7b826184e8d717bfcd7", "author_url": "http://smellsblue.blogspot.com/", "date": "Sep 30, 2008", "message": "Maybe I'm alone in this, but I feel this is far too simplistic a solution.\n\nI have tried to push the idea (on uservoice and stack overflow itself) that high rep users should be able to mark questions closed but NOT override someones chosen answer... no rep could change hands, and it can only be done after so many days (questions that are unlikely to get an answer)... maybe other things like preventing people from selecting their own answer... or it must have a minimum number of upvotes, or even it must be the #1 upvoted answer.\n\nYou may not have intended the \"answer\" mechanism to be something significant, but I think it could easily solve this problem with new high rep abilities.\n\nThe point is, it's easy to get upvotes and have the wrong answer or an answer that is not answering the right thing (especially for niche, obscure problems).  Thus, you are going to drown out questions that still don't have an answer.\n\nI don't think it will help to raise the number of upvote limit either, because the niche questions often don't get viewed or voted on as much as the more general questions, or questions in technology that a lot of people know, and you may even see people voting on answers just to get them off the unanswered list.\n\nI think this problem NEEDS to be solved, and I'm glad you are working towards fixing it, but I think this solution has missed the mark... though I hope I'm wrong."}, {"author_name": "Morten Christiansen", "gravatar_hash": "ea47536e95c0a6fff1affa1584b61722", "author_url": null, "date": "Sep 30, 2008", "message": "It's interesting you are bringing this up just now as I have been thinking about the usefulness of 'answered' questions. Lately I have come to the concludion that the feature contracts from the value of the site rather than the other way around.\n\nThe problem is that a question which is marked as answered doesn't really invite people to write any new answers as they might be thinking that the owner of the question does not care anymore.\n\nWhile it is not a major problem I don't really find that the feature adds anything positive to the site. When you see the site as a wiki or a place to look up problems I don't find it interesting whether the owner of a given question has solved his problem. If anyone has anything of value to add to the question he should add it no matter what."}, {"author_name": "BCS", "gravatar_hash": "6757caf55de0413ae0994293e001d465", "author_url": null, "date": "Sep 30, 2008", "message": "A dynamic threshold for up votes based on the number of answers and views might be better. If there are 3K views and 30 answers and none with more than 3 up votes; I don't think that question is answered."}, {"author_name": "Don Kirkby", "gravatar_hash": "f90cd356f2945b284946d5743467d850", "author_url": "http://donkirkby.googlecode.com", "date": "Sep 30, 2008", "message": "The change is an improvement over \"unanswered == no answers\", but it's susceptible to attack. I don't know why anyone would want to, but they could just go through and up vote the first answer on all unanswered questions. That takes you back to \"unanswered == no answers\"."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://www.johntopley.com/", "date": "Sep 30, 2008", "message": "I think the change is for the worse. There's now no way to see questions with no responses."}, {"author_name": "Bernard", "gravatar_hash": "af29baa43e6e6f77180e631cea686847", "author_url": null, "date": "Sep 30, 2008", "message": "I have to agree with Mike that this solution is too simple. Time will tell all, I suppose."}, {"author_name": "William Newbery", "gravatar_hash": "398efb709eb606ef79ee6436f55f93bd", "author_url": null, "date": "Oct 01, 2008", "message": "I think any automated decision on if something is \"answered\" will not work for everything, an answer may get 5 upvotes but still not be what the asker wanted (eg it may say why doing what the asker wanted is generaly bad, but still not say how to do it).\n\nWhat I suggest if that if a qustion still hasn't got an answer selected by the asker after 5 days, the system makes the one with highest votes the selected answer (min 1 up vote?). However the origenal asker should be able to revoke that if they really are not happy with the answer.\n\n* This fixes the problem with the asker not being around\n* If it really isn't solved then the asker can keep it as an unanswered question so it shows in the unanwerd list."}, {"author_name": "Eugene Katz", "gravatar_hash": "6b8e59e3f68ce65c940a9ad8816e52b8", "author_url": "http://komradekatz.com", "date": "Oct 02, 2008", "message": "\"Expecting every asker to come back and mark an accepted answer is totally unrealistic. There would be tens of thousands.\"\n\nWhat if the community could mark and answer accepted? It would definitely need to have gone unanswered for a while and require relatively high reputation.  Maybe even require multiple users to agree that it's THE answer, kind of like the offended flag."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 02, 2008", "message": "> What if the community could mark and answer accepted?\n\nIsn't this already handled by voting?"}, {"author_name": "Mike Lang", "gravatar_hash": "bddc0e4212414fd17646dbc94b5ad362", "author_url": null, "date": "Oct 02, 2008", "message": "How about a contested answers designation that's separate from answered questions.  A question with a contested error would be one where there's significantly more upvotes (1, 5, whatever tuning makes sense) on an answer than the accepted one. If the nonaccepted answer breaks some higher threshold (again whatever tuning makes sense) than the question becomes answered."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 04, 2008", "message": "see the \"related tags\" right-hand sidebar under the unanswered tab. Note that when you click these, they are additive.. I think that'll help narrow down unanswered quite a bit."}, {"author_name": "Ruudjah", "gravatar_hash": "f7c7c3ad05ae2be1195801e2b75e65ce", "author_url": null, "date": "Oct 20, 2008", "message": "Please change the tab title \"unanswered questions\" to something more of semantic value. \n\nAll that I have learned reading at codinghorror.com is instantly thrown to the /dev/bin by having the current construction: an \"unanswered questions\", which actually links to a page with questions _with_ answers. \nIn MS Word, there is a \"print\" button. It prints my documents, it doesnt give me a print preview. It is because those guys in Redmond put some thought in the semantics, something you hammer on too."}, {"author_name": "Ruudjah", "gravatar_hash": "f7c7c3ad05ae2be1195801e2b75e65ce", "author_url": null, "date": "Oct 20, 2008", "message": "What about changing \"unanswered questions\" into \"answers needed\"? \nIt can't be more concise and clear, can it?"}, {"author_name": "yoann MAYEN JEAN MICHEL GASTON HENRY GEORGE CAUMETTE OCANNA", "gravatar_hash": "1270dd8168759d8e491e2e11f37f4b7e", "author_url": "https://facebook.com/​yoann.malin1", "date": "Oct 13, 2011", "message": "BONJOURS, je me prenome yoann g 19 ans bientot 20 et je pence pouvoir servir a facebook car je suis hiper motivé !!!!! dans la vie comme dans mais proger jespert vous etre dune importante aide !!!!\n\n\n\nmerci,\n\n\ncordialement \n\n\n\n                           Mr MAYEN"}, {"author_name": "yoann MAYEN JEAN MICHEL GASTON HENRY GEORGE CAUMETTE OCANNA", "gravatar_hash": "1270dd8168759d8e491e2e11f37f4b7e", "author_url": "https://facebook.com/​yoann.malin1", "date": "Oct 13, 2011", "message": "et un grand merci de votre colaboration !!!"}, {"author_name": "nellie millward", "gravatar_hash": "27c9e6ddb581a15c426500e4398a95f9", "author_url": "http://frontiervill", "date": "Feb 14, 2012", "message": "i cant get my friends to help me. so i cant compleat my quest. please help me"}]}