{"response": [{"author_name": "Maciej Rutkowski", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Sep 11, 2008", "message": "From my observations, more and more topics are appearing that are totally missing the purpose of Stack Overflow. People are asking questions that cannot be answered with a good, objective answer. I suppose it's the effect of a badge/rep race people always engage in when there is something to collect.\n\nMost beautiful code you've seen, best application you've used, what are your multi-display IDE window preferences?\nSure, some of them may be a nice guide, like \"best keyboard/mouse for a programmer\" but they're still very subjective and posts with votes beside make the topic look like an elaborate poll."}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://andreir.wordpress.com", "date": "Sep 11, 2008", "message": "We really want this project online :("}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Sep 11, 2008", "message": "You’re up to eight listeners now? Woo!"}, {"author_name": "Shaun Austin", "gravatar_hash": "d6c392552f0147de5213e7689d3c68f2", "author_url": null, "date": "Sep 11, 2008", "message": "Probably a minor point, but I notice there's no artwork for the podcast in iTunes. Should be easy to sort and makes it all seem a bit more polished."}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Sep 11, 2008", "message": "Joel, you could look into using Banana Connectors for speaker cables instead of bare wires: http://en.wikipedia.org/wiki/Banana_connector\n\nWe should also thank Sony for brining Blue-Ray to the masses through the PS3 and I'm so glad the DVD 2.0 war is over.\n\nI guess you cannot resell the same game, I mean, you could never re-release Doom?\n\nAnd I think the idea with the hidden user quality field is excellent, something I will bear in mind when I have to consider banning users.\n\nGood Podcast :)\nStephen"}, {"author_name": "Sameer Alibhai", "gravatar_hash": "20b490db395d21e97e4707a8c7e649d4", "author_url": "http://www.sharpdeveloper.net/", "date": "Sep 11, 2008", "message": "I guess it was this guy? http://beta.stackoverflow.com/users/4681/joseph-ducreux"}, {"author_name": "Scott Williams", "gravatar_hash": "3429df2e085587406780ca9e776f93b7", "author_url": "http://krazyyak.com", "date": "Sep 11, 2008", "message": "Something Awful used to have a similar feature for ignoring users called \"Hellbanning.\" To the Hellbanned user, everything worked normally, but nobody else could see any of their posts, and they were left to wonder why nobody replied to them.\n\nThough some Hellbanned users figured it out and started to bump really old and stupid threads, making regular users wonder why this was happening.\n\nEventually they removed the functionality because it was too process intensive on the server."}, {"author_name": "Bryan", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": "http://quux.tumblr.com", "date": "Sep 11, 2008", "message": "So I was thinking about this \"I want to have a fight on the internet\" game that Joel so colorfully (and accurately!) described.\n\nA real problem for those of us who DON'T want to play this game is, how can we tell \"that guy\" from the other guys (girls too) who are not playing that game? Some folks will correct you, or provide constructive criticism - and they really are trying to propagate useful information. They may be wrong, but they are not trying to be \"I wanna fight\" players.\n\nSometimes it is really hard to tell one from the other. There's overlap between the two."}, {"author_name": "dj", "gravatar_hash": "343122a8069d5b94b92ad9c2db012ff8", "author_url": "http://www.orbitalhub.com", "date": "Sep 11, 2008", "message": "Cool podcast!\nOne question: if other users could flag an account (you gave the example of 10 users flagging an account), couldn’t this spark political games on the site? You know… some kind of small scale Civilization…"}, {"author_name": "James", "gravatar_hash": "8ca7425c8a9da807b9bf6934f10d59fa", "author_url": "http://www.codingthewheel.com", "date": "Sep 11, 2008", "message": "Stackoverflow.com is still in beta, and it seems a little bit like looking the gift horse in the mouth to complain too much that people aren't always keeping their questions 100% on-topic.\n\nThere are sites out there that would kill for this kind of attention, enthusiasm, and support. So what if users are so eager to use the system they ask some off-topic questions? That kind of behavior will die down in time.\n\nComplaining about this is like complaining that you just won a $40 million dollar lottery and will now have to give $15 million to the gov't. Boo hoo."}, {"author_name": "Dan", "gravatar_hash": "6105f5790872b848e0d36ba4b3bc9419", "author_url": null, "date": "Sep 12, 2008", "message": "I think in terms of user management, there's really no real good way of automating it.  Before someone's banned, you almost always need a moderator call before you push the big red button.\n\nThe \"flagged\" users idea works as a tool for other users  to gauge someone if it's used correctly.  I'd prefer to see it as a feedback system similar to Ebay.  The users are allowed to exist, but the rating they have lets the other users determine their abrasiveness and/or ability to apply a reliable answer.\n\nAs I'm sure everyone here would agree.. the IT culture has a number of personality types. I've known plenty of brilliant people who have zero personality or people skills.  I've known people who have managed to be well liked by everyone, but really aren't terribly great contributors even though they try.  Considering one of this site's goals is to build based on solutions, it might not be a wise choice to ban someone just because they interact in a cold manner. \n\nXBox has a good way of rating people.  You can submit feedback about other people on Live based on their play style, attitude, etc.  Then as a user, you have the option to ignore/avoid these users and the system separates you when it's matching up.\n\nI know that doesn't completely apply here, but the idea might be twistable enough to work in a forum-ish environment."}, {"author_name": "Tom", "gravatar_hash": "9e4fe1f8165eeb9b947a8102d7a9220b", "author_url": null, "date": "Sep 14, 2008", "message": "One constant frustration I have with your podcast is that you never introduce yourselves.\n\nWithout introducing yourselves I have to guess (or wait for sufficient context to figure out) who each speaker is.\n\nA simple 'Hi I'm Joel' and 'Hi I'm Jeff' would make listening much easier.\n\nThanks!"}, {"author_name": "Shaun Austin", "gravatar_hash": "d6c392552f0147de5213e7689d3c68f2", "author_url": null, "date": "Sep 14, 2008", "message": "@Tom you mean you can't tell???\n\nHere's a tip:\n\nThe guy tippytoeing around trying not to say something that causes Joel to launch into a tengental rant is Jeff.\n\nThe guy who goes off on tangental rants at the drop of a hat is Joel."}, {"author_name": "Kevin M", "gravatar_hash": "173cfbfa3ef0cc7d19d5bd045b2eab5b", "author_url": null, "date": "Sep 14, 2008", "message": "@Dan...I agree completely.\n\nI would urge Jeff to focus more on the impact of unwanted behavior on the Community, and not so much on converting the corner-case users who behave as if attention starved.  That is, strive to ensure that the Community is the *least* impacted by aberrant posts, etc.\n\nAs to how, I think Joel as it wired.  The elements of voting (and the possible addition of a 'user-quality' attribute) will organically take care of the corner-cases.  \n\nHowever, a DELETE function is always required for those cases of copyright infringement (as cited by Joel), porn, slander, libel, and all the rest of the stuff that folks will do if given the chance.  Mind you, you don't have to USE the feature until the government or your legal counsel tells you that you must, but you at least ought to have it in the tool kit.\n\nAs for 'rants', anyone that thinks Joel's contributions are 'rants' hasn't spent much time in the company of New Yorkers."}, {"author_name": "Shaun Austin", "gravatar_hash": "d6c392552f0147de5213e7689d3c68f2", "author_url": null, "date": "Sep 14, 2008", "message": "@Kevin Was joke!"}, {"author_name": "Tom", "gravatar_hash": "9e4fe1f8165eeb9b947a8102d7a9220b", "author_url": null, "date": "Sep 14, 2008", "message": "@Shaun Austin I can tell... now.\n\nI think it's a usability (really 'listenability') issue with the podcast.  As a new listener I remember being somewhat distracted because I didn't know who the speakers were.  It wasn't until I worked it out from context that I could figure it out.\n\nJoel and Jeff were just 'complaining' about how they didn't have many listeners.  Introducing themselves would improve the usability of the podcast and take very little time.  Why not?"}, {"author_name": "roman", "gravatar_hash": "3a3fb77c01514093da4c10f806ae4284", "author_url": null, "date": "Sep 15, 2008", "message": "debacle :)"}, {"author_name": "JasonMichael", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": "http://www.jmrtechnet.com", "date": "Sep 15, 2008", "message": "Why should these guys need to introduce themselves?  If you want an intro, buy one of their books and read the \"Intro\" section... maybe there's a free page of one of their Intro's available...  You can also read Joel's blog... do some research - why should they have to spoon  feed everything to us for their podcast to be useful?  Welcome to New York City!"}, {"author_name": "Shaun Austin", "gravatar_hash": "d6c392552f0147de5213e7689d3c68f2", "author_url": null, "date": "Sep 16, 2008", "message": "@JasonMichael: \"Welcome to New York City!\" Nice... *claps* good man.... you go girl!! *shakes head*"}, {"author_name": "Josh Millard", "gravatar_hash": "8556724f6047e514354a7148bec90f34", "author_url": "http://joshmillard.com/", "date": "Sep 17, 2008", "message": "<i>A simple ‘Hi I’m Joel’ and ‘Hi I’m Jeff’ would make listening much easier.</i>\n\nHeh.  This is true, guys.  Not knowing your resumes too well, it took me thirty minutes or so to find solid enough contextual clues to pin you down.  As silly as a quick couple of hellos may feel after the thirtieth iteration, it's great simple kindness to new listeners."}, {"author_name": "Jeremy", "gravatar_hash": "c9e4524b82dd3926b7082a1116321576", "author_url": null, "date": "Sep 18, 2008", "message": "lol Joel laughs at Jeff when he says \"debacle\", but later when annoucing what file formats to send in, he says \"wov\" for wave files! :)"}, {"author_name": "Mike Pattee", "gravatar_hash": "289c212914f949f9d7ce771d1a131e99", "author_url": null, "date": "Sep 23, 2008", "message": "I'm sure Joel has already hooked up his receiver but if he's looking for a quick way to connect speaker wire to post connectors you can get these monster cable connections.  There might be a generic version somewhere also but basically you can just wire them before hand and then just plug these into the posts instead of having to turn the knob to tighten on the wire.\n\nhttp://www.amazon.com/Monster-QL-GMT-H-QuickLock-Connectors/dp/B00005U21H/ref=acc_glance_ce_ai_-2_1_img"}]}