{"response": [{"author_name": "Andrew Johnson", "gravatar_hash": "980fe8340a6d455c77c13ed357851476", "author_url": "http://www.watchtrailersnow.com/", "date": "Sep 24, 2008", "message": "Wow, this usually finds its way to my RSS aggregator much later in the day... looks like I have my afternoon mapped out."}, {"author_name": "Mark Biek", "gravatar_hash": "040ffc7f3327b05f01c54a8bef3ba60a", "author_url": "http://antelopelovefan.com", "date": "Sep 24, 2008", "message": "Is it wrong that I wish these came more than once a week?\n\nAlso, the CAPTCHA I had to enter was totally perverted."}, {"author_name": "Hertanto Lie", "gravatar_hash": "f0bcb0a2ad2268cc89a50ab8998d2bb2", "author_url": null, "date": "Sep 24, 2008", "message": "Hmm... I asked a question similar to the questions answered in this podcast just this weekend and i didn't expect it to be answered so quickly (even though the one question answered is not mine) since you guys said there was a long queue of questions. Hmm... lucky day for me :)"}, {"author_name": "Jim McKeeth", "gravatar_hash": "e5ca3abec062f8174570a4b1d1c840d8", "author_url": "http://www.delphi.org/", "date": "Sep 24, 2008", "message": "A good example of the problem with allowing people to close questions is the Wikipedia deletionism debate.\n\nAnd to exclude expensive tools would also exclude the highest end editions of Visual Studio Team Suite at $10,939."}, {"author_name": "DylanW", "gravatar_hash": "2263ddbae232c95b579d9ddb2091aa7c", "author_url": "http://www.dylanwolf.com/", "date": "Sep 24, 2008", "message": "The discussion on off-topic question reminds me of something we ran into with our gaming group's forums. So many threads devolved into off-topic discussion which might not appeal to some new people, who might leave because of it.\n\nBut at the same time, if we didn't have those discussions, the community wouldn't have its own culture and flavor, and would dissolve."}, {"author_name": "Shaun Austin", "gravatar_hash": "d6c392552f0147de5213e7689d3c68f2", "author_url": null, "date": "Sep 24, 2008", "message": "I haven't listened to it yet but reading the summary I have to say I'm STRONGLY in favour of leaving voting as the means of killing off questions as I'm noticing SERIOUS over zealous closing of questions mainly from people who hit the rep level and with the hammer of the ability to close questions go off to find the proverbial nail!"}, {"author_name": "Jake McGraw", "gravatar_hash": "769b1f309a41e2893654c81496b9f8b4", "author_url": "http://www.jakemcgraw.com", "date": "Sep 24, 2008", "message": "Really enjoyed the part about \"What to do if you're in an org that has a weak development environment?\" I went the route suggested in Coding Complete 2: If you can't make changes, if the politics are too ingrained, move on."}, {"author_name": "John S.", "gravatar_hash": "54b75f6fbf4434162bfcda6b0cb9b86b", "author_url": null, "date": "Sep 24, 2008", "message": "Please start FatalException for hardware/software general computing questions. That way they won't need to be posted on Stack Overflow"}, {"author_name": "BaileyP", "gravatar_hash": "5fe96558ef20feb210cf4fd517e7c229", "author_url": null, "date": "Sep 24, 2008", "message": "I like that you guys go through a huge discussion about \"what should be allowed\" in this podcast, and mentioned Shirky recently as well, which just makes me think of this.\n\nhttp://www.shirky.com/writings/group_enemy.html\n\nWhich is still my favorite article about social software on the web, even if a bit dated."}, {"author_name": "cowgod", "gravatar_hash": "b64f6d5b6e0dc9880c030ab90c0fde85", "author_url": null, "date": "Sep 24, 2008", "message": "i love these podcasts, don't get me wrong, but can you please get more consistent filenaming/id3 tagging on these things?  the first 8 episodes were good and then you went to this ITC.SO format and things went to hell.  i've been manually tagging them properly but i shouldn't have to take this extra step myself."}, {"author_name": "lubos", "gravatar_hash": "c4924ce2b51b9a550e3baafce3af25b9", "author_url": null, "date": "Sep 25, 2008", "message": "Why is it getting too personal? Let's keep it on topic. First 10 minutes extremely boring."}, {"author_name": "Bartek", "gravatar_hash": "ef9f83fbbceaeb8fa4e358bfb634a217", "author_url": "http://www.weselinka.pl", "date": "Sep 25, 2008", "message": "Jeff, how could you think that a Win32 guy does not know C? Win32 API is basically a set of C functions and structures. :-)))"}, {"author_name": "NathanF", "gravatar_hash": "330b1cbe1a69491aa01727ca8355266e", "author_url": null, "date": "Sep 25, 2008", "message": "There's a ninja-themed restaurant in NY that looks pretty cool. It definitely qualifies as nerdy."}, {"author_name": "Bob", "gravatar_hash": "42c5e83c740bd7c22d09a551e2f97b04", "author_url": null, "date": "Sep 25, 2008", "message": "Take a walk across the Brooklyn Bridge. Gaze up at the incredible engineering feat that has stood for more than 100 years. Imagine where the stuff that we work on these  days will be in 100 years. Think about it."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Sep 25, 2008", "message": "If I understood (heard) correctly, Joel says a developer shouldn't use \"return false\" or \"return true\" in a method but return a variable. Why not? Why would that be a misunderstanding of the use of a boolean?\n\nAt least when I read the code, I know exactly what's being returned instead of following the code to know what the returned variable value is. In smaller methods, I usually return a false or true."}, {"author_name": "KiwiBastard", "gravatar_hash": "8918922b70fe7aa6d2533d6bbb47ec76", "author_url": "http://softwarex-nz.blogspot.com", "date": "Sep 25, 2008", "message": "I agree with Joel on the closing posts. It is relatively easy to get 3000 points, anyone even mildly invested in the site could get that amount of points in a few weeks, and then arbitraily close posts. I think if you are going to allow users to close posts, it should be done on trusted users basis, rather than a points thing.\nSurely in any community the community should vote, not one person, so let the community decide what is or isn't seen with downvotes. That's the point isn't it?"}, {"author_name": "Josh Stodola", "gravatar_hash": "ac11bb0472c37bf41ca166ec849d3a02", "author_url": "http://blog.josh420.com", "date": "Sep 25, 2008", "message": "When I update a answer on the site, it doesn't drop me back down to it after I save."}, {"author_name": "Jon Galloway", "gravatar_hash": "63c32b4489d13b17d23fd9db1505bdf9", "author_url": "http://weblogs.asp.net/jgalloway", "date": "Sep 25, 2008", "message": "Translation of the 7 mistakes:\n1. The business partners didn't subject eachother to programming tests.\n2. Didn't invest in an office building to house co-located programmers.\n3. Didn't use waterfall.\n4. Didn't use waterfall.\n5. Didn't use waterfall.\n6. Didn't use waterfall.\n7. Used a business model based on internet advertising revenue, when everyone knows that eyeball businesses don't make money (except for CodingHorror.com and JoelOnSoftware.com and just about any website with Google ads).\n\nHow on earth could you succeed after violating the conventional wisdom (circa 1985)? What will those ad wizards think of next?\n\nAlso - you didn't notice that the newscasters weren't wearing pants."}, {"author_name": "Josh Parris", "gravatar_hash": "92f446269f65ef4213e94bd99aa3e475", "author_url": "http://parris.josh.com.au", "date": "Sep 25, 2008", "message": "I've got a prediction: Transcription rates are going to keep falling.  Last week's podcast isn't fully transcribed, and after two days this week's has about six minutes done.\n\nJoel's analysis of why people transcribe is wrong.  Some people do it for love.  Others do it for rewards.  And without both, nothing's happening.\n\nJeff, you need to fire up that transcription badge press.  I figure a badge for each ten minutes of transcription?"}, {"author_name": "JasonMichael", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": "http://www.jmrtechnet.com", "date": "Sep 26, 2008", "message": "JoelOnSoftware.com - the Developer/Programmer Reality Movie ... where is it?  There's been various posts about this movie being made since 2005, including a call out for filmmakers to make it, posted on the site.  Now there's a mention in this podcast about filming being done...  in 2008?  How many movies will there be?   Hopefully 3!  That would be great!"}, {"author_name": "Jon Galloway", "gravatar_hash": "63c32b4489d13b17d23fd9db1505bdf9", "author_url": "http://weblogs.asp.net/jgalloway", "date": "Sep 26, 2008", "message": "It's be nice if there was a tag or some other way to view closed posts for review and possible resurrection.\n\nI tried searching for \"closed\" in the title (since searching for [closed] would filter on a \"closed\" tag), but it looks like the [closed] annotation is added when displaying the items and isn't actually part of the title.\n\nYou can get an idea of what the closed posts are by browsing through posts with the lowest votes and looking at the titles:\nhttp://stackoverflow.com/questions?page=645&amp;sort=votes\n\nI reluctantly agree at this point - there are some posts which look like they were closed by overzealous users."}, {"author_name": "Bill", "gravatar_hash": "1246a0f3cd37cec302c805e9e3fa3c57", "author_url": null, "date": "Sep 26, 2008", "message": "Go see Monty Python's Spamalot on Broadway."}, {"author_name": "Joe Miklojcik", "gravatar_hash": "07b6238e229f4a9c9767893fd2e02b8b", "author_url": "http://jfm3-repl.blogspot.com", "date": "Sep 27, 2008", "message": "The conflict seems to be Joel who thinks stackoverflow is *about programmers* and Jeff who thinks stackoverflow is *about programming*.  This should have been decided before any code was written (aluded to in the 7 mistakes).  Food for thought!"}, {"author_name": "Adrian", "gravatar_hash": "48caa7d9e29889bc1c00d7a0379e7a25", "author_url": "http://thoughtadrian.blogspot.com", "date": "Sep 28, 2008", "message": "The performance profile of strlen + iterating through a string is not O(n-squared)... it's O(n) + O(n) ~= O(2n) which is still O(n)."}, {"author_name": "Brij", "gravatar_hash": "0c5d6c71a949a36c1386ad79afac7cc1", "author_url": "http://brijwhiz.wordpress.com", "date": "Sep 28, 2008", "message": "I have seen a quarter suite, basically waist up and covering the front of your torso. Almost like how they wrap you at the barbers. Unlike what Joel thought this is not printed suit. Rather it is a proper cheap tie, shirt and suit all stitched together. What it is used most often for are passport photos in photography studios in little shanties and towns (and in poorer parts of bigger cities)in India. Sine it is like a wrap it is an extreme case of one size fits all - and passpot photos being what they are no one is the wiser:)"}, {"author_name": "Brij", "gravatar_hash": "0c5d6c71a949a36c1386ad79afac7cc1", "author_url": "http://brijwhiz.wordpress.com", "date": "Sep 28, 2008", "message": "I meant suit - not suite:)"}, {"author_name": "Shawn", "gravatar_hash": "7facd6a5ff245d8c71824fec6e7e73d6", "author_url": null, "date": "Sep 28, 2008", "message": "My favorite thing to do in NYC (only been there once, three years ago) is hit Barcade Brooklyn:\n\nhttp://www.barcadebrooklyn.com/\n\nKind of a hipster hang out, but old arcade games and microbrews qualify, I think at least, as geeky fare."}, {"author_name": "Bill", "gravatar_hash": "bb20de3dc3bab18651b9c15094aabdd4", "author_url": null, "date": "Sep 29, 2008", "message": "@Abdu:\n\nJoel is objecting to the following style of code:\n\nbool DoSomethingFunction()\n{\n  bool result;\n  // ... code of your function\n  if ( result )\n    return true;\n  else\n    return false;\n}\n\nHis preference is to have the following:\n\nbool DoSomethingFunction()\n{\n  bool result;\n  // ... code of your function\n  return result;\n}\n\n\n@Adrian:\n\nI believe Joel was talking about doing a strlen() call within a loop:\nfor ( int i = 0; i &lt; strlen(s); i++ )\n{\n  // do awesome Joel stuff here\n}\nIn this example, you call strlen() a strlen() number of times resulting in O(n^2).\n\nThe quick fix results in your O(n + n) = O(n) calculation:\nint len = strlen(s);\nfor ( int i = 0; i &lt; len; i++)\n{\n  // do awesome Joel stuff here\n}"}, {"author_name": "Grom", "gravatar_hash": "a14537020ec5b11fea3b956353724860", "author_url": "http://grom.zeminvaders.net", "date": "Sep 29, 2008", "message": "Adrain wrote:\n&gt; The performance profile of strlen + iterating through a string is not O(n-squared)… it’s O(n) + O(n) ~= O(2n) which is still O(n).\n\nNo its n squared cause you are performing strlen (which is O(n) algorithm) n times. n * O(n) == O(n^2)"}, {"author_name": "posoft", "gravatar_hash": "553052dcdf2bb823a8d28f8dae49a3c5", "author_url": "http://www.purchaseordersystem.net", "date": "Jun 11, 2010", "message": "Hi,\nWhen the browser makes a request for a static image and sends cookies together with the request, the server doesn’t have any use for those cookies. So they only create network traffic for no good reason. You should make sure static components are requested with cookie-free requests. \nThanks"}]}