{"response": [{"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 17, 2008", "message": "Also -- the HOW IS BABBY FORMED references are related to this\n\nhttp://www.somethingawful.com/flash/shmorky/babby.swf\n\nhilarious flash bit based on perennial internet whipping boy Yahoo! Answers."}, {"author_name": "Josh Millard", "gravatar_hash": "8556724f6047e514354a7148bec90f34", "author_url": "http://joshmillard.com/", "date": "Sep 17, 2008", "message": "Thanks, Joel and Jeff, for having me on.  It was a great talking to you two; I had a blast.\n\nA quick mod team shout-out here, since I fell down on the job a little during the actual conversation: \n\n- <a href=\"http://a.wholelottanothing.org/\" rel=\"nofollow\">Matt \"#1\" Haughey</a>, <a href=\"http://www.librarian.net/\" rel=\"nofollow\">Jessamyn West</a> and <a href=\"http://joshmillard.com/\" rel=\"nofollow\">I</a> are the three folks doing the day-to-day moderation on the site.  Our other two team members are: \n\n- <a href=\"http://onfocus.com/\" rel=\"nofollow\">Paul \"pb\" Bausch</a>, the designated coder for the site, who has really done a tremendous job of getting Metafilter up-to-date feature-wise over the last year and a half and built some excellent administrative tools for us to help keep site administration manageable, and\n\n- <a href=\"http://www.metafilter.com/user/10705\" rel=\"nofollow\">vacapinta</a>, our not-quite-antipodal Midnight Mod in Europe, who keeps an eye on the site -- and puts out fires as needed -- during the US wee hours when the main mod staff is sleeping."}, {"author_name": "mmp1", "gravatar_hash": "83bcb6a6206265dc4456d6ef85c9b80d", "author_url": "http://www.missingmatterproductions.com", "date": "Sep 17, 2008", "message": "One option that may help as the site scales is to allow a user to set up a default tag filter.  That way they are presented with new questions in areas they are interested in first and may even have expertise.  That might allow sub communities to form around areas of expertise.  I am not saying you limit a user only to their tags, but only show new questions around what the user has given an interest in.  If a user wants to see the question meta stream (?) then they can just click on \\show all new questions\\.  Could also use the tags when setting up RSS feeds for new questions."}, {"author_name": "Ian Anderson", "gravatar_hash": "60b1c7dc18e08e1a16f313354814744f", "author_url": "http://thefirstpost.co.uk", "date": "Sep 18, 2008", "message": "Jesus, Jeff.... Have you not slept at all this week? You sound really out of it on the podcast. Many congratulations on launching, but most of all on managing to survive the load. I guess the traffic has probably dropped by now but it's just as snappy to use the site as ever. Great job."}, {"author_name": "Josh Parris", "gravatar_hash": "92f446269f65ef4213e94bd99aa3e475", "author_url": "http://parris.josh.com.au/", "date": "Sep 18, 2008", "message": "Jeff, you got the URL terribly wrong.  Get some sleep!  You have to be banking it away now, before baby arrives!"}, {"author_name": "Gerhard Weiss", "gravatar_hash": "311d5fa462a87c9f31294876a55a1e1b", "author_url": null, "date": "Sep 18, 2008", "message": "One minor thing I noticed with this Podcast is the download episode number should be changed from 21 to 22.\n\ni.e. changed from\nITC.SO-Episode21-2008.09.16.mp3\nto\nITC.SO-Episode22-2008.09.16.mp3\n\nPretty cool website Jeff and Joel! Keep rockin."}, {"author_name": "seanyboy", "gravatar_hash": "a6290b5e35e53243e42655c62b2f3705", "author_url": null, "date": "Sep 18, 2008", "message": "I'm still awaiting my \"Advertising your new site\" badge on stackoverflow.com"}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://robspages.net", "date": "Sep 18, 2008", "message": "A T1 line for your phones? Doesn't that defeat the cost saving purpose of IP Phones? Are T1's even worth the ridiculous cost for internet access?"}, {"author_name": "Runar Os", "gravatar_hash": "d3bddebbf2af12db29ffdfc939ec900e", "author_url": null, "date": "Sep 18, 2008", "message": "About the metadiscussion around Stack Overflow. The thing is that Stack Overflow is a great place to discuss things like Stack Overflow. Even things like bugs and suggestions. I'd actually prefer to report bugs and suggestions on Stack Overflow rather than creating yet another account with an username and a password on User Voice.\n\nMy suggestion is that the metadiscussion should take place in questions tagged \"stackoverflow\". At the same time, hide the questions with this tag from the startpage, only allowing to show them by selecting the tag (or perhaps make a subtle link somewhere on the mainpage)."}, {"author_name": "ejunker", "gravatar_hash": "5aaf05ebaccc935b15ce7c6b51876b4e", "author_url": null, "date": "Sep 19, 2008", "message": "In regard to StackOverflow being C# heavy, if you check The TIOBE index http://www.tiobe.com/index.php/content/paperinfo/tpci/index.html you will see the following rankings. Note how C# is in at 8 behind Java, C, PHP, Python and Perl. So yes I agree with the people that think the site was disproportionately C# centric."}, {"author_name": "Gerhard Weiss", "gravatar_hash": "311d5fa462a87c9f31294876a55a1e1b", "author_url": null, "date": "Sep 19, 2008", "message": "&gt; the HOW IS BABBY FORMED references\nJeff,\nIt is going to be hard to keep Stackoverflow completely pure but it should be better than Yahoo! Answers by a long shot.  Here is a Sleeping Disorder problem posted on Stackoverflow and I must admit I read it.\n\nhttp://stackoverflow.com/questions/90268/sleeping-problems-computer-addiction\n\nI did notice none other than fellow mega blogger Scott Hanselman did an edited.\n\nLastly congrates on your new BABBY. Just think, after a kouple of late knighters withh your knew BABBY you wil be rightin like that Yah! Answer posting."}, {"author_name": "Dave Salmonson", "gravatar_hash": "742da429b9b275e068ee0a770c893856", "author_url": null, "date": "Sep 19, 2008", "message": "Jeff,\nFor the sake of sticklers for detail, the filename for Podcast #22 suggests the show is actually episode #21 (ITC.SO-Episode21-2008.09.16.mp3).\nDave"}, {"author_name": "Josh Millard", "gravatar_hash": "8556724f6047e514354a7148bec90f34", "author_url": "http://joshmillard.com/", "date": "Sep 22, 2008", "message": "I can't help but notice that progress on the wiki transcription is favoring Joel \"People Do Stuff For Free Because They Want To\" Spolsky's lines while neglecting Jeff \"No, Seriously, Bribe Them\" Atwood's part of the conversation.  Nice to see points-for-style bluff calling in your crowdsourcing.  :)"}, {"author_name": "raj", "gravatar_hash": "f764e60e95b149fd9fbfc6ddf241d872", "author_url": null, "date": "Oct 15, 2008", "message": "Hi Guys \nThe download version of this podcast is named as Episode 21 instead of 22!!!"}, {"author_name": "ian_scho", "gravatar_hash": "3766633ae0ff2462258470481447062b", "author_url": null, "date": "Jan 12, 2009", "message": "@raj &amp;&amp; Dave  Indeed.  But at least the date part in the file name is different, so thay are two different files."}, {"author_name": "Replica handbags china", "gravatar_hash": "f722f4d61e7ac2111652dda7039bd497", "author_url": "http://www.besthandbagsmall.com/", "date": "Oct 16, 2010", "message": "i would like to share vth my friends who r working on it!thanks lol!!"}]}