{"response": [{"author_name": "Dumbfounded", "gravatar_hash": "c1fb4ba7d47006641a03aa6eb53cc218", "author_url": null, "date": "Sep 03, 2008", "message": "First!  Hellz yeay!"}, {"author_name": "Benjamin Perdomo", "gravatar_hash": "bc3e5f25463559d4e90762d1d7d6066d", "author_url": null, "date": "Sep 03, 2008", "message": "Great to hear you finally solve the problem"}, {"author_name": "Joshua Poulson", "gravatar_hash": "4b03937a913b4cd620779cecf18a2b0d", "author_url": "http://pun.org/josh/", "date": "Sep 03, 2008", "message": "Like real life outsourcing, don't go third party with core competencies..."}, {"author_name": "Euro Micelli", "gravatar_hash": "a905a92a336eaea1b936c100ec49e229", "author_url": null, "date": "Sep 03, 2008", "message": "The Twilight Zone has a way to leave lasting impressions on people. I couldn't help but think about \"To See the Invisible Man\".\n\nhttp://en.wikipedia.org/wiki/To_See_the_Invisible_Man_(The_Twilight_Zone)\n\nIf you have seen it, you know what I'm talking about. If you haven't, ignore the plot summary above; try to find it and watch it. Just thinking about it makes you want to go hug someone.\n\nI didn't know it was a Silverberg story. Not shocking. Some of the best SF in the movies and TV is invariably based on writings by some of the Masters of SF. This one is right up there with \"The Star\" (but I like the TZ ending better than the Clarke one)"}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Sep 03, 2008", "message": "I personally log to a different database for my projects, because there is no reason to perform logging which is a development function with production data."}, {"author_name": "John Millikin", "gravatar_hash": "4acd21acc7b1f605466f2f48189a7177", "author_url": null, "date": "Sep 03, 2008", "message": "&gt; Should you rely on third party libraries, or “find the dependencies and eliminate them“?\n\nIt depends on how well the third-party libraries work and how complex the problem is. For example, I would rather become a monk than develop another modern website without jQuery. And the world doesn't need another template renderer, XML parser, MD5 implementation, etc.\n\nBut sometimes, none of the existing libraries work the way I want. Worse, their developers may have an idea for how they *should* work that conflicts with what I think. At this point, the only options are to fork or roll your own -- the choice boils down to what would be easier."}, {"author_name": "Euro Micelli", "gravatar_hash": "a905a92a336eaea1b936c100ec49e229", "author_url": null, "date": "Sep 03, 2008", "message": "About the unlogged edits within 5 minutes:\n\nI agree with Jeff on this one. There are special cases where tweaking is beneficial.\n\nDid you know that (in Windows) if you create a temporary file, delete a file in the same folder and rename the temporary file to be the same name as the original one (all within a short period of time), Windows will make sure that the new file will *look like* you just edited the original file in place?\n\nhttp://blogs.msdn.com/oldnewthing/archive/2005/07/15/439261.aspx\n\nExpected? No. Intuitive? Don't know. But the end result *is* very natural and \"looks right\"."}, {"author_name": "Sameer Alibhai", "gravatar_hash": "20b490db395d21e97e4707a8c7e649d4", "author_url": "http://www.sharpdeveloper.net/", "date": "Sep 03, 2008", "message": "Why don't you guys outsource your transcript to someone overseas? You can get 1 hour done for like $2 or $3"}, {"author_name": "Euro Micelli", "gravatar_hash": "a905a92a336eaea1b936c100ec49e229", "author_url": null, "date": "Sep 03, 2008", "message": "&gt;Why don’t you guys outsource your transcript to someone overseas? You can get 1 hour done for like $2 or $3\n\nWhy would they want to do that? People do it for free right now :-)"}, {"author_name": "Kevin M", "gravatar_hash": "173cfbfa3ef0cc7d19d5bd045b2eab5b", "author_url": null, "date": "Sep 03, 2008", "message": "Jeff,\nRegarding the discussion about editing, rep, time limits, etc. Have you considered what the guys at 37Signals have done on their writeboard applet?\n\nThe idea is that the author of a comment decide whether the changes he/she makes are significant enough to warrant a new version (with history) being created.\n\nIn the StOvFl use case, the author could decide whether to make a minor edit (and receive no rep, credit or history) or a major edit (to which the app's rules would apply).  This lets us lousy typists cleanup our work w/o invoking the rules.\n\nJust a thought...\n\nJoel, I've listened to each podcast (haven't met your Dad yet..) and to address your 2nd biggest problem, try not offering any opinion as to 'how' to solve a particular problem.  Help the team clarify the issue but close it up when it comes time to batting about solutions.  Might be hard for you to do, but when FogCreek is 200 people it will serve you well."}, {"author_name": "Chris Leary", "gravatar_hash": "8a402d20d15c0443ea4fe3207bf308a9", "author_url": "http://blog.cdleary.com", "date": "Sep 03, 2008", "message": "One caveat of the semi-permeable filtering is that every time you modify the filter you have to run all entries in the database through it to ensure compliance.\n\nFor example, if you modified the filter to patch a security vulnerability, every entry is potentially compromised and you end up with a pretty heavy load that can't wait: either a CPU load from the filter if it's complex or an I/O load on the DBMS if the filter is simple.\n\nPersonally, I'd go for a filter that was:\n\na) As simple as possible, but no simpler (thus least likely to change).\nb) Has as many eyes looking at it as possible. (So long as these eyes are connected to intelligent brains in some way -- brains in vats can come too.) It's also best if those eye/brains have some experience with the filter and the thing it's filtering.\nc) Not my responsibility to maintain.\n\nJeff seems to have taken steps to meet the first two criterion, but the third party libraries seem to have the upper hand in the last two. I guess if something like using embed tags in ReStructuredText were totally critical to my app, I'd have to roll my own filter as well.\n\nI kind of wish that Jeff had gone into those reasons-that-he-wasn't-going-to-get-into for those of us who weren't just flaming Stack Overflow's decisions. Now they've got me thinking about it! :)"}, {"author_name": "John Hirbour", "gravatar_hash": "485c859c0d3a7fe5764d9beda91815ac", "author_url": "http://www.hirbour.org", "date": "Sep 03, 2008", "message": "We started using syslog a long time ago for our C#/.NET applications. We were finally able to integrate our C#/.Net applications with the rest of our Linux/Solaris logging. \"swatch\" the logs on and report on them. Plus the whole syslog and forward thing that syslogd provides logs and backup logs."}, {"author_name": "agnul", "gravatar_hash": "ee62f45441fbf8409dfd4adaa40a74aa", "author_url": null, "date": "Sep 03, 2008", "message": "Log? Database? You people are sending log messages to the database?! AAAAAARGH! Can you sed|awk|grep a database?! :-)\n\n(That said I usually log way to much stuff... to plain text files!)"}, {"author_name": "tamberg", "gravatar_hash": "dc82c3d4e43c9a8deed298dd9e072436", "author_url": "http://blogs.oberon.ch/tamberg", "date": "Sep 04, 2008", "message": "\"What’s your logging philosophy?\"\n\nWe prefer Modularity (David Parnas) and Design by Contract (Bertrand Meyer) to Tracing and Logging.\n\nRegards,\ntamberg"}, {"author_name": "mmp1", "gravatar_hash": "83bcb6a6206265dc4456d6ef85c9b80d", "author_url": "http://www.missingmatterproductions.com", "date": "Sep 04, 2008", "message": "With regards to the logging bug is there a bug fix that stackoverflow are able to give back to the community? Could this be Jeff's PhyscoMilt moment (for more details on PhsycoMilt and the context,  I refer to Clay Shirky at http://www.ted.com/index.php/talks/clay_shirky_on_institutions_versus_collaboration.html - it'w worth listening/watching the whole thing but PhyscoMilt is about 10 mins ) since this site is so inspired by Clay's work it only seems right :-)"}, {"author_name": "Steve", "gravatar_hash": "c8fc6f50eb2ceb57df0197176d6cb709", "author_url": "http://www.tektalkin.co.uk", "date": "Sep 04, 2008", "message": "Does SQLServer support autonomous transactions ?  Could this not be used for logging ?"}, {"author_name": "Steve", "gravatar_hash": "c8fc6f50eb2ceb57df0197176d6cb709", "author_url": "http://www.tektalkin.co.uk", "date": "Sep 04, 2008", "message": "Having been using Oracle for years the problem of reads blocking writes and writes blocking reads is not something I have to deal with :-)"}, {"author_name": "Juan", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Sep 04, 2008", "message": "Won't this new limit for editing encourage adding more information in the form of answers instead of editing the question? I liked editing it to provide more info"}, {"author_name": "Nathan", "gravatar_hash": "adfe9bec7e8981034f509f4d76242c3a", "author_url": "http://www.nbirkes.com/", "date": "Sep 04, 2008", "message": "I can't download the mp3 in using Chrome. Works fine in FireFox."}, {"author_name": "Andrew Cameron", "gravatar_hash": "4466fde5314c4361853e95c1f892e191", "author_url": null, "date": "Sep 04, 2008", "message": "Just wanted to make a comment about the edit limit that I was stung by and found rather unfair.  I made a post, someone re-tagged it, then someone else removed one tag that the previous person had put in, then I edited all of 10 minutes later to post an additional fix, and suddenly my post didn't belong to me!\n\nThe alternative to this would have been for me to post a comment with the new fix, but depending on the comments / voting that wouldn't have necessarily been attached or near to the original post.  Therefore in ensuring that others benefitted from the additional knowledge, I stood to lose all rep associated with the question because two others edited my tags.\n\nTo this end, I would propose that editing the post moves it to the top and counts towards a community edit, but tag edits don't affect the post in any other way than changing the tags.\n\nJust a thought!"}, {"author_name": "Bruce", "gravatar_hash": "973ccd275c91ccb5fb0ea74716b9cbf7", "author_url": "http://galactic-patrol.spaces.live.com", "date": "Sep 04, 2008", "message": "Consider posting two-minute segments of the podcast on the wiki - it would make piecemeal transcription much easier.  Just click on one of the audio links, type in two minutes worth of transcript, and move on."}, {"author_name": "alex", "gravatar_hash": "ac7d13a55a5d6af18586aea10ed8ef68", "author_url": null, "date": "Sep 05, 2008", "message": "On the podcast Joel was talking about how nerds will try to solve the problem of jumping to the roof of the building next door in case of a fire. It instantly made me think of this comic http://xkcd.com/356/"}, {"author_name": "Michael Schall", "gravatar_hash": "364a82690a18c39bf042f46655a11243", "author_url": null, "date": "Sep 05, 2008", "message": "I agree with @mmp1.  Did you report a bug or even better a fix to log4net (https://issues.apache.org/jira/browse/LOG4NET)?  We use it in most of our projects without issue (we don't log to the database which sounds like the root of your issue).  Could you at least give more information about the bug so the community can benefit from your experience?  What appenders where you using?\n\nI'm curious how you debug production issues if you don't at least log errors somewhere."}, {"author_name": "Jason", "gravatar_hash": "8170deb73d6e2169e227aa588a0b32b8", "author_url": null, "date": "Sep 05, 2008", "message": "Re - \"The Great Brain\".  John (JD) was the little brother and narrator, Tom (TD) was the middle brother known as the \"Great Brain\".  The family's last name was \"Fitzgerald\".\n\nhttp://en.wikipedia.org/wiki/The_Great_Brain"}, {"author_name": "Roger Pence", "gravatar_hash": "bb3427b02a0f39597861faf8d9bb7316", "author_url": null, "date": "Sep 05, 2008", "message": "Jeff was right. Joel has jumped the shark. During my drive home the other night, while listening to Joel's five minute dissertation on why the Excel team wrote their own compiler, I considered moving over to the wrong lane to ease my pain. \n\nJoel, I love you, man. I've read you for years and respect you greatly. When you're concise and on point, it matters, But when you ramble the podcast really sucks. I don't know what's worse, listening to your incessant rambles or the pitiful little burps Skype makes as Jeff tries, usually without much luck, to steer you back to the topic at hand.\n\nSincerely and with respect,\nrp"}, {"author_name": "Clayton Smith", "gravatar_hash": "b82bc3b52bcb916483b5e6dc06f30e21", "author_url": null, "date": "Sep 05, 2008", "message": "Logging littered throughout the code really can't be avoided. However, I've seen a lot of code that has \"entering method foo\" and \"exiting method foo\". I like to do trace logging declaratively. One way I've accomplished this in the past is using AOP, like that which is provided by Spring, Spring.NET, or AspectJ."}, {"author_name": "Brad Bruce", "gravatar_hash": "74a1ca16a47463653c50f487b2c96b2d", "author_url": null, "date": "Sep 06, 2008", "message": "Why not?\n\nI've been listening to you the podcasts since #2.\n\nIt's great to hear differing, but valid, opinions discuss an issue.  Anyway, I missed a few podcasts and then went back to catch up.  I missed the initial comments that the beta was opening up.\n\nI've submitted my information (twice) and haven't heard back.  Not that it's a huge deal, but I've seen numerous sites come and grow, but never been in on the ground floor.  I think your concepts are unique and should fix a lot of the problems I've seen in other sites.\n\nPlease, I'd like to get in on the beta.  The \"beta badge\" wouldn't hurt either "}, {"author_name": "Hoffmann", "gravatar_hash": "f8843df072044a5437e6b41214094065", "author_url": null, "date": "Sep 07, 2008", "message": "Thou shalt study thy libraries and strive not to re-invent them without cause,\nthat thy code may be short and readable and thy days pleasant and productive. (Henry Spencer)"}, {"author_name": "Ben", "gravatar_hash": "ab4250f596ff60b9a1e6ed07036597ca", "author_url": null, "date": "Sep 07, 2008", "message": "FWIW, re: windbg.exe.  When I was at Microsoft in the Xbox team early on, that frequently-encountered tool was always internally pronounced \"wind-bag\". (It's no i386kd!)"}, {"author_name": "Timo Saikkonen", "gravatar_hash": "f14533c4b39ed8104db2e6bc28607cc6", "author_url": null, "date": "Sep 12, 2008", "message": "Regarding the edit time limit:\n\nI thought the phpBB ghost edit system worked in the way that if you edit the post before anyone replies to it, the edit stamp doesn't get applied. Have you thought about this?"}]}