{"response": [{"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 11, 2010", "message": "thanks Benjol, ChrisF, Richie.. de-chuffed, and re-miffed."}, {"author_name": "cori", "gravatar_hash": "a8dfb17f9483b5eb3b489e87578f7bbf", "author_url": "http://kinrowan.net", "date": "Aug 11, 2010", "message": "Glad you're following up on these jerks - the terms aren't difficult to find or to follow, and I think they're very generous.  That said, however:\n\n\"WordPress.com will instantly cancel their entire account\"\n\nIf true, WTF?\n\nLuckily, not true: http://automattic.com/dmca/"}, {"author_name": "Kibbee", "gravatar_hash": "2b568071163c0d009635cfa63cf6e6ac", "author_url": "http://www.kibbee.ca", "date": "Aug 11, 2010", "message": "Good idea for following up.  This is one place where the DMCA actually does some good for the little guy.  I think the real reason that there's a lot of people ripping off your site, is that you make it so easy.  They don't even have to scrape your site. They can just download the data dump every month, and get a complete list of questions. There's no reason for these sites to spider at all, because they can do well enough with just the data you give them.  Not that I'm saying you should stop the data dumps, but it's just something that makes it so much easier."}, {"author_name": "Jeff", "gravatar_hash": "6d81d6dc131240aff73b92c2777f1737", "author_url": null, "date": "Aug 11, 2010", "message": "That's a lot of attribution to use a one-line code snippet about how to do a loop in c# (for example). \n\nThankfully, most of the content is information, so I don't have to copy the code, just use the information."}, {"author_name": "überrationell", "gravatar_hash": "612da4ac0e7f6768f98a9df5325a3c05", "author_url": null, "date": "Aug 11, 2010", "message": "The only sad part here is, again, Google. It seems that theres some kind of vicious circle at work: search results get swamped with bullshit results, stolen content with ads and spyware/trojans on it, until all the crap reaches a critical mass and is finally deleted. A year later, rinse and repeat. Instead of buying all kinds of startups, launching services and killing them off a year later, having \"Beta\" signs all over their stuff and like 10+ projects in various vastly different areas of buisness active at the same time, they should work on their _core technology_, which is search.\n\nThis problem simply wouldn't exist if it wasn't for Googles broken rating."}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": null, "date": "Aug 11, 2010", "message": "You should also mention that the links should not be rel=\"nofollow\" or however you do that. Because that's just wrong."}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://quickmediasolutions.com", "date": "Aug 11, 2010", "message": "Uhm... how would hyperlinks to user profiles work in a book?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 11, 2010", "message": "@configurator it's OK if the links are nofollowed, actually, they just need to be on the page with the content.\n\nHowever, I was noticing a few content republishing sites were using tinyurl type redirection / obfuscation back to us, which is *not* allowed."}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Aug 11, 2010", "message": "If Google wanted to improve search from the user's point of view, they'd downrank sites based on the amount of embedded ad code. Of course that would against their commercial interests..."}, {"author_name": "David Schmitt", "gravatar_hash": "f41b1342c973956dba590327908cb349", "author_url": "http://dasz.at/", "date": "Aug 11, 2010", "message": "Putting ads all over an HTML rendering of the last Public Dump is not \"remixing\"."}, {"author_name": "Larry", "gravatar_hash": "dca3f1960723db9b0d1e02a53754abe4", "author_url": null, "date": "Aug 11, 2010", "message": "Are there examples of sites that have done the attribution properly? I am seeing mostly examples of what not to do."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 12, 2010", "message": "> I am seeing mostly examples of what not to do.\n\nExactly, hence the frustration. \n\nWho knew following simple attribution rules was so <i>hard</i>?"}, {"author_name": "Bobby Jack", "gravatar_hash": "9b5c260dc8b7374186b3bebc28b08ce7", "author_url": "http://www.fiveminuteargument.com", "date": "Aug 12, 2010", "message": "It always frustrates me when people license their content under CC, specifically the attribution clause, and then fail to explain it properly. If you're ever trying to use, for example, a photo from flickr, it's all well and good that the license allows you to use it so long as you \"attribute the work in the manner specified by the author\", but in my experience, no-one ever does that.\n\nKudos to SO for actually doing this properly, and including detailed instructions for what's required. The people ripping you off have absolutely no excuse."}, {"author_name": "Bobby Jack", "gravatar_hash": "9b5c260dc8b7374186b3bebc28b08ce7", "author_url": "http://www.fiveminuteargument.com", "date": "Aug 12, 2010", "message": "(as in \"no-one ever specifies how you should attribute their work\", in case I didn't make that clear!)"}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": "http://itcookbook.net", "date": "Aug 12, 2010", "message": "Yep, defend the attribution. I totally support that.\n\nBut, uhm, on another topic, I'm wondering, when will the podcast be coming back? It's been a few months now since the promised new launch in April (http://blog.stackoverflow.com/2010/03/podcast-future/ and https://stackoverflow.fogbugz.com/default.asp?W29189) - it's not like I want to rub you guys' faces in it or anything, but I've been listening to all the podcasts in reverse order, and from my POV it's one of the best podcasts out there. And when I get done listening to the 87 existing editions, what will I listen to while scrubbing floors THEN?\n\nHuh? Huh? \n\nSo get started guys, because without you, I can;t scrub floors!"}, {"author_name": "Alexandre Jasmin", "gravatar_hash": "ebb42d2495567b4d80d528b06d5f3097", "author_url": "https://twitter.com/ajasmin", "date": "Aug 13, 2010", "message": "The requirement for direct hyper-linking may not fit very well with some distribution mediums."}, {"author_name": "Anthony DeRobertis", "gravatar_hash": "05b48b72766177b3b0a6ff4afdb70790", "author_url": null, "date": "Aug 16, 2010", "message": "Jeff, you should be cautious about sending DMCA notices. At least talk to a lawyer first.\n\nThe big potential problem I see is that only the copyright holder or his agent can send a DMCA takedown; when it comes random Stackoverflow users' content, you're not either of those."}, {"author_name": "Anthony DeRobertis", "gravatar_hash": "05b48b72766177b3b0a6ff4afdb70790", "author_url": null, "date": "Aug 16, 2010", "message": "@Jeff, @Bobby:\n\nYou probably want to read the actual license legalese, http://creativecommons.org/licenses/by-sa/3.0/legalcode, section 4(c) spells out the attribution requirement. The \"manner specified by the author\" doesn't mean \"the arbitrary text specified by the author\", it means \"the name or organization the author specifies\""}, {"author_name": "Alexandre Jasmin", "gravatar_hash": "ebb42d2495567b4d80d528b06d5f3097", "author_url": "https://twitter.com/ajasmin", "date": "Aug 17, 2010", "message": "@Anthony Thanks for clarifying this"}, {"author_name": "Macneil Shonle", "gravatar_hash": "b0ca2e8d2ef589088de0420f0661f52b", "author_url": "http://www.cs.utsa.edu/~mshonle/", "date": "Aug 19, 2010", "message": "To make it easy, could you consider a link named \"Cite this work\"? It could then create a popup, where you mark the specific questions and answers you want to use. It would then generate HTML and nicely formatted text, having all of the information and links required.\n\nHaving an automated, brain-dead copy-and-paste scheme for it will increase your compliance greatly. (This is true even if them copying a few lines from here and there and pasting them is equivalent... Each single step you burden the users with exponentially increases the chances they will give up or take a short cut.)"}, {"author_name": "Jose_X", "gravatar_hash": "ff79e9e9243739aca995524c629c33aa", "author_url": null, "date": "Jan 10, 2011", "message": "@Anthony DeRobertis\n\nThe requirement from 4(c), to attribute to the author and a link of the author's choosing, for *each* comment contributor is why I think the requirement appears a tad complex.\n\n[As an aside, why is the license name specified at the bottom of this page CC-by-nc-sa rather than CC-by-sa?]"}]}