{"response": [{"author_name": "RandomBen", "gravatar_hash": "04c4599036f6856ae5c2772f780c1886", "author_url": "http://randomben.com", "date": "Aug 20, 2010", "message": "Jeff, I know it would take time to develop but could there be a middle ground?  Make the 2 sites have separate URLs but make all questions asked by the ubuntu community show up both in Ubuntu.se and Unix.se?  I don't mean make 2 copies of the question but one question that shows up in 2 places?\n\nI know the technical concerns wouldn't be big but how that would affect the community would be huge.  It would open Pandora's box because other sites could request this but I do see the relevance in this case.  Ubuntu users want to see only Ubuntu questions but Unix users could answer both Unix and Ubuntu questions.\n\nThere could even be another way to do it.  Make Unix.se be the parent site.  Then make Ubuntu.se a child site that only shows questions that have the Ubuntu tag.  Then when someone makes a question on Ubuntu.se the question is forced to have the Ubuntu tag.  Make it so if a user signs up at Ubuntu.se and Unix.se the account created is the same and can log in to both sites.  That way there isn't a mess of overlapping users and confusion.\n\nThis could also be a sign that there should be a more elegant way to see all questions with 1 specific tag in them on a parent site!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 20, 2010", "message": "> there should be a more elegant way to see all questions with 1 specific tag in them on a parent site!\n\nMore elegant than ..\n\nhttp://example.com/questions/tagged/ubuntu \n\n.. which is already quite possible?\n\nThat particular argument is really just \"Java people should have their own website, they don't want to see all the Perl and Ruby and Python questions on Stack Overflow\" all over again.\n\nIt works on Stack Overflow because all programmers love the same thing: code. So they have a shared goal.\n\nTo the extent that the Unix and Ubuntu guys/gals love the same thing, and have a similar shared goal, they should have a single site. \n\nAnd if that's not true, they shouldn't."}, {"author_name": "RandomBen", "gravatar_hash": "04c4599036f6856ae5c2772f780c1886", "author_url": "http://randomben.com", "date": "Aug 20, 2010", "message": "Interesting.  Alright, I see your point :) I was looking at it from my Stack Overflow experience with multiple tag following which is very different.\n\nI think I get it now. This is a very interesting thing.  Thanks Jeff!"}, {"author_name": "Peter Smit", "gravatar_hash": "56586328ab69d46520cf729d2c46c58b", "author_url": null, "date": "Aug 20, 2010", "message": "Until when are the polls open? And are intermediate results visible?"}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Aug 20, 2010", "message": "heh, tricky situation. And I think you're right, the communities are biased. Then again, as long as both communities are functional (and no one knows what the best decision is), it's not the end of the world if they make the suboptimal choice.\n\nTo be honest, I'm more interested in how you're going to deal with this situation in the future, as new overlapping sites are proposed. The easiest way to deal with it is probably to adjust the proposal procedure or establish some guidelines allowing you to catch the overlap early on and, in the cases where you deem it a good idea, merge them.\n\nIf overlapping sites *keep* getting created, it'll eventually water down the entire SE network.\n\nIf you're up for another little challenge, how about the gamedev site vs StackOverflow?\nOf course, the gamedev one deals with non-programming subjects as well, which it should keep doing, but it seems an odd beast, born out of a common interest (we want to make games) rather than a common set of questions/answers/skills\n\nA game programmer can get better programming answers to his programming questions on StackOverflow, where most of the programmers are, than on gamedev.stackexchange.com, which is full of designers and writers and artists who can't code, and gamers who can't code but *want to*. I've already had a few discussions in comments on SO, with people who suggested (or demanded) that a question was asked on the gamedev site instead *because it was about game programming*. And likewise, a 3d artist would get far better answers to *his* questions on a hypothetical 3D art StackExchange site than on gamedev, which is full of all those artistically impaired programmers.\n\nI think that's a case where the overlap might be more harmful than the Unix/Ubuntu case, because it mixes so many people who aren't actually able to answer each others questions, and it hides those questions from the bigger sites where far more people would see them and be able to answer them.\n\nAnd I'm not sure what the solution is, especially now that the gamedev site has existed for so relatively long, and changing its scope would seem pretty invasive. Ideally, I would have restricted the gamedev site to those concerns that are really unique to game development (say, game design, and maybe working with modding tools and such), while directing game *programming* questions to SO, and *art* questions to, well, surely there ought to be one or more sites for that, where people who work with the same things (say, 3d animation) can get together and ask/answer questions, whether they work in movies or games or academia or somewhere else.\n\nFollowing on from this thought, would it make sense, at some point during a site's public beta to have an option of sending it back to the drawing board, and putting it in the express lane for a second try? Basically put it through another definition phase, followed by a shortened beta, primarily aimed at seeding the site, and verifying that the traffic is still there. I guess it's basically a more agile process, where the scope and definition of the site is adjusted repeatedly and iteratively, rather than the current waterfall model where *first* we find out what the site is about, *then* we fill it with content, and *then* we see if it was actually a good idea.\n\nIt is possible the same would make sense for the Ubuntu site. Perhaps, instead of merging it into Unix, it should simply have its scope adjusted to minimize the overlap. (although I don't know what this new scope should be)"}, {"author_name": "raven", "gravatar_hash": "1426f2e3692f98db654b81c87bc0dc91", "author_url": null, "date": "Aug 20, 2010", "message": "This shouldn't be left up to the members of the two communities.  As you said in your second-to-last sentence, \"I still have some lingering concerns that communities are internally biased in matters like this...\".\n\nThere is so much overlap between these two sites that it really seems like an unnecessary dilution of resources to maintain both.  In your \"Why both?\" post, you quoted an Ubuntu supporter as saying, \"The Linux proposal, in comparison, explicitly targets “advanced users,” in which I have no interest.\"  I don't buy that.  That's like saying VB.NET users are scared away from SO because there are people there asking questions about C and Assembly language.\n\nMerge 'em."}, {"author_name": "Jim", "gravatar_hash": "4c8a9bec5a27b66b28d3c5cddeb70e93", "author_url": null, "date": "Aug 20, 2010", "message": "Merging the two would be a big mistake for both communities. The Ubuntu SE is like SuperUser and the Linux SE is like ServerFault. You wouldn't combine SuperUser and ServerFault because they're both about computers, and that's essentially what you're saying about Linux vs Ubuntu."}, {"author_name": "Miguel de Icaza", "gravatar_hash": "2f7d76c50d0b76b8ce21808ab68e93d1", "author_url": null, "date": "Aug 20, 2010", "message": "I can see that some people scared of tags might want to use different stack exchanges for \"linux people\" and \"linux people that use user friendly UIs\".\n\nIn that case, I feel that we should rename the Ubuntu stack exchange to be the user friendly/newbie site, and let this cover other Linux distributions that are user focused/user centric.\n\nConsidering that the majority of the user visible code that even ships in Ubuntu is actually developed at Red Hat, Debian and other companies and only a tiny fraction of the user experience is contributed directly by Ubuntu, it seems that an Ubuntu stack exchange discriminates the actual sources of innovation that have made Ubuntu successful."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Aug 20, 2010", "message": "Can we not use .se as a shortcut for .stackexchange.com ?  .se is also Sweden's TLD."}, {"author_name": "Leigh", "gravatar_hash": "ee5afb6712dc265de3e0a0dd253edbf1", "author_url": null, "date": "Aug 20, 2010", "message": "If tagging were the solution new sites would consist merely of new urls that forward to particular tags in one massive site.  There would be no need for even the original trilogy let alone the many sites that are now proliferating.  \n\nI also am concerned that only members of these communities are allowed to vote.  If the results were to only effect these sites that would be fine, but the results will likely effect every other proposal that can be construed as overlapping such as\nhttp://area51.stackexchange.com/proposals/4260/outer-join\nand \nhttp://area51.stackexchange.com/proposals/6223/oracle-databases"}, {"author_name": "Ikke", "gravatar_hash": "b6a1e3fd5aa3491eda6acc5973059ebd", "author_url": null, "date": "Aug 20, 2010", "message": "@Jim:\n\nWhat is it that makes Ubuntu special above other distributions (outside of it's popularity) that it deserves it's own SE? What if some beginnen uses Mint or Fedora? Is he banned to the \"professional\" unix SE?"}, {"author_name": "txwikinger", "gravatar_hash": "4d2d9514d8c1d2fc1f3f5e16a0d5eb41", "author_url": "http://drupal.txwikinger.me.uk", "date": "Aug 20, 2010", "message": "@Miguel: why do you think you can dictate another community how to name their site?\n\nMaybe it would be helpful if you would try to figure out what \"Ubuntu\" stands for (hint: this was actually a <a href=\"http://ubuntu.stackexchange.com/questions/424/what-does-ubuntu-mean/425#425\" rel=\"nofollow\">question</a>. Ubuntu is the perfect word for what we are doing.\n\nPlease also disclose where your income comes from, and how there could be a conflict of interest in this question. (DISCLAIMER: I am myself in no way paid or associated with Canonical. I am merely a volunteer member of the Ubuntu community).\n\nIf you think that our site has such an effect, why don't you convince your employers to support doing something similar for them?\n\nIn any case. This is not about it. This is about helping people. A lot of Ubuntu users do not care about the differences between different distros. They would not look for help at a generic Linux site. \n\nAlso, Ubuntu stands for a certain code of conduct that has shown itself as very successful. We would like to maintain this also on ubuntu.stackexchange.com. It is an integral part of our community and very important to us, and I believe to new Linux users that come to us for help. \n\nTherefore, lets keep things as they are. We add to each other. This is what it is about.\n\nLet's stop waste our time in this tribalism and instead help each other on their particular sites!"}, {"author_name": "dfalk", "gravatar_hash": "2b1647cd8d833dcdd34c3045dd625f96", "author_url": null, "date": "Aug 20, 2010", "message": "I echo some of the previous posters that originally thought there should be one site.  \n\nI mean for that matter, I don't see why we can't have one big site about computers, and use tags to sift out stuff that doesn't follow our interests and expertise.  Tags currently aren't that powerful though I'll concede.\n\nAnyway, if we can't have one big site, then I would definitely say that Unix and Ubuntu are very different.  It might even be one thing if it were Linux and Ubuntu, but that it comprises all unix...no.  Very broad and too much of that falls out of what Ubuntu's target audience cares about.\n\n@txwikinger I may be wrong, but it sounds like you're just one of the many people who loves to hate Miguel.  Beside which, he's pretty well known.  I think most people know who he is."}, {"author_name": "Thomas Owens", "gravatar_hash": "8579087f6aad114044755cd7d64a36c9", "author_url": null, "date": "Aug 20, 2010", "message": "I don't get why anyone would not support this merger. Looking at the Ubuntu Exchange, most (if not all) of the questions are either applicable to multiple distributions or can be solved by anyone with knowledge of any distribution. And for the few questions that don't fall into one of those two categories, you have the ubuntu tag.\n\nBy merging, you gain EVERYTHING and lose NOTHING. You gain more people looking at the questions. You gain a central repository for all Linux/Unix knowledge that's more easily searchable - no looking in multiple places for questions. You gain more experts (the experts of the Fedora, Ubuntu, Debian, Arch, SUSE, Slackware, Gentoo, CentOS, and BSD communities) in one place sharing knowledge and experience (isn't that the point of a Stack Exchange anyway?). I can't think of a single downside to this merger."}, {"author_name": "Greg Bray", "gravatar_hash": "da1209aa320f9bbebbf128ac6a0751d3", "author_url": "http://blog.theg2.net", "date": "Aug 20, 2010", "message": "I like the approach as it absolves Stackexchange from blame, but I am pretty sure that the outcome will be that both sites vote in their own best interest. Just like from the Minority Report movie: Dr. Iris Henimen http://goo.gl/DKrE\n\n\nI say keep them separate and let them thrive or die on their own merits. Any argument you can make for merging Ubuntu into Unix/Linux could also be made for merging that site into SU/SF. If Ubuntu survives then it shows their users want a personalized and isolated community. If they don't survive and take down the chance of a Linux/Unix community with them then it will be a learning experience and SO/SF will pick up right where they left off."}, {"author_name": "Thomas Owens", "gravatar_hash": "8579087f6aad114044755cd7d64a36c9", "author_url": null, "date": "Aug 20, 2010", "message": "Greg: At the same time, not merging could also mean that the community is fractured and neither site can continue to function. In order to have a community, you need people to ask and answer questions. If you start sending Ubuntu users and experts to a separate exchange, you take away from people who can allow Unix/Linux to grow to its full potential. You need as many people as you can to let the community grow, and that means not having an Ubuntu exchange.\n\n(As an aside, I think that in a few months, Super User will be pretty much dead. Between the Unix/Linux and Apple exchanges in beta and the proposed Android exchange, the only things left on SU are hardware and Windows, unless they expand to include smart phones like Blackberries. Good job, guys.)"}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Aug 20, 2010", "message": "Was there a reason that both of these sites needed to be distinct from SU?"}, {"author_name": "Jonathan", "gravatar_hash": "2220773b067e537bc4e78f4553a09639", "author_url": null, "date": "Aug 20, 2010", "message": "To be perfectly honest, I don't understand why so many similar topics are on Area 51. All it does is cause people looking for answers to go to multiple places and search for the same question - to repeat what was said above, that's what tags are for.\n\nAt this instant, there is a streak of three \"hottest proposals\" on Area 51 that ALL are a subset of topics that I would search for in the original stack overflow site (Software Engineering, Application Security, Compiler Design), followed by one filed in super user (Apple), followed by a topic that falls in the Gaming beta (Role Playing Games), followed two other Stack Overflow subsets (Android Development and Developer Testing). \n\nTHESE ARE NOT SITES ON THEIR OWN. The risk of over-fragmentation is that there is no one place developers can go to get their questions answered. When this happens, people won't think of you anymore."}, {"author_name": "Radek Slupik", "gravatar_hash": "fb6b00fdfa29e2987bcd010e66db12d0", "author_url": null, "date": "Aug 21, 2010", "message": "I think it should be merged with SuperUser? StackOverflow, SuperUser and ServerFault are great sites about computer-stuff. Now, I need to have, let's say fifty accounts for all my computer questions, spread across different sites.\n\nArea51 should be only about non-computer stuff. It already sucks now. I mean, questions about Web Applications. Do they belong on SuperUser or WebApp? No one knows!"}, {"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Aug 21, 2010", "message": "squarely on the side of them being merged... is there any way to view the voting progress?\n\nAlso I see there was at least one comment on unix.SE being an 'advanced' site and not for beginners, that <a href=\"http://meta.unix.stackexchange.com/questions/29/can-we-get-rid-of-the-for-advanced-users-part-of-our-description\" rel=\"nofollow\">was</a> removed from out description.\n\nAlso will this decision affect future similar circumstances?\n\n@SuperUser comments I personally don't watch SU because it has a VERY large number of questions which I know nothing about, and I'd have to watch more than just 1 tag, I can't guarantee that all questions tagged ubuntu will be tagged linux on their for example, and I have no interest in windows, or windows software."}, {"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Aug 21, 2010", "message": "@SU part2: basically SuperUser is /too/ general and being /too/ general is a bad thing because there isn't really a target audience.\n\nEven on unix.se I will probably ignore ubuntu specific question because I know very little about ubuntu, I tried it, I didn't like it, I moved on. But I can answer lots of questions about ubuntu systems just because they are common to all Linux systems (I've helped ubuntu-ers several times in the past)"}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Aug 22, 2010", "message": "Caleb,\n\nIt seems that you would also argue that JavaScript should have a space apart from SO, because Linux/Ubuntu questions are 1/3 as common as Windows/Mac questions on SU.  As for more than one tag, I suspect almost everyone that answers questions on SO follows more than one tag."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 22, 2010", "message": "> StackOverflow, SuperUser and ServerFault are great sites about computer-stuff\n\nI think you're looking at this the wrong way. Stack Overflow is is for PROGRAMMERS (about programming), Server Fault is for SYSTEM ADMINISTRATORS (about system administration), and Super User is for POWER USERS (about computer hardware and software).\n\n> I mean, questions about Web Applications. Do they belong on SuperUser or WebApp? No one knows!\n\nYou're kidding, right? a question about Web Applications belongs on the .. Web Applications .. site.\n\nIf it's seen in your web browser, and it doesn't work unless you're connected to the internet, it belongs on webapps.\n\n(Yes, this could be a part of SU, but SU is already so broad -- covering all computer hardware and software -- that making it also include every website on the internet is a bad idea)"}, {"author_name": "txwikinger", "gravatar_hash": "4d2d9514d8c1d2fc1f3f5e16a0d5eb41", "author_url": "http://drupal.txwikinger.me.uk", "date": "Aug 23, 2010", "message": "@dfalk: I can care less about Miguel. I don't have a problem with Miguel as a person. And I doubt I hate anybody. \n\nWhat I think needs to stop is disrespecting other because they have another approach, do something different, or are plain different.\n\nLet's have everybody their space where they are comfortable, and we all can be happy."}, {"author_name": "Neal", "gravatar_hash": "2a13e1ccd5509a589c27d693dfb5f1a7", "author_url": null, "date": "Aug 23, 2010", "message": "@txwikinger:\nThe link you posted to what Ubuntu means talks about \"interconnectedness\" and \"you are connected and what you do affects the whole world.\" As such, you are obviously against tribalism and will no doubt be voting to merge the two sites.\n\nI can't quite work out what your problem is with Miguel, as he seems to be, as far as I understand it, very \"Ubuntu\" in his attitude.\n\nI'd have thought that neither site is particularly needed, and both should be covered by superuser.com.\n\nIf there has to be a split then a separate site for \"hard-core\" Linux and Unix users seems to me to be the best way to split, leaving the \"soft-core\" Linux stuff on superuser.com.\n\nIf there must be two splits, then split the soft-core Linux off from superuser.com."}, {"author_name": "txwikinger", "gravatar_hash": "4d2d9514d8c1d2fc1f3f5e16a0d5eb41", "author_url": "http://drupal.txwikinger.me.uk", "date": "Aug 23, 2010", "message": "@Neal: I don't think disrespecting a big group of Users is very \"Ubuntu\". I also don't think forcing your own ideas and wills on others is. \n\nThe existence of differences and hence different groups and sites is not tribalism. The forcing of ones way of doing things and disrespecting is.\n\nAs I said before. I support both sites as the exist today. Merging the sites would be a mistakes, due to the difference of the communities. SU is not a good site of getting good answers for Ubuntu, especially for casual users. As it says, it is for power users."}, {"author_name": "Wez", "gravatar_hash": "7cf5cd2dab3b0dc1936dc29fc112e608", "author_url": "http://kbmonkey.wordpress.com/", "date": "Aug 25, 2010", "message": "I have solved many Ubuntu issues from non-Ubuntu sources, there's more common ground than first impressions give. There is also a bigger difference in community than there is a technical one; That, in my humble opinion, is a silly difference.\n\nUbuntu has a great user base, and the support that derives from that base is fantastic. It’s this attitude towards friendly collective knowledge that will enrich the GNU/Linux half.\n\nThe GNU/Linux half will enrich Ubuntu users with the technical skills and know-how, and applying those skills effectively. Teach a man/woman to fish... you know the saying.\n\nI believe both sides can benefit if both embrace the same goal: learning new skills and honing your craft, and adding value to the community. \n\nThe common factor is GNU/Linux; Distro names might differ, but the underlying philosophy, and want to learn, shouldn't.\n\n_I don't think the other opinions are wrong, not at all, I just have a different view on this_"}, {"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Aug 25, 2010", "message": "@Eric I didn't actually comment on my opinion on the matter... I'm actually for the merging of the site's. Because I can answer questions that aren't Ubuntu specific, but as of right now I'm ignoring the Ubuntu site, and anything on the unix site with the ubuntu tag, as to me that says, this is specific to ubuntu."}, {"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Aug 25, 2010", "message": "@Jeff so any way to check the status of how this vote is going?"}, {"author_name": "Dims", "gravatar_hash": "09ed857dff833944e3b6832a8bf5ef55", "author_url": null, "date": "Dec 01, 2012", "message": "I suggest to vote again. I suggest to make unite poll. 2 years passed, and now there are thousands of people, and I suspect 98% of them are the same in both sections. When sections were in Area 51 they were guided by few enthusiasts and their opinion was too personal. Probably modern poll will show different results.\n\nIs it possible to arrange a new poll?"}]}