{"response": [{"author_name": "Mikael", "gravatar_hash": "67dc47ee859f270086f6508dff2fef76", "author_url": null, "date": "Aug 01, 2010", "message": "I think this will really help things. However, there is one related feature that seems to be missing still; tag hyponymy. It would be great to be able to say that the tags \"windows-xp\", \"windows-vista\" and \"windows-7\" are all hyponyms to the tag \"windows\" so that I only have to mark my interest or disinterest with one tag (given, of course, that I'm interested or disinterested in the whole hypernym) but still keep the granularity of the actual tags of the questions (and also so that questions don't have to be tagged both \"windows-7\" and \"windows\")."}, {"author_name": "Mark Cidade", "gravatar_hash": "6cc331c477243ced5ff968a32a7dd14f", "author_url": null, "date": "Aug 01, 2010", "message": "@Mikael the tag-hyponymy idea sounds like SKOS brat"}, {"author_name": "Mark Cidade", "gravatar_hash": "6cc331c477243ced5ff968a32a7dd14f", "author_url": null, "date": "Aug 01, 2010", "message": "Er, I mean SKOS: http://www.w3.org/TR/2009/REC-skos-reference-20090818/#semantic-relations"}, {"author_name": "BCS", "gravatar_hash": "6757caf55de0413ae0994293e001d465", "author_url": null, "date": "Aug 01, 2010", "message": "Can the tag auto suggest be tweaked to indicate what mappings will happen (or better yet actually apply them)"}, {"author_name": "Greg", "gravatar_hash": "fbc59b6c6e17ba733ee6885266235b2d", "author_url": null, "date": "Aug 01, 2010", "message": "I agree on the \"hyponymy\" note - for instance, questions tagged \"ruby-on-rails\" really ought to show up in a search for \"ruby\", but it's still useful to be able to capture the granularity of Rails-specific questions as well."}, {"author_name": "Joe", "gravatar_hash": "35b5e9e9ccf3bfe5ff8d22b64a5234d3", "author_url": null, "date": "Aug 01, 2010", "message": "I wholeheartedly agree with Mikael. But it's great that we're making strides towards more clarity from the tags."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Aug 01, 2010", "message": "It's a nice implementation but I can't help thinking that it's tackling a complex problem by adding complexity. The whole point of a folksonomy is that it's not a taxonomy."}, {"author_name": "W. Craig Trader", "gravatar_hash": "6e1a73f6847c281fc0a6cd79ce356317", "author_url": "http://stackoverflow.com/users/12895/w-craig-trader", "date": "Aug 01, 2010", "message": "So what happens when a tag in the top-40 tags (say, iphone-sdk) becomes a synonym to another tag in the top-40, (say, iphone).  Does that mean that another tag will be promoted to the top-40 in place of the synonym?\n\nFrankly, I think there's a difference between them, and that iphone-sdk does mean something different, but that's how things stand for now."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 01, 2010", "message": "@john mostly this is attacking the to-may-to, to-mah-to problem through voting.\n\nSpecifically, it gets really, <i>really</i> old having to manually merge the \"svn\" and \"subversion\" tags every month.\n\nI'm not in favor of anything hierarchical."}, {"author_name": "OMG Ponies", "gravatar_hash": "84dc26c6486551ba2b477b8ec35e90dc", "author_url": null, "date": "Aug 01, 2010", "message": "Is there any impact to votes against tags summarization?"}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Aug 01, 2010", "message": "@John \n\nI agree this can get complicated fast. But when you look at the effectiveness, http://stackoverflow.com/tags/synonyms?tab=renames&amp;filter=all you can see what massive difference to the discoverablity of the \"ruby on rails\" tag on Stack Overflow this change made. A few hundred manual retaggings were avoided. This saves people time and allows them to focus on answering questions. \n\n@Mikael \n\nRegarding tag hyponymy, it is incredibly complex issue to tackle, but the best place to discuss this would be Meta. I am not inclined to work on this in the near future. \n\n@Ponies \n\n? not following,  the voting only affects tag synonyms, the tag wikis are a totally different system."}, {"author_name": "OMG Ponies", "gravatar_hash": "84dc26c6486551ba2b477b8ec35e90dc", "author_url": null, "date": "Aug 01, 2010", "message": "@Sam: I was for details on how voting affects synonyms, I didn't see a mention in the posting.  The tag wiki is interesting, just concerned we might get into needing citations a la Wikipedia."}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Aug 01, 2010", "message": "@Ponies \n\nThe voting affects are in the page, the overview is, when you propose a synonym it takes no affect until it get a 4 score.\n\nIf it gets a -2 score it is automatically deleted."}, {"author_name": "TJB", "gravatar_hash": "20e04754409abe97cca30b5cda369fcc", "author_url": "http://www.codeitalready.com", "date": "Aug 01, 2010", "message": "I think the 'tag wikis' is a very nice addition, hopefully it can be a nice hub for some of the more prolific tags.  I'm excited!"}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": null, "date": "Aug 02, 2010", "message": "So are there going to be badges associated with this feature?"}, {"author_name": "Bobby Jack", "gravatar_hash": "9b5c260dc8b7374186b3bebc28b08ce7", "author_url": "http://www.fiveminuteargument.com", "date": "Aug 02, 2010", "message": "@Jeff: Have you previously given a reason as to why you're not in favour of a hierarchy? There are currently problems relating caused by the 5-tag limit and the lack of a hierarchy. For example, to tag something php, php5, php5.3, and php5.3.3 uses up 4 of the available tags. But each of those tags is useful in its own right. If they were all in a hierarchy, only 1 would be needed, storage would be presumably be more efficient, and it would be possible to see all questions relevant to php5.3, for example.\n\nI get the feeling that I'm missing a lot of questions relevant to php because they're being tagged 'php5' but not 'php'."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Aug 02, 2010", "message": "Is there anywhere to discuss tag mergers?  For instance, I just saw that aspx is one vote away from being merged into asp.net.\n\naspx implies asp.net, but asp.net does not imply aspx, as there are other file types used with it... and ASP.NET MVC 3 may use cshtml files (Razor templates) instead!"}, {"author_name": "OMG Ponies", "gravatar_hash": "84dc26c6486551ba2b477b8ec35e90dc", "author_url": null, "date": "Aug 02, 2010", "message": "@Sam: I'm not explaining myself correctly.  I updated the SQL tag wiki, and defined a synonym called \"database\".  I don't know of a database vendor that does not support SQL as a means of communication; \"database\" is the colloquial term neophytes are more likely to use than \"SQL\"...\n\nAssuming the synonym is approved by the community, does that mean that votes against the \"SQL\" tag will also be attributed to the \"database\" tag?  The votes that are listed when someone checks the stats tab per tag...\n\nThis gets tricky, because Transact-SQL (TSQL) is supported by both MS SQL Server and Sybase...\n\nI'm curious, because there are silver and gold badges attributed to those tallies..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 02, 2010", "message": "\"and it would be possible to see all questions relevant to php5.3, for example.\"\n\nThis is already possible with wildcards -- just add \"php*\" to your interesting tags, or use the \"php~\" equivalent on the server.\n\n(ASP.NET hates asterisks in URLs even though they're technically allowed by the spec. Sorry.)"}, {"author_name": "goyuix", "gravatar_hash": "846aeb3494a51fdd2af2bb0b99dc364c", "author_url": null, "date": "Aug 02, 2010", "message": "I love the tag wiki stuff. I have been thinking for a long time that the Stack Overflow engine really needed something akin to the \"pinned topic\" for a quick /important info dump. The sponsored tags had a first approximation of it, this looks to be a home run. Keep the excellent enhancements coming!"}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Aug 02, 2010", "message": "@Ponies \n\nThe tag synonyms is a completely independent system that only affects the future, it plays nothing with past votes. I would strongly suggest against a database synonym for sql it makes no sense (bring it up on meta). In general the workflow should be that synonyms is vetted and in short order the moderators step in and merge tags. At that point history starts changing. \n\n@R. Bemrose\n\nIf anything out of order is happening please bring it up on meta, mods have override abilities \n\n@Bobby Jack, \n\nThis is a discussion for meta, we can not get in to all the details here. \n\n@Tilendor \n\nnot sure, there is a discussion here: \nhttp://meta.stackoverflow.com/questions/59329/tag-wiki-badge-suggestions\n\n\nThanks for the feedback!"}, {"author_name": "OMG Ponies", "gravatar_hash": "84dc26c6486551ba2b477b8ec35e90dc", "author_url": null, "date": "Aug 02, 2010", "message": "So if I understand this correctly - if a user uses a synonym like \"mssql\", the system will display \"sql-server\".  Will votes will be tallied against the \"sql-server\" tag that is displayed, or what the user actually provided?"}, {"author_name": "Josh Stodola", "gravatar_hash": "ac11bb0472c37bf41ca166ec849d3a02", "author_url": null, "date": "Aug 02, 2010", "message": "I like this, but I wish I could reverse a vote after five minutes!"}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Aug 03, 2010", "message": "@Josh, you can reverse a vote whenever (either by downvoting or clicking the upvote again) \n\n@Ponies \n\nSynonyms do not affect pre-existing stuff, you still need to run merges and retags. The system behaves as though a benevolent retagger just goes in and retags stuff after you save it."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": "https://twitter.com/teh_klev", "date": "Aug 06, 2010", "message": "Nice work folks!\n\nWill we see the tag synonym data in the monthly data dumps?\n\n@ponies - re: databases -&gt; sql synonym. What about all the nosql databases where this wouldn't really apply?"}, {"author_name": "summersmile1984", "gravatar_hash": "9de1dd594e1dbbc76daf07046f6c4bcd", "author_url": "http://summersmile1984.i-branding.me", "date": "May 19, 2011", "message": "what about the relation of the tag? have you ever consider adding relation of tags and even relation types.Hyponymy is one type of relation of tags, there are also other types of relations of tags."}]}