{"response": [{"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 06, 2010", "message": "As an aside, we now need a bit of help cleaning up posts that were ONLY tagged [subjective], [best-practices], or [beginner]\n\nThese are all now tagged [untagged].\n\nhttp://stackoverflow.com/questions/tagged/untagged\n\n208 as of the time I'm writing this. I cleaned up on SU and SF but SO is more than 10x larger, so it is a tougher nut to crack."}, {"author_name": "feniix", "gravatar_hash": "d134bc541c3a185f10fa5a05f9514026", "author_url": "http://blog.feniix-hq.net/", "date": "Aug 07, 2010", "message": "So if a question is tagged(for example):\n[best-practices], [css], [html]\n\nIs it valid or not?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 07, 2010", "message": "[css] [hmtl] [best-practices] \n\nis not valid, because [best-practices] is a meta tag.\n\nWhat you should be asking yourself is this: for each tag you use, could a question with *only* that tag be valid?\n\n[css]\n\nvalid, the question is about css.\n\n[html]\n\nvalid, the question is about html.\n\n[best-practices]\n\ninvalid, the question is about.. uh.. er.. who knows?\n\nso, just use [css] [html] and drop the meta-tag"}, {"author_name": "feniix", "gravatar_hash": "d134bc541c3a185f10fa5a05f9514026", "author_url": "http://blog.feniix-hq.net/", "date": "Aug 07, 2010", "message": "And I ask this because sometimes when I am bored I go to any of the sites and click a \"subject\" for example in serverfault\n\n[ubuntu] [best-practices]\n\nAnd a big portion of the time is good if not very good reading material."}, {"author_name": "Ray Vega", "gravatar_hash": "2da21199d56ce93c5092f1c386d5a577", "author_url": "http://lexicalclosures.blogspot.com/", "date": "Aug 07, 2010", "message": "Only a beginner would subjectively keep these meta-tags for the sake of best practices."}, {"author_name": "feniix", "gravatar_hash": "d134bc541c3a185f10fa5a05f9514026", "author_url": "http://blog.feniix-hq.net/", "date": "Aug 07, 2010", "message": "I mean, I know is a decision already taken so no need to argue \n\nBut beginner and subjective I think (it's my opinion) are a bit different from best-practices.\n\nI see \"best-practices\" as a modifier of the other tags.\n\nIf I read, [linux] [security] I may not be interested on reading the thread/article/question.\nif I see those 2 tags + the \"best-practices\" although in many cases I may not agree with the best practices preached (and I have to be sincere on that one, best practices is more like religion than like science :P).\n\nI hope my explanation is clear enough."}, {"author_name": "pfctdayelise", "gravatar_hash": "914ae4c68bfff39c8e9119bc25fbc210", "author_url": "http://brianna.laugher.id.au/blog", "date": "Aug 07, 2010", "message": "Right, and where's the definitive list of meta-tags?\n\nPresumably, goodbye 'homework', 'suggestions', 'challenge' are gone. \n'tips-and-tricks', 'common-mistakes', 'trivia'?\nWhat about 'language-agnostic'?\n\nObviously, 'humor' and 'fun' will be eradicated."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 07, 2010", "message": "@pfctdayelise\n\nI'm less worried about the ragged edges of the system; it's when we have three GRATUITOUSLY meta-tags hogging up space in the top 10, top 30, top 40 tags that I start to get worried.\n\nSo we don't have to stamp out every iota of meta-tags, we just have to DISCOURAGE it, and make sure it doesn't come to DOMINATE the top (n) tags list -- as it did on Stack Overflow."}, {"author_name": "Jones", "gravatar_hash": "7d6bc3f50dd1168b164d56ba4dc1dee6", "author_url": null, "date": "Aug 07, 2010", "message": "I hate to say this, but I disagree with you Jeff and I agree with feniix.  Tags like best-practices do denote something specific and useful when it comes to filtering content.\n\nNot everyone browses stackoverflow for specific answers to questions.  Some people simply enjoy programming enough to browse the site for leisure reading.  In those circumstances, a good way of filtering questions is often by these \"meta\" tags.  Best-practices are some of the best leisure programming reading on the site.  This is more and more relevant with devices like the iPad, which changes the form factor of stackoverflow browsing from computer to book.\n\nIf I'm a beginner at Python, and I want to glean best practices information from this developed community, without having any specific Python task in mind, how would I now do that?"}, {"author_name": "Chris Chilvers", "gravatar_hash": "8a0c4a514392dd7574c243102cdbb034", "author_url": null, "date": "Aug 07, 2010", "message": "Alternativly, meta tags could be flagged as meta. What this would mean is it wouldn't be counted as a tag for the top tags or validation (ie posts without tags)."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 07, 2010", "message": "> If I’m a beginner at Python, and I want to glean best practices information from this developed community, without having any specific Python task in mind, how would I now do that?\n\nUh, I'd start by browsing the highest voted questions in that tag.\n\nThen search for \"best practices\" within the tag, like so:\n\nhttp://stackoverflow.com/search?q=[python]+%22best%20practices%22\n\nIf you're looking for a [this-question-is-awesome] tag, I'm not sure what to tell you."}, {"author_name": "Martin", "gravatar_hash": "903d1f6eb1dc53cc0810d9fcec0f3b8a", "author_url": null, "date": "Aug 07, 2010", "message": "The most viewed question on SO is \"Hidden features of C#\" which is tagged [hidden-features]. I think the hidden features questions are one of SO's crown jewels. I think we could all agree its by current definition a meta-tag. \n\nThe way those questions grew - would be down to the way the question was asked, the way people voted inspired others to add Hidden features of javascript/Java/C etc... And I think you could you argue that the meta-tag (backed up by the earlier questions) helped create a standard way, to record the canonical best practice question on each technology.  \n\nBy discouraging meta-tags on SO; people running new stack sites will see that standard, and will be more likely to say \"no\" to meta-tags. I think immature sites need meta-tags to help define a standard for the hidden-features/best practice question."}, {"author_name": "Martin", "gravatar_hash": "903d1f6eb1dc53cc0810d9fcec0f3b8a", "author_url": null, "date": "Aug 07, 2010", "message": "The point of the above; is try and give (and probably fail) a better defense of the poor old meta tag :) Damn, comments needs an edit button like SO!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 07, 2010", "message": "@martin I don't really have a problem with [hidden-features]. Seeing that tag on a question, I *KNOW* what I will get when I click on it.\n\nCompare with [best-practices], or [subjective], or [beginner], where the meaning is basically a mirror held up to whoever you ask at the time: in other words, random."}, {"author_name": "Eduardo", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": "http://divisionsoftware.com", "date": "Aug 07, 2010", "message": "I do not agree. Why? You say it:\n\n\"[Meta Tags] They describe some other aspect of the question, like the author’s skill level, or the author’s motivation for asking it, or generally what “kind” of question it is (poll, how-to, etc.)\"\n\nIn what other field will live these other aspects of the question?"}, {"author_name": "Jones", "gravatar_hash": "7d6bc3f50dd1168b164d56ba4dc1dee6", "author_url": null, "date": "Aug 07, 2010", "message": "Jeff, I've come to realize that you're right. I'd like to kindly retract my previous sentiments.\n\nAs usual, your keen insights are what make this the best programmer site in the world."}, {"author_name": "Michel Billard", "gravatar_hash": "7a72ffed0a1cd0141f4da8587624092c", "author_url": "http://www.crossbrowser.net", "date": "Aug 07, 2010", "message": "While I agree that subjective and beginners do not bring anything, I'd have to argue that best-practices is just as valid as hidden-features. Both describe more or less the content of the question, but they both need at least one more tag to mention the best practices of what or the hidden features of what.\n\nI see no difference in those 2 tags.\n\nFurthermore, I've found that many best-practices questions have been really helpful for me."}, {"author_name": "Bill", "gravatar_hash": "e6f407d5c456c07416f427a66776de5b", "author_url": null, "date": "Aug 07, 2010", "message": "I agree with regards to 'beginner' and and 'subjective' but you are way off the the mark with 'best-practice' tag. This is a logical and useful way to group of questions.\n\nI use the 'best-practice' tag for search  all the time. The result of a search for that is different (a lot more specific) than a search for the highest voted questions.\nEven if the top voted questions somehow all corresponded to 'best-practice' (which they don't), sometimes the most interesting stuff hasn't been voted up yet or wont be for whatever reason.\n\nMost questions marked best practice could be on on their own 'Programming - best practices' stack exchange site. If they were I would spend a big chunk of my time there\n\nThis is pretty basic. I'm not impressed"}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Aug 07, 2010", "message": "While I'm in general agreement with a move away from meta-tags, there are some things that bother me about this.  You consistently state that the sites are run by the community.  Well, those questions were tagged by the community and, with the exception of [subjective], I fail to see where the community got to weigh in on the removal of these tags before they happened.  I've noticed that expanding your mandate is a pretty consistent theme when it comes to making sweeping changes to the system.  I'll grant that you have sufficient reputation (in addition to being the owner/creator) to remove the tags, but if any one else had systematically removed all instances of a particular, highly-used tag, there probably would have been hell to pay, perhaps even a suspension.\n\nI particularly have a problem with the [best-practices] tag.  I think it's exactly the sort of meta-tag that actually does improve the classification of a question.  It helps distinguish a question seeking an answer to a specific problem from a question seeking the canonical way to approach a class of problems.  Your avatar derives from what is, essentially, an entire book about best practices: Code Complete.  Best practices is an essential part of our craft and the community often does coalesce around an agreed set of best practices in a particular class of problems.\n\nA question seeking knowledge on how to effectively reuse code is more accurately tagged [code-reuse] [best-practices], than simply tagged [code-reuse] -- using both makes it abundantly clear what the question is about.   Further a person who is interested in improving their skills, generally, could have searched the [best-practices] tag along with the tag for their area of interest, and found an abundance of material for their study.  A instructor looking for community-based input on best practices in software development, could have searched using only this tag and found a wealth of information.  Unclassified with this tag, you depend on content search and tag-based searches are much more effective than content searches.\n\nSo, while I'd really like to be congratulating you for removing two really, really bad tags, I find myself very disappointed that you've gone further than what I think the community would have done.\n\nI understand that the tag was overused.  It would have been a big job to go through and remove it except for cases where the user is particularly asking for help in determining best practices for a class of problems, but it's still a smaller problem than retroactively going back and applying it in the cases where it does actually improve the classification of the question.  Rather than removing this particular tag, I would have preferred that we encouraged its proper use and engaged the community in cleaning up the usage rather than apply the \"scorched earth\" approach."}, {"author_name": "Jakub Narębski", "gravatar_hash": "672aa8b373071ef9f06db563d1c08d77", "author_url": null, "date": "Aug 07, 2010", "message": "Perhaps a better solution would be to use different color (or shade) for meta-tags, and suggest that question needs additional tag if the only tag is meta-tag?"}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Aug 07, 2010", "message": "When first reading this, I was a bit iffy about the removal of some of the tasgs. In particular, [best-practices] seemed like something that *should* be asked and *should be questioned and discussed. But of course, removing the tag doesn't mean I can't ask \"what are good ways to do [X]\", just that the question shouldn't be tagged with that tag.\n\n(And likewise for [beginner] of course. Beginners questions should still be asked, just without the tag)\n\nBut it took me a minute to grok it, and I agree with it. I guess my justification is that the tags are supposed to be a searching/indexing mechanism: The C# tag is useful because it allows people who know about C# to keep track of the questions they're able to answer.\n\nThe [best-practices] tag is useful because.... no one (apart from architecture astronauts who probably aren't worth listening to) would track all [best-practices] questions, so throwing the tag out makes sense."}, {"author_name": "finnw", "gravatar_hash": "1d329f562180503bd1e91997f57fcaff", "author_url": null, "date": "Aug 07, 2010", "message": "Jeff, you cheated.\n\nI mean with removing the tags.\nThe \"normal\" way to add/remove tags is to click \"edit\" and add/remove tags via the tags field.  But you must have used a separate admin interface for it, because the affected questions have not been marked as edited.  This is a shame because then the question owners would be notified and they would be able to choose a more appropriate tag to replace the deleted tags.\n\nAs it stands most of the owners of those \"untagged\" posts (i.e. the people best qualified to select an alternate tag) will never know that their questions were affected.\n\nI guess you were trying to avoid \"bumping\" the questions but I don't think that's a good thing either.  It would be better if the affected questions were seen by more users and retagged (or closed?) as a result."}, {"author_name": "Aakash Mehendale", "gravatar_hash": "d4f59ee8f45040b78ee28e784f985664", "author_url": null, "date": "Aug 07, 2010", "message": "The *really* funny thing is that some of the people cleaning up those questions which were made to carry only the tag 'untagged' recreated the best-practices tag! High-rep, experienced users at that. Seems to have been stamped on by now though."}, {"author_name": "Aarobot", "gravatar_hash": "687f8a43b58fe35c8b2933f1f16b13cb", "author_url": null, "date": "Aug 07, 2010", "message": "Well, I certainly was not expecting my name to be mentioned on the blog.  I thought to look here after seeing the request to help with [untagged] questions - and then it hit me, were it not for that e-mail, I probably would not even have noticed that those tags were gone.\n\nYou *know* a tag is useless when you've been reading and answering questions with those tags for a year, and they get zapped, and nothing seems amiss except maybe for an unconscious feeling of \"hmm, the site's looking a little cleaner today...\"\n\nAnyway, now that I'm here, I'd like to make a few points to the obvious detractors:\n\n1) Jeff did not \"cheat\".  Mass retags and merges have been an admin function for as long as I can remember, and they're normally uncontroversial and nobody notices them.  I'll bet that nobody would have noticed it this time either, if they hadn't announced it.\n\nAside from taking up a ridiculous amount of time, a \"manual\" retag would have made the front page useless, bombarding the site with hundreds of old questions that were probably not very good to begin with.  Anyway, I will be personally helping to organize the [untagged] questions and I'm fairly confident that others will take up the mantle as well.\n\n2) With respect to the \"community-run\" argument: There's a reason that no real society is a pure democracy.  The majority isn't always right.  Most people, when asked to make a tough decision, prefer to follow either some authority figure or, failing that, some vague perception of what everybody else is doing.  THAT is why the [subjective] and [best-practices] tags got so popular.  Left to its own devices, virtually any unmoderated online community will begin to suffer from scope creep and a torrent of newbie GTKY, religious wars and other open-ended questions.  That's why we have moderators, both community and official.\n\nWe should be thinking of the trilogy as more of a constitutional oligarchy.  Moderators and admins are there to serve the community, and sometimes, in so doing, they have to make decisions that are going to be unpopular with a certain group.  Sometimes they'll make mistakes, too, and we should never be afraid to question them or take them to task (lords knows I have!) - but we should question *specific* actions, and not the mere fact that they took some action without first getting \"approval\" from the community.  That's just silly; if they took that approach, half of the features we now take for granted probably wouldn't exist today.\n\n3) With all due respect, anybody who says that \"best practices is an essential part of craft\" needs to have some sense smacked into them.  \"Best practices\" do NOT help our craft, they cheapen it from a creative engineering discipline into a bureaucratic set of rules and regulations.\n\n\"Best practices\" tell us to turn off our brains, to ignore our environments and follow the advice of some guru.  What is a \"best\" practice anyway?  Best according to whom?  And by what criteria?  And in which circumstances?  Is it \"best\" because it's measurably better than all practical alternatives, or is possible that several alternatives were not even considered?\n\nI'm not going to belabor the point any further because James Bach has already explained it a million times better than I ever could:  http://www.satisfice.com/blog/archives/27\n\n4) For those advocating technical workarounds, like shading the meta-tags: Why?  What does this accomplish?  I can think of two things: (a) it makes the front page and tag pages look busier, and (b) it makes the tag system confusing as hell because every member has to keep track of which tags go in which category.\n\nI'd prefer not to have to answer a dozen support questions each week on \"why won't the site accept my question, it says there's something wrong with the tags!?\"  And the worst part of all of it is that instead of discouraging harmful or nuisance behaviours, it reinforces them!  It says that not only are these tags allowed, but that they are somehow \"special\".  We'll have people thinking that every question should have one of these tags, for balance.\n\nThink I'm making this up?  There's actually a very vocal member on one of the SE betas who insists that subject tags are \"vertical\" tags whereas meta-tags are \"horizontal\" tags, and that it's actually a good thing for questions to have both.  Making meta-tags special - even if it's a bad kind of special - is essentially cementing precisely this ideal.  Bad, bad, bad.  No, we do not need special highlighting or special rules.\n\n---\n\nParting thoughts:\n\nGive it a couple of days.  Let yourself get used the absence of these tags, and after a few days, ask yourself if you really miss them.  That's how I decide how to get rid of house clutter; if I haven't used it in more than a year, it's probably useless to me.  So do this with the meta-tags.  Monitor your asking/answering habits and watch for any instances of you saying to yourself, \"man, this would be a LOT easier if we still had the [subjective] tag.\"\n\nIf you catch even one, I'll eat my hat.\n\nCongratulations and thank you to the team for seeing the light on this one!"}, {"author_name": "Konrad", "gravatar_hash": "f9401202ab73e624cc82800b0fff1489", "author_url": "http://madrat.net", "date": "Aug 07, 2010", "message": "“What you should be asking yourself is this: for each tag you use, could a question with *only* that tag be valid?“\n\nJeff, you’re basically just paraphrasing the definition of meta tag. That’s *not* an argument against the tags.\n\nWrong decision, IMHO. Meta tags are a great way of classifying questions, and they *do* give valuable information about the contents of the question. [subjective] is a bad tag only because subjective questions themselves are discouraged. But [best-practice] for example is a wealth of information about the question."}, {"author_name": "Brian", "gravatar_hash": "04ec8758035b6ca3f6e1678f6f4d839e", "author_url": null, "date": "Aug 07, 2010", "message": "@Jeff: I started editing tags to help out. I changed them but it still showed up as \"Untagged\" when I went back and refreshed. Is there still an underlying untagged tag that I am not seeing? I figured there was but just want to make sure. Thanks you for making such a great site."}, {"author_name": "scunliffe", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Aug 07, 2010", "message": "Nicely done.  I agree.  I use StackOverflow to get answers that are the \"best-practices\", since everyone at some point is a \"beginner\" and I realize that every question is \"subjective\" as you only see a small piece of the picture that is causing trouble. ;-)"}, {"author_name": "Juliet", "gravatar_hash": "d0d6f5c811ce1fd03862088f33dccc9a", "author_url": null, "date": "Aug 07, 2010", "message": "I flatly disagree with this motivation for this decision for all of the reasons enumerated here: http://meta.stackoverflow.com/questions/45740/\n\nNow there's less incentive for people to filter out a class of questions they're not interested in seeing, more incentive on hardcore censorship and bullying out a whole class of interesting questions that otherwise merit an answer (http://stackoverflow.com/questions/3426329/ strikes me as a recent subjective question with tons of useful input). Its like the whole concept of community building is an afterthought or just a hassle that no one has any real intention of encouraging."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Aug 07, 2010", "message": "&gt; Now there’s less incentive for people to filter out a class of questions they’re not interested in seeing\n\nNever worked. Good, on-topic questions disappeared because someone tagged them \"subjective\", while lousy ones still showed up because their authors refused to admit that they were just trolling for support for their own opinion. A tag that has no agreed-upon meaning is useless.\n\n&gt; bullying out a whole class of interesting questions that otherwise merit an answer \n\nCreate a SE site for OT questions, or a forum for discussion. I'd suggest Wave, but apparently it's going away...\n\n&gt; http://stackoverflow.com/questions/3426329/\n\n...has nothing to do with programming. I've faced this problem in everything from gardening to car repair, and the answer is always the same: learn enough to judge the difference between necessary and nice, and then decide how much \"nice\" you can afford. It's a great general discussion question, but SO is about neither general nor discussion.\n\n&gt; Its like the whole concept of community building\n\n...there's a chat service now, if you want to commiserate or just chew the fat with your peers. I agree that SO probably should have had something like this from the start, but better late than never."}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Aug 07, 2010", "message": "I was able to tag a question 'argumentative'... should that be a meta-tag?"}, {"author_name": "Maxim Z.", "gravatar_hash": "319bd6ef9c9c8d876f731150cb4951c7", "author_url": null, "date": "Aug 07, 2010", "message": "Bug: someone asked a question on SO 50 minutes ago with the tag \"best-practices\". http://stackoverflow.com/questions/3432257/difference-between-array-map-array-walk-and-array-filter"}, {"author_name": "pfctdayelise", "gravatar_hash": "914ae4c68bfff39c8e9119bc25fbc210", "author_url": "http://brianna.laugher.id.au/blog", "date": "Aug 08, 2010", "message": "@Jeff\n\nIf you learn anything from observing Wikipedia it should be that when the Respected People In High Positions (insert BDFL or GodKing or whatever term you prefer here) say \"discourage\", the masses hear (and implement) \"eliminate\". Just sayin'."}, {"author_name": "pfctdayelise", "gravatar_hash": "914ae4c68bfff39c8e9119bc25fbc210", "author_url": "http://brianna.laugher.id.au/blog", "date": "Aug 08, 2010", "message": "@jalf \n\n<blockquote>\nBut it took me a minute to grok it, and I agree with it. I guess my justification is that the tags are supposed to be a searching/indexing mechanism: The C# tag is useful because it allows people who know about C# to keep track of the questions they’re able to answer.\n\nThe [best-practices] tag is useful because…. no one (apart from architecture astronauts who probably aren’t worth listening to) would track all [best-practices] questions, so throwing the tag out makes sense.\n</blockquote>\n\nGeez. People use tags however they want to, coz I'm guessing a lot of users missed the Prescribed Usage Memo. One massively useful use of tags is in serendipity searching. I might land on a question because of a 'python' tag, but while I'm there, I see some other tag that I'd never thought to look up before. From there I can easily browse other tags with that same new, shiny tag, and learn some things I probably wouldn't have otherwise encountered.\n\nI guess my position is, do they do good? Some people find value in them, so yes. Do they do harm? Not unless they're used by themselves, which has already been discouraged. So what's the harm? Why does the top 10 tag list need to be \"clean\", anyway? Tagging is a messy business."}, {"author_name": "Daniel Martin", "gravatar_hash": "cf6d0868b2b4c69bac3e6f265a32b6a7", "author_url": "http://snowplow.org/martin", "date": "Aug 08, 2010", "message": "I must say I always found the \\beginner\\ tag useful because it let me actually look at stackoverflow questions usefully in Google Reader (by getting an RSS feed of \\java -beginner\\)\n\nWell, I'd been looking for an excuse to get away from the SO points game, so I guess this is as good as any."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 08, 2010", "message": "> One massively useful use of tags is in serendipity searching. I might land on a question because of a ‘python’ tag, but while I’m there, I see some other tag that I’d never thought to look up before. From there I can easily browse other tags with that same new, shiny tag, and learn some things I probably wouldn’t have otherwise encountered.\n\nI don't get the desire to turn tags into StumbleUpon -- any given tag should give you a pretty high percentage chance of knowing what the content of the question will be about, not be a random walk through \"stuff\".\n\nSo to the extent that [best-practices] is a random walk, (and it was), it was a failure as a tag."}, {"author_name": "Konrad", "gravatar_hash": "f9401202ab73e624cc82800b0fff1489", "author_url": "http://madrat.net", "date": "Aug 09, 2010", "message": "&gt; I don’t get the desire to turn tags into StumbleUpon\n\nI don’t get the desire to assign tags One True Purpose™.\n\n&gt; So to the extent that [best-practices] is a random walk, (and it was), it was a failure as a tag.\n\nThat’s a complete non sequitur.\n\nAdditionally, and just to deconstruct you further, even some lexicographers (Erin McKean …) admit that the *greatest virtue* of print dictionaries is their serendipity: “… when you find things you weren’t looking for.”"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 09, 2010", "message": "Yes, I believe that's the principle that Google was founded on: \"Google! Helping you find things you <i>weren't</i> looking for since 1998!\""}, {"author_name": "Oliver Giesen", "gravatar_hash": "13c44ef2d9d79dcca761a584be868def", "author_url": "http://ogware.wordpress.com", "date": "Aug 09, 2010", "message": "Jeff, you wrote that the problem *and the solution* finally became clear to you. However, as far as I can tell you haven't told us anything about an actual solution.\n\nApart from batch-removing these tags on existing questions, what technical measures have you put in place to implement the \\discouragement\\ for future use of these tags you talk about?\n\nAnd finally what alternatives are you offering?\n\nI agree that things like \\poll\\ or \\open-ended\\ (e.g. questions of the \\how do *you* do X?\\ variety which I personally tend to find very enlightening) shouldn't really be tags. Instead I think they should become flags on the question, implying slightly different handling, e.g. no negative impact on the accept rate (as it typically doesn't make sense to accept any one answer to such questions)."}, {"author_name": "MrShoubs", "gravatar_hash": "a9d508eafe7e6f99da9c761733e7251b", "author_url": null, "date": "Aug 09, 2010", "message": "It's a shame the best-practices have gone, I used to make a point of checking it every day for questions of interests (I don't just use one technology in my job) to generally improve my knowledge... over the years it has provided me with some really good pointers and directions in future projects, allowing me to get a feel for a technology before ever using it.\n\nHave you considered having a check box for best-practices?"}, {"author_name": "Nick", "gravatar_hash": "f3664da2ca305284ab442e34daccc608", "author_url": "http://www.thecodingmonkey.net", "date": "Aug 09, 2010", "message": "It seems like this solution, of discouraging so called meta-tags, is an incomplete solution. What Aaronut's post points out is that meta-tags are a system for creating other features, or providing other information that SO doesn't currently provide.\n\nFor instance, what's wrong with adding [best-practices] to a post, if that is what you, as the asker wants? Yes, its important to make that clear in the question itself, but the whole point of tags in general is to pull specific information out of the question that might be useful for filtering.\n\nPart of the issue here is that there is a wide range of knowledge, and also a wide range of question skills that  occur as well... and so meta-tags are a way to provide some sort of taxonomy to that.\n\nPerhaps a new set of features needs to be added in order to track these sorts of things. Maybe a way for users to vote on the skill level of the question (1-5) or similar."}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Aug 09, 2010", "message": "I would have preferred to see a set of meta tags which have slightly different behavior than the general tags.  For example i) the meta tags would not have badges, ii) the meta tags would not show up at the top of the tag list, but in their own tab, iii) ...\n\nBasically just don't give meta tags as much weight. \n\nBy removing meta tags you throw out some useful structured information of the questions."}, {"author_name": "MarkJ", "gravatar_hash": "1f3ce1ae1497058e8efd34a05dbdee22", "author_url": null, "date": "Aug 09, 2010", "message": "I think removing [best-practises] was a mistake for two reasons. The first reason is that I think it was useful. I realise that **usefulness** is strictly irrelevant according to the definition of meta-tags you have proposed (kinda makes the definition seem a bit wrong?). The second reason is that I disagree that it was a meta-tag by your definition. [best-practises] indicated that the question had a more general relevance than just one specific person's problem on one particular day with one bit of code. Surely this is determined by the content of the question, and therefore the tag wasn't a \"meta-tag\"?"}, {"author_name": "Adam", "gravatar_hash": "207958aa5ac1c42448070dbab3f2dd87", "author_url": "http://stackoverflow.com/users/284685/adam", "date": "Aug 09, 2010", "message": "I agree with Brian. Those tags were useful as evidenced by how often they were used, they gave information about the post that helped search for them and change the tone of the answers. Maybe they shouldn't be tags, but they should still exist. I propose meta-tags: they'd be a different color (say semi-transparent) and they would not have badges. They could not be the only tags on a question. Maybe we could even add a user setting to make them invisible if you wish."}, {"author_name": "Dan McG", "gravatar_hash": "c5355f878186f8cc7feade633022683d", "author_url": "http://u2tech.wordpress.com/", "date": "Aug 09, 2010", "message": "Yes, I think 'Jeff jumped the shark' a bit on this.\n\nI wonder if he performed any analysis of how much said tags where used by people in searching (and maybe even then answering/'favorating') using the tags he has so willingly squashed.\n\nTake the oft mentioned 'best-practices' tag. By removing a device that has obviously been used successfully by people to find useful/interesting information on StackOverflow (as attested by the comments on this blog), he has managed to reduce the usefulness of tags.\n\n&gt; Yes, I believe that’s the principle that Google was founded on: “Google! Helping you find things you weren’t looking for since 1998!”\n\nInteresting that you give take that as the example, given that this would be the single greatest source of inbound traffic... Maybe they where on to something?\n\n&gt; even some lexicographers (Erin McKean …) admit that the *greatest virtue* of print dictionaries is their serendipity: “… when you find things you weren’t looking for.”\n\nHey, maybe even some people more qualified around these constructs know a thing or two?\n\nAs the saying goes, one man's garbage is another man's treasury. Was it *really* that big of an issue that you had to quash another man's treasury?\n\nSo sad, too bad.\n\nPS:\n\n&gt; “Best practices” tell us to turn off our brains.\n\nFor the record, I disagree. \"Best practices\" gives as a focus point to do comparisons from. From there we are able to more readily improve upon what we are collectively doing. If you are that foolish enough to \"turn your brain off\" because some calls something a best practice, then the label of \"best practice\" isn't the issue, you are. Likewise, if you are foolish enough to at least not *consider* what the currently labelled \"best practice\" is and just be \"creative\" then maybe you are a bit of a cowboy?\n\n\nThat's why the real professional organisations such as Law and Medicine will always be thought of as \"Professional\" but IT is still struggling with a true \"Professional\" association.\n\nFor all the technology and ability we have, we continue to work on heresay and 'a gut feel' instead of quantitatively and qualitatively proving them. For example, where are the academic studies that exhaustively prove xyz?\n\nCan you image if Doctors did not have \"best practices\" and just did some \"creative engineering\"? Sure, they sometimes get creative and produce some magic to save a life using a technique/method that flies in the face of current \"best practices\", But the point is, they have them and it is after considering them and the alternatives not currently explored that they produce said magic..."}, {"author_name": "Joey Adams", "gravatar_hash": "1355030928a7422efe6349a3ae9bca83", "author_url": null, "date": "Aug 09, 2010", "message": "Meta-tags like c#, java, and sql should also be done away with because they say very little about the subject matter.  Are you talking about most useful third party libraries of Java, or how to check if one string is a rotation of another.  \"Java\" says very little about the question, since \"Java\" means a lot of things to a lot of people.  Personally, I drink tea.\n\nLikewise, I feel that subclassing in programming languages and type classes in Haskell should be done away with  They say very little about exactly how they are stored or what they are for.  Knowing something's a Monad doesn't really tell me much.  I don't care if it means I can use do-notation with it, I care more about if it is, say, a stateful action.  Heck, variables tell you little about what will actually be stored in a value.\n\nThere's very little reason to categorize information abstractly, as sitegoers are mainly interested in how to programaticly access min and Max values defined in a core-data model designed with XCode, not hidden features of languages they're never going to use."}, {"author_name": "Treb", "gravatar_hash": "22b28304599446b3d3aaaf123e7240ff", "author_url": null, "date": "Aug 10, 2010", "message": "Jeff,\n\nlet me chime in with the others who agree with your idea, but disagree on the removal of the [best-practices] tag.\n\nMy reason is (careful, irony ahead) subjective... I like to read [best-practices] questions more than any other tag. The answers often provide insight into the inner workings of things, because mayn answers also explain WHY a practice is considered 'best'. I learned a lot by reading those answers."}, {"author_name": "Steve", "gravatar_hash": "93da595b407443b6b6e513ba1f470b24", "author_url": null, "date": "Aug 10, 2010", "message": "If I could tag this blog post, I'd tag with 'bad-idea'.\n\nIt's not so much how the solution was come to, but a problem with the premises. \n\nFirstly: \n\"The reason meta-tags are a problem is that they do not describe the content of the question.\" \n\nIt's true, but it's also true for a lot of other tags that aren't considered meta-tags. Consider the tag C#; it's certainly a 'dependant' tag in that a question about WCF tagged only C# doesn't really say anything about the question as others have pointed out already.\n\nSecondly:\n\"If the tag commonly means different things to different people, it’s probably a meta-tag.\"\n\nWe have the same problem here: The statement has truth, but it also includes a number of cases that are decidedly not the case. I know from personal experience that the following tags on SO would mean different things to different people: design-patterns, oop, orm, asynchronous-programming, etc. \n\nThe problem isn't so much a problem with the tags, it's more likely misinformation and a lack of knowledge/experience on the part of the those who would disagree.\n\nThirdly: \n\"If the tag can’t work as the only tag on a question...\"\n\nThe problem is that it's not (or shouldn't be) reasonable to expect a tag to stand on its own. That is the power of having multiple tags. A tag: \"nhibernate-1.0-running-on-windows7-with-.net-1.1-connecting-to-mysql-doesnt-persist-on-saveorupdate\" can certainly stand on its own... but I think we can all agree that it's useless mostly because it's too specific and not categorical. \n\nAnd that's the bottom line as I see it: tags are a categorical device. Maybe some questions are tagged subjective or best-practices when they shouldn't be, or maybe the some of the questions don't belong on SO, but the TAG provides value and insight. \n\nPersonally, \n\nI WANT to read best-practices questions especially when I'm first looking at a technology because I'm likely not the first person to wonder if it's a better (maybe even best?) idea to put my aop advices in a separate assembly.\n\nNow, questions without the subjective tag won't grey out on my SO homepage, and without best-practices I'll have a devil of a time finding out why lots of people seem to be using spacing in their code... \"it's just like reading a book without it!\""}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": null, "date": "Aug 10, 2010", "message": "Jeff, you know that making changes can rile up parts of a community, its inevitable, so that alone is not enough of a reason to stop a change.  What could be a reason to not make a change is to look at how many people use your system in a certain way.\n\nYou have your top level goal: Expert answers for questions.\n\nI don't see that best-practices conflicts with this goal.  A number of people have demonstrated what I see as a viable use case: Checking the best-practices tag in  combination with another tag to learn new things.  I think that is actually *valuable*.   I don't know how common this use case is.  Do you?\n\nAxing this tag breaks that use case for those people, without providing them any alternative.  Thats the kicker I think.  You've got X users that like to browse best-practices and you took that away, without providing them any alternative, sure you made a suggestion to search by the text instead of the tag in this blog, but a fraction of the SO users read this.  It would have been nice on the site to tell the users whats going on, instead of suddenly getting 0 results for their bookmarked search.\n\nSo, condensed summary question: How much research do you do before making these changes?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 10, 2010", "message": "@Tilendor et al\n\n\"no alternative?\" Did you read all the comments?\n\n<blockquote>\nI’d start by browsing the highest voted questions in that tag.\n\nThen search for “best practices” within the tag, like so:\n\nhttp://stackoverflow.com/search?q=python+%22best%20practices%22\n\nIf you’re looking for a [this-question-is-awesome] tag, I’m not sure what to tell you.\n</blockquote>\n\nFor another perspective on how subjective the idea of a \"best practice\" is, see:\n\nhttp://blogs.tedneward.com/2010/08/10/Death+To+Best+Practices.aspx"}, {"author_name": "MarkJ", "gravatar_hash": "1f3ce1ae1497058e8efd34a05dbdee22", "author_url": null, "date": "Aug 11, 2010", "message": "&gt; Yes, I believe that’s the principle that Google was founded on: “Google! Helping you find things you weren’t looking for since 1998!”\n\nGoogle is a search engine powered by impartial automatic web crawling. It's not about categorisation by humans. It's an irrelevant example when discussing StackOverflow tags. Tags are *not for search*. They are for *filtering* and also *browsing*. So your analogy is highly misleading. This is actually rather worrying, Jeff, considering the power you are exercising over the tags these days. I have a lot of respect for you but I think you have gone wrong here.\n\nWikipedia has a search function, and there are *also* categories which are useful for *browsing*. That's a better analogy for stackoverflow tags."}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": null, "date": "Aug 11, 2010", "message": "\n@Tilendor et al\n\n“no alternative?” Did you read all the comments?\n\n\nYes, every single one.  Did you read my post?\n\nMy example was someone with this url bookmarked:\nhttp://stackoverflow.com/questions/tagged/best-practices\n\nWhich worked fine last week and gave them a lot of results.\n\nNow that link simply says 0 questions.  No explanation on that page.  Not even a link to this blog post.  That something worked one day, and doesn't the next with no explanation is very frustrating.  You know this as a programmer.\n\nI think you have some very good reasons for removing these tags, but lets step away from the specific tags.\n\nI'm talking about the user experience.  You changed a fundamental part of the system that was being used heavily enough to merit intervention.  You made a sweeping change, with no feedback to the user about it(at least that I saw in my use of stackoverflow.com), potentially being very frustrating.\n\nWhat I'm saying is you could have put something that would advise the user of the change and instructed them on what they could do about it.  This belongs in the system itself, not as a side-note on the blog, in the comments.  Make it temporary even, if the purist in you wants to keep that code clean.\n\nChanges that align the system better with your vision: Good.  Smacking the user in the face with it, when it can be done gently: frustrating."}, {"author_name": "Daniel Sobral", "gravatar_hash": "6d43da5df0e52fc31c55e6a227bb23f4", "author_url": "http://dcsobral.blogspot.com/", "date": "Aug 12, 2010", "message": "I just saw an undergraduate-projects tagged question. That seems to fit the concept of metatag -- alone, it doesn't say anything about the question.\n\nI removed it from that particular question, but there are seven more questions so tagged. I'm not so bold as to just go ahead and remove all of them, and I don't know if that would lock the tag, or if it would still be available for use."}, {"author_name": "OMG Ponies", "gravatar_hash": "84dc26c6486551ba2b477b8ec35e90dc", "author_url": null, "date": "Aug 13, 2010", "message": "Hilarious - I posted a question over 6 months ago asking for the beginner tag to be removed.  I see that question was deleted too - I read it maybe within the last week..."}, {"author_name": "John Fiala", "gravatar_hash": "0ea7bb11e90d00eee00f6c8863f9f654", "author_url": "http://www.jcfiala.net/", "date": "Aug 16, 2010", "message": "I disagree with removing the best-practices tag as well.  I think it's very interesting to see what different areas of technology and programming use as best-practices, and being able to look around that slice of the site was really useful to me."}, {"author_name": "AcidZombie24", "gravatar_hash": "cb7e6753f882562fcd02bbe4fe03ccc3", "author_url": null, "date": "Aug 19, 2010", "message": "I completely disagree with best practice tag but agree with the others. Even the tedneward link suggest it works in context. Everytime i used the best practice tags i give a specific example. This question is probably not a great example http://stackoverflow.com/questions/3523079/usage-escape-html-problem but it at least shows i am asking if doing this specific thing will cause me problems or is a good practice. There is no other question but that."}, {"author_name": "supercat", "gravatar_hash": "135a97c4150691234931a93f3a27a52f", "author_url": null, "date": "Aug 30, 2010", "message": "Regardless of what one thinks of the term \"Best Practices\", I thought it was useful to have a tag for questions which could be verbosely written out as, \"Of approaches X, Y, and Z to solve a particular problem, what factors might one more suitable than another in various situations?  Is there some other approach I've neglected to mention which might in some cases be even more suitable?\"\n\nThe goal isn't an argument over whether one practice is better than another, but rather an exposition of future difficulties or benefits that may result from choosing one approach or another, as well as any suggestions about approaches not listed."}, {"author_name": "Mike Schinkel", "gravatar_hash": "81df87e0d3e269d6fa6a17c6914fd656", "author_url": "http://mikeschinkel.com", "date": "Sep 15, 2010", "message": "Jeff,\n\nUh, isn't [faq] a meta-tag?\n\n-Mike"}, {"author_name": "Brad", "gravatar_hash": "4283ac48d7f22118cc4e47a514b3269c", "author_url": null, "date": "Oct 13, 2010", "message": "There's a lot of back and forth here about which tags are good and which tags are bad.  It strikes me as very similar to a discussion on religions and which subset is reasonable and which are cults and which are just evil.  The thing is, I think the best approach is to err on the side of accommodating as many of the users as possible, even if doing so makes some other users uncomfortable.  \n\nWhat we should be doing is not fracturing the site but improving the tools within the site to make the experience as good and customizable to every user who wants to participate.  \n\nMaybe allowing users to do more than specify 'interesting' and 'ignored' tags is a better answer.  What about allowing people to assign priorities to tags?  What about allowing people to classify tags (there's your real 'meta-tag') and treat the classifications in different ways.  \n\nMy fundamental problem with this is that I still don't understand what problem was being solved aside from some sort of ill defined discomfort on the part of some people."}, {"author_name": "AviD", "gravatar_hash": "a88248f632c039340efa02505be355e5", "author_url": null, "date": "Jan 19, 2011", "message": "A bit on the late, but I just ran across this again, and re-reading it - since it's now even more relevant to me, having just cleaned up ITSec.SE (http://security.stackexchange.com), including the same pervasive [best-practices] tag... \nI realized, though I agree with almost all of it, there is one key mistake, that might have convinced all those naysayers.  \n\n[best-practices] is not a meta-tag. \nIt's a NULL tag. \nThat is, it's semantically void of meaning, in this context. Is anyone asking for BAD practices? \"Oh, tell me please, kind sirs, what would be a BAD way to do this?\"\nI think it's kind of implied, if someone is asking how to do something - and lets face it, nearly all the questions are how-tos, even the ones asking about a problem: \"how do I fix this problem\" (though there are rare questions that are not) - it's obvious they come to SO to ask for best practices (I don't mean \"Best Practices\").   \nIt's like saying \"Here's my question, but please only provide good answers.\""}, {"author_name": "AviD", "gravatar_hash": "a88248f632c039340efa02505be355e5", "author_url": null, "date": "Jan 19, 2011", "message": "I'd also equate the [best-practices] on all SOFU/SE sites, with the specific example of [security] tag, on the IT Security.SE site.   \nReally? You're asking a *security* question on a security site?? That's just shocking."}, {"author_name": "Dave", "gravatar_hash": "6fffbf547f0efa568396d6e21631884d", "author_url": null, "date": "Jan 22, 2011", "message": "Here's part of the problem of your \\wishes\\ Jeff.  The fact is that a post could related to several subjects (i.e. Generics, .NET, C#).  I don't see why a post can't have all three just as an example.  Because what happens is the OP not only thinks these relate because they do but they are thinking \\audience\\.  To get people to respond faster and to tap into a much larger pool of programmers who relate to those subjects that could most likely help you in your particular post is much greater when you add several tags (thus the pool of users who view your post is larger by each relate tag to your overall subject).\n\nI just don't think the science behind this will work as you wish simply due to the fact that some things really do need to relate to several sub topics and the fact that anyone human is not going to sit and wait for people to respond if they use a tag that's only been used 100 times (100 threads) for example...because that area may not be visited often therefore your chances of getting a good range of answers and quick feedback is much less if using one or two tags.\n\nWhen I post, I want a range of answers from programmers who may dwell in other related areas (related meta areas).  Example, lets say I wanted to post a question on a problem I have with AJAX, specifically jQuery.  And that question has to do with the way you can do it in JavaScript vs. jQuery and performance.  Well I'd want to add jQuery and JavaScript to my tags.  Just makes sense.  Not just jQuery."}, {"author_name": "Chris Marisic", "gravatar_hash": "f0e7c2d0d5d83c928cfcfce66928160e", "author_url": "http://www.marisic.net", "date": "Mar 10, 2011", "message": "That's a terrible reason to remove the best-practices tag. I accept your reasoning for the other tags but applying that justification to best-practices is disingenuous.\n\nTo state that best-practices are subjective, is wrong. Best practices require consensus on application"}, {"author_name": "Jeff Lunt", "gravatar_hash": "8ef93fcf1d542ad7bbe654a74d24716d", "author_url": "http://jefflunt.com", "date": "Dec 22, 2011", "message": "I think removing meta-tags is absolutely the right way to go. However it doesn't solve the underlying issue - that people still want a way to occasionally filter the list of questions in a way that is more about relevance to them, than simply topic-based filters (a la the \"favorite\" and \"ignored\" tags).\n\nThough it's proven to be a very unpopular proposal (http://meta.stackoverflow.com/questions/116843/a-proposed-solution-to-homework-easy-questions-and-other-issues-around-filt), I think a filter (or maybe just a view, as is suggested in the comments) that allows you to filter questions based on relative reputation gained in tags (relative to your own reputation gain in a tag) can help answer some of the qualitative features that people want, in addition to outlawing meta-tags.\n\nThe point is, the use of meta tags is a symptom of what people ultimately want, and they were using tags as the best solution available."}, {"author_name": "Jeff Lunt", "gravatar_hash": "8ef93fcf1d542ad7bbe654a74d24716d", "author_url": "http://jefflunt.com", "date": "Dec 22, 2011", "message": "i.e. build a better filter, and people won't try to use tagging for filtering."}]}