{"response": [{"author_name": "Kevin Dente", "gravatar_hash": "23c1e2063688620b75b248e08c0d5c24", "author_url": "http://weblogs.asp.net/kdente", "date": "Aug 13, 2010", "message": "Did you consider other ways of bisecting the community as well? For example - linux-endusers and linux-hackers? Are there commonalities across end-user communities with different distros?"}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://robspages.net", "date": "Aug 13, 2010", "message": "The better comaparison here is Stackoverflow (builders) versus SuperUser (users). The Ubuntu community is a group of users which may overlap with builders, but in general is a different group from the linux builders community."}, {"author_name": "Thomas Owens", "gravatar_hash": "8579087f6aad114044755cd7d64a36c9", "author_url": null, "date": "Aug 13, 2010", "message": "I don't buy the whole audiences thing.\n\nStack Overflow has managed to do just fine with everyone from the expert programmers to the novices, the Mathematics and Statistical Analysis exchanges are also handling a variety of topics at all different levels of expertise and different domains really well. I originally supported and even committed to the Ubuntu Stack Exchange, but now, I have no desire to use it as it's just fracturing the Linux community even more. And most, if not all, of the questions on Ubuntu are just as applicable to any Debian-based distribution, if not any Linux distribution.\n\nNever again am I going to partake in an exchange that has such a narrow focus. It's bad for the community and it's bad for the world as a whole. Let's group knowledge on a reasonable level."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Aug 13, 2010", "message": "There are ubuntu questions that aren't necessarily Unix questions.\nOtherwise there is no point in having any SO sites for specific programming languages, you could just have turingmachine.exchan ge. Or even replace all the computer stuff with semiconductorphysics.exchange"}, {"author_name": "Miguel de Icaza", "gravatar_hash": "2f7d76c50d0b76b8ce21808ab68e93d1", "author_url": null, "date": "Aug 13, 2010", "message": "The reason for the spike in the Ubuntu stackexchange was simple: voting for this stack exchange was promoted in the Ubuntu world, while the Unix one was not.\n\nWhen I contacted Jeff, I brought this up, and after one blog post and one tweet we reached the number of required votes to enter the second phase.   \n\nUbuntu is just a particular brand of Linux desktops, and one that has built on the incredibly work that was done by thousands of developers before Ubuntu even materialized.   \n\nI would not mind if the split was \"user-centric Unix Stack Exchange\" vs \"Professional Unix Stack Exchange\", but instead what we have is \"One particular brand of Linux stack exchange\" and \"All other Unix and Linux systems\" stack exchange.\n\nTo make things worse, Ubuntu is a particular product from a particular company in a space that has contributors from every corner of the world helping things evolve.    Linux brands come and go.   First there was the \"Soft Landing Linux\" which was the \"easy one\", this one was replaced by the real easy one \"Slackware\", which was later replaced by the \"real easy one\" called \"Red Hat\", which later got replaced by the \"this time it is really easy for real\" version \"Fedora\" and now we have the \"no, but this time we really mean it easy\" version called \"Ubuntu\".\n\nThe reality is that Ubuntu is a tapestry of software that is maintained by several organizations and several organization curate different end-user centric versions of Linux.  Ubuntu just happened to have marketed themselves better and while other distributions depended on CD sales as a service to fund the work, Ubuntu invested in marketing their products by seeding the world with their brand of Linux and gave CDs away for free. \n\nThis worked wonders, but Ubuntu is not more \"user friendly\" than other user-friendly Linux distributions.    As someone pointed out recently, despite Ubuntu's advancements to the software stack itself, the majority of the work being done to advance the Linux desktop does not even come from Ubuntu.\n\nThe slide deck from the presentation from a couple of weeks ago is here:\n\nhttp://www.slideshare.net/nearyd/gnome-census\n\nAnd that is why I believe that we should have either a merged Linux/Unix stackexchange or have the split be \"user-centric\" vs \"expert-centric\", but not one-brand vs \"everyone else\"\n\nmiguel."}, {"author_name": "Sandy", "gravatar_hash": "c310b922aac3000f3761650881343dea", "author_url": "http://automorphic.blogspot.com", "date": "Aug 13, 2010", "message": "@mgb: You clearly do not use SO.\n\nI completely agree with Thomas and Miguel.  Furthermore, I think the distinction between \"advanced\" and \"non-advanced\" users is vague and unhelpful.\n\nOn unix.stackexchange, I'm advocating that we drop the \"for advanced users\" phrasing from our description:\n\nhttp://meta.unix.stackexchange.com/questions/29/can-we-get-rid-of-the-for-advanced-users-part-of-our-description\n\nAnd finally, I am disappointed by the assumption that Beginner == Ubuntu.  There are many \"advanced\" Ubuntu users, and many \"beginner\" Linux users on various distros.  Should we have a separate SE for each distro's beginners?\n\nI think SO has shown that experts and beginners can all work together to share knowledge, even if the specific language/distro/whatever is not exactly the same between them."}, {"author_name": "Sandy", "gravatar_hash": "c310b922aac3000f3761650881343dea", "author_url": "http://automorphic.blogspot.com", "date": "Aug 13, 2010", "message": "For what it's worth, we've removed the \"for advanced users\" phrasing from unix.stackexchange.\n\nhttp://unix.stackexchange.com/about\n\nWe are now officially for *all* users."}, {"author_name": "Dan", "gravatar_hash": "c5355f878186f8cc7feade633022683d", "author_url": "http://u2tech.wordpress.com/", "date": "Aug 13, 2010", "message": "Yup, I think the root issue here has been mixed up with the branding.\n\nIt should be split up exactly like Super and Stack, one focusing on typical end users and one focusing on the technical community. This solves the issue posed in your paraphrased response AND stops you needing a narrowly focused site for just a single brand."}, {"author_name": "Gnoupi", "gravatar_hash": "11d02948741b436f70421b07ffb9baa5", "author_url": null, "date": "Aug 13, 2010", "message": "The only \\pity\\ point with these proposals is that they overlap in the first place with Super User, which was a good place to ask these questions, already for a year.\n\nI understand the fact that a community wants to have their own personal place, but it's just pity to overlap this way."}, {"author_name": "Gnoupi", "gravatar_hash": "11d02948741b436f70421b07ffb9baa5", "author_url": null, "date": "Aug 13, 2010", "message": "To be more precise on my point. I understand that the \"regular\" community will be stronger if they are from a close group to begin with.\n\nHowever, it makes it harder for people who want to ask questions, as it adds one more site they should check to ask their question on."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 14, 2010", "message": "@gnoupi I view this as a \"pie only gets larger\" scenario. The internet isn't shrinking, it's getting bigger every day.\n\nAnd some nominal amount of duplication is actually good, since our engine is so much better than everything else out there at surfacing great content.* If there are 5 related sites with STRONG, tight-knit communities that could all contain the question, that's just increasing the odds you end up with us (and quality answers) rather than a hyphen-site or PhpBB.\n\n\n\n* But I am biased of course."}, {"author_name": "[ICR]", "gravatar_hash": "48a02e16370caadaedff78e2a94656ce", "author_url": "http://www.morethannothing.co.uk", "date": "Aug 14, 2010", "message": "There is a difference between the novice and experienced users on SO and the novice and advanced users on a linux Q&amp;A site. \n\nProgrammers in general (the ones on SO at least), aspire to be more experienced programmers. It is the continual process of self improvement that prevents novice users from being too scared off by the cohabitation of advanced and novice questions.\n\nConversely, as the ad hoc survey showed, there exists a community of people who have no interest in moving into the murky depths of linux. There is still a sense of progression - becoming better at using your OS, but it is moving in a different direction to the more general Unix/Linux community.\n\nI guess the question then is, in the goals and progression of Linux end-users similar enough across distros to warrant merging them or keeping them separate.\n\nI suppose it's easier to merge communities than to separate them."}, {"author_name": "ricebowl", "gravatar_hash": "db5a61382c2ba7309071c323edb4013b", "author_url": null, "date": "Aug 14, 2010", "message": "For what it's worth, in my opinion as a user of ubuntu.stackexchange, I'd happily see the Unix/Linux and Ubuntu communities merged.\n\nAs others have pointed out the difference between 'regular' Linux and Ubuntu is minor (if it exists at all), and the experience of the audience seems irrelevant to the appeal of a site: SO continually attracts new users and, more often than not, welcomes them.\n\nThe tagging system would seem to happily allow for distro-specific questions, and the knowledge from people experienced with the wider range of distributions would likely improve the quality of solutions offered.\n\n...I agree with mirror-universe Cartaino? Oh, I'm going to that special Hell..."}, {"author_name": "Alexander Pas", "gravatar_hash": "ca5fd69395f0422a8c9ef11db8bb29ca", "author_url": "http://dropdev.org", "date": "Aug 14, 2010", "message": "The question here actually is, would we merge mac.stackexchange.com with bsd.stackexchange.com\n\nif you know the answer for that question, you know the answer for this question.\n\nThe Linux &amp; Unix Community is perfectly able to answer my dpkg questions, but would they know how to  change the order of the icons in the Favorites Menu in the Ubuntu Netbook Remix (actual question from the forums)"}, {"author_name": "Sandy", "gravatar_hash": "c310b922aac3000f3761650881343dea", "author_url": "http://automorphic.blogspot.com", "date": "Aug 15, 2010", "message": "@Alexander: that's a really strange analogy.  You seem to be implying that \"Linux\" desktop users and \"Ubuntu\" desktop users have totally different user experiences, in the way that \"BSD\" desktop users are not using anything remotely like Mac OS X.\n\nThis analogy falls apart when you realize that 99% of the end-user experience in Ubuntu is the same in any other GNOME-based Linux distribution, whereas *BSD usage outside the terminal is 100% different from OS X.\n\nSo let me answer your question thusly:\n\n1) There is no mac.stackexchange or bsd.stackexchange, and in fact you could ask questions about both on unix.stackexchange!\n\n2) You ask \"would they know how to [customize UNR]\"?  The answer is an emphatic \"yes\", *if* we have the participation of the Ubuntu community!  We already have questions on GNOME and KDE, and welcome questions on Meego, Android, and any other UI for *nix.  For the record, we also have plenty of Ubuntu-specific questions and answers already. :-)\n\nJust like we don't need a separate SO for each programming language, we don't need a separate SE for each *nix UI.  Let's get all of these experts together and stop wasting our limited support resources!\n\nThere's absolutely no reason that unix.stackexchange couldn't be the best place to ask questions about UNR, if we don't intentionally segregate our community based on branding."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Aug 15, 2010", "message": "\"I view this as a “pie only gets larger” scenario. The internet isn’t shrinking, it’s getting bigger every day.\"\n\nReally? Then what is the justification for StackOverflow? Wouldn't it be better to allow all the thousands and thousands of programming sites that were already there to go on? SO explicitly tries to collect *everything* programming-related on one site, in one community.\n\nIt also doesn't make much sense. A community with 5000 active members is much better and more helpful than 10 communities with 1000 members each. The total size of the pie doesn't matter. What matters is how big the individual slice is. The goal of SO wasn't to make a bigger pie, it was to make a pie with fewer slices. \n\nSo we didn't have to do a Gogle search and then trawl the first 50 results, each pointing to different sites that might or might not have a relevant answer to our question, but instead only had to go to *one* site and find answers to *everything*.\n\nI think the Area51 process needs some kind of \"benevolent dictator\" oversight *in addition* to the community-driven approach. If you just let the community do its thing, you get something like Linux, where everyone and his uncle maintains his own distro, and each of these are competing, rather than cooperating. You can argue that this is a good thing for Linux (I'm not so sure), but for a Q&amp;A site, I fail to see how it can be positive.\n\nA single *popular* site, where your question will be read by a lot of people who are able to answer it, trumps my little pocket community of 20 people no matter how much expertise those 20 members have.\n\nOf course, I'm not saying the community-driven approach is a bad thing, or that your \"evil Jeff\" approach would be better. That's going to the other extreme, and it would be far, far worse than what you have currently. \n\nBut remember that StackOverflow wasn't created because the community of programmers across the world decided \\let's pool our knowledge on this one uber-site\\. It was created because two specific programmers had a vision for pulling this off, and *making* the community come and make the site a success.\n\nWithout those two visionaries, SO would never have existed. You can't let the community do its thing entirely freely, or you end up with a million communities, each too small to serve their purpose of actually running a popular Q&amp;A site. Exactly like we had before SO.\n\nSo my suggestion:\nKeep the area51 process as is, but follow up with some kind of by-hand filtering/merging/approval process where you/Joel/select StackExchange employees make a subjective judgment of whether the site should be made permanent or scrapped (the existing options), or merged into another. And in making this decision, doing what you did in the Ubuntu case might be a good idea: email prominent members of the two sites, and ask how they'd feel about a merger, discuss what could be done to make it work, and then either create the site and accept the overlap, or merge it into another.\n\nQuite simply, am I going to get better answers to my questions as an Ubuntu user by having a dedicated Ubuntu site? On one hand, many knowledgeable Ubuntu users will be there. On the other hand, all those Linux users who don't focus specifically on Ubuntu, who might *also* be able to answer, almost certainly won't see my question.\n\nThe problem is that the Ubuntu community by themselves almost certainly won't give you a reliable answer. They'll just fight for their independence... The way Java programmers and C++ programmers and Perl programmers did until they got rolled up into StackOverflow.\n\nAnd maybe the Ubuntu users are right this time, maybe they are better off alone. Maybe not. So perhaps we need the \"benevolent dictator\" to make the final call.\n\nIf you leave it to the community, *every* site will decide it's better off alone. And eventually you'll get a C++ site and a Java site on SE competing with SO."}, {"author_name": "Miguel de Icaza", "gravatar_hash": "2f7d76c50d0b76b8ce21808ab68e93d1", "author_url": null, "date": "Aug 15, 2010", "message": "I address the specific difference between MacOS vs other Unix in this post:\n\nhttp://meta.unix.stackexchange.com/questions/15/macosx-whats-on-topic"}, {"author_name": "Scott", "gravatar_hash": "629cfe92c00bcb6a8cb13834a3b23e17", "author_url": "http://reusablecode.blogspot.com", "date": "Aug 15, 2010", "message": "I'd compare this to a site for people who enjoy using electricity vs. a site for people in the electricity generation industry. They have completely different concerns, so it makes sense to have separate discussion groups."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": "http://sam.haslers.info", "date": "Aug 16, 2010", "message": "&gt; I don’t know if there is a general rule to be derived from this case study. I’m still a big fan of the larger sites. I’m wary of encouraging smaller, focused sites when a larger group stands to benefit from their combined resources.  Stackoverflow.com is a testament to how well diverse communities can pool their resources when they have a common goal; in this case, writing better code. Maybe that’s a criteria which binds a community together: do they have common goals? Stack Overflow didn’t split off into a .NET site, a PHP site, a C# site, a Java site, etc… and we’re better off for the experience.\n\nI think the reason SO didn't split is because each user has their own unique set of languages that they're interested in, so there isn't a clear fault line on which to break the community apart; or rather there are enough connections between the different groups to hold it together. It sounds like that wasn't the case with the Ubuntu and Linux communities."}, {"author_name": "KG", "gravatar_hash": "622b16c0846b063c94027bd61be0c767", "author_url": null, "date": "Aug 16, 2010", "message": "There was the same discussion on Area51 about \"Guitars\" (http://area51.stackexchange.com/proposals/6320/guitars) and \"Musical practice and performance\" (http://area51.stackexchange.com/proposals/4059/musical-practice-and-performance) or \"Musicians\" (http://area51.stackexchange.com/proposals/7305/musicians).\n\nIn fact, strangely, Guitars is more specific but much more popular than the 2 others and you'll probably have the same kind of answers if you ask them why choosing \"Guitars\" instead of a more generic one."}, {"author_name": "Rob Crowther", "gravatar_hash": "556f7b6ad8246f13ad6edc76be170bd4", "author_url": "http://www.boogdesign.com/b2evo/", "date": "Aug 16, 2010", "message": "To echo some of the above comments - when I have a 'user' question about my Fedora laptop, which community should I go to?  From the above discussion of what the focus of each site will be I'd be leaning towards the Ubuntu one (and obfuscate slightly what distro I'm using), since that will likely have a larger number of people who can tell the the answer.\n\nAs another example to consider: what about SA vs Doctype?  People ask their web design questions on SA despite the existence of Doctype because the 5% of SA users who care and know enough about the subject to answer the question is a far bigger pool of expertise than the 75% of Doctype users."}, {"author_name": "Duff", "gravatar_hash": "974938b8250a08cf9e22714aff1f9fcc", "author_url": null, "date": "Aug 16, 2010", "message": "You guys got rolled by some Ubuntu trolls.\n\nWhen does the IBM xSeries server Stack Exchange open? Those IBM servers are way different than all of the other servers out there."}, {"author_name": "Mike Schinkel", "gravatar_hash": "81df87e0d3e269d6fa6a17c6914fd656", "author_url": "http://mikeschinkel.com", "date": "Aug 17, 2010", "message": "Robert,\n\nWhat a really well written and excellent post. I thoroughly enjoyed reading it beyond my interest in the subject.\n\nUnlike most here on this forum I support the idea of breaking out as many specialty sites as there are people who are clamoring for them. Whenever people are interested in specialization it's because they have reasons that motivate them to want it.  One specific reason is that it's easier to have a high reputation relatively speaking on a more specific site than on a broader site (there are ways to address this somewhat that I plan to discuss on meta, but those ways don't exist today.  See http://meta.wordpress.stackexchange.com/questions/64/top-users-by-tag-suggestion-for-stackexchange for a preview.)\n\nWhat surprised me though is the level of visceral opposition to the creation of specialized communities. It almost feels like pro-lifers circling an abortion clinic where you've got people who adamantly want to impose on others the circumstances under which they may operate and the choices they might have. It just doesn't feel right to me.\n\nBut I guess it shouldn't surprise me; this is not new; people have jockeyed for position like this for time immemorial. Look at Canada and the Québécois. Or Sri Lanka and the Tami Tigers. Or Iraq and the Kurds. And these are only references from modern day. If you want to go back further there was the war between the Continental Army and the British Crown (for those who don't catch the reference, it's the war that created the USA.) And as long as men (and women) exist they will seek to carve out their own territory; after all there are far more who prefer to be a big fish in a small pond than vice-versa.\n\nWhat's more, it's in StackExchange's best interest to grow as many different *successful* sites as they can much like it's in Proctor &amp; Gambles best interest to offer you seven different types of laundry detergent; the more they offer the more likely they are to have a brand that resonates with each and every prospect and keeping them from ceding the ground to others.\n\nSo for those people here who are fighting against these \"splinterings\" it is a fool errand. Since there is no taxing government to oppose the separatists on StackExchange fighting this is simply a lost cause. Your wanting it not to change won't make it not.\n\nI myself made the initial proposal for WordPress Answers even though SO had  over 3000 questions tagged \"wordpress.\" And as it is exiting private beta tomorrow I am already seeing even more value in it being exclusively WordPress than I originally envisioned. The quality of answers on WA are much higher on average than the \"wordpress\" tagged answers on SO, \n\nI also feel a community forming around WA that I've just never felt over at SO (probably because SO was so broad I never felt the urge to contribute.) Sure there is community among the top contributors on SO but Dunbar's Number tells you that after a community grows past 150 members it becomes too big for everyone to know and respect everyone else and that's when factions start forming.  \n\nActually Dunbar's Number would suggest that StackExchange *should* create more specialized sites. A rule of thumb could be that anytime the top (10% of?) contributors exceeds 150 then it's time to split to community in half. There's even a very successful (and mostly unknown) company whose name I can't remember who has an internal rule that it must split a division in two when said division exceeds 150 employees. And that's one of the ways they've been successful.\n\nWorse, on SO you get people who have no knowledge of WordPress at all answers questions about WordPress it because WordPress questions often imply PHP, MySQL, jQuery, CSS or other answers and because answering questions is what those people do. And with a lack of speciality on SO there are not enough others who are policing the site to provide a check and balance on these bad answers. This leads people in the wrong direction which is wrong, wrong, wrong! For example, WordPress uses MySQL but best practice is to use the PHP-based API whenever possible. I see people on SO recommending complex MySQL queries when a simple API call will do!\n\nThat said, let me suggest that everyone instead put their heads together and work on a solution?  As I see it the problem is cross-over content and cross-over between communities. Agree, or no?\n\nBTW, I do agree with the hardliners on one thing; it's saddens me to see a great answer for my favorite topics over on another site. So at a very high level I think there's a need for StackExchange to develop a way for sites to share tags and content and people. \n\nFor example: \n\n1.) When someone posts a WordPress question on SO they could choose to apply it to the WordPress Answers site in addition or instead. \n\n2.) We could also have the communities at SO and at WA collaborate on tags that would automatically be shared, i.e. \"wordpress\" is a no brainer but there are many more. \n\n3.) People with enough reputation could \"attach\" or \"detach\" the linkage of questions between site. \n\n4.) And possibly there could be reputation shared across sites via some formula and that each user could to influence via his or her profile.\n\nBut it will be a hard problem to solve so many there needs to be a meta discussion about how to solve?  \n\nAnyway, that's far more than JMTCW. Let the chips fall where they may."}, {"author_name": "Mike Schinkel", "gravatar_hash": "81df87e0d3e269d6fa6a17c6914fd656", "author_url": "http://mikeschinkel.com", "date": "Aug 17, 2010", "message": "Robert,\n\nBTW, you mentioned: \"Stack Overflow didn’t split off into a .NET site, a PHP site, a C# site, a Java site, etc… and we’re better off for the experience.\"\n\nI'd far prefer to see a PHP-specific site. I'd probably participate in that one. As is, StackOverflow holds little interest for me so from my perspective not everyone's experience is better off."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 20, 2010", "message": "ok, we couldn't decide editorially either (well, <i>I</i> decided, but I'm not the only person with decision making powers) so we put it to a vote:\n\nhttp://blog.stackoverflow.com/2010/08/should-unix-linux-and-ubuntu-be-merged-vote/"}, {"author_name": "Johnathan Williamson", "gravatar_hash": "429416465877af2a50461a130501bfb4", "author_url": null, "date": "Aug 20, 2010", "message": "@Mike\n\n\"I’d far prefer to see a PHP-specific site. I’d probably participate in that one. As is, StackOverflow holds little interest for me so from my perspective not everyone’s experience is better off.\"\n\nI can understand WordPress - it's a large platform on it's own and most likely deserves it's spot as such. It's not a programming language in itself. It is likely to have a high proportion of questions not specifically relevant to PHP.\n\nThe Ubuntu vs Unix analogy doesn't however, only a low proportion of questions are likely to be completely unique to Ubuntu.\n\nI think the majority of your points are pretty spot on but I don't understand this last one, it's so incredibly simple to filter out other languages and just focus on one?\n\nhttp://stackoverflow.com/questions/tagged/php\n\net voila - stackoverflow minus any other programming language."}, {"author_name": "David Thornley", "gravatar_hash": "c5750c14e2bd0f866dfe2239c40fd861", "author_url": null, "date": "Aug 20, 2010", "message": "Having been participating on Unix &amp; Linux, I popped over to Ubuntu.  I didn't really see different questions there.  The novice-to-expert ratio seemed lower on Ubuntu, but there were questions that were essentially duplicates.\n\nGiven the very high chance that the same questions will be asked on both forums, I think maintaining separate ones is pointless.  Voting to merge."}, {"author_name": "Li Lo", "gravatar_hash": "357a20e8c56e69d6f9734d23ef9517e8", "author_url": null, "date": "Aug 20, 2010", "message": "I for one won't be contributing anymore if the ubuntu and unix sites get merged. I even regret committing to the unix se following miguel de icaza's referral because he is rude enough to add (not invite) me to the monodroid discussion list without asking my permission."}, {"author_name": "Sandy", "gravatar_hash": "c310b922aac3000f3761650881343dea", "author_url": "http://automorphic.blogspot.com", "date": "Aug 20, 2010", "message": "Li Lo, did you perhaps fill in his sign up form for the private beta a few months ago?\n\nI'm not really sure what your complaint has to do with the issue of merging ubuntu and unix stack exchange sites, though."}, {"author_name": "Li Lo", "gravatar_hash": "357a20e8c56e69d6f9734d23ef9517e8", "author_url": null, "date": "Aug 20, 2010", "message": "Just one reason why it makes sense to keep ubuntu and unix se separate: http://www.techdrivein.com/2010/08/ubuntu-probably-first-ever-linux-distro.html"}, {"author_name": "Li Lo", "gravatar_hash": "357a20e8c56e69d6f9734d23ef9517e8", "author_url": null, "date": "Aug 20, 2010", "message": "@Sandy, yes I signed up for the private beta on a link referred by miguel de icaza. What's your point? That I should have known that I would be spammed?\n\nMy point is that the experience is directly related to the people involved and miguel is clearly involved in the unix se."}, {"author_name": "Miguel de Icaza", "gravatar_hash": "2f7d76c50d0b76b8ce21808ab68e93d1", "author_url": null, "date": "Aug 20, 2010", "message": "Li Lo,\n\nWhen you sign up for the preview it says that the purpose of the preview is for \" developers that might be interested in providing feedback to us on how to improve this product\".   The way we collect this feedback is through discussion in the mailing list.\n\nI wish we had some sort of web forums, but we do not.   We have mailing lists.   \n\nLuckily, it is trivial to remove yourself from the list.   And if you send me your email address, I will make sure that you are not on the list.\n\nMiguel."}, {"author_name": "Sandy", "gravatar_hash": "c310b922aac3000f3761650881343dea", "author_url": "http://automorphic.blogspot.com", "date": "Aug 20, 2010", "message": "Li Lo, perhaps you should provide Miguel a list of your favorite sites on the internet so he can avoid ruining them for you by asking and answering questions on them."}, {"author_name": "Li Lo", "gravatar_hash": "357a20e8c56e69d6f9734d23ef9517e8", "author_url": null, "date": "Aug 20, 2010", "message": "Miguel,\n\nThanks for the offer, I've already unsubscribed.\n\nThe wording on the page is: \"We are looking for developers that might be interested in providing feedback to us on how to improve this product. [...] This survey will help us select developers to invite to this beta.\"\n\nI received no invitation. I consider a direct subscription, without clearly specifying somewhere that that's what going to happen, rude. Feel free to disagree."}, {"author_name": "Li Lo", "gravatar_hash": "357a20e8c56e69d6f9734d23ef9517e8", "author_url": null, "date": "Aug 20, 2010", "message": "@Sandy: or perhaps I could choose not to involve myself in those sites, like I stated previously.\n\nBTW, your rhetoric really knocked my socks off. For a second there it looked like you twisted my words around to suit your purpose. You know, like you would do defending someone you used to work with. Oh, wait...\n\nAnyway, I admit defeat, y'all win. I'll stay on topic."}, {"author_name": "Marty Applebaum", "gravatar_hash": "c7dcb0553bf25b7a5c93cb1448062029", "author_url": null, "date": "Aug 20, 2010", "message": "@LILO your use of fallacies to make a point really knocked my socks off.\n\nIn your last post you:\n(a) Circumstantial Ad Hominem: http://www.nizkor.org/features/fallacies/circumstantial-ad-hominem.html when you fail to address Sandy's points, but instead try to claim that Sandy is doing this out of self interest.\n\n(b) Appeal to Ridicule: http://www.nizkor.org/features/fallacies/appeal-to-ridicule.html when you joke about your socks being knocked off as a response to the lighthearted joke that is merely mocking your elevated sense of entitlement. \n\n(c) False Dilemma: http://www.nizkor.org/features/fallacies/false-dilemma.html when you try to establish a link between the StackExchanges being merged and being signed up for a mailing list for a private beta.\n\n(d) Two wrongs make a right: http://www.nizkor.org/features/fallacies/two-wrongs-make-a-right.html the tantrum that you are having on this post is not over the value to the communities in merging Ubuntu and Linux stack exchanges, it is based on your own biases and what seems to be a personal vendetta.\n\nMy hats are off to you sir, as some of your statements actually pack more than one fallacious construct, but we leave it as an exercise to the reader to find the other six ones that you used in this short exchange:\n\nhttp://www.nizkor.org/features/fallacies/"}, {"author_name": "txwikinger", "gravatar_hash": "4d2d9514d8c1d2fc1f3f5e16a0d5eb41", "author_url": "http://drupal.txwikinger.me.uk", "date": "Aug 20, 2010", "message": "I am clearly for keeping both sites. One of the reason is exactly what Miguel de Icaza is saying in his comments here. Miguel, you just do not understand our community. What you disdain in your comments, is what helps not only the Ubuntu community, but also Linux overall. We are a diverse community and we need to respect each other. I very much respect what you have done for Linux, but I am sorry to say, you are wrong here. See also my blog <a href=\"http://drupal.txwikinger.me.uk/content/why-two-stackexchange-sites-ubuntu-and-unix-should-not-be-merged\" rel=\"nofollow\">http://drupal.txwikinger.me.uk/content/why-two-stackexchange-sites-ubuntu-and-unix-should-not-be-merged</a>\n\nYou do not only need programmers to make Open Source successful. Community work is tremendously important. This is what we do, and it seems we are very successful in it. We are successful not because of what we do for ourselves, but we are successful what we do for others. This is what Ubuntu stands for!!!"}, {"author_name": "Miguel de Icaza", "gravatar_hash": "2f7d76c50d0b76b8ce21808ab68e93d1", "author_url": null, "date": "Aug 20, 2010", "message": "Well, there was a time when there was an \"open source community\".   Now it seems that for the sake of brands and products what we have in an \"Ubuntu community\" a \"Fedora Community\" an \"OpenSUSE community\".   Everyone has a \"community\" aimed at advancing a particular brand of Linux distribution.\n\nLinux distributions come and go.   SLS was the first \"user friendly\" one because the HJ Lu disks were not \"friendly\".    Then \"Slackware\" was the good one, because unlike SLS it had a nice UI for installation (text mode, back in the day).   Then we had Red Hat, and that was better, because it had a full installer and had upgradeable packages!     In France we had Mandrake, in Germany SUSE, in Brazil Connectiva, all of those were desktop-centric, user-focused Linux distributions.  And next we have Ubuntu.   It is unique in that it has a unique source of funding, it does not depend on users paying for some service to keep the development going and you can debate the merits of that, just like some have debated how Ubuntu works with the rest of the larger open source community and the whole \"upstream\" contribution debate.\n\nToday there are a number of user-focused Linux distributions.   None matches the marketing and funding that went behind Ubuntu, so it is understandable that some folks in the Ubuntu community do not know where their software came from, who created that software, and who funded that software development.\n\nThat software was created for the most part by that \"open source community\" that right now you have decided is too different from Ubuntu, because that faceless community has been focused on creating the software that you use.   That is where those of us that create the software that you run are concerned about: fixing bugs, making the code more stable, adding features, triaging bugs, translating and testing the software.\n\nI wish that you thought about the larger \"community\" as opposed to merely a particular brand of Linux that exists today.   And you cared about improving and supporting the ecosystem that has created the grounds for Ubuntu to even exist in the first place.\n\nI realize this is asking too much.   At some point there is a sense of allegiance to \"my team\", whatever \"my team\" is.   It is irrational, just like in sports, just like in nationalism, just like in schools, just like in any other group.   \n\nYour argument boils down to \"my team\", I wish that people in the community cared about advancing the broader goals of free software and open source software as the principles is what matters to those of us that built the system.   I realize that those that are new to the community might not have the whole story, and it is why it is easy to focus on \"my team\" vs the greater goals.\n\nI have been writing free software, mostly to advance the user experience on Linux for the last 18 years, so \"my team\" is a little bit larger than the distribution of the day."}, {"author_name": "Umang", "gravatar_hash": "e0c49abbf2db17e7a944af4b19d03ce2", "author_url": null, "date": "Aug 20, 2010", "message": "I was one of those people who committed myself to Ubuntu and fulfilled my commitment in the private beta, I registered on Unix &amp; Linux only in the public beta (in fact, so recently my reputation is still 101). So I'll answer the why first: my feed reader showed me this: http://fridge.ubuntu.com/node/2083. It looked interesting, I registered on Area 51 and took part. No such publicity (on feeds or lists I follow) for the Unix and Linux website. I found out about the other site only when I was looking at Ubuntu Meta.\n\nWhy I voted for them to be merged (forgive me if someone has said this before, I haven't read all the comments): There's a test that I would perform to see if there needs to be a distinction. If someone posts a question on the Unix &amp; Linux site about (say) some apt usage, but mentions he/she is using Ubuntu, can I flag the question and say \"should be moved to Ask.Ubuntu.com\"? I would say I cannot. There are almost as many derivatives of Debian and Ubuntu as there are active users on both the sites put together. A large portion of the questions asked on Ubuntu SE will either be newbie Linux questions or apt related questions. These can both be addressed on Unix &amp; Linux SE. What cannot be addressed on Unix.SE are questions like \"how do I get Ambiance on Hardy\" or \"will natty have a new sound theme?\". For this, there's the Ubuntu forums - SE is a Q&amp;A support software, not random discussion BB.\n\nSome of my other reasons for voting for a merge include those already mentioned, especially Thomas's (http://blog.stackoverflow.com/2010/08/unix-and-ubuntu-why-both/#comment-49174)"}, {"author_name": "Stefan Lasiewski", "gravatar_hash": "c0b115d669116674fe5735fa85d49a81", "author_url": "http://stefanco.com", "date": "Aug 20, 2010", "message": "I believe that @Umang &amp; @Miguel de Icaza are both correct with their explanation of why Ubuntu SE grew so much faster then the Unix SE.\n\nAs for myself, I didn't have time to do any marketing (Busy at work, kids, and I left on vacation). I don't participate on most online Unix/Linux forums like linuxquestions.org, etc. (I don't get good answers there), so I didn't promote it there.\n\nI wanted to see if this site would become successful if I did nothing to promote this site. Would this site grow organically? Would others would promote the site. Would a Unix superstar promote our site to their thousands of followers on Twitter?\n\nI'm a member of both Ubuntu and Unix SE site, but I have unintentionally stopped participating on Ubuntu. I guess I feel that most of my Ubuntu questio on Ubuntu SE will get a better answer and a bigger bang if I ask them on the Unix SE."}, {"author_name": "Stefan Lasiewski", "gravatar_hash": "c0b115d669116674fe5735fa85d49a81", "author_url": "http://stefanco.com", "date": "Aug 20, 2010", "message": "Ironically, I proposed the \"Unix &amp; Linux\" site on Area51 in response to the \"Apple\" site on Area51.\n\nThe \"Apple\" SE site began a week or so before \"Unix &amp; Linux\" SE site, but the Unix &amp; Linux SE grew faster and reached Beta first.\n\nIs the \"Apple SE vs. Unix SE\" question equal to the \"Unix SE vs. Ubuntu SE\" question?"}, {"author_name": "Sandy", "gravatar_hash": "c310b922aac3000f3761650881343dea", "author_url": "http://automorphic.blogspot.com", "date": "Aug 20, 2010", "message": "@Stefan: I don't think it's equivalent, as I commented above.\n\nThe biggest difference is that Ubuntu is 99% similar to every other GNOME-based Linux distribution, which means the \"beginner\" questions and answers will be largely identical between Ubuntu and other GNOME-based Linux distributions.\n\nOS X has a completely different beginner user experience, so there are perhaps some valid arguments for them to have their own SE.  At unix.stackexchange, it seems most OS X questions have been about the *nix underbelly, which seems to be working out quite well.  Though I personally wouldn't mind questions about iApps if they started showing up."}, {"author_name": "Jef Spaleta", "gravatar_hash": "5efa1b00c388e4e232df7eec9a4f0d28", "author_url": null, "date": "Aug 20, 2010", "message": "@Miguel de Icaza \n\"Now it seems that for the sake of brands and products what we have in an “Ubuntu community” a “Fedora Community” an “OpenSUSE community”. Everyone has a “community” aimed at advancing a particular brand of Linux distribution.\"\n\nWhoa... don't stand-up RedHat/Fedora's policy on how to balance brand identity with wider community involvement as similar to the approach that Canonical/Ubuntu takes.  That's slightly offensive to me as a Fedora project volunteer.  \n\n-jef"}, {"author_name": "txwikinger", "gravatar_hash": "4d2d9514d8c1d2fc1f3f5e16a0d5eb41", "author_url": "http://drupal.txwikinger.me.uk", "date": "Aug 20, 2010", "message": "@Miguel: The problem with your argument is that there is no \\one\\ Linux community, in the same way as we are not a single Country on this Earth.\n\nPeople are different, and they group together in ways they see fit. That is just reality. I myswlf have lived in a lot of different countries and in every place, I have made this same experience. \n\nIf you do not like it and you force people together bad things happen. See, what happen with Yugoslavia, the Soviet Union, etc.\n\nEach of theses communities has different goals coming from their differences. They will follow those goals. However, this does not mean that this different goals are contra-productive. Even a mount of ants has groups of ants with different goals. Some will go and get food, some will defend the mount. Overall, both is necessary.\n\nTherefore, the question is: Do we embrace the diversity that is inevitably there, or do we try to put everybody into one uniform?\n\nDo you want to have a clone army, or do you want to have individuals that can aspire their own individualism as they chose.\n\nWhat you call branding, is the result of individual choices. Because of it, we have choices (as to before when everybody had to use the one and only OS that was available). \n\nWe have the choice now, if we want to allow this choices to be made, or if we force everybody to wear the same shoe. \n\nWhy don't we just have all questions ask on stackoverflow? You can tag it. It doesn't matter that one is asking about cooking techniques, the next one about the English language, the third one about Home Improvement. \n\nSo why do you split up sites anyway? But you know, in effect we don't. Yes, there is a form of segmentation, but still all is together on this amazing ether called Internet.\n\nDiversity is better than a monolithic society. Diversity allows ideas to be tested and to compete in a friendly competition. Diversity allows things to be checked out and see what will survive, instead of making the decision for everybody else.\n\nThe fact that Open Source has so many brands is our strength, not our weakness. \n\nOnly because you do something under a brand, does not mean that you do not support the whole! When I watch my favorite sport, I cheer for my favorite team, but you know what I also cheer for the sport. \n\nWhen we organize community events under the Ubuntu banner, we also promote Linux. We also promote every single project that promotes to Open Source. We also promote every single contributor.\n\nAs more people like SuSe, RedHat, Debian, Ubuntu and any distro, as more people like Linux. All of these brands add to each other, we do not subtract from another.\n\nThe reason is the diversity. If everybody would be the same, we would not need so many brands. We could just have the \\Einheitsstaat\\ the unified country, as the former East Germany called itself to forcefully.\n\nHowever, we all know how it ended. Working together does not require uniformity. In fact the diversity makes working on the common goals we have stronger.\n\nThere is enough space for all of us. And we can support each other. We do this already. That is the idea of Open Source. However, Open Source is not only software. Open Source is a philosophy that goes far beyond software. This is one of the movements we capture in our community. \n\nYou are on \\my team\\ does not matter what. However, that does not mean we cannot give each other the space we need to do things the way we know best.\n\nHaving the two sites as they are now allows us to do exactly that. \n\nDo you really believe if the two sites would be merged it would be the end of it? No, it would not. The same day another ask.ubuntu.com site would come up on another server. As I said in my blog. We fork, because we can.\n\nTry to see the advantages of the what inevitably is reality. Diversity needs to be allowed to be diverse!"}, {"author_name": "txwikinger", "gravatar_hash": "4d2d9514d8c1d2fc1f3f5e16a0d5eb41", "author_url": "http://drupal.txwikinger.me.uk", "date": "Aug 20, 2010", "message": "@Sandy: Ubuntu is not only a Gnome-based distribution. Ubuntu has at least 4 different desktops that are in equal standing to each other in the Ubuntu family."}, {"author_name": "Sandy", "gravatar_hash": "c310b922aac3000f3761650881343dea", "author_url": "http://automorphic.blogspot.com", "date": "Aug 20, 2010", "message": "@txwikinger: Forgive me, I was referring to the standard Ubuntu distribution.\n\nThe same logic holds, though.  When it comes to KDE, XFCE, etc, the experience on Ubuntu's distribution is 99% similar to that of any other distro.\n\nCanonical does have some unique user experiences in UNR, Unity, etc, but we have argued above that there is no reason those questions couldn't be handled in unix.stackexchange.\n\nBesides, a cursory glance at ubuntu.stackexchange shows that the vast majority of the questions there are not really Ubuntu-specific at all.  This duplication is a waste of our limited community support resources."}, {"author_name": "Phil", "gravatar_hash": "717b51c0020d2a527975a5ee44026d12", "author_url": null, "date": "Aug 20, 2010", "message": "I voted \"no\" to the merger question, but I would like to see an easy means of making a question relevant to multiple sites visible on multiple sites. For some tags, that should perhaps even be automatic. Similarly, questions cross-posted to a Unix/Linux site from the Ubuntu SE should automatically appear with an Ubuntu tag.\n\nUnlike in the physical world, multiple online brands can lead to the same product. If you bring in more users with an Ubuntu site, great. You should aim to get questions posted to any SE site in front of the most relevant and knowledgeable potential respondents."}, {"author_name": "txwikinger", "gravatar_hash": "4d2d9514d8c1d2fc1f3f5e16a0d5eb41", "author_url": "http://drupal.txwikinger.me.uk", "date": "Aug 20, 2010", "message": "@Sandy: It is not a question of subject matter, it is a question of community.\n\nI am for giving people choices. We have made the experience that you can give people different places (IRC, forum, mailinglists, etc.) And you will attract differnt crowds, and different tones and styles (and all of that within our CoC). And in additional to that a lot of local communities have all of the above duplicated again.\n\nThe duplication is rarely a problem, and mostly an addition, because people go were they are welcomed and fit in.\n\nI wholehearted support also unix.stackexchange.com but it would be a mistake because in the long run a merged site would lose a lot of people that would fell part of it if both sites remain.\n\nOtherwise, we can just move everything to superuser."}, {"author_name": "txwikinger", "gravatar_hash": "4d2d9514d8c1d2fc1f3f5e16a0d5eb41", "author_url": "http://drupal.txwikinger.me.uk", "date": "Aug 20, 2010", "message": "@Phil: Or knowledgeable people could participate in multiple sites :)"}, {"author_name": "Umang", "gravatar_hash": "e0c49abbf2db17e7a944af4b19d03ce2", "author_url": null, "date": "Aug 20, 2010", "message": "@txwikinger: I don't mean to attack you, but your answering this question will help me understand your point of view: If I have to ask a question about a Linux topic (not necessarily applicable to all distros, e.g. GNOME, KDE, dpkg, apt, upstream builds vs distro repositories, etc) how should I decide which one of these SE sites I should post my question on?\n\nAlso, don't you think that if every community decided to make an SE site for itself, there will be a huge amount of duplication. A user will have to search many different sites before he/she can ask a question because the same question could very well have already been asked on the Debian, Fedora, SUSE, Ubuntu, Mepis, Linux Mint, (generic) Linux or on some other obscure distro you and me haven't heard of. I agree that the Ubuntu support community is very healthy, and is likely to be the most energetic and \"happening\" amongst its peers, but does that make it deserve a separate SE site? How will you argue against an SE site for another very popular distro like openSUSE, Fedora or Debian or a not-so-popular but unique distro like (say) AntiX Mepis? And if you won't, do you think it is alright to have 100 SE sites for Linux distros by 2012?"}, {"author_name": "hannah", "gravatar_hash": "9993f060678e71f866f10b646e7df1f0", "author_url": "http://wwww.google.com", "date": "Aug 21, 2010", "message": "Well, it’s amazing. The miracle has been done. Well done.\n\nhannah\n______________\n<a href=\"http://www.google.com\" rel=\"nofollow\">google</a>"}, {"author_name": "Li Lo", "gravatar_hash": "357a20e8c56e69d6f9734d23ef9517e8", "author_url": null, "date": "Aug 21, 2010", "message": "I just noticed another argument for keeping the sites separate: a lot of questions are about installing software which is the sites are separata makes it easy for someone to answer such a question on ubuntu. To those saying that 99% questions are the same, do your counting again.\n\nIf your argument to merge the sites is to reduce duplication, there's already a tremendous amount of duplication out there: your genes are already duplicated -- everybody else has them :P What's your solution to that?\n\nI think the right solution in this case would be the ability to easily migrate the questions between the sites."}, {"author_name": "Umang", "gravatar_hash": "e0c49abbf2db17e7a944af4b19d03ce2", "author_url": null, "date": "Aug 21, 2010", "message": "@Li Lo: One of the points I made in my comment was about how you can distinguish which of the two sites you should post a question on. You say that the ability to easily migrate would help. My question is, how do you decide which question goes where? If I ask some apt related question on Unix and Linux, will you migrate it just because I had the problem on Ubuntu (Debian people can answer also). If I ask a question about some fancy use of the ls command on Ubuntu, will you migrate it to Unix and Linux? \n\nI really don't see what criteria you could use to migrate questions. The only cases where it would be clear where a question should go would be when someone wants to know something about the Ubuntu development process, a particular Ubuntu release or a question like this: http://unix.stackexchange.com/questions/723/software-developer-switching-from-linux-to-os-x-what-are-the-gotchas. I've not seen many questions like these, and if you have, please point them out.\n\nTo clarify what I imagine when I say you cannot distinguish, I am NOT talking about when it is clear that a question can be migrated or not. I am talking about a situation where if I have a question, there should be only one site where that question would be appropriate.\n\nConsidering the purpose of the SE software - focus on knowledge (hence the ability to tweak questions and answers after looking at comments, vote, reputation, duplicates, etc) - I think that there shouldn't be a situation where a huge number of questions can easily be asked on two different sites.\n\nInternal competition can be destructive. \"Tribalism is the enemy within\" ;)"}, {"author_name": "Phil", "gravatar_hash": "717b51c0020d2a527975a5ee44026d12", "author_url": null, "date": "Aug 21, 2010", "message": "@txwikinger: If I'm contributing my time as someone who knows how to answer a lot of questions to one of these sites, I expect that time and effort to be treated as valuable. Telling me that a load of questions will be re-asked and re-answered across sites on overlapping topics is quite unappealing. Especially if it means that some instances might get better or worse answers than others. That's exactly the fragmentation problem that the SE network was supposed to solve.\n\nAs I've said once, some questions will need to be visible across multiple sites in the network. When a user starts writing a question to ask, the display of similar questions has to include questions from overlapping sites. Reasonably high-rep users should be able to cross-link a post on other sites in the network, so it actually appears on all of them."}, {"author_name": "Darcy Casselman", "gravatar_hash": "5189d3cf5dde74047db92347ee3cb9c7", "author_url": "http://flyingsquirrel.ca", "date": "Aug 21, 2010", "message": "I voted 'no' to the merger.\n\nI'm an Ubuntu user.  When I google for solutions to technical problems, I'll always stick \"ubuntu\" into the search.  It weeds out all sorts of other extraneous information that's not relevant to solving my problem.  In fact, I usually add \"lucid\" or whatever version I'm using as well, because I don't want grub 1 problems coming up when I'm looking for grub 2 answers.\n\nUsers don't see a bunch of disparate technologies in their Ubuntu desktop (perhaps to the dismay of the people who toiled and sweated over those those technologies).  They see (or should see) a cohesive and complete system.  Expecting them to know how to navigate and contribute to a site for \"advanced users of Linux, FreeBSD and other Un*x-like operating systems\" might be expecting too much.  Having conversed with such advanced users online for years, I don't know if *I*'d feel comfortable."}, {"author_name": "Umang", "gravatar_hash": "e0c49abbf2db17e7a944af4b19d03ce2", "author_url": null, "date": "Aug 22, 2010", "message": "@Darcy: I've got to admit I do that often, even if I'm actually trying to find a solution to problem I'm facing on Debian.\n\nI feel that this is a great opportunity to change that. SO is a living example of how newbie questions and advanced questions can coexist side-by-side, like Miguel said. Given how thorough SO is, I have a very strong feeling that this is going to be /the/ place for Linux question and answers. If all the questions can be in one place, why divide them? If the sites merge, I believe that everyone - newbies and advanced users alike - will find the answers to their questions in one place.\n\nFurther, I imagine the [ubuntu] tag is likely to be popular on the Unix and Linux (if merged). Those with a greater interest in Ubuntu, will probably looking mainly at questions with the [ubuntu] tag.\n\nAnyway, I get the feeling that at least some of those against the merge will eventually (maybe much later) be for a merge, so I'm hoping that SE has an way of efficient merging."}, {"author_name": "Umang", "gravatar_hash": "e0c49abbf2db17e7a944af4b19d03ce2", "author_url": null, "date": "Aug 22, 2010", "message": "^ That should have been \"has an efficient way of merging\"."}, {"author_name": "Denilson", "gravatar_hash": "5048ffde7ab92aeeedf45959f6d13c24", "author_url": "http://my.opera.com/CrazyTerabyte/", "date": "Aug 22, 2010", "message": "My little opinion: I think that there are some questions (and answers) that could (or should) be shown in more than one site. Need an example?\nhttp://superuser.com/questions/179062/bat-cmd-script-run-multiple-instances-of-a-program-dont-wait-for-each-instanc\nIn my opinion, this question is exactly at the middle-ground between StackOverflow and SuperUser.\n\nI bet the same will happen to many Ubuntu and Linux questions (but NOT most of them). If you can find out some way to \"share\" questions between multiple stackexchange sites, it might be a good solution.\n\nAlso, StackOverflow is great because sometimes I have a problem that I need to solve using one language; then I find a nice solution, but for another language, at StackOverflow, and this guides me to the solution of my original problem. In other words, a bigger community is better than many smaller ones, and be careful to not fragment our community too much.\n\n(I still think we should merge Ubuntu and Unix, but add some kind of ability to share questions among multiple sites)"}, {"author_name": "Thomas", "gravatar_hash": "97c95ea681c31add2e2e9404d10c8736", "author_url": null, "date": "Aug 23, 2010", "message": "Why are either of these sites needed?  superuser and serverfault serve the Ubuntu and Linux/Unix support markets just fine.  Splitting the user base and the question namespace just makes finding and offering answers harder for everyone!"}, {"author_name": "Antony", "gravatar_hash": "58330e4e02e049236067a4b7285dc302", "author_url": null, "date": "Aug 23, 2010", "message": "In your argument for merging you say:\n&gt; Stack Overflow didn’t split off into a .NET site, a PHP site, a C# site, a Java site, etc… and we’re better off for the experience.\n\nLooking at it like this Unix / Linux is say Java, while Ubuntu is Eclipse.\n\nWhen using Eclipse there will be things that can be found on Java that is relevant to what you are doing in Eclipse. On the other hand there are things you can do in Eclipse that are not relevant to Net-Beans."}, {"author_name": "txwikinger", "gravatar_hash": "4d2d9514d8c1d2fc1f3f5e16a0d5eb41", "author_url": "http://drupal.txwikinger.me.uk", "date": "Aug 23, 2010", "message": "@umang: To answer your questions above.\n\nAt first, I have to state that I am a little perplexed about this discussion always being lead into the question if \\Ubuntu is deserving\\. I think this is the wrong approach. Nothing here is supposed to be some competition for love or affection. Jealousy and spite don't belong here.\n\nThe way I see it, there have been set clear requirements what kind of commitment/support etc. a certain proposal has to fulfill to go into beta and later into a permanent site. As far as I see this it in the end that the advertisement money obtained by a site pays for the cost (i.e there will be profit) as requirement for stackexchange. In order to get to this you need to have functioning community.\n\nIf you have a particular question that is more broader Linux related, you probably have to things in mind if you decide where to ask the question. \n\n1) Is the expertise to answer this question on the particular site.\n2) Do you feel comfortable to ask the particular question in the particular community.\n\nIf you make positive experiences in how you are approached and interacted with, you are likely to come back. If you feel disrespected, misunderstood or get other negative responses, you probably don't come back. And this is in particular true for a lot of the people that we a aiming to reach on the Ubuntu site. People who are not really interested in Linux as a technology, but people that have taken the courage to move to something unknown for them and are stuck and need help.\n\nThose people do not care about duplication and all the technical mumbo jumbo that is discussed here. Reading through some of the comments here of the proponents of merging, I am not sure if their interest is necessarily this set of community.\n\nI myself, being active on both sites, have asked questions on both sites. I have made the decision where to ask according to where I expected a good result. And so far this has worked very well.\n\nTo your last question about every possible distro starting such a site: Well, isn't that already happening anyway? Doesn't every community have their own fora, their own IRC channels, their own bug tracker.\n\nWouldn't it be far better if we had only one Linux distro, one desktop, one Office suite...\n\nI think we could discuss this for a long time without finding an answer that would be accepted by everyone. And to an extend only future will tell. So far we have two models in the IT world. A proprietary model that tells the user what he gets, and an open model which allows the user to choose what he wants to get. I think, it is amazing how well the Linux community to the biggest extent is able to provide choices that have high quality and even inspire each other and hence create if better solution. Since we can do this with software, I believe we can do this also with support concepts.\n\nLet's have these things play out. If we don't allow some experiments to happen (and area51 is such an experiment), we cannot learn, what works and what does not work. If we always stop trying something new, we never innovate. I believe if we allow things to develop, we will find better solutions than if we just decide by trying to predict the future. \n\nI don't think we have all the answers today. We will find some of them when we try things and reflect."}, {"author_name": "Chris Pall", "gravatar_hash": "7f07010669c0baa7b4ca5198d96fd751", "author_url": null, "date": "Aug 23, 2010", "message": "Phils suggestion makes the most sense of all. Certain questions just belong on multiple sites."}, {"author_name": "Umang", "gravatar_hash": "e0c49abbf2db17e7a944af4b19d03ce2", "author_url": null, "date": "Aug 24, 2010", "message": "@txwikinger: Thank you for you explanation. That post possible contains the first real and justified reason that can be used to defend a vote against merging (I think all previous comments were were vague in countering points made my those for a merge, although I'm pretty bias about this). Now that you've convinced me that there is a valid reason not to merge also, I'm not going to advocate a merge here much more. \n\nJust to clarify one last thing, you said:\n\n&gt; To your last question about every possible distro starting such a site: Well, isn’t that already happening anyway? Doesn’t every community have their own fora, their own IRC channels, their own bug tracker.\n&gt; \n&gt; Wouldn’t it be far better if we had only one Linux distro, one desktop, one Office suite…\nEvery distro has it's own support channels: IRC, forums, etc. However the whole purpose of SE is to be able to reduce duplication and make knowledge and information (via questions and answers) easier to find and use. Therefore, I am not totally convinced by your argument. Secondly, the advantage of not having just one Linux disto is diversity in execution, style, policy, etc. I don't believe that each distro having it's own SE will add diversity to SE.\n\nI'm willing to accept whatever decision the vote will result in, although I would certainly prefer a merge."}, {"author_name": "Ryan", "gravatar_hash": "6f95c8971349908ff04366889830583d", "author_url": null, "date": "Aug 24, 2010", "message": "I think that the best test of whether to merge the two sites may be the empirical one. Look at the questions being asked on each, and ask yourself if the subject matter overlaps sufficiently. Looking at just the front pages of both, I'd say that no, they don't cover largely the same subject matter."}, {"author_name": "Wez", "gravatar_hash": "7cf5cd2dab3b0dc1936dc29fc112e608", "author_url": "http://kbmonkey.wordpress.com/", "date": "Aug 25, 2010", "message": "If my post gets lost in this stream of thoughts, so be it.\n\nUbuntu has a great and ever expanding user base, and the support derived from it. Collective user knowledge is king.\n\nIt's this attitude towards collective knowledge that will enrich the GNU/Linux half.\n\nthe GNU/Linux half will enrich Ubuntu with the technical skills, and applying those skills effectively.\n\nIf both sides embrace learning new things, then both sides will benefit. Effective tagging will separate the Q's from the A's. Simple."}, {"author_name": "Clint Byrum", "gravatar_hash": "92fa12e9d6c3916c06b7f0043da30d0a", "author_url": "http://fewbar.com", "date": "Sep 08, 2010", "message": "Wow, great points all around.\n\nAs somebody who works on Ubuntu every day (as an employee of Canonical), I am extremely biased.\n\nMy feeling is that what sets Ubuntu apart from the rest of Linux is a narrow focus. Ubuntu does provide access to the bulk of Debian through the universe software archive. But it keeps the default install and focus of Software Center for desktop users down to the apps that work for most users.\n\nIts this narrow focus that has lowered the intimidation factor and raised the quality of user experience. This is appealing to technical users as well, as making decisions is not something any of us want to do until we absolutely have to.\n\nSo while Ubuntu builds on Linux, and Linux improves because of Ubuntu's success, I think for users and supporters, they are quite different things, and should be separate stack exchanges."}, {"author_name": "stefan", "gravatar_hash": "417801ff3c933dd0a42b05bce7c11a9c", "author_url": null, "date": "Oct 22, 2011", "message": "The question is not whether Unix and Ubuntu should be on one site separated by tags, but why there is more then one site overall, called e.g. \"Q&amp;A\"? If you can answer this question, then you have the same answer for Unix &amp; Ubuntu..."}, {"author_name": "Ramesh Jha", "gravatar_hash": "ccbe1748ac7838f3ff58debb473d3ee6", "author_url": "http://blog.sudobits.com", "date": "Oct 29, 2011", "message": "Ubuntu is far easier as well as better for a Desktop user (including geeks and non technical users), in fact it's more Fun."}]}