{"response": [{"author_name": "djeidot", "gravatar_hash": "3604ace72c84b9daa2df60fec03a760a", "author_url": "http://jotalog.blogspot,com", "date": "Nov 19, 2009", "message": "Don't use GOTO. GOTO is evil."}, {"author_name": "Konstantinos", "gravatar_hash": "abe006dc565c07bf484f7138a260c09c", "author_url": "http://www.codesennin.com", "date": "Nov 19, 2009", "message": "I really had a laugh about the work environment transition. \n\nKeep it up guys :)"}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Nov 19, 2009", "message": "GOTO is a four letter word :P (referring to \"4. GOTO 1\""}, {"author_name": "Practicality", "gravatar_hash": "6d81d6dc131240aff73b92c2777f1737", "author_url": null, "date": "Nov 19, 2009", "message": "What's a CV?"}, {"author_name": "Rob Thijssen", "gravatar_hash": "995c83001ff61cbb0041c081ebac9098", "author_url": "http://thegrenade.blogspot.com/", "date": "Nov 19, 2009", "message": "Yes, I too am excited by my imminent Evel Knievel transformation."}, {"author_name": "matt b", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Nov 19, 2009", "message": "When can we start getting a peek at what things look like from the employer side? \n\nAnd start seeing some more of these stats?\n\nI'd love to be able to see, at some level, what the employers are actually searching for - or perhaps also, of the 189 searches so far, what percentage of CVs were results in these searches.\n\n(In other words, I'd be curious to see if employers are typically searching for Ruby developers vs Java developers vs C#, as an example)"}, {"author_name": "Randolpho", "gravatar_hash": "09117ac8e2599741ee9191777848b598", "author_url": "http://geekswithblogs.net/LessonsLearned", "date": "Nov 19, 2009", "message": "@Practicality: Check out the wikiality on the subject:\n\nhttp://en.wikipedia.org/wiki/CV\n\ntl;dr: It's like a resume."}, {"author_name": "Randolpho", "gravatar_hash": "09117ac8e2599741ee9191777848b598", "author_url": "http://geekswithblogs.net/LessonsLearned", "date": "Nov 19, 2009", "message": "I'd also like to second Matt b's suggestion. Both so I can forward the info to my hiring managers, and out of curiosity as an employee."}, {"author_name": "Randolpho", "gravatar_hash": "09117ac8e2599741ee9191777848b598", "author_url": "http://geekswithblogs.net/LessonsLearned", "date": "Nov 19, 2009", "message": "Finally: I fixed your list for you to not use GOTO, using a c-style pseudo-code. Instead, I give you all-powerful recursion!\n\n    void WhatWeLikeToDo()\n    {\n       BuildOutSomeMoreFeatures();\n       LetAFewPeopleExperienceThoseFeatures();\n       GatherDetailedFeedback();\n       WhatWeLikeToDo();\n    }\n\nNote the lack of an exit strategy, just like your GOTO list. :)"}, {"author_name": "Mark Roddy", "gravatar_hash": "ac25b3f7bf1399399a6ad4cefea84bc6", "author_url": null, "date": "Nov 19, 2009", "message": "@mattb Agreed. For all we know no employers are gonna jump on at all, or as you highlighted, no employers in my area of expertise will be participating.  \n\nI'm not surprised Joel/Jeff were able to build a large community on stackoverflow as the already had a large developer audience they could pool.  However, I'm not convinced as of yet their voices reach the people who would use the hiring side of the jobs service.  Prove me wrong and I'll sign up.  Till then I'll be on the sidelines watching."}, {"author_name": "anonymous coward", "gravatar_hash": "ffbf4e85b8ffbae4e9039b9c0cf07bc8", "author_url": null, "date": "Nov 19, 2009", "message": "Is careers a place where a developer might find some moonlighting jobs? I'm guessing that would run counter to Joel's philosophy and the whole *careers* theme. \n\nI love my day job, so I haven't been too interested in the site. But if there were temporary positions available too, I'd be quite intrigued."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Nov 19, 2009", "message": "More pimping of the \"modest\" fee.  If you really want to convince us that your employers are worth forking up dollars for, explain to us what you do to screen them and how else you vet them.  But, I suspect it will be just like any other job market out there - people pay to get access to the other side.  Middlemen - you're middle-men.  Just what the internets has traditionally been great at tossing overboard.\n\nIt is hard not to feel like some slab of meat at a meat market - but this time the cows also have to pay money to be listed at the auction.  How nice."}, {"author_name": "M", "gravatar_hash": "903d1f6eb1dc53cc0810d9fcec0f3b8a", "author_url": null, "date": "Nov 19, 2009", "message": "\nFirstly, I agree with Tim's sentiment. I don't really see what problem your fixing here. Are candidates really wasting good potential employers time? Is it not the other way around? It'd be nice to know what you're doing to vet potential employers - joel's model of charging employers (who can afford it afterall!!!) linked in with your stackoverflow cred seems like a good model to me.\n\nSecondly and respectfully, I appreciate that you guys have to eat/live/enjoy life. I certainly get the impression that you guys are doing well out of this venture on the podcast (how many full time employees have you got working on stackoverflow now?). \nHowever, I think you're biting the hand that feeds you by turning the site into being about money. \n\nYou're making money out of advertising to the community.  You're monetising the Amazon links that the community created and organised into the correct context. But now you're asking the community to pay for the privilege to interact with what will no doubt be a kick ass careers site - but its the community that is making all that money for you in the first place!\n\nI don't care if you're making money off any Amazon links I've posted, organised or placed into a certain context on the site. But, I start to resent it when I view through the frame of StackOverflow being about taking money directly from the community for the careers section.\n\nCouple of ideas for you too dismiss, that might give back to the community.\n\n1. Tell us you need that money.\n2. Don't charge the community for the careers section.\n3. If you're going to charge the community for the careers section; offer money back to the users who posted good Amazon links (don't do this - it still makes the site about money and then you get into edit wars).\n4. If you're going to charge; model it on radiohead (pay what you think its worth/what you can afford).\n5. If you're going to charge; make it free for unemployed developers (appreciate you've already made it free for students).\n"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 19, 2009", "message": "M, your questions are answered here:\n\nhttp://careers.stackoverflow.com/faq\n\nTim, see this response:\n\nhttp://meta.stackoverflow.com/questions/25275/will-agents-be-allowed-to-use-careers/25694#25694"}, {"author_name": "Shannon Nelson", "gravatar_hash": "9baa8c3d02a2df0033edbe3d27cb1ebc", "author_url": null, "date": "Nov 19, 2009", "message": "Hmmm - you think we should head for careers with Evel Knievel's success in mind?  Let's see, how many crashes and broken bones did he have in his career?  Please, let's be careful with those analogies :-)."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Nov 19, 2009", "message": "Jeff, \nthat does NOT answer my question.  Joel's answer there talks about recruiters.  Your marketing propaganda talks about how great the EMPLOYERS are.  I want to see how you are going to convince us the actual EMPLOYERS are worth us forking over $100.  YOU guys made the claims, not us.  Again, your system sounds nice, but any schlub who needs a job can just as easily fork over $99 and any POS company can pay your buyer side fees.  Neither barrier gets us any closer to your nirvana of making matches made in heaven.  (Though it does wonders for SO's revenue)\n\n\nSo, again, what are you doing to vet the companies so that WE, the job seekers are getting our value?  How do we know these companies aren't just hack shops and sweat shops?  You are selling us as \"pre-qualified\"(using VERY questionable logic by the way) - what are you doing for us in relation to the other side of the equation?  \n\nThe users of SO are not stupid.  Please don't treat us that way."}, {"author_name": "Randolpho", "gravatar_hash": "09117ac8e2599741ee9191777848b598", "author_url": "http://geekswithblogs.net/LessonsLearned", "date": "Nov 20, 2009", "message": "@tim: \n\nLet me give you some of my reasons for forking over my 30 bucks. Perhaps that will help you reach or own decision. \n\nLet's start with the fact that 30 bucks isn't that expensive. Hell, I can drop more just taking the family out for dinner. So the three year 30 dollar offer appealed in the same way a one-dollar game on the iPhone appealed. If I like it, I got a great deal. If not, I'm not out that much.\n\nFrankly, looking for a new job sucks. I mean, it's really bad, and it's been getting worse for years. The chief problems are, as Joel calls it in the post Jeff linked, contingency recruiters. Folks who drown out the jobs in a sea of \"need developer who can program\" job descriptions that tell job seekers nothing. Dice and Monster aren't working; there has to be a better way. LinkedIn is better, but not by much. \n\nSo I *want* careers.stackoverflow.com to work. Badly. And I'm willing to do my part to help, the same way I was willing to do my part to help make Stack Overflow work out; I was fed up with stupid Experts Exchange and along comes this hot new thing that looks kinda promising. Let's see if it'll work. \n\nAnd Stack Overflow worked better than I could possibly imagine. So I thought: \n\nLet's see how careers.stackoverflow.com thing will work out. Jeff, Joel, here's my seed money contribution. Make finding a good job easy, please."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Nov 20, 2009", "message": "@Randolpho\n\nUm, I am not looking for help about making a decision, especially from other SO users or the countless Joel and Jeff fans who accept anything they say as gospel.  \n\nMy specific question was to Jeff - to better elaborate on how his cartoon example of getting rid of employers who suck to only hooking up with employers who are so cool that they are like a 70's motorcycle egomaniac with no fear of death or broken bones.  (I presume that means we want to be Evil).  \n\nIn their slick campaign they seem to skip some really key points - like how the willingness to part with $30 or $100 makes one a standout candidate rather than \n\n1.  willing to roll the dice to join every venture Joel and Jeff have (as you suggest) or; \n\n2. Desperate enough to fork over money to get access to employers.  \n\nIn addition, Jeff tried to answer the question about how they vet employers by addressing a question I did not ask - how they keep out scumbag recruiters.  \n\nThey imply or state outright (I have to go check at all their postings, bloggings and podcasts) that they will have high quality employers.  Bah.  I have a bridge to sell you if you believe that.  There is nothing inherent about their plans that does that that I can see.  (Or at least they haven't explained it in a way that is understandable by someone with my pea-brain)  They promise great matches, but all they are doing to make that happen is charging fees.  Crappy companies and crappy candidates can all come up with the SAME money that the great or mediocre ones spend."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Nov 20, 2009", "message": "Don't get me wrong, I'd love to see a great job board or hookup site on the internets.  (God knows we need more hookup sites on the internet.)  I just don't see it yet.\n\nJoel and Jeff have shown they can execute and create value.  It still is a BIG question whether there is any value in plunking down (for either side).  \n\nJoel has also argued against concepts like this in the past.  He clearly states he believes real great programmers have no need for job boards or recruiters.  They are in a magical state of constant employment\n\nSo he is playing two sides of the coin here it seems.  Are we great programmers who have no need for services like this, or are we his captive audience that can be milked and monetized?"}, {"author_name": "Jeff", "gravatar_hash": "62644b26e9eedfdf135e07b0cadc8b25", "author_url": null, "date": "Nov 20, 2009", "message": "@Tim completely agree. And neither Jeff nor Joel (been able  / willing to ) answering these critical question even throws more doubt into this whole thing."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 21, 2009", "message": "Tim, if you don't think the service meets your needs, don't use it."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Nov 21, 2009", "message": "Jeff, Fair enough - I was just hoping for something better.  Hoping that perhaps you'd see the light and figure out a better way than charging the applicants - because if that truly is a significant part of the revenue compared to the other side, then the model is broken.  \n\nI now understand that you are not vetting the employers other than:\n\n- taking money\n- requiring a company name\n\nthat is a long way off from what my initial expectation of phrases like these:\n\n\"...of matching professional programmers with the type of employers who understand the true value of programmers who hit the high notes...\"\n\nI see now that when you say \"understand the true value of programmers...\" you mean literally they are willing to pay big bucks.  To you.  Not that they REALLY understand the true value of programmers and treat them well enough to discern in some way other than writing a check.  They will still have evil HR, shitty cubes, 3 year old PCs with ancient CRT monitors, etc.\n\nI see.  I was interpreting it all a little differently."}, {"author_name": "Dan Monceaux", "gravatar_hash": "b7143836993b597ac8b0e0ae152e69c3", "author_url": "http://www.danimations.com.au", "date": "Nov 23, 2009", "message": "Just wanted to say thanks for giving my pixel art top-billing on this blog post! You can see more of my work at my website. Good luck with your web venture!"}, {"author_name": "Jeff", "gravatar_hash": "62644b26e9eedfdf135e07b0cadc8b25", "author_url": null, "date": "Nov 23, 2009", "message": "ignoring your critics and most of all not even trying to answer to some valid points is the first step to failure. As everybody knows: not the blog post, but comments are the most read things on a blog.\n\nOh well, really a pitty, because there is a lot of room for improvement in the jobmarket for sure."}, {"author_name": "Mike Sickler", "gravatar_hash": "69739fc4bc58863ff835f4e929694342", "author_url": null, "date": "Nov 23, 2009", "message": "@Haters :) \n\nI think the idea for both sides is that SO is marketing to companies, and to job seekers, who value quality over quantity. \n\nSo, let's say you have a small pool of programmers registered with their CVs, say 10,000 people. Now, that's a paltry number compared to Monster or Dice. However, Joel and Jeff would say that these 10,000 StackOverflow users are kind of a select bunch, who care about honing their skills, etc. \n\nBut a company doesn't have to take Jeff's or Joel's word for it- they can look at any of these candidates' histories on StackOverflow to see just what kind of programmers they are. \n\nIn my mind, a forward-thinking company that values this kind of thing, and chooses StackOverflow over Monster or Dice, is already 'vetted'. Beyond that, I don't know what you expect Jeff/Joel to do to vet employers. \n\nBut why do you even care? Are you really concerned about getting swarmed by employers wanting to interview you?  Who do you think you are, John Skeet? You know we're in a recession, right?"}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Nov 23, 2009", "message": "@Mike, Um, it doesn't take a rocket scientist to figure out that there will only be a slight lag to rush to the new pool of job applicants.  Only for a short time (and even that argument is tenuous) will only the good employers be the only ones.  Once everyone else finds the resource they will also pull out their checkbooks thinking they can hire the supposed superstars.\n\nUm, I don't think I'm jon skeet, and frankly I don't want to be jon skeet.  Who cares about the recession - is that your answer for telling people they should suck it up and live with a shitty job as well?  \n\nI'm not looking right now - I am too busy working on a new venture.  Once again for those who don't seem to be able to think for themselves : I was merely looking for answers to justify the business model of charging a significant fee (in spite of Jeff's hand waving about \"modest\") and to ask for more details about how they plan to bring the nirvana-like \"matches\" that they have gotten so giddy about.  \n\nAs another user posted a while back - Jeff and Joel have \"punted\" on the solution to a problem that is their problem - not ours - that is - how to justify the high cost to the employer side - specifically how to show that we are \"Serious\" about job seeking.  \n\nNever mind that all it takes is an automated email from the employer to gauge the interest.  A quick response (or lack of response) will solve that problem.  Jeff and Joel seem to think that it is easier to charge $100 to the candidates rather than have the employer write an email script, or, gasp, send an email manually to ask a candidate if they are interested.  Oh the horror.  How difficult is that?  \n\nI wouldn't be asking jeff and joel to vet the employers, except they have claimed that these employers represent the better companies - I want proof of that.  Again, THEY made the claim, I did not.  THEY want me to fork over money  - and don't seem to be willing to justify it other than saying that if I don't do it now then the price will go up (a tactic used by shady salesmen to put pressure on people to make decisions quickly).  \n\nYour 10,000 developer number gives a revenue for jeff and joel of about $290k.  That's some serious cash even in NYC, for what should be the smaller side of the equation.  Do you really think that is justified?  You don't think there there should be anything else offered for your $29 or $100? \n\nI sincerely hope that is not a realistic number - I would hope that more users than not have some sense to question the value of the $29 before just giving up/giving in and saying \"oh well, it's only a burger and a few drinks at TGI Fridays, they seem trustworthy and everything else they did was great.\"\n\nAre jeff and joel shutting down the other job posting sites on SO and on JOS?  \n\nDo you really think the that the only way/best way to winnow out the \"serious\" and best job seekers form the rest is $29 or $100?  There are many indications that this is just nonsense.  Not the least of which are people who HAVE ALREADY publicly stated that they did it just to get the \"low one-time offer\".  That sounds like it already broke the premise that all searchable users are \"prequalified\" and ready for action.  I can also imagine that there will a bunch of tire kickers regardless of the money spent on the \"job seeker\" side.  \n\nGiven that I have seen no discussion of these issues from them or acknowledgment that they had other ways to solve the problem of \"serious\" job seekers, I have little choice but to question the whole concept.\n\nBut, maybe the bottom line is that I am a cheapskate.  I mean, really, who the F%$$%#$ charges the job seekers for leads?  The answer I always come up with is \"scumbags\".  Now, I don't think those two fall into that category - in fact I would argue that they don't, but their business model here is the same as those sleazebags who try to charge unsuspecting parents to be agents for their cute kids' modeling careers."}, {"author_name": "Randolpho", "gravatar_hash": "09117ac8e2599741ee9191777848b598", "author_url": "http://geekswithblogs.net/LessonsLearned", "date": "Nov 23, 2009", "message": "@tim wrote:\n\"I wouldn’t be asking jeff and joel to vet the employers, except they have claimed that these employers represent the better companies – I want proof of that. \"\n\nAt the moment, there are 17 employers in the beta. How can they possibly provide the proof you desire? This is hope, plain and simple. They hope that they'll be able to build a better job site, and they're asking folks for a beta buy-in to finance that hope, plain and simple. \n\nI can understand your fear; ladders.com is certainly damning evidence that charging job seekers is risky. So feel free to wait and see. \n\nBut you're not going to get the proof you require up front, because it can't possibly exist. This is uncharted territory."}, {"author_name": "Kevin Connolly", "gravatar_hash": "30d5456d1b71664feb5cda0233bf0d0d", "author_url": "http://www.kconnolly.net", "date": "Nov 23, 2009", "message": "Funny, I remember hearing that from the good people over at DivX as well. Around version 3 or 4... DivX will always be free!  \n\nThen came version 5..."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Nov 24, 2009", "message": "I think it's good that you all are excited and all of that but my question, that I doubt will be answered, is how can you all have this Careers section without being completely and utterly cynical? This is because it is the stated position that if you have ever had to apply for a job (other than as an intern at a Fortune 100 while a sophomore or junior) then you are probably a loser that can't program anyway, certainly not one that hits any \"high notes\" or is top talent. I think that's a fine position but I think it seems kind of mean spirited to play the community so cynically."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Nov 24, 2009", "message": "@Mike Sickler\nThe trouble is that if there are 10,000 awesome developers on SO.\n10% are looking for work\n10% of those have the skill set you want\n10% of those are in the right city/country\n\nYou end up with it only being worthwhile an employer looking if they are a Java/C# shop in NY.\nFor candidates/employers outside these major markets it's not worth it. But if you have a million candidates then it becomes Monster/Dice.\n\nNot sure there is a solution - but for $30 I'll chip in."}]}