{"response": [{"author_name": "Matthieu", "gravatar_hash": "9f6a3534bda97857b7cc67b5fe151376", "author_url": "http://virtew.com", "date": "Nov 05, 2009", "message": "Interesting, I saw the sponsored tags like the flex one (http://stackoverflow.com/questions/tagged/flex). It's a \"success\" in your journey for sustainable ad revenues  ?"}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Nov 05, 2009", "message": "Strange... how does PlentyOfFish.com earn money from AdSense? They do have AdSense, right?"}, {"author_name": "Robert", "gravatar_hash": "d538b5badf6dcba95f7b60a511104440", "author_url": "http://cubeantics.com", "date": "Nov 05, 2009", "message": "I like the idea of SO getting credit for all amazon links.  It's not flashy and after hearing the idea it seems wasteful not to do it.\n\nThe more time I invest in Stack Overflow the more awesome I want it to be.  Everyone reading this is vested in the success of SO and I'm definitely for anything you guys can do that results in hiring more programmers."}, {"author_name": "Royce Thigpen", "gravatar_hash": "431d7155f7def1c129d10ab8be49bd6c", "author_url": "http://www.winterwar.org", "date": "Nov 05, 2009", "message": "I think the failure of the advertising isn't so much with the advertising as it is with the target of your advertising.  While yes, it is great to think that folks going to StackOverflow would also want to buy books on the material they're looking for help on, the fact that so much of the current knowledge in those books is freely available on the internet in the form of blogs and sites just like this one makes it very similar to trying to sell snow to Eskimos. It's readily available, and therefore not really a \"need\" of your target audience.\n\nI guess the trick to making advertising work on a site like this is to target things that your audience really needs and yet does not have freely available.  I don't think you should look at it as a failure, but more like a marketing experiment.  It's obvious that your users don't want to buy books, but what do they want to buy?  There's the trick."}, {"author_name": "Miff", "gravatar_hash": "19da349ae3a7835f7bef46906f7f4cb1", "author_url": "http://miff.furopolis.org/", "date": "Nov 05, 2009", "message": "Maybe the advertising fails because developers are the kind of people who would know to use AdBlock Plus.\n\nIf you ran ads on SuperUser (which has a lower barrier of entry), you'd likely see better results.\n\nAlso, running a third-party advertising system is downright irresponsible.  Most third-party advertising would contain malicious JavaScript, and if people discovered there was malware on SO, your usage rate would drop quickly.\n\nRunning just plain text ads and unobtrusive JPGs would help keep your site responsible then the masses of advertising running all over the place these days.\n\nAlso, have you considered accepting donations?  I'm sure there are some people in the SO community who would gladly pay to keep the site still pristine, friendly, and free of obstructive ads."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Nov 05, 2009", "message": "Royce,\n\nAfter viewing some Douglas Crockford lectures online, and then buying and reading TGP, I agree.  However, it is a good book (in my top 5 for sure) and I dont mind supporting the cause.  Much like, no matter how bad the next Wu-Tang Clan cd sucks, I'm still gonna buy it to support them."}, {"author_name": "Peter Cooper", "gravatar_hash": "6268c7528d855f1cef5696a00d159909", "author_url": "https://twitter.com/peterc", "date": "Nov 05, 2009", "message": "<em>how does anyone make a decent living with AdSense? Seriously, how?</em>\n\nI've earned serious money with Adsense in the past (up to almost $10k a month in 2008) and also run developer sites. The answer is.. developers are not a good audience for Adsense!\n\nOther audiences are great Adsense audiences, but developers are not. I've had &gt; 20% CTR on Adsense no problems with very solid $20+ eCPMs.. but whenever I've tried it on developer sites it totally bombs with 0.1% CTR or whatever. Developers just don't click on Adsense ads. This isn't a disadvantage to Adsense, however, but a disadvantage to having developers being 99% of your audience ;-)"}, {"author_name": "Peter Cooper", "gravatar_hash": "6268c7528d855f1cef5696a00d159909", "author_url": "https://twitter.com/peterc", "date": "Nov 05, 2009", "message": "Separately, I'd love to have the ability to pay for self service PPC (or even CPM) advertising on Stack Overflow. It's worth considering. Just not with Adsense.. but perhaps a more \"The Deck\" style affair with a small graphic plus text."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": "http://softhardsoft.com", "date": "Nov 05, 2009", "message": "What about when people put their own tag on an Amazon link? They are contributing information, helping out SO, advertising for Amazon, and have the reasonable expectation that those specific links might generate revenue for them. Shouldn't those already tagged links be left alone? The idea of high-jacking those links that are already tagged feels dirty."}, {"author_name": "Mike Woodhouse", "gravatar_hash": "5978e2ed3a31f1bd2361dbb919d92012", "author_url": "http://grumpyop/wordpress.com", "date": "Nov 05, 2009", "message": "Can't see a problem with the Amazafiliate thing, although I wonder what happens if an answer already has someone else's affiliate in the link?\n\nAny chance you could do something really useful? Like switch the link to point at amazon.co.uk for UK users? It's so frickin' tiresome when I click a link and have to manually amend the URL to co.uk (with probable loss of affiliate info into the bargain). Just a thought. Probably belongs on meta, come to think."}, {"author_name": "chakrit", "gravatar_hash": "104c34a4803355ade79413372205138a", "author_url": "http://chakrit.net", "date": "Nov 05, 2009", "message": "+1 for \"The Deck\" style affair recommed by Peter Cooper above."}, {"author_name": "Mike Woodhouse", "gravatar_hash": "5978e2ed3a31f1bd2361dbb919d92012", "author_url": "http://grumpyop/wordpress.com", "date": "Nov 05, 2009", "message": "Well I just checked, and I now see that amazon.com appears to be, either from my IP or from some cookie from the last time I logged in there, offering to switch me to the UK site. I wonder if affiliate info comes with it?"}, {"author_name": "Portman Wills", "gravatar_hash": "8d1b72efe7ffa105425d8c7325be747c", "author_url": "http://www.portmanwills.com", "date": "Nov 05, 2009", "message": "@Andrei: You can make lots of money with *specific topics* on AdSense. Dating, personal injury law, asbestos. Dating in particular has high CPMs and lots of advertisers competing for the same inventory.\n\n@Royce: you're exactly right. I personally LOVE dead tree books, but clearly the average programmer does not. Would love to hear your suggestions on what you think the StackOverflow audience would like to purchase.\n\n@Mike: we use a free geolocation database and redirect to the appropriate Amazon URL for your country. Try this link, and if you're not redirected to Amazon.co.uk, leave a comment: http://rads.stackoverflow.com/amzn/click/0262510871"}, {"author_name": "Portman Wills", "gravatar_hash": "8d1b72efe7ffa105425d8c7325be747c", "author_url": "http://www.portmanwills.com", "date": "Nov 05, 2009", "message": "@Mike: our comments crossed streams! This isn't Amazon that does the IP detection, it's us. That's why we use rads.stackoverflow.com links. And yes, the affiliate account should carry through."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Nov 05, 2009", "message": "@Portman\nThe specific ads seemed to be the problem on SO, and on Jeff and Eric's site. They are too specific, I am a developer so they run ads for a version control tool or an IDE plugin, very specific but things I am unlikely to buy everyday.\nSince I am a developer I am overpaid and like shiny toys, why aren't the ads for cars, TVs, cameras etc?"}, {"author_name": "Kev", "gravatar_hash": "a9840656ceee0faa528806c4c04a9399", "author_url": "http://blog.zygonia.net", "date": "Nov 05, 2009", "message": "Fascinating stuff, nice to have your experiences/experiments with raising revenue from advertising written up like this. I've been asked about doing revenue generation from ads in the past but never really known how best to approach the problem. There's some good nuggets here."}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Nov 05, 2009", "message": "The reason that the Amazon links in the answers work is because they typically fulfill a need.  They answer someone's question.  They are also a personal recommendation from the SO user.\n\nI think the suggestion to localise the Amazon links is a good one.  Even though Amazon.com detects when a user is visting from the UK, I'm pretty sure that the Amazon.com affiliate doesn't get any commission if that visitor then goes to buy the product from the UK store (you need to have a separate affiliate ID for each store).\n\nI've implemented a very rudimentary form of Amazon localisation on my blog.  Previously I only had Amazon UK links but 50% of my traffic was from the US.  Because I couldn't really do the localisation server-side because I don't rebuild the page for each visitor (due to Wordpress caching).  Instead I have some JavaScript that attempts to determine where in the world the visitor is and rewrites the links as required.  Surprisingly you can't get locale info in JavaScript so I use the timezone offset as a very rough guess (if it's UTC or UTC+1, I assume UK, otherwise all the links get sent to Amazon.com).  Seems to work reasonably well."}, {"author_name": "Mark Roddy", "gravatar_hash": "ac25b3f7bf1399399a6ad4cefea84bc6", "author_url": null, "date": "Nov 05, 2009", "message": "This probably shouldn't be surprising.  On several of the early stackoverflow podcasts Jeff and Joel discussed about the decline of programming books as a source of information due to its presence on the web being a motivation for stackoverflow in the purpose.  Given this it probably shouldn't be surprising that a website started due to books falling out of vogue is not able to make money advertising for a retailer known largely for selling books.\n\nAdditionally, I thought the experience of these ads was pretty bad.  I can't speak for other tags, but python questions seemed to always be littered with ads for Search for the Holy Grail dvds."}, {"author_name": "Ortzinator", "gravatar_hash": "44770e6f2075241a21ab855de6838108", "author_url": "http://blog.ortz.org", "date": "Nov 05, 2009", "message": "Unfortunately, due to crappy lawmaking, Amazon is no longer an option for me.\n\nhttp://online.wsj.com/article/SB124603593605261787.html"}, {"author_name": "paul", "gravatar_hash": "b7dd233d418287abcf7b507919743aef", "author_url": "http://www.paulmignard.com", "date": "Nov 05, 2009", "message": "It's funny, when I see an ad for a book I think \"Eh, all I need to know is the internet, I'm not going to waste my money.\"\n\nBut show me a USB rocket launcher or a shirt with some obscure nerd reference and I'm clicking on that in a hurry..."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Nov 05, 2009", "message": "@Mark keyword ad matches can be worse than that.\nAnother blog I read apologized that this weeks column was short because his mother had just died - naturally the comments were full of condolence messages and so the ad servers filled the entire page with mother's day gifts."}, {"author_name": "Beau", "gravatar_hash": "9c1335f01fab59789f2bd9516551e119", "author_url": null, "date": "Nov 05, 2009", "message": "I sure hope these links get localised (EG to amazon.co.uk if you're viewing the page in the UK, amazon.fr if it's from France); or does amazon.com do it already?\n\nThat'd be my only issue with the service.\n\nGood show guys!"}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Nov 05, 2009", "message": "- If SO is offering all your programming answers, why would the developer click on a programming book ad?\nPersonally my eyes are trained to skip over any ad and I use AdBlock Plus. Developers in general are trained to use computers to their advantage. I think we are not good audience for ads. Plus we are good in getting information online.\n\n- I also wonder how your single text only ad is paying the salaries for 3 full time developers + hardware and hosting fees expenses. If that little ad + jobs ads are doing it, that's not too shabby."}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Nov 05, 2009", "message": "It seems the Amazon links are localised now.  I'm sure I clicked on one the other day and it took me to Amazon.com."}, {"author_name": "Colin", "gravatar_hash": "630b9532383842a6526256be60fa8f1f", "author_url": null, "date": "Nov 05, 2009", "message": "For me personally it is just an aversion of clicking ANY link that looks or even feels remotely \"sponsored\". \nMy guess to why adding your affiliate code to any amazon links found in answers? Because I think most people who, like us SO users, spend a lot of time online, have developed an aversion of \"sponsored\" links, even though they are hosted on a known and trusted site. \n\nA link to a resource in an answer to a question could kinda be described as feeling \"safer\" and seeing that another programmer has found it useful enough for him / her to include it in answer is basically an \"upvote\" for that book.\n\nAnything remotely resembling an ad has to be REALLY, REALLY up my alley for me to go ahead and I click on it."}, {"author_name": "Morten", "gravatar_hash": "47af7ccc79b304ab712dc1389ad1b37c", "author_url": "http://ibidem.homeip.net", "date": "Nov 05, 2009", "message": "@Portman: When there's no amazon site in my country, where am I supposed to end up?\n\nI'm from Norway, but clicking the link sent me to amazon.com. It makes more sense for me to order from amazon.co.uk."}, {"author_name": "Portman Wills", "gravatar_hash": "8d1b72efe7ffa105425d8c7325be747c", "author_url": "http://www.portmanwills.com", "date": "Nov 05, 2009", "message": "@Morten: That's a good point; I'll make that change later tonight."}, {"author_name": "d03boy", "gravatar_hash": "f22989906d98bcccf76f16fcf33d7c08", "author_url": "http://codertips.com", "date": "Nov 05, 2009", "message": "It's a simple issue of trust. If you haven't read the book then why are you advertising it to me? You advertising it isn't going to make me believe that you're actually supporting it. I'm smarter than that. \n\nA flashy image isn't going to explain to me if it's the right book for me. I'll need a book review by someone I can relate to.\n\nIf you want to sell me something then I'll need to trust you first (or it should be really cheap). I have no problems using your affiliate link for a recommended product but my future judgment of you will rely on the quality of that recommendation."}, {"author_name": "Roger Barnes", "gravatar_hash": "dd6c985d22e3bf6ea849e8d2e6750d76", "author_url": "http://photographr.info", "date": "Nov 05, 2009", "message": "I'm very interested in this, as I'm a stackexchange site opeator ( http://photographr.info , dear shutterbugs).  I wonder if there's a clear reason _why_ this didn't work.  I have a couple of theories...\n\n1. sidebar ads suck compared to inline text links - this is a commonly reported observation with amazon ads\n2. not really well targetted part I - the inline text links probably work better because they're extremely relevant and recommended by a human.\n3. not really well targetted part II - The sidebar ads might, by showing the \"best\" books, suffer by trying to promote books that people already have or know about.  Perhaps the newest books should be showing up there to encourage curious readers.  Even if they don't buy that one, you've a better chance that they'll buy something by getting them to click on something that piques their curiosity."}, {"author_name": "fneep", "gravatar_hash": "706741398babfd77c96e124603cea239", "author_url": "http://fneep.fiffa.net", "date": "Nov 06, 2009", "message": "Out of interest, have you had a look at Project Wonderful? http://www.projectwonderful.com/\n\nA site I frequent recently changed to them and they seemed rather good, though I do recognise that the high traffic/multitopic nature of Stack Overflow may require a little trial and error in terms of advertising."}, {"author_name": "John MacIntyre", "gravatar_hash": "31f9c461f411969e33ca6bd13b536360", "author_url": "http://www.twitter.com/johnmacintyre", "date": "Nov 06, 2009", "message": "What if you just got a large company to 'sponsor' by paying by CPM instead of CPC?  \n\nI don't think programmers click through ads too much unless it's really compelling.  And I don't think there are that many products that are that compelling to many of us.  We have a relatively small tool set."}, {"author_name": "Frank", "gravatar_hash": "3eef89c1710742937cc74bf88da9dff8", "author_url": null, "date": "Nov 06, 2009", "message": "I still think you're doing an injustice by ignoring what Calacanis said on your podcast:\n\nYou should allow for user-submitted ads. Have simple rates (ad up on 1% of requests = $100 per week, 10% = $1,000, tag-specific = $100/tag/week). (or make it a auction like the Goog)\n\nLet anyone submit ad HTML. Then have a simple moderation UI that allows you to choose which ads actually get posted (and therefore billed.)\n\nI love this idea because it would give someone like *me* who writes lots of little programmer tools an avenue to sell and promote those tools. It would benefit *you* because you just sit back and collect ad revenue for the small price of moderating ads.\n\nIt's a win win and you can still control the quality of the ads..."}, {"author_name": "Nick", "gravatar_hash": "44522fc90c3828034bf947f635fff4ce", "author_url": null, "date": "Nov 06, 2009", "message": "@Frank.. I think that's an awesome idea."}, {"author_name": "InSciTek Jeff", "gravatar_hash": "3c7db1077ce759e22c54d235054182dc", "author_url": null, "date": "Nov 07, 2009", "message": "@Frank - I upvote the Calacanis suggestion too."}, {"author_name": "Jonik", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Nov 07, 2009", "message": "Morten: \"I’m from Norway, but clicking the link sent me to amazon.com. It makes more sense for me to order from amazon.co.uk.\"\n\nActually, amazon.com might make more sense. At least it does for me (in Finland): 1) delivery is fast enough, like 1-2 weeks 2) it has larger selection than the UK store 3) typically it's considerably cheaper (to some extent, but not exclusively, due to weak USD). (I've ordered numerous times from both amazon.com and amazon.co.uk.)\n\nSo, I for one strongly prefer Amazon links taking me to amazon.com.\n\n--\n\nOther than that, nice to hear this works better for you. I like the fact that those huge book polls on SO might be turning into revenue generators for you guys, even if Jeff has described such polls as \"basically failed questions\", if I recall correctly. :-)"}, {"author_name": "Paul", "gravatar_hash": "fc3225dc3119500fcbf7af646a83c914", "author_url": null, "date": "Nov 09, 2009", "message": "Ads don't work for me unless they are serving a need I have. I don't develop hardcore in C#, I don't need a version control system, I don't need a bug-tracking system, I don't do web development. I buy things because I need to *do* something. I had  a bit of an argument with Alex P about this on meta.stackoverflow.com. Ads degrade my life experience. Products enhance it. I want to do things and go places that enhance my life experience. If an ad doesn't hit me at exactly the right time to fulfill a desire I have....then I skip it. I'd venture to say this applies to other people as well."}, {"author_name": "Ryan Cook", "gravatar_hash": "b88fa7ce04280b386ac4674177e8b512", "author_url": null, "date": "Nov 10, 2009", "message": "Of course the system failed, if for the top JavaScript book it really came up with \"Creating Vista Gadgets\". You may be over analyzing the reason for the failure."}, {"author_name": "Will", "gravatar_hash": "182a72b947ef206b1580193b297e183f", "author_url": null, "date": "Nov 11, 2009", "message": "Simple - your target audience of programmers does not click on ads.  In fact, that audience is notorious for hating ads.  Even a newbie in an internet marketing forum would know that.  Still, you gotta great site!"}, {"author_name": "Francis", "gravatar_hash": "4e96e258e9d3bd640f9917d0ebda2639", "author_url": "http://www.wizardcomputing.com", "date": "Nov 12, 2009", "message": "@Frank I think letting us pay for our own content is the right idea."}, {"author_name": "Seth Godin", "gravatar_hash": "9c3cb5e2b8fd566cffd91f24c9079a4f", "author_url": "http://sethgodin.typepad.com", "date": "Nov 13, 2009", "message": "This is a great case study and a fascinating conversation.\n\nJust for a moment, consider a marketing site where one of the key marketers wrote a post that said that he and another fabulous marketer had spent a bit of time and written some software but OH NO it doesn't work. How on earth could anyone make money with software if they couldn't?\n\nAdvertising and marketing revenue are not coding problems, and they resist technology solutions. In fact, with the exception (a big exception) of Google, it's hard to think of any successful company that has won in this area with a technology solution.\n\nHang in there guys, you have a great tribe, smart, motivated users and passion. But no, you're not going to generate serious marketing coin because of a tech breakthrough."}, {"author_name": "Kelly", "gravatar_hash": "f6c326d7075039abf8fe625c2ffa41ec", "author_url": null, "date": "Nov 13, 2009", "message": "I used to run a programming site that was quite successful and went through some of the same challenges you are. After also giving up on Adsense I tried out http://tribalfusion.com/  and they seemed to make me the most money. \n\nI would give them first shot at my inventory and any unused inventory would be routed to a secondary campaign I had setup. Worst case if someone couldn't fill it would run ads for affiliate links like Amazon or dell. The system seemed to work well."}, {"author_name": "Conor", "gravatar_hash": "66a7c86458e7105f9a063870bcd1c891", "author_url": "http://outflopped.com", "date": "Nov 13, 2009", "message": "You could use the un-used ad space to advertise the various Stack Exchange sites. Giving them this extra helping hand in the early days will probably benefit you in the long run as it could mean the difference between the various SE sites succeeding or failing."}, {"author_name": "Brian Campbell", "gravatar_hash": "6aa87e056bd2ee342fbd56eb2110603c", "author_url": null, "date": "Nov 17, 2009", "message": "Looking at those Amazon links you post, they don't really seem to be the best books for the topics in question. I mean, top JavaScript books including \"Creating Vista Gadgets\" (huh? why is that even coming up for JavaScript?) and not Flanagan's \"The Definitive Guide\" or Crockford's \"The Good Parts\" (which are the top two hits I get on Amazon if I just search for \"javascript\" with no other qualifiers)? Did you ever do any testing on different mechanisms for choosing the top books you displayed, such as the top ones ranked by sales? I would imagine that top sellers might get somewhat more mixed reviews, while some obscure books might get high reviews for a variety of reasons without really being the best book for the topic at hand.\n\nAnd you assert that those ads look good, but I can barely read the text on the cover of those JavaScript books (so, I'm only really able to evaluate them on cover design), and the title of the C# book is partly cut off. Those don't look like they'd help very much. I don't know if Amazon offers this, but much better might be searching within the book for some other keywords associated with the question, and displaying an excerpt from the book, rather than just displaying covers which convey almost nothing useful.\n\nSo, yeah, while I agree with many of the previous comments that advertising to developers is pretty hard, I think you should work on tweaking those Amazon ads and your analytics for choosing them before writing them off entirely. The two example ads you show are ones that I would never, ever click on for those topics, while I may click on the \"Good Parts\" book as it's been something I've been meaning to get for a while."}, {"author_name": "Some Guy", "gravatar_hash": "42508426a0b6431ebdc3c2aa05e33503", "author_url": null, "date": "Nov 17, 2009", "message": "Everyone hates experts-exchange because they do everything they can to, well, get people to pay money.\n\nAdSense failed. Advertising books failed. The new experiments are \\amazon affiliates\\ and \\pay to host a CV\\ and this is ok because the comunity loves the site and thinks this is all great.\n\nSo, how long til the community says \\whatever, we'll just pay you money directly because we want you guys to make a good living off of this site\\?\n\nStick up a \\pay $10 per year to get full use of the site\\ policy and you'll know exactly how much the community really loves you.\n\nThe most fun thing about this whole process is the repeated claims that SO isn't profitable (which is pertty much standard web 1.0, web 2.0, and web 3.0 business strategy) and the desperate dodging around the fact that all profitable companies sell a product or service in exchange for money.\n\nWhen SO started, I thought \\I could have done that, but I couldn't see any way to make money off it\\. Its nice to know I wasn't exactly wrong."}, {"author_name": "Ian Ringrose", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Nov 18, 2009", "message": "Telling me about the “top” books does not help me, as that is what Amazon tells me about when I go to their website.    I think letting the top 2 or 3 rep users for each tag choose the books to be shown may give better results.\n\nAlso when I buy a book, I often look at the book on Amazon, then have to email the accounts office to get them to buy it, so there is no link back to stackoverflow."}, {"author_name": "Tom J.", "gravatar_hash": "2bd698effae7c91dc93711e1568a2c72", "author_url": "http://serverfault.com/users/846/tomjedrz", "date": "Nov 18, 2009", "message": "Two thoughts ...\n\n1- IANAL, but I am wondering if changing the content submitted by the users is legit under the Creative Commons license.\n\n2- It is one thing to add a referrer link to an \"un-referred\" book suggestion.  Do you also change a link submitted by someone with their own referrer link to your referrer link?  This would strike me as a bit underhanded ..."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Nov 18, 2009", "message": "Why not use a donate option? I never click on ads but I will donate to a site if it helped me a great deal. I would donate $10. You will NEVER make anything close to $10 from books sale commissions from me.\n\nAs a developer and smart shopper I would go to Amazon and do an advanced search and filter by 'bestselling' and 'avg. customer review' and read the reviews. This happens when I am ready for a book and not when an ad popped up because I was on a site. Ads will never give the information I need. I consider them random, haphazard and a push to wasteful impulse shopping.\n\nOnce a book intrigues me because of Amazone good reviews, I check it out at a physical store and then maybe buy it at the spot or get from Amazon. Either way, I bypassed your affiliate link. Sorry, I just don't buy anything straight from an ad. I have to do research."}, {"author_name": "Satya Prakash", "gravatar_hash": "982393a6cd5920abde07b05333a904e5", "author_url": "http://satya-weblog.com", "date": "Jan 17, 2010", "message": "PlentyOfFish.com is not a site for developer. I agree that for developer Adsense is not working. if i start writing a blog for general blog (only-your-views.blogspot.com and it receives 100 pv then it yield the better result than 600 pv developer blog (satya-weblog.com). I write about development bcoz I am related to that. but money wise I am not making even 3 dollar a week.\nbut i do not any solution!"}, {"author_name": "PhilArmstrong", "gravatar_hash": "36edb7e23165becfc5e216f463763e36", "author_url": "http://www.kantaka.co.uk/", "date": "Feb 16, 2010", "message": "I believe PentyOfFish makes most of it's money from referral fees paid by other dating sites who advertise on PoF to get clients. AdSense is probably ideal for piggy-backing on this, because dating sites have a constant need for new clients, so they have to keep advertising all the time.\n\nDevelopers on the other hand, tend to be a demographic that prides itself on not responding to advertising, which makes life a little difficult for a site like StackOverflow!"}, {"author_name": "Amazon News", "gravatar_hash": "3e78427cf98afef22e30f8d533c20329", "author_url": "http://faris.eu", "date": "Jul 20, 2010", "message": "I guess the trick to making advertising work on a site like this is to target things that your audience really needs and yet does not have freely available."}]}