{"response": [{"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Nov 19, 2009", "message": "Yeah, I still haven't finished the spelling corrector port. A bunch of people told me on the day that they'd already done it though - and some of them were in less than the 21 lines of Python, IIRC. I'm pretty sure that wouldn't be the most readable code in the world though :)\n\nGiven that the \"short\" has been done, I'm going to try to go for a readable version. Eventually I'll finish it and blog about it. It's just a case of finding the time."}, {"author_name": "Dominic Rodger", "gravatar_hash": "ffff18d8f9b2f464f0a371aee6da72c3", "author_url": "http://www.dominicrodger.com", "date": "Nov 19, 2009", "message": "@Jon - if you're referring to Norvig's spelling corrector in C#, there's a 21-line version at http://www.codegrunt.co.uk/code/spell.cs (mentioned in the comments to http://stackoverflow.com/questions/1708103/how-to-impress-developers-with-ironpython-python/1708142#1708142 )."}, {"author_name": "Zach", "gravatar_hash": "3066d0c98352a2c912ecd898f5f29d5f", "author_url": null, "date": "Nov 19, 2009", "message": "I really enjoyed the discussion on learning.  A lot of professors/teachers simply don't know how to teach to the way students learn."}, {"author_name": "Mike S", "gravatar_hash": "69739fc4bc58863ff835f4e929694342", "author_url": null, "date": "Nov 19, 2009", "message": "With respect to language learning: there are very good reasons for limiting the vocabulary/grammar that students can use in their drills. \n\nFirst, you want to focus their practice. The teacher knows better than you what you should be practicing. It's like in baseball, if a coach wants you to practice fielding ground balls, you field ground balls.\n \nSecond, a good language curriculum has thought very hard about the order in which things are introduced. It's important, and it should be adhered to. \n\nThird, you need to have a baseline of grammar and vocabulary that all of the students in the class share. A least common denominator of knowledge enables students to communicate with one another, and helps the teacher create effective drills."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Nov 19, 2009", "message": "We don't learn programming in school because programming is a job, not an academic discipline. A job is something that has to be learned while working."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Nov 19, 2009", "message": "Very interesting podcast, thank you. BTW, Gina Trapani and Mary Hodder also complained about stalkers and death threats in the last TWiG (http://twit.tv/twig16). I've never knew it was such a widespread problem. I'd like to help to do something about it if I knew how."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Nov 20, 2009", "message": "It kind of irks me on some level that Jeff keeps making these generalisations about programmers like \"...because programmers love games, right\" or \"programmers suck at graphic design\".\n\nProgrammers are as diverse a group of people with different tastes, preferences and abilities as any other subset of society."}, {"author_name": "Daryl Spitzer", "gravatar_hash": "56dbb3799dd6358c3bee3468d0328046", "author_url": "http://yacitus.com/", "date": "Nov 20, 2009", "message": "I was glad to hear Joel talk about the \"table topic\" idea for StackOverflow Dev Days.  I first saw it at EclipseCon several years ago, where it led to some great conversations.  It would have made Dev Days SF much more interesting for an introvert like me.  (I find it hard to just walk up to someone and start talking.)  Hopefully the next Dev Days in the Bay Area will be in a venue where this is possible."}, {"author_name": "daemonview", "gravatar_hash": "8ecfc25463a3087f290f7ae421c4a87f", "author_url": "http://www.jirupathum.com", "date": "Jun 19, 2010", "message": "It looks like the link to mp3 podcast for this episode is broken now."}, {"author_name": "daemonview", "gravatar_hash": "8ecfc25463a3087f290f7ae421c4a87f", "author_url": "http://www.jirupathum.com", "date": "Jun 20, 2010", "message": "It was my ISP's routing was bad. Now I can download it."}]}