{"response": [{"author_name": "Jake", "gravatar_hash": "769b1f309a41e2893654c81496b9f8b4", "author_url": "http://jakemcgraw.com", "date": "Nov 24, 2009", "message": "Jeff talks about PHP so much, I'm convinced he's a closet LAMP developer."}, {"author_name": "ps", "gravatar_hash": "b4bc950c2b34d6a9ab0aa740a5155430", "author_url": null, "date": "Nov 24, 2009", "message": "So, I'm not a big programmer, but my office mate subjects me to your podcasts weekly.  I have to say today's was one of the best ever.  Tom was an awesome guest; he was really normal sounding, and he had a nice sense of humor and really knew his subject well.  Also, his knowledge didn't overlap too much with what y'all know well.  Sometimes I think Joel bullies the guest into talking about something in his wheelhouse, but this week that didn't happen.\n\nI was fascinated by that whole NASA internet thing and its applications to terrestrial life.  Not sure I have high hopes for next week, but I guess I'll be listening ;)."}, {"author_name": "hellonearthis", "gravatar_hash": "baee665fa43c8ccd087517467fe7c04e", "author_url": null, "date": "Nov 24, 2009", "message": "I thought the speed with 128 bit cpu would be it can move data 128 bits at a time instead of 64 or 32 bits."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Nov 25, 2009", "message": "From Wikipedia:\n\n\"The emergence of the 64-bit architecture effectively increases the memory ceiling to 264 addresses, equivalent to approximately 17.2 billion gigabytes, 16.8 million terabytes, or 16 exabytes of RAM. To put this in perspective, in the days when 4 MB of main memory was commonplace, the maximum memory ceiling of 232 addresses was about 1,000 times larger than typical memory configurations. Today, when over 2 GB of main memory is common, the ceiling of 264 addresses is about ten trillion times larger, i.e., ten billion times more headroom than the 232 case.\""}, {"author_name": "Skizz", "gravatar_hash": "e222c924e06cc579a6866f6d7588ca66", "author_url": null, "date": "Nov 25, 2009", "message": "@hellonearthis: the amount of data moved between RAM and the CPU is already greater than the 'bits' of the CPU. The Intel chips move 32bytes at a time, specifically, the number of bytes in an L1 cache line. You can then load 128bits into a SIMD register.\n\nWill we ever need more than 2^64 bytes of RAM? Imagine searching 2^64 bytes for a sequence of bytes (a string search). You need to increment a register to count from 0 to 2^64. Incrementing a register takes a small amount of energy, lets say, a pico watt (0.000000000001 watts) then doing it 2^64 times requires over 18 mega watts! Unless there's significant power reduction or a change in the way computers work, 64 bit address should be enough for a while."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Nov 25, 2009", "message": "@Zack\nSimple solution to filling 128bit address space.\nJust add a 64bit GUID to each value for security reasons."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Nov 25, 2009", "message": "Just a note: if you want to *double* a 64bit address space, you only need *65* bits, not 128.  I know you meant double the bits, but that's not how it came out."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 25, 2009", "message": "Some additional podcast URLs from Tom:\n\nThe Usenix LISA 2009 conference:\nhttp://www.usenix.org/events/lisa09/\n\nDelay Tolerant Networking http://en.wikipedia.org/wiki/Delay-tolerant_networking is how to send big files around the solar system.\n\nFull video of talk from LISA 2009:\nhttp://www.usenix.org/events/lisa09/tech/tech.html#scott\n\nKeyloggers using DNS to signal back to their master is from \"The Advanced Persistent Threat\" by Michael K. Daly slides and video:\nhttp://www.usenix.org/events/lisa09/tech/tech.html#daly\n\n(This was based on info that was declassified only last month. Very good stuff)\n\nIPv6 over Social Networks (april fools joke)\nhttp://tools.ietf.org/html/rfc5514\nand the first implementation:\nhttp://apps.facebook.com/ipoverfb/\n\nTED.com: Talks Nicholas Negroponte, in 1984, makes 5 predictions (4 came true)\nhttp://www.ted.com/talks/lang/eng/nicholas_negroponte_in_1984_makes_5_predictions.html\n\nWhen I said \"Sysadmins have the responsibility but not the authority\" I was referring to \"System Administrators as Broker Technicians\", Nicole F. Velasquez, The University of Arizona, Suzanne P. Weisband, The University of Arizona.  She presented this paper at CHIMIT 2009: \nhttp://www.chimit09.org/programInDetail.html\n\nNokia talking about how IPv6 saves battery power on their phones:\nhttp://www.youtube.com/watch?v=o5RbyK0m5OY"}, {"author_name": "hbunny", "gravatar_hash": "018f6a46d64db65d28b12dd1aa712489", "author_url": null, "date": "Nov 26, 2009", "message": "Infinity Ward are the developers of Call of Duty: Modern Warfare 2, not id/John Carmack.\n\nThis isn't the first game to use P2P technology for online gaming as both Company of Heroes and Supreme Commander used it.  I wouldn't be surprised to find other games pre-dating these."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Nov 26, 2009", "message": "In episode #75 Joel says that people having trouble installing Fog Creak software on Unix means Unix is bad, and Jeff claims that the Microsoft stack he's using is 10x faster than LAMP because he read something somewhere about Facebook.\n\nYou're both lucky you're still funny :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 27, 2009", "message": "Pies, that's a quote from Facebook. Take it up with them if you don't believe that PHP is 10x slower than compiled Java or C#..\n\nhttp://www.25hoursaday.com/weblog/2009/10/29/FacebookSeattleEngineeringRoadShowMikeShroepferOnEngineeringAtScaleAtFacebook.aspx\n\n<blockquote>\nThere are PHP web servers which then aggregate data from dedicated web services, in-memory caches and their relational database. They use PHP on the front-end because it is easy to learn, easy to develop in and it is very productive. However there are downsides such as <b>the fact that their benchmarks have shown that [PHP] is ten times slower than if they used more traditional web programming technologies like C# or Java</b>. They have done a lot of work to optimize PHP and will continue to invest in optimizations instead of switching the language they use on their front ends.\n</blockquote>"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 27, 2009", "message": "> Infinity Ward are the developers of Call of Duty: Modern Warfare 2, not id/John Carmack.\n\nhBunny I am perfectly aware of that. I was referring to this:\n\nhttp://www.escapistmagazine.com/news/view/95955-John-Carmack-Says-No-Dedicated-Servers-for-Rage"}, {"author_name": "argherna", "gravatar_hash": "fc8b961e7f6781acdeeec8a3ebf15db5", "author_url": null, "date": "Nov 29, 2009", "message": "I don't administer servers but after listening to this, I find myself wanting to.  :)  Great show guys."}, {"author_name": "Roboprog", "gravatar_hash": "1bc2471f5a97b66082c3522697078ef7", "author_url": "http://roboprogs.com", "date": "Dec 02, 2009", "message": "@Skizz: a watt (or picowatt) is a unit for rate of power, not total energy used.  You want to use watt-second (or kilowatt-hour, like on your electric bill).  So the question is: how may picowatt-nanoseconds would it take to run the 64 bit register through its cycle?\n\nBut, cheap unit-of-measurement shots aside, I think having a wide bus would be a good thing, but not having to 0-pad a bunch of data or machine instructions."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Dec 03, 2009", "message": "@Jeff Keep in mind that the quote comes from someone who considers C# a more traditional web programming technology than PHP.\n\nWhat can I say. There is no reason I know of for PHP being slower than Java. Both are compiled to bytecode and executed. Maybe the Java runtime environment is quicker, or the bytecode is better, but that hasn't been my experience so far.\n\nI don't know C#, but since it also compiles to bytecode, I don't see why it should be significantly slower/faster than PHP."}, {"author_name": "Bob Weber", "gravatar_hash": "46a44f7fced6ed193281a1247d5b7a3a", "author_url": "http://blog.alltheinfo.org", "date": "Dec 03, 2009", "message": "<a href=\"http://www.edn.com/blog/980000298/post/820024082.html\" rel=\"nofollow\">The IPv6 is 105 times every atom on the planet</a>, so per your discussion, we shouldn't have to worry about it until we colonize 105 planets."}, {"author_name": "JTSandvik", "gravatar_hash": "be4340d8902760caf0f391c77854b312", "author_url": null, "date": "Jan 17, 2010", "message": "You guys are certainly confusing address space and width of the data bus. There are many 32-bit OS'es that support more than 4 GiB of RAM. Just look at Windows XP before SP1.\nAnother example: Most 8 bit OS'es are not limited to 256 Bytes of RAM, and 16-bit Windows did indeed support more than 65536 bytes of RAM.\n\nThe current limit of 4 GiB RAM on XP is partially a business decision.\n\nJeff has even blogged about different licenses of Windows server supporting differents amounts of RAM."}]}