{"response": [{"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Nov 24, 2009", "message": "I completely agree but...\n\nWait till the *NIX-zealots kick in!"}, {"author_name": "guns", "gravatar_hash": "19767fc44ba1c5ad436d7c84c633e08d", "author_url": null, "date": "Nov 24, 2009", "message": "&gt; Wait till the *NIX-zealots kick in!\n\nI got here as fast as I could!\n\n&gt; piping actual objects-as-text around instead of mindlessly grepping text. I swear it actually manages to out-UNIX UNIX.\n\nThe merits of passing objects around in an interactive shell aside, \"mindlessly grepping text\" is one of the core concepts in Unix. From that point of view, an object-oriented shell is not very Unix-y at all. In fact, in so far as Unix tools are implemented as pure text filters, classic Unix shells can be seen as more of a functional programming environment than an object oriented one.\n\nThat said, I do enjoy a good OO irb (ruby-shell) session now and then, so I'm not going to pooh-pooh Powershell without having used it more than I have."}, {"author_name": "Barry Kelly", "gravatar_hash": "4a7b08fcb7e3d9a52ae473613b71bc3d", "author_url": "http://blog.barrkel.com/", "date": "Nov 24, 2009", "message": "One of the biggest advantages of a Unix shell, and one that PowerShell is missing, is job control. Combined with pipes and fifos, multiple processes can work in concert in CSP fashion.\n\nWhen I read about the equivalent to Bourne shell amp; (not typing literal as it might be eaten) in PowerShell, it does make me weep:\n\nhttp://bartdesmet.net/blogs/bart/archive/2008/03/25/windows-powershell-2-0-feature-focus-background-jobs.aspx\n\nIt's ridiculously overcomplicated and clumsy for such a basic operation. And what of fg, bg, Ctrl+Z?"}, {"author_name": "wbkang", "gravatar_hash": "75634431b8b7bc8b37cc1673d7d789e9", "author_url": null, "date": "Nov 25, 2009", "message": "&gt; Wait till the *NIX-zealots kick in!\nI am from ksh background and I find Powershell relatively easy to use, after I get used to the slightly different syntax.\n\n&gt; It’s ridiculously overcomplicated and clumsy for such a basic operation. And what of fg, bg, Ctrl+Z?\n\nThey aren't that easy to use. Powershell just has a better support for job control."}, {"author_name": "natxo", "gravatar_hash": "5f9f0d3ea9cbb3567e66bf52633b13ce", "author_url": null, "date": "Nov 25, 2009", "message": "wbkang:\n\nif you think _that_ is easier than fg, bg or ctrl-z, I dare not ask what you think is difficult :-)"}]}