{"response": [{"author_name": "Rachel", "gravatar_hash": "01b235a8024b2dd10f427c301c876a0b", "author_url": "http://rachel53461.wordpress.com", "date": "Aug 21, 2012", "message": "Will you be comparing results with questions that SHOULD BE closed, or that actually ARE closed? \n\nBecause there are many questions that should be closed that aren't, and even some that are closed that should not be. The determining factor is how many people view them, and what actions those people decide to take on the post.\n\nAlso, are you looking for an algorithm to be for SO only? Or something that can be tweaked for other SE sites as well?"}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": null, "date": "Aug 21, 2012", "message": "Woops, fat fingered some dates there.\n\nThe Timeline (linked from the dates) goes into greater detail, but you basically have to *finish* your model by the 9th of October.  The actual judging goes on for a while longer, but you can't change your submission past the 9th."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": null, "date": "Aug 21, 2012", "message": "@Rachel we're using questions that are actually closed, it's impractical to hand curate enough questions.\n\nWe're not terribly concerned by the questions that aren't closed or those that were incorrectly closed being in the data set, as there's so much data those few outliers shouldn't matter.  Obviously we'll evaluate the predictions for those subtleties before we incorporate any of these algorithms, but for the purposes of the contest we need really concrete criteria.\n\nTo be clear, we're not intending to have an algorithm automatically close posts.  This is aimed at improving our quality metrics (which guide users before posting) and auto-flagging facilities (which help focus moderation attention).\n\nWe're using SO for the contest because we're confident we have enough data, if the results are generalize-able to the rest of the network we'll do so."}, {"author_name": "Zach", "gravatar_hash": "34632a473b8dd3cec22ebee5f1829ba9", "author_url": null, "date": "Aug 21, 2012", "message": "I presume absent a perfect solution you'd rather have it close too few questions rather than too many?"}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Aug 21, 2012", "message": "IMHO most closes are pointless insults to well-meaning users.  Often new users too.  Nothing says \"welcome to superuser\" like \"your post was closed as a duplicate of a 3 year old Windows XP question\".\n\nI think that closing should be reduced, not automated."}, {"author_name": "Giszmo", "gravatar_hash": "768ff5921cfcb29dce03e94b814817a3", "author_url": null, "date": "Aug 21, 2012", "message": "@Andomar: The better posts are categorized before mods judge about closing them, the better work they can do. Wrong decisions will surely get fewer if mods can concentrate on fewer questions to be moderated, but: As I understood the assignment it is also intended to give the poster feedback on how to \"improve\" his post so it doesn't raise the red flags."}, {"author_name": "Ben", "gravatar_hash": "3a8d5632b6f9b74095e7867412f0a808", "author_url": null, "date": "Aug 21, 2012", "message": "Interesting problem, but I'd rather not help automate the obnoxious closing of interesting questions."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 21, 2012", "message": "Due to the apparent flip outs here/on Hacker News maybe the original post should clarify you're trying to automate helping people form better questions, not automate closing"}, {"author_name": "Mark", "gravatar_hash": "0144ebb7ad7a3fd6cbfe54c95c48ddc9", "author_url": null, "date": "Aug 21, 2012", "message": "I think some additional data about users would really help here:\n- time, score, status (open, accepted, closed for X) title and body of each of their previous posts (up to 10?)\n- geographic region of user"}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": null, "date": "Aug 21, 2012", "message": "@Ben\n\nYeah, the mis-comprehension is a bit surprising.  The idea that we'd automate moderation is so crazy I don't even know how'd you jump to that conclusion.  Anyway, added some extra \"what we'd use it for\" text at the end.\n\n@Mark\n\nWhat we provided for this contest is a) public and b) currently available at post time in our code.  We grabbed a little bit more that we're quite sure is important (undeleted answers), but we had to draw a line somewhere.\n\nPresumably any approach could always benefit from more data, so when/if we incorporate any new algorithms we can always make improvements with new data."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Aug 21, 2012", "message": "Wow, this is actually, genuinely truly a great idea.\n\nI love it.\n\nThat is all. :)"}, {"author_name": "Mark", "gravatar_hash": "3312219849e076b5e99adb78b9e60b58", "author_url": null, "date": "Aug 21, 2012", "message": "I think the prize should also include some Stack Overflow rep and/or badges!"}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": null, "date": "Aug 21, 2012", "message": "@Mark - I don't think they'll ever hand out wholesale blocks of rep unless it comes from someone else (conceivably, Joel and Josh could slice some of their points off and give them to you). \n\nBut badges for those who positively participated would be neat. I'm really thinking about tossing my hat into the ring, just thinking hard on if I'm going to have enough time."}, {"author_name": "Andrew Thompson", "gravatar_hash": "a1ab0af4997654345d7a949877f8037e", "author_url": "http://pscode.org/", "date": "Aug 21, 2012", "message": "Why would the learning engine be not best suited to being given the actual reason a post was closed a '1' and every other reason a '0' (or vice-versa, if I got the numbering wrong)?  Perhaps I have misunderstood how learning algorithms work."}, {"author_name": "Federico", "gravatar_hash": "303b0a741a14439b53c23ce4c9e28a12", "author_url": "http://fedmich.com/works/stackoverflow/", "date": "Aug 21, 2012", "message": "Great Idea. I love automating stuffs, I'll help on the contest too.\n\nI just hope the resulting logic/algorithm are very good enough to use on other SE sites as well :)"}, {"author_name": "FloPes", "gravatar_hash": "af8f7e59f65df9ea5d6f4ddca847d513", "author_url": null, "date": "Aug 22, 2012", "message": "So I know what hellban and slowban is, but what in the name of the giant spaghetti monster is \"dispatch black helicopters\", \"irradiate\" and \"taunt user\"? And more importantly: What do they do?\n\nApart from that: Nice idea, yet I am very unsure about wether such a system wouldn't produce many false positives..."}, {"author_name": "SD", "gravatar_hash": "c4d508739c0632968dface9c086c3176", "author_url": "http://saarvi.com", "date": "Aug 22, 2012", "message": "This is the best way to find the brightest solution..keep it up...good work...I love StackExchange and StackOverflow"}, {"author_name": "Vikas joshi(devjosh)", "gravatar_hash": "b62207f85a5dfd4e42057326888f6f18", "author_url": "http://stackoverflow.com/users/737810/devjosh", "date": "Aug 22, 2012", "message": "i hope we will find an algorithm in this contest which will be able to a nice verdict with all questions and specially with the new users."}, {"author_name": "Sidd", "gravatar_hash": "a2c80cf5786b38c8a492908ee96daf62", "author_url": null, "date": "Aug 22, 2012", "message": "This is pretty cool.  So we'll know how we each individually did on the private testing right?  I'm in high school and not really expecting to win, but I have been doing data mining this summer and I want to see if what I researched will apply to this situation too."}, {"author_name": "Brad Larson", "gravatar_hash": "52a2ffb44b1c11ab9001cb67e0a0021c", "author_url": "http://stackoverflow.com/users/19679/brad-larson", "date": "Aug 22, 2012", "message": "Does the training and evaluation data include questions that were closed and then later deleted? Many of the worst closed questions end up being deleted, and I know that deleted questions don't show up in the regular SE data dumps. Are these included here?\n\nIf not, we could be missing a bunch of really good examples for questions that were closed and were so bad they ended up deleted. Also, the system auto-deletes closed questions with no votes and no answers after a certain period of time, if I'm not mistaken, so a lot of older closed questions could be left out of this set."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": null, "date": "Aug 22, 2012", "message": "@Brad the training and evaluation data sets are using public data, so there are no deleted questions (I suppose some of them have probably been deleted *since* the dump, but nothing was at the time).\n\nSimilar reasoning as my reply to Rachel, any solution should benefit from more data so we're not concerned about these omissions.  A lot of the stuff that gets deleted our existing systems already finds pretty well too (especially spam, which is the big close then immediately delete case).\n\nBy using public data we don't have to go through the hassle of NDA'ing everyone who wants to participate, which I think is a big win with very little practical downsides."}, {"author_name": "Chuck Bassett", "gravatar_hash": "9162e8bca37c48433207c1fccfb3bba1", "author_url": null, "date": "Aug 22, 2012", "message": "I don't expect to build a competitive entry but this is still a very cool idea dealing with a chunk of Computer Science I've never had cause to dig into. What a fun opportunity for a short-term coding project.\n\nFor anyone else in my shoes: if you are looking for a survey of the field, Professor Nilsson of Stanford University makes the early draft version of his (now slightly aged) book \"Introduction to Machine Learning\" available at no on his department website at [http://robotics.stanford.edu/people/nilsson/mlbook.html](http://robotics.stanford.edu/people/nilsson/mlbook.html)\n\n/Do stack overflow formatting conventions apply on the blog?"}, {"author_name": "wax_eagle", "gravatar_hash": "4320ac0987d82025b454bcee57d708d1", "author_url": null, "date": "Aug 22, 2012", "message": "@kevin that makes the sample biased if you're not including everything in your dataset. You'd really have to NDA for something that is available to 10k users?"}, {"author_name": "Dave Lewis", "gravatar_hash": "76e8fa8b2846bcfa6366ddf3be92c335", "author_url": "http://www.DavidDLewis.com", "date": "Aug 22, 2012", "message": "Even if you can't afford to manually clean up the training data, I'd strongly encourage you to clean up the test data.  Beyond a certain point, increasing test set size doesn't help if the data is noisy, so a smaller more carefully annotated test set can be more valuable than a large noisy one."}, {"author_name": "ilango gurusamy", "gravatar_hash": "5fac46a827ae3712331dbfc40af34207", "author_url": "http://scalanirvana.blogspot.com", "date": "Aug 22, 2012", "message": "Chuck\nI am in the same boat as you. Are you planning on doing any design/coding on this contest project?"}, {"author_name": "Ivan Fragoff", "gravatar_hash": "35bf4a406710cc1348a52da32b6f472e", "author_url": null, "date": "Aug 22, 2012", "message": "Maybe as the user types the question, have a continuous query of already posted questions display relevant results. Kind of like dynamic search fields now behave in search engines. \nIt might not prevent the post, but could steer the user towards an existing discussion, something that they've missed when they searched SO before asking the question."}, {"author_name": "Lipis", "gravatar_hash": "a8518c33a76987dd41dd26497563fee9", "author_url": null, "date": "Aug 22, 2012", "message": "There is a new book that was just released regarding Machine Learning..! Maybe it's a good idea to purchase it if you want to win the competition :)\n\nhttp://googleresearch.blogspot.com/2012/08/machine-learning-book-for-students-and.html"}, {"author_name": "scunliffe", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": "http://www.SongName.Info", "date": "Aug 22, 2012", "message": "I posted a question (on the forum for kaggle) as I figure I might not be the only person lost. See here: https://www.kaggle.com/c/predict-closed-questions-on-stack-overflow/forums/t/2414/algorithm-or-result-or-both/13338#post13338\n\nI'm not sure I get what the goal of the contest is... Are you looking for the Algorithm? Just the Results as compared to the existing data set? Both?..."}, {"author_name": "Joel", "gravatar_hash": "49a50ec791686970711aaa2404141ff3", "author_url": null, "date": "Aug 22, 2012", "message": "Another possibility would be to separate the question field into several fields, more precise. The questions are always closed for the same reasons, and by reversing these reasons you would come with something like:\n\nProgramming techonologies:\nYour question:\nWhat is the error you get:\nWhat have you tried:\n...\n\nIn other words, improving your user interface to avoid error handling."}, {"author_name": "Jeremy", "gravatar_hash": "e0f502a6b3a7c216b85ed88d3d0b2799", "author_url": null, "date": "Aug 22, 2012", "message": "I hope you call the engine Jeff: http://meta.stackoverflow.com/questions/131791/the-prompt-for-new-users-to-write-a-good-question"}, {"author_name": "Andrey", "gravatar_hash": "82d3ad1de1b2b52e33ae85a9e396cdeb", "author_url": null, "date": "Aug 24, 2012", "message": "I think it is impossible to fully automate this task. Here is example of question: I have an error. And there goes code. If code is clear and self explainable it is normal question. If code is just taken from context, with variables, functions and classes that are defined elsewhere this question will be closed in few seconds. These questions are almost identical and can hardly be differentiated."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": null, "date": "Aug 24, 2012", "message": "@Andrey \n\nIt's a good thing we're not trying to automate it then :)\n\nThis contest is about getting better tools in our moderation &amp; guidance toolboxes, not about replacing them with Robot Overlords™."}, {"author_name": "Ian", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Aug 24, 2012", "message": "It would be interesting what would be done with machine learning on detection answers that are likely to be deleted as “not an answer”, so they can be fed into a new review tag.   I expect this is a lot easier problem to look at.\n\nAlso using machine learning to work out the question a given user is most likely to be able to get an up voted answer on."}, {"author_name": "bilal ahmed yaseen", "gravatar_hash": "2162f828bb34e00fa2849629b1745398", "author_url": null, "date": "Aug 30, 2012", "message": "kindly anyone or the competition organizer can give me sample data set for this competiton problem.\n\nmail me at : bilalahmedyaseen@yahoo.com\n\nthanks,\n\nregards,\nbilal ahmed yaseen"}, {"author_name": "Jay", "gravatar_hash": "2a009c33bcd2d819aba35becf2edaf35", "author_url": null, "date": "Sep 14, 2012", "message": "Can we use the dump data as research data for my personal paper?"}, {"author_name": "Feral Oink", "gravatar_hash": "8cce7b70d30f42045bc6c8569f5549e2", "author_url": "http://myindigolives.wordpress.com/", "date": "Sep 16, 2012", "message": "What happened to the job opening for Stack Exchange Data Scientist?\nThis post mentioned it here: \n<blockquote>We’re also hiring a full-time data scientist, and we’re going to be very interested in talking to the authors of the best classifiers.</blockquote>\nbut when I clicked the link \nhttp://careers.stackoverflow.com/jobs/19463/stack-exchange-data-scientist-stack-exchange\nit returned: \n\"Job Not Found: Sorry, we couldn’t locate that job listing.\"\nPerhaps you have filled the position?"}, {"author_name": "Joel Spolsky", "gravatar_hash": "95e6837f350869bfb44e069a98885c58", "author_url": "http://stackoverflow.com", "date": "Sep 19, 2012", "message": "@Feral yes, it's filled."}, {"author_name": "Eriic Q", "gravatar_hash": "89a68a77099cdf1df3947249e08ccb25", "author_url": null, "date": "Oct 10, 2012", "message": "I am kind of new to statistics, but I found the problem interesting to look at. My thoughts as a beginner, is that some questions are poorly written, I guess in some cases because the author doesn't know (or don't care) how to properly write a question which will trigger an answer (and I am guilty of that too when in retrospect I look at some questions I asked).\nOn many subject it help to deconstruct the problem one is facing to solve it, in order to do so having a range of aspects on the questions to fill can help the author to write his questions for instance:\n - describing his own experience in the field of the question\n - describing what have been tried to so far to answer the problem, and what was the effect.\n - describing external reference on the topics that have been studied and the effect on the topic.\n - giving some context around the questions.\nIdeally this set of questions should be write by the experts in the field. then until the users have reach a level of the reputation they should have to answer theses subtopic of their questions.\nThe advantages for teh site is that divided in subtopic, it will be easier to spot the lack of interest of the author, ie instead of having to make sense of unstructured text, it will be semi-structure text (controling the content will be much easier). \nThe advantage for the authors, at least the one new to the field who want to progress it will give them a kind of rudimentary framework to ask themselves first what to do to find the answer. In time one can hope that because they get better answers they progress faster.\nAnd for the ones answering the questions it will ease their work and maybe allow them to find way to answer the questions more efficiently.\nHope it could help."}]}