{"response": [{"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 08, 2012", "message": "*Thank you* for ending on this particular note."}, {"author_name": "Fong-Wan Chau", "gravatar_hash": "4a5075ef55e888e510644d27e7202c39", "author_url": "http://fong-wan.me/", "date": "Aug 08, 2012", "message": "Well, the problem I perceive now on SO, is that new questions are usually very basic, there were already several similar questions with answers included... Today many new programmers no longer buy books to learn programming, they just read simple articles online, learn the basics of HTML+CSS or PHP and then start change Wordpress template. I have friends that neither knows the CSS box model and ask me very many times things related to CSS, starting with: \"Hello, I don't know why my site appears this way...\".\n\nI know that SO provided a lot of tools, like \"exact duplicate\" flag; and when the question is similar, they are going to show on \"Ask question\" page, but in my opinion, those questions should be able to combine, this way can increase their quality of questions and answers (something like Quora maybe)..."}, {"author_name": "Vegard Haugland", "gravatar_hash": "6d408b09523b91f9b45e766317fd8c18", "author_url": "http://v3gard.com", "date": "Aug 08, 2012", "message": "In the image above, why is there a quote by Dumbledore (in Harry Potter) and an image of Gandalf in Lord of the Rings?"}, {"author_name": "Vegard Haugland", "gravatar_hash": "6d408b09523b91f9b45e766317fd8c18", "author_url": "http://v3gard.com", "date": "Aug 08, 2012", "message": "Oh gawd. Self trolled myself there. (note to self: read text before you skim through the text and look at the images)"}, {"author_name": "Force", "gravatar_hash": "ced24b61a78c229121f7790b29a1dfa0", "author_url": null, "date": "Aug 08, 2012", "message": "More importantly, why is the quote attributed to Dumbledore when it should read Yoda?"}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 08, 2012", "message": "And now for 500 comments along the lines of \"No, Yoda said that\", \"That's not Dumbledore...\" and \"Gandalf didn't say that\". Hint: the sentence before that ends with \"geek troll\""}, {"author_name": "Mike Swierczek", "gravatar_hash": "88cc189a780fd1d25764970b5be521a1", "author_url": null, "date": "Aug 08, 2012", "message": "Shog9,\nYou are of course correct that correct information is the whole reason StackOverflow exists and trumps politeness.  I admit, I have a thin skin, if I felt insulted by answers I would not ask questions.  But this place has so much useful information I don't need to ask questions - most of the time, the answer already exists here.\n\nFong-Wan Chau, \nI think the problem is only when people ask questions without looking for answers first.  I don't care if my coworker learned everything he knows from StackOverflow or similar websites.  Even if he or she learned everything from books and universities, if the person kept asking questions without doing research first I would be angry.\n\nVegard Haugland,\nThe image is an illustration of the paragraph above it, to drive home the point that misinformation from polite people is still useless.  The quote has Dumbledore's name on it, but it's from Yoda in Star Wars: Empire Strikes Back."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Aug 08, 2012", "message": "I can't say the tone of this post surprises me. It's as unfriendly and hostile as the community's moderator gangs. I rarely use SO any more, aside from asking an occasional question, because the site is just so damn unfriendly. And I'm no noob. I know what kind of questions the moderation police dislikes and I'm not even talking about those. Just a few days ago I posted a question about some git nuance. It took 5 minutes to get 2 close votes as a dup - even though I explicitly explained why it's subtly different then the other questions in advance. My point isn't to rant about this particular question. I just want to convey the experience - I had to spend 15 minutes arguing, vying for moderator attention, asking friends to upvote and repeatedly re-edit my question to clarify why it's not a dup. In the end it were my programmer facebook friends who knew the answer. The community basically did not help at all. \nAt a certain point a colleague saw the question and said he would upvote it but he never used SO before and doesn't have enough rep to do so. The upshot of that conversation was that I told him this isn't a community worth participating in, to he probably shouldn't bother opening an account.\nEvery day that passes the site's marginal value for additional questions &amp; answers dwindles. Some of it is because so many questions have already been answered - so there's really no point in participating aside from some some weird Tamagoochi devotion to weeding and trimming it. I actually did that for a while, because the site's early years were that much fun and it meant a lot for me. Another reason is the amount of friction you get when you try to participate. It seems like every damn question I ever ask gets closed down, migrated to some other site, then migrated back. It's just too much. I actually get stressed by the idea of posting a question, knowing that I have to carefully watch and guard it against hoards of moderators before it has a chance to be seen by someone who would answer. That's. Not. Fun.\nI don't remember the motto being \"we're jackasses that are always technically correct\" when I signed up. It was about a wiki/q&amp;a/digg kind of thing - I'm really quite sure being an asshole wasn't in that Venn diagram.\n\nToday I had a question - a technical question that I really wanted to ask - but I didn't. I couldn't. The question was whether or not somebody knew of a good linux tool that does Email-&gt;HTTP. I tried to think which forum was right for this, but I just couldn't figure it out. I was positive it would get shut down on any of them. It's a poll question, or it's not about programming, and it's not about being an admin, it's not a \"user\" question, blah, blah, blah. So I just didn't. I almost asked it on Quora - that's how desperate I was. Almost.\nIt saddens (yes, saddens) me to see this great endeavor slowly crumble and decay into a weird, unfriendly, factioned mess. At least the summer of love thing gave me some hope that some people are aware of the problem. But now this unapologetically hostile BS. [sigh]\nKeep it up and your moderation job is bound to become a lot easier."}, {"author_name": "Joshua Flynn", "gravatar_hash": "f80d9f8a385a61e23b14dcc6dfcd1c99", "author_url": null, "date": "Aug 08, 2012", "message": "\"but if Stack Overflow was full of very nice, impeccably polite misinformation…\"\n\nStrawman argument. You assume that just because people are nice and polite, means they are spreading misinformation. You then switch to exaggeration of 'handing out gold stars' (SO already permits the handing out of upvotes and badges...) and 'geek trolls' (why would a nice person be trolling? ...again, strawman).\n\nIt's possible to be both polite and truthful. And it's also quite possible to be rude... and very wrong (rudeness has no direct correlation to the validity of the truthfulness of a given statement). \n\nFor some reason, people think that because they know something, it somehow justifies them being rude or condescending to those who do not know. Am I to presume these people were born with the knowledge, or did they learn from someone else's generosity (and thus kindness) of knowledge?"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 08, 2012", "message": "@Assaf:\n\nThe problem you are having is not tone; it's that you misunderstand the scope and purpose of SE sites.  This is evident in your use of the word \"forum\" to describe SE sites.\n\nYour insistence that you're not a noob is belied by the fact that any casual user of an SE site that's asked more than two questions can readily identify your Linux tool question as a shopping question.  See http://blog.stackoverflow.com/2010/11/qa-is-hard-lets-go-shopping/"}, {"author_name": "JP", "gravatar_hash": "118f49e3ea76935f3e7be907a9bbc068", "author_url": null, "date": "Aug 08, 2012", "message": "Very confused. Is it or isn't it OK to be a jackass?"}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 08, 2012", "message": "It's okay to be a jackass as long as you're nice about it. (pause for heads exploding)"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 08, 2012", "message": "As to the accusations that this post is not polite enough for your sensibilities, just remove the two references to \"jackass,\" and all of the rest of the information still applies.\n\nOr, better yet:\n\n\noffending text here\n\n\nPeople can, and do, get offended over almost anything.  Whether something does or does not offend, or may offend, cannot possibly be a useful metric.  The real question is, would a reasonable person be offended?  \n\nHopefully, you are secure enough in yourself that you're not terribly upset by a couple of \"jackass\" references.  If I were upset every time a disgruntled user tried to burn me in effigy, I wouldn't get out of bed in the morning."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 08, 2012", "message": "Argh.  Blog swallows angle brackets fail."}, {"author_name": "JP", "gravatar_hash": "118f49e3ea76935f3e7be907a9bbc068", "author_url": null, "date": "Aug 08, 2012", "message": "@Robert -- He only referred to it as a forum once, he called SO a \"site\" multiple times."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 08, 2012", "message": "@Joshua Flynn did you and I read the same blog post, or did you only read that one phrase? The whole point of the post was there's no need to trade accuracy for friendliness, and that sharing knowledge is the sort of \"friendly\" we're after. Read the last paragraph."}, {"author_name": "Hugo", "gravatar_hash": "1d142fd41ea0a8b989f8a005e6532845", "author_url": null, "date": "Aug 08, 2012", "message": "Assaf, I feel your pain. I'm thick skinned, and I'm pretty sure I'm always right and everyone else is always wrong, but whenever I ask a question on an SO site, it kinds of feels like jumping into the darkness, or proposing to my GF or something. I never know what I'm going to get. A good response, or mean spirited grey-beards.\n\nThis can be quite shocking to new users, and I suspect a few are put off. \"So what?\" Well, who is all this amazing correct information for anyway? Surely it's supposed to benefit newbies at least as much as thick-skinned arrogants such as myself.\n\nWhile the SE sites are well designed around our human nature, the one thing they fail to address is the fact that asking a good question is very difficult. Not only is it a learned skill that SE does little to teach. It's also impossible to anticipate everyone's emotional reactions to it. Or how they'll misread it. Or how they'll try to answer a different question, or re-define your problem. In fact, the more you try to anticipate these things, by adding lots of additional points to the question, the more they'll fail to read everything, and the more problems it will cause.\n\nSE needs an explicit mechanism to help newbies improve their question answering skills, and to convey feedback from moderators in a structured way. Voting to close is too crude a mechanism to deal with the many subtle ways in which a question might need to be improved, especially since the closers often don't bother to leave a comment."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 08, 2012", "message": "@JP:\n\nTo be clear: Forums are vast wastelands of suck.  They are the equivalent of being in the Sahara desert and dying of thirst, seeing an oasis, running towards it, but it is just a mirage, and there's no water there.\n\nSE sites were carefully crafted to avoid this problem, using a system of upvotes, downvotes, close votes, moderator flags, and rules about what questions are considered acceptable there.  None of these things, in and of themselves, are rude.  Conflating them with rudeness redirects the argument to something else.  \n\nDebate the rules on their own merits.  Trying to get them changed on the grounds they are rude is intellectually dishonest."}, {"author_name": "zoredache", "gravatar_hash": "1d14bc5916f53c189fc84c596c36e771", "author_url": null, "date": "Aug 08, 2012", "message": "Does a user ever get any feedback when one of their comments has been flagged as rude?  I have noticed a couple users starting to get really rude in the comments, and I have been to flag some of their more aggressive comments, but I am not sure it really gets anywhere.\n\nI doubt there is enough people worried about the comments that it will get voted into invisibility."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 08, 2012", "message": "@zoredache:\n\nThe feedback is that the offending comments disappear.  It might take a while for a mod to get to them.  If you think your flags are not being acted on, post a question on meta *with specific examples.*"}, {"author_name": "Nobody Real", "gravatar_hash": "76324a08a4f2223b15c9a5ae2dde3243", "author_url": null, "date": "Aug 08, 2012", "message": "Forum has two meanings (well more than that actually, but in this context basically 2).  A very specific meaning, and a more general meaning.  The first is a web based message board.  The second is an assembly, meeting place, television program, etc., for the discussion of questions of public interest. \n\nIt is most definitely the second, but not the first.  So in the more general sense of the word, one can refer to SE sites as \"forums\", but not specifically as a forum in the sense of a message board.\n\nOf course it can be argued that SO is not a place for discussion at all, but answering a question constitutes discussion of the question, and asking further questions to clarify the posers question also constitutes discussion.  \n\nI guess my point is, just because someone refers to SO as a forum doesn't mean they meant it as a message board."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 08, 2012", "message": "@zoredache not directly at all, just that the comment goes poof. If a mod finds it necessary they can privately contact the user (or leave a public comment) reminding them (or everyone involved) to be polite, or even suspend them if it's proven to be a  major problem."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 08, 2012", "message": "@Hugo \"the one thing they fail to address is the fact that asking a good question is very difficult\"\n\nI disagree completely; the ability to vote, edit and close/reopen posts is a *great* system put into place for *exactly* that reason. Asking a good question is hard, that's why good questions are rewarded, and questions can be edited; by anyone. It's also why we don't let bad questions stick around collecting answers which may be irrelevant, confused or otherwise low quality.\n\nWe have tools to show people what's wrong with their question. Comments, edits and specific closure reasons."}, {"author_name": "JP", "gravatar_hash": "118f49e3ea76935f3e7be907a9bbc068", "author_url": null, "date": "Aug 08, 2012", "message": "Thank god for you Ben, if you hadn't summarized the blog post (http://blog.stackoverflow.com/2012/08/stack-exchange-is-not-a-forum-the-role-of-niceness-on-a-qa-site/#comment-68785) I never would have known what it was about."}, {"author_name": "JP", "gravatar_hash": "118f49e3ea76935f3e7be907a9bbc068", "author_url": null, "date": "Aug 08, 2012", "message": "Sorry, I hope that didn't come across as sarcastic. I was serious, this actually helped me understand the post.\n\n\"The whole point of the post was there’s no need to trade accuracy for friendliness, and that sharing knowledge is the sort of “friendly” we’re after.\""}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Aug 08, 2012", "message": "@Fong-Wan Chau:\n\nYou might like <a href=\"http://www.joelonsoftware.com/items/2008/04/16.html\" rel=\"nofollow\">this blog post</a>, announcing the Stack Overflow project over four years ago...\n\n<blockquote>What is stackoverflow.com?\n\nNothing, yet.\n\nBut here's the concept:\n\nProgrammers seem to have stopped reading books. &hellip;\n</blockquote>"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Aug 08, 2012", "message": "@zoredache: if a moderator notices a lot of flags cropping up on someone's comments, they'll be contacted about it. If it gets bad enough, they may <a href=\"http://blog.stackoverflow.com/2009/04/a-day-in-the-penalty-box/\" rel=\"nofollow\">end up in the cooler</a> for a while..."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 08, 2012", "message": "@JP it did read as sarcastic, thanks for the clarification :P\nI guess it seemed clearer to me because I've been in the trenches (comments and rants) through most of this, and those are the most salient points I've gotten out of the discussion; was very glad to see that's SE's take on it too."}, {"author_name": "percusse", "gravatar_hash": "6c80104137b99d293a870f6770ee6452", "author_url": null, "date": "Aug 08, 2012", "message": "When did accuracy lost over friendliness? What kind of a weird trade off is this? \n\nThis means the friendly guy is wrong (which is still normal in the normal world out there) and can be corrected? Why do you need to give a pat on shoulder to the jackasses? \n\nIs there any concrete example or just burnt out mods venting here, as I'm hanging in one of the SE sites that has a counterexample to almost all assertions made in the post?"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Aug 08, 2012", "message": "@percusse: it hasn't. That argument is, and has always been, false. \n\nThe truth is, folks are rude for all sorts of reasons. And folks are *wrong* for all sorts of reasons. The danger comes in thinking that you can afford to be rude <i>because you're right</i> - or afford to be rude because someone else is wrong. \n\n...Or heck, that you can afford to be wrong because you're nice about it.\n\nYou might find this discussion (and the links therein) interesting: <a href=\"http://meta.skeptics.stackexchange.com/questions/13/faq-when-is-it-appropriate-to-be-a-dick-on-skeptics\" rel=\"nofollow\">When is it appropriate to “be a dick” on Skeptics?</a>"}, {"author_name": "Fong-Wan Chau", "gravatar_hash": "4a5075ef55e888e510644d27e7202c39", "author_url": "http://fong-wan.me/", "date": "Aug 08, 2012", "message": "@Shog9:\n\nI recognize that SO is a good platform, but I think we can not encourage laziness of the people, in this sense I agree with Mike. With advancing of the technology, the people are more like citizens of the movie WALL-E, now people just ask and expect the solution to come without making some effort to investigate what may have been his problem."}, {"author_name": "percusse", "gravatar_hash": "6c80104137b99d293a870f6770ee6452", "author_url": null, "date": "Aug 08, 2012", "message": "@Shog9 Thanks for the link. It is indeed interesting but I hope you excuse my ignorance as I really don't get the message of this blog post (and quite a few comments above). \n\nPlease take the following as a pointer for my (mis)interpretation of this post: \n\nQ&amp;A is not a forum. This does not imply that Questions must be asked properly at each instance and should not be edited/waited for the OP to reformulate it(as the required style evolve over time)\n\nThis also doesn't imply that Answers must be correct. It only needs to be a concrete answer (satisfying some basic conventions) and if it is wrong it is downvoted or simply gets refuted by comments/counterexamples/edits etc. \n\nI can't see how rudeness comes in with a self-sustained validity (which is as far as I understand argued by your post). \n\nIf you consider being a little too terse or not being pedantic enough as rudeness than I do agree that it can be tolerable and depends on the user. But if you take the obvious misbehavior and insult which are the currency of mr-know-it-all types, then I really think that this post is doing more harm than good as it can be taken falsely as a validity or even get-outta-jail card for sustaining the nerd anger towards people not knowing a particular thing. \n\nOne should always remember that asking a question on a SE site is declarative enough that the OP does not know that particular detail (assuming that OP is also not a mr-know-it-all)."}, {"author_name": "tim", "gravatar_hash": "94a0e83767dbc71db135454693540015", "author_url": null, "date": "Aug 08, 2012", "message": "I used to use SO daily.  I was even on page one at one point within the first year.  \n\nI rarely visit any more.  \n\nThere are many reasons\n\n- the smugness of the moderators\n- the sea of crappy questions and answers\n- the rampant closing of questions and answers that are far more interesting and useful to real professional programmers than the \"correct type\" of Q&amp;A.  \n\nSO has turned into a swamp of mediocrity.  I can still find answers here - bu only when I google for them and SO comes up.  It is no longer a site I browse for an hour or two like years ago when I could look at questions and answers during lunch or compile times and actually learn something or answer other people's questions.  \n\nI never thought I would say that I miss the days of Rich B.  But I do.  This current version of SO is a real turn off and if i ever come across it I usually leave as soon as I finish finding some piece of information.  \n\nIt's hollow and has been taken over by moderators and the amateurs.  I suppose it was inevitable.  It is/was hugely successful.  It's supposed to draw and retain experts and neophytes alike.  But that is an impossible thing to maintain IMO.\n\nAnd to shog9 - Thanks for insulting us.  Though I know it was just a tactic to try to copy some other folks who shock and hold people's attention.  Unfortunately for you it doesn't work well.  It works for Joel.  But not you.  You're not Joel."}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Aug 08, 2012", "message": "@Tim I think you do hit on an interesting problem that the team and community should work on imho. \n\nThough I would not phrase it \"swamp of mediocrity\", I would phrase it a \"swamp of obscurity\". Over time, all (in the hyperbole sense of all) good questions have been asked. Now we are left with a huge amount of  obscure questions and there is an influx of newbies. \n\nIt is fascinating to compare what is now, with what was then. \n\n- http://stackoverflow.com/questions/tagged/sql-server*?page=1454&amp;sort=newest&amp;pagesize=50\n\nvs \n\n- http://stackoverflow.com/questions/tagged/sql-server*?page=1&amp;sort=newest&amp;pagesize=50\n\n\nTake a bit of time work a few pages on both ends. \n\nThere is a pattern. \n\n- I find the current questions have much poorer titles (makes sense, have not been around for too long) \n- I find the current questions WAY more obscure\n- I find the current list much more daunting to work through\n\nI don't know what the exact solution is but I think we need to start thinking about making Stack Overflow more interesting to browse. We also need to place more weight on the huge job of cleaning up our old stuff and cleaning up our new stuff, who knows maybe highlight a few interesting questions that need love from the back catalog every day (yes I know we have bounties) \n\nPersonally I think this whole \"summer of love\" thing is merely attempting to address a possible symptom of the illness instead of addressing the illness itself."}, {"author_name": "Viren", "gravatar_hash": "52a56a04b26ddc03d3c4990112db08b6", "author_url": null, "date": "Aug 08, 2012", "message": "I used to hang out on SO a \"LOT\", more for fun to have discussion on various c++ topics. I don't visit SO that often now, but I must say this site really has some very brilliant programmers, and rare sometimes that I visit browsing the questions of my interests, is because of those brilliant guys. I would really not give it a s*** if they have been jackass or not, as long as the answers keep coming from those top-slot programmers :)"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Aug 08, 2012", "message": "@Sam hits the nail on the head here - there's no putting the genie back in the bottle. A site that's getting 6k questions a day is gonna feel quite a bit different from a site that gets that many in a week. \n\nYou can't wish your way back to '08, and you can't social-engineer folks  on a large site into behaving like a small one. And frankly, I wouldn't want to. \n\nIMHO, the best way to think about the Stack Overflow of today isn't a single, cohesive community - it's <a href=\"http://meta.stackoverflow.com/questions/122900/visualisation-of-stack-overflow-tag-relationships\" rel=\"nofollow\">dozens of interconnected communities</a>. Recognizing this, and keeping pace with our tooling, is the way forward."}, {"author_name": "Yannis Rizos", "gravatar_hash": "a610732cb6ac525c26ff5bcfa9433f41", "author_url": "http://programmers.stackexchange.com/users/25936/yannis-rizos", "date": "Aug 08, 2012", "message": "@shog9\n\n\"You can’t wish your way back to ’08, and you can’t social-engineer folks on a large site into behaving like a small one. And frankly, I wouldn’t want to.\"\n\nWell, isn't that exactly what we are doing with SE 2.0 sites, small (comparing), laser focused communities? Perhaps Stack Overflow has become to big for its own good, and we should start thinking whether we should be breaking it up into smaller, laser focused and nicer SE 2.0 sites. Even Programmers, with all its past (?) troubles and discontent is a much nicer place than Stack Overflow."}, {"author_name": "Lane", "gravatar_hash": "f8f9c046a123c9de2a32d2da9e905d39", "author_url": null, "date": "Aug 08, 2012", "message": "I'm new to SO. I've asked a couple of questions and found people helpful, on the whole. But after just these few questions, when I get ready to ask a question on SO, I brace for the response. \n\nI get good responses; I also invariably get ignorant people telling me my question has already been answered and linking to questions that don't address my issue; and rude people who tell me to \"Google it\" or \"have you heard of the API, you should try it\" and similar. \n\nMy solution is to toss these people's snotty attitudes on the trash heap before posting. I do read their messages; once in a blue moon they have something useful to say. No point filtering out good information along with asshole attitudes. But I usually find that the more knowledgeable users are helpful, encouraging, and courteous. A little humility and a lot of knowledge go together surprisingly often in SO."}, {"author_name": "AurA", "gravatar_hash": "f14a54a0a73271e46b96c17f8fc127ed", "author_url": null, "date": "Aug 08, 2012", "message": "@Vegard Haugland \n\nThere should have been a like or +1 button next to the comments... your comments surely deserves a like."}, {"author_name": "Benjol", "gravatar_hash": "501465a53bf1042de206d7d79cc68942", "author_url": null, "date": "Aug 09, 2012", "message": "@Shog9, \"How to think about Stack Overflow\". That would make for an interesting blog post or meta question! Reading through comments here and on previous posts, it's clear that there are a lot of different, and conflicting, representations of what SO is, or should be. And as you imply, quite a few of them, though completely understandable, are unfortunately unrealistic nostalgia.\n\nFor me, right from the start, and to this day, Stack Overflow is <strong>a place to get answers to my programming questions</strong>. Kind of obvious, you might say.\n\nBut with time it also became <em>a place to try and help others, by answering their questions</em>.\n\nAfter a while, I got to 2K, and questions were getting harder to answer, so I got interested in a more curating role. Review had me hooked for a while too.\n\nNow, to be honest, as Sam says, I just feel swamped by the number of questions that are either:\n\n- too obscure for me to even attempt answering\n- already answered\n- totally naff\n\nAnd the combination of volume &amp; low quality also makes reviewing and editing daunting (or soul-destroying) too. I'm not sure how SO mods cope to be honest.\n\nIt seems inevitable to me that with time, more and more emphasis will have to be put on curating existing content and culling new duplicate content. The challenge is to retain people's interest.\n\nFrankly, I'm not sure that there is much more in the way of technical solutions than what we already have for:\n\n- detecting duplicates before they're even asked\n- discouraging 'bad' content\n- providing curating tools.\n\nYannis' idea is <strong>very</strong> interesting (breaking SO up into smaller, human-sized sites). Definitely worth a meta question...\n\n(By the way, I take back what Tim said about you and Joel :)"}, {"author_name": "SoboLAN", "gravatar_hash": "8feac14b86e6408e19694122993e7935", "author_url": null, "date": "Aug 09, 2012", "message": "All the problems you people mention have one fundamental cause: SO's size. It's just too big. Too many users asking too many questions. If the increase rate continues this way, SO will be crushed under its own weight. The Q&amp;A concept of the site gives it a nice solid foundation... but even diamonds have breaking points.\n\nThe idea of splitting it into smaller SE sites is probably the best option at this point."}, {"author_name": "periklis", "gravatar_hash": "d0268404afae44a5d176d1d8144bca1d", "author_url": null, "date": "Aug 09, 2012", "message": "Completely off topic here, but I see many people being tired with duplicate questions. Personally, I don't mind them. After all, the same question answered back in 2012 might have gotten a different accepted answered than if asked in 2009"}, {"author_name": "Joshua Flynn", "gravatar_hash": "f80d9f8a385a61e23b14dcc6dfcd1c99", "author_url": null, "date": "Aug 09, 2012", "message": "@Ben Brocka \"did you and I read the same blog post\"\n\nYes. But my comment was directed to the specifically quoted comment highlighting the fallacy in the strawman argument presented. A commentary response for the entire post is not necessary (and would add undue length). If you find my conclusions are in agreement with the post's conclusion, then I don't think there's a problem.\n\nMy issue with the quote, not the post as a whole (which strikes me more as rhetoric than an argument). The quote being that niceness does not equate to misleading information. Unless the point presented in the quote was an absurdum (in which case I failed to spot), but either way would mean the point concluded is that niceness/rudeness has no relation to validity or truthfulness of a statement. If it wasn't an absurdum, it has to be pointed out you cannot tar niceness with a misrepresented argument that it somehow leads to misinformation (I find misinformation comes from hostile/lying individuals in my personal experience)."}, {"author_name": "Joshua Flynn", "gravatar_hash": "f80d9f8a385a61e23b14dcc6dfcd1c99", "author_url": null, "date": "Aug 09, 2012", "message": "Correction, comment should say \"The quote being that niceness does equates to misleading information\"."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.stackprinter.com", "date": "Aug 09, 2012", "message": "From my point of view SO/SE, since my first login in 2009, has not really changed so much:\n1. I'm still learning a lot of good stuff\n2. I'm still answering and hopefully helping people\n3. I'm still asking questions and get useful and professional answers\n\nthis platform is incredible and I'm still amazed to see how many features Stack Exchange offers compared to other kind of sites; it's like comparing a space Shuttle with a Fiat 500 (with all the respect to the glorious Fiat 500).\n\nFor all the \"ooh the good ol' days, SO is not good anymore\" nostalgic comments; well, I really don't get your point; as I said, I'm still enjoying to be part of Stack Overflow and Stack Exchange and still pushing people to try this network for all the amazing things it offers.\n\nNow, for the Jackass part..\nI consider myself a nice guy, why?\nBecause I use every tool this network offers me to make you understand you should improve to be part of Stack Exchange and I have a lot of weapons at my disposal; try to do the same things on a PhpBB board!?\nSo, fear me because I'm a nice guy as I will not offend you with a rude comment, but you can bet I will downvote your question automatically if I see it's total junk.. and naturally I'm expecting to get the same treatment if I fail.\n\nIn a nutshell \"Never stop learning\"; learning to be a better programmer, dba, scientist, cooker or whatever your want  BUT also learning to be less jackass and more a nice guy."}, {"author_name": "Sean", "gravatar_hash": "9f2d68f3e0994f5cece203172d32bee3", "author_url": null, "date": "Aug 09, 2012", "message": "Does this article discourage pointless squabbling and ranting or does it reinforce it?"}, {"author_name": "Said Bakr", "gravatar_hash": "514282a0d59ecd870e402df9c035a2d2", "author_url": "http://quran.2index.net", "date": "Aug 09, 2012", "message": "Believe me, I could not able to believe that it is not a forum! It is a modern forum with competitive environment."}, {"author_name": "Dan dan", "gravatar_hash": "63ac1789b5abb4bbe49709443b811337", "author_url": null, "date": "Aug 09, 2012", "message": "I've been developing professionally for 15 years.  When I google a problem, if I see a SO article in the results, that's the one I go to first.  \n\nThanks for the site, guys.  I'm surprised to hear so much discontent."}, {"author_name": "Ross Judson", "gravatar_hash": "88392d0eff82357d3d22e2bc616f1883", "author_url": null, "date": "Aug 09, 2012", "message": "I'd like to see the stats on \"question closing\". Years back I hardly ever hit a closed question. Now I hit them constantly, where \"moderators\" close questions that are well-written, precisely target a particular situation, and are _exactly describe_ a situation I am encountering. And if I'm encountering it, so are a lot of other people.\n\nIs there some kind of prize for closing questions? The reasons provided are flimsy. \"Duplicate?\" - you should only be able to close as duplicate by providing the duplicate. Not general enough? That's purely a subjective call. The one that bothers me the most is locality -- geographic, temporal, whatever...here's the thing: We all live in a PLACE, and exist in a TIME. I've seen questions closed because they're specific to a region, like frickin' North America. I've seen questions closed because they relate to a new release of a product, and are presumably being closed because that release won't be new any more, at some point in time. \n\nIt's a \"who watches the watchers\" question, of course. If enough people upvote a question after it closes, it should trigger a deduction in reputation against the moderator who closed it. You trigger happy bastard; you wielder of tiny stinging power. ;)"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 09, 2012", "message": "\"And to shog9 – Thanks for insulting us. Though I know it was just a tactic to try to copy some other folks who shock and hold people’s attention. Unfortunately for you it doesn’t work well. It works for Joel. But not you. You’re not Joel.\"\n\nAmen to that, prime example: http://meta.stackoverflow.com/a/125776/138999\nWhy does everything have to be a joke or an insult?  \n\nNotice the reoccurring topic of why people do not come on the site any more: \"Moderators\".  They are one of the prime reasons behind me starting to use the Microsoft programming forums.  Heaven forbid you post on Meta where all the moderators are just waiting to down vote you.\n\nWhy are the moderators no longer re-elected?  I asked that in the previous blog and R Harvey mentioned that moderators retain their position.  That's a big disappointment to not only me but most of the SO / SE network users."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 09, 2012", "message": "Agreed, Shog9 isn't Joel...Shog's funny.\n\n@Joshua Flynn \"But my comment was directed to the specifically quoted comment highlighting the fallacy in the strawman argument presented. A commentary response for the entire post is not necessary\"\n\nThat's just not seeing the forest for the trees. You're claiming the article is making a point it's clearly not by equating \"X is bad even if Y\" with \"X is always bad because of Y\"."}, {"author_name": "hugs", "gravatar_hash": "4434bc740d9c1f18691bb475ba6a2431", "author_url": null, "date": "Aug 09, 2012", "message": "SO is the new Lisp. \"We do it the correct way. The reason you're complaining is because you don't understand how good it is. Most programmers just aren't smart enough for what we have to offer.\"\n\nIt used to be that you could recommend SO to newbies. These days you have to study the laws of SO and pass a licensing exam just to ask a question that doesn't get closed (and even then, if you're not an insider, the odds are good it will be closed anyway). \n\nA site that requires you to learn how to ask good questions is broken. I'm sure as heck not going to recommend SO to newbies. \"Why don't you go ask that question on SO. They won't give you an answer, but they'll tell you why your question doesn't fit their format, and why it's a good thing that it doesn't.\""}, {"author_name": "demongolem", "gravatar_hash": "ec38956e1d2383fd9fd363460de1052c", "author_url": null, "date": "Aug 09, 2012", "message": "I really don't think there is a problem with lack of niceness, or at least that is not how I would put it.  There are lots of nice people, even with all the gamers out there.  The problem is that SO has become so large over time (by that I mean the population of questions and answers) that entropy is starting to take over.  There are plenty of cases where question A was flagged or closed or deleted but not question B when they are exactly the same style and/or content.  It is an issue of perceived fairness.  There are too many examples contradicting all the stated rules and FAQs.  So a user gets downvoted and they start crying because they find an example where someone else got highly upvoted for the same thing.  We need to convince the world that we are fair, not nice."}, {"author_name": "Ima Walkman", "gravatar_hash": "468d08a3c884fe96850e09bf48770927", "author_url": null, "date": "Aug 09, 2012", "message": "That should say Yoda."}, {"author_name": "Dan dan", "gravatar_hash": "63ac1789b5abb4bbe49709443b811337", "author_url": null, "date": "Aug 09, 2012", "message": "Re-reading my last comment, I guess I stumbled on the nerve of the problem:  when I have a programming problem, I go to Google first, THEN SO.  \n\nWhy not SO first?  I would have to wade through too much crap to get what I need - that's just what works for me.\n\nAnd yeah, the tone has gotten snippier, but I figure the site is *useful* and free, so it's pretty hard to complain.\n\nAnd yeah, that Yoda-Dumbledore-Gandalf spoof is funny - it will (and has) spark the reaction it is desinged for!"}, {"author_name": "DragoonWraith", "gravatar_hash": "aa34c79c1de55411f1e903201dc4a0ac", "author_url": null, "date": "Aug 09, 2012", "message": "I find the comments about how easily questions get closed bizarre. I don't run into closed questions that often, my own questions have never been closed, and I had absolutely no trouble asking my questions right away. I just followed the rules for posting technical questions *anywhere* on the Internet: I did as much research and tried as many of my own things as I could before posting, I included as much information as I could think of, etc. etc. Never a problem.\n\nHaven't been here long, don't know about the \"good ol' days,\" can't speak for anyone's experience but myself... but I've never seen any of the problems discussed on this page."}, {"author_name": "Ryan", "gravatar_hash": "0ada4779ddf93ef13f4c1eb2656a4912", "author_url": null, "date": "Aug 09, 2012", "message": "I can remember a time when asking questions without proving you had tried a problem would result in some backlash for not putting effort in.  Then a shift occurred where some individuals wanted to be the person that came up with the answer first and support forums got filled with information that had no real bearing on the original issue.  It's great to see it swing back towards the earlier more succinct manner of answering questions, while still encouraging new or stuck technical folks in a collaborative manner."}, {"author_name": "Eran Galperin", "gravatar_hash": "5e36abec748829e65ebb6754ac8b8641", "author_url": "http://www.techfounder.net", "date": "Aug 09, 2012", "message": "Civility is one thing, but the recurring problem with moderator over-zealousness is disturbing. I have 30k rep, most of it from 2 years ago when I was actively participating. \n\nRecently, several of my answers were deleted without any prior notice or explanation, and I can see who deleted it because I have full access to the moderator tools. I don't even bother finding out why at this point, as I pretty much lost faith in the system here.\n\nA friend of mine who got on the site to answer some questions while doing some self promotion at the same time, got his account removed and all his answers deleted. He did nothing wrong, but the moderator obviously felt otherwise. After some intervention from higher ranking mods, his account and some answers were restored, but not without some seriously bad vibe being thrown all around. Read carefully this meta discussion that eventually restored his account (all the comments and answers). Ironically, it was also closed as too localized...\n\nI really feel there are too many mods currently, and it shows in the speed in which valid questions are closed. Maybe adjusting the rep needed to close questions relative to the amount of rep available to the some kind of percentile of the user base to mitigate that, could help."}, {"author_name": "Eran Galperin", "gravatar_hash": "5e36abec748829e65ebb6754ac8b8641", "author_url": "http://www.techfounder.net", "date": "Aug 09, 2012", "message": "Of course, I forgot to leave the link to the meta discussion... \n\nhttp://meta.stackoverflow.com/questions/131777/account-deleted-without-notice"}, {"author_name": "Anurag Kalia", "gravatar_hash": "a4241058362ec3e5178d141098151e10", "author_url": null, "date": "Aug 09, 2012", "message": "As a true newbie, SO has always been very very useful for me. Though the opportunity to ask questions is severely limited, I never felt bad for it. I have somehow always found answers to my basic question. That alone makes it valuable as gold."}, {"author_name": "Greg", "gravatar_hash": "474c46d1aad090d1a957ce8d2da1f6f8", "author_url": null, "date": "Aug 09, 2012", "message": "\"some individuals wanted to be the person that came up with the answer first \" -- I, as a new user, don't have much choice. I can barely contribute unless I ravenously try to answer some questions first. This can't be the goal of those policies, but it certainly seems to be a side effect."}, {"author_name": "smcg", "gravatar_hash": "bbab45b9f6849af84b6d6a479192fcb2", "author_url": null, "date": "Aug 09, 2012", "message": "This is sort of inevitable. The goal of SE sites is to have 90%+ traffic coming from search engines. Implicitly the goal is to have such a large bank of questions and answers that asking a new question should be uncommon compared to searching for an existing one. Of course, that doesn't really stop people from asking them anyways... so they get closed, marked as duplicates, etc. Having a warm, friendly community is going to be antithetical to generating a lot of traffic."}, {"author_name": "posdef", "gravatar_hash": "325b265776ae0bc44fd509781b2f270b", "author_url": null, "date": "Aug 09, 2012", "message": "I dont know if it has been mentioned before (haven't read all the comments so far) but I still think that SO is the \"nicest\" place of all the SE sites I participate in. When I discovered the rest of the SE, particularly the betas, I wanted to contribute to a number of betas that cover my interests. \n\nHowever it has come to a point where I realize that the time and effort put into some of the sites are clearly go unappreciated which is not something I feel good about. I think people (not only the mods) tend to get over-zealous with close votes, and interpreting things in an utterly inflexible way. This will ultimate damage the community and the reputation of the sites."}, {"author_name": "Tetra", "gravatar_hash": "d0f55d91af61043cb55771e00c0a4358", "author_url": null, "date": "Aug 09, 2012", "message": "My inability to more actively participate in the community without completely putting myself out there with a question I'm worried is going to get shot down by the community, the mods or just be ignored doesn't compel me to use SO. There are a lot of questions Google doesn't answer, and has been said upthread, the state of the web changes so often that even a similar post 6 months down the line may yield better results. Most of the time when I find an answer anymore -- particularly with CSS issues -- it's outdated and there's no way to flag it as currently incomplete or mark a much more recent answer that's still at the bottom as the new correct one. I've learned through reading enough posts that attempting to start a new thread on the topic will just embarrass you, so I don't bother.\n\nAdditionally, I can't add a +1 if I'm having the same issue as someone, I can't clarify with the OP to ensure that our problems are the same and try to work together to solve it ourselves and I can't correct wrong answers without going against the rules and writing my comment as an answer. I'm basically left in this suspended state despite having an account for x amount of time, and that leaves a sour taste in my mouth. \n\nParticipation doesn't necessarily mean you know what you're talking about and perhaps the influx of dupe threads and general 'stupid questions' is less about the community and more about how hard it is for new users to actually use this site without taking the two biggest plunges first (asking and answering). I'd like to be able to contribute where I can and be rewarded for those contributions so that I can display my badge with honor while learning a thing or two through engagement. When I'm ready to ask a question, I will, but let me participate elsewhere to prove I have some clue of what I'm talking about and so that I can get a feel for the community before I get butthurt over my post being deleted or being treated like an idiot."}, {"author_name": "Chris", "gravatar_hash": "bfb2604d0ba17ca948b69df61718a2d4", "author_url": null, "date": "Aug 09, 2012", "message": "I honestly think this site is a extremely valuable programmer's resource, but as with anything else out there, it needs a lot more work. I understand that we're a bunch of jackasses, but seriously have any of SO's admins combed through a majority of the answers on there? If they did, they would discover a lot of misinformation, and for those in serious need of a good helping of reality, misinformation has no place in any venue of Information Technology. I don't get why I can't down vote on a particular lousy answer until I have a 125 reputation. I have been using this site for 3 years, and I still have only a 21. FTW?!?!?! That model needs some serious rethinking, because to have to meet such an absurdly high bar, is not a very democratic process by which to measure quality. The answers for the most part are just not quality. They are a convenience for someone to up their reputation, and thus you're filling SO up with a lot of hollow information. I had, for instance, a guy attempt to answer my question, and after about 12 or so rounds of replies, he ended up asking me my own question with his answer. Really all that guy did was nothing at all, yet he has a 652 reputation. He didn't even answer my question!!!!! Yet he seeks my up vote. If I ask a question, and it's not appropriately answered, why can't I down vote on my own question????"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Aug 09, 2012", "message": "For those folks claiming that moderation is destroying Stack Overflow:\n\n1.  Post your claim on Meta, and\n2.  Cite specific examples as proof\n\nOr it didn't happen."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 09, 2012", "message": "To clarify, \n\n1.  Moderation in this context means community action, not just diamond moderator action.\n\n2.  Posting on meta allows the community to provide clarification.\n\n3.  Make your post on Meta informative, and not just a rant."}, {"author_name": "Superstringcheese", "gravatar_hash": "4d5881813443cf89e2f7126ff3e335c4", "author_url": null, "date": "Aug 09, 2012", "message": "It seems incredible to me that some of the smartest people on the internet need to hold multiple, mind-numbingly long, pedantic flame wars about how to be simultaneously informative and civil. These are skills most people are able to master in grade school."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 09, 2012", "message": "&gt;&gt;\"For those folks claiming that moderation is destroying Stack Overflow:\n\n1. Post your claim on Meta, and\n2. Cite specific examples as proof\n\nOr it didn’t happen.\"\n\nWhy so you and all your pals can close it as \"not constructive\" or some other meaningful bs."}, {"author_name": "Systembolaget", "gravatar_hash": "61b736bf758b20c7d106e8d4d884278d", "author_url": null, "date": "Aug 09, 2012", "message": "Active since only a few months, I feel it's mostly a matter of being overwhelmed by the information overload. Too many similar questions. Too many obscure \"help me, it's not working\" type questions. Too few questions with a fiddle or link to a sandbox. Too few questions that are aware that the community can't read the questioners' minds (yet).\n\nTo reduce the clutter of actually linked (similar) questions, couldn't there be some way to pack those off to a cluster algorithmically? Some kind of tree structure becoming more and more specific? Filtering for questions and answers encircling one's own topic is easier done in Google, I find."}, {"author_name": "hugs", "gravatar_hash": "4434bc740d9c1f18691bb475ba6a2431", "author_url": null, "date": "Aug 09, 2012", "message": "@Robert Harvey There are better ways to waste my time. I'd just get downvoted and told there's no problem. Besides, Joel's heard it many times, and since he knows everything (as he likes to point out), things aren't going to change.\n\nBut thanks for posting a message that perfectly demonstrates what's wrong with SO:\n\n1. \"I can tell you what to do and you have to do it because I'm one of the cool kids.\"\n2. You have to follow an elaborate set of rules that the insiders make up so they can feel powerful.\n3. You have to put yourself in a position where the insiders can humiliate you if they want.\n4. Following the rules is the highest priority.\n\nI know you like the feeling of power, but guess what - you don't get to call the shots. Feedback in the comments on a blog post on this topic is what you're getting. I don't really care if I'm not following your rules.\n\nSO is done. There was a time when Digg was a big deal. They thought they knew better than the users too. They weren't interested in feedback. You might want to see how that's working out for them."}, {"author_name": "Just another noob", "gravatar_hash": "c7b021bc854fce0f3c3f970d2ae3329c", "author_url": null, "date": "Aug 09, 2012", "message": "The problem is that\n\n\"...we’re here to share the knowledge of our craft\"\n\noften this does not happen because\n\n\"...convinced you to clarify what you were asking, and calmly pointed out your misconceptions before pointing you to a solution\"\n\non average the first three people to answer just point out the shortcomings in the actual questions and don't care much about actually pointing anyone towards a solution.\n\nThat's why the first search results in google are never good enough, the questions are asked in a way someone who does not know the answer would ask a question, and the answers are given in a way to make clear to everyone that the person answering knows what would help, but prefers to be a jerk. Haven't seen a forum where this behavior does not exist, though in some it seems to be more common than in others."}, {"author_name": "THenrich", "gravatar_hash": "886427a445a180eb6618d77ee4ec4894", "author_url": null, "date": "Aug 09, 2012", "message": "I don't like the people who close beneficial questions so quickly. To me, they are jackasses. I am being honest."}, {"author_name": "Matt", "gravatar_hash": "db157f5dda9a08b97c28282e12d350b0", "author_url": null, "date": "Aug 09, 2012", "message": "A lot of the comments above are negative so just for the sake of balance I am going to say that SO is a fantastic site where I a) Have had many of my own problems solved, esentially getting $150/hr consulting support for free, and b) have answered a few dozen questions of my own, honing my expertise in doing so. And now with Careers 2.0, a few employers have looked at my profile with virtually no effort on my behalf.  If you have a problem in being required by experienced SO users to put in some effort to clearly state your question, or to do minimal research before asking, well, that's really your problem and not SO's, and a little snarkiness is what you can expect and may deserve in extreme cases.  The only minor issue I have is with blog posts like these--I mean what are they supposed to accomplish?  Will even a small fraction of the people to whom it is directed actually read it?  I mean come on guys, we all have coding to do. :)"}, {"author_name": "Mr Man", "gravatar_hash": "dbe95b4069a05420ef606bad1cdb22aa", "author_url": null, "date": "Aug 09, 2012", "message": "Assaf is right. I've been on this site for a while now (nearly three years), but it's come to the point where it's like YouTube commenters have been given permission to run the place. Asking a question here (or on any SE site) should NOT be a source for pain... And yet it frequently is.\n\nThere seems to be a sort of Nazi league that enjoys finding fault in anything posted -- even when there's nothing wrong. If you catch their attention then, by God, you're in for a struggle.\n\nI once had a question moved as \"off topic\" from SO to SU to SF, and eventually back to SO. Jeff literally had to step in. It was ABSURD. (The question, he confirmed, was within the scope of SO, and should never have been voted otherwise.)\n\nHow does this happen? I've been asking this for a while now, but it's been falling on deaf ears.\n\nThe fundamental problem with SE sites (and the reason they will continue to degrade until something is done) is that moderator powers are given to people as a reward for their knowledge -- NOT for having good moderator skills.\n\nOddly enough, and perhaps this is just me, but I don't find that those with the most knowledge always have the best social skills. In fact, it's usually the opposite.\n\nCommunity management, in all its forms, is a particular skill. It requires patience, understanding, and excellent communication skills. Not many people are suited for it, and yet this is a community (of sorts) which hands out those powers to just about anyone.\n\nIt's no wonder that getting an answer to your question can be so painful.\n\nSE sites have revolutionized Q&amp;A sites and forums, no question. They're a brilliant and logical progression on the internet, but they need to KEEP evolving.\n\nThe point of this blog post is to remind everyone that the focus of SE sites is INFORMATION, and I completely agree. Sadly, it's overzealous moderation by ill-suited members that is making this information exchange become a painful and personal experience. You might argue that this is the best way to ensure only good content is created and maintained on SE sites, but it overlooks two important issues: \n\n1. New members need to be eased into this style of site, and the culture to expect here. (It's still new to people, after all.)\n\n2. We're people, not machines. As much as the focus of this site is information, we can't forget that."}, {"author_name": "Dave", "gravatar_hash": "291b985ca458548b068092019def5de1", "author_url": null, "date": "Aug 09, 2012", "message": "Hmm, seems to be niceness is always good.  I've seen many good posts down voted.  If there is a problem with a post, it is not hard to politely inform the person.  It's easy to be nice and informative at the same time.  Sorry if that sounds unfun or pollyannish -- it's just the truth.  Some people just like to be rude and fight others who are nice because it makes them feel like they are the alpha dogs or whatever, I just don't see that as necessary here."}, {"author_name": "Annoyed", "gravatar_hash": "ee91a15f03a3ecd9b83982c19f058325", "author_url": null, "date": "Aug 09, 2012", "message": "@Robert Harvey\n\nTell you what, dude. Put your money where you mouth is. Start a new account, and only use that for six months. That's right. Start with 1 reputation, and don't let anyone know who you are.\n\nYou can't sit in your ivory tower and tell the rest of us to shut up and eat cake. The site has changed since you signed up. It's no longer the place it was three years ago."}, {"author_name": "Matt", "gravatar_hash": "db157f5dda9a08b97c28282e12d350b0", "author_url": null, "date": "Aug 09, 2012", "message": "Mr Man  Your distinction between knowledge and moderator skills is well-taken, but bow do you propose to quantify the latter?  That's what this comes down to--reputation, by construction, is a nice single number, which makes the whole privilege system possible.  How would you do this for moderator skills, or otherwise do this algorithmically?"}, {"author_name": "Mr Man", "gravatar_hash": "dbe95b4069a05420ef606bad1cdb22aa", "author_url": null, "date": "Aug 09, 2012", "message": "I wish I had the answer! This appears to be the source of a problem, though. I'm sure a group of smart people might be able to come up with a solution to it."}, {"author_name": "disgruntled SO user", "gravatar_hash": "3ac8adefb2612fcb1ab4eda71d96cf46", "author_url": null, "date": "Aug 09, 2012", "message": "Was the title starting \"Stackoverflow is not...\" a piss-take? Aren't you the one who summarily deleted the question \"Stackoverflow is not...\" over on meta? Judge, jury and executioner. The biggest problem in the SO Community is that \"community\" is being replaced with \"benevolent dictatorship\", and the \"benevolent\" is wearing thin. Snap decisions by those wielding too much power don't reflect community needs, they're just the decisions of people who mistakenly believe that \"they know best\". Much like US foreign policy."}, {"author_name": "Jeremy Banks", "gravatar_hash": "bd192f0a40308fe9ecb9aa2a72ee8d81", "author_url": null, "date": "Aug 09, 2012", "message": "@Annoyed\n\nI've started new accounts twice, to check just that. I only used them for a few weeks, but the only difference I noticed is that people seem to clarify points excessively, assuming that I might be a newbie.\n\nI know that at least a couple others high-rep users have tried the same thing.\n\nA 1-rep user who understands the rules and culture will be treated way better than a 2000 reputation user who doesn't."}, {"author_name": "shalomshachne", "gravatar_hash": "2014672faa0530abc886adf5725c5127", "author_url": null, "date": "Aug 09, 2012", "message": "\"If you aren’t actively trying to help someone learn, you’re not helping to defend the realm - you’re just being a jackass.\" \n\nI agree with this wholeheartedly. But I think vote downs and closes with no information are really not helping anybody.  Also some times the best answer is the one with the least votes. Democracy enforces popularity, not truth. It is far better to offer some constructive criticism than just to push a button and move on."}, {"author_name": "Annoyed", "gravatar_hash": "ee91a15f03a3ecd9b83982c19f058325", "author_url": null, "date": "Aug 09, 2012", "message": "One thing that's worth noting is that nothing is done for \"inflation\". A user could ask one good question. After a few years of not doing anything else on the site, they may have editor privileges, simply from the accumulated upvotes over that time.\n\nIn theory reputation is, at best, an estimation of your involvement with the site. Over time reputation increases regardless of that involvement, though. Are privileges being adjusted to compensate for this?"}, {"author_name": "Annoyed", "gravatar_hash": "ee91a15f03a3ecd9b83982c19f058325", "author_url": null, "date": "Aug 09, 2012", "message": "@Jeremy, A few weeks isn't enough."}, {"author_name": "Annoyed", "gravatar_hash": "ee91a15f03a3ecd9b83982c19f058325", "author_url": null, "date": "Aug 09, 2012", "message": "@Jeremy, Also, at 6K, you're still not really in the upper echelons. I wouldn't expect a huge different for such a low rep."}, {"author_name": "jadarnel27", "gravatar_hash": "d7344197e9c97b445893e3d4ed1fdea0", "author_url": null, "date": "Aug 09, 2012", "message": "@Annoyed Jeremy has nearly 18k on Stack Overflow (not 6k, that's on Meta), which is the top 2% overall.  That's not exactly \"low rep\".  \n\nAlso, how long is \"long enough\" to see how new users are treated?  If bad things don't happen during the course of a few weeks of regular use, is the problem really as severe as you say it is?"}, {"author_name": "Anna Lear", "gravatar_hash": "66c88a90c2bad25fd0eadd696e7a5f50", "author_url": "http://meta.stackoverflow.com/users/155160/anna-lear", "date": "Aug 09, 2012", "message": "@Annoyed: at 6k you can do quite a bit. Off the top of my head, you can close and reopen questions, edit anything except tag wikis without approval, upvote, downvote, participate in moderator elections, (theoretically) become a moderator, and have access to the suggested edits queue.\n\nThere are definitely users out there with tons more rep than 6000, but 6k's nothing to sneeze at either."}, {"author_name": "Jeremy Banks", "gravatar_hash": "bd192f0a40308fe9ecb9aa2a72ee8d81", "author_url": null, "date": "Aug 09, 2012", "message": "@Annoyed\n\nI'm 18k on SO. Not quite top-tier, but not far off. I'm 6k on meta, but I don't think that's what you were referring to. (There was another Jeremy commenting on one of these recent blog posts, perhaps you mistook me for him.) \n\nA few weeks probably isn't enough to get a complete perspective, but it was enough to reassure me that low reputation isn't a damning as many people say."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 09, 2012", "message": "@disgruntled SO user:\n\nI eagerly look forward to the moment when you take your frustration over to meta.stackoverflow.com and use it in a constructive manner, as opposed to posting hyperbolic rants on a blog page.\n\n\"Snap decisions by those wielding too much power don’t reflect community needs\" -- [Citation Needed]"}, {"author_name": "Annoyed", "gravatar_hash": "ee91a15f03a3ecd9b83982c19f058325", "author_url": null, "date": "Aug 09, 2012", "message": "@jadarnel and @Anna, I think you need to read my original post. All your answers are contained there. \n\n@Jeremy, Apologies for getting your rep wrong, Jeremy. If you want to insist that your experience was representative, that's a shame. It wasn't. I challenge any xxK user to time out for six months.\n\nIf you really believe rep doesn't make any difference, it shouldn't cause you any problems. Six months is not really along time, but I estimate that it's long enough to have at least one colossal taste of the current SO.\n\nProbably the most important thing is that you ask questions. That's usually where problems arise. Answers tend to be treated more kindly in my experience."}, {"author_name": "Annoyed", "gravatar_hash": "ee91a15f03a3ecd9b83982c19f058325", "author_url": null, "date": "Aug 09, 2012", "message": "@Robert, Are you trying to argue that such a thing has NEVER happened?? It appears that you are.\n\nI'm saddened that you are ignoring my challenge. I guess putting your head in the sand is the way you've decided to handle this situation. Shame :("}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 09, 2012", "message": "Do all of the disgruntled folks here know that there is a basic, fundamental framework that is the fabric underpinning all that Stack Exchange does?  And that asking for any change that substantially alters this framework (especially under the guise of \"that's not nice\") is likely to end in failure?\n\nSimple examples of things that are not going to change(mentally include the words \"that was not nice, and you are abusing your power, you despot; I'm going to report you\" after each):\n\n1.  You closed my shopping question.\n2.  You removed my answer that was just a link to my blog.\n3.  You edited my post.\n4.  You deleted my off-topic/off-color comment.\n5.  You removed my vague, unanswerable question even though I desperately need help\n\nThose folks who take a few minutes to get to know what we're all about do not generally have these problems, and it doesn't matter how much rep you have.\n\nOne more thing: ASKING GOOD QUESTIONS IS HARD, even for me.  We ask that you make the effort anyway.  Put more effort into your questions, and people will put more effort into their answers."}, {"author_name": "Mr Man", "gravatar_hash": "dbe95b4069a05420ef606bad1cdb22aa", "author_url": null, "date": "Aug 09, 2012", "message": "@Robert Harvey, Here's an example of snap decisions not helping the community:\n\nhttp://meta.stackoverflow.com/questions/88900/programming-environment-outside-scope-of-stackoverflow\n\nAs Shog9 (not Jeff, I misremembered) put it: \"Some over-enthusiastic users have replaced their brains with a few simple regular expressions.\"\n\nThese things happen. Telling people here who have experienced it first hand that they don't, isn't helping anyone, least of all SO as a whole.\n\nI'd personally like to see you take the suggested challenge. I believe it would open your eyes. Six months may be a bit long, but it's true that asking questions is where you encounter these \"over-enthusiastic\" moderators."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 09, 2012", "message": "Yes, mistakes get made. They get reversed, too (like the above cases). So? Ruining the entire system (never close anything) is hardly a solution to occasional errors in that system. That's classic burning down the barn to get rid of the rats."}, {"author_name": "Mr Man", "gravatar_hash": "dbe95b4069a05420ef606bad1cdb22aa", "author_url": null, "date": "Aug 09, 2012", "message": "@Ben Brocka, Nobody is suggesting that questions should never be closed."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 09, 2012", "message": "@Mr Man:\n\nThe example you provided is a counter-example: the questions linked in that meta post were restored.  The system works.  This is why we have review processes like Meta, and the Community Team which oversees the moderators."}, {"author_name": "Mr Man", "gravatar_hash": "dbe95b4069a05420ef606bad1cdb22aa", "author_url": null, "date": "Aug 09, 2012", "message": "It's also worth pointing out that the case was only reversed because it was brought up on META. Asking a question shouldn't be such a painful experience, especially when there wasn't anything wrong with the question. That's not a good thing for SE sites in general.\n\nOn the one hand Robert is asking for \"proof or it didn't happen\". On the other, when evidence is provided the argument is changed to, \"so?\".\n\nThere's apparently an issue here, given the number of people complaining about the same thing, so why doesn't anyone with a high rep actually care enough to investigate further?"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 09, 2012", "message": "That's what Meta is for.  That's why it is there, to provide a checks and balances mechanism for moderation (among its other purposes).\n\nThat's why it makes no sense to say that Meta is a waste of time.  It's there specifically to help people, and to provide a check against rampant moderator actions.  \n\nJust don't expect to go there and ask folks to turn the world upside down because you don't like the way things are run."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 09, 2012", "message": "If you have a problem with the way a post is handled (either by the community or by a moderator), you have (at least) three levels of appeal that you can use (should be employed in the following order):\n\n1.  You can cast a moderator flag on the post, and leave a detailed explanation of the problem in the Custom field of the flag dialog.  If it's about a specific moderator, they will generally defer it to a different moderator for review.\n\n2.  You can post a question on Meta, describing your problem in detail with specific examples, foregoing the rants.\n\n3.  You can email team#@stackexchange.com if the other two avenues have failed to produce satisfactory results.\n\nModerator decisions can, and do, get reversed, sometimes by the original moderator.  I've never seen anyone that was unfairly treated by a moderator, and the vast majority of appeal decisions are considered carefully, fairly and swiftly.\n\nNobody is going to be perfect, especially the moderators.  But we do the best we can."}, {"author_name": "Mr Man", "gravatar_hash": "dbe95b4069a05420ef606bad1cdb22aa", "author_url": null, "date": "Aug 09, 2012", "message": "@Robert Harvey, You seem to be side-stepping the issue at hand. A new user wouldn't even know about Meta, or what it was for, or how to go about addressing such problems. How many questions suffer similar fates that are never heard of again?\n\nI'm not saying I know the solution, but clearly many people are having this problem. What's worse, from what I can see, that number is growing.\n\nWhy won't you take the suggested challenge and see for yourself what SO feels like now. It's not the site I joined three years ago. Valid questions are downvoted without explanation. Questions that could be made valid with slight tweaks are closed, again, without explanation. And when explanations are given, they can often be terse, abrasive, and, ultimately, completely unhelpful. It's a hostile and hyper-critical environment; and given my first comment, it makes perfect sense as to why.\n\nModeration takes patience, understanding and excellent communication skills -- and that means in your reading, as well as writing. Giving moderation tools to people without these skills is obviously going to have ramifications.\n\nI don't believe it needs to be this way and, honestly, if I was forced to try and offer a solution, I would simply suggest education. Education for both new users, and education for when you gain a new privilege."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 09, 2012", "message": "***Why won’t you take the suggested challenge***\n\nBecause, as a mod, I already have the highest possible visibility over this problem.  I am keenly aware of the difficulties people have posting their first questions.\n\nI'm not sure what the ultimate solution to the educational problem is, but currently it's a gradual, ongoing process of improvement to the FAQs, the Just in Time education and direction codified in the website software, and better accessibility to relevant Meta information like the Meta [faq] tag.\n\nHow do people learn?  By asking their first question, stumbling over their own feet, picking themselves up, dusting themselves off, and trying again.\n\n***Valid questions are downvoted without explanation.  Questions that could be made valid with slight tweaks are closed, again, without explanation.***\n\nTwo years ago, Stack Overflow was literally collapsing under the weight of thousands of terrible questions: see http://meta.stackoverflow.com/questions/56817/can-we-prevent-some-of-the-low-quality-questions-from-entering-our-system.  \n\nIn response, SE instituted a machine filter that blocks the egregiously bad questions, and bans those who repeatedly manage to get through the filter and ask poor, off-topic questions. This process is completely automated.\n\nPart of this change was removing the 1 rep penalty for downvotes on questions; downvotes represent part of the equation used for the low-quality filters.  Now, my experience has been that if you disclose that you downvoted someone, you start an argument, so my downvotes are always anonymous.  \n\nThere's plenty of coverage on Meta about explaining downvotes.  The community consensus is that voting is anonymous, for many good reasons, and that users should not be compelled to disclose their vote, or explain their reasoning for their votes.\n\n***And when explanations are given, they can often be terse, abrasive, and, ultimately, completely unhelpful.***\n\nWhich is why I let the system speak for me.  The close reasons give detailed explanations about why a question is closed, and point the user to resources where they can learn how to improve their posts and get them reopened. \n\nBut really, a lot of this is common sense.  I asked a GTKY question a long time ago, when I first started using Stack Overflow, which was quickly closed.  I was a bit put out, but I got over it.  \n\nMore importantly, I was very careful to get to know the community and how it ticks before I asked my first question.  I did this by watching how other people interacted, how some questions got better responses than others.  I didn't know anything about Meta at the time, and I never read the faq; I just lurked for awhile until I was confident that I understood the community well enough to participate.\n\nIn short, I was respectful."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 09, 2012", "message": "Assuming being a 1 rep user causes closures is an absurd mix up of correlation and causation. High rep users don't ask non-closed questions because of their rep, they have their rep because they've used the system for a long time and understand what's on/off topic. Questions aren't closed because their users have low rep, they're closed more often because 1 rep users are almost always new to the system. I may be extending my logic too far here, but I'm going to go ahead and posit that people who haven't used a system are generally less familiar with it."}, {"author_name": "disgruntled SO user", "gravatar_hash": "3ac8adefb2612fcb1ab4eda71d96cf46", "author_url": null, "date": "Aug 09, 2012", "message": "The snap decision I was refering to was the removal by \"Sir Shogington the Ninth\" of the \"What SO is not\" question over on meta. Given the high prominence of this page, I think the title of it pisses in the face of those who thought the arbitrary and summary decision was heavy handed. It was made by a **single** person (line 1, http://meta.stackoverflow.com/questions/137795/why-what-stack-overflow-is-not-was-deleted), who then chooses to mirror the title of the removed post here. A case of \"only I, lord shog9 can post 'What SO is not' style posts? I will personally censor all other attempts.\" This doesn't instill me with faith that meta is a healthy place to operate, nor that a democratic process is being followed. I realize that further discussion of my grievance should best be followed up on meta, but am posting here to complete my previous statements."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 09, 2012", "message": "Some people seem to have left their irony detectors (and sense of humor) at home."}, {"author_name": "disgruntled SO user", "gravatar_hash": "3ac8adefb2612fcb1ab4eda71d96cf46", "author_url": null, "date": "Aug 09, 2012", "message": "Perhaps people have differing sets of motivations, hopes and desires to your own?"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Aug 09, 2012", "message": "@disgruntled: yes, it's a piss-take. As others have pointed out, Stack Overflow <i>is</i> a forum, though not in the \"Internet message board\" sense of the word. \n\n\"Stack Overflow is not a forum or discussion board\" was the title of one of the WSOiN entries, intended to be posted in response to answers that were:<ul><li>New questions.</li>\n<li>Requests for updates on old questions</i>\n<li>\"Me too\" commiserations</li> \n<li>\"Thank you\"</li>\n<li>Replies to other answers</li></ul>\n\nIronically, responding to an answer with a comment that doesn't directly address the problems in the answer is a very \"forum-like\" behavior... It brings to mind the cursory \"Read the FAQ\" responses common to newsgroups. \n\nFWIW, we're building specific, canned responses to all of the mistakes outlined above into our new review dashboard - as a direct result of discussion on Meta."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 09, 2012", "message": "Part of the hierarchy is that SE is the supreme court; they can choose to override the desires of the community, if they believe it's in everyone's best interest.\n\nIn my experience, they only do this rarely, after careful deliberation, thoughtfully considering and weighing all of the pros and cons.\n\nI was the one who originally created WSOiN.  While I didn't initially agree with the decision (I was in the process of attempting to improve its tone when it got deleted), I do respect the decision, and I understand that there is a larger picture to be considered."}, {"author_name": "Nicol Bolas", "gravatar_hash": "7b1af0a134b3cf0892025b0ec4ba65a9", "author_url": null, "date": "Aug 09, 2012", "message": "&gt; This doesn’t instill me with faith that meta is a healthy place to operate, nor that a democratic process is being followed.\n\nGood, because MSO is *not* a democratic process, and there should be no illusions about that. I'm not sure that MSO is a *process*, but whatever kind of process it is, it certainly isn't majority rule.\n\nUltimately, the people in charge will do what they feel is best. That's how SO has worked since the very beginning. There are many popular feature requests that are firmly denied with either no explanation or a heavily downvoted one. That's just the nature of the beast.\n\nIt should also be noted that it was a moderator who arbitrarily and summarily decided to *create* the page in the first place. So what is wrong with a moderator deciding that the experiment wasn't working out as planned? They created a resource, then realized that it wasn't doing what they'd hoped, so they deleted *what they made*.\n\nI don't understand the complaint. Oh sure, I loved the page too, and I'm not entirely convinced that curt links to various WSOIN answers constituted rudeness. But it was *their* resource to begin with."}, {"author_name": "Jeremy Banks", "gravatar_hash": "bd192f0a40308fe9ecb9aa2a72ee8d81", "author_url": null, "date": "Aug 09, 2012", "message": "@Nicolas Bolas\n\nYour post seems to imply that it was deleted by the same group that created it, but that isn't true. Robert Harvey, who created it (and contributed many entries), is a community-elected moderator. Shog9, who deleted it, was a company-hired employee.\n\n(I don't object to what happend. I just wanted to clarify.)"}, {"author_name": "Mark G", "gravatar_hash": "f620f4647fb816073c9152a284245e64", "author_url": null, "date": "Aug 09, 2012", "message": "If some of the people on SO would remember that this is a place to help other rather than providing vague and sometime snarky responses to questions more people would contribute."}, {"author_name": "Cameron Chapman", "gravatar_hash": "e8bac4585e4a82cd109f9b5e770b5968", "author_url": null, "date": "Aug 09, 2012", "message": "I personally think the fact that people might worry about getting a negative response after posting a question positively impacts the questions that get asked.\n\nI make sure to do my research before i ask a question for fear of being ridiculed by the SO pros and my programming is better for that research. I've almost always able to find the answer to my question (90% of the time on SO).\n\nI think SO is an invaluable resource and think people need to be as willing to take the invisible online criticism as they are to dish it out when they see fit.\n\nIf someone calls you an idiot for your question, they're probably a jerk and you probably could have found the answer before you asked it."}, {"author_name": "StackThis", "gravatar_hash": "3ff316ce5af4025bce1db75004d70123", "author_url": null, "date": "Aug 09, 2012", "message": "I agree with a lot of people here. Especially most of what Assaf said in the 8th comment. As well as what Hugo said:\n\n\"While the SE sites are well designed around our human nature, the one thing they fail to address is the fact that asking a good question is very difficult. Not only is it a learned skill that SE does little to teach. It’s also impossible to anticipate everyone’s emotional reactions to it. Or how they’ll misread it. Or how they’ll try to answer a different question, or re-define your problem. In fact, the more you try to anticipate these things, by adding lots of additional points to the question, the more they’ll fail to read everything, and the more problems it will cause.\"\n\n\nNearly all the reasons a question gets closed/downvoted/belittled/etc \nis because of misreading, and personal opinionated descisions. \nMost of the things that get a question closed or downvoted is just because someone thinks that it is a \"shopping question\" or other \"off-topic\". Its a joke. Ive seen one guy tell an Original Poster that his question was was off-topic, yet he contributed to a question that was nearly identical except it was for a different programming lanquage. Double standards? a Simple Opinion? \n\nI agree with Assaf, if this is how the SE sites want to go, down this path, I agree that as he said \"the moderation will soon be easier\". but what I take into account, many of the more serious intelligent users will not use this anymore as a resource, but these sites will flood with noob questions. I mean FLOOD. So really I think the moderation will get more intense as only the fools that everyone is talking about here will flock to this site, as it has slowly been becoming a very unuseful site for people who are highly intelligent with lots of information to provide others to prevent these stupid questions. \n\nAnother thing is, its really annoying when people will delete content from an answer stating its off-topic, even thought the other 99% is on topic, despite the content being VERY VALUABLE, or not anywhere else to be found on the internet, or an addition to a great resource, which would definitely prevent any other stupid questions on that topic. \nFor instance. On the Android Enthusiasts Q&amp;A, someone explained to me what a loop device is, (which is what I asked) and also explained how to find it, how to use it, how to implement it into the kernel, and how to alter it. But all the content was deleted besides what a loop device is because that was the main question..  To this day, there is NO OTHER SITE ON THE ENTIRE NET that explains those things that, that guy did. There is really no other information in regards to loop devices, or how to implement it, or anything else he explained. So instead of Android enthusiasts being the only site on the net with that WONDERFUL information found nowhere else, it was deleted as it was \"development\" which is off-topic there. So yeah just remove the great content, screw it, who cares if it can not be found anywhere else on the net. Just delete it because the mods feel like it. \n\nAnother example on android enthusiasts: \nsomeone asked how to save files to an sd card from the google play store. \nit was instantly closed as being a duplicate. The \"supposed\" duplicate was a question on alternative markets other than the google play store. It had a tiny little sentence that said on an \"alternative\" market you can save the files without installing... \n\nThe guy begged and pleaded, that his was way different, (which is absolutely was.. You'd have to be an idiot to think those were the same..) yet because in a mod's oppinion they were the same..  \nLike I said, the personal opinion thing. Most of these rules can just depend on how you take it, and how you think about it and your personal opinion on the subject. \n\n\nI think its a joke. The whole system now.\n\nA good reason why Forums are better than this set up. This is find for simple questions with one answer. But if you need to work something out you need a forum post. Say you have a problem. Someone gives you an answer to try to fix it. It doesnt work, or there is a new problem. you now have to open another question, making more useless content, and not helping anyone but the original poster. Isnt the traffic on these sites supposed to be coming from search engines? Well thats who views these old questions. If the person has to start another question for the same problem, thats just one solution the person will probably never find. Really beneficial right?\n\nand its funny all the people who go around downvoting, deleting and trimming content are people who spend basically their whole day on these sites, literally daily. Spend nearly 2 minutes or less on a question, skim through it, and make an opinion, without even thinking twice or verifying their actions. \nThose are the people who will stay. They can trim these sites down of the many useful information ridden questions, and make it a more \"comfortable\" site for themselves, and their flock of noobs who come flocking. \n\nbut yeah its all good. Do what you guys wanna do on this site. its yours. Screw the community that makes it what it is. ;) \nBest of Luck. \nBut yeah you never know. Maybe it will be filled with semi intelligent people. It will just be like 4Chan though. A bunch of \"geek trolls\"."}, {"author_name": "James Mortensen", "gravatar_hash": "d4518e6223a1a82f53dc4919d0165151", "author_url": "http://pm.stackexchange.com/users/34/jmort253", "date": "Aug 09, 2012", "message": "&gt; Of course, I forgot to leave the link to the meta discussion…\n\n&gt; http://meta.stackoverflow.com/questions/131777/account-deleted-without-notice\n\n@Eran - The guy was posting links to his blog everywhere and even posting duplicate content. This is spam.\n\nAlso, the decision to undelete the user's account wasn't done because it was a mistake due to over-moderation or abuse. With 600+ flags per day on Stack Overflow, moderators need to make snap decisions based on the data that's available to them, which is other users who flagged your buddy's posts. Your friend flew too close to the sun and got burned.\n\nThe Stack Exchange staff made it clear that the user needs to read the FAQ and follow community guidelines going forward, and reinstating the account was not an assertion that what he did is behavior we should encourage."}, {"author_name": "Derf Skren", "gravatar_hash": "57502e99c0e5c5d678a435c0a235f97f", "author_url": null, "date": "Aug 09, 2012", "message": "\"I think the problem is only when people ask questions without looking for answers first.\"\n\nActually the problem is the opposite. 'Forum' lurkers who have nothing better to do than 'fix' questions and claim everything is a duplicate without having read the specifics of the question.\n\nIf we keep this up this site will soon be as useful as MS Answers."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Aug 10, 2012", "message": "@Annoyed - \n\n&gt; Tell you what, dude. Put your money where you mouth is. Start a new account, and only use that for six months. That’s right. Start with 1 reputation, and don’t let anyone know who you are.\n\ntell you what - I have done just that. Twice over the past year. Yes my contributions were scrutinized more closely than when I posted with my real world account, that's true. But never once were people rude to me, and criticism of mistakes I made was always within the boundaries of professional conduct. That's not a scientific analysis, and I was in the business of answering questions rather than asking, but I could find no evidence for what you are insinuating - that high-rep users have it massively easier than low-rep ones, and get away with things that the latter don't.\n\nAnd generally - if Stack Overflow is going down the drain as badly as some of the commenters here complain, and \"Forums are better than this set up\", then surely those forums must be the places people are fleeing to in droves? Right? Right? \n\nGetting a question closed stinks, I understand and know that from personal experience.  Getting snarky comments stinks as well. SO used to be a place where I could feel safe sending my mother to, in the (extremely unlikely) event she ever had a programming related question. I would no longer feel safe doing that, fearing she might get YouTube style comments. That is a problem, I agree. But I'm growing equally tired of all the \"OMG my question was closed Stack Overflow sux so bad and is so rude!!!!!!!!\" style complaints. Asking a question on SO is not a right, and more importantly, <b>closings are not what the Summer of Love is about.</b>\n\nAnd if your experience on Stack Overflow is a sub-optimal one, then screw those dicks and start <i>Googling!</i> I'm not being sarcastic, I <i>mean</i> it. Before there was SO, that was the way you learned stuff, and let's face it - for the vast, <i>vast</i> majority of worthwhile questions that you can have, the solution is already somewhere on the Internet.  Often, on Stack Overflow itself. You know I'm right - it just takes time, testing, and patience to find (or develop) them. Go research! If you <i>depend</i> on SO for getting your question answered, <i>you are doing something wrong.</i>\n\n@Derf Skren\n&gt; If we keep this up this site will soon be as useful as MS Answers.\n\nIn the tags I frequent, my subjective estimate is 50% of new questions are duplicates, if not more.  <i>That</i> will make the site as useful as MS Answers in the long run, as nobody will want to waste their time answering them any more. In my experience, it's no problem getting an unfair duplicate closing (which I put it to you are <i>exceptionally</i> rare) reviewed and reversed if you complain about it on Meta."}, {"author_name": "Jimk", "gravatar_hash": "71852f945904a94e0aa0487d5737b445", "author_url": null, "date": "Aug 10, 2012", "message": "Every single newbie struggles describing their needs,  mostly because we're still in the learnig proccess, sometimes mixing concepts and procedures. Some of us are enthusiats with a poor programming background trying to figure how to solve a project.\n\nAdd to some of this well known issues that a big portion of the people you reach doesn't has english as first language (e.g. Me).\n\nLike a year ago I realize that at SO the answers tent to be straight to the point, eventually SO went along the google search, few months ago I was looking for some free software and couldn't find exactly what i need but reading anwsers at SO solved a minor issue, so i said what tha fork!! this guys can help me if I got stuck up. And I begin to fork a PHP project with zero language background. The time came, I ask SO gave me guide, I follow. Project PHP forked (create multicompany &amp; multilanguage on the fly).\n\nYou guys are good at this, keep doing it as you use to, just don't get too circlejerky, thats my understanding of the \"summer\" I read it weeks ago.\n\nI partly agree with OP, I hated when read \"how quit mysql\", in google the first two results give the answer with not a single click given. But probably is more easy to skip the question or guide them to a better one that pretent they learn from your raged comment.\n\nMy point is RTFM is ok but tell me where the manual is."}, {"author_name": "Eran Galperin", "gravatar_hash": "5e36abec748829e65ebb6754ac8b8641", "author_url": "http://www.techfounder.net", "date": "Aug 10, 2012", "message": "@James\n\nSince I've seen the answers deleted in question in person, I can assure you 100% they weren't spam. He provided good answers - he might have made the mistake of providing the same answers on duplicate questions (that weren't as such), but the gung-ho approach to declaring someone a spammer when he provides useful content, epitomizes what SO has become for me.\n\nAnd you didn't comment at all about my answers being deleted. I'm not a new user (again, 30k rep) and I can assure you I don't spam. Do moderators just automatically delete everything that's flagged? does this sound like a good situation to you?"}, {"author_name": "easwee", "gravatar_hash": "1a8a29bd32dbe1d24bed5a7c1bc72637", "author_url": null, "date": "Aug 10, 2012", "message": "Those complaining about getting their questions closed obviously don't know how to ask a question or don't know how to use search before asking.\n\nNever had a single problem with questions. \n\nI actually like the rude attitude - give me straight forward info or send me to \"insert a nasty place\" if I'm too retarded to ask a question properly. \n\nAnd just for the record - for about 80% of problems I get during programing after consulting google search the answer is found on SO  - and the answer is a high quality one - compared to forum sites where I first have to read trough a flood of \"try this maybe\" answers - actually there's no comparison - SO is the best QA site for programmers - and it's FREE."}, {"author_name": "halifaxious", "gravatar_hash": "1d706fdef6b76678f0b1240b13da4734", "author_url": null, "date": "Aug 10, 2012", "message": "I've found that in the tags I frequent most, a large proportion of the duplicate questions are coming from new users with limited English skills. It's difficult enough to ask a good question. Doing it in a second language is that much harder. Many of these questions go unanswered or are summarily closed due to incomprehensibility. Many more get impatient or discouraging comments.\n\nThere are a number of alternate language SO versions in Area 51. Perhaps they could be more strongly promoted? (Of course, that won't help with l33t speakers!) Or, perhaps users could be encouraged to post in their own language and a language flag be made available?"}, {"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Aug 10, 2012", "message": "I'm late to this party but Assaf's comment - and Robert Harvey's response- resonate entirely with me.\n\nAsking \"what is a good tool\" for this is an *extremely important part* of being a programmer. \n\nI'd argue, actually, that being finding good, appropriate tools is more important these days than being able to sling code. The most effective developers are not the most clever ones, they are the ones who can leverage existing code the best.\n\nYou can waste vast amounts of time researching and writing code when something that already does what you want may exist. But you just didn't know about it.\n\nIdentifying and understanding tools isn't \"shopping.\" It's coding. It's a big part of what I do every day. I spend hours and hours googling before I embark on any new bit of code to see if someone's done it before, if there's a good project that encompasses what I'm trying to do.\n\nBut this effort is enormous. Unless the tool in question happens to be very widely used and very popular, it can be extremely difficult to track down an open-source project that's been starred by a 50 users. It could be awesome, and do exactly what you want, but you just couldn't find it.\n\nAnd, apparently, you can't simply ask your community if they know about it on Stack Overflow because someone has decided that this is no different than asking whether I should buy a PC or a macbook.\n\nCome on. There needs to be a legitimate place to ask this kind of question. I spend a heck of a lot more time trying to solve this kind of problem - or end up redoing something that's been around for 5 years - because there's no good place to find an answer, and you can't ask here."}, {"author_name": "shalomshachne", "gravatar_hash": "2014672faa0530abc886adf5725c5127", "author_url": null, "date": "Aug 10, 2012", "message": "@Chris\nCan you post the link to the question which worked out so badly. I'm interested to see what exactly happened.\n\nHonestly, I've found SO an excellent resource. In all my questions, people have been sincerely using the best of their knowledge to provide an answer.  I haven't encountered any misinformation yet (or if I have it was insignificantly off target)."}, {"author_name": "John Saunders", "gravatar_hash": "953e26e80351a67962a6e5840fc1fc14", "author_url": null, "date": "Aug 10, 2012", "message": "\"What is a good tool\" may be an important question, but Stackoverflow isn't the place to ask it."}, {"author_name": "Spammer", "gravatar_hash": "32184ea493e7b4b64950bc5f1743a289", "author_url": null, "date": "Aug 10, 2012", "message": "I, yet don't have any complains with SO. I agree that some times you don't get the right answer for you question but, with that tips people give can lead you to solve the problem in your on way."}, {"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Aug 10, 2012", "message": "@John Saunders - if it's an important question that's crucial to the job of a software developer, what is the rationale for specifically excluding it from the Stack Exchange community? I can't think of any other place to ask it, and I can't think of any community I'd rather ask it of."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 10, 2012", "message": "@Jamie:\n\nYou can ask tools questions on Stack Overflow, just not the \"What is your favorite\" and \"What is the best\" variety.  If you can craft your question so that it is narrow enough to be actually answerable, i.e. \"Is there a tool that meets these specific requirements\" or \"What process or tool can I use to meet this specific need\", it is perfectly on-topic at Stack Overflow."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 10, 2012", "message": "@Stack This\n\nYour argument should really be directed to http://meta.stackoverflow.com, <b>with links to those specific examples</b>.  This blog is not a good place to field concerns like this (some of which appear to be legitimate); take it to <a href=\"http://meta.stackoverflow.com/\" rel=\"nofollow\">Meta</a>.\n\n(I apologize for the <b>bolding</b>, the formatting here sux.  Markdown, anyone?)"}, {"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Aug 10, 2012", "message": "Let me put that another way. The only reason that I can see that \"Stackoverflow isn't the place to ask it\" is because someone said so. That's not much of a reason.\n\nThe detailed explanation of why \"shopping\" questions are bad... e.g.\n\n\"What is your budget?\nWhere do you live?\nWhat are your preferences?\nWhich alternatives will you consider?\nWhen do you want to buy?\"\n\n... are totally inapplicable the the question of  \"what's a good tool.\" This exclusion is way to general, and limits the ability of SO users to leverage a very important aspect of the community knowledge.\n\nIn the top 200 viewed SO questions are...\n\nList of freely available programming books (#1) (closed)\nWhat IDE to use for Python? (locked, only not closed because \"historically significant\")\nText editor to use to open (big, giant, huge) files\nFree online private SVN repositories (closed)\nBest subversion client for MacOS (closed)\nBest way to embed PDF in HTML (closed)\njQuery Grid Recommendations (closed)\nbest laTex editor for windows (closed)\nwhich javascript framwork (closed)\nA better java JSON library (closed)\n\n... I could go on\n\nDoesn't anyone think it's odd that so many of the questions that have hundreds of thousands of views and hundreds of upvotes are considered \"not constructive?\"\n\nIf SO is a community-run site, then shouldn't the simple fact that the community (versus the oligarchy) find something valuable carry some weight in what is considered \"constructive?\""}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 10, 2012", "message": "@Jamie:\n\nThe short answer is that Stack Exchange is a Q&amp;A site.  It is carefully crafted to provide quality answers to people's specific questions.  It is not intended to be a List All The Things mechanism.\n\nPopularity does not equal quality.  See http://en.wikipedia.org/wiki/Parkinson's_Law_of_Triviality"}, {"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Aug 10, 2012", "message": "@Robert Harvey (sorry - I posted my last comment before your update). \n\nWhile I think that the nuance of asking \"what's the best way to do something\" versus \"how do I do something\" is fairly immaterial, there are lots of questions that exactly fit those criteria that have been closed.\n\nThat said I must give you kudos for practicing what you preach. I just looked through some of the questions *you* have closed and they all seem legitimate. \n\nA couple examples that as far as I can tell are just fine according to your criteria.\n\nhttp://stackoverflow.com/questions/11186110/need-an-idea-for-some-source-code-testing-evaluation-tool\n\nhttp://stackoverflow.com/questions/145657/tool-to-compare-large-numbers-of-pdf-files\n\nhttp://stackoverflow.com/questions/11213626/what-are-some-good-persistance-libraries-for-net\n\nI'm not trying to pick because there happen to be questions that maybe shouldn't have been closed. My point is that some moderators do not share your opinion that \"what tool\" or \"how do I do this\" questions are OK, no matter how they are worded.  \n\nIf your position that they are OK as long as they are not worded badly or too generally is true, then it should be codified so that there's not so much ambiguity about what is OK."}, {"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Aug 10, 2012", "message": "\"Popularity does not equal quality\" - sure - just look at Jersey Shore. But this is not a web site that provides entertainment, it's one that provides answers to questions. Number of views is certainly a very good indicator of how often people are looking for the answer to a question.\n\nYou can dispute whether a question is a good fit for SO's rules, and I will not argue with you. My argument is, why are the rules designed to exclude things that are so commonly needed by members of the community?"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 10, 2012", "message": "@Jamie: \n\nWell, this is not a new issue, and there's already plenty of coverage elsewhere, if you take the time to read it:\n\nThe faq for each site.  Example: http://stackoverflow.com/faq#dontask\n\nhttp://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/\nhttp://blog.stackoverflow.com/2011/08/gorilla-vs-shark/\nhttp://blog.stackoverflow.com/2010/11/qa-is-hard-lets-go-shopping/"}, {"author_name": "shankar", "gravatar_hash": "5b66fa39fd97d13b317135bbfb36a5bd", "author_url": null, "date": "Aug 10, 2012", "message": "just in case people haven't noticed, the mouse-over title on the red square (or is it a cross?) in the middle says \"it's a joke, Seriously!\""}, {"author_name": "Brett", "gravatar_hash": "010bd6b16b0f7955f8c3bdb9a4c8d88c", "author_url": null, "date": "Aug 10, 2012", "message": "I'm with Assaf and Jamie here. SO is starting to become really annoying with all these nit-picking &amp; whiny people.\n\n2 of my lastest questions have received close votes. I love SO but it really is becoming more about \"keeping things in line\" rather than helping your fellow programmer.\n\nThe questions that have received close votes are as follows..\n\n\"Nivo Slider Alternative for content, not just images\"\n\nI am not asking for BEST, I am simply asking if there is anything out there that can help me with this. According to what \"Robert Harvey\" said above, this is perfectly ok.\n\nAnother question I got 2 close votes on was..\n\n\"How to get my user/priveleges back\"\n\nNow sure, perhaps \"serverfault\" would have been a better place to post this, but SE has so many damn sites that you almost have to know each site inside-out to know which questions should go on which site.\n\nI say if it's related to programming in some way, then no foul...... just sick of the whiny, nit-picky people on this site."}, {"author_name": "Brett", "gravatar_hash": "010bd6b16b0f7955f8c3bdb9a4c8d88c", "author_url": null, "date": "Aug 10, 2012", "message": "Oh I also forgot to add, sometimes people edit my post to clean it up a little, and this is fine. However, I usually end my question with a simple \"thanks!\"; and it's happened at least 3 times now when people that have chosen to edit the question decide to remove my thanks as well because they feel it's \"unneeded\".\n\nIf it doesn't make the post hard to read or is bad Grammar/spelling, then LEAVE THE POST ALONE. It's my question, not yours. Why don't you just rewrite the whole question while you're at it!?\n\nGeez some people are so rude!!!"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Aug 10, 2012", "message": "@Jamie: regarding shopping questions and tool recommendations - I tend to agree that they're somewhat different beasts, though they do share some of the same issues (in particular, they're honeypots for spammers, which then leads to the sort of issues Eran talks about). \n\nYou should bring this discussion up <a href=\"http://meta.stackoverflow.com/\" rel=\"nofollow\">on meta</a> if possible - the best way to get a chance in policy is to make a good argument against what's currently done."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 10, 2012", "message": "New people to Stack Exchange should take the time to learn the community and how it works, on its own terms, before suggesting changes.  \n\nStack Exchange is no different than any other social situation; you can't honestly expect to walk into a church, a business or rotary club and declare that they're doing it wrong without clearly understanding what their mission is.  That's rude, and it happens all the time on SE.  \n\nStack Exchange was never meant to be all things to all people.  It's primary mission is to be a high-quality repository of answers to people's specific questions in a broad (but carefully focused) range of topics.  It will actively resist anything that undermines that fundamental goal."}, {"author_name": "DeLongey", "gravatar_hash": "417028c9062936288f6b8b726062a95a", "author_url": null, "date": "Aug 10, 2012", "message": "If I understand the points of the article correctly I believe I do agree with most of them. However, my problem with the post is that it's just too long and takes more effort than necessary to interpret the meaning.\n\nA critique for future posts, since I think if they're shorter and a little more clear, you'll see a lot more people reading and understanding."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 10, 2012", "message": "I propose a simple video of how stackoverflow works.  @Joel Spolsky, what would it take you guys to look for the folks that make the intro videos for things like gmail or that very inspirational video for google chrome.  Google is very good at creative very short videos on how to use a tool / system.  The video could be a max 2-3 minutes and just gives a new user a quick insight of how so / se sites work."}, {"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Aug 10, 2012", "message": "@Shog9 - I am actually writing something up right now :) \n\nI certainly understand the spammer-honeypot concern. But looking at the historical record of such questions (mostly closed) this problem seems to be more theoretical than actual. Maybe this is just a result of very good answer moderation, or questions being protected so only users of a certain rank can add answers. But whatever the reason, it doesn't seem to be a pervasive issue, or the system works. Therefore I don't think it is a good argument for not permitting this kind of question.\n\n\n@Robert Harvey - I'm not sure who your \"new people...\" comment is directed towards, but it doesn't seem like most of the people commenting here are new. I agree: you shouldn't walk into a club and tell them how to run it. Is anyone here doing that?\n\nI've been here almost 2 years. None of the people commenting here who I can connect with profiles are newbies. I think this comment is a red herring, there's plenty of dissent regarding the strict enforcement of certain policies among people who have been here a long time."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 10, 2012", "message": "@Jamie:\n\nI guess the question is, if you've been here for two years, but still disagree with the way the place is run, then why are you still here? \n\nThis argument is not a new one, and if you've been here that long, you already know that."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 10, 2012", "message": "@Robert Harvey,\n\nWith the snarky comments you make one should be very surprised and question your role as a moderator.  Tone it down a bit and be more respective to criticism.  There's a lot of people that live in this world and don't agree with congress, their local mayor, the government, their boss - that doesn't mean they should disappear from the face of the earth.  Lighten up and take a break from your own rants and posts."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 10, 2012", "message": "@JohnH:\n\nThat's not what I said.  \n\nIt is an honest query.  If you're truly dissatisfied with a product, why would you keep buying it?  You don't don't go to the Ford dealer and say, \"You know, I really hate the way you make cars,\" but then buy a new one anyway.  That makes no sense."}, {"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Aug 10, 2012", "message": "@Shog9: \n\nhttp://meta.stackoverflow.com/questions/143010/policy-enforcement-time-for-an-so-site-for-all-the-things-so-isnt\n\nAlready got a downvote! Shocker."}, {"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Aug 10, 2012", "message": "@Robert Harvey: Are you serious?\n\nIf Stack Overflow is not at all interested in the input from the community, then why did you all suggest I bring this up for discussion on Meta?\n\nI am here because there are many positive things about the SO community. It's unique. There are no alternatives.\n\nDo I have to accept the status quo or take a hike?\n\nSheesh."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 10, 2012", "message": "@Jamie, \n\nWhat you are doing is essentially correct.  Besides SO is about the community and not some silly moderators asking you to go away (shame on him).  Keep at it, practice what you preach and change can happen.\n\nDon't let the negative downvotes discourage in any way.  I haven't seen anyone trade in their votes for anything special yet.\n\n@Robert Harvey,\n\nYour comparison is absurd.  There is a lot of people in the US that despise and don't want war.  Do we have to leave our country because we \"don't like the way it is\"."}, {"author_name": "phwd", "gravatar_hash": "d51a60c7bade46cd12ac19008ba3d8e7", "author_url": "http://stackoverflow.com/users/321505/phwd", "date": "Aug 10, 2012", "message": "@JonH,\n\nThat's not what Robert said. If there is something that is causing bitterness and/or negativity in an activity one is doing, that person needs to weigh out the pros and cons and decide whether said activity is healthy in the long run to continue.\n\n@Jamie,\n\nDownvotes on meta indicate disagreement. People are allowed to express their agreement/disagreement on meta questions. Read more at the FAQ http://meta.stackoverflow.com/faq#vote-differences"}, {"author_name": "Mr Man", "gravatar_hash": "dbe95b4069a05420ef606bad1cdb22aa", "author_url": null, "date": "Aug 10, 2012", "message": "Wow. I'm genuinely shocked by Robert Harvey's attitude here. On the one hand, SE sites should reflect the community, that's how things are done. On the other, if the community doesn't like it, they should leave.\n\nWhat kind of crazy logic is this?\n\nThe people who are airing their complaints are doing so because they want to make SO better. They want to improve the experience and help solve problems before they destroy the site. Asking them why they're still around if things are so bad belays precisely the wrong attitude.\n\nEveryone is taking the time to post here because they want to be part of a SOLUTION. Instead they're all having to fight just to try and prove there's a PROBLEM.\n\nRobert: As soon as you start taking criticisms of the SITE personally, you know you're not suited to be a community manager. I would suggest taking a step back to reassess what's going on here."}, {"author_name": "Mr Man", "gravatar_hash": "dbe95b4069a05420ef606bad1cdb22aa", "author_url": null, "date": "Aug 10, 2012", "message": "@Pekka, I'm happy to hear that you've tried what was suggested, but I'm confused by your answer. You say that beyond being scrutinized you never received any rude comments.\n\nYou then go on to say:\n\n\"Getting a question closed stinks, I understand and know that from personal experience. Getting snarky comments stinks as well. SO used to be a place where I could feel safe sending my mother to, in the (extremely unlikely) event she ever had a programming related question. I would no longer feel safe doing that, fearing she might get YouTube style comments. That is a problem, I agree.\"\n\nIsn't that what we're all trying to prove to the moderators to take seriously? You may be tired of people complaining about the problem (at least you acknowledge it!), but the solution isn't to tell people to stop complaining."}, {"author_name": "phwd", "gravatar_hash": "d51a60c7bade46cd12ac19008ba3d8e7", "author_url": "http://stackoverflow.com/users/321505/phwd", "date": "Aug 10, 2012", "message": "@Mr Man,\n\nAgain, Robert did not say that, he asked a question (not a statement) for Jamie and you are spinning it differently to make him out to be some evil snarky moderator. Of which he is not, he has been voted in by the community so I would hope that he is good for the position. If he wasn't, SE Inc. would have kicked him out a long time ago.\n\nThere is suggesting a solution then there is saying \"I want SO to work how I want, I don't like the rules, change it for me because I want it that way\". Everyone is free to opinion, but that doesn't make it convert automatically to being the correct answer. Making suggestions happens everyday on meta.\n\nYou should take a step back yourself and stop trying to frame this into a \"us vs mods\" logic. Because it's absolutely not that way. It seems as though you have a clearly misguided bias towards moderators even though most of the community micro-moderates through flags, edits and close votes."}, {"author_name": "Mr Man", "gravatar_hash": "dbe95b4069a05420ef606bad1cdb22aa", "author_url": null, "date": "Aug 10, 2012", "message": "@phwd, I was anticipating this response because I badly worded mine.\n\nI understand that RH was asking a question, not telling people to leave. However, it's precisely the wrong question to ask. It's insulting, belittling, and completely besides the point.\n\nI feel like this whole discussion could have moved forward by now if certain people would acknowledge that the problem actually exists. If we could agree that it does, then we could focus on fixing it, rather than trying to prove it doesn't by asking questions like that."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 10, 2012", "message": "Which problem?  The civility problem? Or the too many closed questions problem?"}, {"author_name": "phwd", "gravatar_hash": "d51a60c7bade46cd12ac19008ba3d8e7", "author_url": "http://stackoverflow.com/users/321505/phwd", "date": "Aug 10, 2012", "message": "@Mr Man,\n\nTrue, it might be the wrong question to ask though I don't see why Robert must tip toe over that shopping issue. This issue has been discussed to death such that one can publish a book on it and we still would not reach a resolution. \n\nAs noted by Jamie's meta question he has a lot of issues meshed together http://meta.stackoverflow.com/questions/143010/policy-enforcement-time-for-an-so-site-for-all-the-things-so-isnt and hasn't taken the time to focus on one. Jamie said he was here for two years so he knows the problem (or has been given ample time to be fully aware of it)\n\nShopping will always be a debate until the SE Engine can manage it in a way that works. There are people in the community that have gained a lot from these type of questions, including myself but the fact remains, the SE Engine sucks for these questions. I hope we can at least agree on that.\n\nThe comment problem is acknowledged by all in the sense that people\n\n1) Do make comments of no value  \n2) Do post curt comments that may look snarky to some\n3) Do post outright snarky comments\n\nAs time progresses as a member of the community some don't realize that they have merged 2) and 3) such that an outright snarky comment from an outside view doesn't look that way within the community\n\nIf we all focused on the one problem of comments and stop trying to conflate everything I think everyone could agree, fix it and *then* move on to a next issue e.g. shopping.\n\nDivide and conquer"}, {"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Aug 10, 2012", "message": "@phwd - I'm guilty of putting too much under one roof on that question, and if it's not beaten to death I'll take shog's advice and pull out the part I care about. \n\n\nBut as far as the shopping issue goes there are two things here: what people keep saying is the problem with it, and the actual problem. I have not seen any evidence that there is one.  There are lots of old questions with great answers. And yes, lots of me too's -- but is that a problem? That's why we have voting. The best answers get upvoted. The others are there if you really care to dig. The cream rises to the top.\n\nThe only problem I see is that many of these questions, with very high google rankings, are closed and therefore cannot have new answers added, so they are outdated, and inaccurate."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 10, 2012", "message": "There was a great deal of debate about what to do with these old questions, and a significant percentage of people wanted to just purge them, in part for the reasons you've given.  The community decided they were of sufficient value to merit preservation; the SE team even changed the look of these \"historical\" questions a bit to provide a visual indicator that they are artifacts."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 10, 2012", "message": "What most people seem to forget is that, for every one of these stellar questions, there were a dozen similar questions that were asked, closed and deleted because they were useless."}, {"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Aug 10, 2012", "message": "@Robert Harvey - is that ratio really so different than the ratio of duplicates and other bad questions? I am certainly sympathetic to the potential for problems posed by these questions. We should continue to try to figure out better technological ways to address it.\n\nBut I remain unconvinced that the best answer is to shoot new ones down or prevent the old ones from being updated. It just makes people ask them again."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Aug 10, 2012", "message": "@Mr Man you are confused because you, like the users I complain about, are confusing two entirely different things. :) \n\n- Closing questions\n- Rude comments\n\nthe latter, I agree, stinks.\nThe former is a bit of a different beast. At about 5,6k new questions a day, closing is an important part of the community's self-defense mechanism. The community feels it has to be strict about on-topicness rules (it's the <i>community</i> that closes most questions, not moderators) to maintain some sort of sanity. It is ok to discuss how strict or not strict this should be, but closing != rudeness. See Jeff's comment on the original Summer of Love blog post on that: http://blog.stackoverflow.com/2012/07/kicking-off-the-summer-of-love/#comment-68040"}, {"author_name": "Walrus the Cat", "gravatar_hash": "64e45cc8ee1cb8f6a8e981243ccaa600", "author_url": null, "date": "Aug 10, 2012", "message": "@ Assaf (way up towards the top.)  I know *exactly* what you mean.  Every time I post, I brace myself for the kings of their petty domains to come put me in my place.  It's pathetic."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 10, 2012", "message": "I find it quite ironic that people who seem the most invested in civility are also the ones that are the least civil."}, {"author_name": "Justin Dearing", "gravatar_hash": "735a05084346db68dff750870654da3d", "author_url": "http://www.justaprogrammer.net", "date": "Aug 10, 2012", "message": "@Robert, its quite simple, those that suck at civility are acted rudely to in return, and since it doesn't come natural to them, they have to learn rules in a manner that someone with aspergers would have to \"learn\" social behaviors that come naturally to most people."}, {"author_name": "Justin Dearing", "gravatar_hash": "735a05084346db68dff750870654da3d", "author_url": "http://www.justaprogrammer.net", "date": "Aug 10, 2012", "message": "While we are talking about civility, can we encourage people to say thank you in the comments http://www.justaprogrammer.net/2012/08/10/saying-thank-you-and-the-stack-exchange-summer-of-love/"}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 10, 2012", "message": "@Justin Dearing Doubtful, given that it's explicitly mentioned as what not to do on the Comment privilege: http://meta.stackoverflow.com/privileges/comment"}, {"author_name": "Yannis Rizos", "gravatar_hash": "a610732cb6ac525c26ff5bcfa9433f41", "author_url": "http://programmers.stackexchange.com/users/25936/yannis-rizos", "date": "Aug 10, 2012", "message": "It's amazing how horrible the SO community is treating noobs.\n\nhttp://meta.stackoverflow.com/questions/142911/having-a-bad-start-is-that-normal\n\nHad enough, rage quitting. Bye all, you jackasses, and thanks for all the fish."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 10, 2012", "message": "Also holy crap did you seriously just imply people should be more civil and then make fun of people saying they must have Asperger's? I'll just let you think about that one."}, {"author_name": "FirstVisit", "gravatar_hash": "676bc32b543b7430b74888d8ebed9397", "author_url": null, "date": "Aug 10, 2012", "message": "This is my first visit to your site and I, unfortunatly, read ALL the comments... I also have suggestions based on common complaints, gripes and points.\n\n1. If a Moderator is going to close a question for \"Dup\" then include the link directly to the dup or all the dups if the question is too vague to nail down.\n\n2. If you think your way is right and faster because of \"x\", don't slam another answer that is just as correct because it's \"y\". For example, the people that love to correct others because they know ever keyboard shortcut and (condescendingly) know it's faster then when you use the mouse. When tempted to do something this stupid, ask yourself if you would appreciate being in the other persons position, or simply don't waste the time and effort.\n\n3. It sounds like the original point of this place was Q&amp;A not Q&amp;QQ&amp;QQmoar... \n&gt;Site authorsSite UsersModerators&lt;: you are not &quot;Gods&quot;, you are simply a clean up crew who want to keep things as simplified and smooth as possible. Do not try to abuse your powers, encourage the community (because yes this has a community, like it or not) and you&#039;ll probably notice you have a much easier time.\n\nThis is a place (referring to SO)i can ask a painfully stupid question that never gets answered, for very obvious reasons, or i can ask a very well outlined question that gets answered 3 different ways giving me the same results. OR you can all make this place one of those websites from &quot;antiquity&quot; that only trolls hang out on and everyone is just being a grammar nazi, over analyzing a posts sentence structure instead of the question itself.\n\nI do apologize if this got wordy, but this started with some childish humor and has hit reiterating redundancy of &quot;idiocracy&quot;."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://stackoverflow.com/users/102937/robert-harvey", "date": "Aug 10, 2012", "message": "@FirstVisit\n\n1.  Already happens.\n\n2.  Agreed.  No comment is better than a rude comment.\n\n3.  I'm keenly aware of this.  Anyone who's giving the impression that moderators are anything but janitors are putting us on a pedestal that doesn't exist."}, {"author_name": "phwd", "gravatar_hash": "d51a60c7bade46cd12ac19008ba3d8e7", "author_url": "http://stackoverflow.com/users/321505/phwd", "date": "Aug 10, 2012", "message": "@FirstVisit,\n\nAs Robert said these points you mention are already well known. This isn't new information.\n\nPlease don't think that mods think of themselves as \"Gods\" as you are by relation putting yourself on a pedestal typing that. It's an ironic holier than thou statement that seems to try to scold everyone involved at once. Don't do it. Most times, mods are humble, all the time mods are human.\n\nFact: Mods inter-communicate regularly across all SE sites (all 230+ mods) via chat to problem-solve, brainstorm and ensure they don't fall into the overzealous trap."}, {"author_name": "Brad Mace", "gravatar_hash": "1f744618bae7f59c10ae01152c85d8f6", "author_url": null, "date": "Aug 10, 2012", "message": "The reason *I* took a year off was due to the hordes of people posting garbage without the slightest regard for the sites' standards. There's still more garbage coming in than moderation can keep up with, though the deterioration rate may have slowed somewhat."}, {"author_name": "James Mortensen", "gravatar_hash": "d4518e6223a1a82f53dc4919d0165151", "author_url": "http://pm.stackexchange.com/users/34/jmort253", "date": "Aug 10, 2012", "message": "Hi @Eran,\n\n&gt; And you didn’t comment at all about my answers being deleted. I’m not a new user (again, 30k rep) and I can assure you I don’t spam. Do moderators just automatically delete everything that’s flagged? does this sound like a good situation to you?\n\nYou're right that I didn't address your deleted answers, and it might be worth bringing that to Meta, in a constructive manner, if you haven't done so before.\n\nI'm a 10K SO user, so I can see deleted stuff. I'd be interested to see why they were removed, and if I see a way to justify undeleting them, such as editing out whatever the moderator didn't like about it, I would definitely support having them undeleted. I've done this before in cases where I've been able to help!\n\nAs for your friend, it sounds like his intentions were good. However, in Meta, the developer that responded in the comments, Marc Gravell, said every one of his answers contained a link to his blog and some were duplicate answers. While they may have been useful, that is still a bit suspicious, and I could see why things went the way they did. I'm sure the moderator was just trying to do what he thought was right. As Marc Gravell says, the line isn't black and white and is subject to interpretation (and occasional misinterpretation, especially for borderline cases)"}, {"author_name": "kinjal dixit", "gravatar_hash": "0a5cca93133e845bf387612bf97e93fa", "author_url": "http://sanecode.com", "date": "Aug 11, 2012", "message": "If you allow new users to add comments to existing questions (which are almost what they are asking, but not quite), and recycle those questions to the top, people with privileges editing the question, and other people editing answers, then that would make it more wiki like."}, {"author_name": "MK", "gravatar_hash": "661151c07decb10fa71d08d83fd62d5c", "author_url": null, "date": "Aug 11, 2012", "message": "@Joshua Flynn: not to be rude, but I think you have A) misapplied the concept of \"straw man\", and B) ironically, illustrated its real meaning.  A \"straw man\" attack is one in which you critisize your opponent on the basis of arguments that he or she never actually made.  That does not make a lot of sense in the context of your quote, \"“but if Stack Overflow was full of very nice, impeccably polite misinformation…”, although you might be able to call that the fallacy of accident *if* the author were using that to prove that all polite people are wrong.\n\nSince the author didn't, you're attacking a straw man. Know your logical fallacies ;)\n\nhttp://en.wikipedia.org/wiki/Logical_fallacy#Straw_man\nhttp://en.wikipedia.org/wiki/Accident_%28fallacy%29"}, {"author_name": "leppie", "gravatar_hash": "515ca9736a9a8ce65e58af764ccddf46", "author_url": "http://ironscheme.codeplex.com", "date": "Aug 11, 2012", "message": "If I can't be honest (read as being rudeness perceived), I will just have to be a troll."}, {"author_name": "Clint", "gravatar_hash": "7352895b78d9c847c628cbb921f4eb22", "author_url": null, "date": "Aug 11, 2012", "message": "I got blocked in this site for no good reason. It seems to me unless your question has some sort of code in it you can't get a good advice and risk being blocked too! Apparently I must have done that twice so now my ip is blocked forever..apparently with no way to get it back.\nI asked what it was was so offensive about my post (and I even edited it to a single line) but got no replies. It seems a perfectly valid question to me. Even if it was not, i have no idea why a question flagged as not a real question get you banned forever ?? \nPosts like the above are so pretentious and will only serve to satisfy the ego of some people. \n\"We are objectively nice\" -&gt; no\n\"preferential behavior toward those in the right cliques\" -&gt; yes it does seem to be intolerant for newbies\n\"rudeness as a defense against vampires\" -&gt; Vampires? Yet another word for newbies I guess\n\"Even jackasses like me and you\". Speak for yourself."}, {"author_name": "Nicol Bolas", "gravatar_hash": "7b1af0a134b3cf0892025b0ec4ba65a9", "author_url": "http://www.arcsynthesis.org/gltut/", "date": "Aug 11, 2012", "message": "&gt; While we are talking about civility, can we encourage people to say thank you in the comments \n\nThat presupposes the idea that saying \"thank you\" promotes civility. It doesn't; it promotes the *illusion* of civility.\n\n\"Thank you\" only matters if you actually mean it. If it's just something that you're supposed to say, then the term doesn't mean anything. You're not really thankful; you just say it because you're supposed to. At which point, people stop reacting to it as though the words have weight. Because they don't anymore.\n\nFurthermore, we already have a way of thanking people on this site: upvoting their answers. That's all the thanks anyone needs to get. Upvotes are clean, reliable, provide rep, show how many people appreciated your contribution, and most importantly don't take up valuable space. There's no text blurb, just a number.\n\nWhat would you prefer? 10 people all posting comments that say \"thank you\", thus contributing nothing but text to the site? Or 10 people upvoting your answer?"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Aug 11, 2012", "message": "@Clint - how did you get blocked exactly (what message did you get) and where did you ask about it?"}, {"author_name": "Clint", "gravatar_hash": "7352895b78d9c847c628cbb921f4eb22", "author_url": null, "date": "Aug 11, 2012", "message": "@Pekka, Well the question is deleted now so I don't remember everything. I asked at stack overflow and the question was closed as not being a real question. I had some difficulty understanding some technical terms in multi processing. So I asked a question hoping someone will pin point the differences of hyperthreading,simultaneous multithreading etc which at that time were really confusing for me. That was not welcome at all. I got tons of \"we don't do your research\" stuff even though I explicitly mentioned I spent quite some time studying those by myself. A few people actually tried to help but the noisy ones closed it quick. Anyway I edited the post to a single line but nothing happened afterwards. Why tell someone to do that if you don't bother to look at the changes? Funny thing is some where it is mentioned I can get back to posting if I did something right.I am a newbie so I can't answer questions of others."}, {"author_name": "Philip Devine", "gravatar_hash": "baf67bc6091e75c089d4f789817c8233", "author_url": null, "date": "Aug 13, 2012", "message": "@MK - @Joshua Flynn actually had it correct.  He was calling out the OP for attacking a straw man to prove his point.  Whether or not it was accidental, he did it and based much of his point on that one statement.  I'm not sure if your main source for understanding is an education in philosophy, or wikipedia, so I'll explain where you went wrong from the ground up.\n\nYou have it right that this logical fallacy is based on obscuring the original point into something you can more easily attack, but the point being made by @Joshua Flynn was that the OP created a straw man when he took this point\n\n\"You might think you hang out on SO because people are nice there [...]but if Stack Overflow was full of very nice, impeccably polite misinformation… It wouldn’t be a valuable resource for professional programmers\"\n\nand attributed it to \"You\" (as stated in the first word of the sentence), meaning those who might offer a counterpoint to his point.  So it wasn't a misuse of the phrase on @Joshua Flynn's part, but a very good catch of a very subtle logical fallacy.  If he hadn't caught it, then I would have posted it anyways, as the rest of the article rides on the presupposition that one cannot be both nice and correct at the same time.  If one were to put a little more effort and understanding into their answers, suggestions, or recitation of rules that a poster is not following, SO would be a much better place."}, {"author_name": "Cochran Automotive", "gravatar_hash": "705caef493adb6a23ff2231bf0a7013b", "author_url": "http://www.cochran.com", "date": "Aug 14, 2012", "message": "It's great to see a forum/discussion thread in which people are actually debating or offering valid points in a civil format. Some people ruin everything with their hateful and unnecessary online rhetoric. If anything, it showcases their lack of intelligence."}, {"author_name": "Akka", "gravatar_hash": "b0828701cc62fab9b039a6f6337276cd", "author_url": null, "date": "Aug 16, 2012", "message": "Here's a question: Why have downvotes at all? What purpose to they serve? Also, why have the ability to close questions? Seriously. If the community doesn't want to answer your question, then it won't be answered. What would happen if it wasn't closed?\n\nThe upvote system would still allow all the \"cream to rise to the top\", what purpose does downvoting practically serve?"}, {"author_name": "Jeremy Banks", "gravatar_hash": "bd192f0a40308fe9ecb9aa2a72ee8d81", "author_url": null, "date": "Aug 16, 2012", "message": "@Akka What you're describing is how you create Reddit. If you have voting without moderation you end up accumulating the most entertaining content, not the most informative, or even on-topic. This can lead to a loop: the site becomes more appealing to people looking for entertainment and less valuable to people looking for information, so it gets more people who contributing entertaining content and few contributing informational content, which makes the site more appealing to...\n\nStack Overflow started slipping in that direction when it was a year old, but managed to turn things around. There are no shortage of communities with loose moderation, if that's what you want. Stack Overflow doesn't need to be one of them."}, {"author_name": "DVK", "gravatar_hash": "f3d2c01f6f55bb34530fcbae9a39d285", "author_url": null, "date": "Aug 21, 2012", "message": "@Akka - the purpose of closing is the same as any other editing - to remove noise that blocks and overwhelms information. I do NOT want to hunt through 100 crappy information free posts to find 2 informative ones like I have to on a random programming forum. In order for someone to upvote the \"cream\", they should not have to spend determined effort to first seek out that cream to upvote.\n\nUpvotes don't serve to separate cream from crap. They serve to separate good content from VERY good/excellent, e.g. to help people discriminate between good content. Downvotes/closures serve to separate good content from bad content.\n\nIf you think that it's a bad system, you are welcome to use gazillion other forae that don't have it. But don't complain that they contain less useful information or expert helpers. Because both those elements are here **because** of community moderation. It's not an accident and not even a correlation but a causation."}, {"author_name": "DVK", "gravatar_hash": "f3d2c01f6f55bb34530fcbae9a39d285", "author_url": null, "date": "Aug 21, 2012", "message": "@clint - every single user among 700000+ on this site was at some time a newbie. Don't think you are somehow special. when I joined, i FIRST spent time learning the rules. Reading the FAQ. Watching other posts to see what was acceptable. So did most other people.\n\nIf you aren't willing to do that, and post something against the rules, the negative consequences will be not because you're a newbie but because you are an insensitive clod not caring about the rules of the community.\n\n\"Vampires\", if you bother googling, has NOTHING to do with newbieness either. Matter of fact, most vampires hang around for a while. A vampire is someone who demands to be helped as if it's their right, without even a slightest indication that they put in any effort. REPEATEDLY. If you come here demanding help as if you're entitled to it instead of humbly asking **in a way that makes it easier for people to answer**, you shouldn't expect good will."}, {"author_name": "Julian Suarez", "gravatar_hash": "9c1d4aa3952ebaced7258cabd917bc37", "author_url": null, "date": "Sep 21, 2012", "message": "Popularity in stackoverflow is based on numbers. If a lot of people want to do something because of ignorance, like violating scope rules, and someone who knows that it can not be done tells them, the ignorant is moded up and the knowing one is moded down. So if your ignorance is shared by a lot of people, you have high scores. Lately I add -stackoverflow to my internet searches. To much ignorance and stubbornness  is their mark."}, {"author_name": "Fed Up", "gravatar_hash": "5658ffccee7f0ebfda2b226238b1eb6e", "author_url": null, "date": "Oct 08, 2012", "message": "@Mr Man\n\n\"The fundamental problem with SE sites (and the reason they will continue to degrade until something is done) is that moderator powers are given to people as a reward for their knowledge — NOT for having good moderator skills.\"\n\nYou summed it all up right there.  The best thing they could do for this site would be to simply get GOOD moderators.  Rather than treating symptoms, they'd be fighting the disease.  It's a simple if/then formula.\n\nThis site has become a \"forum\" for arrogant a-holes to prove their superiority and self-proclaimed excellence by spitting down upon those whom they deem to be of lesser intelligence."}]}