{"response": [{"author_name": "Daniel", "gravatar_hash": "a6f769d150aa072ac88620414706dd3c", "author_url": "http://apple.stackexchange.com/users/9388/", "date": "Apr 20, 2012", "message": "Lauren, this is a great summary of some of the great work CHAOS has been doing. The amount of effort and participation the Ask Different promotion generated absolutely blew my expectations out of the water. The bars were set quite substantially high, and people put in many times higher effort into the site than is typical to try to achieve them.\n\nWe definitely got some new users out of it, and got some existing users more actively involved. Plenty of great content got posted.\n\nThere is one more thing to keep in mind, though, and that is the post-promotion exhaustion that has hit the site in the weeks since the end of the promotion. There was an amazing surge during the contest, but participation has fallen below pre-contest levels since the end of it. I suspect this is a short term phenomenon, and the long term results will be a stronger site, and in any event, the posts during the promotion are now a searchable part of the mass of expertise compiled on Stack Exchange. But that is worth considering.\n\nThe other side effect of the promotion was that our meta site became far more active than is typical. As this comment is but one example, apparently, we Ask Different-ers are quite prone posting long rambling reflections about the effect of the promotion on our community. :-)"}, {"author_name": "Lauren", "gravatar_hash": "5114f4806122259270d5da20a3039960", "author_url": null, "date": "Apr 24, 2012", "message": "Thanks for the feedback Daniel! I was surprised by the increased activity on meta as well. It was awesome how involved everyone got in brainstorming ways to improve for next time, and in clarifying the rules when necessary. \n\nThe decrease in activity after the promotion is certainly something to think about. It's possible that slightly shorter promotions might have the same benefits but not result in this \"post-promotion exhaustion\", as you put it. We'll have to keep that in mind."}]}