{"response": [{"author_name": "msh210", "gravatar_hash": "78a50094ca87aaed01e076f4c8808ed8", "author_url": "http://judaism.stackexchange.com/users/170/msh210", "date": "Apr 25, 2012", "message": "\"The knowledge that went into these sites is not lost.\" Why not close it to editing, leaving existing questions up as read-only with a banner indicating site closure? That way not only is the knowledge not lost, it's Googlable."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Apr 25, 2012", "message": "@msh210: because there's no maintaining that. This is one of the biggest problems with \"quiet\" sites already - not enough activity for the posts to be reviewed, ranked, and updated. We saw this with the SE 1.0 sites, where eventually the task wore out even tiny handful of users who remained. \n\nIf someone wants to host these - or move them to another SE site in cases where that's appropriate - the destination implicitly accepts some responsibility for what they're putting on The Internet. \n\nThat said, one of the ideas we're looking at for the next-gen Area 51 is just such a \"lock down\" mode, where a certain amount of \"janitorial\" meta-moderation would be accepted - required - before any new content could be submitted."}, {"author_name": "y", "gravatar_hash": "ff6743d246ec567470aba9699d7ec232", "author_url": null, "date": "Apr 25, 2012", "message": "Ha, and yet somehow, Biblical Hermeneutics is still up"}, {"author_name": "ladenedge", "gravatar_hash": "1bc300f86fb4a767d643b1868e3fb32e", "author_url": null, "date": "Apr 25, 2012", "message": "Probably the right choice to clean things up when they stagnate, though I'm sad to see our work zipped up on an FTP server somewhere.\n\nMy thanks to everyone involved with these sites while they lasted!"}, {"author_name": "Manishearth", "gravatar_hash": "0a3069491bfded90cdf623341cadc1d1", "author_url": null, "date": "Apr 25, 2012", "message": "Hey, @shog9, could you leave them open for a bit longer in migration only mode? TP.SE and Astro.SE have some overlap with Phy.SE. We could take in the questions that fall within the overlap, IMO (i've asked a mod about this, pending reply)\n\nAfter all, they _can_ be curated well on P.SE.. So the review issue is moot.\n\nIf the mods agree, then maybe we could add a bit to the site banners on migration."}, {"author_name": "Gareth Simpson", "gravatar_hash": "254ca3f1a5c9a73c20cbac880b8985a7", "author_url": null, "date": "Apr 25, 2012", "message": "Aren't you just creating link rot here?\n\nThey may not be thriving but do they genuinely not have *any* good questions?\n\nWhat would it take to just freeze these sites?"}, {"author_name": "Robert Cartaino", "gravatar_hash": "9dfd656461a1d0a2db33f3ed4183f4c0", "author_url": "http://stackoverflow.com/users/98786/robert-cartaino", "date": "Apr 25, 2012", "message": "@Manishearth Yes, the sites are being left open for a week+ specifically to make those types of arrangements. Questions can be migrated, where appropriate... and communities can use this time to organize and figure out how they are going to come back stronger the next time around... if that's what they want."}, {"author_name": "James Gifford", "gravatar_hash": "de85c185f39ef9feef79d9933409d400", "author_url": "http://jamesrgifford.com", "date": "Apr 25, 2012", "message": "And yet somehow, Onstartups is still in beta. Just give them a full site already. :)"}, {"author_name": "Guy Manningham", "gravatar_hash": "da4a23d92967bb8b3a531dbc32877421", "author_url": "http://guymanningham.com", "date": "Apr 25, 2012", "message": "It's sad to see those categories go as economics, literature, firearms and healthcare are topics I feel society should take more about, but I understand where you are coming from. Sometimes you just have to trim the fat."}, {"author_name": "rjcup3", "gravatar_hash": "26f8b2db16df24a02904a8848b9f09e6", "author_url": null, "date": "Apr 25, 2012", "message": "@Guy, I think people should talk more about healthcare too... but Healthcare IT and Theoretical Physics are a little esoteric so I'm not surprised by these. I didn't even know there was a Firearms one or I'd have been on there every day... too little, too late."}, {"author_name": "Almo", "gravatar_hash": "867c75a2d17ed1f6877aef2e71167dee", "author_url": null, "date": "Apr 25, 2012", "message": "I didn't know those existed, because they're not listed at the bottom of the StackOverflow page with a little colored block by it. I thought all stack exchange sites were listed there."}, {"author_name": "ChrisF", "gravatar_hash": "ee006a67bbbb535dc04afc6a03b1843f", "author_url": null, "date": "Apr 25, 2012", "message": "@Almo - the graduated sites are listed at the bottom of Stack Overflow,  Super User, Gaming etc. The beta are listed at the bottom of other beta sites.\n\nIt's not ideal and if you have better suggestion than an dirty great list of links post it on Meta Stack Overflow."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Apr 25, 2012", "message": "@Almo: only graduated sites are listed there; beta sites are expected to have some legs on them before they get that much network exposure. This goes back to the original idea of a staged site-creation process, wherein a site can be turned off at any time before graduation if it loses steam.\n\n They *are* all listed on the <a href=\"http://stackexchange.com/sites\" rel=\"nofollow\">Stack Exchange homepage</a> though."}, {"author_name": "Arnold Neumaier", "gravatar_hash": "bead9ff6ddc7c095d18968ec950edb4d", "author_url": "http://www.mat.univie.ac.at/~neum/", "date": "Apr 25, 2012", "message": "I think that Theoretical Physics should simply be migrated to Physics. Then discussion can go on and the work invested in the site is more accessible than when the site is closed."}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Apr 25, 2012", "message": "Agreed, why not just merge theoretical physics into the physics site, where it probably belongs anyways?\n\nAnd while we're at it, merge all the questions from the old Go site into the board and card-games site."}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Apr 25, 2012", "message": "@Almo @ChrisF http://stackexchange.com/sites#"}, {"author_name": "Josh Gitlin", "gravatar_hash": "97ca2e94ba373515aa387feee67d613e", "author_url": "http://josh.gitlin.name", "date": "Apr 25, 2012", "message": "Seeing this trend, is there anything concerned diamond moderators of other Stack Exchange site that are currently in beta can do to prevent this from happening to our own sites?"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Apr 25, 2012", "message": "@Josh: Robert went over this <a href=\"http://blog.stackoverflow.com/2010/10/when-will-my-site-graduate/\" rel=\"nofollow\">in the previous blog post</a>: the most basic things to check are the Area 51 stats (visible to everyone) and the site analytics (visible to moderators) - if questions asked, voting, traffic, etc. is growing - even slowly - you're probably ok. \n\nWhen a site still looks pretty much as it did 6 months ago, when the Area 51 page is mostly red and orange, that's concerning. As mentioned, we're pretty reluctant to pull the plug, but if you're not already concerned well before that point, then you're probably not paying attention."}, {"author_name": "Joe", "gravatar_hash": "fcb6a57f741812924a5ded7bfee22d12", "author_url": "http://qwiple.com", "date": "Apr 25, 2012", "message": "There is a firearms SE! No way!...wish I knew that..."}, {"author_name": "Almo", "gravatar_hash": "867c75a2d17ed1f6877aef2e71167dee", "author_url": null, "date": "Apr 25, 2012", "message": "Ah, right. These were betas. I misunderstood that. Thanks for the info, guys."}, {"author_name": "Kiru", "gravatar_hash": "596e7cfcc68c6711dced05001e3bf746", "author_url": null, "date": "Apr 25, 2012", "message": "@BlueRaja: Regarding \"And while we’re at it, merge all the questions from the old Go site into the board and card-games site.\"\n\nNot only was this done (look at http://boardgames.stackexchange.com/questions/tagged/go), but even the really cool board display widget that was built for go.SE was moved over, so it allows board diagrams like this: http://boardgames.stackexchange.com/questions/6387/second-line-invasion-of-two-space-extension"}, {"author_name": "Kieron", "gravatar_hash": "f53022f14c3d89d45a808e38dd258849", "author_url": "http://www.kieronlanning.co.uk", "date": "Apr 25, 2012", "message": "Congratulations. You've made a community or communities, and then reigned down fire and brimstone at will, all because it doesn't fit within your understanding or knowledge base.\n\nIt's a sad state.\n\nEnd of my rant, sorry. Had to 'get it out there'."}, {"author_name": "Rick Ross", "gravatar_hash": "d4dbdd6944843ab0e49ad69513785206", "author_url": "http://answerhub.com", "date": "Apr 25, 2012", "message": "More than half of the top 10 sites that were on the original StackExchange system (before Joel and Jeff's democracy experiment) have successfully migrated to DZone's social Q&amp;A solutions, AnswerHub and OSQA. Of course, many others who weren't in the top 10 also migrated, and we have been happy to help all these sites continue to thrive.\n\nIf StackExchange is willing to give the full (non-sanitized) data dumps to the site owners, champions (or whatever they should be called) then DZone could easily help these sites continue to try to go it alone. It would be a pity to see the sites completely shut down simply because they didn't hit the traffic and traction levels required for them to stay as part of the amazing StackExchange network.\n\nAnyway, I don't want to ruffle any feathers. I'm just saying it would be fairly easy for DZone to help these doomed sites get a stay of execution and have a new lease on life. We'd be happy to do this, and I think the users of these communities would discover (as hundreds of thousands of other StackExchange users have) that AnswerHub and the DZone social Q&amp;A systems are a joy to use and operate.\n\nIf you are a principal of one of the sites in question and want to get some help, feel free to email me at rick@dzone.com or give us a call. Our number is at the bottom of every page of http://answerhub.com.\n\nPeace,\nRick Ross"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Apr 25, 2012", "message": "@Rick: if by \"non-sanitized\" you mean \"with personal information, login credentials, and voting history intact\" that's not going to happen; I'm rather horrified you would suggest it. \n\nThe data-dumps contain enough information to satisfy the attribution requirements of the CC-SA license without jeopardizing anyone's privacy. If you can offer an import path for these into OSQA, I'm sure many here would find that information helpful...\n\nIf you <i>can't,</i> then I respectfully ask that you refrain from advertising in the comments here."}, {"author_name": "Benjol", "gravatar_hash": "501465a53bf1042de206d7d79cc68942", "author_url": null, "date": "Apr 25, 2012", "message": "@Shog9, your horror seems slightly overwrought to me. And the 'you can recreate from data dumps' claim disingenuous. With the data dump you can recreate a static site, you can't recreate the community. As such, the data dumps (in my opinion) are fairly useless for continuing the life of the site. \n\nIn other words, you seem to be offering reincarnation, but all we really get is a mausoleum.\n\nThat aside, this sentence intrigues me: \"one of the most frequent stumbling blocks for new sites has been the learning curve for folks unfamiliar with Stack Exchange – providing them with help and guidance is key to creating a vibrant, healthy site\". Do we get to participate in any of this on meta, or are you keeping this info to yourselves?"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Apr 25, 2012", "message": "@Benjol: depends on whether you're interested in preserving the content, or the user accounts. I'm not entirely certain what Mr. Ross is referring to by \"non-sanitized\", but the sanitizing I'm aware of is intended to prevent the release of personal information per our <a href=\"http://stackexchange.com/legal/privacy-policy\" rel=\"nofollow\">privacy policy</a>, which is... sorta important. If there's some other issue with the data-dumps, bringing that up on Meta would be the right way to go.\n\nAnd yeah, this'll all be hashed out on Meta once we have something a bit more concrete to discuss... There's a *lot* that needs to be discussed. Consider this the opening round: problems with the current process that we can't ignore anymore."}, {"author_name": "Rick Ross", "gravatar_hash": "d4dbdd6944843ab0e49ad69513785206", "author_url": "http://answerhub.com", "date": "Apr 26, 2012", "message": "@Shog9, it's your network of sites and your rules, so it's obviously your call.\n\nStill, I think @ Benjol makes a good point when he says that \"horrified\" seems slightly overwrought. StackExchange horrified a lot of site owners when it abandoned its original direction and switched to the model that has now left these sites on death row. Those site owners had invested tons of time and energy to build awesome Q&amp;A communities and suddenly found themselves high and dry.\n\nAsk Splunk, Dyn, Redgate, Unity, Moms4moms and the many others who found a safe home on AnswerHub or OSQA and continue to thrive today as a result. If they hadn't been able to download non-sanitized (meaning \"complete with all the actual, useful member data\") then none of those sites would have been able to survive.\n\nDZone has no interest in violating anyone's privacy, and I guess the announcement of the sad end for the sites in question is really just the predictable outcome of the model and rules they chose to live with. I wouldn't have made that choice in the first place, but I guess that's why I left the StackExchange network early and created AnswerHub and OSQA as alternative options that now work for tons of happy users every day.\n\nWe were just offering an alternative to the doomed sites. As I said, it's your network and your call. @Benjol is right, however, when he says, \"In other words, you seem to be offering reincarnation, but all we really get is a mausoleum.\"\n\nPeace,\nRick"}, {"author_name": "CodeInChaos", "gravatar_hash": "de77f20e754d01f28466b3bfe992da40", "author_url": null, "date": "Apr 26, 2012", "message": "Assuming the dumps have the same format as the normal data dumps, they'll contain a md5 hash of the email address(unfortunately not validated). This could be used to write a \"reclaim account\" feature on a third party site.\n\nI also never got the impression that SE considered IPs and email addresses secret, considering how willingly they published single iteration, unsalted hashes of those."}, {"author_name": "MrCranky", "gravatar_hash": "e7a4ade480c328302159251ee8ca553d", "author_url": null, "date": "Apr 26, 2012", "message": "I'd certainly object if someone 'migrated' my account from a SE site to another site: and that certainly wasn't what I signed up for when I joined the sites I do contribute to.\n\nIt seems to me that if some members of the community do want to migrate, then a button to allow them to opt-in is the way to go. I.e. the ability to export the 'private' information from the SE site, either directly to the other site, or to a local file which can then be uploaded to another site which can interpret the data and re-constitute the community member on the new site. But that requires a) support from the new site for such a function, and b) the SE team to write such an exporter.\n\nFundamentally, while respecting privacy concerns should be foremost, this data is about me, and so I'd like to think I have the option of what to do with it. If I'd like to shift that data elsewhere, it would be good to be allowed to do that. Otherwise it's essentially holding valuable information hostage, which is not I'd associate with a forward thinking and open set-up like SE."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Apr 26, 2012", "message": "@Rick: I love OSQA, and have always been happy to know there was an alternative that supported Stack Exchange users in this way. But frankly, you're being obnoxious here: if you want to offer a way to import SE 2.0 data dumps, start by <i>offering a way to import SE 2.0 data dumps</i>.\n\n@CodeInChaos: that's pretty clever, I never thought of that... Could even potentially allow matching unregistered (cookie-based) users. Biggest advantage? It's tough to reverse - I'd have to opt into the association before you could be sure of my actual address."}, {"author_name": "warren", "gravatar_hash": "236948f12dbe8789edb8238298c61593", "author_url": "http://antipaucity.com", "date": "Apr 26, 2012", "message": "So- with all the comments herein, what's it going to take to get any of the sites delisted from the retirement target?"}, {"author_name": "Dave Mays", "gravatar_hash": "8fe7ff8f4f528f30d1fc9b58dae51832", "author_url": "http://davidmays.com", "date": "Apr 26, 2012", "message": "Well, that's pretty disappointing.\n\nAs one of the moderators of the now doomed Firearms SE, I can pretty much guarantee that it will be hard to convince me to put any effort into any other new SE sites.\n\nWhat a complete and total put-off."}, {"author_name": "Feral Oink", "gravatar_hash": "8cce7b70d30f42045bc6c8569f5549e2", "author_url": "http://myindigolives.wordpress.com/", "date": "Apr 27, 2012", "message": "@Benjol Would you consider the two sites that I have spent countless hours as non-moderator, just mere loyal beta user, Literature and Economics? I would understand if they didn't fit the context of DZone. \n\n@Rick Ross suggests some other sites, that based upon their names, might be better matches for Economics and Literature than DZone.\n\nI think that Economics had particularly high-quality content. I would like to ask around to see if there is some way that that content could be preserved.\n\n@shog9 I do NOT believe that your reaction was overwrought, nor hysterical. You ARE correct. Privacy policies and adherence to such are very important! And for those that do not know, I was seething, hopping mad over a separate matter, at @shog9 a few days ago. I concur with the veracity of his comments here, despite my (evil ad hominem) inclination to do otherwise.\n\n@CodeInChaos You said <blockquote>I also never got the impression that SE considered IPs and email addresses secret, considering how willingly they published single iteration, unsalted hashes of those.</blockquote> Seriously, there is a big difference between publishing unsalted hashes, and handing over a spreadsheet of user names, user ID's, IP addresses and email addresses in four columns to another website. (Perhaps passwords too, for a fifth column?) I don't want another website to know that about me!\n\n@MrCranky I'm of the same mind set as you. Notification and opt-in is the right thing to do.\n\nI think, am not certain, that @Benjol and @Rick Ross are saying that the content of a discontinued StackExchange beta site would not be worthwhile without the associated user names, email addresses, question and answer history etc. Is that interpretation correct? If so, I don't understand. Why not just bring that content over as seed material, if okay'd by users like me and @MrCranky? It would be useful in its own right. Maybe I'm missing something.\n\nFinal thought: Perhaps Economics SE could be merged into Quant SE, thus further ensuring the survival of the latter? Similarly, some of Literature SE's content could be migrated to Sci-Fi SE. \n\nSorry, @shog9 as I think you said there would be opportunity for further discussion on Meta SE. This typically verbose comment of mine is long enough. Your post was an announcement, and not the right venue for a discussion of next steps. I just am feeling a little sad though."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Apr 27, 2012", "message": "@Feral Oink: thanks for your comments - here or MSO is fine. You might be interested in the discussion here regarding migration from Econ to Quant: http://meta.quant.stackexchange.com/questions/291/economics-se-is-closing-do-we-want-some-of-their-questions\n\n(There are similar discussions on the respective metas for Theoretical Physics -> Physics, Astronomy -> Physics, and Literature -> SciFi; I haven't seen any discussion of Firearms -> Great Outdoors yet, but this may also be a possibility for some questions)"}, {"author_name": "warren", "gravatar_hash": "236948f12dbe8789edb8238298c61593", "author_url": "http://antipaucity.com", "date": "Apr 30, 2012", "message": "If the questions are migrated to other SE sites, will our earned reps be migrated, as well?"}, {"author_name": "bill", "gravatar_hash": "19bb06ad8385d82922210e8d2ab9a7ec", "author_url": null, "date": "Apr 30, 2012", "message": "\"all content on closed sites will be available for download from the Area 51 page corresponding to each site\"\n\nI apologize for my ignorance, but can you provide more details on when, how, etc. for downloading the content?\n\nThanks!"}, {"author_name": "Jeremy", "gravatar_hash": "b570bdd4adf100e58326fe78bbbbf0a3", "author_url": null, "date": "May 02, 2012", "message": "I don't disagree that dormant sites should be archived, but the only warning I see on Area 51 is \"If the site does not get used, it will be deleted.\" What constitutes use? Exactly how long is a site allowed to exist in beta before getting shut down? Astronomy is just shy of a year, but Firearms is barely 6 months in."}, {"author_name": "bill", "gravatar_hash": "19bb06ad8385d82922210e8d2ab9a7ec", "author_url": null, "date": "May 03, 2012", "message": "@Shog9, the decision to shut these down was difficult, i'm sure, but the lack of content may be due to factors other than lack of interest. Given more time, they could take off. Yes, the content could move elsewhere, but losing the StackExchange environment would be terrible. Certain topics may just need more time and visibility, rather than a death sentence.\n\n- Is there a way to save a site once it's been targeted for termination?\n\n- The traffic to sites is probably limited to the few who knew the sites existed. Given that, would it be possible to put these sites on probation to see if more traffic can be generated?\n\n- Regardless of the outcome, how/where/when can one download the content?\n\nThanks."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "May 03, 2012", "message": "@bill: Once a site has actually closed, the Area51 page from which that site was created will indicate this AND contain a link to the data-dump. \n\nIn response to your other questions:\n\n- Beta sites are effectively \"in probation\" from <i>day one</i>. That's the whole point of <i>having</i> a beta period.\n\n- There's always the potential for a site with the same or a similar topic and audience to be proposed again and created. In fact, we're working on making this easier."}, {"author_name": "Jason", "gravatar_hash": "7a2fcdcadc7697ee6cc4552a2bc2c701", "author_url": null, "date": "May 04, 2012", "message": "Having just downloaded the datafile from one of the closed sites, I'm surprised that there isn't any salt in the md5 hash of the user email addresses.  Combined with other information in the files, it is therefore possible to develop a shortlist of possible matches, then sort out which of the possibilities is the user in question.\n\nOr, see http://meta.stackoverflow.com/questions/21117/is-using-gravatar-a-security-risk"}, {"author_name": "Alfredo O", "gravatar_hash": "4f7841fef366c37d2f6fe94f7d7031c9", "author_url": null, "date": "May 11, 2012", "message": "This makes me wonder if I should still participate on betas. At least I've been active on Spanish.SE and I've invested lot of time and effort that would mean nothing if it is closed too."}, {"author_name": "Henning Makholm", "gravatar_hash": "f76d986b54e90fa6c431160e9a0796cd", "author_url": "http://blog.henning.makholm.net/", "date": "Jun 12, 2012", "message": "Of course the email address hashes are unsalted, but that should not surprise anyone. Unsalted email address hashes are a part of the Gravatar image URLs -- that's how the system works; which is public information and should surprise nobody. Thus, you don't need to go to a data dump to get the unsalted hash of some user's email address; just look at his/her profile page, or any of his/her postings, or the user list."}]}