{"response": [{"author_name": "Ivo", "gravatar_hash": "f7ae8c8fb83e502a854e2db3410f3827", "author_url": null, "date": "Jan 22, 2010", "message": "Too bad I don't get to show off my SuperUser rep instead of my StackOVerflow rep... Perhaps it would make my CV actually look worthwhile ;-)"}, {"author_name": "Amadiere", "gravatar_hash": "6c0b8eb63403dade08c2446febdf88f5", "author_url": "http://www.amadiere.com", "date": "Jan 22, 2010", "message": "Still waiting for my first hit (that isn't me!) on my CV, but I lay in wait - patience, patience :)\n\nHowever, really liked the process and it's been really simple and everything I thought may or may not be available, almost always was. I look forward to seeing it grow!\n\nIronically, the CAPTCHA is a perfect representation of how I feel: \"concept respect\"."}, {"author_name": "paxdiablo", "gravatar_hash": "a6e7ad8582ac390cd668b2b0d6b3058c", "author_url": null, "date": "Jan 22, 2010", "message": "It seems to me that a good feature would be to anonymously (i.e., before having to create a CV) see what jobs are currently on offer.\n\nOr have I just missed that feature somewhere?\n\nOf course, it may be that the site is more dedicated to letting employers locate potential employees rather than the other way around."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Jan 22, 2010", "message": "&gt;  \"I’m facing a job offer providing a 30% raise … what sucks is I like my current job!\" \n\nThis is what I worry about with careers... much of the value proposition for SO Careers at both ends is about eliminating this kind of thing.  Employers aren't supposed to see candidates who are happy in their current job, and therefore are more likely to find the right person quickly.  Job seekers aren't supposed to have to compete with people who aren't actively looking, and therefore stand out easier.\n\nOh, and something I noticed: the font here made the word \"click\" in that post look like... something else.  I had to stop and double because that sentence just didn't make sense the first time. :D"}, {"author_name": "Joel Spolsky", "gravatar_hash": "d77663c217e9d27b725338c06674c94b", "author_url": "http://www.joelonsoftware.com", "date": "Jan 22, 2010", "message": "Paxdiablo, look at http://jobs.stackoverflow.com/"}, {"author_name": "Paul", "gravatar_hash": "e1fa70206ee3a74e62c337d942833092", "author_url": null, "date": "Jan 22, 2010", "message": "Ivo,\n\nYou should be able to associate your SuperUser rep with your account. Go to the 'accounts' tab, associate your careers account with your SuperUser account, and then choose 'show on CV'. At least, that works for Server Fault..."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Jan 22, 2010", "message": "@Joel -  re: \"Paxdiablo, look at http://jobs.stackoverflow.com/\"\n\nAre you saying that this is essentially the same set of employers, or is this just a suggestion to look at a site that follows diablo's request?\n\n(In either case I suspect there is significant overlap)"}, {"author_name": "Donal", "gravatar_hash": "8b2d39a59a961ef26440e9c1453d1939", "author_url": null, "date": "Jan 22, 2010", "message": "I still think there's an unfair imbalance between the information available to employers and employees. Specifically, employers can see entire an employee's entire resume, whereas all an employee can see is the employer's location. \n\nI feel like the employer search stats are nothing more than a token offering to placate those who have complained about this in the past. Why not show some identifying information (e.g. company name) that would enable one to find the wmployer's websie and see what they're really about?"}, {"author_name": "Entity", "gravatar_hash": "e326f7efc603a1881cd645d22a663de2", "author_url": "http://www.vbs2.com", "date": "Jan 22, 2010", "message": "@Donal\n\nI think the reason for that is to prevent employee's from modifying their CV or tags so they get to the top of the list or get listed the most. Or aka gaming the system that is bound to happen with any software."}, {"author_name": "Stan R", "gravatar_hash": "827376538df1bcd56e078d1b3d70ec0c", "author_url": null, "date": "Jan 22, 2010", "message": "@Joel, that is the exact reason why I haven't published my CV."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Jan 22, 2010", "message": "+1 Donal - I agree - I think more people would use it if they provided more information about the employers."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Jan 22, 2010", "message": "But I think that this service is really meant for the employers, regardless of what Jeff keeps saying.  It appears it really is aimed at solving Joel's issue of finding/targeting good people.  I think they want to set themselves apart from other services and this is a way to do it.\n\nUnless there is pressure from the \"buy side\" I don;t think this is going to change.  So, all you folks who have employer accounts and want this, make your voices heard."}, {"author_name": "Douglas", "gravatar_hash": "f85ec2f945e2a068416d727ed9ca40d7", "author_url": null, "date": "Jan 22, 2010", "message": "Still waiting for my first hit. I liked the process of setting up my CV though."}, {"author_name": "Shy", "gravatar_hash": "749b73007119baf94fc077c50bcc58e8", "author_url": null, "date": "Jan 22, 2010", "message": "Before paying you to publish my CV I'd like to know if you even have employers registered from my country.. (Israel). How can I do that?"}, {"author_name": "Jonik", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Jan 23, 2010", "message": "@tim, jobs.stackoverflow.com is <i>not the same set of employers; it is simply a more traditional job board, if you (as a would-be employee) want to do the searching. Careers is what paxdiablo suspected: \"more dedicated to letting employers locate potential employees rather than the other way around\". (It's all in the About page and FAQ.) Still, this doesn't mean the service \"is not meant for employees\". I mean, if you file a CV, someone eventually finds it, and you end up with a great job, then you benefit too, eh? Of course the key question is how well it catches up with <i>both</i> developers and employers.\n\n@Shy: you cannot check that now, afaik (possibly not even after you've paid up). I agree that one should definitely be able to see that information."}, {"author_name": "Ben Martin", "gravatar_hash": "549f1e4a61e9284aab77354073461aac", "author_url": "http://careers.stackoverflow.com/ben-martin", "date": "Jan 24, 2010", "message": "For the searches stats, would it be better if it was based on the last 50-100 searches?\n\nSince the information was added to the site the list has not changed that much."}, {"author_name": "MysteriousGuy", "gravatar_hash": "728e5309ef7f1d975a9a1ff48b6232f3", "author_url": null, "date": "Jan 24, 2010", "message": "It's great to see some success stories coming out of this, that's a good indication it'll be around for a while at least ;)\n\nThere still seems to be a big problem for international customers though, if my search stats are any indication.  So here's a question for Joel and Jeff - how can we help push international employers to be your customers?  Link to you?  Rave about careers on our blogs?  Sing the careers lingo at user group meetings and conventions?\n\nNon-US customers need lovin'."}, {"author_name": "Wim Hollebrandse", "gravatar_hash": "5f4106ce061d0d3f0391030f19c517b8", "author_url": null, "date": "Jan 25, 2010", "message": "The reason you're not seeing some of the information, like what employers listed in your country or more specifically area is to do with the current lack of employers I think.\nIf as an job seeker, you see no employers listed in your state/province, it may prevent you from actually publishing your CV. That means, less leverage to get just these employers on board!\n\nChicken and egg story really."}, {"author_name": "Eric", "gravatar_hash": "357b3cd2ae59c07c390a96af649ad65e", "author_url": null, "date": "Jan 26, 2010", "message": "http://www.inovahire.com , the only 100% FREE job board and live interview website, is now available in the USA, United Kingdom, Canada, Germany, China, India and Australia.\n\nJob Seekers:\n*Upload your resume and up to five work examples.\n*Search for and apply to jobs in any country.\n*Be interviewed live online via webcam (optional)\n*Dozens of additional unique features.\n\nEmployers:\n*Upload jobs individually or upload a job xml feed (for any country)\n*Search for and find talent in any country\n*Interview job seekers live online using a webcam (optional)\n*Dozens of additional unique features.\n\nThank you for your time and we hope you love the site. http://www.inovahire.com \n\nSincerely,\n\nEric Schifone\nCEO, InovaHire.com\n“The best things in life are free.”"}, {"author_name": "Ronald", "gravatar_hash": "b2896eaafd7ead3a3063a9162aa1dcce", "author_url": null, "date": "Jan 28, 2010", "message": "Haven't had any search hits yet, but that's probably because I live in Canada.  Until this hits critical mass its pretty useless."}, {"author_name": "Pierre", "gravatar_hash": "c77e00209cd87ff20cfe06a0c5434788", "author_url": null, "date": "Feb 03, 2010", "message": "It seems that CSO is a massive success in the states. I wish it was so in Europe. Do you have any strategies for breaking into the European market? Otherwise I just feel a bit daft for signing up. 1 view is what I have accumulated. In four months. And I am actually looking for a job. There's a real possibility that it is I who am at fault here. That I'm just not interesting enough. In that case I would suggest some sort of feedback service. Any would do, really."}, {"author_name": "Andi Gibson", "gravatar_hash": "1081fa7797df422b5a3f373e953e4850", "author_url": "http://www.zero7web.com", "date": "Feb 19, 2010", "message": "I love the idea of this and look forward to checking it out in more detail shortly.\n\nWell done again SO.\n\nAndi \nZero7Web"}, {"author_name": "tattoo designs for women", "gravatar_hash": "cea0b759e92b9adb591a63e7a84b1caa", "author_url": "http://tattoo-designs-for-women.info", "date": "Sep 05, 2010", "message": "SO is giving the chance for people, especially for those who are unemployed, to find a job without trouble. This is a good way of sharing job opportunities to all people.\n\nWay to go SO!"}, {"author_name": "melissa", "gravatar_hash": "1c6da8c3e4fe7d7ad1734c049de98a9a", "author_url": "http://www.dreamthingsunlimited.com", "date": "Jun 30, 2011", "message": "there are so many way that you can succeed!\nit is so important to learn from other peoples success stories.\nhttp://su.pr/2BSui2"}, {"author_name": "Resume Writing Help", "gravatar_hash": "0fa698d131f87b64c76f4f65fb6e9741", "author_url": "http://www.cpresumes.com", "date": "Sep 23, 2011", "message": "This was a very informative post, and I appreciate the insight. This will help me greatly with my job search."}]}