{"response": [{"author_name": "Igal Tabachnik", "gravatar_hash": "c12b67ddd060aa0abbb59da1b0da3530", "author_url": "http://www.hmemcpy.com/blog", "date": "Jan 16, 2010", "message": "Have a look at how Facebook implemented this - when you type a @ in the text field, it hints you to start typing a name, then it populates the matching names as you keep on typing. Perhaps the completed name should be the username as it appears in the profile url, such as @jeff-atwood"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 16, 2010", "message": "Remember, \"we don’t want Stack Overflow to turn into a social networking site for chatty cathys, so there’s only so far we will go in supporting pure conversation\"\n\nI prefer the twitter implementation, personally -- just type the username in. Even better, since we support least-character matching, you only need to type enough to make it unique for that particular set of comments."}, {"author_name": "ShuggyCoUk", "gravatar_hash": "33ac6a3ce34a41c661fdea54feab66b4", "author_url": null, "date": "Jan 16, 2010", "message": "might I suggest for those people called Al Whatever that you accept '-' as space. Seems a shame to screw over those people with 1/2 character prefixes.\n\nanyone with the data dump to hand who can let us know the number of affected &gt;1 rep users?"}, {"author_name": "Lucas", "gravatar_hash": "2083165026d11a172ce52453237d294c", "author_url": "http://www.stackoverflow.com/users/56555", "date": "Jan 16, 2010", "message": "I'm glad to see this feature implemented. I still would like have @Jon Skeet linked to Jon Skeet's profile page (see my meta question: http://meta.stackoverflow.com/questions/9652/), but like Jeff said this is a nice compromise."}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Jan 16, 2010", "message": "While reviewing improvements to the comments feature, you forgot to mention the recently added ability to edit comments and how that works."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 16, 2010", "message": "Dennis -- DOOHHHHhhh lol.\n\nAdded, thank you!"}, {"author_name": "Strilanc", "gravatar_hash": "2418cf397adaa4f72547f14e61348028", "author_url": null, "date": "Jan 16, 2010", "message": "I suggest ignoring spaces in the name when performing the match. @AlJones should match Al Jones."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jan 16, 2010", "message": "I thought users were already notified if someone put @fullusername in a comment, is this not true? Also, I understand the notion of not wanting it to turn into something for \"chatty cathys\" (well, not really, I don't think that makes any sense but I'll leave it be) but it seems like if there is a comments system then it should support enough to be entirely clear."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 16, 2010", "message": "> I suggest ignoring spaces in the name when performing the match. @AlJones should match Al Jones.\n\nThat's an excellent idea!\n\n> I thought users were already notified if someone put @fullusername in a comment, is this not true?\n\nThis is not true.. or at least, it was not true until last night.\n\nhttp://meta.stackoverflow.com/questions/2035/notify-user-when-their-name-is-mentioned-in-comment"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Jan 16, 2010", "message": "Allow me to shamelessly plug my Greasemonkey script which auto-completes \"@us\" to \"@username: \", when you hit [Ctrl] + [Space]. Now it's even more useful! :)\n\nhttp://meta.stackoverflow.com/questions/30085/greasemonkey-script-to-assist-twitter-style-replies-in-comments"}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Jan 16, 2010", "message": "That's a pencil? I thought it was an exclamation point!"}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jan 16, 2010", "message": "Can I recommend allowing @id? I will always be User 91 on SO, even if I ever change my name. So people should be able to write \"@91: have you tried fire?\" and SO should find me (and also change 91 to my name on display). That would remove all ambiguity and would even allow us to leave comments for MSO user 52443 reliably :)"}, {"author_name": "Johannes Rössel", "gravatar_hash": "d54ed51c0f03cb461741c3ec77a837b2", "author_url": "http://hypftier.de", "date": "Jan 16, 2010", "message": "Saying you don't want the site to turn into a social network for chatty people and using Twitter's (imho very ugly) way of referring to persons on the other hand seemingly contradicts itself a little.\n\nNote that this is based purely on personal taste and may not be accurate for others; maybe I'm even the only one thinking so. But what about the simple, yet widely-accepted way of referring to other persons by the way of name + colon? I find\n\n  \"Johannes: Foo is not bar\"\n\neasier to read, parse and it matches normal prose which I can't really say for the @. I see that more as \"Hey, we look like Twitter, if you like talking about what you ate this morning and communication via text messages, then welcome.\"\n\nAgain, that's my personal take and I never *used* Twitter; I just found it really hard to follow actual conversations (well, and find actual content—there isn't much you can cram into 140 characters so I just went back to plain ol' RSS).\n\nBut I'd really like the [user] + \":\" at least as an alternative."}, {"author_name": "B", "gravatar_hash": "608923fbf1c72405f333c5501b1af1aa", "author_url": null, "date": "Jan 17, 2010", "message": "Johannes: It is much easier to unambiguously match @name as a reply to someone, compared to your method. I am also not a twitter user (I might read a twittered thing or two a week) but I find that syntax useful outside of twitter.\n\n(I also think that twitter should link @name in tweets to a matching timestamp in the reply-to'd stream (since its completely useless for others to follow a conversation as it is now), but now I'm on the wrong site.. off to meta.twitter.com ;))\n\n@Michael: I don't think it is feasible that users should seek out other members user id; however, the system could internally translate the matched name to an id, so that if the replyee changes name the comment is updated with his/her new name."}, {"author_name": "Peter Boughton", "gravatar_hash": "e915239e11bb00291ce4e4b17b83bc66", "author_url": "http://www.sorcerers-isle.net", "date": "Jan 17, 2010", "message": "And there I was hoping SO would implement a feature to reach out of the monitor and thump the idiots in the face every time they used the stupid @name convention.\n\nIn response to B...\nGiven that there is a limited set of users considered (people already involved in the question), it is not difficult to determine probable username references - doesn't even need to be restricted to a \"name:\" form; it is trivial to match on common ways of referring to people, and IF there is any ambiguity, a simple user prompt can be displayed: \"are you referring to user X?\""}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jan 17, 2010", "message": "Excellent - I suspect I'll find this *incredibly* useful. Admittedly most of my comments are on my own posts, but there are enough which aren't to make it hard to follow all the \"conversations\" I'm involved in.\n\nThanks very much for this!"}, {"author_name": "balpha", "gravatar_hash": "b13dce689732844e6590da37048f0eaf", "author_url": "https://twitter.com/balpha", "date": "Jan 17, 2010", "message": "Am I the only one who actually reads @ as \"at\"? This way, it really makes sense to me when there's a comment\n\n&gt; @foobar: That's a good idea\n\n-- I read it as \"(directed) at foobar: ...\" Since this is the most common use, the at-sign is the perfect choice for this. As for those (much fewer) twitter-like statements like\n\n&gt; While it's true what @zaphod says, I would add...\n\n-- in those I always (metaphorically) choke on the @ (\"it's true what at zaphod says\").\n\nAnyhow, great improvement, and let's hope it doesn't lead to too many flame wars because people now actually know when someone says \"@pumpkin: You're wrong\". Obligatory: http://xkcd.com/386/"}, {"author_name": "frymaster", "gravatar_hash": "5b9d566b05196d7cc17e833abae67f21", "author_url": null, "date": "Jan 17, 2010", "message": "at the risk of being exposed as a noob (oh wait, I am a noob!), how do you leave comments anyway? There's no \"leave comment\" option, or comment edit-box, for me... all I see is the edit-box for answering questions"}, {"author_name": "frymaster", "gravatar_hash": "5b9d566b05196d7cc17e833abae67f21", "author_url": null, "date": "Jan 17, 2010", "message": "actually, never mind, I just found another set of FAQs which answered this"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 17, 2010", "message": "As I'm sure you discovered, we require 50 reputation on every site (except Meta) to leave comments."}, {"author_name": "B", "gravatar_hash": "28bdd5298558caad2744c8b32ad913c9", "author_url": null, "date": "Jan 18, 2010", "message": "@balpha: That is *exactly* how I read it.. since that's what it stands for :). Also agree that inline-@ is wrong."}, {"author_name": "Johannes Rössel", "gravatar_hash": "d54ed51c0f03cb461741c3ec77a837b2", "author_url": "http://hypftier.de", "date": "Jan 18, 2010", "message": "Balpha: You don't talk to people by starting with »At Somebody, ...«, right? You start your sentence with »Somebody, ...«. The »at« here is—while understandable—clearly superfluous and no one actually talks like that. I hope, at least."}, {"author_name": "Martin Wallace", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Jan 18, 2010", "message": "I agree wholeheartedly with Johannes Rössel about @Martin versus Martin:  I also don't buy the whole \"it's easier to implement\".  Building software is about rising to the challenge of composing interfaces that are intuitive, not about forcing user behavior into what is easier for the developer.\n\nAt least I thought it was - and Jeff on Coding Horror seems to have been preaching this for a long time."}, {"author_name": "a_m0d", "gravatar_hash": "ea6c23846a2ce0df1dcf549d55ee166d", "author_url": null, "date": "Jan 18, 2010", "message": "Martin, the @Martin is clearly much easier and faster to parse than Martin:.\n\nParsing for @Martin only requires to look through the comment for any occurrences of '@', and then parse the word that follows it.\n\nParsing for Martin: would require either searching for all occurrences of ':', then back-tracking to work out the word before it, or parsing each word individually to see if it ends with a ':'.\n\nTherefore, the '@Martin' approach is both faster and easier to implement."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jan 18, 2010", "message": "Out of interest, how else would you implement it if not with @? Try matching all names and informing all Martin's in the thread just because someone mentioned an essay by Martin Fowler? Humans have the advantage of seeing things in context, but a computer wouldn't understand that \\Oh, and then there was that other Martin with his essays about patterns...\\ isn't a reply to some Martin in the thread, but some bad attempt at making a Martin Fowler In-Joke."}, {"author_name": "Martin Wallace", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Jan 18, 2010", "message": "a_m0d:  You miss my point or I wasn't clear.  I understand the technical issues but I disagree with forcing developer problems on users.  \n\nMichael Stum:  It might be difficult but it sure as heck aint impossible.  A pattern match on all words ending in : would be a start.  Then I could talk about Martin Fowler with impunity.  None of your examples would have matched and prompted a reply.  We don't require the computer to guess what we mean - that's the purpose of having a convention I just feel Jeff has implemented, and developed a convention that is popular in a single medium (twitter) rather than one that is far more wide reaching and understood.\n\nAs Jeff has often written on how bad it is to make users conform to UI and not the other way round it surprised me."}, {"author_name": "Josh Stodola", "gravatar_hash": "ac11bb0472c37bf41ca166ec849d3a02", "author_url": "http://blog.josh420.com", "date": "Jan 18, 2010", "message": "Excellent idea!  I've left comments on questions I did not answer and missed responses because a lack of this feature.  However, I can foresee lots of people mis-spelling things.  Would it be feasible to add some kind of minimalistic \"reply\" icon (perhaps only show on hover) to comments that, when clicked, will inject the users name into the beginning of the comment textbox?\n\nKeep up the great work, the site gets easier to use with time."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jan 18, 2010", "message": "Martin: to me, the biggest argument in favour of keeping the \"@\" syntax is that people are already using it.\n\nBy changing it to \"Foo:\" you *would* be making users conform to a UI model... the @Foo model is what's already in use, so the UI is conforming to the user rather than the other way round.\n\nWe can certainly debate whether that's a good thing or not, but it's undeniably what's already been happening even with the system attaching no meaning to it."}, {"author_name": "caf", "gravatar_hash": "dc6be45ddcfd038ba5e1e5fca319c7fa", "author_url": null, "date": "Jan 19, 2010", "message": "I use the \"SomeBloke: hey you\" convention (and I've seen quite a few others doing it too), so I also think it'd be nice if that was recognised in addition to @.\n\n(It's because I'm EFnet born-and-raised, and that's how it's always been done on IRC ;)\n\nIt'd also be nice if the markdown subset in comments also included the URL delimiters."}, {"author_name": "Peter Boughton", "gravatar_hash": "e915239e11bb00291ce4e4b17b83bc66", "author_url": "http://www.sorcerers-isle.net", "date": "Jan 19, 2010", "message": "I'm also one who will use \"Name:\" when I want to attract someone's attention.\n\nJust because a few twits use the \"@Name\" notation all over the place doesn't mean it should be used to the exclusion of existing accepted user-friendly grammar constructs.\n\n\nAs has been suggested, the *very least* that should be done is adding the \"Name:\" construct (and I'd take it a step further and say other reference methods should also be supported, along with implementing a \"did you mean\" for ambiguous references)."}, {"author_name": "voyager", "gravatar_hash": "c658f5d2eae05b8e7cab26a40106cd7c", "author_url": null, "date": "Jan 19, 2010", "message": "@Martin Wallace: Keep in mind that this is a programmers site. We already are supposed to learn markdown, and how every little feature works. You can't say that the @ seems ugly to you, doesn't mean that it's not widely used.\n\nThe reduced server load alone is worth it from an implementation point of view.\n\n@Peter Boughton: The @name notation has been used long before tweeter came along. As for the other ideas, remember, every little thing that you want to add adds to the server load."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jan 19, 2010", "message": "So, what's the difference between matching @ or : then? If you match a token anyway, you could as well (as Jon said) one use already in use. What if I want to address two or three people?\n\n\"Hey Martin: and Hans: Do you think X works better? Could that work with whatever James: suggested here\"\n\nYeah, that's a real improvement over using @, especially in a grammatical sense ... Not :-)"}, {"author_name": "Peter Boughton", "gravatar_hash": "e915239e11bb00291ce4e4b17b83bc66", "author_url": "http://www.sorcerers-isle.net", "date": "Jan 19, 2010", "message": "Where was it used before Twitter?\n\nA proper name-detection implementation will *not* have a significant effect on server load.\n(If it does, you're doing something wrong!)\n\n\nMichael, how do you normally address two or three people, when in standard conversation?\nDo it that exact same way, and let the computers do the work - that's the whole point of them!"}, {"author_name": "The Bedtimes", "gravatar_hash": "976c4240097e4be5c668984f2b3965f4", "author_url": null, "date": "Jan 19, 2010", "message": "The @ notation of addressing other users was used on blog comments well before Twitter adopted the convention."}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Jan 22, 2010", "message": "\"3.There must be a starts-with, case insensitive match of at least THREE characters to the displayname. So @a and @ab will never match anyone or anything.\"\n\nWhat about users with two-letter usernames?\n(ex. http://stackoverflow.com/users/44537/ju )"}, {"author_name": "Geoffrey van Wyk", "gravatar_hash": "fffd92bafcc0c8d002c733674e93602a", "author_url": null, "date": "Jan 22, 2010", "message": "It would be nice if the @ could turn white (invisible after the comment has been entered."}, {"author_name": "Johannes Rössel", "gravatar_hash": "d54ed51c0f03cb461741c3ec77a837b2", "author_url": "http://hypftier.de", "date": "Jan 25, 2010", "message": "Michael Stum, your example of addressing multiple people is beside the point anyway. Re-reading the blog post tells me that only one person gets notified; first match wins."}, {"author_name": "Wilfred Knievel", "gravatar_hash": "fea4f844fb882fe6bd01fb77c28bdc70", "author_url": null, "date": "Sep 09, 2010", "message": "Super helpful feature, only tiny problem: because comments are being displayed in html multiple spaces are collapsed into a single space.  That's not normally a problem but could be with stuff inside code blocks.\n\nFor instance I've just posted a regex as a comment.  The regex inserts a double space at the start of lines (Helping with the annoying Outlook autocleaning line breaks issue http://stackoverflow.com/questions/247546)  \nIt incorrectly shows one space even though the text has two!"}, {"author_name": "Learn Affiliate Marketing Today", "gravatar_hash": "4605acf62121f326942e0a0f4022087c", "author_url": "http://www.learnaffiliatemarketingtoday.org/Go", "date": "Sep 16, 2010", "message": "Great site, I am going to bookmark it and come back again!"}, {"author_name": "marjone", "gravatar_hash": "9cf2d6fd017b58410a4ba1ce6193de66", "author_url": null, "date": "Oct 12, 2010", "message": "This problem started a few days ago.  I replied to a comment on my blog  and hit return.  The comment appeared in the blog comments section twice.  At the time I assumed I must have done something foolish such as hitting return twice and so I ignored it.  Same thing happened again just a few minutes ago.  That smells like a bug.  I seldom do foolish things twice in a row."}, {"author_name": "Texas trailer dealers", "gravatar_hash": "57d48ae84631d809fbf31d97b04c9685", "author_url": "http://www.texaspridetrailers.com/", "date": "Dec 11, 2012", "message": "It always feels good if you get meaningful, nice comments. It is good that you have created such a nice policy."}, {"author_name": "chemistry patent attorney", "gravatar_hash": "3f9865763a0bf029e02053ed9bcc3281", "author_url": "http://www.patentlydistinct.com", "date": "Dec 13, 2012", "message": "Ideally speaking, the comments should not have any word limits. I would rather listen to the entire views of my followers than just a slight bit."}]}