{"response": [{"author_name": "Bill P. Godfrey", "gravatar_hash": "760bfd359153d0682dbe113dc02f81ba", "author_url": "http://youtube.com/billpg", "date": "Jan 03, 2010", "message": "I was about to write a comment asking how (or if) people's student status is validated before they get the discount. But thinking about it, I imagine its self moderating. If I were to pretend to be a student in order to fraudulently claim the discount, I'd have to also remove my years of experience from the CV.\n\nAnyway. Do you have a barrier to non-serious students?"}, {"author_name": "Tomas Sedovic", "gravatar_hash": "b1e07090d2ee7155a6d6f305331086bf", "author_url": "http://225tms.net", "date": "Jan 03, 2010", "message": "Not quite so, Bill.\n\nI'm doing my full-time studies alongside my full-time job. My employer allows me to go to the compulsory lessons (provided I get my stuff done) and I do most of my studying at home.\n\nSo the question stands: how do you validate studentship? :-)"}, {"author_name": "Allen Pike", "gravatar_hash": "b3d67baaf0725554335bf127cf53e49b", "author_url": "http://www.antipode.ca/", "date": "Jan 03, 2010", "message": "Doesn't allowing someone to post their CV forever mean all those people will end up on the site even when they're not looking for work? Even having one-year terms shouldn't help much, since a great developer will find a job much more quickly than that. If the fee's purpose was as you say, it should be more like $1/week."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Jan 03, 2010", "message": "@Allen: it's something I misunderstood at first, too.  Paying the fee doesn't mean your CV is filed.  It means you are allowed to click the checkbox that files or unfiles it."}, {"author_name": "gs", "gravatar_hash": "00b34c6a2bdfda3aba7eed9d70bf2f22", "author_url": null, "date": "Jan 03, 2010", "message": "@Joel: That in turn would mean the service could be free for everyone, because one could unfile the CV (But who would?). I really fear that having a lifetime subscription creates more noise. I'm wondering if this price lowering is out of a need to have more filed CVs."}, {"author_name": "Ted Naleid", "gravatar_hash": "4ea8b02e7d1aaa61082e57d1c2db620a", "author_url": "http://naleid.com/blog", "date": "Jan 03, 2010", "message": "It's not obvious if this is already part of the solution, but people who are posting their CVs forever (or even for 1 year) should have the ability to flag whether they are actively searching or not.  If they're not actively searching, their CV shouldn't show up in the results.\n\nThat gives more incentive to people to actually sign up for longer term commitments, and gives companies more confidence that the people who are in the results didn't find a job 6 months ago that they love."}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 03, 2010", "message": "While I do like the new, lower prices, I can't help but feel that Stack Overflow has been less than honest about the price changes. I imagine that near the end of the year many people probably opted to lock into the $29 for 1 year filing rate since they were told \"the price absolutely *will* go up in 2010\", only to find out a few days into 2010 the price for 1 year is now $10 *less*. There is, of couse, the generous refund policy, but in my opinion the rate discrepancy should be corrected proactively instead of reactively. Perhaps extend the $29 for 1 year filings by an additional year (or two)?"}, {"author_name": "MC", "gravatar_hash": "7c3e1a395e7a84fcc4f4b6de0f527e18", "author_url": null, "date": "Jan 03, 2010", "message": "Well done Jeff and Joel, a big improvement to the previous pricing policy."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 03, 2010", "message": "> people who are posting their CVs forever (or even for 1 year) should have the ability to flag whether they are actively searching or not. If they’re not actively searching, their CV shouldn’t show up in the results.\n\nAbsolutely -- you can switch employer visibility on or off at will after your CV is filed.\n\n> There is, of couse, the generous refund policy\n\nEmail us directly via careers@stackoverflow.com if you have concerns. We are very easy to work with.\n\n> how do you validate studentship?\n\nIt's the honor system, but students are clearly marked STUDENT in all search results and employer CV views. Employers can also opt to exclude students (or search only for students)."}, {"author_name": "BCS", "gravatar_hash": "d68f8d8798ee2da0d94cda6d7a544c23", "author_url": null, "date": "Jan 03, 2010", "message": "I just graduated in Dec. but don't have a job yet. Do I still count as a student?\n\nAlso I've got 3 years part time professional programming experience from a job that I held while a student, does that make any difference regarding the above?"}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Jan 03, 2010", "message": "Is there any plan to automatically refund those of us (mugs) that believed your story that the price would go up after Dec 09 rather than down and paid the $29, or do we all have to email in?"}, {"author_name": "Scott W.", "gravatar_hash": "7a03f436e9458527368e5eaa45f85d40", "author_url": "http://moms4mom.com/", "date": "Jan 03, 2010", "message": "That's what I get for being an early adopter... paid extra, and I'm in BFE so I've got no hits on my CV anyway.  Oh well, I guess it's all for a good cause.  :)"}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Jan 04, 2010", "message": "Good idea to change the pricing."}, {"author_name": "John Fiala", "gravatar_hash": "0ea7bb11e90d00eee00f6c8863f9f654", "author_url": "http://www.jcfiala.net/", "date": "Jan 04, 2010", "message": "Well, as I remember it the $29 price was for *three years*, not for one year.  (checks)  Yes, I'm good to 2012.  So, since $29 &lt; 3 x $19, I think I&#039;m still satisfied with my initial purchase.\n\nThat said, I&#039;m glad to see the price did go down."}, {"author_name": "Gary", "gravatar_hash": "d6406e63ffb970856077de6b55a3e358", "author_url": "http://www.gmoore.net", "date": "Jan 04, 2010", "message": "Agreed with Kyle, this is the sort of thing that keeps people waiting and waiting and waiting."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 04, 2010", "message": "> Anyway. Do you have a barrier to non-serious students?\n\nNot really, but this was Joel's call -- he's a big proponent of students and internships.\n\nIt is typical for employers to screen out students entirely from their searches, so if you tag yourself student, it's a fairly serious liability.\n\nOn the other hand, there are enlightened companies like Fog Creek which explicitly search for students as well. The theory (and I agree with this theory for the record) is that some of the student candidates are so good you'd have no other chance of hiring them when they enter the job market -- they are snapped up immediately by the Googles and Microsofts and Apples of the world."}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Jan 04, 2010", "message": "John&gt; The true early adopters like you got a good deal with 3 years. But after that expired we were told \"It's still going up to $99/year but you've got until the end of the year to get one year at $29 and then it'll go up to $29\". Then it goes down to $19. Smooth."}, {"author_name": "Corey Hart", "gravatar_hash": "c856a7faedffda604909360f205c135e", "author_url": "http://www.codenothing.com", "date": "Jan 04, 2010", "message": "u62&gt; Yea, I just paid $29 last month for only a year.\n\nJeff&gt; Any help for the poor soles that bought in last month at $29/year?"}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Jan 04, 2010", "message": "Am I the only one who thinks Jeff *way* overestimates his ability to use humor to make uncomfortable news acceptable?\n\nThis is a business.  I understand that.  The comics and folksy tone make me think someone's trying to put one over on me."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Jan 05, 2010", "message": "@JohnMcG\n\nI'm with you.  I was a pretty vocal critic of the fees.  I also think Joel was being extremely hypocritical with the \"special pricing\" windows.  If I recall he blasted some companies for the \"Exploding offers\" tactic, yet here they were using the typical high-pressure sales tool of creating a sense of urgency to \"Act Now!\"  \n\nFrom the looks of it they got a bunch of people hooked with that strategy, then they leveled off and needed more people to be able to sell to the other side.  Given the complaints and lack of growth I suspect they were forced to charge a more reasonable fee (though $0 is the correct fee)\n\nThe bogus argument of money \"qualifying\" candidates is so outrageous I can't believe they are still pushing that nonsense.    \nFor $99 for a lifetime the number is low enough that people just keep the bit flipped on all the time regardless of them being in the market or not.\n\nThe desperate people will pay any amount of money so they are a red herring.\n\nThe really good folks probably don't need SO and given that J&amp;J are not releasing details on the employers it is unlikely to entice another segment of people.  So, let's drop the charade of fees being a validator for \"Serious\" job seekers."}, {"author_name": "Jason", "gravatar_hash": "4636032965b69fb9f04d9ecc7cb88db4", "author_url": null, "date": "Jan 05, 2010", "message": "From the TOS:\n\n\"REFUND\n\nStack Overflow provides means for Account cancellation on the Stack Overflow website and via Your Account. If You cancel Your Account within 90 calendar days of the end of the Trial Period, and You request a refund, Stack Overflow will refund all payments You have made to Stack Overflow within the 90 calendar days prior to the cancellation and refund request.\"\n\nBut there doesn't seem to be anywhere to actually cancel and remove your account.\n\nPlease fix this. And cancel my account."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 06, 2010", "message": "> Any help for the poor soles that bought in last month at $29/year?\n\n> there doesn’t seem to be anywhere to actually cancel and remove your account.\n\nJust email us via the link provided on the bottom of every careers page, and we'll get you sorted ASAP!"}, {"author_name": "Jonik", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Jan 08, 2010", "message": "Lowering the price (&amp; the email offer for active SO users) was definitely a good move. It got me, for one, more interested and to actually try out the service (though I ain't actively looking for anything now).\n\nAlso, I'm glad to see that by skipping your gracious $29 \"special introductory filing rate\" earlier I didn't really miss anything after all. :) \n\nTurns out I like the site too. If I were looking for a job, SO careers CV would be one avenue that I'd put some effort into."}]}