{"response": [{"author_name": "Anton Geraschenko", "gravatar_hash": "bb9c1fa136cbda222700efff19d8b171", "author_url": "http://mathoverflow.net", "date": "Jan 09, 2010", "message": "Go Jacob!\n\nBtw, the two letter codes in the tags on Math Overflow are actually there because lots of mathematicians are already used to the two letter abbreviations for categories on the arXiv preprint service (http://arxiv.org/archive/math), and we wanted to utilize that familiarity to get people to tag questions better."}, {"author_name": "Nathan DeWitt", "gravatar_hash": "0a1a220854cb0e2a7d4d7a1e1bc638b8", "author_url": "http://notunto.us/", "date": "Jan 09, 2010", "message": "The first thing I did was go to Math Overflow and I saw mathemeticians writing to each other in code.  What a perfect place to have some kind of plugin similar to MediaWiki that converts LaTex markup into math equations!\n\nhttp://meta.wikimedia.org/wiki/Math_markup\n\nWhen is this going to happen?"}, {"author_name": "Nathan DeWitt", "gravatar_hash": "0a1a220854cb0e2a7d4d7a1e1bc638b8", "author_url": "http://notunto.us/", "date": "Jan 09, 2010", "message": "Read the FAQ, and then revisited the Bernoulli question.  Apparently there's a problem with jsMath in IE8 on Win7.  Please ignore my previous comment."}, {"author_name": "Anton Geraschenko", "gravatar_hash": "bb9c1fa136cbda222700efff19d8b171", "author_url": "http://mathoverflow.net", "date": "Jan 09, 2010", "message": "@Nathan: jsMath is awesome, but it does sometimes have inconsistent behavior on different browsers. Its upcoming successor, MathJax, is supposed to be much more robust (demo at http://www.mathjax.org/?page_id=13)."}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Jan 10, 2010", "message": "I think I will have to listen to this podcast another time to confirm that dinosaur Joel said nothing controversial. Btw one of the more popular managed parser generators is ANTLR.  \n\nOn the subject of Haskell and parsers, you could use pandoc as is today if you compile it with ghc Haskell to a dll and dllimport it. hmm maybe I should do a blog post on that."}, {"author_name": "B", "gravatar_hash": "608923fbf1c72405f333c5501b1af1aa", "author_url": null, "date": "Jan 10, 2010", "message": "Interesting use of a Wikipedia competitor (citizendium) as a source for Wikipedia's thinking on barriers.\n\n---\n\n\"Like most Perl, it worked well for the 95% case but that last 5% is extraordinarily difficult to achieve.\" Original research? :)"}, {"author_name": "chris", "gravatar_hash": "37fe5078adbcf302af0ee3ccd3ed081d", "author_url": null, "date": "Jan 10, 2010", "message": "Use the pumping lemma to proof that markdown is not a regular language and you know you can't approach the problem with regualar expressions..."}, {"author_name": "Niyaz", "gravatar_hash": "75bbf2be38dfeec9edc6bdc3b87d3c4f", "author_url": null, "date": "Jan 10, 2010", "message": "Talking about removing clutter form the website, I did some small enhancements to the stackoverflow website: http://www.diovo.com/2009/11/fine-tuning-the-stackoverflow-theme/\n\nThe new version works well for me."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 10, 2010", "message": "Niyaz, you've created Super User! :)\n\nhttp://superuser.com"}, {"author_name": "Niyaz", "gravatar_hash": "75bbf2be38dfeec9edc6bdc3b87d3c4f", "author_url": null, "date": "Jan 10, 2010", "message": ":) \n\nThe superuser UI looks kinda better. Can we switch the themes? ;)\n\nBTW why are there no ads in superuser?"}, {"author_name": "chur", "gravatar_hash": "db6b1114cd20967435bf0a596f34bd04", "author_url": null, "date": "Jan 10, 2010", "message": "It was just a passing reference in the sorting-resumes-of-designers section. New York University ITP == \"Interactive Telecommunications Program\""}, {"author_name": "Brad Gilbert", "gravatar_hash": "6a81b9b2f0280da70b19d2dddcd8dc03", "author_url": "http://b2gills.blogspot.com", "date": "Jan 10, 2010", "message": "There is an event-driven Markdown parser toolkit, written in Perl.\n\nhttp://blog.urth.org/2009/11/whats-the-point-of-markdent.html\n\nhttp://search.cpan.org/dist/Markdent"}, {"author_name": "William Shields", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Jan 10, 2010", "message": "As I mentioned on the thread announcing MarkdownSharp I'm working on JMD, a Java Markdown parser supporting the same extensions:\n\nhttp://www.cforcoding.com/2010/01/announcing-jmd-java-markdown-port-of.html\n\nIt was always my intent to write that using traditional parsing as Joel talked about in this podcast. That work is progressing quite well. Initial results are indicating at least a 50x speed-up from doing this (although I'm unsure of how some not-yet-implemented features will impact this).\n\nhttp://www.cforcoding.com/2010/01/jmd-markdown-and-brief-overview-of.html\n\ngives more information on this topic."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jan 10, 2010", "message": "Never realised that Tufte was pronounced like that.\n\nSince Tufty was a cartoon squirrel that taught UK children in the 70s how to cross the road safely I was a little confused what the road safety squirrel had to do with web design for a while."}, {"author_name": "Peter Eisentraut", "gravatar_hash": "91c59ba5a0ecc3520e135ce55b18d580", "author_url": "http://petereisentraut.blogspot.com/", "date": "Jan 10, 2010", "message": "It looks like reStructuedText is eating Markdown's lunch anyway since the latter was so incompletely specified."}, {"author_name": "brad dunbar", "gravatar_hash": "0168f51cd822a820c606c259b80e253f", "author_url": null, "date": "Jan 11, 2010", "message": "Thank you, Joel, for stating that Markdown should be parsed with a lexer/parser like lex/yacc or flex/bison.  The regular expression rabbit hole that every new Markdown implementation seems to use will never work.\n\n+1 for Compilers!"}, {"author_name": "Brad Murray", "gravatar_hash": "e45a5c9fd07e92a412df56345d466146", "author_url": null, "date": "Jan 11, 2010", "message": "Jeff keeps referring to his Markdown tests as unit tests. The entire markdown library is probably too large to be considered a unit. The tests are probably better referred to as automated tests."}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Jan 11, 2010", "message": "I guess StackOverFlow Careers isn't good enough for FogCreek. ;-) \nhttp://37signals.com/svn/posts/2100-jobs-at-the-37signals-job-board-teach-for-america-the-huffington-post-buzzfeed-and-more\n\nJust messing with you Joel. ;-)"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Jan 11, 2010", "message": "I was once given a take-home test during an interview process.\n\nIt consisted of several questions and many were knowledge based.  Something like: \"How would you use the singleton pattern in the following scenario...?\"\n\nI used Google and Wikipedia liberally.\n\nI was told that I got the job because I cited my sources.  Apparently that's unusual."}, {"author_name": "JonFHancock", "gravatar_hash": "94f149d1ccdb07c1b26b3b5c249a65d9", "author_url": "http://jfhancock.com", "date": "Jan 11, 2010", "message": "In your criticism of designer's portfolios, I am curious how customer demands enter into your opinion.  You talk about web brochures with bad design elements.  How do you know that the client didn't demand that cactus font?\n\nDon't get me wrong.  I hate bad design, and I feel pity for people who look at bad design and say \"that looks pretty good,\" but I've conceded to customers against my best judgment because I wanted to get paid."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Jan 11, 2010", "message": "It was nice to hear Joel's thoughts about too many numbers on the StackOverflow homepage. I brought it up on meta a while back but it was shot down. (Well it did at least influence the removal of badge information from the homepage questions list.)\n\nhttp://meta.stackoverflow.com/questions/26051/can-we-reduce-the-amount-of-numbers-on-the-homepage"}, {"author_name": "Jörg W Mittag", "gravatar_hash": "0bfe384bf9dce3cc1fda1bb0ff5f4e0e", "author_url": null, "date": "Jan 11, 2010", "message": "There was a StackOverflow question about Markdown parsing, actually: http://StackOverflow.Com/questions/605434/\n\nHere's my answer, which lists two implementations which actually *do* use a \"proper\" (whatever that means) parser: http://StackOverflow.Com/questions/605434/how-would-you-go-about-parsing-markdown/605895/#605895"}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Jan 11, 2010", "message": "I don't understand the correlation between $30 and someone being serious about submitting a resume. What about $10 or $20? Are these prices considered someone as being half serious or still not serious? That $99 /year fee was way too much. \n\n$19/year &amp; $99/lifetime are a lot more reasonable."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 11, 2010", "message": "> I was told that I got the job because I cited my sources. Apparently that’s unusual.\n\nNow this is an interesting idea -- how well can you *research* your answer? That's certainly reflective of a useful real world programming skill..."}, {"author_name": "brad dunbar", "gravatar_hash": "0168f51cd822a820c606c259b80e253f", "author_url": null, "date": "Jan 12, 2010", "message": "@Jeff\nThe wmd-new project at http://code.google.com/p/wmd-new/ does not have any code...is this going to be put up later?  If not, where will the code be?"}, {"author_name": "brad dunbar", "gravatar_hash": "0168f51cd822a820c606c259b80e253f", "author_url": null, "date": "Jan 12, 2010", "message": "@Jeff\n\nOk, disregard the above post...I read the rest of the project and will check the github repository.  (Linking to an empty project is very confusing though)."}, {"author_name": "Steve Wortham", "gravatar_hash": "7c4d1e4f8701946b8391d009d8d85221", "author_url": "http://regexhero.net/", "date": "Jan 12, 2010", "message": "I found the design discussions interesting.  It seems like it's rare to find a really good designer with a very good understanding of usability on the web.  I'd say that I've only worked with two designers like that, and I'm sure they're in high demand now.\n\nThere can obviously be a lot of overlap between developers and designers.  Sometimes, in fact, the developers have a better understanding of usability or sometimes it's the other way around.  However, in my opinion, it's extremely important that both the designers and the developers are good usability engineers.\n\nAnyway... that's it for my ramblings."}, {"author_name": "Ken Jackson", "gravatar_hash": "8314ccf86bd5fe2b258f0b1eaafbfee4", "author_url": null, "date": "Jan 13, 2010", "message": "Dumb question... where do I subscribe to the podcast?  I just see the RSS feed."}, {"author_name": "Ken Jackson", "gravatar_hash": "8314ccf86bd5fe2b258f0b1eaafbfee4", "author_url": null, "date": "Jan 14, 2010", "message": "The discussion of take-home tests was an interesting one.  At my company we do use them.  Although we typically ask the type of question that I think would not be super easy to \"just Google\" or post on stack overflow.  And then we use their resulting code to interview them.\n\nAn example of the flow is this:\n1) Here's an example take-home problem we might use -- Given a bitmap source image, detect if at least 50% (single rectangular chunk constituting at leat 50% of the pixels) of another bitmap image is embedded in it.  Sometimes there is noise in the source image -- also return embedded images that don't appear to be an exact match, but a probable match.  Define your criteria for a probable match.\n\n2) They email us their solution when they're done.    \n\n3) We take a look at it.  Try it.  See what are the interesting points to talk to the interviewee about.\n\n4) This gives us a chance to talk about algorithms and efficiency.  Also allows us to talk about software engineering.  Also allows us to talk about style.  \n\nIt has worked well.  While you do get a lot of people that you never hear from again.  Those we have heard back from tend to be quite strong.  And when you drill into the code, it's not hard to tell that they wrote it and thought about it.  Or at the very least if they were given the algorithms, they also spent the time to understand them."}, {"author_name": "Simon Nickerson", "gravatar_hash": "5137aca67b37047cc4211075ce65ebb8", "author_url": null, "date": "Jan 14, 2010", "message": "I was astonished at Jeff's assertion that it's OK to take code you wrote as part of your job to a job interview as part of your \"portfolio\". The code belongs to my employer, and I would be breaking my employment contract. Also, wouldn't the fact that I'm breaking confidentiality be a bit of a red flag to the interviewer?"}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Jan 15, 2010", "message": "I did allow myself a chuckle listening to Jeff talking about the attention to detail that goes into the sites, given http://meta.stackoverflow.com/questions/29229 and http://meta.stackoverflow.com/questions/35268"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 15, 2010", "message": "logout is a word, and so is ain't!\n\nhttp://stackoverflow.com/questions/2055205/there-is-an-if-else-is-there-a-neither-nor-statement/2055442#2055442"}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Jan 15, 2010", "message": "LOL @Jeff! Great comeback. I guess it depends if you're bothered about the difference between nouns and verbs."}, {"author_name": "lb", "gravatar_hash": "36f79355a0f99b6b033e479fcfffa51f", "author_url": "http://secretGeek.net", "date": "Jan 16, 2010", "message": "&gt;Use the pumping lemma to proof that markdown is not\n&gt;a regular language and you know you can’t approach\n&gt;the problem with regualar expressions\n\nso is markdown proved to be non-regular?\n\nare there non-regex based implementations of markdown? all the one's i've seen are the same soup of regex.\n\nHas jeff really eradicated all edge cases, or just 'reasonable' ones?\n\ni'm doing some ridiculous extensions to it (in a hobby project) and i feel i'm heading the wrong way, ought to write a real compiler -- but don't want to."}, {"author_name": "Jordan Bettis", "gravatar_hash": "a2538e43d7de26ddbb8971c36b727ad1", "author_url": "http://hafdconsulting.com", "date": "Jan 17, 2010", "message": "The problem with markdown is that to prove anything about it, you need a rigorous definition. \n\nSince nobody has bothered writing BNF for it, there are possibly some interpretations of their mess of ad hoc descriptions that are regular, and others that aren't.\n\nConsidering that they wrote their 'parser' using regular expressions, it'd seem that markdown *as implemented* is perhaps regular. OTOH, given that they have a whole slew of regular expressions mixed with a bunch of other code, it's also possible that they accidentally ended up implementing a push down automation somewhere."}, {"author_name": "dan", "gravatar_hash": "e6ba36648047adc44c5567e2b9c4dbc7", "author_url": null, "date": "Jan 19, 2010", "message": "Joel ridicules the idea of a code test to be done at home.\n\nAs someone who has just done such a task for a prospective job I would disagree.\n\nFrom the candidates point of view it gave them a barometer of what is expected. I'm sure many candidates would have turned the job down after reading the test - therefore a good filter.\n\nAlso, only candidates who really want the job would spend a few hours completing the task - again, a good filter for those speculative candidates who just want interview practice.\n\nOf course, from the employers point of view it's not to be totally relied upon - but I can't agree that these test are without purpose. \n\nI don't think that most people cheat - they know they will be found out at the proper interview. \n\nI really think it is a better filter than a phone interview where you can only ask trivial questions and which of course take far more time and organisation than an emailed test.\n\nAs an employer I am familiar with the difficulties of getting the right person - this can definitely be a useful tool as a filter to help the process along."}, {"author_name": "Max", "gravatar_hash": "897a21a405dababaa592e0ef1c6bdae8", "author_url": "http://lueb.be", "date": "Jan 21, 2010", "message": "I totally disagree with your answer to the listener question regarding the take home programming assignment. In my experience, yes its totally possible to cheat on these - but this step is not to make a snap decision on who is smart and can get things done, it's to almost eliminate people who are doing \"spray and pray\" applications with their resume. \n\nSomebody who is spamming their resume (and usually is also someone unlikely to get hired anywhere halfway decent) isn't going to take the time to complete the assignment, or even to take the time to cheat - and can be pruned from the stack of applications.\nThis is analogous to having your users pay to post their cv's. The assignment is the cost to be taken seriously.\n\nAbsolutely, demonstrating coding during phone and onsite interviews is invaluable - but the prescreen assignment is most certainly a useful tool to get people who aren't worth your time out of your applicant pool."}, {"author_name": "Christo", "gravatar_hash": "8a2a6a4d9ba5d088079d6c91074f448c", "author_url": "http://blog.chromosundrift.com/", "date": "Feb 15, 2010", "message": "Small take home programming assignments are surprisingly effective!\n\nIt seems like Jeff suggested that nobody could fail. I see a greater than 50% failures rate. How do you explain this?\n\nThe time required to see that a take home assignment is not insane and can compile is roughly half the developer time required to phone screen a candidate and can be done without any HR time to schedule phone time.\n\nCan people cheat? Yes. But the biggest problem we have is with the bulk of people who mistakenly think they can code! These people are clearly submitting their own work."}, {"author_name": "Christo", "gravatar_hash": "8a2a6a4d9ba5d088079d6c91074f448c", "author_url": "http://blog.chromosundrift.com/", "date": "Feb 15, 2010", "message": "We also have an in-person coding task later in the pipe.\n\nOh and the take-home coding task is small enough that real candidates can do it in less than 10 minutes."}]}