{"response": [{"author_name": "Chess", "gravatar_hash": "6bddbaa1130994585821490039200bf5", "author_url": null, "date": "Feb 01, 2010", "message": "Was looking forward to both your thoughts on the iPad announcement, Apple development platform, etc. Shame. :("}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": "http://careers.stackoverflow.com/kyle", "date": "Feb 01, 2010", "message": "@Chess:\n\nWell, this was was recorded the day before the iPad was released. So maybe they'll mention it next podcast."}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Feb 01, 2010", "message": "Chess is a long way from being solved (http://en.wikipedia.org/wiki/Computer_chess#Solving_chess)."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 01, 2010", "message": "@dan\n\nI only meant solved in a specific context:\n\n\"in that no human player can beat the best software chess engines\"\n\nWhich is pretty much true, surprisingly."}, {"author_name": "Steven", "gravatar_hash": "585dee8f1d99f06db4aa7549c72f4890", "author_url": null, "date": "Feb 01, 2010", "message": "I can't make latte art as I am ilatterate :)"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Feb 01, 2010", "message": "I don't think it's true that the no human player can beat the best software chess engines, unless something has happened in the last couple years that I have not noticed at all.\n\nAnyway, from a Computer Science perspective, finding a more efficient parallel minimax search is still interesting. There's been some good work in the past, such as using the Younger Brother Wait Concept, etc. But I suspect we can do better. People like Robert Hyatt have done a lot of good work on Chess."}, {"author_name": "Jarett", "gravatar_hash": "bee96081cd4a9e03a60d362c48da7f04", "author_url": "http://www.floravsfauna.com", "date": "Feb 01, 2010", "message": "I solved Tic-tac-toe when I was about 15 or so and writing a Tic-tac-toe game for my TI-83. I feel that I missed out on many fond grid-based childhood memories because it failed to be fun after that."}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Feb 02, 2010", "message": "Id it just me or did Joel totally rip apart Serverfault and the whole concept of the trilogy sites during the discussion of 5 whys when he said that you should read the switch documentation and google for best practices instead of believing 'whatever random crap people voted up on serverfault because the author was more popular'? Surprised Jeff didn't pick up on that."}, {"author_name": "Jeff Davis", "gravatar_hash": "6d81d6dc131240aff73b92c2777f1737", "author_url": null, "date": "Feb 02, 2010", "message": "It's not actually possible to create a computer or program with the our current knowledge of physics that can solve chess. There are insufficient electrons in the universe, even if each electron could somehow represent a complete position.\n\nhttp://en.wikipedia.org/wiki/Shannon_number"}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": null, "date": "Feb 02, 2010", "message": "@Jeff Davis: Why would such a computer need to retain every move? Imagine one that could calculate a position, weigh the merits of the position, then move on to the next. What this computer would need in order to be unbeatable is not capacity but speed."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 02, 2010", "message": "Fascinating article by Garry Kasparaov \n\nhttp://www.nybooks.com/articles/23592\n\n\"Though I would have liked my chances in a rematch in 1998 if I were better prepared, it was clear then that computer superiority over humans in chess had always been just a matter of time. Today, for $50 you can buy a home PC program that will crush most grandmasters. In 2003, I played serious matches against two of these programs running on commercially available multiprocessor servers—and, of course, I was playing just one game at a time—and in both cases the score ended in a tie with a win apiece and several draws.\""}, {"author_name": "James Curran", "gravatar_hash": "98df3c7cc17f088af555c5accbdb2509", "author_url": "http://www.noveltheory.com", "date": "Feb 02, 2010", "message": "I solved Tic-Tac-Toe 13 years ago.\n\nhttp://noveltheory.com/tictac/\n\nYou play against the computer, except you really don't.  Every single move in every game is a separate, precomposed HTML page.\n\nRead about it here:\n\nhttp://noveltheory.com/tictac/tttSecret.htm"}, {"author_name": "Steven Schpielberg", "gravatar_hash": "a65efb154b6cf11ee1fbb5c503927dba", "author_url": null, "date": "Feb 02, 2010", "message": "Shin-ook, not Chin-ook"}, {"author_name": "brad dunbar", "gravatar_hash": "0168f51cd822a820c606c259b80e253f", "author_url": null, "date": "Feb 02, 2010", "message": "@u62:  Ditto.  Joel was not in a good mood during this podcast.\n\nFor the record, I think its great that Jeff and the StackOverflow team are so open with their problems.  It helps demystify great software and humanize it a bit.  (Also, it makes me feel better about flailing away at whatever my latest problem is.)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 02, 2010", "message": "@James , your tic-tac-toe solution is pretty cool!\n\nThis one is cooler though:\n\nhttp://ted.mielczarek.org/code/ticfractoe.html\nhttp://www.stonybrook.edu/philosophy/fractal/2Tic.html"}, {"author_name": "mmyers", "gravatar_hash": "49f3a2065659f5b4efa05ae29bd0856a", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Feb 03, 2010", "message": "@James: That is pretty ingenious. But why did you leave the two losing games in? Is it to keep humans from being bored? (I beat it on my first try, which I did not expect at all.)"}, {"author_name": "eyelidlessness", "gravatar_hash": "af83d13281fbdd223b1d6ec8175c16a2", "author_url": null, "date": "Feb 03, 2010", "message": "Re: \"defeated by a Mac is like getting beaten up by a girl ... with a Mac you just slap it around a bit ... hahaha\"\n\nMisogyny is funny! 9_9"}, {"author_name": "Isaac Lin", "gravatar_hash": "408975adb6e2f531f290e7fe0209a3a9", "author_url": null, "date": "Feb 03, 2010", "message": "Regarding git: from what I understand, one intent is to allow anyone to act as a load integrator, to avoid a single bottleneck or choke point. To that end, rather than people checking in their changes, they each publish their own personal public repository (separate from their working repository) where their changes are available for others to pull in.\n\nIn a small project team, a golden list of changes could be maintained and each developer could assume responsibility of merging these changes into their working repositories. In this scenario, it is important for everyone to be aware of everyone else's public repository, and I assume this is what github is showing. (If I understood you correctly, github is showing everyone's repository, whether or not they have actually published changes. If this is the case, then I believe it would be nice to be able to filter out those who have not published any changes.)\n\nHowever, once the project team grows beyond a size where everyone can follow everyone else's work, it becomes useful to identify one person as an integrator and designate the integrator's working repository as the shared repository that all developers will synchronize with. Of course, as you described in the audiocast, anyone can pick and choose from all available changes and generate their own integrated repository that others can choose to synch with. The deliberately egalitarian philosophy behind git doesn't try to make one repository more special than another; any developer can assume the integrator role, either globally, or perhaps for a smaller team working on a specific feature, which after completed will be pushed out to a public repository to be picked up by the global integrator.\n\nIn the second scenario, it becomes less important to see everyone's public repositories, so long as you are happy with the job the integrator is doing. However, if you are not, then you would like to have everyone's repositories visible, so someone else more to your liking could take over the integrator role."}, {"author_name": "Isaac Lin", "gravatar_hash": "408975adb6e2f531f290e7fe0209a3a9", "author_url": null, "date": "Feb 04, 2010", "message": "Regarding your concern about a fork implementing a feature you dislike: as you know, that's the double-edged sword of open source. People can contribute to your branch, but they are also free to take the software in whatever direction they like."}, {"author_name": "Sergey Stadnik", "gravatar_hash": "6484cbd6c03b1f983124e9d2cc65e9d2", "author_url": "http://sergeys-tech.blogspot.com", "date": "Feb 04, 2010", "message": "Here's excellent John Gruber &amp; Merlin Mann's take on how to write your blog:\nhttp://www.43folders.com/2009/03/25/blogs-turbocharged"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Feb 08, 2010", "message": "Comedian Louis C.K. on parenting and the metaphysics of Five+ Whys:\n\nhttp://www.youtube.com/watch?v=4u2ZsoYWwJA\n\n\"Why\" starts at around 7min."}]}