{"response": [{"author_name": "Michael Haren", "gravatar_hash": "f4f4b5a6f27f72b32d42463b1a25e0df", "author_url": "http://careers.stackoverflow.com/haren", "date": "Jan 25, 2010", "message": "It makes me sad to see problems like this in modern systems. A little scary, too."}, {"author_name": "kevin", "gravatar_hash": "6b61d960290f1c043f3514e3b438da85", "author_url": null, "date": "Jan 25, 2010", "message": "I've had cards decide to go into auto-negotiate and then not pick up the switch was at a fixed speed. The card ended up at 100 mbps and the switch at 1000 mbps.  This causes badness as well."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 25, 2010", "message": "@kevin -- that's a good question. Should this \"fixed-ness\" be set on the servers? or on the switch? or in both places?"}, {"author_name": "Justin Dearing", "gravatar_hash": "735a05084346db68dff750870654da3d", "author_url": "http://justaprogrammer.net", "date": "Jan 25, 2010", "message": "@coddinghorror, Actually the rule is both are set to auto or neither. If one is set to a fixed rate the other has to be.\n\nThis is as per the CCNA books I was reading years ago, but I've never met a cisco admin that disagreed. The auto negotiate protocol requires both to be auto negotiated."}, {"author_name": "Chris", "gravatar_hash": "36d0a0127e22acd5eb1922d8b44f0cf6", "author_url": null, "date": "Jan 25, 2010", "message": "Actually, the biggest source of autonegotiation problems is people setting one end manually and not the other.  If you want auto to work, you MUST set BOTH sides to auto.  Otherwise, set both manually.  If you mix them, you'll be asking a lot of \"why\"s."}, {"author_name": "Dlux", "gravatar_hash": "bf96be7112ca1d4fd622a6fe9e46d298", "author_url": null, "date": "Jan 25, 2010", "message": "That's quite interesting that you went to fixed, because the 802.3ab standard states that gigabit is autonegotiated.  I have yet to see a problem with auto/auto being specified on both ends of the link except int the case of failing hardware."}, {"author_name": "The How-To Geek", "gravatar_hash": "b0b1ce3a4e0a77abd157ec0309b72922", "author_url": "http://www.howtogeek.com", "date": "Jan 25, 2010", "message": "I don't really see the point of leaving auto enabled - why not force everything to the fastest possible speed everywhere you can?\n\nYou're an overclocker, after all! Maybe you can crank them up to 1003mbps..."}, {"author_name": "Dlux", "gravatar_hash": "bf96be7112ca1d4fd622a6fe9e46d298", "author_url": null, "date": "Jan 25, 2010", "message": "I would also highly recommend reading this (from Cisco be relevant to all switched): http://www.cisco.com/en/US/products/hw/switches/ps700/products_tech_note09186a00800a7af0.shtml#gig_aut_neg"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 25, 2010", "message": "related Server Fault question:\n\nhttp://serverfault.com/questions/106160/should-network-hardware-be-set-to-autonegotiate-speeds-or-fixed-speeds\n\nNB: I upvote *all* good non-duplicate answers to my questions, like clockwork. :)"}, {"author_name": "hmallett", "gravatar_hash": "eb65d9143622f4d4f8f2111e96acc13d", "author_url": "http://www.hmallett.co.uk", "date": "Jan 25, 2010", "message": "In one of the podcasts didn't you make reference to fact that if you or Joel post a question it gets upvoted and answered a lot?\n\nIt's been there less than an hour and got a lot of attention!"}, {"author_name": "Josh Kodroff", "gravatar_hash": "9e7ef08258f04dab37b43842d261aea8", "author_url": null, "date": "Jan 25, 2010", "message": "That table could be made a little easier to read if it were color coded by speed or they used notation like 10^3 or something.  \n\nThe only clue you're given that your switch is operating at a lower speed is one character, and in what appears to be a small font at that.\n\nDon't be too hard on yourself, Jeff.  I still love you just the same."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 25, 2010", "message": "Er.. that's not \"my\" table, that's from the Web management UI provided by the switch itself"}, {"author_name": "Matt", "gravatar_hash": "995cb429a774b22ad0e366db56175949", "author_url": "http://www.matthewkrieger.com", "date": "Jan 25, 2010", "message": "Jeff - Per your question in the 3rd comment, hard-coding speed and duplex both the server side and switch side is the most reliable configuration."}, {"author_name": "Andy McKenna", "gravatar_hash": "811103db4bcf408dba46a72f95628429", "author_url": null, "date": "Jan 26, 2010", "message": "Jeff, I think Josh isn't criticizing you, he is saying to not worry about missing the 100mpbs because the UI that came on the switch sucks."}, {"author_name": "James Cape", "gravatar_hash": "e39fe523137528ba8aa4b44bcdf79d8d", "author_url": "http://ignore-your.tv/", "date": "Jan 26, 2010", "message": "I answered on the question in more detail (you didn't include the make/model of the switch on the question), but I'll say it here as well: I've run a Cisco-based shop for three years and this crap simply doesn't happen. I've never had a Netgear device that didn't fail in all sorts of evil ways.\n\nIf you're concerned about cost of Cisco, just know that you don't have to buy the latest/greatest switch, just the one that does what you need, and refurb vendors will give you a 1yr warranty + 70-80% off list.\n\nIf you're concerned about refurb, don't be, this is how it's done. I've run a financial-grade network on refurb equipment for that whole time and never once had an issue outside the bathtub curve."}, {"author_name": "George Edison", "gravatar_hash": "2d37ab3c391cd177b00ae4314b7d9203", "author_url": "http://quickmediasolutions.com", "date": "Jan 27, 2010", "message": "Hey Jeff or whoever manages the firewall,\nI can suddenly no longer access SO with Opera Mini. I would have posted something on meta about this, but I couldn't access it either. All I get is a message saying the server refused the connection. Since I mostly only have access to SO through Opera Mini, this is a serious problem."}, {"author_name": "ManiacZX", "gravatar_hash": "bbc39c3380079c7c124e8c6376bb0b0e", "author_url": null, "date": "Jan 27, 2010", "message": "@James Cape, we've seen the auto-negotiation issue with Cisco equipment too.  Bear in mind that there are two sides to the link, so you may have been lucky in the switches and equipment on the other side of the link have played nice, but this isn't always the case.  It isn't necessarily the switch manufacturers fault, it can be caused from the NIC side."}, {"author_name": "Zan Lynx", "gravatar_hash": "94b309d78a1253a334e9b82643a8dc97", "author_url": null, "date": "Jan 29, 2010", "message": "I am quite sure that gigabit requires autonegotiation as part of the standard protocol. Hardware that allows setting gigabit as a fixed speed is outside the protocol and other hardware isn't required to work with it.\n\nNow, I suppose hardware could implement a \"fixed gigabit\" mode by forcing negotiation over and over until the other side agreed to accept gigabit, but it's still autonegotiating."}, {"author_name": "abercrombie uk", "gravatar_hash": "75a19b51f44abe3a2b55de290d60fec9", "author_url": "http://www.abercrombiefitchoutlet.co.uk", "date": "Jan 29, 2010", "message": "That is not the key.the key is I can really surf on the web."}]}