{"response": [{"author_name": "Rich B", "gravatar_hash": "1b8e976ee2642af225d16283934f8e4c", "author_url": null, "date": "Jan 14, 2010", "message": "What about how awful Diago is, and the fact that TheTXI hasn't been 'seen' on SuperUser since Oct 28 at 19:27?\n\nWhoever is moderating the moderators is doing a horrible job, and the horrible moderation on meta is a result of that. Marc and Bill are good, but the sites need some fresh minds that have a sense of what the word 'moderation' means.\n\nThe nomination thread is a good example of why those people should not be moderators, and the fact that Jeff is the one who requested people to nominate themselves shows how little he understands about moderation.\n\nAnyone who nominates themselves as a moderator pretty much guarantees that they will be a horrible moderator. A moderator should always be reluctant to accept the job, and even more reluctant to use the moderation powers.\n\nThe only person on that thread so far that seems to grasp the moderation concept is:\n\n“SO is self-regulating. Why would we need more mods?” – BalusC"}, {"author_name": "William Shields", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Jan 14, 2010", "message": "TheTXI hasn't been since on superuser for 2.5 months? And he's allegedly a moderator?\n\nThat's fairly poor form and apparently true:\n\nhttp://superuser.com/users/705/thetxi\n\nOne does have to question the oversight."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 14, 2010", "message": "Why is Diago \"awful\"? I think he does an excellent job.\n\nOut of courtesy, I was waiting to get confirmation from TheTXI, which I have, and we're now transferring his moderator rights to another candidate. Stay tuned.."}, {"author_name": "Rich B", "gravatar_hash": "1b8e976ee2642af225d16283934f8e4c", "author_url": null, "date": "Jan 14, 2010", "message": "Diago has continually demonstrated a complete lack of understanding of how the system and community work, but he has also been one of the quickest to jump in and take drastic measures against people and against a thread. When people complain (the almost always do), he acts stunned and reverses his decision claiming ignorance. The idea of 'moderation' completely escapes that boy."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jan 14, 2010", "message": "Perhaps that should be the logo for the meta t-shirt?\n\n'who moderates the moderators' \n\n(only in latin of course)"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Jan 14, 2010", "message": "@mgb: i would love one of those..."}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": "http://stackoverflow.com/users/20654/oscar-reyes", "date": "Jan 14, 2010", "message": "Rich B, I think you're right in most of your comments, but, why don't you just e-mail Jeff directly and/or summarize all your comments in a single one instead of posting multiple ( BTW you don't need to answer )"}, {"author_name": "Larry Canionga", "gravatar_hash": "feb56f6aa0bb485cdd4908390d2a02c4", "author_url": null, "date": "Jan 14, 2010", "message": "I think,  to be moderator, the user should have never been in the Penalty Box. Oopps that's discards you Rich B ( once again ) sorry"}, {"author_name": "Rich B", "gravatar_hash": "1b8e976ee2642af225d16283934f8e4c", "author_url": null, "date": "Jan 14, 2010", "message": "@Larry: I am not advocating for myself to be a moderator anywhere. "}, {"author_name": "Marius Gundersen", "gravatar_hash": "c5a3b1c896e51d58bdd5d92ffbd402d2", "author_url": "http://www.mariusgundersen.net", "date": "Jan 14, 2010", "message": "What is the difference between being a moderator and having a reputation of 10 000?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 14, 2010", "message": "see here:\n\nhttp://blog.stackoverflow.com/2009/05/a-theory-of-moderation/\n\nand look for the phrase \"moderators do have some special abilities..\""}, {"author_name": "altCognito", "gravatar_hash": "7f07010669c0baa7b4ca5198d96fd751", "author_url": null, "date": "Jan 14, 2010", "message": "RichB, in all of my experiences dealing with you, you have been abrasive. While I understand that you're an Internet Tough Guy, we're not on fark, grow up."}]}