{"response": [{"author_name": "bbum", "gravatar_hash": "4bb7953f53aa7715c72054c3d54e7b48", "author_url": "http://www.friday.com/bbum/", "date": "Jan 04, 2010", "message": "I actually found that exact question to be extremely valuable in the professional context.  It made me aware of a number of pitfalls and sillies in a bunch of languages and that, in turn, has improved my coding style just a bit.\n\nAnyone who thinks serious precludes laughter needs to learn to live a little bit more than they are now...."}, {"author_name": "John Sheehan", "gravatar_hash": "54b75f6fbf4434162bfcda6b0cb9b86b", "author_url": "https://twitter.com/johnsheehan", "date": "Jan 04, 2010", "message": "The problem is that people feel entitled to fair treatment and when you give them some precedence to compare their situation to they might get upset when they perceive that they aren't being treated fairly for their 'fun' question.  That's more their problem then yours but it's the sort of problems gray areas cause. I agree with your decision though."}, {"author_name": "a_m0d", "gravatar_hash": "ea6c23846a2ce0df1dcf549d55ee166d", "author_url": null, "date": "Jan 04, 2010", "message": "Glad to see that you're laying down some more guidelines for this - now hopefully people follow them!\n\ncaptcha: bugatti takes"}, {"author_name": "Luk", "gravatar_hash": "64859df4af98a47ac3e86808a18143ad", "author_url": null, "date": "Jan 04, 2010", "message": "Makes me think of good old http://en.wikipedia.org/wiki/Wikipedia:Ignore_all_rules :)"}, {"author_name": "Jason", "gravatar_hash": "0e2e822d32a7ab3d7f0b7098d03b1d16", "author_url": "http://www.quotidianword.com", "date": "Jan 04, 2010", "message": "\"Zero fun, sir!\" - Remember The Titans"}, {"author_name": "Pablo Fernandez", "gravatar_hash": "99108829176dfbbc5d0bf3c041542a26", "author_url": null, "date": "Jan 04, 2010", "message": "Wouldn't it be nice to enforce this rules somehow? Perhaps stating that a question with N+ upvotes or N+ favourites can't be closed?\n\nI certainly do not love binary terms but rules / guidelines :D"}, {"author_name": "Nick", "gravatar_hash": "5e849431b3a191b9fdd8bf65fa00e261", "author_url": null, "date": "Jan 04, 2010", "message": "Agreed. There's nothing worse than being part of an online community that can't have a good laugh once in a while when its appropriate."}, {"author_name": "Jonathan Keith", "gravatar_hash": "127078c836e90b79f2f5aa6cf45fe3e8", "author_url": null, "date": "Jan 04, 2010", "message": "Personally, I would be fine with never seeing another waffle or pony."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Jan 04, 2010", "message": "Hum. I voted to close it as Subjective &amp; Argumentative yesterday, because it looked like nothing more than an open invitation to whine about language features that you don't care for. \"weird\", \"strange\", \"WTF\" == negativity. I love a good language flamewar as much as the next guy, but... that's what discussion forums are for.\n\nContrast this with the ever-popular \"Hidden features of...\" questions that also invite users to share obscure features but without the negative, judgmental criteria.\n\nIs it possible to learn from a question like this? Sure. I've learned stuff from The Daily WTF too. And, on occasion, from rubbernecking at car wrecks.\n\nPerhaps SO could just add a \"...or demonstrates behavior that should not be repeated...\" criteria to the FAQ..."}, {"author_name": "TM", "gravatar_hash": "15a89c429f7dcca72ab78a66341cd06b", "author_url": null, "date": "Jan 04, 2010", "message": "I'm in favor of questions like \"Strangest language feature\", because as you mentioned, there is useful content there, and it is INTERESTING.\n\nAs far as things that are just lists of jokes or comics, I'd prefer they stayed off of SO."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 04, 2010", "message": "> because it looked like\n\nI agree it <i>looked like</i> a bad question ... but the empirical data -- namely votes, views, favorites, useful and interesting answers -- proved that it was not.\n\nShould things that look like bad questions be closed early on? Absolutely.\n\nShould things that looked like bad questions, but somehow magically became useful questions within 2 days, be closed? Definitely not.\n\nSurvival of the fittest, I say."}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Jan 04, 2010", "message": "I like the suggestion (somewhere on Meta) that users should be able to cast re-open votes before the question gets closed.  So if I see that the current status is \"Close (3)\", I can knock that down to \"Close (2)\".  The way it works currently, every slightly contentious question will get closed, at least temporarily, because the system only listens to one side at a time.\n\nOf course, you could make an argument for just using the normal votes, and only close questions that end up with a negative score (i.e. any question that is older than 5 minutes and has a score of -5 or lower gets auto-closed).  This would probably be a more inclusionist approach than the current mechanism because at present it seems that most of the questions that get closed have positive scores.  Then again, that could be because people aren't down-voting because voting to close costs nothing and is more effective."}, {"author_name": "Deadprogrammer", "gravatar_hash": "007904773146ef695bb6e20a4f4cc135", "author_url": "http://www.deadprogrammer.com", "date": "Jan 04, 2010", "message": "Stack Overflow lulz policy  is similar to <a href=\"http://www.pkmeco.com/seinfeld/nazi.htm\" rel=\"nofollow\">Soup Nazi's bread policy</a>"}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Jan 04, 2010", "message": "&gt; I agree it looked like a bad question … but the \n&gt; empirical data — namely votes, views, favorites, \n&gt; useful and interesting answers — proved that it was \n&gt; not.\n\nPerhaps the system should prevent closure (except by diamond moderators) of questions that have achieved \"worthiness\" according to the data?"}, {"author_name": "William Shields", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Jan 04, 2010", "message": "The problem isn't the amusing \"fun\" questions (because most of them aren't). The problem is the hundreds of other poor questions where closing them elicits responses of \"Why did you close my question when question X isn't closed?\"\n\nAn inconsistently applied standard is going to cause problems.\n\nIt's further exacerbated by some people posting these questions to essentially farm badges."}, {"author_name": "TC", "gravatar_hash": "e91af8e6f7abf932bb92751266b67f18", "author_url": null, "date": "Jan 04, 2010", "message": "Please give us more \"fun\" guidelines to follow."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Jan 04, 2010", "message": "&gt; Survival of the fittest, I say.\n\nI'm *really* having trouble reconciling this with your \"no joke questions\" policy. How many up-votes, favorites, interesting answers... did \"programming at sea\" collect? And how many more would it have needed to live...?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 04, 2010", "message": "> How many up-votes, favorites, interesting answers… did “programming at sea” collect? \n\nOh, you wanted a pedant-off? Why didn't you just say so? :)\n\nMany differences:\n\n- it was not posted in good faith (predicated on a trick/joke/lie)\n- it does not teach the average programmer anything useful about their craft\n- only achieved pseudo-popularity when it was mentioned on the podcast (<a href=\"http://en.wikipedia.org/wiki/Hawthorne_effect\" rel=\"nofollow\">Hawthorne effect</a>)\n\n> an inconsistently applied standard is going to cause problems\n\nWhen it comes to people and writing, the idea that there can be a perfect, consistently applied standard -- that's what is going to cause the most problems in the long run.\n\n> Stack Overflow lulz policy is similar to <a href=\"http://www.pkmeco.com/seinfeld/nazi.htm\" rel=\"nofollow\">Soup Nazi’s bread policy</a>.\n\nWhat, just because our standards are inconsistent, irrational and arbitrarily applied? That is <i>so unfair</i>."}, {"author_name": "wcoenen", "gravatar_hash": "df6cf33b05610b10c0d63b9e3c3654d4", "author_url": null, "date": "Jan 04, 2010", "message": "I voted to close and I stand by my actions. The question is overly broad, subjective, and has many not-quite-duplicates. I'm thinking about questions with keywords like \"hidden features\", \"surprising\", \"weirdest\", etcetera. Pointing to the empirical data won't change my mind about this. That would be like watching TV soap operas just because they have high ratings.\n\nMy opinion doesn't really matter though. The core of the problem is that too many stackoverflow users have near-admin powers, causing a jojo effect when there is disagreement. \n\nIf fixing that means that my humble reputation score no longer enables the casting of close votes, so be it."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 04, 2010", "message": "wcoenen, you should always vote the way you feel is correct, and nothing here contradicts that. We support both inclusionists and deletionists.\n\nHowever, a certain amount of repetition / duplication is helpful to have in the system.\n\nhttp://www.codinghorror.com/blog/archives/000549.html\n\nPart of this is the tension we absorbed in the design -- we support both wiki (there can be ONLY ONE article on Asphalt!) and blog (there can be MILLIONS of articles on Asphalt!) aspects."}, {"author_name": "Aakash Mehendale", "gravatar_hash": "d4f59ee8f45040b78ee28e784f985664", "author_url": null, "date": "Jan 04, 2010", "message": "&gt;&gt;\nShould things that look like bad questions be closed early on? Absolutely.\n\nShould things that looked like bad questions, but somehow magically became useful questions within 2 days, be closed? Definitely not.\n\nSurvival of the fittest, I say.\n&gt;&gt;\n\nSome of these things, as Sesame Street put it, don't look the same as each other.\n\n&gt;&gt;\nWhen it comes to people and writing, the idea that there can be a perfect, consistently applied standard — that’s what is going to cause the most problems in the long run.\n&gt;&gt;\n\nIf the *actual* law is that 'those with the highest rep / mod-ness / ownership get to dictate THE TRUTH' then just say so. What rubs people up the wrong way is *pretending* to be mob-ruled, um, I mean, democratic, then *acting* oligarchic or autocratic in the face of the mob."}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": "http://stackoverflow.com/users/20654/oscar-reyes", "date": "Jan 04, 2010", "message": "Wait a minute, was not that the reason why meta was created in first place? To hold all the \"funny\" questions? OMG! all this time I've been posting jokes on meta ( that explain why they were closed there too ) \n\nWhile the question is very interesting, it really belongs to.. reddit. I mean, is totally subjective, and it is not a real question ( that is with a real acceptable answer )   \n\nLook the first two answers are actually answers for two different questions, the first one could be:\n\nWhy is it allowed to use 10[a] in C?\n\nThe second one could be:\n\nWhy '5'+3 gives 53 but '5' - 2 returns 2?\n\nAnd so on. \n\n\n\n\nWe have learned not to ask subjective questions in the past the hard way ( having the community closing our q ) and we teach the community that's not welcome ( by closing their subjective questions )  I don't think it's fair that this particular questions gets blessed with an entry on blog.stackoverflow.com only because Jeff subjectively thought it is useful ( well he created the site and all but... well , how do I ... ehem.. -- oopps OMG how to I end this now --- )   Ok anyway \n\n ehem  ... \n\nProbably a diamond mark \"I like this and don't want you to close it\" power tool would solve this situation ( like the locked tool?) . \n\nOtherwise the way the system is implemented, this may go into a yoyo loop until we all \"stackoverflow\" .... ( or we run out of voters ) \n\n\nIncreasing by 2 the amount of closers/openers may help also ( 5, 10, 20, 40, etc. ) \n \n\nJeff no hard feelings ok?"}, {"author_name": "Entity", "gravatar_hash": "e326f7efc603a1881cd645d22a663de2", "author_url": "http://www.vbs2.com", "date": "Jan 04, 2010", "message": "A Group Is Its Own Worst Enemy\n\nNow, there's a large body of literature saying \"We built this software, a group came and used it, and they began to exhibit behaviors that surprised us enormously, so we've gone and documented these behaviors.\" Over and over and over again this pattern comes up. (I hear Stewart [Brand, of the WELL] laughing.) The WELL is one of those places where this pattern came up over and over again."}, {"author_name": "Mehrdad", "gravatar_hash": "df0bd8a818111607704dab056fcfc091", "author_url": "http://mehrdadafshari.com", "date": "Jan 04, 2010", "message": "Jeff, I think you are missing some important points. I won't argue against the validity of the question on Stack Overflow. What I want to point out is that:\n\n1. We *already have* a bunch of similar questions.\n2. It's not about closing a single question. When such a question is left open, others will cite them and will say, \"Hey, can't you see that question? Why that's valid and mine is not.\" In fact this very question does exactly this by referring to the \"hidden language future\".\n\nI also understand that you personally have to be a populist and take actions that will disappoint minimal number of people and thus, it's not good for your public persona to enforce the strict rules when you see a bunch of upvotes.\n\nOne interesting fact about that question is one of the comments that says the ratio of serious questions/fun questions is very healthy at SO and thus, we should be less strict about fun questions. I believe the fact that the guy thinks it's healthy right now is a direct consequence of strictly shooting down invalid questions by community members that care about SO as soon as possible so that they can attract that amount of votes and become hard-to-close.\n\nUnfortunately, this blog entry, which is written with a short-sighted and populistic view is a bad one for Stack Overflow. I'm already imagining bad questions that will refer to it and say \"fun is allowed, don't be so strict\". Personally, I won't act as strictly when I see bad questions anymore since this blog post is essentially an \"official policy\". \n\nI hope Stack Overflow doesn't become Yahoo! Answers."}, {"author_name": "Jason", "gravatar_hash": "0e2e822d32a7ab3d7f0b7098d03b1d16", "author_url": "http://www.quotidianword.com", "date": "Jan 04, 2010", "message": "I'm in favor of the idea that you can vote to re-open if there's a vote to close rather than increasing the number of votes it takes to close a question. This seems like a very obvious and (most likely) simple solution to apply."}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "Jan 04, 2010", "message": "During one of the close cycles, I voted to close as a duplicate of http://stackoverflow.com/questions/146329/what-is-the-worst-gotcha-youve-experienced and mentioned that in a comment, but unfortunately other close votes outnumbered the duplicate vote.\n\nMany of the answers to these two questions are the same (and indeed, posted by the same people)."}, {"author_name": "something", "gravatar_hash": "d51a773f5b51412869489e07bcf9aae1", "author_url": null, "date": "Jan 04, 2010", "message": "Sounds to me like there should be a way to mark such a \"fun\" question as different then open and shut questions.\nSuch questions probably shouldn't generate any reputation for those involved."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 04, 2010", "message": "> A Group Is Its Own Worst Enemy\n\nI think Clay and I might have mentioned this <b>when we keynoted together at EclipseCon</b>:\n\nhttp://www.codinghorror.com/blog/archives/001245.html\n\nYou can search Coding Horror for earlier Shirky references, if you're bored. :)\n\n> Many of the answers to these two questions are the same \n> We *already have* a bunch of similar questions.\n\nSome duplication is desirable, as covered before...\n\nhttp://blog.stackoverflow.com/2009/04/handling-duplicate-questions/\n\n> When such a question is left open, others will cite them and will \n> say, “Hey, can’t you see that question? Why that’s valid and mine is not.”\n\n\"Congratulations…you've found an inconsistency in the world. If only there were some way for you to reconcile it.\"\n\nhttp://blog.stackoverflow.com/2009/04/the-stack-overflow-question-lifecycle/"}, {"author_name": "Entity", "gravatar_hash": "e326f7efc603a1881cd645d22a663de2", "author_url": "http://www.vbs2.com", "date": "Jan 04, 2010", "message": "Hi Jeff.\n\nThe reason for writing a short concise reply was because I enjoy using stack overflow and have been bitten by the FUN bug a couple of times. Per say, I'm not going to be pro or con anything you say because it don't know the context or your situation you're writing it in.\n\nI will say that even though the rules may seem harsh, and people are against them and suggesting all different solutions. I would say, even if a person doesn't like it, it sets boundaries and responsibility on users who would otherwise just start derailing the site.\n\nKeep up the great work, love your site."}, {"author_name": "William Shields", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Jan 04, 2010", "message": "The problem here is mixed messages.\n\nSO is saying \"fun questions aren't allowed (except when they are)\". Everyone sees their own \"fun\" questions as making the grade and inevitably ask \"why close mine and not X?\" when it (most of the time) gets closed.\n\nBadge farming exacerbates the problem.\n\nAs Greg pointed out, it's many of the same people posting these questions, answering these questions and indeed posting the same answers on very similar sounding questions.\n\nDuplicates are useful for programming questions and it is my opinion that these are too eagerly deleted but do we really need duplicates of \"fun\" questions so they're allegedly easier to find? Really?\n\nFact is, reddit works far better for this kind of topic. Topics get voted down and barely seen or they get voted up and seen by quite a few people. With sufficient upvoting they'll get \"promoted\" to prominence on www.reddit.com (from subreddits).\n\nThis works incredibly well for subjective/off-topic questions. And frankly this is where I think \"fun\" questions belong. The programming cartoon question (locked) has duplicates of the same cartoon because (surprise surprise) no one bothers to read the whole thread.\n\nBasically this kind of question appeals to the kind of poster who likes the sound of his or her own voice and isn't much interested in reading anything anyone else has written.\n\nIs this really what we want to encourage?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 04, 2010", "message": "> The programming cartoon question (locked) has duplicates of the same cartoon because (surprise surprise) no one bothers to read the whole thread\n\nApples and oranges.\n\nWhat can one learn from reading a cartoon? Not much.\n\nWhat can one learn from reading source code another developer posted to illustrate an edge condition in a language? Quite a bit!\n\n\"This is like the boat programming question!\"\n\nNo, it isn't. (see my earlier responses)\n\n\"This is like the programming cartoon question!\"\n\nNo, it isn't. (see above)\n\nIf this is about simple jealousy over other people getting badges \"they don't deserve\", then why pussyfoot around? Why not just say that?"}, {"author_name": "Lunatik", "gravatar_hash": "f65024c57e12069c25a9bbfe2e1cf601", "author_url": null, "date": "Jan 04, 2010", "message": "\"The world is not binary.  It's more...floating point.\"\n\nNice t-shirt slogan there!"}, {"author_name": "Amadiere", "gravatar_hash": "6c0b8eb63403dade08c2446febdf88f5", "author_url": "http://www.amadiere.com/blog", "date": "Jan 04, 2010", "message": "You sir, get +1 for the Meat Loaf reference, and a further +1 for using a space in his name. :)"}, {"author_name": "brann", "gravatar_hash": "9f2510b1626c8b590d04e9c78355a5a7", "author_url": null, "date": "Jan 04, 2010", "message": "I read that question specifically because I thought it might teach me a few things, which it did.\n\nThat being said, I agree most of fun questions seems to be asked not because the OP has got a question (or thinks he could learn from the answers) but rather because he's after fame/badges/rep/whatever\n\nWhat about changing a bit the system so that the questions tagged \"subjective\" or \"fun\" does not bring any badges, nor rep ? I'm not advocating accepting EVERY fun question provided it has the fun tag ; I'm just proposing accepting only the questions we accept right now (using the guidelines provided in this post), and ONLY if they are tagged appropriately.\n\nThis would (hopefully) reduce the badge farming issue (if it exists), and help people avoid that \"noise\" if that's the way they see \"subjective\" questions."}, {"author_name": "Michel", "gravatar_hash": "8b1ccb81c0b2b96deb47cef44a2444c5", "author_url": null, "date": "Jan 05, 2010", "message": "Jeff, that question is not about stupid funny things like programming cartoons or programming jokes ... look at the answers, they look funny ? I don't think so ...\n\nmany of them are nice features of programming languages like C , Python , PHP, etc that could be helpful for other programmers and let them think about features of languages.\n\n\"Does this question match the criteria provided in the Stack Overflow FAQ?\"\nmaybe .... \"this is a place for questions that can be answered!\" --&gt; MAYBE this question have a \"Best Answer\"! Best feature ... maybe that's a real question. but if questioner just want programmers \"opinion\" ( \"What is in your opinion the most ....\"), that's not a real question! that's a discussion ...\n\nbut anyway, non-programmers couldn't understand any of those answers and they are not funny. we can't retag that question as funny I think ..."}, {"author_name": "Geoff Knauth", "gravatar_hash": "b8a1594baf6f37bd33039b87299cd749", "author_url": "http://knauth.org/gsk", "date": "Jan 05, 2010", "message": "Generally you have questions that have one best answer.  In this case you have a question with possibly many great answers.  Then you have a page that will load more slowly."}, {"author_name": "Ludwig Weinzierl", "gravatar_hash": "f8d5ffa1eccb3c17e6ae3319f697e4e1", "author_url": "http://weinzierl.name", "date": "Jan 05, 2010", "message": "Like Michael I don't think this question is in the same category as programming cartoons or programming jokes questions.\n\nBesides \"a certain amount of fun is OK\", \nwhat I read from Jeff's post is that a question being useful is more important than following every letter of the FAQ. I certainly support that.\n\nThere was a similar discussion before about one of my own questions:\nhttp://stackoverflow.com/questions/961942/what-is-the-worst-programming-language-you-ever-worked-with\n\nI think this was very similar: maybe against the FAQ, but useful anyway."}, {"author_name": "Brett", "gravatar_hash": "444c8d7844ba3aed548964c7524208bf", "author_url": "http://blog.brettski.com", "date": "Jan 05, 2010", "message": "Curious to know how many more times you need to discuss this topic.  Between the blog and the podcast its surely over two dozen times it has been mentioned."}, {"author_name": "William Shields", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Jan 05, 2010", "message": "Jeff,\n\nProgramming cartoons and strange language features are indeed two different types of questions. Dealing specifically with the latter:\n\nThere are questions on SO that aren't so black and white as being able to pick a definite answer. A prime example is:\n\nhttp://stackoverflow.com/questions/9033/hidden-features-of-c\n\nEven without a definite answer it has value to any aspiring or even experienced C# developer.\n\nStrange language features is much broader and it doesn't have the same value. It's just entertainment for a limited few by an even more limited few. There are only so many times I need to be told \"10[a] and a[10] are equivalent in C\" (by the same people!).\n\nYes it's a sliding scale and yes it's a subjective standard."}, {"author_name": "Jason", "gravatar_hash": "0e2e822d32a7ab3d7f0b7098d03b1d16", "author_url": "http://www.quotidianword.com", "date": "Jan 05, 2010", "message": "For the love of Pete, people!\n\n1) It is programming related\n2) It is interesting to a LARGE number of people (look at upvotes and favorites)\n3) It's not even a \"fun\" question!\n4) Check out the About section again... see that left circle? For all of you whining about how it's like Reddit, well, it is by design! Stop trying to close things that other people are obviously interested in and just let it be. If you don't like it, vote it down and stop participating.\n\nGoodness... you people are crazy!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 05, 2010", "message": "> Between the blog and the podcast its surely over two dozen times it has been mentioned.\n\nYes, definitely mentioned on the podcast several times.. but I don't think we had an single blog post on this topic, stating our official position on it yet. Now we do!\n\nAlso, you'll be happy to know that I avoided mentioning this topic on this week's podcast, precisely because we had covered it so many times in audio."}, {"author_name": "Troy Hunt", "gravatar_hash": "4f2269dfd9414dc2b982f828e9574b57", "author_url": "http://troyhunt.com", "date": "Jan 05, 2010", "message": "“I agree it looked like a bad question … but the empirical data — namely votes, views, favorites, useful and interesting answers — proved that it was not.”\n\nThe problem is that these empirical measures are only available if a question is left open long enough to accrue the data. There are a number of mods that I would subjectively classify as “zealots” who seem trigger happy on shutting down questions that even have a whiff of not being suitable. I know it’s a difficult balance, but this measure is very hard to achieve if no opportunity for metric collection is provided."}, {"author_name": "Jeff Davis", "gravatar_hash": "6d81d6dc131240aff73b92c2777f1737", "author_url": null, "date": "Jan 06, 2010", "message": "You can't please everyone."}, {"author_name": "AJ", "gravatar_hash": "34758e93142fc85fbfa432dc7f8e3858", "author_url": null, "date": "Jan 06, 2010", "message": "\"If this is about simple jealousy over other people getting badges “they don’t deserve”, then why pussyfoot around? Why not just say that?\"\n\nI agree, that's the real issue.  I've experienced it over and over again with some of higher reputation users on Stackoverflow."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 06, 2010", "message": "> this measure is very hard to achieve if no opportunity for metric collection is provided.\n\nCorrect -- which is why the question surviving <i>at all</i>, much less long enough to get useful answers, was quite an accomplishment in its own right."}, {"author_name": "Gab Royer", "gravatar_hash": "e1894aaa748786a2938ab48bdaff6403", "author_url": null, "date": "Jan 08, 2010", "message": "Coming late to the party but I would like to say that what surprises me the most is how much energy is put on such a meta-matter. But what surprises me even more is that I am surprised that people get so anal about things like this.\n\nIt's the Internet after all."}, {"author_name": "mattias", "gravatar_hash": "9fea09ddf09bc8f47233d1b308e64728", "author_url": null, "date": "Jan 08, 2010", "message": "There goal of restricting fun questions is not about the questions themselves, it is about keeping Stackoverflow on topic.\n\nTherefore it makes more sense to come up with rules such as \"there may be at most 5% fun questions\" or \"there may be one fun question per week\", not in terms of votes or popularity.\n\nAnd as a result, the decision which questions to keep open must be subjective if many fun questions are submitted - some of these must be closed even if similar ones have been allowed in the past."}, {"author_name": "caf", "gravatar_hash": "dc6be45ddcfd038ba5e1e5fca319c7fa", "author_url": null, "date": "Jan 10, 2010", "message": "I'd just like to add another voice to the idea of being able to vote against Close votes while the question is still open.  It's silly the way that questions ping-pong between open and closed.\n\nSometimes I'll come across a question that has a couple of completely illogical close votes - like the question on embedded systems programming with a \"belongs on ServerFault\" close vote! - and all I can do is post a comment trying to patiently explain why the close votes are unjustified, and hope that others see it before they reflexively jump on the close bandwagon."}, {"author_name": "JYelton", "gravatar_hash": "cc043bd3e7305db7daebedf511206fc8", "author_url": null, "date": "Jul 14, 2010", "message": "Jeff, this answer helps a lot, perhaps a link to it (or a distilled version of) from the FAQ would be helpful! \n\nThe Q&amp;A core mission is functional, and is the sole reason I became an active participant. However the \"discussion\" questions (fun or not) that are on-topic, are extremely useful and part of the reason that I remember to come back."}, {"author_name": "velja", "gravatar_hash": "e004d79151e3134fe10e500b4009a950", "author_url": "http://www.gamingocean.com", "date": "Mar 17, 2011", "message": "if (Math.random() &lt; 0.5)\n{\n    allowFun();\n}\n\n;)"}, {"author_name": "Scott Blomquist (sblom)", "gravatar_hash": "2b6513bd28040ce526882afb70f4f7d5", "author_url": "http://scott.blomqui.st", "date": "Jan 21, 2012", "message": "Now the question has been fully deleted. I think Stack Overflow really does hate fun..."}, {"author_name": "funlover", "gravatar_hash": "746a95fa2d399d5bff6fe431a9e8aa09", "author_url": null, "date": "Jul 25, 2012", "message": "So.. you DO hate fun"}, {"author_name": "Ryan", "gravatar_hash": "7c9cf48d9491646b22fecd68bfd749ce", "author_url": null, "date": "Aug 04, 2012", "message": "Your moderators ask and answer questions that conflict with the rules above, yet are \"allowed\" under yor grey rules, above. \n\nSE admins recently wrote a post about being more 'friendly' to new joiners. \n\nI posted to \"programmers\" - a site I READ was a more general site for CAREER DEVELOPMENT. With a question about CAREER DEVELOPMENT which was up voted, answered and generally very well received ( in fact the most enthusiastically received question I have asked and I've been a respected, active member of SE for three years)\n\nAnd the fun police closed it. \n\nHow short sighted. Really disappointing.  On to somewhere else."}, {"author_name": "JP", "gravatar_hash": "118f49e3ea76935f3e7be907a9bbc068", "author_url": null, "date": "Aug 10, 2012", "message": "There's nothing wrong with having fun. But it doesn't belong on Stack Overflow. Once it meets criteria #1, it shouldn't be there. What it comes down to is discussion questions are off-topic, unless they are highly upvoted or \"teach me something\", then it's OK. Meh.\n\nThis creates an arbitrary feel to the site that is becoming a huge turn off. I come to Stack Overflow to ask and answer questions, and I expect the rules to be applied uniformly. When I see the rules only applied occasionally, the broken windows theory is in full effect. That's when the site starts becoming insular."}, {"author_name": "Kumar Harsh", "gravatar_hash": "8f4bda151b8234cc2f71bb0981033961", "author_url": null, "date": "Aug 12, 2012", "message": "Thanks a lot for showing clearly SO's standing on the content that gets posted here. Totally agree with you guys."}]}