{"response": [{"author_name": "Bombe", "gravatar_hash": "3e5ac1db48e4a7ef1b192cc6b5e7fbf0", "author_url": null, "date": "Jan 14, 2010", "message": "♥"}, {"author_name": "Bogdan", "gravatar_hash": "3d41e00195db70d94211bd92869f059b", "author_url": "http://gridpulse.com", "date": "Jan 14, 2010", "message": "It's a nice solution and a good architecture.\nI was just wandering if you considered using NLB instead of Heartbeat on the HAProxy machines."}, {"author_name": "Shawn", "gravatar_hash": "bc8403426d76d1cbf2985916ba95b8f4", "author_url": "http://onefuriousllama.wordpress.com", "date": "Jan 14, 2010", "message": "This post really spoke to the geek in me. Must, have, HAProxy, now."}, {"author_name": "wds", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Jan 14, 2010", "message": "What I'm wondering from this is whether the DB servers are publicly accessible from the internet (once you know the IPs) and whether that is a good idea?"}, {"author_name": "Nathan Bowers", "gravatar_hash": "8ef1faca1032b44b8ca486a4e52501ed", "author_url": "http://uxhero.com", "date": "Jan 14, 2010", "message": "Important work you're doing, sharing your architecture and experience scaling, backing up, foibles etc.\n\nNot enough people talk publicly about this stuff when they're running a successful public site."}, {"author_name": "Murali Suriar", "gravatar_hash": "085bfa9c259fb798a61d72c5e5a9989a", "author_url": "http://www.amateurgeek.co.uk", "date": "Jan 14, 2010", "message": "Nice set up - that said, I agree with WDS. Do you need to have the DB servers on the public VLAN?"}, {"author_name": "Kev", "gravatar_hash": "a9840656ceee0faa528806c4c04a9399", "author_url": "http://blog.zygonia.net", "date": "Jan 14, 2010", "message": "Like Bogdan asked, what was the motivation for using HAProxy instead of Windows NLB out of the box? Just interested..."}, {"author_name": "Tom Ritter", "gravatar_hash": "31e32ecb7309ad47e1ecdd34f4c26529", "author_url": "http://ritter.vg", "date": "Jan 14, 2010", "message": "If the HAProxy instances are on linux VM's... what happens if the machine hosting the VMs goes down?  Are they hosted on different machines?\n\nCaptcha: Stacie conveyed"}, {"author_name": "Martin Wallace", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Jan 14, 2010", "message": "I'll be the first to ask the usually question on posts of this nature:\n\nWhat software did you use to creat the diagram?\n\nMartin"}, {"author_name": "Richy C.", "gravatar_hash": "dc4a5d8ea3df35ee7ba4d5e4f903053a", "author_url": "http://blog.rac.me.uk", "date": "Jan 14, 2010", "message": "I'm surprised you don't have sstatic.com running off a content delivery network such as Internap - serving static files quickly is what a CDN is perfect at (Internap, which we've purchased via Softlayer, has the advantage that it does 'server pull' - you just tell it which servers it can fetch the original images/files from when it needs them, change the DNS to point to the CDN account and that's it - no backend changes needed!).\n\nI've found that not only is a CDN faster and more resliant to failure (as they tend to have around 20 geographical nodes around the world), but they are also quite cheaper than most datacenter prices for bandwidth.\n\nJust thought I'd through that out here and to satisfy my curiosity if there was a reason you haven't gone down the CDN route..."}, {"author_name": "Skilldrick", "gravatar_hash": "2b0a93dc132be4bf3b15b50c8a7e8089", "author_url": "http://www.skilldrick.co.uk", "date": "Jan 14, 2010", "message": "\"We redoubled our efforts to become more redundant.\"\n\nIs it just me who chuckled when reading this? Surely it's expert sexchange who are becoming more redundant?\n\nMeanwhile, I *LOVE* your INTARWEBZ label. Really subtly snuck in there :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 14, 2010", "message": "> what was the motivation for using HAProxy instead of Windows NLB\n\ncheap, easy, free, works great as a 512mb (could maybe be smaller, even) VM \"device\" on your network via Hyper-V. It also works in front of the boxes so it's completely transparent to them, and easier to troubleshoot as a different networking layer instead of being intermixed with all your windows configuration.\n\n> satisfy my curiosity if there was a reason you haven’t gone down the CDN route\n\nCDNs, even the \"cheap\" Amazon one, are very expensive relative to the bandwidth we get bundled into our existing host's plan.\n\nThe least I could pay is $1k/month based on Amazon's CDN rates and what bandwidth we use.\n\n> Are [the HAProxy instances] hosted on different machines?\n\nOf course -- two different machines."}, {"author_name": "hmallett", "gravatar_hash": "eb65d9143622f4d4f8f2111e96acc13d", "author_url": "http://www.hmallett.co.uk", "date": "Jan 14, 2010", "message": "Well that answers my question back at http://blog.stackoverflow.com/2009/12/scheduled-site-maintenance-saturday/#comments about whether you were using 2 VLANs on the same switch for the public and private networks!"}, {"author_name": "John Clayton", "gravatar_hash": "72a4ef9b64ec0ef5b165dfda215445bc", "author_url": "http://codemonkeylabs.com/", "date": "Jan 14, 2010", "message": "Have you guys run into any troubles using Hyper-V for your Linux-based VM's? I seem to recall reading that running VM's without the guest additions on the same host as those  with the additions can bring down performance for all guests. \n\nHow have you found Linux performance to be under Hyper-V?"}, {"author_name": "Emilio", "gravatar_hash": "a9fa13d0cc3679dfe1ef6febb3aae939", "author_url": null, "date": "Jan 14, 2010", "message": "Jeff,\n\nWow you really have a lot of capacity.  Did you buy the extra 3 servers primarily as cushion for future growth?\n\nAlso it looks like you spent $30k to $40k or more on gear.  Who fronted this money, did it come out of site revenues or Fog Creek or something?"}, {"author_name": "Matt", "gravatar_hash": "995cb429a774b22ad0e366db56175949", "author_url": "http://www.matthewkrieger.com", "date": "Jan 14, 2010", "message": "How would you rate the learning curve around the Linux-based HAProxy and Heatbeat implementations for people with Windows backgrounds?"}, {"author_name": "LaptopHeaven", "gravatar_hash": "82ed66b8f1544dcf56aee43066dd79bb", "author_url": "http://www.kygeek.com/", "date": "Jan 14, 2010", "message": "What are you using to keep IIS and web/app content in sync between multiple webservers?"}, {"author_name": "Willy Tarreau", "gravatar_hash": "270fc727ce4a5ba24d9710504615b3f8", "author_url": "http://haproxy.1wt.eu/", "date": "Jan 14, 2010", "message": "Hi Jeff,\n\nnice article! In order to monitor haproxy, have a look at \"monitor-uri\" and \"monitor fail\" in the doc. It allows you to perform remote tests to ensure it is working, and you can even condition the response by the number of available servers behind it. That way, if one haproxy sees no server and the other one sees them all, you can ensure that the one with the servers will be used. I'm not sure on how to combine that with heartbeat however, though it's trivial with keepalived. Anyway, it could at least be used to alert the team in case of major network failure."}, {"author_name": "Geoff Dalgas", "gravatar_hash": "b437f461b3fd27387c5d8ab47a293d35", "author_url": "http://stackoverflow.com", "date": "Jan 15, 2010", "message": "&gt; How have you found Linux performance to be under Hyper-V?\n\nLinux integration components are now included in the latest kernel version 2.6.32.2 which makes a big difference in performance of both the drives and network running under Hyper-V."}, {"author_name": "Richy C.", "gravatar_hash": "dc4a5d8ea3df35ee7ba4d5e4f903053a", "author_url": "http://blog.rac.me.uk", "date": "Jan 18, 2010", "message": "I found Amazon's CloudFront and S3 storage solutions to be quite expensive, and not as responsive, as a \"proper CDN\". If you are pushing 2Tb of data, then Softlayer's Internap CDN solution would cost just $240 and if you let them know how much you are pushing, I'm sure they can work out better pricing (we're paying a \"pay as you go rate\" of $0.20/Gb: our normal DC would charge $2/Gb over our 600Gb/month limit).\n\nLaptopheaven: I know we're using an NFS mount to a network storage system to keep non-database content in sync, I would expect SO to use something very similar."}, {"author_name": "Navarr", "gravatar_hash": "3bea58dce452a627f2b29cfabf15c0d8", "author_url": "http://tech.gtaero.net/", "date": "Feb 11, 2010", "message": "If possible, you should configure your proxy to send any known google IP address to the server with the least load on it, to help balance things out (if it doesn't already)."}, {"author_name": "Austin Whitten", "gravatar_hash": "8c99593cc617d12247f837093de369b6", "author_url": "https://www.geeks-in-route.com/", "date": "Mar 26, 2010", "message": "hey nice blog as i used this stack overflow concept in one of the programming languages C which helps me a lot."}, {"author_name": "Doug", "gravatar_hash": "f3520932a6f244f67e8ac13803c14860", "author_url": "http://www.diaryofaninja.com", "date": "Apr 26, 2010", "message": "Great work - i've only ever used hardware based load balancing, but will add this to the bat belt for sure.\n\nI like your usage of VM's as to start with i thought you weren't using them.\n\nAre the VM's hosted on SAN storage - or just on RAID disks on the machines themselves? IE what is the process to migrate the VM's between hosts for SO? \nIs it:\n- bring machines down\n- copy VHD's over the network\n- start them up\nor do you have some sexy quick migration setup?"}, {"author_name": "Robin Day", "gravatar_hash": "218d33fcf91ab66b2f86276e229cd850", "author_url": "http://www.advorto.com", "date": "Sep 07, 2010", "message": "I'm curious as to why your DB Servers are physically connected to your Public Network?\n\nSurely the web servers only access them on the Private network or is it because you connect to them to manage them directly from the internet?"}, {"author_name": "JW", "gravatar_hash": "90c723dc23f03db2a5b4a58147e9a1b6", "author_url": null, "date": "Feb 08, 2011", "message": "I must say one of the best things about HAProxy besides it's performance and stability is the author -- Willy Tarreau.  He is exceptionally responsive and active in the community.  \n\nHe must have a bunch of web crawlers looking for HAProxy because as soon as it's mentioned - anywhere - he shows up to assist."}, {"author_name": "Handers", "gravatar_hash": "a254e218bba79138c02ad06120d3e2ed", "author_url": null, "date": "Mar 03, 2011", "message": "Now, the next part to scale even more is to migrate all your Windows backend solution to a Linux based one;) I'm sure your servers will  be more responsive"}, {"author_name": "mixdev", "gravatar_hash": "28c08be5625baaaae134156efef35b9d", "author_url": null, "date": "Jun 15, 2011", "message": "What webserver is running on sstatic.net?"}, {"author_name": "some12die4", "gravatar_hash": "bcd6ac3f30f7188e5e843b58462a3f23", "author_url": null, "date": "Nov 19, 2012", "message": "Of cource the database servers have public ip adresses - what other way do you see to replicate these databases accross the globe (in general)? Being in the public space doesn't mean that you can connect when you know the ip, there are firewalls that restrict the direct access to only specific ips/subnets, you know."}, {"author_name": "James", "gravatar_hash": "6c54c5f8b4b221619462d04c06565c5e", "author_url": null, "date": "Dec 23, 2012", "message": "Instead of pinging our proxy server, we use free external monitors, such as <a href=\"http://www.gotsitemonitor.com\" rel=\"nofollow\">GotSiteMonitor</a> to send http GET request and check the content of sample web page."}]}