{"response": [{"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jan 15, 2010", "message": "Could I suggest that people think slightly higher level than \"what should the API do?\" It's all too easy to come up with things that sound useful... but then when you think about what you *actually* want to use the API for, you find that you don't need all the cool-sounding stuff, but you *do* need a simple call which no-one thought was interesting enough to bother with.\n\nI would suggest that the first question should be: what do you want to build which would use the API? The *next* step is: \"the perfect API for this task would do [...]\"\n\nI'll try to post such an answer myself when I get time... although I'd suggest that this would actually be a better question on Meta than on this blog. That way people can edit their answers as they refine their ideas. Why not open a new question (rather than overloading the SXAPI one)?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 15, 2010", "message": "Go for it! (also, I edited the question at the bottom at your recommendation)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jan 15, 2010", "message": "Created a new question for this purpose:\nhttp://meta.stackoverflow.com/questions/35723"}, {"author_name": "Dean Taylor", "gravatar_hash": "347acc8ae4f645234b7afa1d90e757db", "author_url": null, "date": "Jan 15, 2010", "message": "Love the way you can \"Send feedback on this topic to Microsoft at the bottom of every page\" of the SXAPI documentation! :-)\nhttp://stackexchange-api.googlecode.com/svn/trunk/docs/index.htm"}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 15, 2010", "message": "Awesome, it's great to see the API finally getting some real attention. I remember pushing for one about a year ago for use with my reputation tracking service. Unfortunately, I've since lost interest in rewriting it (my goal at the time was a complete rewrite in Python).\n\nStill, my idea of the read API is basically either a JSON or XML version of every page in the system. So the front page, questions, profile pages, etc would each have a corresponding JSON and/or XML form. Of course, there are additional areas that would be useful to cover, but I that should be a good starting point."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jan 15, 2010", "message": "I'd also like to suggest that everyone involved watches the awesome Josh Bloch talking about API design:\n\nhttp://www.youtube.com/watch?v=aAb7hSCtvGw&amp;videos=cc9ON3R7M94&amp;playnext_from=TL&amp;playnext=1"}, {"author_name": "Mike", "gravatar_hash": "517b8d1816678e1bb15e93f5c2e6eb2a", "author_url": null, "date": "Jan 15, 2010", "message": "Just remember to use a URL like /apiv1/... So you can maintain backwards compatability when changing stuff."}, {"author_name": "Gustavo Carreno", "gravatar_hash": "927a6a1b98768f3887459fed49565ebc", "author_url": "http://gcarreno.org", "date": "Jan 15, 2010", "message": "Hey Guys,\n\nThis is a dream finally come true for the StackOverflow Bar.\nI've been postponing, well let's say I kinda lost interest, an upgrade to the bar in order to accommodate alerts 'cuz I had to parse the HTML.\n\nNow with the API, one thing I remember asking in the voice thinguymagog and nobody even answered it, I'm quite happy to extend the Firefox Bar to the Trilogy and even embark on a Google Chrome port.\n\nI do believe that I'm very satisfied with Kevin's Document about the desired features. All of them will suit me quite well in the making of the Bars trilogy for Firefox as well as Chrome.\n\nCheers,\nGus"}, {"author_name": "Samuel Jack", "gravatar_hash": "c0fc80cd6d6bb8dced35d09cf4b633da", "author_url": "http://blog.functionalfun.net", "date": "Jan 15, 2010", "message": "How about supporting Microsoft's OData format http://www.odata.org/ (billed as ODBC for the web)? With Office 2010 supporting OData, this would make it very easy to pull StackOverflow data into Excel for analysis. It would also open it up for easy ad-hoc queries from tools like LinqPad (http://www.linqpad.net/)"}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Jan 15, 2010", "message": "Hi Jeff,\n\nThis is a great idea, I have had some ideas for programs I would like to use, but I didn't want to violate the site by using a screen scrapper.  So I have been holding off.\n\nOne thing I think is important on the V1 is to introduce some kind of authentication scheme for all reads.  This will keep out the people that just want to copy everything out of your database.  \n\nMaybe the amount of API requests a user can perform is representative of their reputation.  This would be very inline with the more you use and contribute to the system the more it trusts you.\n\nBy the way OAuth would be perfect for this type of site.\n\nThat is my 2 cents.\nNick"}, {"author_name": "Mike", "gravatar_hash": "517b8d1816678e1bb15e93f5c2e6eb2a", "author_url": null, "date": "Jan 15, 2010", "message": "Yes that's another thing you might want: api tokens like facebook etc. that you have to aquire before you can query the site. This let's you control access and block abusive scripts."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Jan 15, 2010", "message": "\"One thing I think is important on the V1 is to introduce some kind of authentication scheme for all reads. This will keep out the people that just want to copy everything out of your database.\"\n\nGiven that someone who wants to copy everything out of the database would have a much easier time downloading the creative commons data dump rather than getting stuff a page at a time via the API, is this likely to be a problem with Stack Overflow?"}, {"author_name": "Gustavo Carreno", "gravatar_hash": "927a6a1b98768f3887459fed49565ebc", "author_url": "http://gcarreno.org", "date": "Jan 15, 2010", "message": "Hey guys,\n\nI have to agree to some extent of security or authentication, at least in my case where I want to give users alerts on changes on their accounts.\n\nBUT PLEASE not oAuth. I'm having a nightmare with the bloody UX on Dweetta(Delphi/FreePascal Twitter lib) because of oAuth. PLEASE consider the guys that will do Desktop apps, PLEASE?!?!?!?!? Pretty please?!?!? Sugar coated please?\n\n(The management wishes to thank you for all of your patience with this lunatic. Thanks)"}, {"author_name": "Carson McDonald", "gravatar_hash": "91ea0a69e05914fc423ea6a388e51d21", "author_url": "http://www.ioncannon.net/", "date": "Jan 15, 2010", "message": "I don't think authentication does anything for read access. The commitment has already been made to make the data available via the CC dumps and the API is really just an extension of that. I think authentication doesn't need to play a part until writes are enabled via the API. As far as rate limits go it probably makes the most sense to limit on IP."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": "http://stackoverflow.com/users/80572/kevin-montrose", "date": "Jan 15, 2010", "message": "@Kyle Cronin - SXAPI aimed to make everything publicly visible on S[O,F,U] available through an API.  I fell rather short of that goal, but the desired api is rooted in that goal.  That being said, there isn't a 1-to-1 page-to-call mapping but I'd consider any data omission a flaw.\n\n@Dean Taylor - You know, I never noticed that... Time to dig through Sandcastle and fix it."}, {"author_name": "Jason", "gravatar_hash": "0e2e822d32a7ab3d7f0b7098d03b1d16", "author_url": "http://www.quotidianword.com", "date": "Jan 15, 2010", "message": "I think the most useful API call, by far and away, would be a question summary without any part of the question. What I mean is, make the call (api.so.com/question/[id]) and return something to the effect of:\n\n[{author: 'SomeGuy', authorId: '1234', title: 'Some Question', answerCount: 3, upvotes: 1, downvotes: 0, views: 139, isWiki: false, asked: someDate, lastModified: someDate, answerAccepted: false}]\n\nof course that's not complete, but just off the top of my head, I think an API call like that could be unbelievably useful.\n\nCAPTCHA: inhumane cleveland"}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "Jan 15, 2010", "message": "I would definitely like to see a real-time feed similar to the Twitter Streaming API (http://apiwiki.twitter.com/Streaming-API-Documentation), including the \"firehose\" option. I would like to be able to write a process that receives real-time notification of new content on SO. This could be pre-filtered by content type (question/answer/edit/comment/vote/badge) or content attribute (tag/author/keyword) or any reasonable combination.\n\nThe Twitter Streaming API is already in use in the real world and they've already worked out a bunch of real-world things they needed to do (such as the dummy keepalive data described on the page).\n\nAs an additional benefit, search engines (Google, Bing, etc) today use the Twitter firehose and could potentially use the SO firehose at some point too.\n\nCaptcha: continued belching"}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": "http://stackoverflow.com/users/80572/kevin-montrose", "date": "Jan 15, 2010", "message": "@Jason - take a look at http://code.google.com/p/stackexchange-api/wiki/DesiredSOApi#Specific_Question\n\nI think that would satisfy your needs after some recent modification."}, {"author_name": "Jon Galloway", "gravatar_hash": "63c32b4489d13b17d23fd9db1505bdf9", "author_url": "http://weblogs.asp.net/jgalloway", "date": "Jan 15, 2010", "message": "I'll add this to the question on meta, but here it is too:\n\nPlease add a crossdomain.xml policy, especially for the read-only parts. That will allow cross-domain access for Flash and Silverlight.\n\nFor example, check out the Flickr cross-domain policy:\nhttp://static.flickr.com/crossdomain.xml\n\n\n\n\n  \n \n\n\nHere's the full spec:http://www.adobe.com/devnet/articles/crossdomain_policy_file_spec.html"}, {"author_name": "Jason", "gravatar_hash": "0e2e822d32a7ab3d7f0b7098d03b1d16", "author_url": "http://www.quotidianword.com", "date": "Jan 15, 2010", "message": "@Kevin - Awesome! Did you just update that or was I just spot on with my names for properties? :)\n\nCAPTCHA: retirees executives"}, {"author_name": "Nicolas", "gravatar_hash": "15962db3bafebdaa725a4c5709ccd932", "author_url": null, "date": "Jan 15, 2010", "message": "Please give enough for a (read-only :P) native desktop app clone of the website."}, {"author_name": "Gustavo Carreno", "gravatar_hash": "927a6a1b98768f3887459fed49565ebc", "author_url": "http://gcarreno.org", "date": "Jan 16, 2010", "message": "@Nicolas: Humm, that would also be quite handy. Darn, me a Desktop app evangelist and I never came out with that one, DRATS, DRATS and double DRATS. I can hear him snigerring already... Shut up Muttley!!"}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": null, "date": "Jan 16, 2010", "message": "@Jason - a little from column A a little from column B."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jan 17, 2010", "message": "Whatever you do, make it RESTful and at least optionally output XML please :) JSON as an output format is nice, but XML is easier to parse server side in some languages."}, {"author_name": "Avi Flax", "gravatar_hash": "81716107a9f18397945286898e2165f8", "author_url": "http://aviflax.com", "date": "Jan 17, 2010", "message": "Building on what Kyle and Michael wrote, it'd be interesting to consider the Stack Overflow API being just the Stack Overflow website. Leonard Richardson and Sam Ruby, in their book Restful Web Services, suggest creating Restful Web Applications which can simultaneously serve humans and programs. This means, basically, designing the web app around resources and their representations, and just making them useful and useable, and then making the representations useable by both web browsers and software developers writing programs. At my firm, we use mostly XHTML 1.1 representations, which can be easily rendered by browsers or used as data by other programs. But a site could just as easily support HTML representations _and_ others such as JSON or POX, using content negotiation.\n\nI know some developers prefer their APIs to be procedural, not RESTful, but a procedural wrapper could easily be created around the RESTful web app, or a procedural (SOAP, I suppose) API could be implemented alongside the app."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": "http://stackoverflow.com/users/80572/kevin-montrose", "date": "Jan 17, 2010", "message": "@Michael\n\nWhat languages have difficulty dealing with JSON?  The list of libraries at json.org is pretty large, and represents every language I've ever even considered working in.\n\nWhile I understand the motivation behind wanting both XML and JSON api's, I'd say it'd make developing\\documenting the API more complicated for very little reward.\n\nUnless there's a really big segment of the audience that simply cannot deal with JSON, I wouldn't support ALSO providing an XML API basically.\n\nI prefer JSON over XML because it is more concise and has stronger notions of arrays and numbers."}, {"author_name": "Phil", "gravatar_hash": "9178d0eacbd2a13b49729dec076eaf15", "author_url": "http://mytechworld.officeacuity.com", "date": "Jan 17, 2010", "message": "To answer the question more specifically of \"What would you actually *do* with it?\", I'm dead keen to write a fully-featured Firefox addon that polls the SO (et.al) site, notifies you of recent comments or answers, displays your current badges in the status bar and can provide you some stats on your questions, answers, comments and the like.\n\nBut would that be something people would use?"}, {"author_name": "Gustavo Carreno", "gravatar_hash": "927a6a1b98768f3887459fed49565ebc", "author_url": "http://gcarreno.org", "date": "Jan 19, 2010", "message": "@Phil: There already is a Firefox Add-On for SO. I was waiting for the API to flourish to get notifications on it. I considered HTML-Scrapping but cringed at the implementation when I asked around."}, {"author_name": "プラダ コピー", "gravatar_hash": "75a19b51f44abe3a2b55de290d60fec9", "author_url": "http://wwhttp://www.lv-star.com/Prada.html", "date": "Jan 29, 2010", "message": "Great Post. Keep going."}, {"author_name": "Will", "gravatar_hash": "cd4e7dbddbda5c7100ca769c1cad1704", "author_url": "http://willoller.com", "date": "Feb 09, 2010", "message": "I don't care as long as I can make a friends list and have pokes and birthday presents and farmville integration :p"}, {"author_name": "Mike", "gravatar_hash": "550b9d8569a2644b730a33c6e82d4ffa", "author_url": null, "date": "Mar 14, 2010", "message": "Rewriting every Url to include 'blah.json' or 'blah.html' in order to indicate the desired representation of your resources seems so 2004 compared to the \"Accept: application/json\" I'd expect from something written in 2010."}, {"author_name": "Scott Hanselman", "gravatar_hash": "719c91f5c3013e43ee46ed2bdc67f883", "author_url": null, "date": "Mar 26, 2010", "message": "This is a perfect case for OData."}]}