{"response": [{"author_name": "Soner Gönül", "gravatar_hash": "8348bcf40f55bc5818651824369caff1", "author_url": "http://sonergonul.net/", "date": "Sep 16, 2013", "message": "Stackoverflow made me a better developer and more important, a better person. \n\nThank you guys.. Thank you so much!"}, {"author_name": "Crazy Buddy", "gravatar_hash": "14ec262f4f1b80a000036c25c7dc33b8", "author_url": "http://crazybuddy1995.wordpress.com", "date": "Sep 16, 2013", "message": "Sep. 15 Eh? Last month (Aug. 15), I started a blog and my first post was about this (looks like some coincidence), my Stack Exchange experience as an \"yearling\". (Maybe some of you already know this)\n\nCongratulations and Thank you - Jeff Atwood &amp; team..!!! ;-)\n\nLinky: http://crazybuddy1995.wordpress.com/2013/08/15/an-yearling-on-stack-exchange-rant/"}, {"author_name": "John Bannick", "gravatar_hash": "9575cb3368711f2ddda58fb03aaf1a9f", "author_url": "http://ll.mit.edu", "date": "Sep 16, 2013", "message": "Stack Overflow has become an extension of code autocomplete, Google, automatic error detection in IDEs, and all the other things that make our coding faster and better. You guys done good."}, {"author_name": "Eric Lawrence", "gravatar_hash": "89c27d27b73dd3690b3dad59f3a539d1", "author_url": "http://fiddler2.com", "date": "Sep 16, 2013", "message": "Honestly, I'm there for the fake internet points. :-) Seriously: I don't play video games because I feel like they're a waste of time, even though I enjoy them. With StackOverflow, I get to \"play a game\" and don't feel like it's a waste of time."}, {"author_name": "Rahul", "gravatar_hash": "0e0ae28461488b97193e1957043fb995", "author_url": "http://www.newbiedev.com/", "date": "Sep 16, 2013", "message": "Every time I encounter an error, I know Stackoverflow will be there to save my ass. Thanks and Congratulations Jeff Atwood for building such an awesome product."}, {"author_name": "periklis", "gravatar_hash": "d0268404afae44a5d176d1d8144bca1d", "author_url": null, "date": "Sep 16, 2013", "message": "I've received and offered great advice in this site for more than 3 years. Having said that, let me tell you this: the site itself, its design, its ease of use, its overall look and feel and how it works, THAT, my friends, has been a fantastic inspiration and help to my work as a web programmer. You're a case study of how a great idea gets a great implementation."}, {"author_name": "Eric Lippert", "gravatar_hash": "6fbdff3ffb6f111d172759b4f05bea0e", "author_url": "http://ericlippert.cp,", "date": "Sep 16, 2013", "message": "Thanks for giving me the opportunity to connect with users and learn about what they find difficult. Every point at which someone stumbles in the language is a point where the language designers can do a better job."}, {"author_name": "uisdjisdieiejuefe", "gravatar_hash": "5d878210f86acd76013eab11d2d650e0", "author_url": null, "date": "Sep 16, 2013", "message": "\"It turns out that people will do anything for fake internet points.\n\nJust kidding.\"\n\nKidding? It's just the reality. Look at all these people playing Cookie Clicker..."}, {"author_name": "Vishal Kumar", "gravatar_hash": "83090ef94de690f694376cc637af8bf9", "author_url": "http://www.mytakeon.it", "date": "Sep 16, 2013", "message": "Stackoverflow is a place for me to get the best solution to a problem. If the problem is common enough, a solution is proposed within minutes. And at the end of the day, the best option always wins on stackoverflow. And I can use this collective wisdom to impress the clients I work for.\n\nIf I don't get a solution here, I know that I hit something new. So it is time to get on the drawing board. When I do find the solution, I share it so that the next person can gain from it.\n\nThis might look like a cheesy statement but stackoverflow has kind of proved how much we care for each other in the community. Points could be a reason but I feel there is also an urge among us to share what we have learnt and to help out if we can. The only selfish motivation behind it would be to feel better about ourselves."}, {"author_name": "Sunil", "gravatar_hash": "478c4c7224792354261d12471e386fc8", "author_url": null, "date": "Sep 16, 2013", "message": "Its good platform to sharing your knowledge !!\n\nGreat site !! keep it up : )"}, {"author_name": "Doug T", "gravatar_hash": "680652ec4feb1969c39cfba008214ea9", "author_url": "http://o19s.com", "date": "Sep 16, 2013", "message": "Thanks so much Stackoverflow. You've really transformed my career from another resume on Monster to somebody that can point to a portfolio of content. It sounds conceited, but I feel I have a much better appreciation of my market value and <a href=\"http://www.opensourceconnections.com/2012/10/01/switching-jobs-damn-the-torpedoes/\" rel=\"nofollow\">what I&#039;m capable of</a> thanks to this site.\n\nI'm eternally grateful!"}, {"author_name": "Kevin", "gravatar_hash": "4da9ccc4e39b0b36273e5c6058c9b543", "author_url": null, "date": "Sep 16, 2013", "message": "This place has accelerated the growth of my skills as from 1/4 impluse to warp 8.\n\nIt's incredible.  Aside from helping me solve problems and learning from what others post it has helped me get a lot better at thinking through a problem and identifying what is going wrong."}, {"author_name": "Aaron Crayford", "gravatar_hash": "9a96ac35c49db734523de7b689506941", "author_url": null, "date": "Sep 16, 2013", "message": "I use your product more than any other technology product outside of my compiler maybe on par with it. Thank you!\n\np.s. You guys found a way to beat Google at search! You are probably the only case I know of..."}, {"author_name": "Leigh", "gravatar_hash": "0f7016d902f882a9091744f588444862", "author_url": "http://expressionengine.stackexchange.com/users/800/leigh", "date": "Sep 16, 2013", "message": "I am an old-school geek from the USEnet era. I have written a .plan and edited my finger file, AND had a VAX account.\n\nEverything I learned...I learned from the geeks around me who helped out. They helped me learn how to ask better questions. They shared knowledge - not because I was paying them to, not because they were a TA in a class I was taking, but because they were genuinely excited about helping others learn. \"Here, here's this neat thing, isn't this cool?? And look what we can do with it!!\"\n\nI've used stackoverflow to find answers to questions I've had on the job. I've found answers to hobby-questions. And I've answered a few along the way, which is equally rewarding (in my mind.)\n\nHere's to many more years of Stackoverflow!"}, {"author_name": "Steve Jones", "gravatar_hash": "ad8866254cfce0a72f63d15bd108fd91", "author_url": "http://www.appeos.com", "date": "Sep 16, 2013", "message": "I love Stack Overflow and I visit it several times every (work-) day.\n\nIt is such a simple idea, but seems to work really well. I've learnt a lot and I hope that I've been able to pass on the odd useful item here and there too.\n\nThanks to everyone involved."}, {"author_name": "SteveB", "gravatar_hash": "d56fc1446fb44c8d15765ece84a2aec0", "author_url": null, "date": "Sep 16, 2013", "message": "I've learned more answering questions here in a single year than I did in the preceding 5! \n\nS.O. Long and thanks for all the fish..."}, {"author_name": "Tomalak", "gravatar_hash": "0ada184c98bf9073d15b2dc815be0170", "author_url": null, "date": "Sep 16, 2013", "message": "I'm an user on StackOverflow since the closed beta. I have been blown away by the pure concept behind the site way before it even actually existed. Yes, there was a time when all there was was the elusive idea to create a _different_ Q&amp;A site for developers and a small form where you could enter your email address and wait for the beta invitation.\n\nThere weren't many days since where I have not been on SO at least once. Call it a profound addiction, but it works just too damn well. \n\nI've been a the type of person that learns by reading, and always I have considered the forums and mailing lists that existed for programmers as a valuable resource to draw knowledge *from*, but never as a good repository to put knowledge *into*. I wanted to give back, but there simply was no suitable platform for it.\n\nThat changed with StackOverflow. Now, 5 years and almost 3000 answers later I'm still not tired of it. And I've learned a lot in this time myself, so it definitely works both ways."}, {"author_name": "Mahan H. Moghaddam", "gravatar_hash": "87235d2ed7095ff926b55e8268bc22b4", "author_url": null, "date": "Sep 16, 2013", "message": "Before the Stack Overflow, I was hovering on forums to seek my answers. When I found it and when I saw all the professional individuals are here, I decided to join and try to be a professional and that's what makes me come here and answer a question or two. I have a long story to say, but to make it short I want to say, thank you for making me a better engineer!\n\nFor appreciation, I want to thank w3schools.com and all of the guys who helped me here and outside."}, {"author_name": "Harold", "gravatar_hash": "182d0ce855c8324a596648c04643e8f9", "author_url": null, "date": "Sep 16, 2013", "message": "Actually, I don't often ask a question. Asking questions on SO is hard, and besides, it spoils the fun of figuring things out.\n\nSO, for me, is a good source of Interesting Problems. I like Interesting Problems, because well, they're interesting. Most sites dedicated to serving Interesting Problems actually serve Contrived Problems, some of which may be interesting, but usually it's largely disappointing - the kind of problems that you find in a Silly Interview Question: neither of practical nor even of theoretical value, clearly constructed solely to stump you.\nSO also serves a lot of Mundane Problems, because that's what many people ask about, but with the right combination of Favorite and Ignored Tags, the interesting stuff isn't that hard to find."}, {"author_name": "Benjamin Dumke-von der Ehe", "gravatar_hash": "b13dce689732844e6590da37048f0eaf", "author_url": "http://balpha.de", "date": "Sep 16, 2013", "message": "When Stack Overflow launched, I was just a hobbyist programmer who had been writing his first lines of COMAL as a 9-year-old, but had never actually considered to have a job as a developer. In June of 2009 I joined the site and the community as an active user.\n\nA fair amount of (mostly Python) answers, a few small side projects, far too many Meta jokes, and a whole bunch of unicorns later, in April of 2010 I received an email from Jeff saying \"You should work for us\". What can you say to that but \"Hell yeah\"?\n\nAnd suddenly (and still now, three and a half years later), I have an awesome job at an incredible company with lots of smart, friendly, amazing coworkers, always learn something new, and enjoy going to work every day (the whole 8.9 meters [that's 9.7 yards] from my bed to my office).\n\nSo yes, Stack Overflow has changed my life profoundly, in many ways. Thank you, SO. Thank you so much."}, {"author_name": "Ben Marks", "gravatar_hash": "6a10dc030fedfbc9a52251545672d53a", "author_url": "http://blueacorn.com", "date": "Sep 16, 2013", "message": "SO is my goto example for a beautifully-built web app. All non-SE fora seem to pale in comparison. It's very, very hard to accept anything but well-moderated, ranked answers. The Magento community thanks you for our home at http://magento.stackexchange.com/"}, {"author_name": "Russell Uresti", "gravatar_hash": "a77dc11a7231cb58e2b2424501ed50f4", "author_url": "http://russelluresti.com", "date": "Sep 16, 2013", "message": "I've only asked 6 questions over my 3 1/2 year membership, but that's usually because someone else has already asked what I wanted to know. There's a lot of quirky and unexpected knowledge that shows up on Stack Overflow - ways of solving a problem you wouldn't necessarily thought about when you asked the question."}, {"author_name": "scunliffe", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": "http://softwaredesignblog.wordpress.com/", "date": "Sep 16, 2013", "message": "Fake Internet Points! What T.F!? I've been collecting them for 5 years and I can't even cash them in! What a scam! :-P\n\nCongrats on the 5 year milestone I'm so glad I could play a small role in the site's success.\n\nI don't have any miracle stories but I've learned much more than I've shared.  I can't even imagine programming these days without having StackOverflow.com waiting ready to answer my every question."}, {"author_name": "Diodeus", "gravatar_hash": "969b153010f69ec07458fa1d9e8a413b", "author_url": null, "date": "Sep 16, 2013", "message": "StackOverflow has nailed it in terms of how a Q&amp;A site should work. The right combination of user-moderators and recognition points has build a lively and vibrant community.\n\nIt has introduced me to people who are better programmers than I, fostering my growth, and has given me the opportunity to give back to others to do the same."}, {"author_name": "Chok Wee Ching", "gravatar_hash": "5ca1ad1ae3e2f2fc8892b8c0bf0f33a5", "author_url": null, "date": "Sep 16, 2013", "message": "Looking forward SO coming with Real Life Q&amp;A"}, {"author_name": "Arie Stavchansky", "gravatar_hash": "7ca5e99a4f944cabe5dbf476c4d2a31e", "author_url": "http://stavchansky.net", "date": "Sep 16, 2013", "message": "SO is an invaluable resource for me, it is the only forum where I can count on active user participation.  Each time somebody posts a question or answer to my question, I am thankful for this site.  In some ways it has shaped my practice as a professional developer.  It is a pillar for the software development industry and I am continually impressed with the intelligence this site stores to disk every day.  Thank you for developing an elegant site for developers.  It was needed, and am excited to see what is ahead for it."}, {"author_name": "VonC", "gravatar_hash": "4fc12eea3fb81ede59d064d0fdbb84ab", "author_url": "http://stackoverflow.com/users/6309/vonc", "date": "Sep 16, 2013", "message": "My Stack Overflow experience, as I described it back in Nov. 2011, under 3 minutes:\n\nhttp://www.youtube.com/v/D2swiB8QOHk&amp;start=114&amp;end=267&amp;version=3\n\nIt hasn't changed since, and I am still learning. A ton."}, {"author_name": "SAB", "gravatar_hash": "e5a799a6e1f2692e8a6312d24851fa3e", "author_url": "http://www.serveradminblog.com", "date": "Sep 16, 2013", "message": "No matter which question I type into google, stack overflow has a solution...\n\nThanks"}, {"author_name": "Martin Ba", "gravatar_hash": "256c9d534302a138d5d1fe3ed833e217", "author_url": null, "date": "Sep 16, 2013", "message": "One word: Markdown"}, {"author_name": "Jin", "gravatar_hash": "70ad2c2830eb9a7753bd6312f3811e3e", "author_url": "http://www.8164.org", "date": "Sep 16, 2013", "message": "Stack Exchange has made me a better designer. I'm very fortunate to work with some of the smartest people out there."}, {"author_name": "Aviral Singh", "gravatar_hash": "aae94a9993c74005e05814511f03d3c6", "author_url": null, "date": "Sep 16, 2013", "message": "It has not been a long time since I joined Stackoverflow,but if feels like I've been a member since it was launched.It helped me to gain knowledge of such topics and critical aspects which I might never be able to find anywhere.\n\nI am really thankful to all of the members of Stackoverflow and more thankful to the founders for giving us such a community,really the would have been great persons.\n\nI am not a professional developer right now,but I am learning new things everyday from the greatest community ever established,and it's really fun to get knowledge from some of the best developers in the world.\n\nMy dictionary doesn't have enough words to express my heartiest thanks to the Stackoverflow's community.\n\nIf Stackoverflow was a question,I would dedicate all my reputation and badges to it.\n\nAt last,one more line \"StackExchange,you are best and greatest community ever.\""}, {"author_name": "corsiKa", "gravatar_hash": "eba3df62ea97ea9065ca70e9c06b80aa", "author_url": null, "date": "Sep 16, 2013", "message": "If there's one thing Stack Overflow has done for me personally, it's been an avenue to force a question into an answerable form. **This cannot be understated**: if you can't ask the question properly, how can you expect it to be answered? I've drafted hundreds of SO questions, but only posted a few dozen of them because the question I was writing reformatted the problem in a solvable way. And since you know the question will get trounced if it's not answerable, there's real motivation to draft it properly.\n\nIf the answer doesn't jump out at me, there's multiple unicorn-avatar'd experts on the other end just itching to help. (True story, my boss did not believe I got assistance from someone named \"OMG Ponies\", but when it took a query from 24 seconds down to 2, he became a believer...\""}, {"author_name": "juergen d", "gravatar_hash": "cc91c847294bef5149cf63f4820b2f8e", "author_url": null, "date": "Sep 16, 2013", "message": "When I started with Stack Overflow I knew a bit about SQL. Now after roughly 2 years of participating I think I can say I am a strong SQL developer. Solving other persons questions pushed my knowledge. And this is my profile motto for a while now.\n\nI also come back for fun, but wait - we hate fun here..."}, {"author_name": "Djam", "gravatar_hash": "5cafc6562af595535680ea912a467f33", "author_url": null, "date": "Sep 16, 2013", "message": "Web is definitely a nicer/more progressive place with stackoverflow. Remember those \"expertSexChange\" days? Yuck, I am glad we made it through."}, {"author_name": "Habib", "gravatar_hash": "5c8d12a8955108c41bfeb31e1fc249a5", "author_url": null, "date": "Sep 16, 2013", "message": "SO has contributed in improving my communication skills and be a better developer. It has also given me the confidence that not everyone is Jon Skeet :). My main objective to join was to learn new stuff and understand the technologies at work. Seeing the posts from people like Eric Lippert, Jon Skeet, Marc Gravell and Hans Passant has helped a lot. I have been contributing on SO for over a year and it has been an addiction, but a good one."}, {"author_name": "Chris Thompson", "gravatar_hash": "361e9181474352ffbfc16fcccfc7dd9c", "author_url": "http://ailish.chrisandailish.com/", "date": "Sep 16, 2013", "message": "My wife died suddenly in April, 2011. She was 28. She was a pedestrian in a motor vehicle 'accident'.\n\nAs a result, I had a number of financial questions. money.stackexchange.com was a friendly and reliable source of answers. Much of the time, I was able to find answers which had already been posted. Occasionally, I asked new questions and received polite and thorough responses, such as http://money.stackexchange.com/questions/10648/by-when-must-an-employer-send-out-final-payroll-tax-documents-t4-for-a-decease\n\nsuperuser.com also contributed. As part of the legal proceedings, I received a security video showing the last moments of my wife's life. http://superuser.com/questions/579484/converting-avi-encoded-with-imm5-codec showed me how to convert this video into a format I could keep, instead of being tied to a specific codec on a specific operating system."}, {"author_name": "Chopper3", "gravatar_hash": "9607d45c8fedcce07e2abee65fe1f442", "author_url": null, "date": "Sep 16, 2013", "message": "I never realised how angry I could get."}, {"author_name": "Peter Turner", "gravatar_hash": "edfa1f5a3274d9d6faa2035e6cd32077", "author_url": null, "date": "Sep 16, 2013", "message": "Christianity.SE gave me with an overinflated opinion of how much I know about the Catholic Church and Gardening.SE left me with a superabundance of ground cherries."}, {"author_name": "Theodore R. Smith", "gravatar_hash": "018c3bfcc249e1e2ac8618429599d5c9", "author_url": "http://www.phpexperts.pro/", "date": "Sep 16, 2013", "message": "I enjoy StackOverflow (and SE in general) because \n\n1. they do not tolerate trolls or disrespectful behavior of any kind,\n2. downvotes are NOT free and NOT available to brand-new, non-contributing sock-puppet accounts,\n3. and, the admins (via the meta. sites) actually listen to abuse claims, will investigate, and actually reverse down mods *AND* ban abusers, after warning them.\n\nThese are the three things I *struggle* with on the entire Internet at large, but most specifically at reddit, where the sockpuppets and downvoters and general harassers reign unchecked, particularly on /r/php.\n\nIt just comes down to enforcing common decency and making a downvote *cost* something."}, {"author_name": "David Welch", "gravatar_hash": "38c8c9ab3f106888bb3c5c1f1aa7c686", "author_url": null, "date": "Sep 16, 2013", "message": "Pay it forward."}, {"author_name": "Jared", "gravatar_hash": "afb1aa11627837bfe303ed3e3024444f", "author_url": "http://495west.com", "date": "Sep 16, 2013", "message": "I don't think it's an exaggeration to say that Stack Overflow and its community taught me to program. I'm not sure what I would have done without it. I still search for programming answers by typing \"stack\" before the question. I can't remember a time that the answer wasn't there. Miraculous is a fair adjective."}, {"author_name": "Jeff Oresik", "gravatar_hash": "257d1709e2d740a0373faf27c49c0f56", "author_url": null, "date": "Sep 16, 2013", "message": "As a lone programmer at my company, Stackoverflow provides the knowledgable team I never had without waiting in line at the coffee maker."}, {"author_name": "Daphne O'Keefe", "gravatar_hash": "6e311c25c3c0187b3499320576a5298d", "author_url": "http://LinkedIn.com/in/daphnemokeefe", "date": "Sep 16, 2013", "message": "I love getting all the Fake Internet Points (over 18000), but I spend just as much time helping others so I can earn Real Karma. I comment, add tags, and edit questions for clarity -- I have a specially soft spot in my heart for those struggling with English. But then, I can totally relate as an outsider; I am a statistically invisible woman over 60 who is a full-time web developer. Being anonymous on SO (oops), I can avoid the rampant gender-based rage and discrimination so prevalent in our industry, and be accepted for my expertise and contributions."}, {"author_name": "Ghazanfar", "gravatar_hash": "793b5fd2a9c15ab6d4da6f742d10d2c0", "author_url": null, "date": "Sep 16, 2013", "message": "Stackoverflow has greatly increased my communication skills and programming. The community is very very helpful and I want to improve it as much as I can. I have also learnt here that we learn and achieve our goals, step by step, not in a single leap. By experiments, practice and experience, anyone can become a good programmer.\nI also came across some of the great programmers like Hans Passant, Jon Skeet, Eric Lippert, Alexander Yee(Mystical),Luchian Grigore, Karl Phillip, Tomalak Geret'kal (Lightness Races In Orbit), ?(talonmies) and many more. I respect these people for helping out others in programming problems."}, {"author_name": "Chris Ballance", "gravatar_hash": "9229412a60708763d1be5ad63a385cd3", "author_url": "http://chrisballance.com", "date": "Sep 16, 2013", "message": "Well done guys.  Keep up the great work."}, {"author_name": "Tom Robinson", "gravatar_hash": "4c6128b1c3929d4900352bd3d3a82b35", "author_url": "http://www.tjrobinson.net/", "date": "Sep 16, 2013", "message": "I went to Jon Skeet's house, with Joel and Marc, and was there for the recording of a podcast - all thanks to Stack Overflow.\n\nAlso, I use the site almost every day to help me do my job. Thanks!"}, {"author_name": "Kobi", "gravatar_hash": "fd75cd399cd893182d6e3d06d738d6d4", "author_url": "https://kobikobi.wordpress.com/", "date": "Sep 16, 2013", "message": "When I had problems at work and I searched for answers, I kept hitting the same \"blog\". Somehow, this blog had the best answers. You notice these things.\nAfter a while it stopped making sense - no way can this guy know all the answers. So, now I had to notice there were different people giving answers. You probably had to be really good to get on this blog.\nThen, I clicked on the obnoxious orange bar at the top. I learned Stack Overflow is an open-for-all question and answer site. I was immediately enchanted by the idea I too could be one of these people.\nI signed up on September 15, 2008. I couldn't answer anything. I got over it.\n\nThe most important skill Stack Overflow taught me is communication. Now I *know* it is a challenge to convey your idea to others - but I think I picked up some tricks to achieve that, which I use daily. I also learned how to ask an excellent question, and how to read between the lines and guess what really stands behind a question.\n\nThanks!"}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.stackprinter.com", "date": "Sep 16, 2013", "message": "Thank you SO/SE and greetings for the 5 years milestone. \nWow, can't believe that my profile says \"member:4 years, 2 months\".\nThanks you guys for all your amazing work, making the Internet a Better Place, you have simply nailed it.\nStack Overflow made me a passionate developer, a better writer and thank you again, an Herman Miller chair owner winning the second prize of the SE API contest."}, {"author_name": "Sachin Yadav", "gravatar_hash": "268479d188c695b93ce53b3144a9b2b0", "author_url": null, "date": "Sep 16, 2013", "message": "I don't know how should I thank to this community. I really thankful to this community as Today I am better programmer along with problem solving skills only for you guys. I started putting answer here in Feb'13 but after that I am addicted to this. But this addiction paid me in a positive way.\n\nThanks a lot guys"}, {"author_name": "DDianaCarolina", "gravatar_hash": "390a8ca034ed15675c671103e7ab4257", "author_url": "http://www.financreditos.com", "date": "Sep 16, 2013", "message": "Thank you so much!! you make me a better daily developer :D I'm really happy to be here and learn a lot of good advices about all the tags you manage ;) thanks a lot!"}, {"author_name": "Conrad Frix", "gravatar_hash": "838f94e4247f0740e8be0cc6a9900278", "author_url": null, "date": "Sep 16, 2013", "message": "My references to Jon Skeet articles are a lot nicer\n\nMarch 2008 \nhttp://www.mail-archive.com/advanced-dotnet@discuss.develop.com/msg14013.html\n\n\nMarch 2013 \nhttp://stackoverflow.com/questions/15606519/class-persistence-in-c-sharp/15617774#15617774"}, {"author_name": "Jason Punyon", "gravatar_hash": "c88159de92d664d35761fe5828cc5ccd", "author_url": "http://jasonpunyon.com", "date": "Sep 16, 2013", "message": "Stack Overflow has made me a better programmer and I hope the bits I've contributed can do the same for someone else. \n\nI also hope I can get you all jobs someday (I work on Careers 2.0)."}, {"author_name": "Peter", "gravatar_hash": "bc794dd927f95ce0701cdc141bcd843f", "author_url": null, "date": "Sep 16, 2013", "message": "I use Stack Overflow more often than Wikipedia.\n\nThank you for making such a useful site."}, {"author_name": "Michael Myers", "gravatar_hash": "49f3a2065659f5b4efa05ae29bd0856a", "author_url": "http://stackoverflow.com/users/13531/michael-myers", "date": "Sep 16, 2013", "message": "In 2008, I had just discovered <a href=\"http://joelonsoftware.com\" rel=\"nofollow\">Joel On Software</a> and was reading it regularly. Joel mentioned that he was teaming up with somebody named Jeff Atwood to make some sort of Q&amp;A site, but I didn't think much of it at the time.\n\nBy September 15, I'd seen enough to know that this new site might be worth a look. I poked my head in, looked around a bit, and closed it. As a young developer, I knew that everyone there was so much smarter than me that I could never contribute anything.\n\nFor some reason I came back the next day. I saw a question that I'd just had to solve for myself, so I posted my solution. And somebody upvoted it. And the number next to my name went from 1 to 11. <i>Whoa.</i>\n\nI answered two more questions in the next half hour, then closed the tab, thinking it was pretty neat and maybe I should try again tomorrow. The next day I logged on again and found that one of my answers had been upvoted twice during the night. This was getting exciting! I posted another answer that day but it didn't get any votes.\n\nOn the third day I found a Java trivia question that I happened to know the answer to, and somehow no one else had posted the answer yet (a good solid three minutes after it had been asked). I posted the answer and it was accepted almost immediately! And it was upvoted! Over and over again! In all, I posted four answers that day and hit the reputation cap. And that, as they say, was that.\n\nAs a bit of a neat freak, I was very glad to reach 2000 reputation so I could fix all the horrible things other people wrote (its really an eyesore when apostrophe is used outside it's correct place). After the 10k tools were created in early 2009, I started spending a good portion of my SO time voting to close or delete questions that didn't belong. When Meta Stack Overflow began in June, I was there to navel-gaze and post jokes at inappropriate times (I still miss you, TheTXI and Pesto!). And a year after that, I managed to fail my way into a moderator post.\n\nIn the five years since Stack Overflow opened, I hope I've saved people's bacon as many times as they saved mine. Here's to many more years!"}, {"author_name": "David Thomas", "gravatar_hash": "3c89927e3ef6cdc985624637217867c3", "author_url": null, "date": "Sep 16, 2013", "message": "I started out in the beta, but then realised I didn't seem to know that much, (so wandered off and forgot my username/password so (deservedly) no beta badge for me). Eventually, after a few months, I was looking for some help with CSS and found the answer here.\n\nThen, I rejoined. And helped out, answered some few questions (on HTML and CSS, mostly). Then, somehow, accidentally learned JavaScript. And developed something of a passion for it.\n\nI think this is a good thing, and certainly reflects well on those that were willing to help me (and others, of course) out in my early days here; and now I get to give some of that back (though I think it's the nature of a perceived obligation, that I also enjoy so I'm not sure how to give back 'enough' as yet).\n\nI've been here every day for the past 1135 days (as of this writing), and I've enjoyed, and learned something, every single visit. I love this place, and while I remain only a hobbyist, I can't imagine not visiting regularly, which is so much more than I can say about any other site I've visited on the 'net thus far.\n\nSo: thank you all, for your help and guidance!"}, {"author_name": "Mitul", "gravatar_hash": "02aece665d5b35d09c3adce3bfe078a3", "author_url": null, "date": "Sep 16, 2013", "message": "You guys rock. I learn everyday something new due to StackOverflow. It made me a better programmer. Thanks for understanding programmers."}, {"author_name": "A", "gravatar_hash": "275d0c818c8301f5682ff7d6b764dfbe", "author_url": null, "date": "Sep 16, 2013", "message": "Initially, I refused to visit SO because I didn't want to get caught in some \"scheme\" where I would waste a lot of time to hunt for some arbitrary points ... yeah, that worked out pretty well.\n\nAt some point I really needed help. SO allows to ask a question without signing up, so it was the perfect choice for me. Then the question got upvoted and then I had to register to keep the points and I hate you guys."}, {"author_name": "Doorknob", "gravatar_hash": "efce35ec8c4107fb9215f12b39466ecb", "author_url": "http://stackoverflow.com/users/1223693/", "date": "Sep 16, 2013", "message": "Thank you, Stack Overflow. I am ten times the better programmer by having access to this site, to learn from my mistakes, to read other exemplary answers, to ask the occasional question. This site is one of the best resources I could possibly ask for."}, {"author_name": "Geoffrey Liu", "gravatar_hash": "6512c8b15243cd8188cdfcf966e552d4", "author_url": "http://g-liu.com/blog", "date": "Sep 16, 2013", "message": "Thank goodness, if not for Stack Overflow I'd be resorting to reading terribly formatted code on eHow or Yahoo! Answers."}, {"author_name": "TecBrat", "gravatar_hash": "f14dae89cf2c8863568b49f8e224ab5a", "author_url": "http://www.tecbrat.com", "date": "Sep 16, 2013", "message": "I joined about a year and a half ago. What made me realize I should join was that I found a lot of answers on Google that were links here. I've been hooked since! \n\nThe reputation system encourages me to understand and follow best practices so that I can give good answers and get my fake internet points we all love so much. \n\nI am becoming a better programmer because of it."}, {"author_name": "Andrew Thompson", "gravatar_hash": "a1ab0af4997654345d7a949877f8037e", "author_url": "http://pscode.org/", "date": "Sep 16, 2013", "message": "\"SO is a waste of space.  It is frustrating to try and get a question asked without being closed.  The people who answer are uptight theorists with no experience in the real world, and they're rude.  I'm never coming back..\"  \n\nOK - that was BS, but do you really expect to see any commentary on this page, from people who hold that attitude?  If not, is it any more indicative of success than the dry stats. quoted in the article?  \n\nFor me, SO's success is summed up in the fact that in searches related to Java programming, the top 3 hits will typically point to SO.  As to the fluttering newbies who might make the first comment, they can (and probably still do) get benefit from SO via search engine.  Otherwise the site &amp; everyone that reads it is probably better served by them making no further comment."}, {"author_name": "Cyborgx37", "gravatar_hash": "00ac838164eb0f7463972867d530cf89", "author_url": "http://stackoverflow.com/users/211627", "date": "Sep 16, 2013", "message": "I've gotten some great answers, so I can certainly say I've benefited professionaly from the site.\n\nMore than that, though, Meta has taught me what it means to function in a democracy full of differently-minded people. Learning to accept others' opinions and their right to those opinions (even though they are *clearly* wrong... maybe) has been a very refreshing experience. :)"}, {"author_name": "Peter Alfvin", "gravatar_hash": "ec173eb866e0d1d97bcd22cf6ad6550a", "author_url": null, "date": "Sep 16, 2013", "message": "I get a thrill out of the points and I get satisfaction from helping people out, but mostly I find that answering questions is a terrific way for me to learn about the things that interest me.  Nothing beats having to solve a problem and then explain the solution to someone to make sure you understand it.\n\nAs for asking questions, SO has given me practice in \"asking for help\", something I've assiduously avoided in the past for reasons of pride.  And it's so much more efficient than banging your head against the wall!"}, {"author_name": "Ramy", "gravatar_hash": "04db5519fe4156e0b045879c3239127c", "author_url": null, "date": "Sep 16, 2013", "message": "Stack exchange even helped me with university issues, with questions that professors used to don't answer, or to answer after weeks. Sometimes a hint from someone else is better than studying hours."}, {"author_name": "Thomas", "gravatar_hash": "1194aab69f9d9fd8d872bc68fbb7f275", "author_url": null, "date": "Sep 16, 2013", "message": "When thinking about Quora.com, I always compare Quora to StackExchange. Both have great content. But then you have to login to Quora and then I think how much I HATE having to login to Quora and so I DONT! Long live StackExchange!"}, {"author_name": "Jeroen Heijmans", "gravatar_hash": "761c9b01fb2cbf8aea5f026056cae2f8", "author_url": "http://www.jeroenheijmans.nl", "date": "Sep 16, 2013", "message": "You guys <a href=\"http://cooking.stackexchange.com/a/22409/9453\" rel=\"nofollow\">made me cook fish in a dishwasher</a>, so what can I say? Stack Exchange is awesome! Thanks for creating, maintaining, and constantly improving it."}, {"author_name": "Andrew", "gravatar_hash": "a530a3b4ab049e5b6bc05541e1aee314", "author_url": null, "date": "Sep 16, 2013", "message": "Thank you stackoverflow and other stackexchange sites!"}, {"author_name": "Don Gateley", "gravatar_hash": "13d197f2bcddf47dcccb1cc0f3a616fe", "author_url": null, "date": "Sep 16, 2013", "message": "As often as not when I follow a link to stackoverflow to see the answers to a question it has either been nanny closed or nanny commented to death about how it doesn't fit the regulations or whatever.  The incessant nannying by some obnoxious pencil-necks who can't find personal power any other way has pretty much killed my interest in following links to stackoverflow or going there for answers."}, {"author_name": "smonff", "gravatar_hash": "f1e893587f96c95ba404e7997c8cfdd3", "author_url": null, "date": "Sep 16, 2013", "message": "For somebody with a so loose memory as me, Stack Exchange is just the perfect place for me to quickly find some programming bits, great command line taken, power user public secrets and is a prove of that people like to exchange, compare their point of view and become better.\n\nIf SE should disappear one day, I will cry, but it will have learned us how to build a wonderful stuff like it, maybe..."}, {"author_name": "ybouhjira", "gravatar_hash": "ad95b62ac7245badd9ee6fafa8d4b28e", "author_url": null, "date": "Sep 16, 2013", "message": "I search on google, and then look for StackOverflow results :D"}, {"author_name": "Owen Johnson", "gravatar_hash": "8a887bc4a087817116470f88f3101164", "author_url": "http://owenjohnson.info", "date": "Sep 16, 2013", "message": "Thank you stackoverflow for providing all of the documentation that should have existed!"}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://nov8r.com", "date": "Sep 16, 2013", "message": "Note that of those 5 million questions, 4 million were answered (correctly) by Jon Skeet.\n\nCongratz on building the dream!"}, {"author_name": "Bhuvanesh", "gravatar_hash": "6339bceb6ecfcff27580d9809ec59fb9", "author_url": null, "date": "Sep 16, 2013", "message": "Stackoverflow has never disappointed me. I have always got solutions or pointers to them through you. Really indispensable tool for the internet community. Thank you for creating this!"}, {"author_name": "David Heffernan", "gravatar_hash": "3c0aac2191718ef0309dbc034d9b9961", "author_url": null, "date": "Sep 16, 2013", "message": "I'm a keen answerer of questions. I enjoy trying to help others, and sometimes succeed in doing so. The real reason I spend time writing answers is that I learn new many things. Getting free swag in the post is nice too!  ;-)"}, {"author_name": "Thorazine", "gravatar_hash": "0a5d94b4b4ec4d20a306d0c3123698bb", "author_url": null, "date": "Sep 16, 2013", "message": "This website saved my ass so many times countless times. I'm not a noob, but not advanced either. But there are always those moments when you get stuck in your tunnel vision after a long day of programming, or you have that one piece of tech where you just can't seem to find the answer to. Those are the moments you normally start to look on the internet or worse, make up some funky solution. Then, as always, your friends at stack come up with a solution. \nI can't thank people enough for the answers I get. In turn, to show my thanks back to the community, I made an account and started answering questions. With this I know I helped a lot of people, but not nearly enough to pay back all the information I've been given. Even though, it is satisfying to get a plus 1 or a correct answer. It show you you've grown over the years and become a better programmer. \nNowadays I don't even go anywhere else but stack for my answers and question. I love the way the site pushes the correct answer to the top, it makes it so that I don't have the look through all the bullshit on the page to find what I'm looking for. \nAs programmers we have little time already (it's a known fact). This site makes me save time on my day to day, which in turn gives me more time doing what I want.\nSo thanks for giving me more free time and more knowledge.\nSee you tomorrow again!"}, {"author_name": "Sklivvz", "gravatar_hash": "3fd9e5b2c59170ec3d74dde30d233fa4", "author_url": "http://www.sklivvz.com", "date": "Sep 16, 2013", "message": "I had been a long, long time admirer of Joel Spolsky and his blog; I had been a long time reader of Jeff Atwood and his blog; and I had been a long time abuse victim of the \"hyphenated site\".\n\nOne day one of the people in my team screamed up! He got in the Stack Overflow private beta! I didn't know what it was, and I was too late to get an invite. But I was intrigued, very intrigued.\n\nAs soon as the site went public I joined and it became an instant addiction. It was a great site, done in my tech stack of choice, where you could get coding answers literally in minutes or seconds, and great answers! I was an instant addict.\n\nFrom the humble beginnings (I still remember many of the initial users) I saw the site grow, then become Stack Exchange. I joined some of the newer sites, first Physics, then Atheism which died and was resurrected as Skeptics.\n\nI become a pro-tem moderator on Skeptics in 2011, got elected in 2013 after graduation. I guess that could have been a great end game but my involvement was clearly unstoppable by then.\n\nIn march of 2013, I casually found myself looking for a job and Stack Exchange opened up the offices in London where I live. \n\nI went to the opening party and I met Joel, Tall Jeff, Marc Gravell and many other stackers. Things quickly escalated from there and I was offered a job soon after.\n\nI now work for arguably the best company I've ever worked for, and I am enthusiastic to be able to contribute even more to this incredible project to make the internet better.\n\nThanks Joel, Jeff, Stack Exchange and the whole incredible community. \n\nYou truly changed my life."}, {"author_name": "Sheikh Heera", "gravatar_hash": "3232415a0380253cfffe19163d04acab", "author_url": "http://heera.it", "date": "Sep 16, 2013", "message": "Fortunately I passed high school because I was never interested in school and when I went to collage I just went out of the right track and became kind of wicked kid and dropped out from the college and after a period of time I recovered from bad things and tried to restart the study but i couldn't get it but fortunately got myself admitted into a computer training academy in 1995 and it was a blessing from God (IMO). I was 1 year in that institution and finally in 2008 I took it as a profession and began to develop.\n\nOne day I came in SO, seeking help (Thanks to Google) and found it really helpful. I left and never come back until one of my beloved brother said me to participate in So because it helps to learn new things. I joined and after two years (now) i've realized that, what I've learned within 12 years (1995 - 2007), StackOverflow taught me more than this within two years. It's a huge place to learn new things from experts all over the world and i'm really interested to learn new things and will do it till I die. So, thanks to StackOverflow. I love this community."}, {"author_name": "Billy", "gravatar_hash": "b62097f0991a4de0e228e434dfd3cc48", "author_url": "http://www.billyshih.com", "date": "Sep 16, 2013", "message": "Last year I decided to become a developer and now I am one! Without Stack Overflow, I never would have made my first iPhone app or even today, figured out some obscurities of CSS or JavaScript.\n\nI can't believe this site is only 5 years old since it holds so much valuable information already. Long live Stackoverflow!"}, {"author_name": "Louis", "gravatar_hash": "30e20fa57593c82c81ef4ddd5caf3684", "author_url": null, "date": "Sep 16, 2013", "message": "Came from Experts Exchange. Never looked back!"}, {"author_name": "Chris Hannon", "gravatar_hash": "238b79cb4c5360d865d87075d7c17bc1", "author_url": null, "date": "Sep 16, 2013", "message": "Thanks for giving me a place to expand my interests. I've answered a few questions when I have time, but I find that the largest benefit to me is the ability to sit and listen to other people's Q&amp;A. \n\nEven if I don't join in much, and even if I never directly encounter things that are talked about, the conversation is almost always worth listening to and I'm better for it.\n\nI'd also like to personally thank Eric Lippert, Jon Skeet, Marc Gravell, Hans Passant, and so many others, for contributing. It would be a much less interesting place without their input."}, {"author_name": "Aristos", "gravatar_hash": "8fcfe7f9b32a269c116145c0a318705b", "author_url": null, "date": "Sep 16, 2013", "message": "No question here, and not points - what to answer ? :)\n\nOK I found it... Stackoverflow is my daily reference on programming, and I thank you all for that."}, {"author_name": "500 - internal server error", "gravatar_hash": "d0c5d0ffb970a59ae53f25fc3dbef419", "author_url": null, "date": "Sep 16, 2013", "message": "Stack Overflow has helped me help people become better programmers.\n\n"}, {"author_name": "500 - internal server error", "gravatar_hash": "d0c5d0ffb970a59ae53f25fc3dbef419", "author_url": null, "date": "Sep 16, 2013", "message": "(sorry - that was meant as a joke but my hint that that was the case got chopped off)"}, {"author_name": ":)", "gravatar_hash": "7526f342b8ed4975cb05e4c3ea166657", "author_url": null, "date": "Sep 16, 2013", "message": "The period before StackOverflow was the Dark Ages for programmers. Digging through countless forums and by the time I found the answer on Forum XX page 15, I would get too tired to be happy.\n\nThank you to the creators of SO to give us and the future this platform. \n\nThank  you to the incredibly selfless and generous people who extended their hands to help total strangers like me."}, {"author_name": "Evan", "gravatar_hash": "f27eaaf98735d27452d231ffdc5de9b5", "author_url": null, "date": "Sep 16, 2013", "message": "生日快乐，love you"}, {"author_name": "codeMagic", "gravatar_hash": "4a40fc671a280b0980c72e889b51c118", "author_url": null, "date": "Sep 16, 2013", "message": "I have learned that the reason WHY an answer is will be much more helpful than WHAT the answer is from a lot of great members but especially from people like [Sam](http://stackoverflow.com/users/1267661/sam), [pragnani](http://stackoverflow.com/users/1727092/pragnani), [ρяσѕρєя K](http://stackoverflow.com/users/1202025/k), and [Raghunandan](http://stackoverflow.com/users/653856/raghunandan). Thanks guys and to many others. \n\nI've been able to give a lot more answers than questions and, thanks to these folks, hopefully I was able to help many more along the way. I've also been able to connect with others around the globe which is nice for a little developer from IN, USA. I love SE and tell everyone I meet about it, not matter what there interests, because there's nearly something for everyone here."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.billthelizard.com", "date": "Sep 16, 2013", "message": "Stack Overflow started at about the same time I was starting my own blog as a way to share some code snippets and mark off the bottom right square on the <a href=\"http://sijinjoseph.com/programmer-competency-matrix/\" rel=\"nofollow\">Programmer Competency Matrix</a>.  Needless to say, SO filled that requirement way better than Yet Another Programming Blog.  Thank you for giving us all a place to share our knowledge with and learn from our fellow programmers.  The site and the community here make one of the most indispensable tools on the Web."}, {"author_name": "Aybe", "gravatar_hash": "c16354d30a3d1531f8a7fa053b95716c", "author_url": null, "date": "Sep 16, 2013", "message": "SE is a bone of the web PERIOD. Unless the web closes its doors one day, it's here to stay :) Should it disappear one day, it'll be a sad day ... Big thanks to the initiators of this project and to the answerers !"}, {"author_name": "Rolando Angel Edwards", "gravatar_hash": "6566a52971f284b19822a45d97db828f", "author_url": null, "date": "Sep 16, 2013", "message": "My experience may sound miraculous but here it goes...\n\nWhen I joined the StackExchange on Oct 29, 2010, I was asked to answer questions so as to draw attention to my employer's services. This has resulted in hundreds of dollars in bonus points because some have browsed my employer's website because I had links in my profiles.\n\nMy previous employer from 2006-2007 kept his eye on posts and actually asked me to work for him again (on March 12, 2013). I had said no then.\n\nAs the question says \"THEN A MIRACLE OCCURS...\"\n\nI was laid off on August 19, 2013 at 9:05 AM. That afternoon, at 3:26 PM, I asked that former employer if his offer is still good.\n\nGuess what ??? I start work Sept 30th.\n\nI was in shock that he said yes. I thank God that happened. Evidently,  I was actually planting seeds in the StackExchange. It grow into another job for me.\n\nTHANK YOU SO MUCH !!!!"}, {"author_name": "Sat", "gravatar_hash": "ecb2a40d56918f88ce6a44ef4e8efc86", "author_url": null, "date": "Sep 16, 2013", "message": "Flew across few timezone for my studies with no idea of work culture in the new area, Thanks to stackoverflow and its career section, because of scores here, got an opportunity to work alongside as student. So, serious people do notice it which matters. (Revolution indeed):)"}, {"author_name": "Motiur Rahman", "gravatar_hash": "5f533b551196ee3636013ed40e8634b8", "author_url": "http://N/A", "date": "Sep 16, 2013", "message": "Yes , I saw its rise , I also saw it getting Google hits in the last 5 years , however I didn't cared about it , unless , yes some nice stranger from a German research institute(or something along that line, I'm lazy for a double check) that specializes in parallel computing helped me solved a minimax problem that does parallel computation . It is at that moment I truly appreciated the power of this platform .\n\nKudos , and that said , sometimes I am scared that people will be dismissive about my problem , because they are too common , or they have seen such problems in the past , so I shouldn't have asked them in the first place . I sometimes hard to be a first-timer ."}, {"author_name": "Aditya", "gravatar_hash": "a7211e127ef5dfde8798bbb2aed64279", "author_url": "http://gamingpwnage.webs.com", "date": "Sep 16, 2013", "message": "I mostly ask newbie questions, but I learned a lot and picked up good coding habits from this place."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Sep 16, 2013", "message": "I signed on to Stack Overflow during the beta, after learning on the podcast that folks would have to gain some reputation before being allowed to edit. I was tired of seeing useful information buried under nondescript questions, and hoped that SO would become a sort of *wiki-editable forum* to help alleviate this problem. \n\nSo I answered a few questions and posted a few of my own, edited a lot of stuff (hopefully for the better), and spent way too much time arguing about the behavior of the software itself. And this ended up having a few unexpected benefits:\n\n<ul><li><b>I got better at discussion.</b> For something that is explicitly <i>not</i> a discussion platform, SO has a lot to teach about constructive discussion. An awful lot of Internet discussion mediums implicitly encourage strategies that seek only to elicit responses, via appeals to prejudice and emotion, or to wear the other participants down in order to have the last word... Conveying useful information often happens as an afterthought (if at all). The notion that a <i>really useful</i> post is one that gets very few responses (if any) took me a long time to latch onto, but it is one that's improved my ability to write far outside of Stack Exchange.</li>\n<li><b>I got a lot better at editing.</b> Modifying someone else's work is deceptively hard: done right, it's often more like <a href=\"http://en.wikipedia.org/wiki/Active_listening\" rel=\"nofollow\">active listening</a> than copy editing. A great edit can change the entire perception of a post without losing sight of the original author's intent, a skill I've come to see as incredibly valuable and worth striving to obtain.</li>\n<li><b>I became more patient.</b> Nothing beats seeing an up-vote - or accept checkmark - on an answer written months or years ago to remind you that there are folks still out there struggling with the same problems that once frustrated you, and that it's worth spending the time to post this stuff even if the person you're replying to seems to have disappeared without a trace. And seeing a proposed feature implemented months or years after you proposed it is a great motivator to keep suggesting improvements - even when it seems like no one is listening a lot of the time.</li></ul>\n\nFor something I expected to be little more than a useful novelty, I've learned a heck of a lot from y'all. Thanks!"}, {"author_name": "Travis J", "gravatar_hash": "fabde205435e5299ee6cf78b57ba084f", "author_url": null, "date": "Sep 16, 2013", "message": "SO account: http://stackoverflow.com/users/1026459/travis-j\n\nMy story? It did not begin 5 years ago with stack exchange. 5 years ago I was a student studying computer science aspiring to complete a bachelors and start a company.\n\nIn fall 2010 I completed my degree work and began to develop, realizing that starting a company would probably require more capitol than I had. I returned to assist in a company I had worked with over the past decade. \n\nWith the goal of creating a service I began developing with the same technology that stack exchange was built with. While developing I came across various exceptions that I drew a blank over. I searched for the text of the error and got help at stackoverflow. At first, I did not even notice that the majority of the links I clicked were stackoverflow because I was also looking at other resources online. I also bought a lot of books. Any time I was considering something new, I would buy a book. I guess that was just instilled in me from being \"classically\" trained.\n\nAfter a few months of noticing a pattern of visiting stackoverflow I posted my first question. http://stackoverflow.com/questions/8467172/post-redirect-get-hide-url-parameters . Okay, so it was a rudimentary issue. Since then I have answered over 1,000 questions. I have learned more by answering questions than I have asking them, because the information is so thoroughly scrubbed it forces you to be accurate.\n\nSome of my favorite moments on stackoverflow have been from users pointing me to official documentation that I had not been aware of. For example, the ecma-international.org site for the real breakdown of javascript.\n\nThe highlight of being at stackoverflow has been the other users. People who think to take time from their busy lives to break down problems other people are having - taking their miracle on a chalk board to an tangible implementation.\n\nMost of all, I will never forget getting to chat with Jon Skeet in the C# chat room. What luck!"}, {"author_name": "Bubbassauro", "gravatar_hash": "06997de36e4665ff74bb369d7ccdee33", "author_url": null, "date": "Sep 16, 2013", "message": "Just as today people ask \"how did you find directions before Google Maps?\" future programmers will ask \"how did you program before Stack Overflow?\" \nI've heard old school people complain that Stack Overflow lets less competent programmers thrive with copy+paste but I think software development has evolved greatly and Stack Overflow is a big part of this transformation. \nThis is not restricted to programming, but our ability to think is becoming far more important then our capacity to memorize. \nI feel fortunate to see this happening!"}, {"author_name": "Kjuly", "gravatar_hash": "8b06c176818a8b734f8452951c7bc9e2", "author_url": "http://kjuly.com", "date": "Sep 16, 2013", "message": "&lt;3&lt;3&lt;3"}, {"author_name": "Ab", "gravatar_hash": "5c3dd9e7a994cca6fda5982d3c30ba07", "author_url": null, "date": "Sep 16, 2013", "message": "Then let me ask: How did we program before Stack Overflow? \n\nNot optimally, not well at all... \n\nA huge thanks to you guys, here's to great programming!"}, {"author_name": "SimulJustusEtPeccator", "gravatar_hash": "18c69f5fa7c85eda85e5c9060096bfc0", "author_url": null, "date": "Sep 16, 2013", "message": "Too often I feel like a spoiled kid because of StackOverflowed. Then, in that moment of childishness, I am terrified by the thought of the whole world will soon learn how to program; such reality could make us programmers no longer \"special\" !!! This fear factor reinforces my learning habit."}, {"author_name": "Wilfredo Perez (Freak_Droid)", "gravatar_hash": "82db789bd4fefc59427a2e17e1624568", "author_url": null, "date": "Sep 16, 2013", "message": "I am SO addited, because I can learn or help another people.\n\nI think It's very important join here if you wanna improve your code, help and know new thing.\n\nThanks SO."}, {"author_name": "lk", "gravatar_hash": "b16dd7b3e678ee9e96edefea28e65ec7", "author_url": null, "date": "Sep 16, 2013", "message": "Happy birthday.  Phper from china~"}, {"author_name": "BrianK", "gravatar_hash": "a2ae8510ad48b14c617d7f686ceed7b4", "author_url": null, "date": "Sep 16, 2013", "message": "What makes Stack Overflow and other stack exchange sites great is the quality of people that take time to answer questions. I have been helped many times. Usually an answer apears within minutes. I frequent Stack Overflow, electronics.stackexchange and diy.\n\nThanks everyone,\nBrian"}, {"author_name": "Jorge", "gravatar_hash": "0ad3cda97392381f25cc3b2c293f9521", "author_url": null, "date": "Sep 16, 2013", "message": "En más de una ocasión me ha salvado el día las respuestas que he encontrado, sé que existe una gran probabilidad que un problema que se me presente en algún código encontraré una respuesta en stackoverflow.\n\nFelicitaciones por este nuevo año y espero ayudar a que siga \"Ocurriendo el milagro\"."}, {"author_name": "SyAu", "gravatar_hash": "86253ff5c2d3c2e2157ed86723e9896b", "author_url": null, "date": "Sep 16, 2013", "message": "This is the best thing in Internet. Got fed up with many forums where people spam with incorrect answers and this one almost weed out all those junk answers. Whenever I face problems during programming, I do a Google search and find answers here, it saves me a lot of time. You guys are amazing and make world a better place to live. Keep up the good work."}, {"author_name": "Maver1ck", "gravatar_hash": "d5cb41511e61e211efd0e95d2cf6fb7e", "author_url": null, "date": "Sep 16, 2013", "message": "I've started with Android development about a year and a half ago without having any clue. SO helped me to make a quick start and still I'm around here every day, reading, asking, answering and learning something new every single day. Thanks @SO"}, {"author_name": "Chandra Sekhar", "gravatar_hash": "7b7cbef75a2a4050ecbd28f8008c6f80", "author_url": "http://profile.kakarla.in", "date": "Sep 16, 2013", "message": "Congratulations to Stack Exchange, for complete 5 successful years!!\n\nI joined SE, 3years back. and it's a nice experience to learn and share thoughts at single place. \n\nI wish you all the best to Stack Exchange and it's careers product as well."}, {"author_name": "Pete", "gravatar_hash": "0711ab4c750b83f18bae23d5354e1640", "author_url": "http://www.bucketlistly.com", "date": "Sep 16, 2013", "message": "StackOverflow helped me built my Rails MVP for my startup in 3 days. That's probably the best thing you could get out of the Internet, seriously. Go above and beyond, StackOverflow!"}, {"author_name": "Edgar", "gravatar_hash": "4b3530f402215cc8bd19e06ba52b9af8", "author_url": null, "date": "Sep 16, 2013", "message": "Stack Exchange helped me with my self-confidence in UX and gave me that external validation that it's usually hard to get through off-line relationships with its reputation system. It's a good way to develop, study and get your skills better and it feels like playing :)"}, {"author_name": "Hazem", "gravatar_hash": "726b7abd2905fbbc6db35a97a42b72f9", "author_url": null, "date": "Sep 16, 2013", "message": "I always Google my hard programming questions. When I find an answer on stackoverflow, I know I've found the right answer and look no further."}, {"author_name": "MjPy", "gravatar_hash": "1d07dce39b867e6601dc89b2b80689c4", "author_url": null, "date": "Sep 16, 2013", "message": "I love you lots! But half of my answers go uanswered:-P, but in all seriousness I really Love you!:-D"}, {"author_name": "Toffy", "gravatar_hash": "1eb31409a4f7be5750455cf41837557d", "author_url": null, "date": "Sep 16, 2013", "message": "Happy birthday. From China."}, {"author_name": "Bingo", "gravatar_hash": "5564b90846a5c15d0d732861a5e806c8", "author_url": null, "date": "Sep 16, 2013", "message": "Love u so much. \n-From ShenZhen, China."}, {"author_name": "Ibrahim Diallo", "gravatar_hash": "cbda3bc84a5cfbf079067679a60a13de", "author_url": "http://idiallo.com", "date": "Sep 16, 2013", "message": "I came to stackoverflow to ask questions. Instead, it taught me that answering questions was a better learning source. So now I spend lots of time figuring out other people problems and helping them. In return i learn new things that i would never have tackled in the first place. \n\nStackoverflow is a pillar that should be used to inspire all of the internet."}, {"author_name": "Buddhika", "gravatar_hash": "3036746cd09f445476fa075a232f9531", "author_url": "http://www.divudi.com", "date": "Sep 16, 2013", "message": "Thank you for all the help for making a platform to others to help me."}, {"author_name": "Anjum", "gravatar_hash": "8b9e2c65212ce2cd2447d63eb6178746", "author_url": "http://TrackNifty.com", "date": "Sep 16, 2013", "message": "StackOverflow = Google of programmers"}, {"author_name": "Sri Harsha Chilakapati", "gravatar_hash": "8bbacc5c12ebacaa855340096bce5027", "author_url": null, "date": "Sep 16, 2013", "message": "SO made me a good programmer, thank you!"}, {"author_name": "cir", "gravatar_hash": "7c60b576124f91384f0a0431d04a340d", "author_url": null, "date": "Sep 16, 2013", "message": "StackOverlow helps me to reason and solve problems in a fraction of the time I used to, by just answering a few questions per day. It's great!"}, {"author_name": "bloodchill", "gravatar_hash": "b9d7c2c89f02d2e8a85d9c4de2260d18", "author_url": null, "date": "Sep 16, 2013", "message": "Appreciate in Chinese\n感谢有你！\nstack overflow!"}, {"author_name": "mVChr", "gravatar_hash": "deb5db496ae1d5e7dbdcaa38f3c9b31b", "author_url": "http://stackoverflow.com/users/246616/mvchr", "date": "Sep 16, 2013", "message": "StackOverflow is now one of my primary resources for solving difficult programming bottlenecks or blockers.  I also enjoy sharing any knowledge that I have and sharpening my toolset working on other people's problems.  Heck, my score of \"fake internet points\" might have even helped me get a job or two as I always include a link to my profile somewhere in my job applications as a proof of my knowledge and problem solving abilities.  Thanks for building a great site and community."}, {"author_name": "sarah", "gravatar_hash": "a34e5f915795024e481e463d20859581", "author_url": null, "date": "Sep 16, 2013", "message": "Thank you so much Stackoverflow \n\nThank you so much everyone\n\nsarah"}, {"author_name": "TRS", "gravatar_hash": "16be8d3871e453377ce800de5cb3a068", "author_url": null, "date": "Sep 16, 2013", "message": "Stack overflow is my best buddy at office."}, {"author_name": "Uwe", "gravatar_hash": "f6addbfe45ddf511d760fb63be09b024", "author_url": "http://www.zeta-producer.com", "date": "Sep 16, 2013", "message": "I found love, joy and happiness through Stack Overflow. And did find solutions for various programming questions, too."}, {"author_name": "Poovizhirajan", "gravatar_hash": "fadae4db62c13064f4724ebcdf598e74", "author_url": "http://enpboss.weebly.com", "date": "Sep 16, 2013", "message": "It is an very useful developer discussion site... \nthank you for this opportunity...........\ni have learned lot many from this buddy......congrats!!!!!!!!!!!!"}, {"author_name": "Owais Qureshi", "gravatar_hash": "483a99aca77d2bd00062a733ed053f24", "author_url": null, "date": "Sep 16, 2013", "message": "SO is a great place to be ,before SO i had to use the msdn for Q/A it was so unresponsive ,but in SO the concept of commenting on a question  , cool detailed point system and powerful moderation made it a pretty powerful Q/A site.I immediately adopt it the first time I used it ,I felt so great among the best and smart programmers from all around the world."}, {"author_name": "Arjun Pakrashi", "gravatar_hash": "e2a400cef6dbb94a8777c161d5b43d0c", "author_url": "http://phoxis.org", "date": "Sep 16, 2013", "message": "Truly, the miracle did happen."}, {"author_name": "Narendhar", "gravatar_hash": "47f807bd36eab72e23965f7c2cda4e0e", "author_url": null, "date": "Sep 16, 2013", "message": "SO is programmmer's Paradise..."}, {"author_name": "Jamal", "gravatar_hash": "955391456e5c4694e550fbc0bbf7d858", "author_url": null, "date": "Sep 16, 2013", "message": "I'm so thankful to have discovered Stack Overflow.  Not only does it have the solution to nearly all of my problems, but it has strengthened my passion for coding.  Finally, there's a site out there that prides itself with good answers and accepts no less.  So many other sites tolerate this, but SO doesn't.  It has also led me to discover Code Review SE, which has helped me on my own coding projects, further increasing my understanding.  With that and SO, I was able to start practicing reading code from others, then providing my own answers.  I'm only a CS undergrad, and I was able to do all that outside the classroom.  This is what sharing knowledge is all about."}, {"author_name": "Prasanth", "gravatar_hash": "5db54bf2901d5c5b9d2c6bc6233d08a6", "author_url": "http://stackoverflow.com/users/1273830/prasanth", "date": "Sep 16, 2013", "message": "I became a fanatic once, and was looking to see if I can become fanatic more than once immediately. It has become part of daily life. It's like how facebook is for the social-crazy chunk of people out there.\n\nSO AWESOME."}, {"author_name": "BackTrack", "gravatar_hash": "004919661254567c1f7bdb08b3c1d30e", "author_url": null, "date": "Sep 16, 2013", "message": "i love being on overflow ."}, {"author_name": "Jan", "gravatar_hash": "468007eacff864e16869f97e1da7d34e", "author_url": null, "date": "Sep 16, 2013", "message": "Stackoverflow is easily the most important, most helpfull website for any developer. The quality, quantity and variety of information is unbelievable.\n\nThank you guys!"}, {"author_name": "Duncan", "gravatar_hash": "b65116e4df1cb9f916e4928827f85549", "author_url": "http://stackoverflow.com/users/2107374/acutesoftware", "date": "Sep 16, 2013", "message": "At first I though the required tone of questions at answers was a bit stiff and informal, but quickly realised that THAT is what makes it very effective in finding answers.\n\nI have learned a lot being on here, and hopefully have helped some people too. \n\nWell done!"}, {"author_name": "Raja", "gravatar_hash": "53094a2e545cf24598c5bb3ea23cc047", "author_url": null, "date": "Sep 16, 2013", "message": "Real and Best website for programmers all over the world. Belated wishes.\n\nThank You SO\nRaja"}, {"author_name": "Sam", "gravatar_hash": "ec7836ddda30d8350af398842ea6427c", "author_url": null, "date": "Sep 16, 2013", "message": "Thank you"}, {"author_name": "Rumit Parakhiya", "gravatar_hash": "dacead8eef07e19fb0c7fcac773b8824", "author_url": null, "date": "Sep 16, 2013", "message": "Stack Overflow is like my mentor. I started using it around 2 years back. At that time, I wasn't knowing about the stream of knowledge flowing into it. But Now, I became addicted. It helped me learn many new concepts and of course it is always besides me to troubleshoot any situation. (Not only about programming, but also when I am in workplace dilemma, Mathematical confusion and many more things.) Now a days, stack overflow is my favorite place to read on when I want to kill my free time. It helps explore many interesting things and programming 34concepts which otherwise, I haven't even heard about.\n\nThanks Stack Overflow and Jeff Atwood especially to build this amazing thing."}, {"author_name": "Charandeep Singh", "gravatar_hash": "87c624a5aac5183baddac296e03bac89", "author_url": "http://www.itgeek.in", "date": "Sep 16, 2013", "message": "I have learned alot from SO community and still learning. Thank you so much Stack Overflow. :)"}, {"author_name": "Yu Hao", "gravatar_hash": "c556b9524d5283d700f702328490dde8", "author_url": "http://stackoverflow.com/users/1009479/yu-hao", "date": "Sep 16, 2013", "message": "I've only been an actual user that answers questions for several months. And I can already say that I love this place. Great thanks to the C/C++/Lua community, it's a great honor to be part of you guys.\n\nAlso I hope StackOverflow will spread more and more in China."}, {"author_name": "Sudheer Gupta", "gravatar_hash": "059555936ff05967f3abe7682c0df2a8", "author_url": null, "date": "Sep 16, 2013", "message": "Last year, while struggling with my code, I came across Stack Overflow. \nIts really a great help for me. Now, Its something like google for me. Whenever i stuck with any issue, its always there to provide support in forms of Suggestions, Ideas, examples.\n\nCongrats for your 5th Anniversary!!!!! \nThank you guys for your innovative experiment which turned out to be a great success."}, {"author_name": "Chaitanya", "gravatar_hash": "6cbe7d1426d8833168be78dd76276496", "author_url": "http://www.chaitanyabilgikar.com", "date": "Sep 16, 2013", "message": "A huge thank you to the SO Community and the SO Developers. You have truly created and maintained a masterpiece. Where would the world of Computer Scientists and Programmers be without you!"}, {"author_name": "CrashOveride", "gravatar_hash": "733e40dc27174acda114cc295a6c75ee", "author_url": null, "date": "Sep 16, 2013", "message": "SO made a platform where the computer-world enthusiastic people come and try to help other's, Even they come with questions sometimes.\n\nNow everyoneknows where to look for the answers without going to G."}, {"author_name": "Manoz", "gravatar_hash": "fdb2e1dcd4f2019061f916c8f0b51718", "author_url": "http://www.tazajobs.com", "date": "Sep 16, 2013", "message": "Stack overflow omitted non-sense out of me.\n\nIt is now I am talking about the programming knowledge, I was a Web designer and a Better web developer now because of stackoverflow."}, {"author_name": "Rahul Kulhari", "gravatar_hash": "f16d9790cf530bfb36a69c3dd734c578", "author_url": null, "date": "Sep 16, 2013", "message": "If you love to see issue and bugs and you think you are clark kent you can go to Stackoverflow."}, {"author_name": "Aravin", "gravatar_hash": "07f314b03da855b76b7d33406e43b5fa", "author_url": null, "date": "Sep 16, 2013", "message": "StackOverFlow is the best choice for programmers."}, {"author_name": "xiaohouzi79", "gravatar_hash": "42222e355ad9724ee97af42726cd537a", "author_url": "http://stackoverflow.com/users/139196", "date": "Sep 16, 2013", "message": "For someone who is not a real programmer I have had a lot of joy from the Stack Exchange network.\n\nI participate in many different sites, but the biggest personal benefit is just reading and marveling at some of the incredible effort people put into answers."}, {"author_name": "Zaheer Ahmed", "gravatar_hash": "a70c1b07732f8075bcf238bcfd1eabad", "author_url": "http://stackoverflow.com/users/821057/zaheer-ahmed", "date": "Sep 16, 2013", "message": "Stack-overflow is always my first choice to go to when have any programming issues. It makes the helping procedure so interesting that everyone love to interact. It is actually a official-network of programmers."}, {"author_name": "cMFG", "gravatar_hash": "812048727656e0c8e79b1ef8e8c2cc82", "author_url": null, "date": "Sep 16, 2013", "message": "Stackoverflow is great. However there is a serious problem with some of the smaller stack eschange sites. I have laid out the issue here: http://chrisgriffing.com/rants/2013/09/16/the-problem-with-stack-exchange/?preview=true&amp;preview_id=85&amp;preview_nonce=32bb377c73\n\nThe question may not have been the best, but please examine the ridiculousness of the comments, especially those by EDDY74. Then see the followup post and see how sad the whole situation really is."}, {"author_name": "Chaitanya", "gravatar_hash": "015f8bed997306d2921bc69eabd2b66a", "author_url": null, "date": "Sep 16, 2013", "message": "I am from India and most of the modern technology used in the world is not taught here(still the world outsources their work here and we do it) yet but still I want to learn it and we have no idea where to go when I have some problems and our last resort is the stack overflow, I do care about the points and being new here I can't tell you how over joyed I am when someone upvotes my post. I have learned a lot from reading and being a student it helped me clear my internship interview and the credit goes to stack overflow and programmers stack exchange. This site is a forum for the programmers and I believe that programming is an art, every artist has a different art form which he learns from the previous art forms."}, {"author_name": "miumax", "gravatar_hash": "eddd4b80b1d10a11a4e806c72aa89db3", "author_url": null, "date": "Sep 16, 2013", "message": "You've saved my ass lot of times.Thanks lot for your service."}, {"author_name": "Avadhani Y", "gravatar_hash": "18570f3971b90ecb208c89a2c1b4612c", "author_url": "http://stackoverflow.com/users/928814/avadhani-y", "date": "Sep 16, 2013", "message": "Whenever a developer comes up with an issue, first thing in mind is \"Ask Question\" button on the top-right side of StackOverflow site. Thats the height of addiction to SE Sites. You made me a better developer when i started my career in June 2011. Now, i am able to answer questions better than before. Long Live StackOverflow!!!"}, {"author_name": "Subhrajyoti Majumder", "gravatar_hash": "ca2f8ffbcc4001670bb0666956414258", "author_url": null, "date": "Sep 16, 2013", "message": "It is a knowledge hub, I love to weste time here coz it makes me crazy. Its really fun. Thank you - SO"}, {"author_name": "Martin Varghese", "gravatar_hash": "240639d9f6040e6063d5c5240477acbd", "author_url": "http://stackoverflow.com", "date": "Sep 16, 2013", "message": "Thank you SO for making the internet a better place for the programmer. SO has helped me immensely in my journey as a programmer. SO was interesting from the beginning because there was very little or no noise. Only good questions and great solutions. I still remember the day when a program manager at Microsoft answered a question of mine! I have met great people who were total strangers through SO. I hope that in the future SO will stop deleting questions that have been answered, just because some people had down-voted it! \n\nCheers!"}, {"author_name": "Kumara", "gravatar_hash": "67e69d12a2ef0c32ae5254caf1aaad78", "author_url": null, "date": "Sep 16, 2013", "message": "Addicted . I have  set SE site as Home page . . It is helped a lot.  As a learner , Lect , guider ,etc , This is the forum to enjoy makes life crazy."}, {"author_name": "Relin Jose P.M.", "gravatar_hash": "2303cb308948177e15d49cf6e0cf9d74", "author_url": "http://www.relinjose.com", "date": "Sep 16, 2013", "message": "Pretty good decision of creating a website for such a vision amidst all social networking and entertainment sites for fun...\n\nReally the knowledge Overflows from the persons around here!!!\n\nFred Roger's quote inspires!!"}, {"author_name": "David Weinraub", "gravatar_hash": "9c0638740f30456f7224f18f33ba034b", "author_url": "http://www.papayasoft.com/", "date": "Sep 16, 2013", "message": "It's hard for me to overstate the impact that Stack Overflow has had on my career and, by extension, my life.\n\nI'd been programming in PHP for many years as an independent developer - transplanted from the US, living in Thailand -  but largely as a low-skill hacker. I would slowly pick up ideas here and there, employ a cute little class or a technique of some kind, but I was still functioning as little more than a script-kiddie. Not surprisingly, my \"career\" and the attendant revenues that it generated, were meager: enough to live on, but not really enough to thrive.\n\nI began a self-study of Zend Framework and Stack Overflow emerged as an important vehicle in that study, at first primarily as a source of answers to my questions. But since I have always judged the firmness of my understanding by my ability to explain it, I slowly started answering questions where I could.\n\nIt was hard at first. I knew so little, that each answer I submitted required a lot research. Further, this was a public forum and I was desperately afraid that it would turn it into a megaphone for my incompetence, for my inexperience, for my stupidity. But getting \"out there\" and risking the embarrassment of being wrong (while simultaneously forcing me to raise my game so as not be wrong, at least very often) were critical steps in my progress as a professional developer.\n\nOver time, I increased in confidence and accumulated some reputation. The profile that I was able to establish on Stack Overflow was exactly the kind of self-marketing with which I was comfortable. I didn't really see myself glad-handing at networking events to drum up business, handing out business cards, and claiming the be the \"third largest developer of information technnology solution for small and medium enterprises in the greater tri-state area\" or some such thing. Between the small corpus of writing I had established on SO and the reputation that attached thereto, anyone who needed to know was able to get a sense of what I was about without me having to puff it up into a tangled jumble of self-promotional Dilbert-speak.\n\nThe opportunities that have since come to me - working on great projects with the awesome team at Diamond Web Services in Los Angeles; consulting on some startups; serving as technical reviewer on a book - all came in some part from this public profile. \n\nBut most of all, because these opportunities enhanced my career/revenue profile, my children now have a father who - while still busy and still overwhelmed with the always-present, absolutely-crushing responsibility of parenting - is now able to at least provide for them and who can be there for them with less stress about making next month's rent.\n\nI think it's fair to say that my life and the lives of my children are significantly improved in no small part due to Stack Overflow.\n\nMany thanks!"}, {"author_name": "Nikhil", "gravatar_hash": "8395ddac6b49ada12c4d8034e5ebfc66", "author_url": null, "date": "Sep 16, 2013", "message": "I started off my career on 15th of Sept, 2010. I have learned a lot from you guys. U guys are keeping the IT running all the time. Owe u lot... \n\nThanks and Cheers!!!!"}, {"author_name": "Almas", "gravatar_hash": "bfdd2310303436966484dd963cfde2cf", "author_url": "http://mixdesign.kz", "date": "Sep 16, 2013", "message": "In 13 days I'm gonna be Fanatic of Stackoverflow with \"Fanatic\" badge."}, {"author_name": "Yoke Lee", "gravatar_hash": "b2ea188616461f6e02b131800fdef563", "author_url": null, "date": "Sep 16, 2013", "message": "I'm so glad Stackoverflow is invented. \nMan learn until the day he dies, there's no telling when you are a master of something coz there's always someone who is better than you.\nAlthough there's society control over the laziness that someone need to browse around to ask similar questions (which is good juz a little painful), I couldn't ask for more people with higher reputation to not neglect or discourage new guys just joined the community with good intention, to learn. One must remember that before today, he was there as well."}, {"author_name": "MjPy", "gravatar_hash": "1d07dce39b867e6601dc89b2b80689c4", "author_url": null, "date": "Sep 16, 2013", "message": "Ok since we are talking innovative here. Please Python and Enthought people have a look at this.\n\nhttp://stackoverflow.com/questions/18826696/python-enthought-traits-how-to-get-multi-column-from-spreadsheet-to-display-on\n\nAll suggestions welcome! Shameless I know but Stackoverflow is to blame!:)"}, {"author_name": "vishal", "gravatar_hash": "0cd9a6bb831ab6c4e8dc6c637214f62c", "author_url": null, "date": "Sep 16, 2013", "message": "Beginner to Expert levels in any technology is possible by Stackoverflow only....."}, {"author_name": "Ervin", "gravatar_hash": "a69e2c20ef104d5ad535dbf77d9f3eaf", "author_url": "http://www.nagyervin.eu", "date": "Sep 16, 2013", "message": "I spend my online time here instead of Facebook :)"}, {"author_name": "Raphael", "gravatar_hash": "0dd9365d8252a72133763fe709aed809", "author_url": "http://rafaldrozdowski.com", "date": "Sep 16, 2013", "message": "Thanks a lot guys. You have helped me hundreds if times... Even once one of my interview questions was: how do stay up to date with the Web knowledge. So answered reading books and keeping reading a mine of knowledge StackOverflow. Thanks a lot"}, {"author_name": "Amar", "gravatar_hash": "40536fec7c7d500ed6d661a322980cfb", "author_url": null, "date": "Sep 17, 2013", "message": "Congratulations and salute to the collective spirit of making the Internet a better place. :) :)\n\nStackoverflow has helped me get over the addiction of Facebook (:P). Answering questions and helping someone is way better than refreshing the FB news feed every two minutes. So I want to say thank you for that. SO is also a great place to hangout, I wonder how exciting it would be to work here (A bit of personal agenda :P)?  \n\nI have learnt a huge amount about iOS and ObjC just by reading the answers given by super smart people on SO. This knowledge has benefitted me immensely in my career and I am grateful for it. \n\nKeep up the good work folks!"}, {"author_name": "Tech Trainner", "gravatar_hash": "2bd4a535d47b550694903379f0953cbf", "author_url": "http://androidtrainningcenter.blogspot.com", "date": "Sep 17, 2013", "message": "Its proud moment to become a billionaire by Helping other. Jeff Atwood has done it. Congratulation SO."}, {"author_name": "Thomas", "gravatar_hash": "3002b731ecfe1dd72686b808471b62f5", "author_url": "https://www.mediationaktuell.de", "date": "Sep 17, 2013", "message": "Happy Birthday!\n\nNow I know that even a 5 year old can teach me something... ;-)"}, {"author_name": "Hemang", "gravatar_hash": "41a72eafad3ebd6b2fce873d4920580c", "author_url": "http://about.me/hemang.shah", "date": "Sep 17, 2013", "message": "Congratulations to SO team! Amazing venture of the people, for the people! Getting and giving helping hands from last 1.5 years. It's like I am learning many things here, I will always give good credits to SO for helping to improve myself in different ways. :)"}, {"author_name": "TheBronx", "gravatar_hash": "00d78a4a26d340ae87f740184bfd400d", "author_url": null, "date": "Sep 17, 2013", "message": "Well, when SO launched I was studying Computer Science so I can't imagine how programming was without SO... Where did you find out regular expressions then?? You didn't have upvotes???\nThat's weird."}, {"author_name": "Lorenzo Dematte'", "gravatar_hash": "85e5c60ca8616d3c9269378baec34972", "author_url": "http://dematte.org", "date": "Sep 17, 2013", "message": "Like others have already said, the importance of StackOverflow in my day-to-day job can be easily descibed by one sentence:\n\nWhen I have a trouble, I go to google to find a solution; then, I scan the page to look for StackOverflow hits.\n\nAnd answers are not the main thing I like about the site(s). They are thorough, they are spot-on, they help me learn. But questions are precious too. The format, so similar but so different from forums, makes you put some real research in the answer. I have learned more by answering than by asking.\n\nI am starting to read other SE sites too, and I am (thankfully) seeing the same happening: painfully, slowly at the beginning. But surely headed towards being THE resource.\nI really wish SE the same success as SO, and many others happy birthdays to this great company, and to the people behind it that made (and makes) this magic happening every day!"}, {"author_name": "Sarathi Kamaraj", "gravatar_hash": "d9fc096eab19d3f1a84997826f3384f8", "author_url": null, "date": "Sep 17, 2013", "message": "That's a very nice quote..\n\nAlways look out for helpers, you will find one....\n\nGood job Stack overflow... \n\nWe will keep up to your reputation :-)"}, {"author_name": "danar", "gravatar_hash": "f851307e594e0ecab95ada31f806b79e", "author_url": "http://amez.co", "date": "Sep 17, 2013", "message": "your web site benefit me more than all my teachers thank you very much the best web site ever."}, {"author_name": "cpp", "gravatar_hash": "c508127077d2f0ee6e3d505273cbbfba", "author_url": null, "date": "Sep 17, 2013", "message": "It's a rare chance to interact with the best programmers of our times."}, {"author_name": "atupal", "gravatar_hash": "9dd98d12e06024dac5d1e66e775e3339", "author_url": "http://atupal.org", "date": "Sep 17, 2013", "message": "Congratulation.\nThanks to SO, I have got my prolem solved many times here!\nAnd SO let me know that the internet can be so interesting ."}, {"author_name": "Rajnish", "gravatar_hash": "830fc2f61395f445a6dfa6ea7b370b67", "author_url": "http://www.radicallabs.com", "date": "Sep 17, 2013", "message": "We all here love stackover flow and other sister sites.\n\nYou people are a part of our daily lives."}, {"author_name": "Selvam", "gravatar_hash": "808d017998bc8d2ba62fd3d76dd0b7d7", "author_url": "http://stackoverflow.com/users/2298058/bgs", "date": "Sep 17, 2013", "message": "Stack overflow reduce the developer searching time..\n\nIf stack overflow is not birth , then we spend lot of time to get the answers and resolve the problem...\n\nIn single place we get everything...\n\nCongrats.."}, {"author_name": "Selvam", "gravatar_hash": "808d017998bc8d2ba62fd3d76dd0b7d7", "author_url": "http://stackoverflow.com/users/2298058/bgs", "date": "Sep 17, 2013", "message": "Stack overflow reduce the developer searching time..\n\nIf stack overflow is not birth , then we spend lot of time to get the answers and resolve the problem…\n\nIn single place we get everything…\n\nCongrats.."}, {"author_name": "pratap", "gravatar_hash": "0d70baccd85471a4bbbc13a75880cd47", "author_url": null, "date": "Sep 17, 2013", "message": "congrats to stackoverflow for completing successfully 5 years, it is helped me a lot at critical times"}, {"author_name": "Manojraj Teli", "gravatar_hash": "2a92770ee89fe546c0dc5ef79aaa6fb4", "author_url": null, "date": "Sep 17, 2013", "message": "As a programmer i have learnt many things about programming as well as helped small number of people with answer.These bunch of sites is most complete forum. I fear one thing as number of sites increasing it might confuse users about posting question on forums."}, {"author_name": "Ankit Parekh", "gravatar_hash": "a45c49bf2b42b68a257682eb1097c3e1", "author_url": null, "date": "Sep 17, 2013", "message": "When i started learning Android, was very new to development, my senior showed me StackOverflow and google group. He said this is how you can learn at your own, but at the same time you should share your knowledge as well so others can learn too. I really appreciate your idea of sharing of knowledge."}, {"author_name": "Aaron Wright", "gravatar_hash": "124f1b519331a0bcc8ec08bec827710a", "author_url": "http://aaronwright.net", "date": "Sep 17, 2013", "message": "Stack Overflow has helped me get out of debt, loss weight, and save my marriage!\n\nOkay, not really. But seriously, I find myself on this site multiple times per day to get answers to questions I couldn't find anywhere else. The format of the site makes it so easy to find the best answer along with discussions about little quirks to look out for in the code being presented. My skills as a programmer have increased dramatically thanks to what you have done. Thank you! Here's to five more years of success!"}, {"author_name": "Rheza Pahlevi", "gravatar_hash": "42839741bd1dd020aa7e5d848a4865f9", "author_url": "http://rheza.net", "date": "Sep 17, 2013", "message": "Thank you so much guys,"}, {"author_name": "James Brooks", "gravatar_hash": "13616b6551a3854378f9e6fea964e519", "author_url": "http://james.brooks.so", "date": "Sep 17, 2013", "message": "Before Stack Overflow, I think the majority of us had to deal with Experts Exchange, or dated information on forums elsewhere.\n\nSO has improved the developer community, not only by bringing us to a central repository of information but ensuring that the information here is of top grade quality."}, {"author_name": "Mr_Green", "gravatar_hash": "ef7a7186e7dce93cbcb3d6ee049d79cc", "author_url": "http://kamlekar.com", "date": "Sep 17, 2013", "message": "In questioning, commenting and answering some posts, I learnt much about \"how the stuff actually works\" instead of what I was assuming. Through this site, I also get close to some authors.\n\nIn short words, I love how SO works :)"}, {"author_name": "kaffein", "gravatar_hash": "d62e6933954fafc77c5a35a287b27a19", "author_url": null, "date": "Sep 17, 2013", "message": "Stackoverflow is just amazing. It gives you the opportunity to help people and learn in the same time. I have realized how awesome the fact of answering questions is : it really helps you shape the way you think about problems and the way you solve them. Sometimes (it happened for me more than once actually), the simple fact of posting questions gives you the answer right away because when you try to ask something, you are always worried that the guy who will be reading your question will not understand it, and then you try to structure the way you ask the question (the problem then) the best you can : and you just realize that the problem is not actually a problem, it was just about making things clear for yourself -- that's always funny when you have this Aha! moment on a question you've posted yourself!\n\nI have also had the opportunity to be recruited on Stackoverflow for a job in Germany as an Android developer. Probably the best profesionnal experience of my life :) and I will always be thankful for that!\n\nStackoverflow is not only about Q&amp;A it goes beyond that : it is also about people sharing knowledge, interests, passions. It's about helping and being helped ... it's a community and a family!\n\nthanks SO!!!"}, {"author_name": "Benjol", "gravatar_hash": "501465a53bf1042de206d7d79cc68942", "author_url": null, "date": "Sep 17, 2013", "message": "I went through some of the same phases as Shog - starting with SO, then 'graduating' to the mildly eccentric world of meta (and the completely-wacky Tavern). Was vastly more pleased with some of my ideas being adopted there than I ever was with rep. On SO itself, I gradually found myself doing more editing than answering. Then got increasingly 'burnt out' by the mountains of pending stuff in the review queues.\n\nOver the last few years my engagement has been increasingly utilitarian: popping in to get answers to whatever the problem of the moment is. SO is amazing as a marker for quality: Any SO links that turn up in Google are obviously the first to get visited (and I don't often have to try any others).\n\nSO (and SE) also gave me my first (and only) experience of being an 'open source' provider (of a 'widget'), which is a nice alternative way to engage with the 'community'.\n\nOn my wish-list for the future:\n- sorting out the meta-SO/meta-SE confusion. \n- doing something (better) about preserving 'quality' posts that have been (retroactively) deemed off-topic\n- some kind of marriage with Discourse to make room for my more ... discursive tendencies.\n- a better metaphor for SE governance. The original 'run by the community' still seems sophistic to me. The community does the gardening; SE does the landscaping, and owns the garden."}, {"author_name": "stema", "gravatar_hash": "b99acfecb53c940f06f2fc63b409d22b", "author_url": "http://stackoverflow.com/users/626273/stema", "date": "Sep 17, 2013", "message": "I learned here so much about programming. I learned here so much about answering questions, hoping my answers help some people. I learned here so much about asking questions. I got to know here so many excellent, passionate programmers and I learned so much from them.\n\nThank you very much for this site. Keep on the good work!"}, {"author_name": "PeterM", "gravatar_hash": "4c83e992063d44b7809e302460f301de", "author_url": "http://maslosoft.com/", "date": "Sep 17, 2013", "message": "I don't get that frogs metaphor. Stackoverflow helped me a lot and I could also help others, good that unlike other Q&amp;A sites, this one is free."}, {"author_name": "Abubakkar", "gravatar_hash": "c849816b7ff7e6c4bd78cbaa2828d741", "author_url": null, "date": "Sep 17, 2013", "message": "I was in a real trouble developing a simple web-based application for my team. \n\nI knew what I was doing and in fact I thought I have made it perfect to use. \n\nAnd there comes a bug which I never thought of \"The F5 key was making a nuisance of my application inserting same record every time it is pressed in the database\". So went on to Internet, tried finding many things (solution like \"use javascript to disable F5, and blah..blah..blah...\")\n\n\nFinally I came to Stack Overflow and asked this http://stackoverflow.com/questions/12724526/how-to-prevent-duplicate-entries-while-refreshing\n\nI was not getting answers for around 3 days. So I put up a bounty (oh it was such a pain giving away my 50 reputation as I didn't had much that time).\n\nAnd then I got an answer from BalusC, and it was a great solution to my problem in the simplest form. Without any hassle, I implemented it and I was so much happy.\n\nI am very thankful to Stack Overflow and the entire Stack Overflow community for making me a learn great things!!!!"}, {"author_name": "Simone", "gravatar_hash": "70034fa76ec3ada7dc95ecb8dc01f74f", "author_url": "http://simonewebdesign.it", "date": "Sep 17, 2013", "message": "The Internet is a good place. A place where people can help and share their thoughts freely. Stack Overflow is just an example of what the Internet really is.\n\nThank you guys! Looks like you have reached your goal. :)"}, {"author_name": "Stefan", "gravatar_hash": "1c24dbcf9a702cf83bd0dfdddde43829", "author_url": null, "date": "Sep 17, 2013", "message": "Every serious visit on my own problems or regarding other persons problems makes me learn. Learning makes me better which makes my code and software better which, hopefully, will make another persons life better...\n\nThis is a circle of life - even without the lion's king :-)"}, {"author_name": "Prince John Wesley", "gravatar_hash": "2f2a9ed7d2ebb95975afef8de6ce20fc", "author_url": null, "date": "Sep 17, 2013", "message": "Stackoverflow connects programmer. Great site!!!"}, {"author_name": "Mansoor Shaikh", "gravatar_hash": "10029345e7ba5f660eba47af2c44513a", "author_url": "http://www.linkedin.com/in/mansoorshaikh", "date": "Sep 17, 2013", "message": "StackOverflow is what I was looking for. A very active Q&amp;A platform for almost all technology topics. I am on java so would be found mostly on java thread. This has helped me learn a lot of stuff and also unlearn some bad programming practice."}, {"author_name": "Erel Segal-haLevi", "gravatar_hash": "ffb6ad39ce95d58890d2e7ea2cb72a04", "author_url": null, "date": "Sep 17, 2013", "message": "I use SO as a repository for my own knowledge. Whenever I run into a problem that does not have an online solution yet, and find a solution, I ask a question and post an answer to myself, so that the knowledge will be available in the future, both for me and for others."}, {"author_name": "Guru", "gravatar_hash": "ce8183801643bf2681e711f29deb29f5", "author_url": null, "date": "Sep 17, 2013", "message": "I made one whole android app with the help of stack overflow. Thank you guys, i am indebted to you. Thank you"}, {"author_name": "Inder Kumar Rathore", "gravatar_hash": "907ffad30f9e593c9e0b76b4cb700edb", "author_url": "http://inderkumarrathore.blogspot.in/", "date": "Sep 17, 2013", "message": "It's been three years since I have been taking help from stack overflow and I'm a member of this great community for 2 years. Helping other and sharing knowledge here is what I love the most. Thanks for creating such a nice and simple platform for all programmers."}, {"author_name": "Pragnesh", "gravatar_hash": "c00e6a7e7591831dbb839da55f316117", "author_url": null, "date": "Sep 17, 2013", "message": "80% my technical search end up on stackoverflow. great job for building free &amp; fast online Q&amp;A site."}, {"author_name": "Pramod", "gravatar_hash": "3564e8f7c0a654e21b82e3a04a785564", "author_url": null, "date": "Sep 17, 2013", "message": "Search ends here!"}, {"author_name": "Manish Goregaokar", "gravatar_hash": "0a3069491bfded90cdf623341cadc1d1", "author_url": "http://physics.stackexchange.com/users/7433/manishearth", "date": "Sep 17, 2013", "message": "I used to use StackOverflow purely as an observer at first. I used to dabble in coding, and it was one of the best resources that Google ever pointed me to.\n\nOne day a user on Wikipedia pointed me over to the Physics Stack Exchange. I was intrigued. I asked a question, and got a pretty nice answer (which I had to spend some time discussing to clarify).\n\nThen I got a slide-down message \"Congratulations! You've earned the privilege to upvote posts!\"\n\nI was intrigued. As a Wikipedian, the concept of gamification was alien to me. I started to participate, mainly to get imaginary internet points. It was really fun!\n\nThe novelty of the internet points wore out, gradually getting replaced by something I was slowly realizing on the way:\n\nHelping others helped *me*! Every time I wrote an answer, I would have to focus on a concept, and convert the abstract notion of that concept residing in my mind to an English explanation. Which isn't as easy as it looks, and the process leads to a lot of clarity. Not only that, the helpful comments one gets from the others let you learn.\n\nAnd this is all just from *answering* things. I've learned a lot by asking, too. \n\nIf I had to thank all the people who've helped me here, you'd have to close this comment as Not A Real Comment (Saywhat? You've got \"too broad\" now? Hmph). \n\nTo the community at large, and everyone else who makes Stack Exchange happen: Thank you."}, {"author_name": "Jenson M John", "gravatar_hash": "72d6fc90342960a23b646ab894f91621", "author_url": "http://jenson.in", "date": "Sep 17, 2013", "message": "SOF is just amazing. It helped alot means alot for finding programming solutions. Also, SOF provides a way to share our knowledge with others. I remember in the mid of 2008, I really wished for a service like stackoverflow.com when one site named ******-**change.com didn't allow me to view their community answers for free! But StackOverFlow brought the real \"experts\" to make our Life easy..:)\n\nThank You So Much Guys..Really Loved This..:)\n\nCheers to #SOF Team, Community Members..:)"}, {"author_name": "Manuel", "gravatar_hash": "3f7026f6113dba8c620fcff74c2f46d4", "author_url": null, "date": "Sep 17, 2013", "message": "Congratulations for making the most complete, smart and usable resource for software developers. Simply, the best.\n\nI owe Stack Exchange so much!"}, {"author_name": "Mansoorkhan TK", "gravatar_hash": "66b9ec2f1cc71d6ab08c1d1f43c89b3f", "author_url": "http://mansoor.in", "date": "Sep 17, 2013", "message": "Stackoverflow made me a better developer and more important, a better person. \nI've learned many things from here. Now I search here (in ask question page) before googling it.\n\nThank you so much..."}, {"author_name": "Philo", "gravatar_hash": "4ace28d492e89b0d5399c2575345a0c0", "author_url": "http://artificial-intelligence-projects.com", "date": "Sep 17, 2013", "message": "This community has saved me more time on research than I can imagine. A true triumph of what the internet can be. Thanks to all involved."}, {"author_name": "Himanshu", "gravatar_hash": "52ebcd7114fb2dc1b51d1ccfcfd30ebe", "author_url": null, "date": "Sep 17, 2013", "message": "Thank you for shiny unicorns.\n\nI heartily thank you for improving self confidence and knowledge. Learning new things everyday since I joined the network.\n\nThank you once again for introducing Meta."}, {"author_name": "Siraj", "gravatar_hash": "7cd1e6d945d8a7b56d77b07ac5d766f7", "author_url": null, "date": "Sep 17, 2013", "message": "Stack Overflow has certainly made me a better developer.\nExposed me to the knowledge of the best in the industry.\nAnd showed me that its never about your environment."}, {"author_name": "Max Power", "gravatar_hash": "6962a5c9d34a3ae91059b5e0402b6cb3", "author_url": null, "date": "Sep 17, 2013", "message": "Thank you, StackOverflow! Here I can found many needed solutions. Congratulations!"}, {"author_name": "mark", "gravatar_hash": "0f57068a7471dab194ea6678b4a93b3d", "author_url": null, "date": "Sep 17, 2013", "message": "hooray for stack overflow! hooray!"}, {"author_name": "Chris", "gravatar_hash": "c652d7823a884c826c76bc5b20d80bfa", "author_url": null, "date": "Sep 17, 2013", "message": "Whenever I've ever needed anything. Whether its dev-, cooking-, gaming, or ux-related. I've always found it on a SE site. \nThanks so much for making the internet a better place."}, {"author_name": "Maxr", "gravatar_hash": "f49dea1c1b703615aee5812a124c23c2", "author_url": null, "date": "Sep 17, 2013", "message": "Thanks a lot to Stack Overflow team and your ideas.\n\nNowadays we have good social sites like Facebook, twitter to share our social feelings. The Stack Overflow makes us social at professional level by sharing knowledge with each others. I would say it is a big step and should be continue freely in future with better improvements and great ideas.  \n\nI have a request if some question is pending for more than one week, then the Stack Overflow should take help of experts in the field related to that question. I feel it is hard to implement as the users of Stack Overflow are participating voluntarily.  It seems hard but might be possible if the question is not very hard. The requested feature may be useful if someone ask a question from a standard textbook and he or she is learning that subject by himself or herself. \n\nFinally, all the best to Stack Overflow!\nHope we will see better and better Stack Overflow in future."}, {"author_name": "NoMi", "gravatar_hash": "797e6d7d6af70c3e552a5828b5b2389f", "author_url": null, "date": "Sep 17, 2013", "message": "Stack Overflow is ideal website for clients, programmers.\n\nHow clients: client want the speed, performance and user rights, no bug or error, even i didn't see any yet. \n\nthis is my ideal website, i am a PHP programmer and i can ask or answer any question, thanks Community Member."}, {"author_name": "Jakub Zalas", "gravatar_hash": "1a4e1f98f3aeef310273366c8c785207", "author_url": "http://www.zalas.eu", "date": "Sep 17, 2013", "message": "The best way to learn is to teach. By answering stackoverflow questions I actually improve my knowledge. \n\n... and it's nice to see those points grow ;)"}, {"author_name": "Naveen", "gravatar_hash": "d6bb98021eb7d1a28a7b89471f7b5ab8", "author_url": "http://stackoverflow.com/users/1047998/naveen", "date": "Sep 17, 2013", "message": "I have been a member of StackOverflow for little under 2 years now and I have come to love it. The site is pretty useful and has saved me quite a few times.\n\nOne thing that bothers me here is that there are times when people come here with an attitude that some one will write code for them and some one actually does (for reputation of course). I may have been equally guilty here but this is something I would love to get rid off from StackOverflow.\n\nBut all in all, StackOverflow has made the world a better place :)"}, {"author_name": "Konrad Dzwinel", "gravatar_hash": "1e25f97760a73a8df851990cd6b71bc7", "author_url": null, "date": "Sep 17, 2013", "message": "I'm mostly answering questions, but StackOverflow pushes me to create broad, understandable answers and in the process I learn a lot. Only after explaining something to someone you can be sure that you really understand it.\n\nIn addition, a lot of people that I respect and look up to visit SO. Possibility of interacting with them is simply awesome.\n\nThank you guys for creating this incredible platform!"}, {"author_name": "Sumit D", "gravatar_hash": "17cf28cf960f18bd189dadda878c9d55", "author_url": null, "date": "Sep 17, 2013", "message": "When I google any problem it redirects me to SE. Really you guys helped me lot."}, {"author_name": "awe", "gravatar_hash": "bb430dc40c4648586562d2ef22c8557b", "author_url": null, "date": "Sep 17, 2013", "message": "I generally want to say that if I search for a programming related issue on Google, my experience is that the hits on non-SO sites are generally bad forums with no good answers or vague answers or if you are lucky, a decent answer if you dig down the forum thread to find it between all the \"mee too\", \"anyone has answer?\", \"hey you have a typo\" etc... If I see a hit on a SO question, my hopes rise to expect to find a good answer right on top. So that has lead me to just ignore non-SO hits in Google the first page shows any hit on SO. I go directly to the SO hit."}, {"author_name": "Chao Guo", "gravatar_hash": "1185b1ba5b1bbae59ac2a85839c8a949", "author_url": null, "date": "Sep 17, 2013", "message": "I got great answer here about my question during learning a progrmamming language like hammer on a nail. So clearcut, I really appreciate it."}, {"author_name": "myles canady", "gravatar_hash": "51c48ea16b976e41e03de51f9fdc7fd4", "author_url": "http://www.none.com", "date": "Sep 17, 2013", "message": "StackExchange is my GOOGLE for programming. Thank you all for you contribution. Way to go stackexchange. It a community not forum seriously."}, {"author_name": "awe", "gravatar_hash": "bb430dc40c4648586562d2ef22c8557b", "author_url": null, "date": "Sep 17, 2013", "message": "With StackOverflow, you don't search - you find!"}, {"author_name": "Anukool", "gravatar_hash": "b7dfc9a688755062d3d41e203e20473b", "author_url": null, "date": "Sep 17, 2013", "message": "I love this community. The kind of answers here are really helpful for all the developers.\nI am really thankful to SO for helping me whenever i was stuck somewhere .\nKeep it up !!!\nWay to Go!!!"}, {"author_name": "dnagirl", "gravatar_hash": "1d706fdef6b76678f0b1240b13da4734", "author_url": null, "date": "Sep 17, 2013", "message": "My job requires a jill-of-all-trades. Some days I'm spending more time with manuals than actually programming. The constant learning makes it exciting and interesting, but also challenging.  I think I can say without exaggeration that SO has made it possible to do my job successfully. Thanks for keeping me employed!"}, {"author_name": "Clement", "gravatar_hash": "1d2f0a8bebb4bf51ea2d69bab39ba1d5", "author_url": "http://www.clementlevallois.net", "date": "Sep 17, 2013", "message": "I started learning Java in summer 2011, and Stack Overflow was instrumental for that. 90+ questions asked! I am always humbled by the time and care that seasoned professionals take to respond to my very naive, simple questions. I could not continue progressing without SA - thanks for existing!"}, {"author_name": "Kai", "gravatar_hash": "e097557f37bc881ed149e5b5c51a7dc2", "author_url": "https://twitter.com/kaimys", "date": "Sep 17, 2013", "message": "Programming without stackoverflow is like translating a foreign language without dictionary. I'm just missing a magic stackoverflow IDE plugin which always displays the right solution for the problem I'm currently working on."}, {"author_name": "Guilherme Oderdenge", "gravatar_hash": "fb71d8e056eadfdc96077ff2b0ca2387", "author_url": "http://www.vincae.com", "date": "Sep 17, 2013", "message": "I'm a brazilian programmer who ♥s the Stack Exchange's sites. I want to say more than a simple congratulations, I want to say thanks!\n\nStack Overflow engaged my programming knowledge in all possible aspects. Actually, the Stack Overflow improved my english skills (in 80% at least) and my programming skills at all.\n\nThe Stack Exchange's sites made me a better person. Someone with a wiser understanding of what is the shared knowledge.\n\nAs I said before: thanks &amp; congratulations to everyone that make our network amazing as the way it is."}, {"author_name": "Kirill", "gravatar_hash": "257fda861688107ecd672a043ff3dafd", "author_url": null, "date": "Sep 17, 2013", "message": "Now Google is just a frontend for StackOwerflow for me :)"}, {"author_name": "Semih Akalin", "gravatar_hash": "6fe2b9a82248b2523b69a86c035ccaa4", "author_url": "http://www.spiegel-deutschland.de", "date": "Sep 17, 2013", "message": "Completely agree with all the \"feels like it's been around forever\" sentiment. I was surprised to read this post and be reminded that it's only been five years!"}, {"author_name": "Muhammad Albedewy", "gravatar_hash": "8f27db5aa04742f449725d810c3a2fec", "author_url": null, "date": "Sep 17, 2013", "message": "One of my friends share before a pic of StackOverFlow is down it was a big joke for all my friends how StackOverFlow is down it was very weird,\nThat tells us that StackOverFlow is very important for every developer.\nThank you guys"}, {"author_name": "Shashi Kanth", "gravatar_hash": "8cd1e52da37df9b8cf5242f6cdd9ff71", "author_url": "http://www.mywebschools.com", "date": "Sep 17, 2013", "message": "Few years ago, when i am still a learner in php, i found several useful stuff already existing on stackoverflow, that is shown at the top of all my google searches. I saved many hours of my work (and got some time to have coffee) with the help of stackoverflow.\n\nI asked more questions than i could answer here. I am very much impressed with the way how the experts answer all my typical questions in a matter of minutes. Though i cannot compete with them here, i would at least like to contribute some useful questions that help other developers in the future. Some of the experts i would like to mention are: Pekka, Gordon and ircmaxell.\n\nStackoverflow is the site which i want to visit and login every day (even if i have nothing to browse). That's the kind of respect i developed towards it."}, {"author_name": "Ketan Italiya", "gravatar_hash": "107ee02059d5cd808967475deca4a5ca", "author_url": "http://www.italiyainternational.blogpost.in", "date": "Sep 17, 2013", "message": "stack overflow is the best site i found ever. actually i am new in it. but when i have any query i visit it. thanks a lot for that.it help me to make out a perfect developer. i am very happy with  great journey of stack exchange..\n\nThanks,again"}, {"author_name": "Ganesh", "gravatar_hash": "fc39c94cf8d7b84a40d6fcf3c20d6b9c", "author_url": null, "date": "Sep 17, 2013", "message": "It is not wrong to call Stackoverflow is developer's facebook!!!"}, {"author_name": "Luke", "gravatar_hash": "6a8b8b5fef7e64c7a0830e9b39ff0794", "author_url": "http://genealogy.stackexchange.com/users/56/american-luke", "date": "Sep 17, 2013", "message": "Wait, these reputation points are fake?!!"}, {"author_name": "Michal", "gravatar_hash": "b64b3fd43d05802068ac057e5c7fe1df", "author_url": null, "date": "Sep 17, 2013", "message": "It seems that the term \"google it\" has sneaked naturally to our common language (even though some language purists don't like it).\nI have an impression that such phrases like \"let see what Stack Overflow says about it\" and similar are even more precise \"googling\" for IT guys.\nI'm very gratefull that such site has been created with such good user experience implemented.\n\nThanks for all of you guys!"}, {"author_name": "JP", "gravatar_hash": "c1311daeeb4b5924d817fc3f132a0188", "author_url": null, "date": "Sep 17, 2013", "message": "Stackoverflow is amazing.  I applaud the team, the idea and the inception.  It has made every developers life a little more sane!"}, {"author_name": "John", "gravatar_hash": "869795690cc5758736b606186bc46a32", "author_url": null, "date": "Sep 17, 2013", "message": "Such an incredibly useful, and yet elegant application, I wish I'd been involved in its development."}, {"author_name": "Ryan", "gravatar_hash": "6abf742f0518def88fd652de0573600f", "author_url": "http://r-gar.com", "date": "Sep 17, 2013", "message": "I have learned so many valuable things on Stack.. I cannot image how I would have ever resolved some of the coding issues I've had at times without it.\n\nAt first, I simply was on here to find answers.. Eventually I wrote my own question... as I gained more knowledge, I also eventually began answering questions.\n\nNow, I regularly find myself browsing the new questions to see if I can help anyone. Aside from the 'thrill' of getting rep, its always nice when you know you really helped someone when they accept your answer. \n\nThere have been many times when I sat on here frantically trying to find a solution to a problem only to find exactly what I was looking for. Thanks Stack."}, {"author_name": "Chandana", "gravatar_hash": "a0cc88f48b3ac392f043999f26260aa3", "author_url": null, "date": "Sep 17, 2013", "message": "My sincere thanks! Good people like you make the world go around."}, {"author_name": "Pinky", "gravatar_hash": "a9f145ea2dcf3decef7ec5ab67f04cf2", "author_url": null, "date": "Sep 17, 2013", "message": "Congratulation to StackoverFlow for completing 5 years. Your site helped me lot. Thanks a lot."}, {"author_name": "Harpreet", "gravatar_hash": "b8cd6f895368619257d6f1db8c2a377c", "author_url": null, "date": "Sep 17, 2013", "message": "Well! As I entered in the world of IT, on the day one or two. I hit most of my query over internet as most of the newbie's do. So, here Google showed all the links of StackOverflow (often known as SO). So, I figured it out that this is the place over internet for a developer. As the part of the SO, now I have a lot of buddy developers all over the world you are always there for my every query and need &amp; same is me for others. Love this Product. :)\nLoads of thanks to Jeff Atwood."}, {"author_name": "Maxr", "gravatar_hash": "f49dea1c1b703615aee5812a124c23c2", "author_url": "http://physics.stackexchange.com/users/27223/maxr", "date": "Sep 17, 2013", "message": "Need to make rich Stack Overflow on other subjects (Physics, Mathematics, Chemistry, etc) just like programming."}, {"author_name": "Aaron", "gravatar_hash": "fca70cf7209caaa1388b239cd3be4d2a", "author_url": null, "date": "Sep 17, 2013", "message": "Thank you so much for making such a wonderful resource! I started programming post-Stack Overflow and can hardly imagine what it would be like without. That's how you know you hit it out of the park, when people can't imagine a world without you. I have learned many things and every time I come to the site, I leave with more knowledge than I had before."}, {"author_name": "S.", "gravatar_hash": "c2bfa6fc7ca41f62fec3f7fc879e7aa6", "author_url": null, "date": "Sep 17, 2013", "message": "I've done a two-week community college course for learning Java in 2011, and am now in my third year of earning money as a software developer! My secret? An account on stackoverflow.com, and sadly, that really IS about it. Oh, and reading a book or two. And incredibly great luck. But mostly stackoverflow.com. THANK YOU!\n\nAnd yea, giving back to the community does feel good."}, {"author_name": "Altaf Hussain", "gravatar_hash": "fd00601707e1be2938c044998428277e", "author_url": "http://altafphp.blogspot.in/", "date": "Sep 17, 2013", "message": "As long as stackoverflow remains. Everyone can solve complex problems. A great resource for developers"}, {"author_name": "Pinch", "gravatar_hash": "dfbc700ffcc15c25fc01f2212dcc760f", "author_url": "http://pinchcode.com", "date": "Sep 17, 2013", "message": "Thanks Stack you put the wink in my semicolon ;"}, {"author_name": "Maroun", "gravatar_hash": "a29147752792d81b50882c816af9807f", "author_url": null, "date": "Sep 17, 2013", "message": "This is the best website I've ever seen on the web."}, {"author_name": "Tukna", "gravatar_hash": "300a88bffff9dacbb6a3dbb616d4cd7d", "author_url": "http://www.tikkl.com", "date": "Sep 17, 2013", "message": "It's best productive site I've come  so far.  Each day it enhances my knowledge base. So many good people... A big thanks to all contributors."}, {"author_name": "Arpit", "gravatar_hash": "e0e5a5e73af68335731b3d9bb41677c5", "author_url": null, "date": "Sep 17, 2013", "message": "15 Sep 2008, it's the day when i joined in engineering college. And getting into this programming world. And Stackoverflow again a great website for each &amp; every developer to grow &amp; learn.\n\nThanks a lot !"}, {"author_name": "suhail", "gravatar_hash": "ce4921557a93a032becc182a36eb6a13", "author_url": null, "date": "Sep 17, 2013", "message": "i learned a lot by answering. and if i got stuck in a problem i probably can found it in stackoverflow. it is easy to get good answer as it is voted up ::-))))"}, {"author_name": "Jayesh Italiya", "gravatar_hash": "582e0a086d4961ba7ed611c24f9d262e", "author_url": null, "date": "Sep 17, 2013", "message": "StackOverFlow has given an amazing opportunity for Fresher Learner and also experienced developer I am getting all the  solutions of mine development from stackoverflow great great amazing job :)"}, {"author_name": "Ferruccio Barletta", "gravatar_hash": "e4a1b4bf6865eddd0edfe8cb90361c84", "author_url": null, "date": "Sep 17, 2013", "message": "I have gotten so much more out of Stack Overflow than I've put into it.\nIt has become a completely indispensable tool for developers.\n\nThank You."}, {"author_name": "Amal Chandran", "gravatar_hash": "d82d72975fad73581f057b11e52872d3", "author_url": null, "date": "Sep 17, 2013", "message": "I started coding just few months back, and I really am not able to imagine how it would have been without \"SO\"... so miserable... I feel sorry for the developers in pre-\"SO\" era!!!\n\nThanks a lot....."}, {"author_name": "Periback", "gravatar_hash": "99a88515bddb0de9493d032ad6b9b79f", "author_url": "http://wikicomputacao.blogspot.com", "date": "Sep 17, 2013", "message": "I was encouraged to use stackoverflow during an international internship I did in France. I was developing new features all alone and SO was like my team, since I was aways using it to help me dealing with new situations and discussing ideas...\nit's simply the best place for developers help each other."}, {"author_name": "Zsolt Kovacs", "gravatar_hash": "a0596493820a75a55f16762b683b8f77", "author_url": null, "date": "Sep 17, 2013", "message": "I would like to congratulate every person who did anything to help someone else.\n\nI would also like to thank Stack Overflow for helping me get a job as a programmer, as something I wanted to work as from the age of 6."}, {"author_name": "sepehr", "gravatar_hash": "403f3b03cbe550a561213962d45eb0ae", "author_url": null, "date": "Sep 17, 2013", "message": "stackoverflow.com is the \"Facebook\" of me ! and i think facebook of all those who are into computer.\nNo ! it's greater , that`s my school..."}, {"author_name": "dave", "gravatar_hash": "a18abeb32dbd4438b532595843c7f767", "author_url": "http://lida.com.au", "date": "Sep 17, 2013", "message": "I love you guys because I'm good, but I'm not great. But I believe in trying to be better. \n\nAnd knowledge sharing is Socialism without all the evil pointing guns at people and making them line up for bread.\n\nI can't believe it's only 5 years though. Weir.d"}, {"author_name": "suresh atta", "gravatar_hash": "d6d001a5e9672db92d059b85066ae5af", "author_url": null, "date": "Sep 17, 2013", "message": "Every developer's daily routing.\n\nEating ,Sleeping,Stack overflowing."}, {"author_name": "maurizio codogno (mau)", "gravatar_hash": "b3be0572bdff829a7e44ab5da9722069", "author_url": null, "date": "Sep 17, 2013", "message": "I did not use a lot SO, but I joined Math Stack Exchange in its very early phases. I think the whole idea of a Q&amp;A community made in this way is awesome. There are many sites and fora where people may ask questions, but this network is the most reliable I know. \nMy only complaint is that I cannot usually add an answer because somebody precedes me :-)"}, {"author_name": "Elio", "gravatar_hash": "aacf4695142a84a3efeeb419db957c01", "author_url": null, "date": "Sep 17, 2013", "message": "Five years ago, as a SW Eng. student I found myself posting or searching questions. It is because of Stack Overflow I was able to overcome some of the roadblocks I found in my way.\n\nNow, as a professional, it is only fair I give back to the community.  I'm still learning, but at least I can share knowledge gained throughout my short career.\n\nThanks!"}, {"author_name": "Arjan", "gravatar_hash": "c19f722d6159fc0a06b6aefe06a06cf7", "author_url": null, "date": "Sep 17, 2013", "message": "Without Stackoverflow, young programmers without the proper education can learn from others because even the most simple (but very challenging for beginners) questions have been asked &amp; answered, and that's awesome. Keep it up!"}, {"author_name": "Arjan", "gravatar_hash": "c19f722d6159fc0a06b6aefe06a06cf7", "author_url": null, "date": "Sep 17, 2013", "message": "*without = with"}, {"author_name": "Mike", "gravatar_hash": "2e0979f51df8cb53377698bdb88439e4", "author_url": null, "date": "Sep 17, 2013", "message": "I have been visiting SO since it was still an adolescent, but only recently created an account. I never needed to have one till I got past the basics, the answers were already there or were a great jumping off point, from which I could further my knowledge myself. Now that I have an account I have asked questions on a few SE sites and every single time I have found an answer or a pleasant  \"You're doing it wrong, this is a better way...\".  I come not for the points but for the ability to ask questions with out fear of ridicule for my lack of knowledge. I try to give as much info with my questions as possible to define the problems and I make sure to fill the requests of the people helping me with my question, It's a \"HELP YOU, HELP ME!\" situation. \n\nWhile SO/SE family has come so far the sky is the limit! I have faith in you, to continue to produce greatness.\n \n I &lt;3 SO."}, {"author_name": "MIke", "gravatar_hash": "4e0b5b9443d08bdacd6087648dab3e0c", "author_url": null, "date": "Sep 17, 2013", "message": "Its simple really, genius  idea + perfect execution = stackoverflow.  It never ceases to amaze me the depth  of knowledge and expertise that is  on stackoverflow and the willingness of those people to share it .  It absolutely has helped me  to become a better software engineer.  I use it extensively as my Android \"go to resource\" and I'm sure it has been pivotal in launching many other apps as well."}, {"author_name": "Rajesh Sharma", "gravatar_hash": "a7d2eb56fe7d431c9def61af0a72bd80", "author_url": "http://rajesharma.com", "date": "Sep 17, 2013", "message": "Stackoverflow is the first place I look when I am facing problems, and I am always sure I will find a solution there.. Nice thing you started.. Really helpful.. Thumbs up.."}, {"author_name": "Jeff Parrish", "gravatar_hash": "91b60b3836ca4a390565c001c21d0917", "author_url": "http://wiggleware.com", "date": "Sep 17, 2013", "message": "I can confidently say that Stack Overflow and Google have been the most important educational resources for my career in software development."}, {"author_name": "Ben Flynn", "gravatar_hash": "310551e6a38102a7bcafba0beb163be1", "author_url": "http://www.bflysoftware.com", "date": "Sep 17, 2013", "message": "Stack Overflow lets me be so much more productive than I could ever otherwise be. More help, less snark -- thanks so much for putting this thing together."}, {"author_name": "a1101269@drdrb.com", "gravatar_hash": "7e46443ceb50b5059a9cc4f8ebf67d49", "author_url": null, "date": "Sep 17, 2013", "message": "StackOverflow is a great place if you have a very clear cut question. Basically, you have to know exactly what your problem is before going there. If you try to post a question that's even the SLIGHTEST bit ambiguous, the StackOverflow Nazis come around and vote for it to be closed. I've pretty much given up on StackOverflow as a real source of help, because I can never get any reasonably difficult question answered. Either it gets closed because it's too ambiguous, or it never gets answered because it's not worth the time for people looking for rep points.\n\nBottom line: if you have a jQuery question, SO is great. If you've already read the manual and have a real world question, forget about it."}, {"author_name": "Mike", "gravatar_hash": "4d19e9246a5a348a5d56564f53c6a2ad", "author_url": null, "date": "Sep 17, 2013", "message": "I think that StackOverflow deserves about 70% of my salary, since it solves so many of my programming problems for me. Don't tell my boss!"}, {"author_name": "Nazer", "gravatar_hash": "36818e458a23d5acf8484c6041826a99", "author_url": null, "date": "Sep 17, 2013", "message": "There is no way I could complete grad school without SO. A couple years ago I had no idea what programming even was, had never heard of \"code\". A year ago I dropped Excel and started doing all of my work in R for learning purposes. It was hard times because I don't even have anyone to talk to about R. Now I breeze through giant data sets like they're nothing and it is all thanks to the people on SO being patient with me, helping me become a better question asker, giving me a good understanding of what I'm doing, and promptly answering questions. I know I've got a long way to go with R, but as long as SO is here, I'm not even scared."}, {"author_name": "Daniel Pendergast", "gravatar_hash": "bb0038fe31312186b0b3ac92f482c271", "author_url": null, "date": "Sep 17, 2013", "message": "Discovering Stack Exchange made programming, game dev, and other things so much easier for me. All I can say is, Thank you."}, {"author_name": "Ashwin", "gravatar_hash": "94990eefc6594b6147042b9e40e7247a", "author_url": "http://redcurrantscloud@blogspot.com", "date": "Sep 17, 2013", "message": "Thanks Stackexchange ! You made me a better developer. My writing skills has been improved to a larger level. A superb experience as questioner and as an answerer, as a questioner I built my first iOS application with the help of stackoverflow. Now as a professional I have some good experience and has become technically sound in various technology, So I share my knowledge with community and always try to make it better. \n\nStackoverflow re-defined my skills by questions which user asks here, they look simple in first impression but has a trick behind it. If you don't understand the trick... -1 will help you to find that :) and +1 will prove that you found it.\n\nI learned \"code on the spot\" only because of stackexchange. \n\nThanks again.\n\nMessage to all: Someone want to test his/her skills... sign up in stackoverflow ;)"}, {"author_name": "Robert Huttinger", "gravatar_hash": "a98e60def5ac720990c2c79c6d1fa042", "author_url": null, "date": "Sep 17, 2013", "message": "Saved me so much time, taught me so much. There is a  lot of wisdom to be gleaned here whether it is process, logic, or just plain ol' helping others. Greta resource and place to help others!"}, {"author_name": "lucas", "gravatar_hash": "7d6ab282108ec8402127fed2498b29a3", "author_url": "http://cloud101.e", "date": "Sep 17, 2013", "message": "I started out on severfault as a nubby student. Then one day I joined the commsroom and learned as much from those guys as my brain could absorb. I always could count on those guys for getting some good advice,  for serious and less serious business ;)"}, {"author_name": "Evan Carroll", "gravatar_hash": "605442f85418d858e2ce1e1aea2092bb", "author_url": "http://www.evancarroll.com", "date": "Sep 17, 2013", "message": "I joined Meta.StackOverflow over four years ago after three months of involvement with StackOverflow. I'll never forget the day, I was so excited to be a member of the community that was to guide StackOverflow to being a democratic success, a democratic success that it never was.\n\nIn an attempt to reform the system I quickly discovered what a refuge for tyranny StackExchange was. At every turn I was greeted by an assembly of downvote-bots and an entrenched cabal of moderators -- many of whom were employed by the Stack Overflow dictator Jeff Atwood. Eventually, a specially crafted algorithm was put in place to ban me: it's now referred to as a \"question ban.\" This tactic  clearly demonstrated that the community was not self-managed, but it was Jeff-managed. I learned  right then that there was no hope for this Capitalist profit-seeking self-serving catastrophe that Jeff created. I learned that Stack Exchange was doomed.\n\nSo what did I do? I went on to quit my job and start a worker's coop. A worker's coop that I may not have ever have started if Jeff didn't ruin my hope that next-generation startups would embrace more of an ethical dimension than the established software companies that produced him."}, {"author_name": "lucas", "gravatar_hash": "7d6ab282108ec8402127fed2498b29a3", "author_url": "http://cloud101.e", "date": "Sep 17, 2013", "message": "Later on I joined Security.se, meeting new awesome bears including: bears, tigers, monkeys and masked men. I spent a lot of time on the site and when it came to choosen my profession, I decided that security would be what I would like to start in. I continue expanding my knowledge every day and I'm grateful to all collaborators present on the SE to give me such opportunity.\n\nGod bless the Crypto Bear."}, {"author_name": "Rafael Barros", "gravatar_hash": "d45fbc52cc36b80c48b916379cd8aacb", "author_url": "http://mitidev.net", "date": "Sep 17, 2013", "message": "For about ten days ago i really knew what is the point of StackExchange, and after that, i don't searched for answers in another place, and beyond that, i, for the first time, started asking questions.\n\nLearned many things, but, mostly important, after some years, changed to OOP paradigm.\n\nIt's incredible how fast experts answer questions here. Congrats!"}, {"author_name": "Tohid", "gravatar_hash": "6a57bf8078356b9172a9a52209aacef2", "author_url": null, "date": "Sep 17, 2013", "message": "Just wanted to say that SO encourages me to persist on solving my programming errors ,since it provides me with bunch of optimized solutions to each and detailed portion of the code"}, {"author_name": "Rahul Anjur", "gravatar_hash": "b3110b617a1fe67815cc6bff39a30d0c", "author_url": null, "date": "Sep 17, 2013", "message": "You guys have improved a life , mine . I would like to thank all the great people who helped me from the bottom of my heart."}, {"author_name": "G-Coder", "gravatar_hash": "10912659a55697750660ded614c5f24e", "author_url": null, "date": "Sep 17, 2013", "message": "YES!  SO has become part of my daily toolset.  When I google for solutions, I'm first looking out for SO results before any other blog entries or other forums/documentations.  SO has truly revolutionized the Q/A experience, from the traditional forums filled with advertisements, and tons of pages and posts."}, {"author_name": "Chase", "gravatar_hash": "29abae483578a869d52119c66622fd41", "author_url": "http://csdgn.org", "date": "Sep 17, 2013", "message": "Now just charge 19.99 a month for it, like every other site that starts doing well. It will die and something great on the internet will once again be killed by greed."}, {"author_name": "amo", "gravatar_hash": "b4f68e8f656054fbea0155b821b17f77", "author_url": null, "date": "Sep 17, 2013", "message": "I have gotten to the point where when I Google a problem and there *isn't* a Stack Exchange site with the answer, I get really frustrated. Stack Exchange has made my life as a programmer and computer owner so much better that I literally can no longer stand the thought of trying to find an answer in other Internet forum postings."}, {"author_name": "Andrew", "gravatar_hash": "6648923c5a42785eaa43068ac252c959", "author_url": null, "date": "Sep 17, 2013", "message": "SO taught me how to program, and after a few years as a hobby led to me finding a new career in software development. Totally transformed my life. Thanks SO!"}, {"author_name": "Martín", "gravatar_hash": "16121b31590e34cfbd754a162bb88120", "author_url": null, "date": "Sep 17, 2013", "message": "I asked my first question on June, 2010... At that point, I was learning Java and MySQL. Since then, I've developed quite some apps and participated in a bunch of database projects, and I've written 200+ answers, and I've found countless answers to equal number of situations. \n\nI'm not a professional programmer, I'm an amateur and a geek-user. But SO has given me knowledge, has helped me as a programmer and as a \"question answerer\". It's great to be a part of a community of people who are willing to share knowledge, to give freely what almost certainly was acquired with effort, sweat and tears. Happy 5 years, StackOverflow! Many more to come!"}, {"author_name": "Ahmad", "gravatar_hash": "19f0a11bdd9323f99d723bf9f718be3d", "author_url": null, "date": "Sep 17, 2013", "message": "I love you guys :)"}, {"author_name": "Drew Steen", "gravatar_hash": "b1db849a69e44bbcf0d44bc3fb7385ca", "author_url": "http://web.utk.edu/~asteen1", "date": "Sep 17, 2013", "message": "I'm an academic scientist. I was in a less-than-optimal professional situation, and I decided that I would make my time more productive by learning data analysis in R. I had no idea what I was doing, so I started asking very basic questions on SO. As time went on, I started asking more advanced questions. One wonderful day I saw a question I actually knew how to answer!\n\nTwo years later, I am a reasonably-proficient R programmer. I just submitted a meta-analysis paper for which I wrote a couple of thousand of lines of R code, and which I think could be a very important contribution to my field. I couldn't have done it without R, and I never would have learned R without SO."}, {"author_name": "chx", "gravatar_hash": "00d1c2c85d66f9a50744e7e7c8c35ce2", "author_url": null, "date": "Sep 17, 2013", "message": "I am a fairly experienced developer. I am on SO for 3.5 years and only asked 33 questions... and the answers to some of are \"meh\" but some of them are just shocking for who answers: a question about HTTP PUT answered by Julian Reschke who writes the next HTTP standard. A MySQL question is answered by a mere yearling with 50k points (dude, how did you get 50k points in a year??) who has been in the computer industry since 1979. I was 4 then. OMG, one of the Old Wizards just answered my question :)"}, {"author_name": "Maher Manoubi", "gravatar_hash": "5150f3b1e2d171bec90714b1e01e5ff3", "author_url": "http://mahermanoubi.com", "date": "Sep 17, 2013", "message": "Thank you so much! I think the help that I got from here has exceeded by far the total number of help I got in anything else in my entire life! Thank you."}, {"author_name": "Dozer789", "gravatar_hash": "49662e70ac6c54dab46d4f83b9072b43", "author_url": null, "date": "Sep 17, 2013", "message": "StackOverFlow has helped me a lot! If it wasn't for them, I don't think I would be the programmer I am today!\n\nThank You StackOverFlow!!"}, {"author_name": "Robbye Rob", "gravatar_hash": "c6cbdcc6ed17b45afbb8fe2a7df83fdf", "author_url": "http://clearingthefog.net", "date": "Sep 17, 2013", "message": "I have always relied on the internet and books for information about coding.  It has been more than 20 years since my first coding job and I have been able to utilize the internet for problems that seem so obscure that I could only hope for a suggestion to start from.  Stack Overflow has become the norm for this.  If the link does not have a Stack Overflow for the error or problem that I am facing then I know that I am doing something wrong.  I even now ask people during interviews where they get their information.  Stack Overflow is the main answer to that question."}, {"author_name": "ankur", "gravatar_hash": "227d82d46cb87c5e8f81c4b85ac3628f", "author_url": "http://www.inindiashop.com", "date": "Sep 17, 2013", "message": "For me second google is stack overflow, thanks for helping me overcome problems and also saving lot of my time fixing issues or enhancing any feature.\n\nThanks,\nAnkur\nInindiashop.com"}, {"author_name": "Viji", "gravatar_hash": "e085ddc5023d94363642baf88a8cb9e9", "author_url": "http://techsharehub.blogspot.com/", "date": "Sep 17, 2013", "message": "Even though you work in a project that is not challenging, Being a stack Overflow member, Learning become more interesting.\n\nPoints and Badges makes it competitive.\n\nBut, its a Good Global place for the developers to sharing and improving the knowledge.\n\nThanks, So for I'm enjoying it."}, {"author_name": "Casper Færgemand", "gravatar_hash": "70adf5a8a82b5701dbc82ef520025aa3", "author_url": null, "date": "Sep 17, 2013", "message": "You make a bad API worth working with. ( 'w')(\\ &lt;3"}, {"author_name": "Stéphane Bruckert", "gravatar_hash": "aa56a00a9f9ee1f6a72376071da280f0", "author_url": "http://www.stephanebruckert.com", "date": "Sep 17, 2013", "message": "Happy birthday Stack Overflow!"}, {"author_name": "Pophils", "gravatar_hash": "3ba051254c3e7f4020d67e2f45121482", "author_url": "http://hutbay.com", "date": "Sep 17, 2013", "message": "One of the major question to ask when getting new programmers on board is their acquaintance with SO. \nLong live SO."}, {"author_name": "Charles", "gravatar_hash": "10666e415700c5e65d675e92820cf73c", "author_url": null, "date": "Sep 17, 2013", "message": "StackOverflow thought me advance SAS techniques. Thanks to all!"}, {"author_name": "Dave DeBois", "gravatar_hash": "71b567686b1827d8deb2405199f06ffb", "author_url": "http://www.thewelcomewheel.com", "date": "Sep 17, 2013", "message": "I was in Sales for 15 years and wanted to change careers.  An opportunity came up where I was able to get on staff at another company and they would give me time to learn to code (.NET).  I had no clue about ANYTHING - html, css, javascript, c#... not a clue about any of it. A good friend helped me get started and told me about Stack Overflow and a few other resources.\n\nI've now been at this job for 9 months and have personally coded over 20 online applications (both in C# and VB.Net), with a HUGE amount of help from Stack Overflow.  I am now comfortable with those two languages, as well as Javascript, jQuery, SQL, Crystal Reports and getting there with Ajax.  THANK YOU SO MUCH for your site - I seriously could not have done it without Stack Overflow."}, {"author_name": "Aparajith Sairam", "gravatar_hash": "826be99ba56f38e35ae466e521760339", "author_url": "http://aparajithsairam.wordpress.com", "date": "Sep 17, 2013", "message": "Good site, promotes developer welfare (human welfare in general)."}, {"author_name": "Augustus Yuan", "gravatar_hash": "4da1f33a15857bb4bc0fe4104ea347df", "author_url": null, "date": "Sep 17, 2013", "message": "When I first started StackOverflow, I was kind of new to programming. The reason I love SE is because it has a really strong community that is motivated in helping people through crowd-sourcing. It isn't like in the classroom where you ask the teachers, or the teaching assistants. EVERYONE has the chance to help each other.\n\nWhen I first started I only lurked and was too afraid to post anything. Soon I started finding questions I could answer myself. Eventually, I started taking up my own projects and SO has been extremely helpful with these. Not only that StackExchange in general has inspired me to explore different areas like Chinese Language, cooking, and skeptics.\n\nHappy Birthday StackExchange. You have really made a huge impact on my life :)"}, {"author_name": "IkegawaTaro", "gravatar_hash": "ab4a984d948e2877f7d8df5c6fb90ef2", "author_url": "http://www.reridebikes.com", "date": "Sep 17, 2013", "message": "Stackoverflow has been invaluable in allowing me to pursue projects and learn skills that I thought you had to get a degree in computer science to do.  I have learned A TON from the content on this site.  The users of this site all deserve a pat-on-the-back for creating a kickass community."}, {"author_name": "Bryan Saltzman", "gravatar_hash": "0c4bdbfc8d24e7417f7bc846df2325f3", "author_url": "http://Macpapa.com", "date": "Sep 17, 2013", "message": "I was on a plane to Las Vegas reading Inc Magazine and an article titled \"The Unproven Path\" by Joel Spolsky caught my eye.  http://www.inc.com/magazine/20081101/how-hard-could-it-be-the-unproven-path.html.   I learned the importance of keeping programming fun from the article, but more importantly I learned about Stack Overflow.   When I got back from my trip it instantly became the most important tool in my box."}, {"author_name": "Sithsu", "gravatar_hash": "add9594b873c87c44c0ce26ca217db06", "author_url": "http://stackoverflow.com/users/2208271/sithsu", "date": "Sep 17, 2013", "message": "Once in a while, when someone call you a \"Saint!\", it makes the effort so much more valuable and gratifying.\n\nAnd there's a whole bunch of Saints in SO.\nSome of them can be found using http://data.stackexchange.com/stackoverflow/query/137818/saint-detector."}, {"author_name": "Manuel Gutierrez", "gravatar_hash": "123e674dcf54f6faf6d94e43c42e6bc4", "author_url": "http://xr09.github.io/", "date": "Sep 17, 2013", "message": "This site is one of the main reasons I open a browser daily."}, {"author_name": "Charan Kumar S", "gravatar_hash": "27d12922a57b52dee016d6643dac0fcf", "author_url": null, "date": "Sep 17, 2013", "message": "For all java questions i have answers in stackoverflow"}, {"author_name": "Dad", "gravatar_hash": "e51b1c30950f0ced78e53852657244a0", "author_url": null, "date": "Sep 17, 2013", "message": "You want 45M comments?! :-)\n\nSeriously though:  I come to Stack Overflow 10-20% of the time to find answers and the balance of the time because figuring out the answers to people's questions in the areas I'm active (iOS/OS X) and answering them is an interesting way to learn more about aspects of my current area of focus that I don't already know or know but not in enough depth to answer well.  So it's a fun way to get little focused learning exercises.  Plus, I like helping people."}, {"author_name": "Ali", "gravatar_hash": "01490b931f2cfcefa260a5360b7103e9", "author_url": "http://www.concep.com", "date": "Sep 17, 2013", "message": "Have been a member pretty much since it started. One of the best things about our job. We all learn from each other and help each other out.\n\nDevelopment would not be the same without SO!"}, {"author_name": "tbodt", "gravatar_hash": "f5af227d9853e5b579a27d4724c75650", "author_url": null, "date": "Sep 17, 2013", "message": "I originally got onto this site because I wanted to know why my MAMP setup wasn't working. A few questions later, I got a really bad answer and tried to downvote it. A message popped up saying that I needed 125 reputation to do that. It then became a personal goal to get to 125 reputation so I could downvote that one answer. Since then, I have changed my goal every time I get a new privelege. But I still enjoy helping people. Thanks a lot, Joel, for providing another way to make programmers less productive. ;-) Now, the description of Joel Test question 8 should include a requirement to block Stack Exchange on all browsers."}, {"author_name": "Joel", "gravatar_hash": "859d3237bea715b85c7fcf7e81fed3da", "author_url": null, "date": "Sep 17, 2013", "message": "Wait....the points are fake?!?"}, {"author_name": "Hanlet Escano", "gravatar_hash": "5e4c2e460e91d6368255ccec79e1763b", "author_url": "http://hamletsoft.net", "date": "Sep 17, 2013", "message": "This is indeed a miracle of a website. I love the format of the Questions and Answers, the voting system and sometimes even the drama a wrong answer may provoke. Millions of programmers all over the world are able to keep their jobs thanks to this great site. Kudos SO!"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": null, "date": "Sep 17, 2013", "message": "THANK YOU ALL SO MUCH!!!"}, {"author_name": "Nemanja Boric", "gravatar_hash": "bf60cc38f73241e4d313ac26e85b1414", "author_url": null, "date": "Sep 17, 2013", "message": "StackOverflow is the site that replaced my daily doses of newspaper.\n\nSeriosely,\n\nat first, I was here only to read highest voted questions and to ask some of mine (oh, and, yes, it is embarrassing to read your first SO question - luckily, you have a chance for an edit). So, that took months and months. Sometimes I would forget to visit it for a month,\nsometimes I was reading questions for the entire day.\n\nAnd then, just as you say: \"people would do anything for the fake internet points\". It is quite a game, trying to answer question, before someone with 100+ rep posts a four-paragraph answer. But, as the time passed by, I started learning while trying to answer. \"Hmm... I don't know how to answer this...\", \"What is he talking about?\" Read the reference, read the whitepapers, grab a book, use a Google, read the first comment, read the second comment, read the first answer, read the comments to the answer, read the right answer... Just like if you are in some kind of virtual workshop, trying to learn new things in the old technology, or the new technologies themselves. \n\nThere's no book that could give you that much knowledge with that much interaction, and there's no classroom which could fit all the professors, all the students, the compiler designers, the language designers, all the beginners and the experts for any technology in the world. The SO provides all that, and beyond."}, {"author_name": "Chris", "gravatar_hash": "1af21790a5f66548660431218d2f66d3", "author_url": null, "date": "Sep 17, 2013", "message": "As a software engineer, I can't live without StackOverFlow. Helping others and being helped by other excellent guys becomes a huge fulfillment of mine. StackOverFlow lets me know that I'm not the only geek on Computer Science. Gradually I realizes all of them are brilliant guys and StackOverFlow is our paradise. Thanks a lot."}, {"author_name": "Dominic", "gravatar_hash": "636bec3398ab7aa3d5c6eeaee1a1350a", "author_url": "http://mygemologist.com", "date": "Sep 17, 2013", "message": "I'm not generally one to respond to these types of posts, but I wanted to take a second to say thank you to the creators and community of StackOverflow. You have saved me so much time and enabled me to accomplish so much more than I ever could have otherwise. Thank you."}, {"author_name": "Starx", "gravatar_hash": "a88d1309c2ea93cadb3f11b58890ca83", "author_url": "http://mrnepal.com", "date": "Sep 17, 2013", "message": "Knowing that the solution I gave helps some one and the thanks I get. Makes me proud!\n\nAbout the gamification! Honestly I would not have started contributing without it. I was young, I like interesting things.\n\nGetting more vote ups than high rep users really used to push me. Ha Ha\n\nBut with time this changes too."}, {"author_name": "puggsoy", "gravatar_hash": "8998278b580b3e3863141b864647e503", "author_url": null, "date": "Sep 17, 2013", "message": "Stack Overflow has been a fantastic resource for seemingly impossible programming problems. Getting a compiler warning or runtime error doesn't make you feel alone and helpless anymore. Being able to ask a question, and know that somebody will at least try and give me a solution, really is a comforting thought and makes it seem less hopeless. And of course, when you get that answer you're looking for, there's that wonderful flood of relief, not to mention a facepalm when you discover how obvious the solution is ;)\n\nAnswering questions is also a awesome. The fake points are bonus, and allow you to reflect on how helpful you've managed to be, but the true joy is when you know you've been able to help. Even if my answer isn't accepted, an upvote and a comment on how I might have helped somebody really makes it worthwhile. Even if I don't know them in the slightest, knowing that I've helped somebody with a problem just feels good and rewarding.\n\nStack Overflow, and indeed Stack Exchange as a whole, is a truly great thing. It goes to show that even if something seems daunting or ambitious, it's worth a shot, and in cases like these it can really make a huge difference to a lot of people."}, {"author_name": "Tony Hopkinson", "gravatar_hash": "0802303aaa5f03f4cec652171dffcbc7", "author_url": "http://Stackoverflow", "date": "Sep 17, 2013", "message": "3Came here one day for an answer. Found half of one. So I thought I'd be polite and fill in the missing bit and you gave me all these point things. I consider any day I don't earn something a waste, and every day I come here I learn something. Thank you."}, {"author_name": "Alvin Lin", "gravatar_hash": "5b55e7c59c71312dfaf37162915f6f4e", "author_url": null, "date": "Sep 17, 2013", "message": "I have been a Stackoverflow member since day 1 and I have seen it grown from a hang out place for readers of Joel and Jeff's blog to a common name between software engineers. As I'm typing this message, in my cubicle all my colleague has a browser tab open that is on Statckoverflow :) \n\nI can't imagine going back to the days when I search question online, the returned result is to a site where you have to pay to see answers. \n\nAnswering questions on Stackoverflow trains me to be disciplined, because I know my answer will be view by thousands of experts. Same goes for asking questions. I have learned to become a better engineer both technically and non-technically through Stackoverflow. \n\nThanks Stackoverflow! Let's celebrate another success in another 5 years."}, {"author_name": "Timothy (TRiG)", "gravatar_hash": "f44b47d4d5e48ed503d3f7f53194b1ed", "author_url": "http://timothy.green.name", "date": "Sep 17, 2013", "message": "I've never cared about rep points on SE, but I do like the fact that on most sites I frequent I have enough rep to edit. In fact, editing is all I do on SO these days.\n\nI think that says more about my job, and the fact that it's not pushing me to learn new stuff at the moment, than it does about SO, but anyway, I like editing. (I was once, on Christianity SE, called an \"exceptional editor\", which is praise that meant quite a lot to me, actually.)\n\nTRiG."}, {"author_name": "Sean Vieira", "gravatar_hash": "8931e023c82f232d4d02a115710fb8fc", "author_url": "http://dedeodesigns.com", "date": "Sep 17, 2013", "message": "I was reading Jeff Atwood's blog back in the summer of '09 and heard about this new Q&amp;A site he had founded with Joel (who I also read) to take on the evil hyphen site.  I briefly wondered what the \"evil hyphen site\" was and then went a took StackOverflow for a spin.\n\nI liked Jeff's vision for the site, and so kept coming back to help make it a reality.  As time went on, I asked a few questions, answered several more (my Q/A ration is 0.34%) and been blown away by the calibre of the people, questions, and answers on this site.\n\nFavorite moments:\n* Having my Python question answered by none other than Alex Martelli.\n* Receiving an upvote while not logged on to the site.\n* Crossing 10K\n* Realizing that I have actually become a better writer and developer because I have been hanging out with writers and developers who are better than I am.\n\nThanks for five great years SO - may they be the worst five years of your very long reign!"}, {"author_name": "George Profenza", "gravatar_hash": "0c4bcb3f24ad14960786e462db08d98f", "author_url": "http://lifesine.eu", "date": "Sep 17, 2013", "message": "I've been a member of SO for about 4 1/2 years and contributed to around 900 answers so far and had my questions as well. Although a lot of people will look down on this fact: I started teaching myself programming with actionscript (hence the many as3 answers), but I've gradually picked up a few other languages(like java, python, a bit of c++) and SO was extremely helpful. \n\nThe fake points got me hooked to be honest. I always knew technically they didn't mean much, but I always saw it as a measure of my contribution: it got better with time :)\n\nI find SO a great resource for learning and sharing knowledge that is also fast and reliable."}, {"author_name": "Martin Brennan", "gravatar_hash": "e61d50823d8a61ae2e50aa1b62c29ab5", "author_url": "http://www.martin-brennan.com", "date": "Sep 17, 2013", "message": "You rid us of the plague of expertsexchange and have provided an invaluable resource for people from so many professions, not just developers. SO is an incredible resource and one I use daily, I don't know how I ever found answers without it!"}, {"author_name": "Daren", "gravatar_hash": "4e50b95b94afb0de764cb133e19366fe", "author_url": null, "date": "Sep 17, 2013", "message": "Member for three years and I just have to say Thank You.  I may not have posted many questions, but that's because I found the answer first with a little bit of searching."}, {"author_name": "Deborah", "gravatar_hash": "88780c09ae659cacf1ca41141eaeb648", "author_url": null, "date": "Sep 17, 2013", "message": "StackOverflow is the BEST - love you guys !!  Now I wish there were an upvote button, because I definitely want to upvote all the positive comments here..."}, {"author_name": "Nuwan", "gravatar_hash": "4e847ea944d57374115a39dd04679c4a", "author_url": null, "date": "Sep 17, 2013", "message": "Stackoverflow is the best when you want to get an answer to any question quickly. I thank all  creators and contributors for the wonderful job they have done any doing.\n\nThank you again and again."}, {"author_name": "Smogha", "gravatar_hash": "f549a2c780a18e5fb33c464d7fc68624", "author_url": "http://make-online-business.com", "date": "Sep 17, 2013", "message": "It's a wonderful website. I always search my queries related to my programming in a particular format-\nmy query + stackoverflow\n\nI just like only stackoverflow solutions. This is my best resource till today."}, {"author_name": "Saurabh Hooda", "gravatar_hash": "e3438fb1f99811e8305eb6ed3f282f7e", "author_url": "http://hoodasaurabh.blogspot.com", "date": "Sep 17, 2013", "message": "I was a tester before getting into development. I was not sure who will rescue me if I get stuck at some problem. Anyway I took a leap of faith and started programming. And then i realized that there are millions of people at StackOverflow who will help me out on that way. I sincerely want to thank all the people who take out their precious time to answer queries of other folks, like me. Thanks a lot. Without you I wouldn't be able to complete my first iPhone app Sherlomes (www.prosle.com). Thanks."}, {"author_name": "Habib", "gravatar_hash": "49dd2ec8305c16ec7a553d216e130b8e", "author_url": "http://habibbabbles.blogspot.com/", "date": "Sep 17, 2013", "message": "It's a solution book which is getting richer everyday and passing on to generations. A great compilation of experiences. Thanks a lot."}, {"author_name": "Mahesh.D", "gravatar_hash": "18b9f9f74e92c3818cae52c709e0c2c6", "author_url": null, "date": "Sep 17, 2013", "message": "Without Stackoverflow I can't imagine life as a Developer.It helped and guided me many times.\n\nThanks for this awesome website."}, {"author_name": "Aleksey Berezan", "gravatar_hash": "ff3d82fef07d4c77bd18242694ad24d8", "author_url": "http://ua.linkedin.com/in/alekseyberezan/", "date": "Sep 17, 2013", "message": "Can't tell how much time you've saved me! Thank you very much guys!"}, {"author_name": "Aleksey Berezan", "gravatar_hash": "ff3d82fef07d4c77bd18242694ad24d8", "author_url": "http://ua.linkedin.com/in/alekseyberezan/", "date": "Sep 17, 2013", "message": "Can't tell how much time SO has saved to me! Thank you very much guys!"}, {"author_name": "Microsoft DN", "gravatar_hash": "0ec887b1e7389fc2878e9f0061db3c8d", "author_url": null, "date": "Sep 17, 2013", "message": "Honestly telling.. I am getting addicted to stack overflow day by day .. :)"}, {"author_name": "Sarath", "gravatar_hash": "b4181ede521426c94affe12556093c47", "author_url": "http://www.kodspider.com", "date": "Sep 17, 2013", "message": "Its awesome! Development would not be the same without StackOverflow..."}, {"author_name": "Iain", "gravatar_hash": "5ed89f9c3282d40e51e5573a30a8fe97", "author_url": "http://serverfault.com/users/9517/iain", "date": "Sep 17, 2013", "message": "I didn't realise how sad I'd get when it finally dawned on me that most people can't be bothered to read for themselves.\n\nServerfault, such a great opportunity, such a waste of bits."}, {"author_name": "Wiilliam", "gravatar_hash": "59df7bf2c8c7e5330baff8c86c44e14d", "author_url": "http://-", "date": "Sep 17, 2013", "message": "have used it for 4 years, I've asked over 300 questions, and gotten answers for them almost every time, also gotten answers for guessing over 1000 questions. Makes being a developer so much more enjoyable. And it benefits the curious amongst us! Thank you Stack!"}, {"author_name": "Svetlana", "gravatar_hash": "39d38961e3db1a5e8b5dc79ab9016862", "author_url": null, "date": "Sep 18, 2013", "message": "I've started learning programming about half a year ago, and, probably, from the very first week of my studying there wasn't a single day I didn't go on StackOverFlow! 99% of all problems I face and \"ask google\" are solved with the help StackOverFlow!\nFor now, I only search for help, but I do hope that in some future I'll become helpful to other people too!\nI want to thank frienly programmers that are not indifferent to some strangers' problems and help community to raise good professionals!:-)"}, {"author_name": "Gentaglia", "gravatar_hash": "bf25ec25c669f00052d7d53c8c549b57", "author_url": null, "date": "Sep 18, 2013", "message": "BIG UP FOR SE !!!!!"}, {"author_name": "Simon", "gravatar_hash": "91bcdcd7ac6867149e0da7fee38f4050", "author_url": null, "date": "Sep 18, 2013", "message": "There's no other programming website, which is so focused and offers such high quality answers. And you get answers for (almost) every problem.\n\nStackoverflow.com really made me a better programmer, improved my style and skills.\n\n\nThanks!\n\nPS: And it's free!"}, {"author_name": "jamiec", "gravatar_hash": "2c99329462909ac9c90bc9319d7e01d7", "author_url": null, "date": "Sep 18, 2013", "message": "I always enjoyed answering techie/programming questions, but all previous sites I visited regularly made zero attempt to keep the question quality high. The thing I love most about Stack Overflow is the level of community involvement in doing just that - culling bad questions, improving grammar &amp; spelling etc."}, {"author_name": "Vignesh vino", "gravatar_hash": "34a5ebe378823f7afb1cd3906057cfa6", "author_url": null, "date": "Sep 18, 2013", "message": "I was not aware of these much programming languages,concepts before seeing those tags in SO.Still lot to learn.\n\nThank a lot guys.Great job"}, {"author_name": "Ragesh Puthiyedath", "gravatar_hash": "c8d1962d29957b175b09c04f6f4f4e53", "author_url": null, "date": "Sep 18, 2013", "message": "Stack Overflow is a Great .....\n\nThank you for the Founders and members.....\n\nThanks..."}, {"author_name": "Dan Bolser", "gravatar_hash": "aace25008918cfbd2fdd25aee351ec07", "author_url": "http://MetaDatabase.Org", "date": "Sep 18, 2013", "message": "101Now mature, the settings are broken for new users due to pointless restrictions requiring unobtainable scores."}, {"author_name": "otariki", "gravatar_hash": "eb31a85ce09755f2c4a3c06b81a1a2cd", "author_url": null, "date": "Sep 18, 2013", "message": "Stackoverflow  &lt;3"}, {"author_name": "Vishakh Shetty", "gravatar_hash": "5be6051f9f0545761357fce46c493dd1", "author_url": null, "date": "Sep 18, 2013", "message": "Its really like a Programmer's dictionary.Thanks alot stack!!"}, {"author_name": "Charan", "gravatar_hash": "a960af7ac29e26a07c6cd0e73d59f187", "author_url": "http://sreecharans.blogspot.com", "date": "Sep 18, 2013", "message": "My bhp has been changed after joining StackOverflow"}, {"author_name": "Santak Dalai", "gravatar_hash": "b8850196db54b82c43df90c3945497f3", "author_url": null, "date": "Sep 18, 2013", "message": "It's been 11 months of me outside college and whenever I am in problem the first website I visit after Googling is Stackoverflow.com. It is really reliable and a great social collection of information from great minds around world. Congratulations on completing five years!! Please continue this action of generosity for centuries :)"}, {"author_name": "Paolo", "gravatar_hash": "204d6049a0fd06a3e9d42a65c6a33d9c", "author_url": null, "date": "Sep 18, 2013", "message": "I like the concept of Stack Overflow (and of Stack Exchange) because it reminds me to \"ye ol' days\" of the net where in the newsgroup you was able to ask for real questions (and obtain real answers) and to debate on real problems. After years of growing entropy, at the moment Stack Overflow is one of the few places where people dedicate time to help other people to solve their problems, in the spirit of the early netizens. In the specific, Stack Overflow is imho the most reliable community of developers, whatever programming language is used.\nSo.... thank you and happy birthday!\n;-)"}, {"author_name": "Radek", "gravatar_hash": "8e607f9010be7dbdb932dbad37b40e29", "author_url": "http://www.selleo.com", "date": "Sep 18, 2013", "message": "I think it will be best to quote what I have in my profile description: \"Stackoverflow helped me many times in my programming career. It's a huge database of \"real (coding) life\" problems and solutions. For a long time I've been just an anonymous reader, but some time ago I decided it's time to give back to the community and start helping others. And I enjoy that greatly :)\"\n\nI only asked 4 questions on Stackoverflow, but found many answers while browsing questions aksed by other people. After I decided it's time to \"give back to the community\" I gave 115 answers, earning the \"Unsung hero\" gold badge in the process :)"}, {"author_name": "Vineeth", "gravatar_hash": "8a6b89aef46b6c554c74f4416dc13460", "author_url": null, "date": "Sep 18, 2013", "message": "As a professional developer, stackoverflow has been continuously helping me keep in touch with the technologies I no longer work with!"}, {"author_name": "Hemant Bisht", "gravatar_hash": "61322064f960b328ed79220a507e1d2e", "author_url": null, "date": "Sep 18, 2013", "message": "Stackoverflow is like guardian ! You can ask your all doubts and they will resolve it.\nI am beginner and for me it is my book of wisdom, Ask your question eyes closed and then open the book you will find the answer of that question.\n:)"}, {"author_name": "Mr.32", "gravatar_hash": "e61e860e1454db9dcdae1fd72815a060", "author_url": "http://shareprogrammingtips.com", "date": "Sep 18, 2013", "message": "SO is the best place on internet for learning and getting help in programming stuff.....\n\n\n\n- Thank you so much."}, {"author_name": "Max Mommersteeg", "gravatar_hash": "2770e6cd7ecf6dda85d4d98a80db0265", "author_url": "http://maxmommersteeg.nl", "date": "Sep 18, 2013", "message": "SO is the best place for answers and best-practices when being a programmer. It makes me feel good helping out others as well."}, {"author_name": "Innovateur", "gravatar_hash": "2ea5028f768ee71fa1b43dac6ba7f991", "author_url": null, "date": "Sep 18, 2013", "message": "Just five year old? Seem to have traveled a long way right up to PhD level. Well, that's a big achievement for a five year old toddler. Keep it up, nay, Stack it up and let it Overflow! Happy birthday to you!"}, {"author_name": "Sajal Dutta", "gravatar_hash": "acc825182ae7cd5647791c7f18042be8", "author_url": "http://imagnity.com", "date": "Sep 18, 2013", "message": "The more questions I answer, the more I learn.. and less I delete. :)"}, {"author_name": "Mohamed AbdAllah", "gravatar_hash": "9e3168953bf52db2fda235dc092dbaac", "author_url": null, "date": "Sep 18, 2013", "message": "Happy birthday :) You really are the leaders of Q&amp;A sites."}, {"author_name": "VS", "gravatar_hash": "a144df10284b61c5c0736efee1aaf0dd", "author_url": null, "date": "Sep 18, 2013", "message": "Stack Overflow made me a better developer.Thanks Stack Overflow ,Stack Overflow cleared lots of doubts."}, {"author_name": "Adil Usmani", "gravatar_hash": "dd7217c86e6bfdf337a48122f0ee4e7c", "author_url": null, "date": "Sep 18, 2013", "message": "When i face my first error i panic what hell is this but my teacher told me about stackoverflow. Stackoverflow change me about how to think and how to code.Thank you so much for creating this Site."}, {"author_name": "Sam", "gravatar_hash": "c46d7f7d57db04b94d60c7c8a1706e08", "author_url": "http://findoutanswer.com", "date": "Sep 18, 2013", "message": "I never answered anyone in stackoverflow but still stack provide me always a regular better answers so stack does not deal partially to anyone.\n\nGREAT THANKS .. KEEP GOING...KEEP LEARNING.. KEEP TEACHING\n\nSource: http://findoutanswer.com"}, {"author_name": "Kiz", "gravatar_hash": "2917ca0c89dc36c6ec7d3b89a69e17c0", "author_url": null, "date": "Sep 18, 2013", "message": "spam tesying lolcla......"}, {"author_name": "Tushar", "gravatar_hash": "a8086fda56da30d7a5c088e5d804a236", "author_url": "http://www.asktushar.com", "date": "Sep 18, 2013", "message": "I maybe just another silent reader on stack overflow. But today whatever i am, stack overflow has a major role in it. It helped me in all the problems. It's a programming Heaven for me.. :) Long live stack :D"}, {"author_name": "Adam", "gravatar_hash": "4c8a9bec5a27b66b28d3c5cddeb70e93", "author_url": null, "date": "Sep 18, 2013", "message": "Stack Overflow is one of a kind, such an impressive community and system behind it."}, {"author_name": "Eduardo", "gravatar_hash": "4af10c67a7d677874d061601bfa62b95", "author_url": null, "date": "Sep 18, 2013", "message": "Without doubt, SO is the best tool a programmer can have."}, {"author_name": "Petra", "gravatar_hash": "1ac6f71f76aaf92324224dfc30d4ee2e", "author_url": "http://stackoverflow.com/users/884412/penelope", "date": "Sep 18, 2013", "message": "Last year, when making my Master Thesis, I don't think I could have done nearly as much work, tried nearly as many ideas, wrote nearly as usable and nice a system (and kept nearly my whole sanity) without the help of StackOverflow. Things that would have taken me days to Google-find, or required me to skim several books until I found the right one were answered on StackOverflow in under 20 minutes.\n\nI mostly linger on DSP (digital signal processing) and Academia nowadays, but when ever I start doing some implementation, I always come back to Stack (those would be the little bumps of activity in my SO profile).\n\nI was aware of all this when I submitted my Thesis, so I officially thanked SO in the acknowledgments page of the Thesis. It's there with all the professors, researchers and friends that made my Thesis possible (really not intending to self-promote my work, but I wanted to share my acknowledgment page with the SO community since my defense: http://www.zemris.fer.hr/~ssegvic/project/pubs/bosilj12ms.pdf)\n\nThank you StackOverflow!"}, {"author_name": "Vivek", "gravatar_hash": "f2005416dbdf4f7ab23bc69373df80c3", "author_url": "http://www.newmotivelabs.in", "date": "Sep 18, 2013", "message": "Stack overflow helped me a lot in understanding the concepts. Thanks all great helpful souls out there. God bless them.\nThanks Stack Overflow for enriching developer lives.! Great job keep growing big!..."}, {"author_name": "Rahul", "gravatar_hash": "4bbef38cbdd961e9ad0266174321ff46", "author_url": "http://www.rahulg.tk", "date": "Sep 18, 2013", "message": "Its good platform to sharing your knowledge !!\ni am thking after the google search 2nd best site in world \n \nGreat site !! keep it up : )"}, {"author_name": "Max Mackie", "gravatar_hash": "81a919e3345de64ceb979f5d2eb99d1d", "author_url": "http://maxmackie.com", "date": "Sep 18, 2013", "message": "I posted this a while back and it got quite a lot of traffic from HackerNews.\n\nhttp://maxmackie.com/posts/dear-stackexchange-thank-you"}, {"author_name": "Talha Khan", "gravatar_hash": "b0db32e2dc5eb5d636728e87fa6811fe", "author_url": "http://about.me/tkhan", "date": "Sep 18, 2013", "message": "I can Live Without Google! But I can not live without Stackoverflow.\n\nStackOverflow IS the best platform where Novice meet Professionals and the can learn from there past experiences. It saves time as many people have faced same issues and they can help alot.\n\nViv la Stackoverflow!"}, {"author_name": "shree", "gravatar_hash": "fd821d705d9e0d9cabf594b3ac777fc7", "author_url": "http://shreekhanal.com.nep", "date": "Sep 18, 2013", "message": "Without StackOverflow  I am not able to meet deadlines.Thanks StackOverflow.Thanks a lot."}, {"author_name": "max hodges", "gravatar_hash": "6e57ceb0f92704b81c0a79d6138b81e5", "author_url": "http://playboy.com", "date": "Sep 18, 2013", "message": "its great except for the asshole and bullies!"}, {"author_name": "Matt Phillips", "gravatar_hash": "db157f5dda9a08b97c28282e12d350b0", "author_url": null, "date": "Sep 18, 2013", "message": "Stack Overflow is absolutely fantastic.  I am an independent developer and I can safely say I could not have finished my projects without it.  And the ability to sharpen my own expertise by answering others' questions has helped me immensely.  The next step, monetization via SO Careers, is also brilliant and I've even gotten job inquiries from it with hardly lifting a finger.  Keep it up, you guys are great."}, {"author_name": "Guilherme Oderdenge", "gravatar_hash": "fb71d8e056eadfdc96077ff2b0ca2387", "author_url": "http://www.vincae.com", "date": "Sep 18, 2013", "message": "I access Stack Overflow more than Google. LOL"}, {"author_name": "Andy Hawken", "gravatar_hash": "a927b128eccd28164575a80fb8a6a383", "author_url": null, "date": "Sep 18, 2013", "message": "Thank you for saving us from ExpertSexChange THAT is the greatest service you have done to programmers on the internets!"}, {"author_name": "Allen Conway", "gravatar_hash": "2311a032d27f8278b61dac7574a00931", "author_url": "http://allen-conway-dotnet.blogspot.com/", "date": "Sep 18, 2013", "message": "I've had my ups and downs with SO and the suite of sites (especially on meta :/) but overall the original goal seems to have been accomplished. \n\nWhen I think about forums I used to love like ASP.NET forums, SO and it's format blow it out of the water with quality of answers and support.\n\nThe SEO of SO as well is superior being #1 with Google making it a FANTASTIC resource. I rarely ever use the search on SO, but rather Google because the posts are found so easily.\n\nCongratulations to the SO team on your 5 year anniversary. Please keep up the good work, I wish you successes, and stay focused on the original objective of being a pure 'quality' resource to the engineering community. Thank you."}, {"author_name": "Jvr Portuguez", "gravatar_hash": "5c764a2ce771146de9def0bade23ea16", "author_url": null, "date": "Sep 18, 2013", "message": "This is a great resource and a valuable tool for any developer around the globe. \n\nA great place for collaboration and best practices :)\n\nKeep it up!! \n\nGreat job."}, {"author_name": "abiessu", "gravatar_hash": "71a4b6dc9e5d84d6ed07f84b4e9b0f73", "author_url": null, "date": "Sep 18, 2013", "message": "I began with StackOverflow but found my passion in MathSE shortly after.  It has been wonderful to see the questions and answers in topics that I was never very familiar with, but I can now learn more about."}, {"author_name": "Badger Girl", "gravatar_hash": "ea6906f4c6019d6fd681ca3d8ab7333b", "author_url": "http://stackoverflow.com/users/1365454/badger-girl", "date": "Sep 18, 2013", "message": "<strong>I met my boyfriend on Stack Overflow.</strong>\n\nAlmost two years ago, I started my first internship as a software developer in Germany (I was an exchange student). I joined SO and it soon became an addiction, so I would go on SO in my free time too. There was one weekend when I was bored so I decided to try the chat rooms. I found a room with a chat bot and started playing with it. For some reason, I gave my (encoded) phone number to the bot not thinking too much about it. \n\nAfter two weeks, I got a message on my cell phone from \"the bot\". I couldn't believe someone had seen my number. We kept messaging back and forth until I found out that the sender lived only 60km away. So we decided to meet. When we met, I found out that we were around the same age and we really got along. Unfortunately, I had to leave the next day to Mexico, my home country. Later that year we met again and started officially dating. \n\nI started going into the Javascript chatroom. I've met wonderful people there including the creator of the bot (Zirak) who was the one that told my boyfriend (copy) about the message with my phone number. Now I'm a regular and I can say that we're all like family. We are even planning a meet up! copy and I sometimes go on the DMZ chatroom too and we just recently met Iszi IRL. \n\nCongrats on the 5 years."}, {"author_name": "Jacob Boyko", "gravatar_hash": "8e80acc62bb2c7561d9755e38ec83a90", "author_url": null, "date": "Sep 18, 2013", "message": "Was it just five years ago? Funny, it was around that time that I discovered StackOverflow. I didn't know it was new, but I quickly began to favor search results from Google that came from Stack Overflow. I just found better answers faster . . . for some reason this place just made more sense."}, {"author_name": "Ryan Kinal", "gravatar_hash": "a1f961d1884c890688c64bb98912f1fb", "author_url": "http://www.slicktext.com", "date": "Sep 18, 2013", "message": "I came to the site looking for help, and I found it. Then I started answering questions, and found that I really enjoy helping people. Now, I idle in the JavaScript chat room all day, often times discussing nothing at all, but sometimes helping people, or learning more about the language.\n\nAll in all, SO has helped me become a better person, and the community brightens every day for me. Special thanks to all the JS room regulars, and cheers to everybody involved in making SO/SE a possibility."}, {"author_name": "South West", "gravatar_hash": "f9e88b0dc49911f59c708684fe720e24", "author_url": null, "date": "Sep 18, 2013", "message": "Love this website, I have meet some amazing programmers both good and bad but most importantly it has helped me a lot in improving my skills, understanding and knowledge in various programming language."}, {"author_name": "Rigel", "gravatar_hash": "f3fd4c47726de733ba5441fe4bd7c350", "author_url": null, "date": "Sep 18, 2013", "message": "I would like to thank stackoverflow for all the help I got. I still wonder ...... I post a problem on stackoverflow and someone somewhere reads it and actually takes out time and put in  effort to solve my problem without knowing me... amazing amazing."}, {"author_name": "Mike Devenney", "gravatar_hash": "b697a7e141d73275aceb7914fd489763", "author_url": null, "date": "Sep 18, 2013", "message": "Love the site, thanks for providing a place where I can go to see how the big guys would solve the problem I'm having.  It makes me better everyday!"}, {"author_name": "jadarnel27", "gravatar_hash": "d7344197e9c97b445893e3d4ed1fdea0", "author_url": "http://stackoverflow.com/users/861565/jadarnel27", "date": "Sep 18, 2013", "message": "Posting and reading on Stack Overflow has taught me, more than anything else, how to communicate effectively.  It has forced me to recognize the importance (and benefits) of being clear when communicating; and this has helped me in both my career and personal life more than I can say.  \n\nI truly appreciate this site, its creators, and the community of contributors for having such a profound and useful impact on my life.\n\nI also learned basically everything I know about web development from Stack Overflow, and I now have a great job doing that for a living.  So that's pretty cool too =)\n\nIn closing: unicorns"}, {"author_name": "BrunoLM", "gravatar_hash": "ef1a0f00d57917768acdc5b379ca1b28", "author_url": null, "date": "Sep 18, 2013", "message": "I found out about Stack Overflow through a co-worker.\n\nIn all this time, I learned a lot. I learned so much that I easily got a certification.\n\nStack Overflow made me grow really fast, I am way ahead from where I was 5 years ago.\n\nI recommend Stack Exchange to all my friends, always!"}, {"author_name": "Rex", "gravatar_hash": "6e55cd9f7e6e69b895adf6266ed4fe6f", "author_url": "http://justanotherhumanoid.wordpress.com", "date": "Sep 18, 2013", "message": "Stackoverflow has shown that known is a drop, unknown knows no bounds [ or the bounds are invisible as of sometime) ,but there is atleast one who attempts to bring the bounds to visibility. Stackoverflow has shown that \"look for the smarter.You will always find one\" and has made my ego thinner, but made my wisdom stronger."}, {"author_name": "Mplungjan", "gravatar_hash": "b2f4948b43917a3214dfcb1c7f1518a3", "author_url": "http://Plungjan.name", "date": "Sep 18, 2013", "message": "I just have to help people.\nThe payback is that I have to figure out how to do something if I do not already know how."}, {"author_name": "Samira Ghazi", "gravatar_hash": "bc023386b8fb87d0029ddcefff15e2c6", "author_url": null, "date": "Sep 18, 2013", "message": "This site is awesome."}, {"author_name": "Dana", "gravatar_hash": "e2751a1662c51bafba2c7225f1369a52", "author_url": null, "date": "Sep 18, 2013", "message": "I can't possibly have kept track of how often I've found a solution on stackoverflow.com. That's nothing out of the ordinary, it's exactly the point.\n\nAt least twice I've come to stackoverflow.com when confronted with a persistent issue. I read the post and at least one answer and think, \"That's EXACTLY the same problem I'm having!\"\n\nYeah...that's because I posted the question. &gt;.&lt;\n\nThanks for an amazing tool/site/community. I don&#039;t spend enough time here and for that I&#039;m ashamed."}, {"author_name": "Ani", "gravatar_hash": "a832a93dbd1e869a8066e3af544679e6", "author_url": null, "date": "Sep 18, 2013", "message": "I'm always amazed at the depth of knowledge and different and helpful perspectives that I find in the community. It's to the point where I think I'm just going skip Google and go to Stackoverflow (or one of the other Stack Exchange sites) whenever I have a problem.\n\nThank you for the great platform on which it has developed."}, {"author_name": "timbck2", "gravatar_hash": "2288290932c33b72608e2e11abe29c7a", "author_url": null, "date": "Sep 18, 2013", "message": "StackOverflow has been an amazing resource for me since I discovered it over a year ago. I'm very grateful for the help I receive when I get stumped on a programming problem, and I've been delighted that I've been able to \"pay it forward\" and answer a few questions along the way! Keep up the great work!"}, {"author_name": "Debarupa", "gravatar_hash": "a267e39c2363e18f9cc706a09dfe5a51", "author_url": null, "date": "Sep 18, 2013", "message": "Thanks for this great site. I always turn to this site when I have a programming issue and try to help out others for those \"fake internet points\", really! Cannot thank enough, keep up the good work!"}, {"author_name": "FFlintstone", "gravatar_hash": "a5e95c1dbb68b230eb71cd12c6c8378f", "author_url": null, "date": "Sep 18, 2013", "message": "Coming from old school TAPCIS that referenced Compuserve Information Services, I have to say... I don't miss the old days at all. This site never disappoints, and almost always reveals either the exact answer or a damn good clue."}, {"author_name": "Joe", "gravatar_hash": "8a90b6864bbc87b210758cc70cdb03a5", "author_url": null, "date": "Sep 18, 2013", "message": "I'm sad it took me so long to stop lurking and actually sign up. But in the last 18 months I've contributed a pretty decent amount to SO and it's awesome. I moved across the country and landed a job found on careers.stackexchange. Thank you for all the fish!"}, {"author_name": "TheProgramm3r", "gravatar_hash": "7534c6f5373561ad47e4665d7bd8c60d", "author_url": null, "date": "Sep 18, 2013", "message": "Thank You, Jeff Atwood and the rest of the SE team, for an amazing experience, every time that I have used the site. I started out on SO, then moved to GameDev SE, and have loved the site ever since. You have helped to inspire me to become what I am today: a 13 y/o amateur programmer of Python (and a bit of Java/C#), and a game developer.\n\n\nMy Main Account:\nhttp://gamedev.stackexchange.com/users/30021/theprogramm3r"}, {"author_name": "Mustafa", "gravatar_hash": "f365e5b3587387ed67c9c747288874e2", "author_url": null, "date": "Sep 18, 2013", "message": "I was discovered by a top company recruiter thanks to my answers here that I gave in my free time. Unfortunately, I couldn't pass the last interview, but hell I went to Ireland thanks to StackOverflow!"}, {"author_name": "Jason Sebring", "gravatar_hash": "39e8151ad74e548bcb4a7b14415e8d58", "author_url": "http://www.emeraldcode.com", "date": "Sep 18, 2013", "message": "Without question, this is the most useful programmer resource on the internet."}, {"author_name": "Rajarshi", "gravatar_hash": "8d0d72563e46fa920323a6bb41d60275", "author_url": null, "date": "Sep 18, 2013", "message": "Being mostly a self taught developer, I I owe my professional career to SO, its team, and the uncountable users who are kind enough to take their time to share their hard earned knowledge with strangers..what amazes and humbles me time &amp; time again that,the level of passion for the trade which becomes eminent form every reply, suggestion,intelligent discussions...I honestly feel like in company of the smartest students of the colleges I could not go, the smartest co-workers of the companies I have yet to be employed...I just got my first developer job, &amp; most of the interview questions I have answered, are learned from SO..just want to thank you all from the core of my heart...you make this world a better place..."}, {"author_name": "Mike Clark", "gravatar_hash": "1aac03fde960d0e6f8f4a0a9106eb712", "author_url": "http://www.mikeclark.co", "date": "Sep 18, 2013", "message": "I signed up for Stack Overflow on Sept 17, 2008, just a couple of days after launch.  I have asked 96 questions and answered 105 as of this moment.\n\nThis place has saved my bacon more than once.  On too many times to recount I have sat at my workstation for hours trying to figure out why something wasn't working, only to ask the question on SO and get a correct response within a few minutes.  I cannot point to a single SO user who has been overwhelmingly useful, but it has been the entire community.  Not only those whose answers I have accepted, but also those who have provided other answers have been very helpful in my work.\n\nI recommend Stack Overflow here at work at every opportunity."}, {"author_name": "Tom Yates", "gravatar_hash": "7d49534cc9eeb3327df5fdfb9189bbf9", "author_url": "http://www.teaparty.net", "date": "Sep 18, 2013", "message": "I signed up for ServerFault about three years ago, after a fellow sysadmin told me it accepted OpenID registration; I'm a big fan of decentralised schemes in general, so I figured I'd take a look at this site that was wacky enough to honour my favourite decentralised authentication scheme, and just got hooked on helping people.\n\nCurrently running at about 25k rep. on SF; I've looked at and dabbled in a few of the other sites, but SF deals in the stuff where I can really be useful."}, {"author_name": "instinctcoder", "gravatar_hash": "791953b3e20803162168bfa017ed2ba6", "author_url": "http://www.instinctcoder.com", "date": "Sep 18, 2013", "message": "What ever programming question i searched in google, stackoverflow.com showed first. What ever solution i tried, try stackoverflow.com's first.\n\nSo this is how i answered my junior colleague when they asked question. \"Did you stackoverflow.com's GURU?\" :)"}, {"author_name": "Andreas E. (syntaxerror # 1337416 @SO)", "gravatar_hash": "428da17c8015b5a02647845649f79912", "author_url": null, "date": "Sep 18, 2013", "message": "A SUPERB site project you've put up there.\n\nI wished I had the opportunity to have something like this as an *intern* in 2000, when I sometimes had to wait up to 3 days until I could solve a problem and just needed the right approach.\n\nAnd these guys in companies would ask you 2 times a day whether you've progressed and in how far!!\nSo I had to write the question into up to 3 mailing-lists and always hope...and hope...so that I finally could advance in my project(s). You youngsters can't think of how difficult it was ... yore."}, {"author_name": "Andreas E. (P.S.)", "gravatar_hash": "428da17c8015b5a02647845649f79912", "author_url": null, "date": "Sep 18, 2013", "message": "ah and I think I will never sell that great UserID for $10,000! :P\n\n **1337** 416 - I r3a4llY l0v3 i7 ! haha! :P"}, {"author_name": "lee", "gravatar_hash": "2c8f51eaeccaa62687bb6b8c8f84b164", "author_url": null, "date": "Sep 18, 2013", "message": "I'm an ex-pat living and teaching in Thailand. 5 Years ago, I was building Flash games and activities to help my students learn English. One day my wife asked me if I could make money doing this. I laughed and told her I didn't think so. \nThen I remembered this guy at my school was doing some kind of freelance work, so I asked him about it.\nI got into freelancing. It was difficult especially since I didn't study programming. Then, about 2.5 years ago, I stumbled across SO.\nThis was a GIGANTIC help in learning to program. \nNow I am building websites. And, just today, I was finally able to answer a question that helped someone else.\nOh, and also my daughter is celebrating HER 5 year birthday right now too."}, {"author_name": "thevikas", "gravatar_hash": "0ee9e73378cc090755664dffb2ea70f8", "author_url": "http://changing.thevikas.com/blog", "date": "Sep 18, 2013", "message": "First it became the best place for technical answers. Then it became a driver to help others as well. But always, stackoverflow is much more interesting to look at problems others are facing in real worlds. That I often spend lot of time just reading questions, learning about new tools, about new procedures, new algorithms, new code - and there is no better place to to the cutting edge faster than stackoverflow. I try answers where I can. Other topics like electronics and bitcoin and many others are great so similar people can find common groups."}, {"author_name": "Thomas Eynon", "gravatar_hash": "a494c1ee310437f9225b69ed4a2fcfb3", "author_url": "http://tomsfreelance.com", "date": "Sep 18, 2013", "message": "The fake internet points mean so much more than some reputation though. Every time someone up votes my question or answer, I get that little warm fuzzy inside knowing that someone else benefited from my posting it."}, {"author_name": "Meikleberry", "gravatar_hash": "6b9d1e492719749841c678a62695f43a", "author_url": null, "date": "Sep 18, 2013", "message": "Looking at all the positive posts makes me wonder whether I'm just a little finicky, as I want to express some disappointment. Why? Because I googled my question and was led to a similar question on this site. BUT - the first comment was somebody rebuking the original poster for not googling the question. Seriously?"}, {"author_name": "logan", "gravatar_hash": "9f3b453c3d327a3843bfcff9ea7c66e5", "author_url": null, "date": "Sep 18, 2013", "message": "Stack Overflow is my GURU !!! I respect you !"}, {"author_name": "ARUN", "gravatar_hash": "e65c6a4747382dce11cb230a8a5c4de8", "author_url": "http://stackoverflow.com", "date": "Sep 18, 2013", "message": "Stack Overflow has shown the real power of what a community can do together.\nHAPPY B'DAY TO U DEAR"}, {"author_name": "Shishir", "gravatar_hash": "06a06435b4406285aa5e10bb5b2108a0", "author_url": "http://technoism-bd.com", "date": "Sep 18, 2013", "message": "StackAmazingFlow !"}, {"author_name": "Taleeb", "gravatar_hash": "d24218e3b7e1fd76f55e01be2a1f3126", "author_url": null, "date": "Sep 18, 2013", "message": "The best ever site for programmer's questions! You can not imagine how much it helped me. Due to lack of time I had not much time to learn many things and Stack Overflow helped very much to find answers for common problems quickly."}, {"author_name": "Naveen", "gravatar_hash": "c7f2c660f76fadc0d28b0f8915907c36", "author_url": null, "date": "Sep 18, 2013", "message": "If I have any problem, ultimately stackoverflow is the answer"}, {"author_name": "Pyae Linn Hein", "gravatar_hash": "85cc5e7fab8ce4892f7ec963c3a5699d", "author_url": "http://stackoverflow.com/users/1464038/louis-mm", "date": "Sep 18, 2013", "message": "Dear SO,\nyou helped me alot..\nThanks"}, {"author_name": "MathiasWestin", "gravatar_hash": "661da67373780b8a1bf22622178df167", "author_url": "http://mathiaswestin.net", "date": "Sep 18, 2013", "message": "The biggest change when I switched from forums to using StackOverflow was that the correct answers gets voted up, so I didn't have to waste my time finding the correct answer. The time saved went to write blog posts and other productive work."}, {"author_name": "Martin Gregory", "gravatar_hash": "0e0ba91baa886350aa4dd5d70541e5a9", "author_url": null, "date": "Sep 18, 2013", "message": "It is not an overstatement to describe StackOverflow (and similar places where we help each other) as miraculous.\n\nThe effect that they have on programming productivity worldwide is nothing short of that.   It would be difficult to under-estimate the amount of programming that happens now that simply could not without this sort of resource.   It blows me away regularly to realise that you can type an error message into google and find the answer to what is wrong, better than nine times out of 10."}, {"author_name": "Raghavendra", "gravatar_hash": "6a43956ed7552af75b4e7f719ee65b20", "author_url": null, "date": "Sep 18, 2013", "message": "Most searches in google related to mainframe leads me to stack overflow. Good website with lots of information. And an simple user interface."}, {"author_name": "Pranav Kumar", "gravatar_hash": "9bc4ac70ca840f0550b0936e7c301fd8", "author_url": null, "date": "Sep 18, 2013", "message": "i am associated with SO from last two and half years .. and really nothing has helped me like SO .. perfecting my skill and knowledge always with it.. Hats off to you dudes who are always willing to help ."}, {"author_name": "JVemon", "gravatar_hash": "282d90685b22ce8c20e2fada67dd3737", "author_url": null, "date": "Sep 18, 2013", "message": "Stack Overflow improved my college grades.\n\n:)"}, {"author_name": "Kangkan", "gravatar_hash": "f1570fff80187e342e69951edc552bff", "author_url": "http://www.geekays.net/", "date": "Sep 19, 2013", "message": "And the miracle is still on!\n\nI started using SO somewhere in 2009-2010 and kind of got addicted. Its fun to answer questions where I can help. Share knowledge and gain knowledge."}, {"author_name": "Saimis", "gravatar_hash": "d8358d928d8b4fd21c35b139819146ce", "author_url": "http://Samesyatem.com", "date": "Sep 19, 2013", "message": "Many projects would have failed if not the SO. Thank you!"}, {"author_name": "Aditya", "gravatar_hash": "168d90840423e56f7ad07c0dbe558870", "author_url": "http://www.geekzwish.blogspot.com", "date": "Sep 19, 2013", "message": "I have learned more about some programming languages on StackOverFlow than from billions of tutorials scattered all over the web.\nIf not for stackoverflow, I would have been still a newbie programmer write junk code.\n\nHappy Hello World Day to Stackoverflow\nWishing for more and more such wonderful Hello World Days!"}, {"author_name": "Xman", "gravatar_hash": "62890f2b038af75609ca5095be409338", "author_url": null, "date": "Sep 19, 2013", "message": "I visit stackoverflow daily, while solving other people's problem each and every day I learned something new. Even if I can't answer the question, it has added something to my knowledge."}, {"author_name": "Aishwarya Shiva Pareek", "gravatar_hash": "26c15cefe5b28b820a0a57d4736c3f39", "author_url": "http://www.wrangle.in/", "date": "Sep 19, 2013", "message": "Stack Overflow is the best programming Q&amp;A website. Instant Answers, Instant solutions to our problems and almost all programming problems can be solved here. What's else a programmer need? When I suggested Stack Overflow to my friends, they said these sites can't help solving complex problems. Just go for advanced programming books. I said \"Shut up and let me show you how SO works.\". I posted a programming problem that I was facing at that time. SO solved it in not more than half hour and from that day my friends didn't even opened their books. They do their programming with the help of SO. Thank you SO and Stack Exchange. Wish you people keep growing and prosper like this. Happy Birthday :)"}, {"author_name": "dhanapal", "gravatar_hash": "01565fa08a77443f3a952ed174c1d354", "author_url": null, "date": "Sep 19, 2013", "message": "SO.., Helps me to keep updated.., \n\nThanks a lot. \n\nAll the best."}, {"author_name": "Oliv", "gravatar_hash": "41643b202d9302858192b013aa27e76a", "author_url": null, "date": "Sep 19, 2013", "message": "SO is superior to forums, we used in the old times. Very often, I just read the question title, go to the first answer and get a solution. In formus, I had to go through several answers and often had to combine several posts to get the answer.\n\nWhat I really hate is closed legitimate questions. I remember to find several questions for which I was looking for an answer, and actually found it, and they vere closed. And after it happened to one of my questions, which I think was perfectly legal, it really made me upset: http://stackoverflow.com/questions/16643010/large-array-initialization-from-code-or-file. I think you should restrict the rules for closing questions. I was looking for pros and cons of two alternatives. The moderator, who first closed it, said \"Benchmark it and you'll know\". Yes, I can find answers for all questions by myself, but that's why we have SO for, so we don't have to, if someone else already did. It will take few days to benchmark by myself."}, {"author_name": "Danair Tab", "gravatar_hash": "2b140ba0af8d441b448fd5ac4e8dcac4", "author_url": null, "date": "Sep 19, 2013", "message": "Stackoverflow helped me to get my College Diploma and build my career in IT World."}, {"author_name": "Danair Tab", "gravatar_hash": "2b140ba0af8d441b448fd5ac4e8dcac4", "author_url": null, "date": "Sep 19, 2013", "message": "Stackoverflow helped me a lot from my College Days until now. It really help me to build my career in IT world. And i learn a lot from it."}, {"author_name": "Ravi", "gravatar_hash": "64906567f685636ed397155a11f657ca", "author_url": null, "date": "Sep 19, 2013", "message": "Hello.. Jeff Atwood and Joel.. with your cool idea, i am now produly say i am a progrommaer now.. SO taught me many techniques, standards and many ways to solve the problems. SO Points are may be fake, but it represent sheer interest and passion for code and helping community.\n\ni have been using SO from 3 years, each day it is new for me..many unnoticed area of programming..  Just i would like to congratulate you guys.. \n\nKudos .. Keep it up :)"}, {"author_name": "Ondrej Janacek", "gravatar_hash": "8d13393ea520da58e42029fe8d079fb0", "author_url": null, "date": "Sep 19, 2013", "message": "StackOverflow helped me find real experts in C# that I can follow on their blogs and learn more. Also, it helps me to get better in english by asking and answering questions which I strive to be of a high quality.\n\nThank you, keep growing"}, {"author_name": "Creator", "gravatar_hash": "e5f209ccceb92da86d61cfb03b5a33be", "author_url": null, "date": "Sep 19, 2013", "message": "3rd of December 2011,\nFirst day of my new job. I was a MBA in finance with no prior experience in programming. It took me quite a lot of time to decide that I could never work in finance industry. I used to be a hobby-programmer and so I took a risk. I joined one startup firm as an Android developer. They gave me chance to show my skills(Which I didn't have). They gave me a programming problem to find a solution, probably to confirm if I know something about coding. I couldn't solve it and since it was late, they gave me another day to solve it. I was feeling a bit shaky about the decision I took. I was thinking that it was a bad decision. Next day I put the problem on google, clicked on the first result, it was a stackoverflow question page. It helped me to answer part of the problem, so I chose to signup and search for other parts of the problem. There were a lot of good answers and more than 2-3 methods to solve my problem. I solved it, made a build and I got the job.\nAfter making more than 50 apps/games and countless versions and plugins in more than 10 programming languages since then, I can say that I am proud of my decision and consider Stackoverflow as my greatest supporter and mentor. I think it's just a concidence that I am thinking to start my own development studio and today I bought the domain for the website as a first step.\nI could never thank enough to Stackoverflow for the help, support, motivation it provided to make me what I am now. Still thanks for being so awesome and making such an amazing site."}, {"author_name": "awatravel", "gravatar_hash": "f75e7daa65c3ae97afc4a82448b970f3", "author_url": "http://www.awatravels.com", "date": "Sep 19, 2013", "message": "ane sering mencari jawaban tentang permasalahan programming di google...\n\nstackoverflow selalu muncul di pejwan... malah sering muncul pertamax :D"}, {"author_name": "Azhar", "gravatar_hash": "c0b7d5ccbd06eb9853d66ae002851e93", "author_url": "http://near.my.id", "date": "Sep 19, 2013", "message": "Stack Overflow is my friend :)\nHe always beside me whenever i need solution in programming..\nA lot of people inside Stack Overflow's really kind, Thank you for your contribution in this awesome site!\n\nBest Regards from Indonesia,\n\nNear"}, {"author_name": "Kashif waheed", "gravatar_hash": "98f1eb83a83184379696de0749576ad7", "author_url": null, "date": "Sep 19, 2013", "message": "i love stackoverflow as it finish all my worries as once i get stuck some where stackoverflow always come into my mind and i always think dont worry kashif stackoverflow exist in the real world."}, {"author_name": "Sandeep Virk", "gravatar_hash": "90889d071dcb0e6b37f7f66c59b14d56", "author_url": "http://alienchela.com", "date": "Sep 19, 2013", "message": "I started my career as a graphic designer after working more than 1yrs i had decided to learn front End also So, i change my job. In my new job i didn't know that much about HTML &amp; CSS.\n\nThen one of my colleague told me about stackoverflow. At that time i was not regular in  stackoverflow. I got my 1st 1000 points in 6months.\n\nStackoverflow made me a better person. It's teach me that never stop learning.\n\nRight now i am working as a UI/UX designer &amp; Front End Developer."}, {"author_name": "Hassan Gulzar", "gravatar_hash": "8be13c414b8c39ddbc1db3192d0bd9b4", "author_url": null, "date": "Sep 19, 2013", "message": "Stackoverflow is my second nature. I search on SO as much as I do on Google. The plain truth is that I didn't knew certain code techniques and more importantly, code ethics. \n\nMy friend and colleagues call me a genius but I wasn't worth that title. Had it not been for SO, I'd be the cannon fodder developer for life.\n\nIn Pakistan, I went from company A to company B with bigger rank and package because I was able to prove I had the actual skill. I lack the proper degrees and higher education. And now I know that they are not important enough to ignite the spark.\n\nNow I'm in Dubai. The whole world in front of me.\n\nI won't bring my baby daughter excessive gifts. Every year, I'll teach her how to look for information. I'll teach how to use StackExchange in her field.\n\nThank you each and everyone related to SO in any way possible."}, {"author_name": "Shan", "gravatar_hash": "f41ac2aad6dc2dcd87cef4631787dfbc", "author_url": null, "date": "Sep 19, 2013", "message": "I started my career as a Mac application development and later moved to IOS development. At the beginning i did't know about stack over flow, first time i googled for solution i got answer in stack over flow, very interesting,lot of comments and  i saw how the users are shared their experiences, from that day i created an account and i also started asking questions. And now most of time i spent on answering the questions becz it makes me happy and i  learn new things. Now if i got any problem, i first search stack over flow if i did't get any answer i ask the question, becz there are lot of people in the stack over flow to help. \n\nThank you for making such a beautiful and helpful site :)"}, {"author_name": "Seraphim", "gravatar_hash": "a35d1bc2b8dedd89fcda557e8a022c98", "author_url": null, "date": "Sep 19, 2013", "message": "I learned the meaning of patience. Both when asking and answering questions!"}, {"author_name": "ddnl", "gravatar_hash": "b33a753af9f072f650d6e584c288b92f", "author_url": "http://wemait.com", "date": "Sep 19, 2013", "message": "Where would i be without stackoverflow ;) this site saved my ass allot ;) I learned so much from everyone, It made me a better programmer! Keep up the good work!"}, {"author_name": "Rahul Singh", "gravatar_hash": "06733caf75b050c47c85a8f99b481209", "author_url": null, "date": "Sep 19, 2013", "message": "What a site; it has changed my whole outlook on programming. No longer is it a mundane pursuit. It is now a search for knowledge and every day I learn something completely new. It's absolutely incredible how much we can learn from sites like these. Without Stack Overflow, I would be at least a year and a half behind in terms of knowledge and experience. Thank you so much!"}, {"author_name": "pythonian29033", "gravatar_hash": "66393f93904f21ac7ebf1f63b8f5dbda", "author_url": null, "date": "Sep 19, 2013", "message": "stackoverflow is my place to turn to when there's no one available who has enough knowledge/intelligence nearby anymore, and when that time came around three years ago now, I was not disappointed when I signed up and learned all the things I could from others and also had a platform to share my own knowledge with others.\nIt's great to know there's a site online where helping others and asking is now cool!\nOf course I also turned to other stack exchange sites like ubuntu and server fault, which helped a lot when there are things like custom algorithms you need advice on how to go about coding there are sites like the mathematics one (can't remember the name).\nlooking forward to many more years with you guys!"}, {"author_name": "JoeBilly", "gravatar_hash": "62be99668a0039c8fd81368f4607d5b3", "author_url": null, "date": "Sep 19, 2013", "message": "Since SO, problems became how-to(s). Thanks to founders and all contributors."}, {"author_name": "Ishan", "gravatar_hash": "f10c3ee8edf3dbcd5c67250b290448f1", "author_url": null, "date": "Sep 19, 2013", "message": "Stackoverflow not only helped me in technical terms but also taught me how to put yourself forward professionally."}, {"author_name": "AVEbrahimi", "gravatar_hash": "cf9b63f6e0e2d709993723d9b9be79cf", "author_url": null, "date": "Sep 19, 2013", "message": "Stackoverflow is first place to look for help, and usually the last one ;)\n\nThank you for the job."}, {"author_name": "stackoverflow", "gravatar_hash": "0f48877c0323545348f0fad800aa7994", "author_url": "http://stackoverflow.com", "date": "Sep 19, 2013", "message": "What so?"}, {"author_name": "Matthew Jones", "gravatar_hash": "02cddefc352e5f9ddfb1ac2ede6d101c", "author_url": null, "date": "Sep 19, 2013", "message": "Stack Overflow showed me that there are probably 20 ways of doing something, but that there's usually a (mostly) right way and a (usually) wrong way. It's helped me make the correct choice more often in my development life."}, {"author_name": "raghav", "gravatar_hash": "887004209ac5538212d9e32648557431", "author_url": null, "date": "Sep 19, 2013", "message": "5 years?really?...i thought it was around for more than that...what with the number of developers typing around....great job guys...best of luck for the path ahead."}, {"author_name": "Carl Witthoft", "gravatar_hash": "93234f6c046fc1554f9fb2c471fb09ec", "author_url": null, "date": "Sep 19, 2013", "message": "I was thinking of claiming I'd traded my Gold Badges for genuine BitCoins, but who'd believe me?  So I'll just add to the general adulation for SE and SO.  When I think back to the early \"usenet\" years and the unholy mess that permeated newsgroups (anyone remember Ludwig Plutonium on sci.physics?), it's absolutely amazing how well SO works.\n\nP.S. an all-numeric captcha? hmmm"}, {"author_name": "Larry Davis", "gravatar_hash": "7069d42b4b6458dab926b580c69dcfac", "author_url": null, "date": "Sep 19, 2013", "message": "Congrats on five years!  Thanks for being an awesome resource.\n\nI have 17 bookmarks to StackOverflow answers.\n\nStackOverflow points quantify the fact that you are helpful AND you know your ****"}, {"author_name": "Deepak", "gravatar_hash": "7be0cdd65185dbadb58291aec3fb3067", "author_url": null, "date": "Sep 19, 2013", "message": "Thank God for giving us stackoverflow !!!"}, {"author_name": "Ricky Hewitt", "gravatar_hash": "3f745b273764e55bdde5f82e2f60fe0d", "author_url": null, "date": "Sep 19, 2013", "message": "StackOverflow has been the expert in my ear during all my programing ventures! Thanks for everthing!"}, {"author_name": "Christopher Long", "gravatar_hash": "2f09b9e01f0ab72fc8c60d5244071287", "author_url": null, "date": "Sep 19, 2013", "message": "I was just thinking about it the other day. What did I do before StackOverflow? I mean I have been using it for almost 5 years why didn't I find it sooner I guess this answers my question. Thanks everyone for making this site the authority and force it is. Awesome things happen when geeks unite!"}, {"author_name": "Robbye Rob", "gravatar_hash": "c6cbdcc6ed17b45afbb8fe2a7df83fdf", "author_url": "http://clearingthefog.net", "date": "Sep 19, 2013", "message": "I am leaving a comment because this site is bunk.  Some idiots can down vote your answer and ban your account.  I don't give a load of beans using this site any more or using the stupid information from the aholes that want to wrek your reputation.  Screww you..."}, {"author_name": "Chris LaFrombois", "gravatar_hash": "bf33c464fc28a492ef13785274fc0d3c", "author_url": "http://www.thesimonsgroup.com", "date": "Sep 19, 2013", "message": "I've been a registered user for over a year and a half and probably started coming to the site looking for answers well before that. It wasn't until this past week or so that I finally realized I was to the point where I was answering the questions instead of asking them (either indirectly through someone else or my own). There have been some really helpful answers on this site, which has made me a much better programmer, even if I'm still a novice. I'm a designer by training, but find programming to be quite enjoyable...it's the problem solver in me."}, {"author_name": "Srinivas Mangipudi", "gravatar_hash": "20ebffba0a89044c48506d47e11241a7", "author_url": "http://www.srinivasmangipudi.tumblr.com", "date": "Sep 19, 2013", "message": "Stackoverflow rocks!! \nI never get to ask questions though, as most of the answers you can already find here. As a result, I am stuck with he same points, not enough to up-vote, or contribute, or answer. How can i get out of this loop?\n\nThank you Stackoverflow!"}, {"author_name": "Ankit Agrawa;", "gravatar_hash": "acfcdecea138cc8dbd94b4f3e0d911d2", "author_url": null, "date": "Sep 19, 2013", "message": "Stack Overflow help me alot"}, {"author_name": "Ankit Agrawal", "gravatar_hash": "acfcdecea138cc8dbd94b4f3e0d911d2", "author_url": null, "date": "Sep 19, 2013", "message": "Stack Overflow help me alot !"}, {"author_name": "rahul", "gravatar_hash": "1d58ae647c0cdd5de573e4737a5e28b1", "author_url": "http://31october.com", "date": "Sep 19, 2013", "message": "254I dont think i will ever know about a super guy called Jon skeet , if stakcoverflow is not here., \n\nhttp://stackoverflow.com/users/22656/jon-skeet\n\nThanks"}, {"author_name": "Ryan P", "gravatar_hash": "5e524e0e044000b675c7cb1f8102bff8", "author_url": null, "date": "Sep 19, 2013", "message": "StackOverflow has been a tremendous help to me over the last 3 years.  After I graduated college and got my first full time IT job(2007), Experts Exchange was the main site i, and most other programmers i knew, used(MSDN and other MS related references were lousy at the time).  It was a decent site, but having to pay to use it was a huge limiting factor.  Luckily my company had an account our team used.\n\nAfter I left that job, i took an IT job that didn't require programming for a year and a half, during which time StackOverflow started and became the dominant destination for programmers.  Not only is this the best site for quality programming information, it is the fastest and in my opinion, the cleanest and best designed.  \n\nAlmost all my bookmarks at work are StackOverflow and i don't know what i would do without it.  I cant imagine any other site being better or why any programmer would want to use any other site as a reference.  I hope it is as valuable to others as it has been to me."}, {"author_name": "Aaron Belchamber", "gravatar_hash": "eb8e136506738cc02977f9c84750b2af", "author_url": "http://AaronBelchamber.com", "date": "Sep 19, 2013", "message": "Boy, if I had to pay for all the advice and great solutions I found on Stack Overflow, I would be broke!  Between Stack and PHP.net, I'm not sure what site I use more, but they are invaluable.  I only wish I could share and contribute more, but I usually find in this community that someone already answered a question faster and better than I could myself.  I will keep trying to shake off my \"Tumbleweed\" Badge and I feel a deep debt of gratitude to this site and all you members that have helped me without even probably knowing it.  This is an example of how a great system with the right tools, rules, incentives and policies will help elevate us all and take us so much higher than we could ever go individually."}, {"author_name": "LWChris", "gravatar_hash": "c459886648fd2e153a518352292ab509", "author_url": null, "date": "Sep 19, 2013", "message": "I remember what problem made me register on Stack Overflow:\n\nI'm travelling by local train a lot, and I always have my laptop with me to code. Since I have no WiFi in the train, I have to use try-and-error whenever I encounter a problem during the ride. One day I used to learn how to make WPF applications with XAML, when I noticed that all my buttons' icons appeared to be blurry. I fumbled around with sizing, different file formats, rendering options and so on, but since I couldn't find a solution, I focused on other problems, since there is more important work to do than button icons.\n\nI wrote several dozens of WPF applications, some small, some large, some for testing, some made for productive use. They all had blurry icons in common.\n\nAnd then, one late night, I figured that I couldn't possibly be the only one in the world having this issue. I googled my problem and Stack Overflow showed up as first result. The solution given in the the top answer by votes was to add a specific property to the main window. I tried it and *SWOOSH* everything looked brilliant. Although that answer had already a lot of votes up, I wanted to thank whoever had solved one of my most annoying problems.\n\nThat's why I registered, and since I've used Stack Overflow a lot to get my work done without hours of try-and-error. If you can't figure it out within 3 different approaches, why not simply get inspired by how other people solved the problem? Often I find even better code than what I'd produce. So you cannot only use Stack Overflow to get answers, reading a lot of questions and answers here can actually improve your coding style. That's why I love the site so much.\n\nThe only downside of it is that there is barely a question that 1) I can answer 2) that's not perfectly answered already or 3) that's not considered to be off topic by others. On the other side all of my questions seem to be so difficult to solve that none of them have been answered yet except for \"you can't do that\" or worse workarounds than what I had gotten to whilst my question was asked and not answered to yet. I hope, one day I'll be good and fast enough to be one of the guys to answer other people's questions."}, {"author_name": "sylvain courcoux", "gravatar_hash": "220c6d21266adce4005fdd8a72c4927d", "author_url": null, "date": "Sep 19, 2013", "message": "Stackoverflow made it possible for me to learn programming and build my  own software! Thanks!"}, {"author_name": "Mark Schultheiss", "gravatar_hash": "f2077dbed28ae040719cbe698800ec29", "author_url": null, "date": "Sep 19, 2013", "message": "A long LONG time ago (longer than most of the users here have been alive) someone loaned me some money for some food.  He only asked that I return and pay it back.  I learned a lot of lessons that day. Trust.  Give.  Help someone.  Always ALWAYS pay back it's YOUR integrity you maintain.  I still pay back, this just gives me another venue with a pretty decent reach."}, {"author_name": "Can Aydoğan", "gravatar_hash": "54a02fc17220db8ca17187d69a628c7d", "author_url": "http://www.canaydogan.net", "date": "Sep 19, 2013", "message": "When I search an error or anything about the programming on Google, if I see a StackOverflow link in the result, directly I click that link. Because, I know that there is the best answer within it.\n\nThanks StackOverflow and Users of StackOverflow."}, {"author_name": "Primoz Rome", "gravatar_hash": "5ed652b2c91d2b19c3fda5eecd100a21", "author_url": null, "date": "Sep 19, 2013", "message": "I say StackOverflow is single most useful tool for a programmer. You guys rock!"}, {"author_name": "Bib", "gravatar_hash": "988ac96485ac577f0427429ea6d1eb81", "author_url": null, "date": "Sep 19, 2013", "message": "I started on DIY and was struck by the kind and caring approach by the experts, even when the question was confused, too basic or sounded like someone who needed to go out an hire an in-person expert. \n\nThen I got seduced into ELU (wasn't everyone an English major?). For some perverse reason, I care how the folks on ELU treated the people who came seeking wisdom. Where was the DIY geniality? The ELL site grew out of the need for a kinder, gentler home for newbies. But, for some reason, I care that ELU continues to try to do what SE strives for - good answers and good attitude. Something makes me want to stay and make it better."}, {"author_name": "Minimus", "gravatar_hash": "dce66d0faa7f0fad9cb20dcf8bda7194", "author_url": null, "date": "Sep 19, 2013", "message": "SE is good. and will be better if [on-hold] becomes just a does not prevents others to answer."}, {"author_name": "Lexi", "gravatar_hash": "df470ef810fd94633b2e20df3e85c78c", "author_url": "http://cloudmusicstorage.org", "date": "Sep 19, 2013", "message": "Kudos to you and the team on realizing your vision.  I'm very thankful for StackOverflow and how it has helped our team and how we collaborate, learn and share.  Thanks for all you have done and will do!"}, {"author_name": "Avery", "gravatar_hash": "fc56438e3224a5179adbe317752aed12", "author_url": null, "date": "Sep 19, 2013", "message": "StackOverflow seems to reward users so well that one respondent wrote a piece of software SPECIFICALLY to solve my problem:\n\nhttp://stackoverflow.com/questions/7412462/using-os-9-resource-fork-fonts-in-css-with-font-face/7418915#7418915"}, {"author_name": "dm03514", "gravatar_hash": "0f9d5953607841d6a50b843a1107e51e", "author_url": null, "date": "Sep 19, 2013", "message": "SO has given me something to do on friday nights"}, {"author_name": "Alex", "gravatar_hash": "106c9154a2701872a043c3644055ee1f", "author_url": null, "date": "Sep 19, 2013", "message": "Stack Overflow, and the amazing users that make up the site, are literally the primary reason I'm a developer today. I've never gone to school for development, due to a failure to plan properly on my part- but, thanks to Stack Overflow, I'm now working professionally as a developer."}, {"author_name": "Chris Gerken", "gravatar_hash": "b955899202a06e8c2e350212e351c031", "author_url": null, "date": "Sep 19, 2013", "message": "Do I get any rep for posting here?"}, {"author_name": "dayad", "gravatar_hash": "9c6b8867a16a770296f61c66fad818e2", "author_url": null, "date": "Sep 19, 2013", "message": "Thank you guys\nbest regards from Indonesia"}, {"author_name": "Daniel Gimenez", "gravatar_hash": "208cc48458f7afeb5f9f6d3801686b07", "author_url": "http://daniel.gimenez.biz/", "date": "Sep 19, 2013", "message": "I really like solving the puzzle questions.  The really hard ones get me to research topics that a knew little to nothing about before.  It's wonderful that helping somebody else is the best way for me to learn."}, {"author_name": "Alexander", "gravatar_hash": "5f41902f2a4eb5124e30c4519490a5cd", "author_url": "http://xandercoded.com", "date": "Sep 19, 2013", "message": "Shout out to the brilliant creators and the dev team at SO. They've managed to create an indispensable tool that has undoubtedly helped millions of developers."}, {"author_name": "Anupam Maurya", "gravatar_hash": "1f35c4724194a7afab52365419adba08", "author_url": null, "date": "Sep 19, 2013", "message": "It was 3 years ago, when I joined stackoverflow. It was my first job and that too at a start-up. There were too much responsibilities and a limited people to help and guide. After 3 years I consider myself successful and Stackoverflow has made me what I am today."}, {"author_name": "ASP", "gravatar_hash": "2680a8dcde3fa789cc09fdfda1000eac", "author_url": "http://aspandroid.blogspot.in", "date": "Sep 19, 2013", "message": "SO made me a great programmer within a short time.....Thank you so much!!.......Happy to help and get help!!"}, {"author_name": "Mohit Verma", "gravatar_hash": "5caee4643cea504ebdac6817386513dd", "author_url": "http://ruleofandroid.blogspot.in", "date": "Sep 19, 2013", "message": "It is a very useful site for developers...."}, {"author_name": "x", "gravatar_hash": "550256aaed8726e7c912cded7e7a96b8", "author_url": null, "date": "Sep 19, 2013", "message": "the best thing is you dont need an account to post on the sites."}, {"author_name": "Alex Essilfie", "gravatar_hash": "1719392531c762e6f4f09a254850997f", "author_url": null, "date": "Sep 19, 2013", "message": "I do not remember the circumstances of my first encounter with StackOverflow but it certainly was during the time I was learning C# after so many years of C# somewhere in 2009.  \n\nMost probably, I clicked on the link to a question on StackOverflow somewhere at in the middle (read as close to the bottom) of my Google search results. Yes! StackOverflow was not ranked as highly as it is now in search results. I believe after reading a couple of answers which helped me out of a pinch, I came across [this question](http://stackoverflow.com/q/953704/117870) which had an answer quite different from the acceptable/standard procedure. I put my answer in there and was gone for six months when my visits began getting kind of regular and I got my second badge which, rather sadly, was a tubleweed badge.\n\nI asked a couple of questions and answered a few. It had to take an [unexpected bounty](http://stackoverflow.com/a/3311975/117870) to bring the site into my focus. Ever since, the name of the site is not on only bookmarked on all my browsers, it is etched firmly in my memory!\n\nMy contribution to this site has reduced now to editing questions and answers mainly but whenever possible I do make time to answer questions. After all, there is no better way of learning than by teaching. :)\n\nI would like to thank the wonderful people who created this site and the whole Stack Exchange group of sites for the wonderful work done. Kudos to the moderators who in their own small ways keep the site clean. And not least, I greatly appreciate the contributions of people like Eric Lippert, Jon Skeet, Mark Gravell and Hans Passant whose in-depth answers (and sometimes questions) give us the underlings a lot to aspire to.\n\nLet's keep up the good work! See you when we're 10 years old and still contributing meaningfully to programmers' activities!"}, {"author_name": "Neil Townsend", "gravatar_hash": "f858eb900600bff8754213112e14e049", "author_url": null, "date": "Sep 20, 2013", "message": "For me, the greatest thing about StackOVerflow isn't the quite remarkable collection of shared knowledge. It's the welcoming atmosphere, the encouraging comments and the willingness of the people who make it what it is to nurture new arrivals rather than to put them in their place. It's the only programming resource site I've been on where I've thought - cool, can I hang out with these guys. You've taken the \"we're all in this together\" attitude of a great programming team and made it real, for 44 million people, on the internet. Many thanks."}, {"author_name": "Animal", "gravatar_hash": "f2640341cf91bdc2bc089ebf6828d7cf", "author_url": null, "date": "Sep 20, 2013", "message": "I learnt the importance of asking good questions thanks to StackOverflow. As a direct result when I formulate a question, I often find myself answering it before I can post it! \n\nThanks!"}, {"author_name": "Berker", "gravatar_hash": "41c5be1a7d215a7a617a3e32973fb983", "author_url": null, "date": "Sep 20, 2013", "message": "StackOverflow is a great place to learn, gets people together, starts a brainstorm and solves the problem with a warm welcoming face. Besides all these, it creates a community of great knowledge. Raising more educated, more wise people everyday which creates a better future for everyone. AND IT HAS GEMIFICATION! (lol)\n\nThanks StackOverflow for encouraging people to be better."}, {"author_name": "Alexey Ivanov", "gravatar_hash": "61be9e84ecbc35d0219713fe8807a07c", "author_url": "http://alexyv.wordpress.com/", "date": "Sep 20, 2013", "message": "I came to Stack Overflow from Google while I was trying to solve a problem. I liked it. I looked around and found questions which I can answer. Then I decided to go ahead and answer them. Why not help other people?"}, {"author_name": "Saikat Sengupta", "gravatar_hash": "88083dbb65c6e2e0ae59b589d026142a", "author_url": "http://none", "date": "Sep 20, 2013", "message": "I came to Stack Overflow luck by chance because it is always on the first page of Google search results and  never looked back :)\n\nIt's a beauty and pride of internet! Thanks a lot is not sufficient for you :D"}, {"author_name": "Swaps", "gravatar_hash": "d05e2004cfa727ee560891cff9d688ab", "author_url": null, "date": "Sep 20, 2013", "message": "Hi guys, \n\nCongratulations to My best companion Stackoverflow on this great success. Stackoverflow filled confidence in me when I was a new to programming. It helps me a lot. Thank you so much."}, {"author_name": "Ahmed Nawaz", "gravatar_hash": "d4f350cc7355ac999fe261c1f61e8f46", "author_url": "http://www.anawaz.com/", "date": "Sep 20, 2013", "message": "StackVverflow is solving my Problems and Making me more Profectional Developer. Thanks. :)"}, {"author_name": "Manoj", "gravatar_hash": "c815bddc1d4184def5ea64b41d713602", "author_url": null, "date": "Sep 20, 2013", "message": "This is a great milestone which need to be applauded.\n\nStackoverflow has always been my first click in Google results. On clicking it my instinct says \"God! the problem solved\". More than just providing solutions, it has also made me to search and learn through out my 4 years carrier. \n\nIt always has shown me that I have lot yet to learn.\n\nThanks Guys!!"}, {"author_name": "nidasahar", "gravatar_hash": "4f76bc1f500f3a300c8ad791ed73c4cd", "author_url": null, "date": "Sep 20, 2013", "message": "Stackoverflow is Programmers Heaven... I have learnt to Help others and seek almost instant help... Its been a wonderful experience being a regular user... though i have been religiously using it for about a year now..."}, {"author_name": "MaSche", "gravatar_hash": "48d04666ba45a7c69cd975a100b6b979", "author_url": null, "date": "Sep 20, 2013", "message": "Thank you Stackoverflow! Thank you all Users!\nI don't know if I ever were able to accomplish many of the tasks during universty and work without you.\nThere is so much knowledge at a single point, that I can say: \"If a problem can't be solved by Stackoverflow, then there exists no solution for it\"."}, {"author_name": "devtools.korzh.com", "gravatar_hash": "3471f7064434991a2a166583da19d59b", "author_url": "http://devtools.korzh.com/", "date": "Sep 20, 2013", "message": "Thank you for amazing info. Good read!"}, {"author_name": "Abdullah Bakhach", "gravatar_hash": "209015517962ecc597f62380b9e27128", "author_url": "http://lb.linkedin.com/pub/abdullah-bakhach/7/78a/b71", "date": "Sep 20, 2013", "message": "i summarized my story in this fresh blog post: http://blog.piotry.me/post/61595140847/how-to-get-help-from-the-best-engineers-in-the-world"}, {"author_name": "Vishal", "gravatar_hash": "39b40cdf185dfffce2fcb7bec2c9ff5f", "author_url": null, "date": "Sep 20, 2013", "message": "in only few lines , I was a symbian geek and wanted to learn iOS to switch, I learned entire iOS programming on StackOverflow. Thanks a tons."}, {"author_name": "sangram", "gravatar_hash": "8b1ede6af25ba5ff3a45be783b71940e", "author_url": "http://sangramsanand.wordpress.com", "date": "Sep 20, 2013", "message": "Stackoverflow has helped me in polishing my technical skills &amp; my writing skills.  Its the best place to get answers and discuss on any development subject. \n\nIts amazing tags concept, rating, questions type ranking etc.,  WOW! i can hardly imagine my development career without stackoverflow."}, {"author_name": "Jannie Theunissen", "gravatar_hash": "83617a59af228e03f7e7783d3b6a5230", "author_url": null, "date": "Sep 20, 2013", "message": "From the first day I discovered stackoverflow, something strange happened. I can't stand any of the other sites out there that aim to provide help for coders. They may have great communities, but it is the SO system that brings out the full potential of a community and really makes it sparkle. I solute you!"}, {"author_name": "Sumit Munot", "gravatar_hash": "864a0994defd590d11fcfbfdb995e7ce", "author_url": "http://45952458", "date": "Sep 20, 2013", "message": "Thank you Stack Overflow. \n\nAll sites are hub for learning and helping to all our friends. \n\nIt makes our life more easy and beautifull."}, {"author_name": "matzone", "gravatar_hash": "5f51c323995739bd4ed68d90b2ba14d0", "author_url": null, "date": "Sep 20, 2013", "message": "Started by stupid question ..\nThen StackOverflow always give me good directions ..\nStackOverflow full of Great Programmers .. Thanx for all of you guys !!\n\nGreat .. great .. great .. StackOverflow"}, {"author_name": "Gonzalo Contento", "gravatar_hash": "ae7f7d80cbad84736ed3dc245d4c0d67", "author_url": "http://conten.to", "date": "Sep 20, 2013", "message": "StackOverflow it!\nI used to \"google\" my programming questions but I've recently started to go straight to StackOverflow for answers. Not sure if we already use stackoverflow as a verb but everyday someone in my team refers to StackOverflow as the source for some technical discussion.\n\nThank you StackOverflow! you made easier to find answers regardless whether the question is basic or advanced and also regardless whether the answer comes from an unknown programmer like me or a well known guru like Jon Skeet."}, {"author_name": "Alex", "gravatar_hash": "615f9f2ee4eb53e09c8588e9809b504f", "author_url": "http://stackoverflow.com/users/1887723/alex", "date": "Sep 20, 2013", "message": "I learned an incredible amount of stuff after just 9 months of being signed up here. It has helped me modify so many things at work and prove to my colleagues that StackOverFlow should be a MUST as a programming tool. Why? Because when they couldn't figure it out, I did - thanks to you guys!"}, {"author_name": "Mark", "gravatar_hash": "9a44e41049ef5ca15f0b1b559d8bf845", "author_url": null, "date": "Sep 20, 2013", "message": "It teaches me how to focus on \"learning on your own\" by down-votes, sadly(for me) but true."}, {"author_name": "Amine Hajyoussef", "gravatar_hash": "f3c92ba769a8bc3a16d129f0f8fd96f5", "author_url": "http://www.aminehajyoussef.com", "date": "Sep 20, 2013", "message": "Stackoverflow is really an overflow of information.\nI like the fact that i'm browsing stackoverflow as a news website: I check it frequently for something new to read.\nThank you."}, {"author_name": "birdy", "gravatar_hash": "42b17a566024c8bae656b4c4b24dddd2", "author_url": null, "date": "Sep 20, 2013", "message": "\"Stack Overflow officially launched on September 15, 2008\"\n\nOh! I cannot imagine how it was like without SO ;)\n\nLong Live SO! All the best!"}, {"author_name": "Darren Davies", "gravatar_hash": "e29ee4c699334b4f38a856ad3b001653", "author_url": "http://ddavies.blog.com", "date": "Sep 20, 2013", "message": "Before the site existed I was a junior developer with a thirst for knowledge, I always had plenty of questions to ask senior members of the team and gain as much as I can day to day. I thank them for the guidance they have provided and what they have taught me over the years. \n\nWhen I first joined StackOverflow my aim was to contribute the knowledge I had learned from industry into the site. Upon answering a few questions I started to gain reputation and badges which kept me interested, it intrigued me further to what else I could achieve.  I quickly realised the site was not only a place to go where I could answer other peoples questions but a place I could learn from others in the community. From new programmers to I.T. Professionals I could quickly see how others approached problems and designed software. More importantly, the technology tools I use day to day, all of the books I have read, these people are here and contributing to the site! This has provided me with an opportunity to collaborate, learn and compete with these people.\n\nI have gained so much from the site and it has helped me in numerous of ways, professionally and academically. I have learned about new technologies, alternative ways to solve problems, the latest tools and techniques.  It has also increased work productivity, professional accreditation and provided job opportunities.   I hope that my contribution to StackOverflow has helped others and inspired other people to contribute to the site. Thank you"}, {"author_name": "Aaron Anodide", "gravatar_hash": "5fdd01ac41da8149b2b429c10c66a1f2", "author_url": null, "date": "Sep 20, 2013", "message": "A couple of years ago when I discovered SO, I was starting at a job as the sole developer.  The answers I got (and the speed at which I was able to find it) saved me from failure. Now I'm moving on to a better job and I'm more excited about programming than ever.\n\nThanks SO!"}, {"author_name": "Cary Swoveland", "gravatar_hash": "87b71ecb90417c88f7873a2f0f9492e9", "author_url": null, "date": "Sep 20, 2013", "message": "Before SO I was shy and retiring.  Now I have an ego that's a mile wide."}, {"author_name": "Joshua", "gravatar_hash": "98e5fdbed6fc1fc0783425db02304a1e", "author_url": null, "date": "Sep 20, 2013", "message": "Feel sorry for SO.\nSO saved me lot of time. \nBut I got paid for that. \nSO saved the day so many times. \nBut I got all the credits. \nGood Job SO."}, {"author_name": "Dave Zych", "gravatar_hash": "499605b887254f196fddfa8cff22233b", "author_url": "http://davidzych.com", "date": "Sep 20, 2013", "message": "I first found Stack Overflow by searching Google for help on an issue (which is probably how 99% of people find it.) I keep coming back for tw o reasons: To help people, but also to learn. I have learned more from reading answers on SO than I have from books, Pluralsight, blogs, etc etc. I'm always amazed at the wealth of knowledge here and hope that I can continue to contribute to it and learn from it."}, {"author_name": "Gopi Krishnan", "gravatar_hash": "058b338a6d948bfc7191705243790479", "author_url": "http://gkrishnan.com", "date": "Sep 20, 2013", "message": "You guys are awesome! Thanks for building something so profound that people cannot imagine going back to programming with out StackOverflow. I have learnt so much from this site and love contributing whatever I can to make it better."}, {"author_name": "Jesse Stevens Black", "gravatar_hash": "ab6389acaa2c5d3d0abe69a5df8b949f", "author_url": "http://jessestevensblack.blogspot.com", "date": "Sep 20, 2013", "message": "I joined Stack Overflow in November (maybe October) 2011. I guess I had been googling error messages for 18 months prior to that and I watched StackOverflow rise to the top of search results. Over time, I realized how helpful StackOverflow was in getting me out of sticky situations. It takes a lot longer to reread documentation to figure out what you misinterpreted/are doing wrong than it does to find someone already went through the same struggle as you and the problem/solution is well documented on StackOverflow.\n\nI really started to appreciate StackOverflow and joined with the desire to give back. I was a lone coder when I joined StackOverflow. StackOverflow was the first venue that other people started to see my code through. The community can be a little harsh to a newcomer, but they are usually assuring quality and the goals of the site. This made me a lot more aware of the quality and clarity of my questions, answers, code, and general communication. I answer a lot more questions than I ask on the site. I have plenty of questions, but there is usually a great solution on SO before I get to the point of asking a question.\n\nI tell a story of how I my career path landed in Software Development. I attribute it both to a natural appreciation of math and logic, and to one man that took the time to tell me what he loved about computers. He sparked an interest in programming and making stuff work that took a little while to build momentum, but hasn't stopped since. (The story is at http://jessestevensblack.blogspot.com/)\n\nI look forward to maturing and finding other StackExchange sites (potentially nonexistent) that cover my ever growing interest.\n\nThanks StackExchange"}, {"author_name": "Rahmathullah M Pulikkal", "gravatar_hash": "d131728be6430b603b89e055198bcf40", "author_url": null, "date": "Sep 20, 2013", "message": "SO taught me lot of things, not just technical. more over how to be formal, to ask questions, to ask help.\n\nSO gave me the confidence to try out any new stuff in IT. Whenever Im stuck on anything, SO used to have answers.\n\nThanks a million, SO. &lt;3"}, {"author_name": "Bogdan Kravtsov", "gravatar_hash": "da9d6f80c40e1362005f46bccd6f5c4f", "author_url": null, "date": "Sep 20, 2013", "message": "StackOverflow made my evolution as a programmer and a developer possible.  Nowhere else can I find the right answers to my problems/questions of such high quality and at such an incredible response rate.  I start projects without worrying if something can be accomplished, because I got a team of thousands of other programmers to help me through it."}, {"author_name": "sambasivarao", "gravatar_hash": "240332ae066d42923d72923dfb331ed7", "author_url": null, "date": "Sep 21, 2013", "message": "It helps me a lot.It is a friend to all developers."}, {"author_name": "Sriharsha Kalluru", "gravatar_hash": "5f3a3bca5f5c6a94c7d97c3b4c528b3e", "author_url": null, "date": "Sep 21, 2013", "message": "It is certainly and definitely very good blog to get the help and also to make the help.\n\nOn this occasion I want to thank each and every one who helped me.\n\nMy special Thanks to Stackoverflow."}, {"author_name": "Steven McBeaven", "gravatar_hash": "3de6cd634136235ddcdb1f073a3b1397", "author_url": null, "date": "Sep 21, 2013", "message": "I joined the site almost 3 years ago. At that time I hardly knew HTML. Immediately, I knew this was a great place. Everyone was here to help each other, and I was not ridiculed for my lack of knowledge. StackOverflow helped me through php, mysql, node.js, python, ruby, html, css, javascript, jquery, rails, django, C, objective C, c#, and many other languages. Now I am a web developer thanks to the help of Stackoverflow. I certainly wouldn't be where I am right now if it was not for stack.\n\nA special thanks to everyone that has helped me personally, and everyone keeping the community alive."}, {"author_name": "Tuvako", "gravatar_hash": "fff07d2c10373f17fa5ddc389d8e7633", "author_url": null, "date": "Sep 21, 2013", "message": "This site has helped me solve and find solution to many of my problems...\nI may say that,Without Stackoverflow,I think Life would be a little harder..\n\nThanks Stackoverflow and all for making me and others better developers"}, {"author_name": "NormalUser", "gravatar_hash": "322eeef12d6606c5eb473472a91c1c55", "author_url": null, "date": "Sep 21, 2013", "message": "stackoverflow is awesome! thanks for all :)"}, {"author_name": "paulb", "gravatar_hash": "192f1428e1d78939091af6e904e1bd03", "author_url": null, "date": "Sep 21, 2013", "message": "When I Google a coding problem, the first hits I select are those at stackoverflow. For two major reasons that set SO apart from the wanna be:\n1. When people answer the Q's, they are right 99% of the time\n2. Because of the syntax highlighting, it easier to understand the code at SO than other websites."}, {"author_name": "Shanmugavel", "gravatar_hash": "d0d40777c846d215ae44acc26ba138a8", "author_url": null, "date": "Sep 21, 2013", "message": "StackOverflow, gives top output when searched in top search engines in my experience, I have been used more than 4 years of my total experience.\n\nThanks a lot to StackOverflow, which is my Professional Life partner."}, {"author_name": "Preethi ravi", "gravatar_hash": "aadd191d3de48c757bffba5837358c01", "author_url": null, "date": "Sep 21, 2013", "message": "StackOverflow, When i'm new to PHP i use to google for a coding problem,the site stackoverflow will gave a good solution for my lot of issues i have faced.The answer'ed people will be 99% correctly and thanks for all.\nThanks a lot to StackOverflow."}, {"author_name": "Anirudh", "gravatar_hash": "b3472563e3bae9cb4263788dda8b3346", "author_url": "http://aniketsweblog.blogspot.in", "date": "Sep 21, 2013", "message": "I joined stackoverflow over a year ago, I learned so much one can only multiply the effects over 5 years and 100 sites, keep going guys.\nCongrats"}, {"author_name": "Nicholas", "gravatar_hash": "c2556570df65c0bbcf482d6d285bc56d", "author_url": null, "date": "Sep 21, 2013", "message": "I work alone and as a new developer SO has been amazing in my personal development. I don't think I would be where I am today with out it..."}, {"author_name": "Darick", "gravatar_hash": "583a5991912fcc760caab72c1318371a", "author_url": null, "date": "Sep 21, 2013", "message": "A programmers best friend. keep it up Stackoverflow."}, {"author_name": "hacktohell", "gravatar_hash": "9d99bca757765b04e79e37bf74c01673", "author_url": "http://hacktohell.org", "date": "Sep 21, 2013", "message": "I  met some awesome like minded people at Stack Chat !"}, {"author_name": "Eric Nguyen", "gravatar_hash": "41f1e327f8dc910c682ad67c5348988c", "author_url": null, "date": "Sep 21, 2013", "message": "Bonne anniversaire!\nThank you StackOverflow and other StackExchange sites!\n\nI started using StackOverflow in 2008 but I was a completely lazy ass back then.\n\nI only started using StackOverflow properly since I started working 2 years ago. It has been a real miracle since. Besides the great deal of technological knowledge, \"fake\" humble reputation that I gained, you changed me as a person - I learnt to ask questions, god damn good one and sometimes, give good answer.\n\nI've been checking StackOverflow more or less as often as Facebook recently. Hopefully, nothing is wrong with me :D\n\nI know nothing lasts forever I really do believe the legend of StackOverflow can go on forever.\n\nCheers!"}, {"author_name": "Subin Siby", "gravatar_hash": "6e0e30be6b435d34fbcdbf05b97068c3", "author_url": "http://sag-3.blogspot.com", "date": "Sep 21, 2013", "message": "StackOverflow made me a good programmer and increased my knowledge in programming. Thank you StackOverflow team for making this site. Love you all. :-) :D"}, {"author_name": "Alberto Restifo", "gravatar_hash": "f44f1f43094a89a47291c2add1ec815e", "author_url": "http://albertorestifo.com", "date": "Sep 21, 2013", "message": "If you correctly right the question, there will always be a quick solution to it!\n\nStackOverflow really saved me from a headache many times!"}, {"author_name": "Jitendra Kumar Sahoo", "gravatar_hash": "982963fd078c37ef95ea9fe769426030", "author_url": "http://www.mercenie.com", "date": "Sep 21, 2013", "message": "Congratulation to all stack overflow member for successfully complete of 5 year. I love it because it make me a programmer, developer, designer almost every i know about coding. Thanks a lot."}, {"author_name": "Neal McBurnett", "gravatar_hash": "1164f40c4e4366ed062dc95b3de03b28", "author_url": "http://neal.mcburnett.org/", "date": "Sep 21, 2013", "message": "First - congratulations and thank you.  Stackexchange is a great force for good in the world.\n\nCan you clarify your statement that \"Those answers are seen by forty-four million people looking for help each month.\"\n\nOf course identifying unique people is a tricky thing, especially for a site that allows anonymous viewing.  How did you arrive at this statistic, and weed out robots, duplicates due to people not using cookies, etc.?\n\nHow many page views do you have?"}, {"author_name": "David", "gravatar_hash": "67747c10effa58d5fe05635de1a5ba6d", "author_url": null, "date": "Sep 21, 2013", "message": "To me one reason why StackOverflow is an excellent website is its fantastic efficiency regarding design and usability as well as the user content management and rules which additionally ensure efficient communication. This website didn't just solve a problem, it did it in a nearly perfect way, so that there were merely any obstacles to its success."}, {"author_name": "Shashwat Tripathi", "gravatar_hash": "6e4e67164229b60341a501962e25dcbc", "author_url": "http://www.myignou.com", "date": "Sep 21, 2013", "message": "As a learner, stackoverflow has always been there whenever I was in need of help.\n\nIt is my favorite programming forum"}, {"author_name": "Teddi", "gravatar_hash": "a917d026cad8412ec41b43c11263c056", "author_url": null, "date": "Sep 21, 2013", "message": "SO taught me exactly how much I DON'T know... I routinely end up here several times a day. Especially if I'm working on something new, like drupal (uuuuuugh lol). thanks guys! you rock!"}, {"author_name": "Darmen", "gravatar_hash": "2a7ee386e55303f049651d0318202f6f", "author_url": "http://www.darmen.kz", "date": "Sep 22, 2013", "message": "StackExchange is my best source of knowledge. Thank you so much!"}, {"author_name": "Fidel", "gravatar_hash": "46796680f7b9efc1e7b3e2678a8ecee8", "author_url": null, "date": "Sep 22, 2013", "message": "Stackoverflow is the greatest thing to have happened to developers since the IDE."}, {"author_name": "Faddel", "gravatar_hash": "c55ade4e4d53c599a2cefed020fa9e6e", "author_url": null, "date": "Sep 22, 2013", "message": "simply I love it\nThanks you"}, {"author_name": "Lijo", "gravatar_hash": "99d8ecc0da4fe6376914202f2a460814", "author_url": null, "date": "Sep 22, 2013", "message": "When I planning to join a different company the first thing I look for is - whether google is accessible from the company network. The second thing I would look for is - stackoverflow.com. It has helped to improve the way I code."}, {"author_name": "JET", "gravatar_hash": "c6b383ba85faaf8e221c29cefb146f0f", "author_url": null, "date": "Sep 22, 2013", "message": "You've created a platform where people like to get answers and answer anothers questions and ENJOY HELPING EACH OTHER. \nIt's a great web-site, and every time I encounter an error which I can't fix, the first idea is to enter StackOverflow or SuperUser. \nThanks people, keep it going!"}, {"author_name": "Minimus", "gravatar_hash": "dce66d0faa7f0fad9cb20dcf8bda7194", "author_url": null, "date": "Sep 22, 2013", "message": "Add a feature that can save favorites answers and questions. useful when account merged or deleted."}, {"author_name": "09Apps", "gravatar_hash": "917686f790b983c67a901b528cb815ad", "author_url": "http://www.09apps.com", "date": "Sep 22, 2013", "message": "Thank you stack overflow and the people who make it such a thriving place. StackOverflow has a major share of what I learned about iPhone programming"}, {"author_name": "Jamil Hneini", "gravatar_hash": "4843b2cb6a0bfe57dfd09bc4cae9b976", "author_url": null, "date": "Sep 22, 2013", "message": "When A problem occured in your code stackoverflowit"}, {"author_name": "Ropps Jordan", "gravatar_hash": "cfd59fd29f77b692c764dd7e5b836124", "author_url": "http://robgordon.info", "date": "Sep 22, 2013", "message": "Thanks Stack!"}, {"author_name": "Yash", "gravatar_hash": "5b04126576c62178fec31d3adb92d11b", "author_url": "http://yashx1.github.io/", "date": "Sep 22, 2013", "message": "you are like my mom, whenever i am in trouble you are there to help, whenever i can't find my things you know where i will find it. i share everything with you my knowledge, my fun, my achievements. Thanks stack."}, {"author_name": "pacomet", "gravatar_hash": "de2d8008817e491e49807c5e93777bb2", "author_url": null, "date": "Sep 22, 2013", "message": "Stack Overflow saved my life a lot of times. Thank you very much to all that helpful guys over there. Never search Google before SO. YOU'RE GREAT."}, {"author_name": "William Sanville", "gravatar_hash": "7c7806074bb0df83fb8ceab7e57da59a", "author_url": null, "date": "Sep 22, 2013", "message": "As someone who mostly answers questions on Stack Overflow, I've found that it has greatly improved my written communication skills.\n\nIt trained me to communicate things in the shortest, clearest way possible. Sometimes it's not exactly easy to explain complicated technical concepts. But, when you can boil down something into just a few short sentences that really helps people understand, it's really cool.\n\nI've also learned a TON about programming from the top users of this site, just by reading their answers. I'm absolutely grateful for having such an awesome resource.\n\nOh, and I've found my last two jobs based off Stack Overflow, so thanks for that :)"}, {"author_name": "Daren Scot Wilson", "gravatar_hash": "fd1301ecedc02a1eb4b818c8d9018c36", "author_url": "http://www.darenscotwilson.com", "date": "Sep 22, 2013", "message": "One fine day at Barnes &amp; Noble I was browing the software section and saw Joel on Software.  Hey, he's a good writer, I thought. So I found his website and became an addict to his blog.  \n\nAnother fine day, I was thinking about major software disasters - Denver airport, FBI case management, Arianne, etc - and remembered the amusing \"Coding Horror\" graphic in Steve McConnell's book.  Googled for \"coding horror\" and found Jeff's site, and became and addict to that blog.\n\nThen, on yet another fine day, read the announcement on one or the others' site that Joel and Jeff were going to collaborate on something that will revolutionize Q&amp;A or whatever the hype was.  Then one day, it was unleashed: StackOverflow.  I like it, but couldn't do much with zero points, so started answering a few questions.  \n\nSO has saved me time and trouble several times.  I believe my answers have saved others time and trouble.  At least, I haven't received any death threats for being evil.  A few answers that received negative scores, I have deleted.  \n\nIt's fun to rack up points, but more than that, I love having a feedback system allowing me to improve my answers, help others improve theirs, and to sort the best to the top.  Now all forums, Q&amp;A, user-supplied content sites in all subject areas now seem lame, crude if they don't have some sort of upvote/downvote mechanism.\n\nAs others have mentioned, a general Google search or DuckDuckGo search will often lead straight to a SO/SE question, so what the heck, might as well just fire up a browser and go to SO at the start of every day."}, {"author_name": "rajeev panigrahi", "gravatar_hash": "ed340182cbd1b72e4ec26b90549b324f", "author_url": null, "date": "Sep 22, 2013", "message": "It is about one month I am using stackoverflow .............I think ,it is the best site which make a programmer to clarify all his doubts and make him a better programmer."}, {"author_name": "Sanjay Chauhan", "gravatar_hash": "38ea4f6d0e1e09a34948afc5456c0f6c", "author_url": null, "date": "Sep 22, 2013", "message": "Stack Overflow is another Google (God of Knowledge) for me.\nIt helped me a lot in the beginning of my technology exposure, though it helps today as well.\nWish you a great success ahead..\n\n\"Stack Overflow\"\nWe love you..\n\nCheers"}, {"author_name": "pankaj kabra", "gravatar_hash": "00935bc24a7b4c138eaedbe45ba94ef8", "author_url": null, "date": "Sep 22, 2013", "message": "Always been helpful to me."}, {"author_name": "Shantanu Oak", "gravatar_hash": "7064369714bbb01ca2e42c699f95d60d", "author_url": "http://oksoft.antville.org", "date": "Sep 23, 2013", "message": "I used to use unix.com to ask my questions about sed / awk commands while I was new to Linux world. One of the senior forum members there told me that this is not a Pizza delivery center where you can simply ask for something! So the old way of helping others was pretty rigid and to some extend obligatory.\n\nhttp://www.unix.com/unix-dummies-questions-answers/82792-recently-updated-files.html\n\nWhat stack overflow did was that it turned this \"superiority complex model\" of helping others upside down. Suddenly experts were falling on each other to help newbies and trying to earn points in the process. This new currency needed to be \"earned\" and there was no way to simply buy the points like any other currency. So it became a valuable asset.\n\nSo much thinking has gone into stackoverflow that I can not even start evaluating it. If you have used and understood wikipedia, I can say it is very close (culturally)."}, {"author_name": "Harman Preet Singh", "gravatar_hash": "0198653eba7359cfad55364aa78a1ade", "author_url": null, "date": "Sep 23, 2013", "message": "I think this is that platform where all information is available for all of world. That person who have the more understanding then its  responsiblity towards the others in the form of guidance &amp; better way of life living\n\nNice efforts to shape the society where Human-Human relationship will be enriched. \n\nThanks Stack overflow team."}, {"author_name": "Madhuri", "gravatar_hash": "646057b5ed133ea34fb7feb44c52e65d", "author_url": null, "date": "Sep 23, 2013", "message": "Stackoverflow is a platform for ppl who have the thirst for programming and learning out of the mistakes. It has helped me in many ways of programming. Keep up the good work \"Stackoverflow- team\".\n\n\nThank you, Team."}, {"author_name": "Lelala", "gravatar_hash": "1c2b3f4c764429281f441d617945ac89", "author_url": "http://www.lelala.ch", "date": "Sep 23, 2013", "message": "SE, especially SO, has been helpful to our team in many ways: Either finding answers or helping others to find answers - plus bonus: Your team gets educated on the job while having fun helping others.\nWhenever i start typing in google with \"how to\", Stackoverflow is on the top sites that are in my viewport :-)\nRegards"}, {"author_name": "Arpit Awasthi", "gravatar_hash": "c3eca22bd5476931e4768dea076bd4ce", "author_url": null, "date": "Sep 23, 2013", "message": "OOh, What to say, you guys are my hero, it's been 2 and the half years since I am here and and I have always felt blessed to be part if the community. And of course felt proud about that. \n\nOn a very normal morning of my beginning of iOS development, I found my application was not running any more, and as I had no any theoretical exposure I was not aware of what is that? It was some `invalid argument exception`, when i was trying to execute some code having sqlite query. And this happened to me after 23 days of joining my first Job I was still a trainee and iOS development was an alien concept i was trying to catch up with. And those old crash log of Xcode, were like nightmare to me at those days.\n\nWell I came up with this poor question http://stackoverflow.com/questions/5321593/please-tell-me-what-is-exception-in-this-code and http://stackoverflow.com/users/631629/7kv7 and http://stackoverflow.com/users/22927/steven-fisher came up with solutions and suggestions. That day I stared to believe I am not lonely If am stuck with something, while coding there's is a community and I am proud member of that they who will be there if I found no hope to get out of dark(or semi dark) tunnel of troubles. \n\nThis believe of mine kept been stronger and stronger, year after year. I am really very thankful, to all of you for being there. I thank Stack overflow and all websites of stack exchange for getting solutions more easier than ever, and of-course assuring the quality in  very prominent way! Thanks to every one on network who have ever asked a question,  responded, flagged, up-voted down-voted, edited, reviewed, coded, handled server or been involved in any of the ways. Thanks A-LOT!939"}, {"author_name": "Bob Jarvis", "gravatar_hash": "dde6276eccc198c3dbaf0142ba25ea70", "author_url": null, "date": "Sep 23, 2013", "message": "Hey - it's been fun."}, {"author_name": "Udi Talias", "gravatar_hash": "838347acc4c97bfc938a2dac4043bd2a", "author_url": "http://udidu.blogspot.com", "date": "Sep 23, 2013", "message": "Mazal Tov!"}, {"author_name": "Vidar Vestnes", "gravatar_hash": "cb2473c09e96421ee0c00e954bb4e6b0", "author_url": "http://www.adpog.com", "date": "Sep 23, 2013", "message": "Reto Maier answered one of my Android questions!\n\nhttp://stackoverflow.com/questions/1109022/close-hide-the-android-soft-keyboard"}, {"author_name": "MikeyMouse", "gravatar_hash": "e3764ea9655bc364861f3d3eaf44d29a", "author_url": null, "date": "Sep 23, 2013", "message": "There's nothing worse than the feeling you're the only one in the world with a certain problem. Once quick check on StackOverflow makes this feeling go up in smoke (for programming issues anyway)"}, {"author_name": "Ninad(NJOY)", "gravatar_hash": "037d0fc5179917550d28a7af89d241c8", "author_url": "http://tech-villa.blogspot.com", "date": "Sep 24, 2013", "message": "It turned out to be people can do anything for these fake internet point. But these are more than just internet point it is there \"Reputation\" in this SO community. And this community is always there to help you out. they are always at your disposal in chat. I have found many friends/user in this short span of 3 years though we never met each other in real world. \n\nIt is like a home for a programmer at his workplace. I come here almost daily for last 3 years. Thanks for helping me out in being a better developer.\n\nkudos to you guys.\nNinad Madhav"}, {"author_name": "Kristin Haskins", "gravatar_hash": "22d5bd366a4a1e9d1019ee238b6948bb", "author_url": null, "date": "Sep 24, 2013", "message": "I'm just looking for  little ole' ME in the forty-four MILLION frogs...\nCould it be I've stumbled into the right place...at last?"}, {"author_name": "Ghosty", "gravatar_hash": "a4b2697322d35b48dd7c1198be67d9cc", "author_url": null, "date": "Sep 29, 2013", "message": "I've been a slobbering idiot for fantastic video games since I got my first gameboy when I was but a wee todd. I developed a burning, all-consuming desire to contribute to the gaming world with my own product, or at least be sated by making a personal project.\n\nHaving dyslexia, I thought I would never really learn to code, and I nearly went crazy when I kept getting stuck on simple newbie problems. Stack Overflow really really helped me see programming not as some hulking beast to defeat but a magical dragon to ride into the sunset. I'm a lot less intimidated by the subject of my passion now, and it's all thanks to the rapid and patient response of the users of this beautifully designed system. :3\n\nSO is an eye-opening place for a beginner, and offers support along the whole ride. I can't stress enough how useful and appreciated this is to me. Thank you so much for helping me not go insane! &lt;3"}, {"author_name": "John Doherty", "gravatar_hash": "f71237f309255196fbe75ae3914f7fd8", "author_url": "http://mammothworkwear.com", "date": "Oct 03, 2013", "message": "I remember the days when Code Project was the go to place. For me Stack Overflow basically refined that application, made it faster to find and extract information - hence its popularity.\n\nThere is a pattern here, think My Space -&gt; \"Facebook\"."}, {"author_name": "Raybarg", "gravatar_hash": "60e91a3c03abcd57473832fc849240e5", "author_url": null, "date": "Oct 08, 2013", "message": "Increasingly my problems encountered and seeking help from internet,  Stack Overflow is the place which provides solution.\n\nGoogle+Stack Overflow have become so important tool for my programming tasks for language references or finding how something is done properly.\n\nCurrently working on JS programming and using jslint to keep my code clean, Stack Overflow is the place with answers when putting jslint \"complaint\" in Google search.\n\nMaybe Stack Overflow own search tool would work just as fine, but use of Google is so well integrated in browsers."}, {"author_name": "Fadi (itoctopus)", "gravatar_hash": "0e0e9e24dbbc45b788b93a9b22ef7a3c", "author_url": "http://www.itoctopus.com", "date": "Oct 11, 2013", "message": "I think 4 things made stackoverflow successful:\n\n- The simple and intuitive design\n- Allowing people to answer questions without actually registering\n- The gamification of the system\n\nand, most importantly,\n\n- Controlling spam and grammar correction (spam and grammar mistakes are very negative SEO factors)\n\nSpam is a big issue on a Q&amp;A website (and I'm talking from a personal experience since we setup one a long time ago and then we closed it). I guess that at the start of the operation, you had about 10 full time staffers, who were there deleting spam comments or correcting incorrect grammar in question. At one point, of course, that task was pushed to top answerers who did it for free. That's my theory anyway.\n\nIt would be very interesting to know how you guys really handled spam and grammar mistakes at the beginning."}]}