{"response": [{"author_name": "Adrian", "gravatar_hash": "5a562698800b535e47b68590f63c402a", "author_url": "http://cogitation-rumination.blogspot.com/", "date": "Sep 03, 2013", "message": "Was the link \"a way to fix the problem\" intentionally left blank? Just trying to build up suspense?"}, {"author_name": "Victor", "gravatar_hash": "0fe271df0c9302db19f90f6961082cc3", "author_url": null, "date": "Sep 03, 2013", "message": "how can I subscribe to this podcast on iTunes?"}, {"author_name": "pnuts", "gravatar_hash": "f49dbeced705687b92e851736d48f208", "author_url": null, "date": "Sep 03, 2013", "message": "One of the images for the keyboard shows a number pad."}, {"author_name": "Isaac Moses", "gravatar_hash": "2bb572e05887045b95d99d8a5819eb14", "author_url": "http://mi.yodeya.com", "date": "Sep 03, 2013", "message": "According to [this answer](http://judaism.stackexchange.com/a/5089/2) on Mi Yodeya, Vegemite, the Australian equivalent of Marmite, is certified Kosher."}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://www.pauldwaite.co.uk/", "date": "Sep 04, 2013", "message": "@Victor: search for \"Stack Exchange Podcast\" in the iTunes Store, click on \"The Stack Exchange Podcast\" under the \"Podcasts\" heading on the results page, and then click on the \"Subscribe\" button."}, {"author_name": "haskellelephant", "gravatar_hash": "8eb2178645e26d829aaa67925c41b4cc", "author_url": null, "date": "Sep 04, 2013", "message": "THe flat earth myth is widely known: http://en.wikipedia.org/wiki/Myth_of_the_flat_earth"}, {"author_name": "Peter Demel", "gravatar_hash": "89cc0c963b4f5be52e273d3adb4e69b8", "author_url": "http://www.wein-weinkiste.de", "date": "Sep 05, 2013", "message": "Very interesting post. Thanks for sharing this."}, {"author_name": "Oddthinking", "gravatar_hash": "5444548c1ef9b707bb69e21022a531f0", "author_url": "http://skeptics.stackexchange.com/users/486/monkey-tuesday", "date": "Sep 05, 2013", "message": "The user name \"Monkey Tuesday\", which was mentioned on the show, is a reference to a weekly segment on the former radio show Penn Radio, hosted by noted skeptic, Penn Jillette."}, {"author_name": "pnuts", "gravatar_hash": "f49dbeced705687b92e851736d48f208", "author_url": null, "date": "Sep 05, 2013", "message": "How does one flag a comment here as spam?"}, {"author_name": "Anonymous Coward", "gravatar_hash": "01822efaf66e4b81d6f947cba7e0613a", "author_url": null, "date": "Sep 05, 2013", "message": "It's kind of sad/surprising that the job market in the USA has 4 openings for each programmer. Meanwhile here in Europe we have approaching 50% unemployment and more like 4 programmers per job opening. Then there's the temp contracts and crap pay...\n\nI'm fortunate enough to have been in a decent job doing interesting stuff for several years, but if I were to look for a new gig... well, I do not believe I would find it as easy as this podcast makes out.\n\nI don't live in the sticks either, I live in a big city in western europe, but.. well, the idealistic view of \"the employers fight over coders!\" just doesn't seem to match with reality, and for some reason it rubbed me the wrong way."}, {"author_name": "Jon Ericson", "gravatar_hash": "197b4243bd82fb459f5e4e4486286ed9", "author_url": null, "date": "Sep 05, 2013", "message": "@pnuts: When spam sneaks past the WordPress spamfilter, one of us needs to hunt it down.  Spam on old posts often goes unnoticed, though we get occasional reports in <a href=\"http://chat.stackexchange.com/rooms/2691/the-assembly\" rel=\"nofollow\">The Assembly</a>. \n\nThere's an <a href=\"http://meta.stackoverflow.com/questions/110998/using-the-stack-engine-for-the-blog-a-long-term-idea-for-maintaining-a-healthy\" rel=\"nofollow\">idea on meta</a> that's been on the back burner for a while to change our blogging platform.  Don't hold your breathe, but it would make spam a lot easier for the community to handle (among other improvements like Markdown support)."}, {"author_name": "Snowmanzzz", "gravatar_hash": "ab2c04e7652c764546951bb940cda9d7", "author_url": null, "date": "Sep 05, 2013", "message": "+1  @Victor search for “Stack Exchange Podcast” in the iTunes Store, click on “The Stack Exchange Podcast” under the “Podcasts” heading on the results page, and then click on the “Subscribe” button."}, {"author_name": "Cody Gray", "gravatar_hash": "3f8912af19fe86b7b34a0b011a962460", "author_url": null, "date": "Sep 05, 2013", "message": "Okay, I'll bite… What exactly is \"code\"-related about that keyboard Jeff designed? It just looks like a bog-standard keyboard. There are tons of companies that make high-quality keyboards with mechanical key switches. Yes, they are a good investment, but not just for programmers. And nothing against Jeff, but I can't see anything novel there that he might have designed. Unless you count ripping off the numeric keypad—fewer keys for the same price!"}, {"author_name": "Anna Lear", "gravatar_hash": "8fac59804fcd73fcce38586ea20ef861", "author_url": "http://meta.stackoverflow.com/users/155160/anna-lear", "date": "Sep 05, 2013", "message": "@CodyGray Not sure about innovation and all that, but it's surprisingly hard to find a well-made backlit mechanical keyboard if you're into that sort of thing.\n\nI have two versions of the Razer BlackWidow and while they're pretty good keyboards, they have a column of macro keys that I'm never going to use (even for gaming). The backlighting is also kind of muddy.\n\nI was kind of excited by CODE using clear switches too, although not enough to buy yet another expensive keyboard."}, {"author_name": "pnuts", "gravatar_hash": "f49dbeced705687b92e851736d48f208", "author_url": null, "date": "Sep 06, 2013", "message": "@Jon Ericson Many thanks for explanation. I note spam in question has now disappeared - no problem."}, {"author_name": "Jon Ericson", "gravatar_hash": "197b4243bd82fb459f5e4e4486286ed9", "author_url": null, "date": "Sep 06, 2013", "message": "@pnuts: I can neither confirm nor deny I had anything to do with the removal of spam.  ;-)"}, {"author_name": "Alenni", "gravatar_hash": "30cbb622a03025918fae6e89edd664d8", "author_url": null, "date": "Sep 17, 2013", "message": "Props to <strong>Skeptics</strong>! The questions there are indeed interesting"}, {"author_name": "Pete", "gravatar_hash": "b686e398674118337f763b5f8e9ccc72", "author_url": null, "date": "Sep 29, 2013", "message": "So what's wrong with me if I don't get any hits from recruiters on my LinkedIn profile? I think I've probably been contacted maybe less than 10 times since I signed up years ago.  It's filled out with my work history but that's about it - no statement, no profile pic, just a basic resume and my connections."}]}