{"response": [{"author_name": "Brian Webster", "gravatar_hash": "33aeb50707edf80478830cef6740254a", "author_url": "http://www.rubicite.com", "date": "Jan 30, 2013", "message": "That's actually pretty impressive work. Who knew an about page could be so interesting? This is a great model for others to learn from!"}, {"author_name": "Tom Wijsman", "gravatar_hash": "d3b75bb3bda58d5d4a7d31b820f856c9", "author_url": null, "date": "Jan 30, 2013", "message": "I'll just leave this link right here...\n\nhttp://meta.stackoverflow.com/questions/101935/can-the-ask-question-page-be-changed-to-obtain-better-quality-questions\n\nIf you want people to get a clue what the boxes are supposed to do, be more expressive about it\n\n Just being slightly more verbose makes you get rid of those silly three word titles that don't add anything useful, posts lacking details and examples or people wondering what a \"tag\" is.\n\nHave you ever tried to fill in a survey where each box is accompanied with _at most_ a single word? That's not constructive."}, {"author_name": "Rekire", "gravatar_hash": "ff37883faea028e0fe7ae0859baa9bc9", "author_url": null, "date": "Jan 30, 2013", "message": "I like the new About page it's clean and simple to understand good work!"}, {"author_name": "Daniel", "gravatar_hash": "8757490f3a412ec98b36e35c3d2d5e09", "author_url": "http://dlras.net", "date": "Jan 30, 2013", "message": "\"The best answers show up first so that they are always easy to find\" contradicts with \"Accepting doesn't mean it's the best answer\" since generally accepted answers always show up before any others."}, {"author_name": "Neil", "gravatar_hash": "a3988c74befe682a08e8461f005106df", "author_url": "http://magnificentnose.com", "date": "Jan 30, 2013", "message": "This is good work. \n\nI'm sure that SE is trying to limit the amount of crud in the top navigation bar, but maybe \"About\" should be put back there, so users don't have to scroll all the way to the bottom to find out that an \"About\" page even exists. Have put a link on top of <a href=\"http://writers.stackexchange.com/faq\" rel=\"nofollow\">the Writers FAQ</a>, but the editing options there make this a clunky solution. Maybe there's an official way to make this a visually smoother solution?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 30, 2013", "message": "&gt; Now, obviously, users could just discover these things as they use the site, but however much you do or don’t grok our system, surprises suck.\n\nThis... is not really true:\n\nhttp://www.youtube.com/watch?v=8FpigqfcvlM\n\nThat said, the new about page is awesome and very well implemented. Definitely a big step in the right direction.\n\n(And to @neil above, the about link is only suppressed for experienced users, who presumably know all that stuff by now. Try viewing the site as a new user or in your browser's inprivate, incognito, etc browsing mode."}, {"author_name": "Raphael", "gravatar_hash": "6a4d2d42ded7e86ca65f2d45b6cad765", "author_url": "http://lmazy.verrech.net", "date": "Jan 30, 2013", "message": "Definitely very well done, but of what use is it if even an eager new user does not find a link to it anywhere but in the footer on beta sites?"}, {"author_name": "danlefree", "gravatar_hash": "e24739557224cc447095251b1eebd00d", "author_url": null, "date": "Jan 30, 2013", "message": "&gt; Tagging may not seem like something a new user needs to be thinking about, but it’s actually critical because almost invariably, they get it wrong.\n\nSurely it would be possible to parse new question title and description content and pull tags from existing words (in fact, given that new tags cannot be created spuriously, this makes more sense than forcing the user to enter his or her own tags).\n\nFor cases where there is not one tag automatically retrieved for a question, (seems unlikely, but possible) what about an (untagged) tag and an \"untagged\" /review queue?"}, {"author_name": "Jason Truesdell", "gravatar_hash": "d38db2511ed7d159bfd3209edaed50bb", "author_url": "http://blog.jagaimo.com/", "date": "Jan 30, 2013", "message": "I believe one of the early studies on tags discovered that people who were posting something were far poorer at tagging than a collection of people who were reading something. Perhaps for newbies with less than, say, 1000 reputation, it might be a better user experience to have the community tag their questions?"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Jan 30, 2013", "message": "@Jason: realistically, if the author can get one or two critical tags right ([c#] [jquery]), the folks reading, reviewing and answering can fix the rest (+[dom] +[asp.net-mvc] -[porgramming] -[halp])."}, {"author_name": "Chandra Sekhar", "gravatar_hash": "7b7cbef75a2a4050ecbd28f8008c6f80", "author_url": "http://www.learnken.in", "date": "Jan 30, 2013", "message": "About Page 2.0 is very impressive, hope SE will continue it's journey of innovations :)."}, {"author_name": "SoboLAN", "gravatar_hash": "8feac14b86e6408e19694122993e7935", "author_url": null, "date": "Jan 31, 2013", "message": "I somehow feel this entire post is one big déjà vu.\n\nAnyway, you guys did a great job with the new About page. Can't wait to see what changes you'll do with the whole questions closing system :) ."}, {"author_name": "Anshuman Jasrotia", "gravatar_hash": "fd7369e493497b1bb91fd0120029340e", "author_url": null, "date": "Jan 31, 2013", "message": "Impressive!!!!"}, {"author_name": "Benjamin Harris", "gravatar_hash": "2aca501921a5a98762cc4af16da258b8", "author_url": "http://benjaminrharris.com", "date": "Jan 31, 2013", "message": "Excellent page! One comment though: please change \"The best answers show up first so that they are always easy to find\" to \"The answers with the most votes show up first so that they are always easy to find\""}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Jan 31, 2013", "message": "The new About page is a classic example of group think gone wrong.  The text makes no sense at all to a new user.  It's merely a statement of how the site's administrators define themselves.\n\nFor example:\n\n\"It's built and run by you\"\n\nNow I know what this means, but someone with a programming question doesn't.  He also doesn't want to clear his mind of useful problem-related information and sit down for a help page.\n\nNobody reads help pages anyway.\n\nWorst idea ever."}, {"author_name": "Dave", "gravatar_hash": "e52bc2d5fc3983e2ab1afb2b38b65444", "author_url": null, "date": "Jan 31, 2013", "message": "@Andomar Really? This is the worse idea ever? Hyperbolic much?"}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Jan 31, 2013", "message": "@Dave: I guess invading Russia in the winter would be a slightly worse idea ;-)"}, {"author_name": "Federico", "gravatar_hash": "303b0a741a14439b53c23ce4c9e28a12", "author_url": "http://fedmich.com/works/stackoverflow/", "date": "Jan 31, 2013", "message": "This is great information &amp; pretty entertaining too.\nI think that from now on, I'll link new users to about page rather than the homepage :)"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jan 31, 2013", "message": "@Andomar: Thanks for your reply.  You've now been nominated as the Project Manager for About Page Version 3.0."}, {"author_name": "Dan Neely", "gravatar_hash": "9827a6dd262732d2639417a251c9755e", "author_url": null, "date": "Jan 31, 2013", "message": "Not sure if it's a real problem but to get the informed badge you only have to go to the bottom of the page: eg by pressing the End key.  So you can get the badge without, even theoretically, reading the entire page."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.stackprinter.com", "date": "Feb 01, 2013", "message": "Nice work, I like it.\nI'm not sure on putting/hiding it inside the about page; \"about\" pages generally contain boring information and people do not read them (imho)."}, {"author_name": "Aaronut", "gravatar_hash": "b724ebca1ce4dc031f4db1215b70825e", "author_url": null, "date": "Feb 01, 2013", "message": "Any chance of being able to make minor edits to the good/bad topics like we can with the FAQ? I notice that our main bullet points were used, and I'm all for conciseness, but we have 5 \"dos\" and only 4 \"don'ts\" and there's one \"don't\" I really think should have been included.\n\nWhat do we do/who do we ask?"}]}