{"response": [{"author_name": "Soner Gönül", "gravatar_hash": "8348bcf40f55bc5818651824369caff1", "author_url": "http://sonergonul.net/", "date": "Jan 28, 2013", "message": "Another cool podcast. Thanks guys.."}, {"author_name": "Luke", "gravatar_hash": "6a8b8b5fef7e64c7a0830e9b39ff0794", "author_url": "http://genealogy.stackexchange.com/users/56/luke", "date": "Jan 28, 2013", "message": "I want my biscuits!"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jan 28, 2013", "message": "Your explanation of \"Too Localized\" is itself Too Localized.  \n\nToo Localized boils down to one simple concept: is this question likely to be of interest to anyone else?  \n\nPeople may be using the wrong threshold for deciding what the \"too\" part of Too Localized is, but the close reason itself is not all that difficult to understand."}, {"author_name": "Eric", "gravatar_hash": "a508fc3410426729b5887500bbb5adec", "author_url": null, "date": "Jan 28, 2013", "message": "Oh hey Jeff, thanks for the sticker, I stuck it on the side of my puter.  Stickers can make anything legitimate."}, {"author_name": "Zach Lysobey", "gravatar_hash": "0aa68f6b1eb7ef7a8906c5f89ccb9dd6", "author_url": "http://Zach.Lysobey.com", "date": "Jan 28, 2013", "message": "Weird that this new podcast doesn't appear for me at http://blog.stackoverflow.com/category/podcasts/ even after a hard refresh"}, {"author_name": "Jake", "gravatar_hash": "70f4e64e803927806a987aa59410e1df", "author_url": null, "date": "Jan 28, 2013", "message": "Love the podcast. As such, I've been waiting far too long for a new episode! The podcast is great, when it happens."}, {"author_name": "unstacked", "gravatar_hash": "d8ed85073054427468bc29d5f6a0dd2d", "author_url": null, "date": "Jan 28, 2013", "message": "Local mind produce always local products. \"we\" take oven to cook best"}, {"author_name": "gaijintendo", "gravatar_hash": "918b215b804b7dbf8e343398fde0909c", "author_url": null, "date": "Jan 29, 2013", "message": "Ask Jeremy Tunnell if this makes things better or worse, but could you not have elements of the process on the amount page.\nIf you made it clear that it was sandbox - the Up Down image could be a control. If you do your first click it could congratulate you, if you click it a few times it will tell you why that is pointless... and so on.\n\nHaving described this - it sounds like a bad idea.\n~Thanks all!"}, {"author_name": "SoboLAN", "gravatar_hash": "8feac14b86e6408e19694122993e7935", "author_url": null, "date": "Jan 29, 2013", "message": "Nice podcast. And super nice About page, congrats guys.\n\nOne minor complaint though: That image with the 3 circles which suggested that StackOverflow was right in the intersection is gone. Put it back please, it was really suggestive and I think it was helping new users understand why StackOverflow is different."}, {"author_name": "skullpatrol", "gravatar_hash": "3dcb34e0b4dc3ceb2e6d1fca0632358f", "author_url": null, "date": "Jan 29, 2013", "message": "Thanks for all the valuable information."}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Jan 29, 2013", "message": "Just looked at the \"hello world\" intro at http://stackoverflow.com/about.  It's aweful.  For example:\n\n\"It's built and run by you as part of the Stack Exchange network of Q&amp;A sites\"\n\"We're a little bit different from other sites. Here's how:\"\n\nThis is irrelevant to new users.  Even the 0.001% that actually reads it won't understand it.  What do you mean by \"built and run by you\"?\n\nA non-meta approach would be:\n- TYPE YOUR QUESTION IN THE SEARCH BOX\n- CLICK ENTER\n- IF YOU DONT FIND WHAT YOU WANT, CLICK \"ASK QUESTION\"\n\nBut hey, if new users don't do that by default, your site design is wrong."}, {"author_name": "Mike Christensen", "gravatar_hash": "b51ab3d7998a3119d5ad7b7a0e66f51b", "author_url": "http://blog.kitchenpc.com", "date": "Jan 29, 2013", "message": "@57min: Perhaps when a poster edits a closed question, it should go into the re-open queue and notify the people who voted to close it.  If I saw a notification telling me to review a question I closed, I'd be happy to take another look at it."}, {"author_name": "SoboLAN", "gravatar_hash": "8feac14b86e6408e19694122993e7935", "author_url": null, "date": "Jan 29, 2013", "message": "@Mike Christensen I actually thought of exactly the same thing. But there are many many users (hundreds or maybe even thousands) that issued thousands and thousands of close votes during the years. So if they're bombarded with 50 or so such notifications every single day, you can pretty much bet that they'll ignore them."}, {"author_name": "Jay", "gravatar_hash": "70b03db954aa45fc2559e85f5d5bd13e", "author_url": null, "date": "Jan 30, 2013", "message": "\"we’ll FAIL back over to NY from Oregon\""}, {"author_name": "watatoy", "gravatar_hash": "5792248702789a511f503585d70b0a91", "author_url": "http://this-is.myboard.org", "date": "Jan 31, 2013", "message": "aw ok."}, {"author_name": "Eric B", "gravatar_hash": "7714a17f33731b4008a1277857efbb72", "author_url": null, "date": "Jan 31, 2013", "message": "Re: out of date deletion (i.e. game that is no longer available).  If deleted there's risk of losing something of value in other ways even if no longer valid.  It could be an example, \"lesson learned\", (design) pattern of problem/solutions, or a \"depreciated\" answer (i.e. Java APIs).  \n\nIf an item talked about an old game with problems and needed specific things to be done to get it to work, even if the game is no longer available, this type of solution used for a given problem could be an example of a solution for a similar problem on another application or platform. \n\n\"Those who cannot remember the past are condemned to repeat it\" - George Santayana"}]}