{"response": [{"author_name": "Can Berk Güder", "gravatar_hash": "2c56a82b6d13e243848a55fedca24b71", "author_url": "http://cbg.me/", "date": "Dec 24, 2008", "message": "Hey, we (users w/less than 10k rep) want presents, too! =)"}, {"author_name": "Quarrelsome", "gravatar_hash": "890b18939e1eae1eecc193478a7c57e9", "author_url": null, "date": "Dec 24, 2008", "message": "I think we just get the image of the star. It's pretty though."}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Dec 24, 2008", "message": "Wow thats Tempest! I used to play that game back in the day all the time. \n\nWhere the hell did you find a Tempest Holiday level?"}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Dec 24, 2008", "message": "Doesn't Jon Skeet have enough already?"}, {"author_name": "Matt B", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Dec 24, 2008", "message": "By my count, there are only about 31 users with reputation greater than 10k.\n\nAnd here I thought I was close to being special by being close to 5k (hey there's only about 120 users in that club!)"}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Dec 24, 2008", "message": "<em>And here I thought I was close to being special by being close to 5k (hey there’s only about 120 users in that club!)</em>\n\nYeah, 10K is a high bar. 2,800+ is 99th percentile. 10,000+ is less than 0.1% of users. (I'm not whining, I'm just saying... :-)"}, {"author_name": "splattne", "gravatar_hash": "c12fa138ad96b3fa23b78cf0b51ed9ca", "author_url": "https://twitter.com/splattne", "date": "Dec 24, 2008", "message": "Suddenly I feel worthless and dirty with my lousy 7k reputation points. ;-)\n\nMerry Christmas to you Jeff and Joel and the whole SO community!"}, {"author_name": "Matt B", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Dec 24, 2008", "message": "&gt;Yeah, 10K is a high bar. 2,800+ is 99th percentile. 10,000+ is less than 0.1% of users.\n\nIt'd be interesting to be able to break those percentiles down furthey by \"frequent users\", i.e. those who have answered more than 5 questions, visit the site more than once a week, etc.\n\nLove me some stats!"}, {"author_name": "Sean Patterson", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Dec 24, 2008", "message": "&gt;Love me some stats!\n\n'Tis an interesting tale I'd bet on that one. For instance. I've been in since the beta, and I'm just crossing the 5K threshold as of yesterday. I typically keep the 'SOFlow active all day and refresh often, but I'm still in the \"middle brow\" knowledge field and am sometimes too busy to answer a lot of questions.\n\n...so +1 on Love me some stats!\n\nMerry Christmas all!!!"}, {"author_name": "Code Slave", "gravatar_hash": "9b5b69a29967dc41d5ddfdee09b27b73", "author_url": null, "date": "Dec 24, 2008", "message": "It's a shame its just a rep-gift, and that the limit is so high. Maybe there could be something for those that are logged in here on a certain percentage of days as well - say &gt;= 70%. Even if you are just retagging and editing typos - you are still contributing and active on the site.\n\nOtherwise you are just repeating the famous monkey-pebble-cucumber-grape experiment.\n\nSo speaks the monkey with a lousy 1.4k rep, but still in the top 3%"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Dec 24, 2008", "message": "3,660 rep.  :(  Rank 221 of 37799 (top 0.5%)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 24, 2008", "message": "I'm not sure it's worth really including the vast hordes of users with only a single rep point (i.e. registered, but have probably never asked or answered a single question) in those proportions. This is very significant, as only 18338 users out of a total of 37806 have more than one rep point. (That's quite scary to start with - over half the registered users haven't gained a single upvote.)\n\nUntil we have any idea what the \"gift\" actually is, however, it doesn't make too much sense to speculate whether or not it's a pity. Maybe it's a new moderation power available to 10K rather than a Christmas one-off.\n\nBy the way Jeff, I'm still waiting to hear about the robe ;)"}, {"author_name": "Tarek Demiati", "gravatar_hash": "ac4d7d7c9f09a4256242946b98facce6", "author_url": "http://mentalprocreation.wordpress.com/", "date": "Dec 24, 2008", "message": "Llamasoft strikes back :-)\n\nTempest was an awesome game"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 24, 2008", "message": "> over half the registered users haven’t gained a single upvote\n\nThis is a bit misleading as \"user\" in the context of stackoverflow.com only means they've left a single answer or question, usually as an anonymous user.\n\n\"registered\" in so nomenclature means \"has associated an OpenID\". As of right now..\n\nUnregistered: 10,909\nRegistered: 37,820\nModerators: 5\n\nTotal: 48,734\n\nhttp://stackoverflow.com/questions/184859/how-do-you-calculate-average-and-median-reputation-on-stackoverflow#185058\n\naverage reputation: 131\nmedian reputation: 1\n\nFor \"registered\" users (and moderators) only:\n\naverage reputation: 161\nmedian reputation: 1"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 24, 2008", "message": "also, for registered/moderators who have accessed the site in the last 30 days:\n\naverage reputation: 276\nmedian reputation: 33\n\nsame, but last 10 days:\n\naverage reputation: 364\nmedian reputation: 68"}, {"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Dec 24, 2008", "message": "@Jeff, we need a place, that we can see those stats all the time!"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 25, 2008", "message": "@Jeff: Thanks for the clarification and stats. Interesting stuff. Sorry for getting the terminology wrong :("}, {"author_name": "Orion Edwards", "gravatar_hash": "3a9ff49a9e689dcbfc8242f05180cc31", "author_url": "http://orionedwards.blogspot.com", "date": "Dec 26, 2008", "message": "Hrm... I have 10.5k rep and no present. I guess jeff saying \"might\" receive something means no love for me. awww :-("}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 26, 2008", "message": "Sounds like the present will be some moderation powers, but it also sounds like Jeff doesn't know yet what they should me:\n\nhttps://twitter.com/codinghorror/status/1079990113"}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 26, 2008", "message": "That's supposed to be \"what they should be\". I've been so spoiled by StackOverflow's edit feature that I don't even bother to read over stuff before I post it. Sorry."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Dec 26, 2008", "message": "@Orion: Awww...if it's any consolation, I think I'm in the same boat, but perhaps I'm just blind. :-P\n\nHope you had a lovely Christmas, it's really funny how it was all rainy and stormy on Christmas Day but really sunny and fine on Boxing Day! And today, who knows, the weather can't seem to make up its mind; welcome to Auckland I guess. :-P\n\n(Are you actually in Auckland at the moment? I know some people go elsewhere for their holidays.)"}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Dec 27, 2008", "message": "I don't know if it makes sense to turn this into a Reputation-Ability, but an \"Make this Community Wiki\" button would be nice, although of course abuse and subjectivity may cause problems here."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Dec 28, 2008", "message": "Jeff, if you're still looking for gift ideas, I'd like a link to my blog on Coding Horror.\n\nThanks!  :)"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Dec 28, 2008", "message": "I've noticed that I can read the deleted answers of other users.  Is this the new super power bestowed upon users with 10K+ reputation?"}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 28, 2008", "message": "Can you undelete them as well? How about deleted questions - can you see those? If it's possible to undelete stuff that's been wrongfully eliminated (due to the offensive flag or social pressure) it would provide a much needed check on those systems."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 28, 2008", "message": "> Is this the new super power bestowed upon users with 10K+ reputation?\n\nHint: look at the menu next to your name at the top of the page. See anything new there?"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Dec 28, 2008", "message": "I see the faq link (is that new?) and the section on that page that lists user privileges.  At the bottom of the list:\n\n10000  \t Delete closed questions, access to moderation tools \n\nInteresting.  What are these \"moderation tools\" you speak of?\n\n(I realize that you probably didn't think you'd have to lead a 10K+ rep user through this by the hand...)"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Dec 28, 2008", "message": "nobody,\nI can see the deleted answers of other users highlighted in red/gray (just as you may have seen your own deleted answers).  There is an \"undelete\" link, but I haven't clicked it.  As far as I know, a user can only delete their own answers, so I thought it would be rude for me to undelete an answer that someone doesn't want others to see (for whatever reason)."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 28, 2008", "message": "If you want to test out the undelete, I have a few deleted answers in the official FAQ topic. They're just short little replies to other peoples' posts so I deleted them when the FAQ became more official, but you can go ahead and undelete if you want to try it (something tells me that the fact that you can see the link means that you can click it).\n\nI am more concerned, however, with the ability for people to delete questions. About a month ago I petitioned both on StackOverflow and on UserVoice for more moderators, but I also stressed that it probably shouldn't be something automatically granted to those with high reputation due to the possibility for unilateral abuse. If there's a corresponding ability to undelete questions, as there appears to be for answers, I don't think this will be a problem, but it seems like Jeff is being a little secretive about exactly what these moderation powers entail."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 28, 2008", "message": "Bill, you're missing something. Look again at the menu, between \"logout\" and \"about\"."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 28, 2008", "message": "nobody, read closely:\n\n\"Delete ***closed*** questions\"\n\nalso note that we plan, in the next 5 days (Jarrod's schedule) to make closing a vote based process by users with 3k+ rep."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 28, 2008", "message": "Jeff, I saw that part, but seeing as anyone over 10k can already close a question, it seems like a simple two-step process of closing a question then deleting the now-closed question. Are you planning on requiring the closer and the deleter to be two separate users?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 28, 2008", "message": "> Are you planning on requiring the closer and the deleter to be two separate users?\n\nAs I stated above, we are moving to a vote based process for question closing in the next few days. I don't know how to say it any more clearly than that. Email me directly if it's still not clear, I guess.\n\nA similar note is listed on the page that Bill couldn't find, as well."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Dec 28, 2008", "message": "D'oh!  I feel like one of those things I couldn't find.  :)"}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 28, 2008", "message": "Got it now, thanks. When I read the sentence I guess I didn't parse that the way questions are currently closed will cease to exist (don't know how I missed that). Can you elaborate on the planned mechanism for closing? What's the threshold for closing a question under the new system?"}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": null, "date": "Dec 29, 2008", "message": "I think the \"see deleted\" posts should only apply to things that are not self-deleted.  When a person deletes their own material, I don't think someone else should be able to see it or resurrect it.  Sometimes I misread a question and my answer is just plain wrong.  I have NO interest in having other people see my stupidity on display, nor do I have an interest in seeing other people's mistakes.\n\nI can see the value of being able to undelete something deleted by a third-party as a check on the third-party delete mechanism, but I think people are entitled to the privacy of having their self-censored material be invisible, or even better, really removed from the system."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Dec 29, 2008", "message": "I totally agree with tvanfosson.  I've deleted some really embarrassing stuff in the past.  I'd like it to stay dead and invisible.  I trust that 10k+ rep users will use good judgment and not undelete answers that are obviously wrong, or answer the wrong question, but I'd really prefer that they not even see them."}, {"author_name": "ChrisN", "gravatar_hash": "17c74b63fef0ad159fc2ed7577951d29", "author_url": null, "date": "Dec 29, 2008", "message": "There are a couple of points I'd like to make here:\n\n1. I think you (Jeff) should explain what these new abilities actually are, for the benefit of all users. The FAQ page on stackoverflow.com says only \"access to moderation tools\", and the hints you've given here don't really explain them.\n\n2. The ability of users to act as moderators is in no way related to the reputation score they have. The argument I heard you make in the podcast, that reputation is a measure of how much the system trusts you, is fallacious, given how reputation points are easily earned through \"soft\" questions, and the actions of some high-reputation users (witness the fighting that occurs over whether a question should be closed). \n\nOver time, there will be more and more users with reputation over 10,000, hence more and more unqualified moderators (no offense intended to any 10,000+ user reading this). I suggest that only carefully selected individuals should be given moderator abilities, and that these abilities should not be gained by reaching an arbitrary reputation threshold."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Dec 29, 2008", "message": "ChrisN, those new abilities are outlined on the Tools menu (the one that I had so much trouble finding earlier)."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 29, 2008", "message": "Giving users the ability to undelete posts is a sticky proposition.  If a user undeletes a post that contains proprietary/sensitive information, IP/copyright infringement, hate speech, threats, etc., the original poster, the user that undeleted the post, and the SO site could be exposed to legal liabilities for damages resulting from undeleting the post.\n\nI think that not allowing users to undelete a post that the author deleted would be a good idea, otherwise it should be made clear in the FAQ that any post will be stored forever and that deletes can be undone."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 29, 2008", "message": "I agree, ChrisN. I voiced many of the same concerns, particularly that the criteria for achieving high reputation are not those that endow the person with the judgement and restraint necessary to act in the capacity of a moderator. (http://stackoverflow.com/questions/311030/we-need-more-moderators)\n\nBill, can you post some screenshots or the text of the moderation page here? I'd be interested to see the outline of the new abilities beyond what's preset in this blog post and the official FAQ (which isn't much)."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 29, 2008", "message": "ChrisN/nobody/anybody: Is there anyone with 10k+ rep that you don't think should have moderator abilities?  What do you propose as a better way to handle this, have 10k+ users file a request for moderator privileges?  I think we can assume that all such users would probably do that anyway so why waste the time with an extra step.  Have some way of vetting people for these privileges that doesn't involve rep?  What would be a better way to measure this besides the rep system?  It is pretty difficult to rack up 10k+ without significant useful participation on the site, the kind of participation and trust that someone with moderator privileges should have.  In the event that someone spends all the time in effort to obtain the rep required to earn these privileges and then turns around and abuses them the admins could always remove the moderator privilege from the offending user."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 29, 2008", "message": "When I initially wrote my \"We Need More Moderators\" post, I was specifically referring to the moderator powers that the site founders have (removing topics, banning users) and I think anyone would be deeply concerned with providing those abilities to just anyone, no matter how active they are on the site.\n\nIt sounds like the new moderation powers afforded to +10k users will be far more limited in scope, reducing the power to unilaterally act against posts and users. However, I don't have any hard data on what specific abilities these users have, so I can't comment either way on the potential for abuse.\n\nFinally, to answer your question, yes there are one or two +10k users that I'm wary with giving increased moderation power, not because I suspect that it will be used out of malice, but instead to heavy-handedly enforce what they believe are the community standards. I used to, and still do to some degree, see posts closed as \"subjective\" or \"not programming related\" that I believe were unfairly judged, and so I open them back up when I can.\n\nI just hope that the new +10k moderation powers provide others the ability to counteract potentially unfair use of the powers. Like I said, we just don't have enough data to see if this is the case. I do trust Jeff Atwood to make decisions in the best interest of the community, but I also do want to sound a note of caution against giving some people additional power. Some I feel already have too much."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 29, 2008", "message": "When it comes to \"admins\" I agree that more thought should probably be put into how to select who gets those privileges but Jeff seems to be going about doling out new privileges in a well-paced and thoughtful manner and making sure things are well-balanced before moving forward, I'm sure the same thought will go into new and more powerful abilities going forward.\n\nI think that the multiple-consensus part of the post deletion that Jeff hinted at will help keep a single moderator from wrecking havoc but even if some unnamed disgruntled user attempts to do so, Jeff has shown us how easy it is to \"fix\" things lately so undoing any damage and stripping privileges probably wouldn't be too difficult."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 30, 2008", "message": "I just created a test question and answer with a dummy user for anyone who wants to test the close/delete or the undelete capability, you can find it here: http://stackoverflow.com/questions/399683.\n\nFrom playing with it for a few minutes I have discovered that:\n\nIf you undelete someone else's *answer* you cannot re-delete it.\n\nThe same user can close a post and then immediately delete it, Jeff has indicated this will change real soon.\n\nWhen you delete a *question*, all the answers are marked as deleted so for testing purposes you can just close the question and then delete it when you are done to restore it to the state it is in as I write this.\n\nWhen the *question* is deleted, it no longer shows up on the questions page (even for moderators) but it can still be accessed via the provided link (only for moderators).  I don't know how a moderator can find/view deleted questions without having a link."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://www.nov8r.com", "date": "Dec 30, 2008", "message": "Thanks for the present! It's nice to be appreciated, and everyone loves good tools!\n\nExcept...the ability to see and undelete other people's deleted posts is a violation of their privacy. I'd like to return this tool, and exchange it for store credit."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://www.nov8r.com", "date": "Dec 30, 2008", "message": "addendum - and the ability for others to see and undelete my deleted posts is a violation of my privacy and the reasonable expectation that my deleted mistakes will stay private and deleted.\n\nplease rethink this feature/tool!"}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": null, "date": "Dec 30, 2008", "message": "I've created a UserVoice suggestion to remove the ability to see self-deleted posts at http://stackoverflow.uservoice.com/pages/general/suggestions/96223-remove-ability-for-10k-users-to-view-self-deleted-posts"}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 30, 2008", "message": "I don't mind (and think I actually kind of like) being able to see deleted posts.  I don't really see a valid privacy argument either: 1) It was made clear from the beginning that \"deleted\" posts are not really deleted, 2) There are plenty of internet forum mediums where it is not possible to delete posts at all (Usenet, IRC, etc.) so it's just as reasonable to not provide a mechanism where data can truly be deleted, 3) it is always possible for someone to obtain and keep the data before it was deleted (database dumps/screen scrapes/etc.) or find it after it was deleted (search engine/internet cache) anyway.\n\nSome people object to others being able to see \"embarrassing\" posts, well, being \"hidden\" from most other users is better than what most services provide, and everyone that does view it will do so with the understanding that it was deleted for a reason.  You can't always rewrite history to cover up all your little mistakes, we all make them, get over it.  If something really needs to be completely removed (sensitive information) this could be accommodated the same way as all other websites: contact the admin and ask to have it removed.  \n\nBeing able to undelete a post that the author deleted however, I do have a problem with for reasons that have been discussed here already."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://www.nov8r.com", "date": "Dec 30, 2008", "message": "there is no point to being able to see other people's deleted posts, and there is even less of a point in being able to un-delete other people's posts.\n\nit's one thing for a community to moderate public, published posts, and it's quite another to intentionally expose explicitly deleted information to others without permission\n\nWhat is to be gained from viewing other people's deleted posts? What is the purpose of this ability? What possible community benefit could this encapsulate?\n\nDitto for the ability to un-delete someone else's deleted post.\n\nJeff: the more i think about this issue, the less i like it; please reconsider this pointless and ill-advised 'feature'."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://www.nov8r.com", "date": "Dec 30, 2008", "message": "and in the meantime, please hard-delete all of my deleted posts. Thank you."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 31, 2008", "message": "> the more i think about this issue, the less i like it;\n\nNot sure why visibility alone is such a big deal, since everything you do on the site is versioned and public.\n\nI do understand the concerns about undelete and I am open to that.\n\nHowever, I think it's unrealistic to expect to participate on a wiki-like site, as stated in the FAQ, and expect your deletes to be anything but revisions internally."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 31, 2008", "message": "&gt; Except…the ability to see and undelete other people’s deleted posts is a violation of their privacy. I’d like to return this tool, and exchange it for store credit.\n\nI don't have any problem with Steven returning his ability to see deleted posts but I'd like to keep mine think you.  I would be more than happy to return the ability to undelete author-closed posts in exchange for being able to delete answers that have a -3 or worse rating though (this seems a natural extension to the 3 votes to close/delete questions and would greatly aid in cleanup efforts)."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 31, 2008", "message": "I meant author-*deleted* posts, of course."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://www.nov8r.com", "date": "Dec 31, 2008", "message": "Hi Jeff!\n\nEverything on the site is not versioned and public - or at least it wasn't until a few days ago!\n\nSometimes you bark up the wrong tree and accidentally hit the submit button before your brain engages. Sometimes you answer the wrong question and look like an idiot, so you quickly delete the mistake. Sometimes you post something snarky and then the first cup of coffee kicks in and you reconsider your harsh words so you delete it. A few people may have seen it in the meantime, but it no longer appears in the public record. \n\nIf I had wanted my deleted posts to be visible, I wouldn't have deleted them. This site is **like** a wiki (sort of!), but it **isn't** a wiki. Deleted posts should stay deleted, and invisible. And no one other than the author should have the ability to undelete them.\n\nIf I cannot make a mistake with some expectation of privacy, my enthusiasm for pouring some knowledge into the site is lessened. It's bad enough that my wife (and ex-wife) remember every mistake I've ever made, I don't want stackoverflow.com to join the fray! ;-)"}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://www.nov8r.com", "date": "Dec 31, 2008", "message": "FYI - this issue is now being discussed on SO\n\nhttp://stackoverflow.com/questions/403236/does-stackoverflow-own-the-content-i-post"}, {"author_name": "ChrisN", "gravatar_hash": "17c74b63fef0ad159fc2ed7577951d29", "author_url": null, "date": "Dec 31, 2008", "message": "Jeff,\n\n&gt; Not sure why visibility alone is such a big deal, since everything you do on the site is versioned and public.\n\nThe existence of a delete function in the user interface creates the expectation that it can be used to remove an author's own posts from public view. Until you posted this blog article, there was no expectation that deleted posts could be made visible again, except by the original author, or also that high-reputation users would gain moderator abilities. As I said in my previous comment, over time the number of 10,000+ users will increase, and visibility to this group is as much an issue as visibility to everyone else.\n\n&gt; However, I think it’s unrealistic to expect to participate on a wiki-like site, as stated in the FAQ, and expect your deletes to be anything but revisions internally.\n\nHow you store revisions internally is an implementation detail, and I have no concerns with that.\n\nIf you are really set on keeping this change, then I would suggest that it should not apply retroactively, i.e., the ability to view deletions should only be applied to posts deleted *after* the change was made, and that old deletions remain out of view."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://www.nov8r.com", "date": "Jan 07, 2009", "message": "well i see that the ability to delete closed questions is now gone, with no explanation - did I miss the memo?\n\nLOL!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 08, 2009", "message": "It's still there -- you just have to wait 48 hours from the date of last close to delete something. Based on this uservoice ticket\n\n\"Improve fascist voting system\"\n\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/99086-improve-fascist-voting-system\n\nHEIL!!!"}, {"author_name": "Gunnar", "gravatar_hash": "ec0f2a0f95908ce5d1e4b6ed77c65746", "author_url": "http://whitehousehuahin.com", "date": "Sep 26, 2009", "message": "Living in Thailand. I just finish my villa in Hua Hin and search some inspiration for my villa"}, {"author_name": "shawn01", "gravatar_hash": "20b07ac4c77d04f7d8e9d369b38bc8d5", "author_url": "http://bestbuyholiday.com", "date": "May 03, 2010", "message": "Hi all,\nI am real encourage with the mentation and don't search like adding anything in it. It is a perfect result.\n=======================================\nShawn\n<a href=\"http://bestbuyholiday.com\" rel=\"nofollow\">Holidays</a>"}]}