{"response": [{"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 31, 2008", "message": "Fabulous - thanks very much Jeff! Hopefully we managed to persuade you without looking *too* much like a bunch of whiners :)"}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 31, 2008", "message": "Thanks Jeff, very much appreciated!\n\nAre you sure that all of the users that were affected by the \"Revisiting the Daily Reputation Cap\" change were affected by this change as well?  It looks like some of the users that lost rep for this the other day did not gain it back.  For example, litb had 10.2k according to the screen shot you posted before the change and was dropped off the first page after the change.  Now he only has 9769 which is very close to what he had earlier today."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 31, 2008", "message": "It looks like the rest of the users have been updated now.\n\nDo accepted answers still count towards the 200 rep limit?  For example, if I get 10 accepted answers followed by 20 upvotes, do I get 200 rep or 350 rep?  \n\nPreviously this would have yielded 200 points if the accepted answers occurred first, 350 points if they happened after the rep limit was hit.  Many people (myself included) feel that accepted answers shouldn't count towards the limit at all so that the effective rep gain isn't based on the order of events, just curious if this was changed."}, {"author_name": "litb", "gravatar_hash": "31a1c40a45079decc7f5525d2a873481", "author_url": null, "date": "Dec 31, 2008", "message": "Nice. Thanks for the christmas present, Jeff :)"}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Dec 31, 2008", "message": "Funny... That big recalculation last week that everyone was complaining about didn't affect me. However, when you became -more generous- with reputation, mine went down by ~1000."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 31, 2008", "message": "> Do accepted answers still count towards the 200 rep limit?\n\nNo. They didn't before (due to a bug) and now they explicitly do not. Accepted answer +15 rep is awarded regardless of where you are on the daily rep cap that day.\n\n> That big recalculation last week that everyone was complaining about didn’t affect me\n\nRyan, this was a *global* recalc for all users. The previous one was only for the first 6-7 pages of users."}, {"author_name": "Konrad", "gravatar_hash": "f9401202ab73e624cc82800b0fff1489", "author_url": "http://madrat.net/", "date": "Dec 31, 2008", "message": "Jeff, whatever you did, the effect was enormous. In fact, I can barely believe that this had such a huge impact. Interesting to see basic arithmetic at work. ;-)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 31, 2008", "message": "Well, there was another annoying bug that I won't go into, which could have caused previously capped (set to 0) votes *not* to be properly uncapped in a recalc.\n\nAs usual, the responsible person will be beaten until their morale improves."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 31, 2008", "message": "Jeff, please read my entire question."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 31, 2008", "message": "> Many people (myself included) feel that accepted answers shouldn’t count towards the limit at all so that the effective rep gain isn’t based on the order of events, just curious if this was changed.\n\nOh, sorry, I see.\n\nThe behavior is the same as before.. for this type of vote only, it ignores the max reputation check. The other votes still check against that, and your daily rep is incremented by +15 by an accepted answer, so it would affect later votes."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 31, 2008", "message": "Any thoughts about changing that?  If I open a request on uservoice to have the rep from accepted answers tracked separately is there any chance of that happening?"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 31, 2008", "message": "I'd be in favour of the change that Robert Gamble's suggesting (Robert - if you open a request, leave a link here :) but I don't think it's as important as the changes that have already been made. Also, Jeff and the team deserve a holiday...\n\nI also think it may not be worth spending too much more time tweaking a time-based rep limit *if* the community is more interested in moving to other kinds of rep limits. (Oh what I'd give to have a copy of the database and play with a few rep limit strategies. Envy for Jeff :)"}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 31, 2008", "message": "@Jon, I agree it isn't a high priority given the other changes made recently, especially if it isn't an easy thing to do.  I think there is an obvious consensus that this would be favorable so I'll leave it to Jeff to address if he sees fit.  I'd much rather have a database dump/SO API anyway ;)\n\nI want to share my appreciation to Jeff &amp; team for the fantastic work they have put into the site recently and the attentiveness to user feedback.  In just the last week a number of major enhancements and fixes have been made including:\n\n10k+ tools and privileges.\nSignificant improvement in responsiveness on uservoice (thanks to our new moderators for their help here).\nThe new close/reopen feature (which I agree is a change that moves the site up a notch).\nFinally fixing the Strunk &amp; White badge.\nCodifying the accepted answer behavior.\nProbably lots of other things I'm not aware of.\n\nThanks guys and have a Happy New Year!"}, {"author_name": "Mark Biek", "gravatar_hash": "040ffc7f3327b05f01c54a8bef3ba60a", "author_url": null, "date": "Dec 31, 2008", "message": "Good to know.\n\nI was wondering why I had such a big reputation jump."}, {"author_name": "JaredPar", "gravatar_hash": "529ba429a58902bef56c2fcb672d5ccb", "author_url": "http://blogs.msdn.com/jaredpar", "date": "Dec 31, 2008", "message": "Man, woke up this morning and thought I had done a lot of good posting yesterday.  Then I got to the blog roll and found out this was not the case."}, {"author_name": "John Sheehan", "gravatar_hash": "54b75f6fbf4434162bfcda6b0cb9b86b", "author_url": "http://john-sheehan.com/blog", "date": "Dec 31, 2008", "message": "I lost 25 last week and gained 301 today! Woot. Thanks for making the changes Jeff and I'll spare you any more questions...for now. I also got my long-awaited S&amp;W badge!"}, {"author_name": "Jonathan Leffler", "gravatar_hash": "7d0d66b076e3bc70819e50f8a25af8df", "author_url": null, "date": "Dec 31, 2008", "message": "Thanks for resolving the Strunk &amp; White issue.  I think the other changes are good, too.\n\nThe only concern I have about deleting questions is about what happens if a question is closed, but it is a good question with a good answer (set of answers).  If it is closed and then later deleted, the question will be reasked, there will be no question to refer to saying \"duplicate\" and ... well, it will be a nuisance.  It won't happen for a while.  It may not happen if good questions are kept open.  But it would be silly if we lost the corpus of good answers to good questions because they were closed.  (Maybe the intention is to keep such questions open, even if inactive.)"}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://www.nov8r.com", "date": "Jan 01, 2009", "message": "excellent response to user input, thanks for listening\n\n- love the new vote-to-close, then-delete feature, that makes much more sense and eliminates the 'iron fist' closing that was going on and ticking people off.\n\n- hate the view-deleted and undelete-others feature, but that was discussed elsewhere so i'll drop it for now\n\nbut since we're on the subject - though everyone likes a nice surprise, this is (at least) the second time that you've added a 'new feature' to SO that the users were...less than enthusiastic about. Perhaps asking the users first might avoid unnecessary work and/or rework in future (I hear that Skeet fellow's opinion is fairly well-respected).\n\nnow if there was only a simple way to merge duplicate questions, I think SO would be feature-complete (i.e. have a fully 'closed' lifecycle) and could come out of 'beta' ;-)"}, {"author_name": "Michael", "gravatar_hash": "f4f4b5a6f27f72b32d42463b1a25e0df", "author_url": "http://stackoverflow.com/users/29/michael-haren", "date": "Jan 02, 2009", "message": "Jeff,\n\nI saw my rep drop ~250 points on 12/29. Then, when you guys changed the accepted-answer rule back, I gained ~60. Did I lose the other ~200 points for some other reason? You can see this here:\n\nhttp://sof.modos.org/tracker/chart/29"}, {"author_name": "Mac Gravell", "gravatar_hash": "b4ae7f8b50a2c32287e456394570679e", "author_url": "http://marcgravell.blogspot.com/", "date": "Jan 04, 2009", "message": "I wonder if the \"answers immune from cap\" is working correctly? My modos regularly shows new accepted answers without any rep increase... and the same on SO (although harder to track); very curious. Does anybody else see this?"}, {"author_name": "Mac Gravell", "gravatar_hash": "b4ae7f8b50a2c32287e456394570679e", "author_url": "http://marcgravell.blogspot.com/", "date": "Jan 05, 2009", "message": "More details (and evidence) of the answer immunity here:\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/97306-rep-limit-still-seems-to-apply-to-accepted-answers"}]}