{"response": [{"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 31, 2008", "message": "Very nice.  Regarding deleted questions, they seem to disappear from the questions list after they are deleted unlike deleted answers which I can still see with the rest of the answers.  Is there currently any way to browse deleted questions or have them show up with all the other questions?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 31, 2008", "message": "Note: there WILL be a badge around this. For sure. Probably just bronze, though.\n\n> Is there currently any way to browse deleted questions or have them show up with all the other questions?\n\nThis will be part of the 10k user moderation tools, yes. Not there yet."}, {"author_name": "lImbus", "gravatar_hash": "fb3c6b657c33aba6791a9389b9c65170", "author_url": null, "date": "Dec 31, 2008", "message": "Very nice, very big improvement already indeed, but two thoughts come to my mind as I read your post:\n\n- can I vote to keep a question opened (given I have 3K rep) when I see it already has a/some closing-vote before it hits the threshold of three?\nIf no, this means I have to monitor the question in fear of being found by two other dislikers before I can reopen it.\n\n- sometimes massively down voted questions are much more worth to be deleted than closed questions, or it takes just longer for a 3k-rep reader to find this question than to be found by many 100-rep punishers."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 31, 2008", "message": "Excellent - it's this kind of change which distinguishes a site as being sophisticated, in my view."}, {"author_name": "Zizzencs", "gravatar_hash": "a2434ff7cd1dba4d58aadd4a5d8d5fee", "author_url": null, "date": "Dec 31, 2008", "message": "One thing came up a few times for me: if a question was closed as \"exact duplicate\" the moderator sometimes doesn't include a link to the duplicate. And sometimes I'm almost sure that there is no exact duplicate. Would it be possible to make it mandatory to link the duplicate? (this request will appear on uservoice soon i guess :-) )"}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 31, 2008", "message": "@Zizzencs: this is already planned, here is the uservoice link:\n\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/28071-enforcing-link-to-original-exact-duplicate-question"}, {"author_name": "Trap", "gravatar_hash": "3ebc7baf5b572cd893874b81890621fa", "author_url": null, "date": "Dec 31, 2008", "message": "This is a really good change and it's in line with the rest of the site. What I don't like is the fact that there's a number telling you how many votes are left to effectively close the question. Why would I want to know about this? Knowing the close count could somehow affect the final decision. What I've learned is that if something can be gamed it surely will, so why leave a chance to it happening? As to the number of votes needed, where does that '3' come from? I'm just curious and love to know the magic behind magic numbers :)\n\nKeep up the good work."}, {"author_name": "Jon B", "gravatar_hash": "c60d994d29c63ea5d83702924b935461", "author_url": null, "date": "Dec 31, 2008", "message": "You can still get into a war as long as there are three 3K users on each side. If you could vote to re-open before reaching the three votes to close, then opposed users would cancel each other out."}, {"author_name": "Tim", "gravatar_hash": "39a69312c168c765823ad02d46341de9", "author_url": "http://blog.stackoverthrow.com/", "date": "Dec 31, 2008", "message": "I am not so sure it is a good change.  I have seen questions get closed, then reopened after the OP modified them.  In this case you now need three people with rep over 3000 to take an interest in it.  Unless  you have some page that has an inflection point or \"closed with acceleration towards open\" or \"pending open\" I see this as a really bad thing.  Already there are questions that are marginalized only because there is little interest or few with specialties.  When the window of opportunity goes away (the question drops off the first page) then it is pretty lost.  This will also be the case with closed (but edited and now legitimate questions)\n\nNo sir, I don't like it.\n\nI also am not sure about the logic between the threshold for closing.  To close it you need 3 votes - so there is a threshold of three votes.  Does a re-open vote bring it back under the threshold or is it the fact that 3 people wanted it closed sufficient to keep it closed until it becomes non-negative (close == negative, open == positive)  And do those people's votes count again - meaning do you only get one shot - like an upvote or a downvote?  Do my votes cancel out, or do they aggregate?  \n\nI think the old way was a lot simpler and frankly I don't think it was worth it to change the behavior and make it all more complicated.\n\nNot worth - you are just causing more confusion."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Dec 31, 2008", "message": "happy new year from a troll"}, {"author_name": "Tim", "gravatar_hash": "39a69312c168c765823ad02d46341de9", "author_url": "http://blog.stackoverthrow.com/", "date": "Dec 31, 2008", "message": "If you really think that voting is the way to go for closing then perhaps a graduated scale is useful.  Probably complicated, but not much more so compared to the one Jeff outlined.  \n\nFor example - those under some initial amount can't vote to reopen or close.  Those at level 1 can vote but it takes 3 votes to change the status, those at level 2 need only two people (they are twice the weight of level 1) and then level 3 are like how it is now.  They can act unilaterally.  \n\nPretty ugly.  But what the heck."}, {"author_name": "Jason Baker", "gravatar_hash": "9778f2a6432262a59c6f7a2f96b33f90", "author_url": "http://jasonmbaker.wordpress.com", "date": "Dec 31, 2008", "message": "Kudos to you guys!  I think this is among the best changes you've made since I've been on SO.\n\nSo now that this is out of the way, does this mean that you guys can fix technorati logins?  Or at least merge my new OpenID with the old one?"}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Dec 31, 2008", "message": "I like this change.  Up until now I have been very reluctant to close questions, even when I think they deserve it.  This allows me to register my opinion without acting unilaterally."}, {"author_name": "Lance Roberts", "gravatar_hash": "576cdd58ab7df19c6715121c7806bbf6", "author_url": null, "date": "Dec 31, 2008", "message": "This is great.  I've had questions closed just because while it was extremely relevant to my programming, it was irrelevant to someone elses."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Dec 31, 2008", "message": "Heh... From executioner to firing squad. I expect this will *completely* change the nature of closed posts... can't wait to see how!"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Dec 31, 2008", "message": "HA! Just tried it out: The last user to vote for closing is the one who gets his name attached. So voters 1 and 2 are effectively anonymous... I predict we'll see a *lot* of close(2) posts hanging around. \n\nOne potential downside already seems to appear though: OT posts collect many more replies before being closed."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 31, 2008", "message": "> OT posts collect many more replies before being closed.\n\nBelieve me, I know.. I was a fan of the original behavior, but it is ultimately better to err on the side of multiple users voting than a single user making one decision.\n\nIt is slower, though."}, {"author_name": "JaredPar", "gravatar_hash": "529ba429a58902bef56c2fcb672d5ccb", "author_url": "http://blogs.msdn.com/jaredpar", "date": "Jan 01, 2009", "message": "Overall I think this is a great move.  There is one small detail I don't like though.  Right now I am looking at a question I think is perfectly valid.  But it already has 2 close votes.  I think it's a perfectly valid question and should stay open.  Yet based on the UI there is no way for me to register my opinion until the question is actually closed.  It seems like I should be able to \"undo\" a close vote with my open vote before it's actually closed.  \n\nYes I can certainly participate in the reopen process later, but I don't feel strongly enough about this question to keep checking on it.  Perhaps that is the intent of the current design.  But IMHO, I'd rather be able to vote now that I disagree with a close rather than waiting another hour, day or never when it's actually closed."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Jan 02, 2009", "message": "How about we move back to the old system of one person close/reopen but don't allow questions with &gt; 0 votes to be closed or questions with &lt; 0 votes to be reopened?  This seems to solve a lot of the problems mentioned above:\n\n1) Bad questions can be closed quickly.\n2) Much easier to get closed questions that the majority of voters support reopened\n3) Helps avoid close/reopen wars.\n4) Retain an element of voting in the process but involve a larger segment of the community at the same time.\n5) Makes the system simpler by not having a separate voting system.\n\nIf you are worried about users abusing \"close and delete\" you could always either 1) require a different user to delete the post than the one that closed it, or 2) require a certain amount of time to pass after closing before the question can be deleted."}, {"author_name": "Jon T", "gravatar_hash": "a83b2dbbf221f91fa2547ba871b4932b", "author_url": "http://www.binaryfortress.com", "date": "Jan 02, 2009", "message": "It seems like some questions are being closed just because they aren't marked as \"community wiki\". I think some of the problems related to questions being incorrectly closed (IMHO) would be to grant people with rep&gt;=3000 the ability to mark questions as wiki."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 02, 2009", "message": "I agree with JaredPar. It should be possible to vote that a question remain open (or closed) regardless of the current state of the question.\n\nRobert Gamble, I disagree with the use of 0 as the threshold for forcing a question to remain open or closed. There are plenty of negative score questions that don't deserve to be closed, and plenty of positive score questions that do.\n\nInstead, how about having the score indicate how many votes are needed to close the question. Maybe 0-2 points requires 3 votes to close, 3-5 requires 4, etc. This could work in the opposite direction, too - a question with (-3) to (-1) points would require 2 close votes, (-6) to (-3) requires 1 close vote, etc.\n\nAlso, when I say \"vote\" mean \"close score\", as in a vote to close or keep closed the question increases the close score, and a vote to open or keep open a question decreases the close score. If the close score passes the close threshold for the question (as determined by the overall score) the question is closed. If it drops below the close score, the question is opened. Every time the question or close score is changed this is re-evaluated. This would enable users below 3,000 rep to have some (but significantly diminished) say in what questions are open and closed."}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Jan 04, 2009", "message": "+1 for Jared's suggestion."}, {"author_name": "Mehrdad Afshari", "gravatar_hash": "df0bd8a818111607704dab056fcfc091", "author_url": "http://mehrdadafshari.com", "date": "Jan 05, 2009", "message": "Jeff, this is a nice idea and I'm happy with it.\n\nHowever I noticed a minor issue. While it takes more than one person to close a question, the name of the last person who closes it will be written as the one who closed the question. When only one person is needed to close, it was perfectly acceptable as he or she would be one to follow up. But now, closing is not a single person's opinion, it's a vote of a community. So, I think SO should no longer mention the name of the person who closed the question. Actually, some of my old questions was retroactively downvoted after I closed http://stackoverflow.com/questions/407252/so-reward-system as the third person to vote! Not mentioning the name will reduce the impact of anger of people whose questions are closed and think they should fight with the one who closed the question.."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 07, 2009", "message": "@Mehrdad Afshari\n\nI disagree. First, if you have the power to close, you can also see how many closing votes have been cast. If it's 2, and you click close, you are effectively the person that closed the question.\n\nSecond, while I agree that up/down votes should be kept secret (to protect members from retaliation), the people that voted to close a question should be identified. I don't want moderators being able to act with impunity; rather, I would personally like to know all the people that voted to close a question and not just the last one. On one of my recent questions someone voted to close it, and I don't like the fact that it's impossible for me to know who it was."}, {"author_name": "Mehrdad Afshari", "gravatar_hash": "df0bd8a818111607704dab056fcfc091", "author_url": "http://mehrdadafshari.com", "date": "Jan 18, 2009", "message": "@nobody: I think this is what happens. This is good. I completely agree. When I proposed the solution I thought it might not make sense to put a list of names under the question.\n\nI don't want to have moderator names hidden, but some new community members will get angry if they see there is a single person's name there. This was the main issue.\n\nAnyway, it seems to be solved by now."}]}