{"response": [{"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 27, 2008", "message": "Hopefully this means that there will be some 'official' action on some of my feature suggestions. I remember several months ago any submission was followed by a decline or official comment within a few days, but it's been over a month for some of my posts without any official feedback."}, {"author_name": "Arron a.k.a. Unkwntech", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Dec 27, 2008", "message": "WOW, I didn't realize that I was that active on uservoice #4 WOW!\n\nI guess though that I do what I can to help out the site, I've been in their shoes several times before but never with a site for programmers so getting even half-decent feedback is like pulling teeth from an angry dog while covered in steaks and the odor of female dogs in heat!"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://jcoehoorn.vox.com", "date": "Dec 27, 2008", "message": "Bow before me, for I am root! ;)"}, {"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Dec 27, 2008", "message": "Yah, Root, that would be me... see I just logged in!"}, {"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Dec 27, 2008", "message": "@nobody I agree it is painfull when there is not response on a request/question, but with the sheer number of requests I can imagine that it is hard to keep up with them all."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Dec 29, 2008", "message": "joel colehoorn - type 'sudo apt-get install life'"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Dec 29, 2008", "message": "Not that I think anyone would bother, but it might be possible to work out what our email addresses are from that screenshot by creating images with each dictionary words and blurring them to see if they look the same. It's always better to obscure them completely with a solid block of colour. See http://dheera.net/projects/blur.php"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Dec 29, 2008", "message": "In case anyone is still following this:\n\nNow that I've had a chance to look at the moderation tools available on uservoice, I want to mention a few things:\n\n1) A few days ago there were more than 350 items in the moderation queue.  The number is now less than 1/2 that and falling.  The situation IS improving.\n\n2) It's not simple to search within all open items, at least that I've found.  The best I can do so far is the same \"I suggest you...\" prompt everyone else has.  That means the new moderators are unlikely to see an item unless it's actually flagged for moderation.  As users, you can do this by clicking the little \"duplicate\" and \"inappropriate\" links.  If you think you've seen a request before, clicking the \"duplicate\" link will help us out a lot."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 29, 2008", "message": "Excellent, I'll try to hop in too Joel. Sean is on his honeymoon (congrats btw) but I'm sure he'll pitch in when he gets back."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 31, 2008", "message": "> Not that I think anyone would bother,\n\nThere's really no need to keep typing after this, is there? :)"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Dec 31, 2008", "message": "Ok, so maybe no-one would bother in this case. But it's bad practice and it shouldn't be encouraged. \"You're setting a bad example\" is more what I was trying to say."}, {"author_name": "Kev", "gravatar_hash": "90dcdf16717c5b61bb462ff70a801ac3", "author_url": null, "date": "Jan 09, 2009", "message": "This might seem a bit offtopic, but why-oh-why Jeff did you choose to go down the road of Uservoice. From day one I've found it to be a pretty awful way of submitting (tiny text boxes) and reviewing bugs and suggestions. For example the way the back button is completely broken half the time because of all the ajax/web 2 nonsense they do (badly). \n\nYeah I realise you needed something that would allow the community to vote for suggestions/fixes, but it has no other redeeming features over a traditional bug tracker.\n\nI'd have preferred a better bugtracker than this which is why I have never made any further effort to use because it is actually quite rubbish and claustrophobic to use.\n\nNow that SO is more mature, maybe the same codebase  could be pressed into this task because it has all the features UV has and way more and it's a way better put together app.\n\nBut that's just me being a noisy minority and I'm presently fueled by a post work big glass of Chilean Carmenere."}]}