{"response": [{"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 18, 2008", "message": "So where do I send my address to get my free robe? ;)"}, {"author_name": "Chris", "gravatar_hash": "86972d6ee486a082e5a4f5577a9f574e", "author_url": "http://light.widgisoft.co.uk", "date": "Dec 18, 2008", "message": "Just a quick one regarding the proposed Stack Overflow question bounty feature; why not just limit it to a delay so that you can only put bounties on questions older than 1 day or 2 day or whatever; That way most questions will stay equal until and if nobody answers your question you offer up some rep to entice 'em.\n\nOn a side note; Looks like Jon hit 20k already :-p"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 18, 2008", "message": "@Chris: I think Jeff is already proposing a delay before you can put a bounty on. That's certainly what I understood from what he was saying on the podcast."}, {"author_name": "Craig", "gravatar_hash": "e78bca1e19270e988366b8dc13e7fdb4", "author_url": null, "date": "Dec 18, 2008", "message": "Arrrg! Don't say \"RAID array\" it's so redundant."}, {"author_name": "Andrew Eidsness", "gravatar_hash": "c9e4d137986eb5e19068aa5ebb9de457", "author_url": null, "date": "Dec 18, 2008", "message": "Joel mentioned that the Ayn Rand was too boring, but I found the exact opposite.  I think that Atlas Shrugged is very appropriate with respect to the financial problems, bailouts, etc. that are happening now."}, {"author_name": "sig11", "gravatar_hash": "89729af4bfe02004f8cf148327988d29", "author_url": "http://www.reprehensible.net", "date": "Dec 18, 2008", "message": "DO IT TO JULIA"}, {"author_name": "Micah Martin", "gravatar_hash": "c23b963563e43954c912c41335411916", "author_url": "http://codingcontext.wordpres.com", "date": "Dec 18, 2008", "message": "Jeff - I decided to pose the Easter-Egg question to the group.\n\nhttp://stackoverflow.com/questions/378585/are-there-any-hidden-easter-eggs-in-stackoverflow\n\nhttp://stackoverflow.com/questions/378597/stackoverflow-easter-egg-suggestions"}, {"author_name": "Mehrdad", "gravatar_hash": "df0bd8a818111607704dab056fcfc091", "author_url": "http://mehrdadafshari.com", "date": "Dec 18, 2008", "message": "RAID 0 is striping, 1 is mirroring, not vice versa!"}, {"author_name": "Ryan Cox", "gravatar_hash": "bd46b4d3a62617328fbf0c71e20b45ab", "author_url": "http://www.asciiarmor.com", "date": "Dec 18, 2008", "message": "Joel / Jeff:\n\nYou might enjoy this 1986 interview with Bill Gates that touches on issues related to several of the topics discussed in this episode. The interview comes from the now out of print Programmers At Work.\n\nhttp://programmersatwork.wordpress.com/bill-gates-1986/\n\nOne question I particularly liked:\n\nINTERVIEWER: Does accumulating experience through the years necessarily make programming easier?\n\nGATES: No. I think after the first three or four years, it’s pretty cast in concrete whether you’re a good programmer or not. After a few years, you may know more about managing large projects and personalities, but after three or four years, it’s clear what you’re going to be. There’s no one at Microsoft who was just kind of mediocre for a couple of years, and then just out of the blue started optimizing everything in sight. I can talk to somebody about a program that he’s written and know right away whether he’s really a good programmer. If he’s really good, he’ll have everything at the tip of his tongue.\nIts like people who play cress. When you’re really into playing chess, it’s easy to memorize every move in ten chess games, because you’re involved in it. Other people look at that recall in chess players, or in programmers, and they think it’s like some freak show. But it’s completely natural. To this day, I can go to the blackboard and write out huge slabs of source code from the Microsoft BASIC that I wrote ten years ago."}, {"author_name": "Patrick Harrington", "gravatar_hash": "c3fa7cc39c502467700f7aa870963983", "author_url": null, "date": "Dec 18, 2008", "message": "Yeah, Joel, you had the RAID 0 and 1 reversed.  0 is striping, 1 is mirroring.\n\nAn easy way to remember is that with RAID 0, 0 is the number of bytes of data you'll have after one of the drives dies."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Dec 18, 2008", "message": "One web app with an easter egg is Google Reader, which supports the Konami code, which skins the app with ninjas.\n\nGoogle Maps used to have something kind of like an easter egg--if you put directions from (say) new york to london, you would see \"swim across the atlantic ocean\" as one of the instructions.  But I think they have taken that out."}, {"author_name": "Chris", "gravatar_hash": "86972d6ee486a082e5a4f5577a9f574e", "author_url": "http://light.widgisoft.co.uk", "date": "Dec 18, 2008", "message": "@Jon; My bad - that's what I get for replying before getting to the end of the podcast :-p"}, {"author_name": "Andrew", "gravatar_hash": "97aeef6aa086aada9b5ce118d3f8e008", "author_url": null, "date": "Dec 18, 2008", "message": "Digg has an Easter egg in their code.  Details can be found here: \n\nhttp://www.tech2check.org/2008/11/digg-source-code-has-secret-message.html"}, {"author_name": "Steven Oxley", "gravatar_hash": "f5c2b8bbe83a5daa5eb2bf0b59a9d051", "author_url": "http://stevenoxley.blogspot.com", "date": "Dec 18, 2008", "message": "FYI, the phrase about scales falling from one's eyes comes from the Bible.  Acts 9:18:  \"And immediately there fell from his eyes something like scales, and he regained his sight, and he got up and was baptized;\""}, {"author_name": "Andreas Sikkema", "gravatar_hash": "d3db753afd4b35b8f171aff7f92ebb63", "author_url": "http://www.ramdyne.nl/", "date": "Dec 18, 2008", "message": "Maybe easter eggs could be fun if you're not guranteed to hit them, even if you know what the \"secret sauce\" is to hit it. This is not that difficult with a certain amount of randomization and knowing which user has hit which easter egg. \n\nThat might work.\n\n-- \nAndreas Sikkema"}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 18, 2008", "message": "Regarding the bounty for questions, I think that it's important that once someone carves off some of their own reputation to give it to someone who answers the question that the asker immediately and irrevocably loses said reputation. My fear is that someone may offer a huge bounty to their question to get lots of responses, but never follows through with the rep transfer."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 19, 2008", "message": "> it’s important that once someone carves off some of their own reputation to give it to someone who answers the question that the asker immediately and irrevocably loses said reputation\n\nGood point; maybe the cost will be 1/2 of the rep you put up, if you don't choose an answer inside, say, a week."}, {"author_name": "Andy Brice", "gravatar_hash": "c03f8fe411c21588a1bd1e37db4e2174", "author_url": "http://www.successfulsoftware.net", "date": "Dec 19, 2008", "message": "You didn't do the 'gifts for geeks' section that you mentioned as a teaser at the start of the show. You teasers!"}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://robspages.net", "date": "Dec 19, 2008", "message": "@Andy, \n\n\"Gifts for geeks\" is preaching to the choir. I don't think anyone here would have a tough time spending $x,xxxx on geeky toys for themselves. What I would like is a \"Gifts for non-geeks\" primer as my wife did not seem to appreciate the pink ethernet cable set I got her last year."}, {"author_name": "John C", "gravatar_hash": "7c22538708da8d0269441fcc803081a3", "author_url": "http://kaiseradvisor.blogspot.com", "date": "Dec 19, 2008", "message": "Wow guys, I'm usually behind you on technical issues, but Joel, you are way off saying \"The Fountainhead\" is boring. For me personally, I thought it was great! It\ns probably the most accessable Ayn Rand book too."}, {"author_name": "Maciej Rutkowski", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Dec 19, 2008", "message": "As for google organic search results: I've stumbled upon a question about iPhone 3G \"Slide to answer\" not working issue here on stackoverflow, by a google search.\nPlease, do something so that closed questions like this don't get indexed any more."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Dec 19, 2008", "message": "Your discussion of an \"elegant\" solution reminds me of this question I asked recently: http://stackoverflow.com/questions/346568/how-to-query-for-10-most-recent-items-or-items-from-last-month-whichever-is-more\n\nIn that case the answer I accepted (and ultimately used) does not have the most votes, but I still feel it is the better answer"}, {"author_name": "Dan Jacka", "gravatar_hash": "bf2fb5b622c27c5a8392d45547d5edbc", "author_url": null, "date": "Dec 19, 2008", "message": "Jeff, what's the title of the book of algorithms you studied at college please?"}, {"author_name": "Warren", "gravatar_hash": "ccb375737fec1b552a69c42cab87717c", "author_url": null, "date": "Dec 19, 2008", "message": "If one of the main motivators for the bounty system is, as you state in the podcast, that some category of questions don't seem to get answers, then why not tweak the standard reputation system to make all such \"hard\" answers worth more reputation?\n\nThe hypothetical new Stack Overflow user (who, remember, once was so important that they didn't even have to sign up) won't have any reputation to offer if his/her question turns out to be hard, and will abandon it. Then you'll get the same situation you mentioned: a search result with your question but no answer."}, {"author_name": "Nate", "gravatar_hash": "4bf1a1cbc8b716313da79cd36ef93fd4", "author_url": null, "date": "Dec 20, 2008", "message": "So in 2001 did Jeff read \"2001: A Space Odyssey\" and in almost one more year will you read \"2010: Odyssey Two\"? Because it would be logical, because that's the year on the book ;)"}, {"author_name": "Bob Weber", "gravatar_hash": "46a44f7fced6ed193281a1247d5b7a3a", "author_url": "http://blog.alltheinfo.org", "date": "Dec 22, 2008", "message": "Jeff, you are a brave man.  I was a IT admin full time for 11 years and we had the same philosophy you mentioned concerning control over the servers, so we built and ran our own systems.  After having done this, I would never do it again.\n\nAt one point we upgraded hardware and installed bright, shiny new IBM servers.  It was the day before New Years eve, and we did it so that if we had problems it would be a slow traffic time and we could correct them.  Two of us went down (the datacenter was about 50 miles away) early in the morning and installed the new hardware.  After everything was up and running we ran tests and started getting data errors in our backups.  We were down there until late, finally thought we had it figured out.  Came home, got about 4 hours of sleep and had to go back down there.  Finally got it resolved about 6:00pm on New Years Eve.  Totally sucked.  Turned out it was some kind of problem with the raid controller driver or something (I don't even remember now).\n\nAnyway, to make a long story short(er), I think onsite admins who have experience with their hardware and OS, do a much better overall job and are worth paying for.  If building and managing your own servers is just an educational endeavour, that's great, but from a business perspective I think you would be better off having professional IT support.  \n\nDon't take this the wrong way, but it's interesting to me that Joel has such strict criteria for hiring developers, but would support letting a programmer be an IT guy."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 23, 2008", "message": "> Jeff, what’s the title of the book of algorithms you studied at college please?\n\nIt's the classic\n\nhttp://www.amazon.com/Introduction-Algorithms-Thomas-H-Cormen/dp/0262032937"}, {"author_name": "Srinivasan R", "gravatar_hash": "1930ca279c8f4f19263d26952c7098d1", "author_url": "http://blogial.com", "date": "Dec 30, 2008", "message": "How about the zooming on Google Moon to view the cheese surface?"}, {"author_name": "Patrick J", "gravatar_hash": "d13c16cb15cd0a22161dcdce9f159d10", "author_url": null, "date": "Dec 31, 2008", "message": "Could somebody please get Joel to stop saying \"irregardless\"?"}, {"author_name": "Sara Chipps", "gravatar_hash": "05cd0c924cba660419d5a8ad2a2a107e", "author_url": "http://girldeveloper.com", "date": "Jan 06, 2009", "message": "HDMI cables might be a good gift for gerd (girl nerd). However, I will never forget the time my mom cried because we got her a VCR (she's pretty anti-tech). Just trying to save you some wife disappointment. \n\nAlso, I LOVE the idea of rotations. Also, I used to work at a company where we made the software to support their customer service team. For one night each month we as a team would work at the customer service center having to use our own software all night. I can't tell you how resourceful this was as we constantly came up with ways we could improve it and things that could be changed. \n\nA good improvement on this page would be making the comments async so that commenting doesn't interupt the podcast."}, {"author_name": "Jason", "gravatar_hash": "06c883c931c13cabd6989d8e3520eacd", "author_url": "http://www.calacanis.com", "date": "Jan 12, 2009", "message": "Interesting comments about my philosophy... not exactly correct--about 60% ther. \n\nWe offer both paid and unpaid answers in Mahalo Answers, and it's not really paid--it's tipping from one user to another. \n\nWe were the first folks to create a large-scale blogging network and folks created amazing content on Engadget, Autoblog, Joystiq, etc. and it worked really well. \n\nThose brands did amazing, and it was because people did what they loved *first* and were able to make a living *second*. So, passion first, money second. \n\nMoney is only one motivating factor--and its kind of low on the scale. Maslow obvious argues that recognition and affiliation are much bigger drivers.... and that was true at Weblogs, Inc. and is true at Mahalo. \n\nI'm a psychology major fyi. \n\nNetscape actually did do a major turn around in traffic for the four months I ran it... but I didn't get to spend that much time working on it.\n\nwould love to be on the podcast to explain my thoughts.\n\nall the best, j"}, {"author_name": "Petar", "gravatar_hash": "02c55869c7d9a6f83acd72ef55279e00", "author_url": null, "date": "Jun 03, 2009", "message": "@ Joel\n&gt; 59 minute, \"in C... let's say you wanna get a fifth element of the array a, you would write a[5] ...\"\n\nYou actually should write \"a[4]\". I know that wasn't the point, but I couldn't resist... :)\n\nGood show, both of you.\n\nRegards,\nPetar"}]}