{"response": [{"author_name": "Ricardo Reyes", "gravatar_hash": "a014eed44d2ca7125a1012576db75461", "author_url": null, "date": "Dec 11, 2008", "message": "Being a software developer not only has made me have very little faith in software: after working for a few years in a mobile services company (with sms, ringtones, etc) and seeing first hand how the wireless companies implement their sms platforms, I have also lost any confidence in sms!\n\nAny time I send an sms with my phone, I unconsciously calculate the chances that it will be delivered ok, based on the destination's network, time of the day, etc. \n\nSms is an amazing technology, but being a developer (and later a support engineer) has completely ruined the experience for me :)"}, {"author_name": "Ricardo Reyes", "gravatar_hash": "a014eed44d2ca7125a1012576db75461", "author_url": null, "date": "Dec 11, 2008", "message": "There's something wrong with the comments system in this  blog: after posting my previous comment, I got a \"wrong captcha error\" and got back to editing, and the form remembered my name, my email, but not the text of my comment! I had to retype it. Please see if there's something you can do about it. Thanks."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Dec 11, 2008", "message": "w00t!  I got a mention on the international sensation The Stack Overflow Podcast!\n\n(Also, if you look at the comments, for a while that answer was at 256 votes, but some people kept upvoting it anyway.)"}, {"author_name": "Andy Brice", "gravatar_hash": "c03f8fe411c21588a1bd1e37db4e2174", "author_url": "http://www.successfulsoftware.net", "date": "Dec 11, 2008", "message": "The reason why software written by hardware engineers is so crappy:\n\nProject manager: \"I need someone from your team to write the software for this device.\"\nHead engineer: (Scans room for worst hardware engineer.) \"You can have Wally, he's _great_ at software.\""}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Dec 11, 2008", "message": "I've been given the option of voting electronically or with a paper ballot.\n\nI chose paper.  I'm a programmer that doesn't trust computers."}, {"author_name": "Wayne Koorts", "gravatar_hash": "ae020e99cc0f4e8a49961da01f07aafe", "author_url": "http://www.wkoorts.com", "date": "Dec 11, 2008", "message": "Great podcast guys, I've been listening diligently for a few weeks now (and have been through some of the archived ones) and I just love the style of your podcast.  The conversations you guys have are just like the classic productive lunchtime chats we like to have with other programmers and it's great to hear the conversation between you guys, top stuff!"}, {"author_name": "Jason", "gravatar_hash": "b4e5341c8a49916615513816c6318a62", "author_url": "http://blog.asmartbear.com", "date": "Dec 11, 2008", "message": "WRT programmers starting their own companies: If you're going to do it, *now* is the best time.\n\nFor six good reasons, check out my guest post on Dharmesh's OnStartups blog:\n\nhttp://onstartups.com/home/tabid/3339/bid/7559/Start-Now-6-Reasons-Why-This-Economy-Is-Good-For-Startups.aspx\n\nP.S. I was mentioned a few podcasts ago, and just for the record, although I like Justin Standard very much, we aren't co-workers."}, {"author_name": "Vijay Santhanam", "gravatar_hash": "640b48a0bf5e3cc984bcef7b8db9a0dd", "author_url": null, "date": "Dec 12, 2008", "message": "I recommend sabotaging other companies instead of starting your own. It's more fun."}, {"author_name": "wbkang", "gravatar_hash": "75634431b8b7bc8b37cc1673d7d789e9", "author_url": null, "date": "Dec 12, 2008", "message": "Hey, Lenovo does have that sales guy discount, too if not a lot more than Dell. IBM tradition, eh..."}, {"author_name": "BaileyP", "gravatar_hash": "5fe96558ef20feb210cf4fd517e7c229", "author_url": null, "date": "Dec 12, 2008", "message": "Hey guys, Peter Bailey here - since there seemed to be some confusion about what I meant with the \"imperative vs declarative\" comment, I hope I can clarify.\n\nWhere declarative is \"this is what I am\" and imperative is \"this is how I work\", here's my thoughts: a database with lots of triggers, cascade rules and stored procs is very imperative, whereas a database that pretty much just normalized data is a declarative one.\n\nThat's all.  Thanks for playing my question on the podcast!"}, {"author_name": "Devin", "gravatar_hash": "0d5056e4e9eae910ef85ca304535f685", "author_url": null, "date": "Dec 12, 2008", "message": "1) I am an electrical engineering student and I think Joel and Jeff are wrong about hardware.  Anything that's implemented in hardware is always going to be better than software, just look at DSPs or FPGAs.\n\n2) There are are awesome deals on the lenovo site... find the outlet page and you can get a new computer really cheap.  I got a $1900 X61 for $800, brand new.  And it came with better specs than I advertised.  The only problem you have to pick from whats available."}, {"author_name": "Peter", "gravatar_hash": "745edd0ed5ca0851d9134bff34dd6588", "author_url": null, "date": "Dec 12, 2008", "message": "Jeff,\n\nYou keep bringing up how SQL Server eats memory like crazy, which is true, but not the whole story. If you already know this, which is quite possible, please disregard. There's a lot of caching going on, and a lot of that caching is not all that necessary. \n\nTo give you an example: When we moved from SQL Server 2000 to 2005 our small database was using around 50MB of RAM, without any manual adjustments to the SQL database. It would actually not grow beyond that usage. When we switched to SQL 2005, the same database started growing and growing. After about a week it could reach 300MB. Eventually it would stop growing, but this difference from SQL 2000 and 2005 got me wondering why it's using so much RAM. It turns out the caching mechanism in SQL 2005 (and I assume in 2008 though I haven't checked) changed, and it's much more aggressive, but that does not mean that the performance is severely impacted if the RAM fills up. I ran a test and actually set a limit on the amount of RAM it can use. I first set the limit to 100MB, no change in performance -- at least not visible --, then I went lower to 50MB, same thing, then I went even lower to 30MB and then finally to the minimum of 16MB. To my surprise it seemed to be just as fast using 300MB as it was using 30MB. This was probably an edge case and the load was probably not all that high. I did, however, investigate further and found this query (sorry I can remember the source):\n\nSELECT\n      (CAST(SUM(CASE LTRIM(RTRIM(counter_name)) WHEN 'Buffer cache hit ratio' THEN CAST(cntr_value AS INTEGER) ELSE NULL END) AS FLOAT) /\n      CAST(SUM(CASE LTRIM(RTRIM(counter_name)) WHEN 'Buffer cache hit ratio base' THEN CAST(cntr_value AS INTEGER) ELSE NULL END) AS FLOAT)) * 100\n      AS BufferCacheHitRatio\nFROM \n      sys.dm_os_performance_counters \nWHERE \n      LTRIM(RTRIM([object_name])) LIKE '%:Buffer Manager' AND \n      [counter_name] LIKE 'Buffer Cache Hit Ratio%'\n\nThis query will actually give you a ratio of how much of the database is cached. From what I read, if the percentage is below 90% you should consider adding more RAM, otherwise you won't notice all that much of a difference. All of my databases are between 98% and 99%. \n\nWhat value do you get for StackOverflow's database?\n\nPeter.\n\n(pbz on StackOverflow)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 12, 2008", "message": "pbz, interesting info, I get\n\n99.8930317848411\n\non the stackoverflow database server. Still, memory prices are so cheap -- and future expansion so open -- that I'd much rather have that 24 GB of RAM for a one-time fee of $600."}, {"author_name": "Peter", "gravatar_hash": "745edd0ed5ca0851d9134bff34dd6588", "author_url": null, "date": "Dec 12, 2008", "message": "http://www.devarticles.com/c/a/SQL-Server/How-to-Perform-a-SQL-Server-Performance-Audit/1/\n\n(toward the end of the page, under \"SQL Server Buffer: Buffer Cache Hit Ratio\")\n\nWith &gt;99% you're in great shape. Yes, you can buy 24GB, heck get even more, SQL Server will fill it all, but you won't notice a difference. If you're experiencing slow SQL Server performance I'd look at the queries you're running and optimizing those. More RAM, given your cache hit ratio, won't help you."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 12, 2008", "message": "Did I mention we have plans for an IT version of Stack Overflow, which will need a.. database? :)\n\nI'm also guessing that increasing our CPU speed by 50% on both tiers will improve performance more than a little.."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Dec 13, 2008", "message": "Dell salesmen are great if you are a small business, they will often extend today only deals or web specials you missed because it takes a week to get an order signed, in europe you get to speak to friendly guys in Dublin (I can't comment on the sexiness of their accent).\n\nThen when you have about 50 machines you become a preferred customer and get a dedicated salesman.Now this is the ONLY way you can place a order, you go to the website to decide what you want and then this guy sends you the quote (after a week of phone tag) but he has mysteriously added Office2007 licences to everything. So you remove that, then he adds 3year support contracts to all your servers. After a month of arguing you get down to the original web price - which is still more than todays price."}, {"author_name": "Hazar", "gravatar_hash": "80504b9408260c9eb69b382b8996fa58", "author_url": null, "date": "Dec 14, 2008", "message": "Is it just me or did IT conversations just delete all the podcasts off their servers?"}, {"author_name": "Glenn", "gravatar_hash": "d2d61b7e42209af66d32f099773c195a", "author_url": "http://kentwell.net/", "date": "Dec 15, 2008", "message": "Did Joel really say \"irregardless\" at 9:35?  Did he mean to say \"irrespective\" or \"regardless\"? :P"}, {"author_name": "Grom", "gravatar_hash": "a14537020ec5b11fea3b956353724860", "author_url": "http://grom.zeminvaders.net", "date": "Dec 15, 2008", "message": "IT version of stackoverflow IMO should see even more traffic then the programming one. There a lot more people needed to resolve hardware/software issues then programming ones.\n\nBut why scale vertically instead of horizontally?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 17, 2008", "message": "> Is it just me or did IT conversations just delete all the podcasts off their servers?\n\nI think that was some kind of temporary problem.\n\n> Did Joel really say “irregardless” at 9:35? \n\nI noticed that too, while listening to the show and writing the show notes.. LOL."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 13, 2009", "message": "> This query will actually give you a ratio of how much of the database is cached. From what I read, if the percentage is below 90% you should consider adding more RAM, otherwise you won’t notice all that much of a difference. All of my databases are between 98% and 99%. What value do you get for StackOverflow’s database?\n\nHeh, I just ran this query on our now-upgraded 48 GB of memory database server. Result?\n\n100%"}]}