{"response": [{"author_name": "Wyatt", "gravatar_hash": "1713ee920bc7545ea8a24217384b60a4", "author_url": null, "date": "Dec 31, 2008", "message": "Your forgot to post the audio."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 31, 2008", "message": "whoops, that wasn't supposed to be published yet. I blame me. Now fixed with audio."}, {"author_name": "Amr", "gravatar_hash": "2af4687daee547997f05db808ffbf042", "author_url": "http://www.amreldib.com", "date": "Dec 31, 2008", "message": "Where can we download?"}, {"author_name": "Demian", "gravatar_hash": "604189cf7ba5ff68da2fce4187994738", "author_url": null, "date": "Jan 01, 2009", "message": "Another key factor about unhappy middle-age programmers is, I think, the social status.\n\nA lawyer or a doctor has a higher social status.\n\n\"Programmer\" is not an impresive title for a middle-age man (and this is where \"Software Engineer\" comes in handy :P)"}, {"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Jan 01, 2009", "message": "@Demian I agree I think there is still a bit of a stigma around programming and working on computers on general, that we are geeks/nerds who sit at a computer all day(this may be true) typing away in our mothers basement, which in turn leaves us low on the proverbial totem pole, which tends to lower the general moral, and eventually it starts to ware on a person until they begin to loose interest."}, {"author_name": "Jared", "gravatar_hash": "c661367b25469f162f1e2ec6da8b971c", "author_url": null, "date": "Jan 01, 2009", "message": "From what I have seen, successful programmers who become unhappy when things change have already shifted their priorities to something outside of work and programming."}, {"author_name": "Ian Varley", "gravatar_hash": "f671bc1d0b48c1b03402cd6fe2c369c6", "author_url": "http://www.ianvarley.com/", "date": "Jan 02, 2009", "message": "Hey Joel &amp; Jeff - thanks for posting my question this week. I totally agree with you: continual learning is one big reason why coding is awesome in the first place. I'd have a lot less job satisfaction if I didn't have new problems to solve every day.\n\nThe second part of your answer, though--with the example of the date format in a grid--hit on what I was really asking. It's not just a matter of continual learning, which can be totally empowering. The hard part is the *trivia* - the fact that, in order to work with some new technology, you have to learn the little rules and gotchas all over again. That's learning, sure, but it's quite boring as learning goes; it's often just memorization of things that are nearly arbitrary in the first place. Would you rather learn how to, say, use MFC to make an icon blink in the Windows 98 taskbar, or instead spend that time getting a better understanding of a subject like conditional probability? All learning is not created equal, and we only have so much time (especially as we get older and our priorities change, as @Jared suggests). \n\nSo that's part of the answer: you have to be able to filter the world and keep your attention on the important things, while learning enough of the minutia to successfully get Frankenstein's monster to come alive.\n\nYou also made a good point in that there are SO MANY details in modern programming, nobody could ever know them all, nor would it really do you much good if you did. To get beyond that, you have to rely on just-in-time learning to fill gaps as needed. I think that's the earmark of someone who's going to have a long career as a programmer: the ability to confidently answer any question with \"I don't know, but I can learn.\" If you back that up with (a) strong CS fundamentals, (b) good research skills, and (c) persistence, there's little you can't master.\n\nThanks!"}, {"author_name": "Ian Varley", "gravatar_hash": "f671bc1d0b48c1b03402cd6fe2c369c6", "author_url": "http://www.ianvarley.com/", "date": "Jan 02, 2009", "message": "Hmph ... the comment markup changed my closed up m-dashes to hyphens. Should say:\n\n\"The second part of your answer, though –- with the example of the date format in a grid -– hit on what I was really asking.\""}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 02, 2009", "message": "\"Fog Creek? Who's ever heard of Fog Creek? It's just a little company, bootstrapped, no VC, no nothing, making a product you've never heard of and you don't care about.\"\n\n--Joel Spolsky"}, {"author_name": "anonymous coward", "gravatar_hash": "d46467d6c50f26795b22ed813174b43d", "author_url": null, "date": "Jan 03, 2009", "message": "Did I hear Jeff say Sata has the same connector for power and data?"}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": "http://softhardsoft.com", "date": "Jan 03, 2009", "message": "Not all of us got into programming because we wanted to learn the newest and ever-changing technologies of the moment. For me, although the learning and curiosity were factors, the real draws were solving problems and efficiency.\n\nI won't speak for others, but for me (in many cases) new languages and ever-changing technology does cause the very exhaustion that Ian Varley described. Learning the newest fad languages often means learning the new cool way to do the same thing you could already do. This is the opposite of efficiency and is stressful to keep up with.\n\nLet me be clear: learning new useful tools and techniques is incredible! But truly useful additions to the discipline are rare. It most often feels like I'm just endlessly trying to chase the latest fad because in 2 years, some moronic interviewer is going to expect me to have 2 years of experience with whatever becomes cool this year and happens to have a few years of staying-power before the next fad hits. Yes: it's tremendously exhausting."}, {"author_name": "Sergey Stadnik", "gravatar_hash": "eccdcfacff0a3aa150b47431fedb2006", "author_url": "http://sergeys-tech.blogspot.com/", "date": "Jan 04, 2009", "message": "This was the best StackOverflow podcast ever! Thank you for turning to the human side of programming and programmers. And, guys, change fatigue is real. This is why Joel doesn't know many 50-years old programmers - they just burn out by that age. Every now and then I hear that in order to remain employable in this business programmers have to keep up to date with modern trends and techologies. Otherwise they risk waking up tomorrow realizing that all their skills have expired. But but people who have jobs and families just don't have time to follow that rapidly changing area. They have to stretch themselves. And when \"want to learn\" is substituted with \"have to learn\" the breakdown occurs."}, {"author_name": "Mike Coon", "gravatar_hash": "42379cf388213f4890530a5b6e270075", "author_url": "http://mikeonitstuff.net", "date": "Jan 05, 2009", "message": "Good podcast.  Having been around a long time I find that I can safely go months or years without putting too much effort into learning new stuff that's not related to my current job and then 'catch up' fairly quickly because there are very few revolutionary changes - almost everything is a an incremental improvement or optimization of things we've been doing for years.  Sadly there is also a lot of 'innovation' that is more a re-packaging of the same old stuff."}, {"author_name": "Alex Andronov", "gravatar_hash": "d6e020dcb27dd581a644240505b1ed2e", "author_url": "http://www.gamboling.co.uk", "date": "Jan 07, 2009", "message": "Way late to the game but just catching up.\n\nI was wondering about the albeit small lack of up votes for late but good answers.\n\nIf I was searching and found one of these, and it was at the end of a long trawl round the internet, I would like to be able to give an attaboy or a mega up vote or something to give credit for it. But like bounty it would be at a cost of Karma to me.\n\nI think that could solve the problem, no?"}, {"author_name": "Demian García", "gravatar_hash": "604189cf7ba5ff68da2fce4187994738", "author_url": null, "date": "Jan 07, 2009", "message": "I think the way to go is studying profesional software development beyond CS and Programming.\n\nWe need a hole new generation of \"Software Managers\" with programming backgrounds, like Joel. People who don't write much code, but design, write specs and manage the teams. These people should have a strong tech background, complemented with some specific software business knowledge. People who doesn't get hyped with every update of .NET or every buzz word. People who understands what are real advances, which can contribute to the project.\n\nThe problem today is that most \"Information Systems\" guys lack the tech part of software development, the real stuff, and the fact that many \"Software Engineering\" courses stills orbitates around \"Structured Analysis\" or \"RUP\" doesn't help at all. Colleges are training \"Architecture Astronauts\" as Joel describes them. Mine is doing just that."}, {"author_name": "Mark Raintree", "gravatar_hash": "f1baa20f89fde6bad7aef05b2db528fd", "author_url": "http://www.raintrees.com", "date": "Jan 08, 2009", "message": "A personal discovery about SATA and RAID: I was informed recently by Adaptec that the reason a client's RAID array had failed was that I had used non-enterprise  SATA drives.  Apparently the \"desktop\" class drives have some house-keeping process that causes them to drop off-line for a short bit.  The RAID controller freaks, and decides the RAID array is gone, non-recoverable.  With the help of Adaptec Tech Support, we were able to force the array back up, as the data on the drives was actually intact.  So, I now buy \"enterprise\" class drives if I am putting them into a RAID configuration."}, {"author_name": "Jason Punyon", "gravatar_hash": "44302dd1c18f747ba4fff5f689c475ba", "author_url": null, "date": "Feb 20, 2009", "message": "Hey Guys,\n\nI wanted to tell you that I got a spark when Joel said to use your real name on the internet.  So I've started with SO.\n\nThanks"}]}