{"response": [{"author_name": "Merus", "gravatar_hash": "b7e35651f25986c1c6f61ffca814b640", "author_url": null, "date": "Dec 03, 2008", "message": "\"I argue that Apple is making real headway in mainstream marketshare, largely because they’ve won the advertising war so decisively. Joel argues that they haven’t. Which of us is right?\"\n\nAren't they up to about 8% market share from about 4%? (8% comes from The Register taking about the dipping market share of Windows, and 4% comes from In Search of Stupidity where they talked about this.) I forget the exact figures, but I understand they are actually making ground."}, {"author_name": "Ambrose", "gravatar_hash": "2fe96fe4513932ff30af562241c9db28", "author_url": null, "date": "Dec 03, 2008", "message": "I say this every podcast. \n\nIt's become a tradition, almost.\n\nAren't you guys EMBARRASSED that the audio player shows up the word \"undefined\" while the audio is playing? \n\nIf this is all some complex joke at your own expense, that all you experts can't get a simple thing like an embedded audio player right, then let me know and I'll stop pointing it out..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 03, 2008", "message": "Ambrose, thanks for the feedback. I don't know how to fix that, I've tried a bunch of settings in the PodPress options but nothing seems to work."}, {"author_name": "Albert Francis", "gravatar_hash": "6f800ac19179da49e1872391bff02948", "author_url": null, "date": "Dec 03, 2008", "message": "Just want to say that I really appreciate the podcast. Keep up the good work! :)"}, {"author_name": "Ambrose", "gravatar_hash": "2fe96fe4513932ff30af562241c9db28", "author_url": null, "date": "Dec 03, 2008", "message": "According to this page, it's a bug in the player itself and you should switch to the \"classic player\", whatever that means:\n\nhttp://tinyurl.com/6rd77r"}, {"author_name": "Jani Hartikainen", "gravatar_hash": "55c5bad99453affcd3ead8a3a6de1355", "author_url": "http://codeutopia.net/", "date": "Dec 03, 2008", "message": "Well, thought about checking out this podcast to have something to listen to while going to work and was getting bored of the local radio stations.. but why isn't the download link using Content-Disposition: attachment to force a download box? I kinda expected it to do that, and not open it in the browser in QuickTime (ugh).\n\nYes I know, right click, save as... but imo it still should do that. =)"}, {"author_name": "Jim Birchall", "gravatar_hash": "2b8ad337cc2b2f473b1b80928b21d472", "author_url": null, "date": "Dec 04, 2008", "message": "Unfortunately, the digital switch over instructional video has been removed from YouTube due to a copyright infringement claim from Twentieth Century Fox!"}, {"author_name": "Daniel", "gravatar_hash": "561e9a141a1d7ef7cd5d59266778c192", "author_url": null, "date": "Dec 04, 2008", "message": "By definition of best, someone is the best programmer in the world."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Dec 04, 2008", "message": "@Daniel: there is no such definition for \"best programmer in the world\", and the definition of \"best\" is too broad to be applicable without a context. Also I don't think there's a common sense definition either, that is entirely objective.\n\nWhat's the best president in the world?"}, {"author_name": "Andrew", "gravatar_hash": "97aeef6aa086aada9b5ce118d3f8e008", "author_url": null, "date": "Dec 04, 2008", "message": "It's a shame the video has been removed.  I saw it a few days ago and it's really funny."}, {"author_name": "Xenu", "gravatar_hash": "5d141c01640b594c1e2444ccf175bfdb", "author_url": null, "date": "Dec 04, 2008", "message": "Alternative video URL:\nhttp://video.yahoo.com/watch/3614810/9969494"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Dec 04, 2008", "message": "Here's a high-quality video link.  But this one has a laugh track for some reason that seems to ruin the joke.\n\nhttp://www.hulu.com/watch/36608/talkshow-with-spike-feresten-cable-psa"}, {"author_name": "John", "gravatar_hash": "0fc637a07270d4dfbf6958a281a5305e", "author_url": null, "date": "Dec 04, 2008", "message": "\"This is the 2^5 episode\"!!!\nWhat are you guys thinking?\nNo programmer worth anything is thinking that 32 is 2^5!\nIt's the freaking ASCII space char!\nA bit of slack to those that were thinking 0x20 and then onto ASCII space.\nThere I was yelling at you two dolts while listening to the podcast.\n\nAlso, enough with the office furniture talk already.\n\nAfter that small rant, all in all, yet another interesting round of discussion.\n\nJohn"}, {"author_name": "krishna", "gravatar_hash": "eb945f7ee7ed67a77aee96a023aeb88d", "author_url": "http://quest49.com", "date": "Dec 04, 2008", "message": "hey\ni think you guys need a podcast logo. i don't get one in itunes atleast. i would suggest you start with the current logo. and then set it out for the community to contribute."}, {"author_name": "Marcus Eklund", "gravatar_hash": "b6395f2b0f257d2e5f004fbccea28feb", "author_url": null, "date": "Dec 04, 2008", "message": "Check this out\nhttp://tech.groups.yahoo.com/group/altdotnet/message/17543\n\nStackOverflow gets some alt.net loving :P"}, {"author_name": "Tim", "gravatar_hash": "656056ac7ffbc97b499c02df119e2bab", "author_url": "http://www.guyswithtowels.com", "date": "Dec 04, 2008", "message": "Regarding the search discussion and eliminating stop words, common words, etc:  Joel's question about common words like 'handle' being important in technical material reminded me of the concordance that Amazon do to enhance their searches (or, at least used to, anyway).\n\nBasically, they analyse the text of books and look for unusual word combinations.  For instance, they find the word sequence \"kernel handle\" in a programming book, and search for it in the other books.  It turns out this sequence almost never shows up in other books/normal text, so they extract this sequence and consider it to be an important term for this book.\n\nSo you're basically using the usage of words in the text itself (compared to other texts) to detect word sequences that are significant.\n\nThey had a specific name for this (some TLA I think) - and also a page on their website explaining it, but I can't find it now.\n\nBut maybe this info is enough to seed some crazy search plan in Jeff's mind :-)\n\nMy instinct is this may be CPU-intensive though.  But maybe you can batch process it - I guess the terms don't change that often, so you could maintain a cache of 'significant' word sequences used in Stack Overflow questions, and use this list to avoid filtering out important words.\n\nEasy, eh? :-)"}, {"author_name": "Tim", "gravatar_hash": "656056ac7ffbc97b499c02df119e2bab", "author_url": "http://www.guyswithtowels.com", "date": "Dec 04, 2008", "message": "Oh, I should probably clarify - Amazon may have used it for normal searches, but they mainly used it for showing books related to the one you were currently viewing.\n\nBut that's the issue Jeff was talking about anyway (related questions), so it's ideal!"}, {"author_name": "Mike Akers", "gravatar_hash": "2336ace23e546b29059a149fac15a8c8", "author_url": "http://www.michaelakers.net", "date": "Dec 04, 2008", "message": "++ to the discussion about DVR owners stopping to look at interesting of high quality ads.\n\nOne example that comes to mind, even though it's a podcast and not a TV show on a DVR, is the <a href=\"http://www.ted.com\" rel=\"nofollow\">TED Talks</a>. There's usually  a 2 minute or so ad for one of their sponsors after the talk is over. These ads are so well produced, and so beautiful to look at that I've found myself sitting there watching them all the way through even though I know I'm done with the content of the video and I can just stop watching."}, {"author_name": "Neville", "gravatar_hash": "4e96fefc9ffe1cef80410f4fc02c6a17", "author_url": null, "date": "Dec 04, 2008", "message": "Blasphemy!  Seinfeld is always fantastic, especially the 17th time!"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Dec 04, 2008", "message": "Hey, no link to the post you allude to at the very beginning?? http://stackoverflow.com/questions/164432/what-real-life-bad-habits-has-programming-given-you\n\nI only mention it because it was my answer (\"I now consider 256 to be a nice, round number\") that you alluded to.. :)"}, {"author_name": "Joe W.", "gravatar_hash": "d0494f1d19e3c0b58cdec971bba31049", "author_url": "http://jwinter.org/log/", "date": "Dec 04, 2008", "message": "Take a look at Google's n-gram corpus for common and not-so-common words and phrases:\n\nhttp://googleresearch.blogspot.com/2006/08/all-our-n-gram-are-belong-to-you.html"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 05, 2008", "message": "> Hey, no link to the post you allude to at the very beginning?? http://stackoverflow.com/questions/164432/what-real-life-bad-habits-has-programming-given-you\n\nOops, my bad Kip. Yes, your response was the one I was thinking of! :)\n\nBTW is this your revenge?\n\nhttp://stackoverflow.com/questions/344786/which-is-better-tabs-or-spaces-closed"}, {"author_name": "Geoff", "gravatar_hash": "c05d2d1af56746acccaa04c4e3cc673e", "author_url": "http://www.geoffrobinson.net", "date": "Dec 05, 2008", "message": "The stats definitely show that Apple has snapped up market share. The question is why.\n\nHere are some theories to kick around:\n\n1) iPod gave people a chance to reevaluate the Apple brand\n2) a certain number of people are looking for an alternative to Windows and they don't see barriers to adopting Apple\n3) all the cool kids use Apple\n\nFor me it was 2. That, and I was very much intrigued as soon as they released Mac OSX. A variant of Unix with a nice GUI? Sign me up.\n\nThat and when they switched to Intel and you could virtualize Windows that removed the last major barrier."}, {"author_name": "Gerald", "gravatar_hash": "087696ca5f6bf71dba9c9d0d826ae231", "author_url": null, "date": "Dec 05, 2008", "message": "Here's a quick fix to make your \"related questions\" optimizations even better:\n\nFind the top 10,000 most common English dictionary words as they appear on StackOverflow.\nCompare this list to the top 10,000 words according to Google.\nIf the frequency of a particular word according to the StackOverflow data is greater than the frequency of the word according to Google's data ( by some arbitrary threshold ), remove the word from your list of 10,000 common words.\n\nSo if \"pointer\" is the 9,285th most common word according to Google, but the 6,594th most common word according to StackOverflow, we can see that this word is important to this domain, and it shouldn't be stripped from the query."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Dec 08, 2008", "message": "Geoff said: \"That and when they switched to Intel and you could virtualize Windows that removed the last major barrier.\"\n\nThis is a bit funny, the last major barrier that prevented switching from windows was the fact that windows couldn't be run on macs. So now, that people can run windows on Macs, are free to move away from windows. I'm I the only one that sees a slight irony in this."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Dec 08, 2008", "message": "Not my revenge, just my (successful) attempt to get the \"Peer Pressure\" badge. :)"}, {"author_name": "Larry", "gravatar_hash": "4eff6e71eb7407183ef4a5782bf7a885", "author_url": null, "date": "Dec 12, 2008", "message": "Hey Dalgas!  Congrats on the baby!  I was listening to Podcast #32, and Jeff mentioned you name, the baby, your work on Stackoverflow, and I thought, \"I wonder if that's the same guy I used to work with?\"  Then I found your picture -- sure enough!  So anyway -- congratulations again, and cool gig!\n\n-LJ"}, {"author_name": "Chad", "gravatar_hash": "ebd9e9a2cf2a51d7d2e0424de38e8e2d", "author_url": null, "date": "Dec 16, 2008", "message": "This was my first Stack Overflow Podcast I've heard, and might likely be my last.  There were some interesting topics, but I stopped listening about 15 minutes into the Podcast when Joel (?) started up on the same gripes about Macs that I heard well over 10 years ago.  \"They cost a billion times more than a PC, they make you vote Democratic, and you'll get crab grass in your lawn.\"\n\nSorry, but I'm not interested in listening to these rants."}, {"author_name": "Geoff", "gravatar_hash": "c05d2d1af56746acccaa04c4e3cc673e", "author_url": "http://www.geoffrobinson.net", "date": "Dec 17, 2008", "message": "\"This is a bit funny, the last major barrier that prevented switching from windows was the fact that windows couldn’t be run on macs. So now, that people can run windows on Macs, are free to move away from windows. I’m I the only one that sees a slight irony in this.\"\n\nWhile indeed ironic, I have a friend (not a comp sci guy) in the same boat. It is a safety net. Just in case you really, really need it."}, {"author_name": "Hraban Luyat", "gravatar_hash": "550f0dc15b7ddbbecf26eeba5a59de0e", "author_url": "https://0brg.net/~hraban/", "date": "Dec 18, 2008", "message": "This is the first time that I listen to any of those stackoverflow podcasts, and by God, it is as bad as some of the articles on joelonsoftware.com are good. The jingle is senseless, the advertisement is annoying, the jokes are lame and it takes forever before it finally gets to the point. I skipped to the part about software piracy and it was dead boring. I just stopped listening quite quickly.\n\nI do not know how Jeff Atwood writes, I generally like Joel Spolsky's writing (although he seems to be repeating himself and rehashing the same topics over and over again lately, but that aside) and I sincerely hope that this was just a rotten oyster in an ocean of pearls. I will probably never find out, though.\n\nSorry."}, {"author_name": "Tobias", "gravatar_hash": "5da4ad649b5024a46671657958ad7912", "author_url": null, "date": "Jan 12, 2009", "message": "Hi Jeff,\n\nI know it's been a while since the show aired, but i'm in the process of catching up on the episodes...\n\nI felt the same way as you about big monitors when I got a 24 inch screen. It was hard to really take any advantage of the extra size. So I went looking and found GridMove (http://www.donationcoders.com/jgpaiva/gridmove.html). Gridmove makes it easy to resize a window to a part of the screen. It makes it possible to handle your monitor so that it works like if you had two separate monitors...or three...or four..."}, {"author_name": "Mike Stone", "gravatar_hash": "c8ba7ccacc70a7b826184e8d717bfcd7", "author_url": "http://smellsblue.blogspot.com/", "date": "Feb 13, 2009", "message": "I was just catching up on the podcasts... just got to the airplane on a treadmill comment... and I gotta say I very recently saw an episode of Mythbusters where they tackled airplane on a treadmill... and the result may surprise you."}]}