{"response": [{"author_name": "Grégoire Cachet", "gravatar_hash": "7faaf83c547b6cffed44e7a5ffbfad73", "author_url": null, "date": "Dec 28, 2008", "message": "Go to http://github.com/ for social git hosting. People can branch each other easily."}, {"author_name": "Wilerson", "gravatar_hash": "169d8d1e7d3a36eda754377a55e7fea8", "author_url": null, "date": "Dec 28, 2008", "message": "Since you're already considering git, what about <a href=\"http://github.com\" rel=\"nofollow\">github</a>? It has a wiki, it's free for open source projects, and it's easy to get links to other people repositories."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Dec 28, 2008", "message": "github is indeed a nice idea, and I'm thinking about it.\n\nHowever, I am currently extremely short on time (and anyone who looks at my reputation history will see the near-plateau in my rep gains, for the same reason), so if you have a github account, you're welcome to clone off my repository, and work from that.\n\nDitto for anyone who wishes to set up a Google Code, Launchpad, Sourceforge, or whatever project. :-)\n\nIt would still be a good idea to dedicate a wiki page (or SO community question, or whatever) to coordinate this, though!"}, {"author_name": "Chakrit", "gravatar_hash": "104c34a4803355ade79413372205138a", "author_url": null, "date": "Dec 28, 2008", "message": "I think Google Code is the more natural choice. There are more tools for subversion than for git, especially for windows folks. And I think most of us is still git noob like you, let alone the concepts of distributed VCS"}, {"author_name": "Evgeny", "gravatar_hash": "35d78874c6ba5c64db3256f6868515dc", "author_url": "http://blog.kesor.net/", "date": "Dec 28, 2008", "message": "Creating an account on http://github.com and sending the code there would have taken less time imho. And that already includes a free wiki/readme display/webpage plus ssh/git/forking and whatnot.\n\nEven though git is distributed, having one central \"authoritative\" repository is still the preferred way to go. And having it on github just plain makes it easy for everyone to send changes to it -- via the 'forking inbox', instead of git-patches via mail.\n\nanswers for questions:\n1. No need for a forum to post links to repositories, and all that stuff.\n2. free wiki built into github.\n3. lots of other coders that know javascript and git, freely available on github.com as well."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Dec 28, 2008", "message": "Okay, the githubbers win. :-) I now have a github account with the wmd project: http://github.com/cky/wmd/tree"}, {"author_name": "Bernard", "gravatar_hash": "af29baa43e6e6f77180e631cea686847", "author_url": null, "date": "Dec 28, 2008", "message": "I would help, but my JS-fu is weak. Sorry."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Dec 28, 2008", "message": "@Cody (if he reads this): I would be keen to see if you have a way to programmatically translate the whole lot to Pyvascript.\n\nYou know you just can't resist...and it'd be the Best Way Ever to promote Pyvascript. :-P"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 28, 2008", "message": "Just to check, are we okay on the licensing of all of this? I can't see any licence in the WMD download, but I'm uneasy about reverse engineering something and then making it open without explicit permission.\n\nIt sounds like John Fraser was *planning* on this being okay, but it would be nice to have proper confirmation. And yes, I do understand that if we could easily get in touch with him this probably wouldn't be necessary in the first place :)\n\nI really don't want to rain on anyone's parade, but equally I'd hate to see Stack Overflow in legal trouble over this.\n\nIf it's all legally okay, then best of luck! I'd love to help, but my JavaScript is almost certainly significantly worse then Jeff's."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 28, 2008", "message": "Well the current WMD code is\n\nhttp://code.google.com/p/wmd/\n\nunder the MIT license..\n\nhttp://www.opensource.org/licenses/mit-license.php"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 28, 2008", "message": "Ah, cool. I'd only been on the wmd-editor.com site, which didn't mention that (or I didn't see it, which is equally likely). Tally ho :)"}, {"author_name": "tanda", "gravatar_hash": "5ca4136a060a2574a936cdf6881f733c", "author_url": null, "date": "Dec 28, 2008", "message": "So, what are the things that you will like to fix?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 28, 2008", "message": "> what are the things that you will like to fix?\n\nUntil we find John, simple reverse engineering is all that is needed.. a version that isn't obfuscated or using single character variable names."}, {"author_name": "Sammy Larbi", "gravatar_hash": "c765e688005e538c144a30c552fbcd22", "author_url": "http://www.codeodor.com", "date": "Dec 29, 2008", "message": "http://www.google.com/search?q=javascript+beautifier ought to take care of the minification. I didn't see you mention it, so I thought I would in case you just missed it for some reason or another. \n\nAs for obfuscation, that could mean many things, but I guess variable names are useless. At least having beautified the code you could read it easier and not worry about indenting / newlining as you rename variables and functions.\n\nSorry to be unhelpful with your primary request of finding the author, but hopefully a beautifier will help you out a little."}, {"author_name": "Derek", "gravatar_hash": "fce70acfc87f6dd6d487683dd832e9db", "author_url": null, "date": "Dec 29, 2008", "message": "Jeff, it doesn't look to me like John ever actually released wmd under the MIT license.  He just indicated his plans to do so.\n\n&gt; I'm refactoring the code, and *will be releasing WMD under the MIT license soon*. For now you can download the most recent release (wmd-1.0.1.zip) and use it freely. \n\nYou're going to be on some pretty shaky ground releasing it yourself.  It's probably something he's not going to mind, but then again he might.  People can get pretty weird about stuff they've written."}, {"author_name": "Will", "gravatar_hash": "6ae413ac6c23c6e9d9d3e0ae2e291748", "author_url": null, "date": "Dec 29, 2008", "message": "Take a look at this:  http://wmd-editor.com/terms\n\nDid you ever happen to click on something saying you agreed to that?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 29, 2008", "message": "Derek and Will -- the current WMD code is here:\n\nhttp://code.google.com/p/wmd/\n\n**under the MIT license** .. click through to the above page for proof!\n\nhttp://www.opensource.org/licenses/mit-license.php"}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": null, "date": "Dec 30, 2008", "message": "Jeff -- except that there is no code at code.google.com except the link to the code that seems to be referenced as pre-MIT license on the main page.  I couldn't find anything in the repository there anyway."}, {"author_name": "Adam", "gravatar_hash": "2a1bbd7c752e84764571f2e814f04259", "author_url": null, "date": "Dec 30, 2008", "message": "Looking at the old download page, he says:\n\n&gt; Please visit wmd.googlecode.com for information on the next release, which will be open source. (The API will be changing a lot; it wasn't really meant for public consumption.)\n\nSo it looks like the MIT license on the Google Code page refers to the forthcoming rewrite, not the current version. The old page refers to wmd being free to use but doesn't mention any distribution rights. I would guess that reverse engineering the code for interoperability would probably be OK, but branching this version would not."}, {"author_name": "shawn", "gravatar_hash": "f878a55e08bacee0af48852c29a02dc7", "author_url": null, "date": "Dec 31, 2008", "message": "ill stick to the reverse-engineer now, worry about copyright bullshit later model. very excited about using git for the first time :D"}, {"author_name": "Rob", "gravatar_hash": "f1463ac968a26c990eccf12ac6cc8eb4", "author_url": null, "date": "Jan 04, 2009", "message": "\"Worry about copyright bullshit later\" model?\n\nI'm sorry, but I'm with Jon and the rest on this one - make absolutely certain that the code you are planning on adapting is released under the licence you think it is, otherwise you may run into difficulties later, whether these range from simply being disallowed to continue using/distributing the code to a lawsuit, not that I expect the original author is the sort of person to go to such lengths, but he would be entitled to.\n\nIf there's any uncertainty about this, then you need to seek proper legal advice, or perhaps take the \"simple\" option - that is, not use the code, and start a community project to create the toolbar from scratch - I'm sure there's a huge number of Stack Overflow users who would relish the opportunity to get involved and help shape part of the site."}, {"author_name": "Kevin Ballard", "gravatar_hash": "6451ee8093c9cedc94f6c813b4dde2c5", "author_url": "http://kevin.sb.org", "date": "Jan 04, 2009", "message": "&gt; My gut feeling is that we should go with a “real” code hosting solution for this project, perhaps Google Code or the like..\n\nHow is GitHub not a \"real\" code hosting solution? I would be disappointed if you standardized on Google Code as the \"official\" repo, as GitHub offers so many benefits, including the incredibly easy forking and collaboration tools."}, {"author_name": "Charles Roper", "gravatar_hash": "93fc84c261cdce2e2f1d64c8e531ecb7", "author_url": "http://friendfeed.com/charlesroper", "date": "Jan 05, 2009", "message": "@Kevin, The 'My gut feeling is that we should go with a “real” code hosting solution' is, I believe, a reflection on Chris Jester-Young's original git repo for this project, which was located on a personal URL rather than being based on a hosted solution such as Google Code, Github, etc. \n\nHowever, Jeff has at some point updated the post to point to the Github repo which, it has to be said, does make the comment look like a slight against Github."}, {"author_name": "Derek", "gravatar_hash": "9227ac7d54e73cbf01f28c4bd95b71dc", "author_url": null, "date": "Jan 13, 2009", "message": "Jeff, it looks like you're right.  I missed the license link off to the right.  I think he still didn't explicitly release it under the MIT license, since the code is actually hosted elsewhere, but it's close enough.  Even if he got really weird and tried to sue, you'd have a pretty good case, especially with the \"use it freely\" statement he made."}, {"author_name": "Bert Lamb", "gravatar_hash": "9660903487b975d91b0de0b728297c6b", "author_url": "http://www.bertlamb.com", "date": "Jan 21, 2009", "message": "\"What about the Dufrains?  Who can eat at a time like this?\"\n\nSo what happened to John Frasier?"}, {"author_name": "Jason S", "gravatar_hash": "dd5a7ef1476fb01998a215b1642dfd07", "author_url": null, "date": "Jan 28, 2009", "message": "just curious: how are you doing the WYSIWYG diffs?\n\ne.g.:\n\nhttp://stackoverflow.com/revisions/463653/list"}, {"author_name": "Chris", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.sloppycode.net", "date": "Feb 01, 2009", "message": "Is there any reason why WMD is packed/obfuscated? Seems strange if it's under the MIT license and free\n\nI'm trying to intercept the image click button for a CMS but having problems with _8s in the source (a successful obfuscation obviously). I'll take a look at the SO source instead though."}, {"author_name": "ViX", "gravatar_hash": "44e6de2d28c3bc40554de1f3ad3966f6", "author_url": null, "date": "Apr 28, 2009", "message": "MarkItUp seems to be a good alternative for WMD\nhttp://markitup.jaysalvat.com/downloads/demo.php?id=markupsets/markdown\n\nAnd it is based on jQuery which where WMD is going to be based on."}, {"author_name": "Imanol", "gravatar_hash": "bb6db1a652d836f5afc78405b8ef02f5", "author_url": "http://www.eghoak.com", "date": "May 26, 2010", "message": "WMD?\nmmmm"}, {"author_name": "Imanol", "gravatar_hash": "bb6db1a652d836f5afc78405b8ef02f5", "author_url": "http://www.eghoak.com", "date": "May 26, 2010", "message": "My icon!?"}, {"author_name": "Jeremy Banks", "gravatar_hash": "bd192f0a40308fe9ecb9aa2a72ee8d81", "author_url": null, "date": "Feb 08, 2012", "message": "\"For now you can download the most recent release (wmd-1.0.1.zip) and use it freely.\"\n\nThis is pretty close to an explicit release, though I'd still be a little wary. I agree with the others that assuming an MIT license was unreasonable, since Jeff's statement that \"the current WMD code is here\" was incorrect."}]}