{"response": [{"author_name": "Farhan Thawar", "gravatar_hash": "e11ff07fcd3efb9ecb712dd7f8d41805", "author_url": "http://fathawar.spaces.live.com", "date": "Dec 10, 2008", "message": "Why not go virtual with Amazon or some other such host?"}, {"author_name": "Dave Ward", "gravatar_hash": "755e1277329df9e6b7e6685b21108ee6", "author_url": "http://encosia.com", "date": "Dec 10, 2008", "message": "Have you considered Azure?  Being such a high profile MVC success, they'd probably bend over backwards to make it work well for you."}, {"author_name": "Daniel Shaw", "gravatar_hash": "22830fd3f0b1349777398d4049d4a942", "author_url": "http://dshaw.com", "date": "Dec 10, 2008", "message": "The problem with buying is that servers fail and they tend to do so at the worst possible times. If you compound that with commodity parts it gets even riskier. When you rented hosted system fails, it's the ISP's responsibility.\n\nIf I were rolling out something at the level of StackOverflow, I would do none of the above. I'd host the thing on Amazon Web Services."}, {"author_name": "Sam McDonald", "gravatar_hash": "edfa6e11cb7a24c640dcb51033ffbae8", "author_url": "http://sammcd.com", "date": "Dec 10, 2008", "message": "For me personally I have been a fan of renting.  Of course personally I have only been a part of teams where we would only need 1U or 2U servers.\n\nI was a part of a team that racked a 2U server in colocation, and when it comes to one server it seems much smarter to rent.  When it came time for my company to decide, we went with renting a server from softlayer. \n\nIn this 1 server situation the cost for renting the server was practically the same as the collocation fee for our other projects.\n\nI live in Louisville so we used hosting.com, and a close friend used peak 10.  Hosting.com was a nightmare, peak10 seemed to work rather well, but I doubt you are looking to put your servers in Kentucky."}, {"author_name": "Keyvan Nayyeri", "gravatar_hash": "22957966c27e3f7edb86fac3ad234e8e", "author_url": "http://nayyeri.net", "date": "Dec 10, 2008", "message": "Jeff, \n\nI wouldn't recommend you to do this. Rental is a way much better than buying your own servers and hosting them in rack space. \n\nFor a while I was studying on the possibility of doing this for the same scale of sites when I was going to start my spam filtering service (Waegis) which required high availability and stability against security attacks, but ended up with disadvantages that it has. Hamid Shojaee (you would know him from Axosoft) shed light on this for me and told the story of his own company. \n\nWith direct rack hosting you have the option to have more powerful hardware, but some resources (like bandwidth) are limited. The worst thing can happen with a failure or problem in which you will face with many difficulties in the best form. \n\nAfter all, I would suggest you to move StackOverflow to a cloud solution (MOSSO looks like the best Windows option one at the moment and Amazon has the advantage of remote access). I guess it can resolve your issues for scaling, and can also save your money.\n\nJust my thoughts :-)"}, {"author_name": "Sam McDonald", "gravatar_hash": "edfa6e11cb7a24c640dcb51033ffbae8", "author_url": "http://sammcd.com", "date": "Dec 10, 2008", "message": "I think it is funny to see how many people are prepared to put everything on Amazon web Services.  I have already witnessed Amazon going down, and it is a funny experience, many sights don't work.  If I was to use Amazon I would only use it for big resources.  I would also have a cron that would check if Amazon was up.  In a time of failure my resources should fall back to my servers, even if they are slower.  \n\nThat might just be me though."}, {"author_name": "Gavin", "gravatar_hash": "9a382f89bcb948a8318c3edeeada7449", "author_url": "http://pedantic.co.za", "date": "Dec 10, 2008", "message": "With renting you pay someone else to worry about hardware issues. They insure that hardware, give you an SLA about replacing broken equipment, etc. When you just rent rackspace it's up to you to hang onto working backup kit and drive/courier it to the colo at 4am when the server explodes like a silicon pinata."}, {"author_name": "Brian", "gravatar_hash": "85862aa765e769149c91180e7e8d3daa", "author_url": null, "date": "Dec 10, 2008", "message": "Jeff, seriously, how much did CrystalTech pay you for advertising for them?\n\nIn my opinion, I wouldn't post the company name as it presents no significance to the issue :P\n\nGreat post though!"}, {"author_name": "Brian Boatright", "gravatar_hash": "3e1f0ea43c0a4cb33eb65ec349901feb", "author_url": "http://www.developerbuzz.com", "date": "Dec 10, 2008", "message": "I started out co-location and currently I rent 3 servers with two different providers. It's not a terrible deal and softlayer (2 of 3) is really a great place if you have to rent. Before I moved from colo to rental I tried to rent my own space at Pier10 in Jacksonville which is just over an hour drive away from me. Mind you this is about 3 years ago, and their prices for bandwidth was horrible. Most of the rental places will also rent space including bandwidth and offer tech support for an hourly fee.\n\nIf you have a datacenter close and keep critical spare parts on hand I would try to just rent the space/bandwidth and own the hardware.  IMHO."}, {"author_name": "Larry", "gravatar_hash": "10bd6f6a42b77c3cc393ddd86cce79f0", "author_url": "http://bizo-dev.blogspot.com/", "date": "Dec 10, 2008", "message": "I'm a big fan of Amazon ec2 (we host everything there), but I don't think it's going to work out for SO.\n\nThey have a dependency on a single master DB that they want to beef up from 4gb to 24gb of memory.  The max instance size available from Amazon has 15gb of memory.\n\nAmazon ec2 makes a lot of sense if you can split up your work across many machines (a good idea if you want to be able to scale).  It makes even more sense if you need to be able to scale on demand (add and remove machines as load increases / decreases).\n\nPut another way, ec2 is for scaling horizontally, SO wants to scale vertically."}, {"author_name": "Matias Nino", "gravatar_hash": "7a53888c3d36599e2d8d823269126957", "author_url": "http://dmbalmanac.com", "date": "Dec 10, 2008", "message": "Most programmers will always recommend renting because they are all inherently afraid of hardware. (just kidding). ;)\n\nSeriously: If you live close to the provider, can access the rack at any given time, and derive strange pleasure from extreme PC maintenance, OWN IT!\n\nBesides, owning your own backbone-mounted server on the net is a LIFE ACHIEVEMENT. (CHECK!) :)"}, {"author_name": "Don Dickinson", "gravatar_hash": "c4c6b2ac5b56012b3f3a98809e4cef7b", "author_url": "http://www.greatwebdivide.com", "date": "Dec 10, 2008", "message": "Hopefully this won't get long winded (apologies in advance) ...\n\nI work for a business similar to Joel's ... we have web-based software that we rent on a monthly basis. Our clients each have their own database. We have a server farm of 10 dell servers and a DAS device that we bought and rent space for at a local ISP. A year ago we had 5 servers that we leased monthly from a different ISP. We switched from renting server to owning for cost reasons. We had to pay for the computers monthly along with a maintenance fee paid to the ISP for managing the servers.\n\nThe two biggest problems we had with the renting costs were:\n1. the insane cost of memory and disk upgrades (like you mentioned).\n2. the fact that they really couldn't manage anything. their agreement said they'd do windows and sql server upgrades for us ... great, except we don't want them touching our servers. if there is a problem with a service patch or whatever, it would effect all of our 500 or so clients and we'd be in deep s**t. they also were going to help tune sql server ... great except they don't have the database knowledge or our clients needed to tune. so, we were paying a management fee for nothing.\n\nWith 2 servers, renting probably isn't so bad, but I'm sure you'll expand someday (multiple, load-balanced iis servers perhaps?). Owning has really worked out fine for us. I should qualify it by saying that we have staff enough to have redundant talents in managing windows, iis, and sql server. If you're stepping too far out of your area of expertise in managing a server, then perhaps its not wise.\n\nIn short, if you're comfortable managing the servers, I say \"BUY\"\n\nBest Regards,\nDon"}, {"author_name": "mdprice", "gravatar_hash": "01b30058589c398a1ac882c39d820538", "author_url": null, "date": "Dec 10, 2008", "message": "While it may save you money it costs you time and energy. How valuable is your time? While you may love working with hardware (yeah you built Scott Hanselman a computer) it's not your core competency. And as such dealing with it will only take your focus away from the real problems you are trying to solve. When you mind is thinking about how to build the best server it's not thinking about making stackoverflow kick more ass! (yes, a better server will help but not as much as other areas)"}, {"author_name": "Brian Boatright", "gravatar_hash": "3e1f0ea43c0a4cb33eb65ec349901feb", "author_url": "http://www.developerbuzz.com", "date": "Dec 10, 2008", "message": "I should have read my post one more time. I meant Peak10 not Pier10.\n\nI would second a vote for Azure as long as there was no significant code changes that are required and you have a plan to move back to a server if it fails. \n\nThere are a lot of excellent data centers or ISP's. Which allows you to easily move around if one fails you in customer support or connectivity issues.\n\nThe cloud services seem like a good idea until they fail and more concerning is that they limit your mobility. There is only one Azure."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 10, 2008", "message": "> Put another way, ec2 is for scaling horizontally, SO wants to scale vertically.\n\nTrue, I should have mentioned that. We aren't really in a position (yet) to scale by adding (n) new web tier servers. Honestly, our bottleneck is the database 90% of the time anyway."}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://robspages.net", "date": "Dec 10, 2008", "message": "Who is going to administer the new server? By that I mean, who will handle hardware failures, software patches and general maintenance? If you do go with your own server, you're taking the first step toward hiring a dedicated hardware/networking guy/gal and that's something to consider. As much fun as building a server sounds, you're getting more than just hardware for your rental dollars and that needs to be a part of the calculation."}, {"author_name": "Ben", "gravatar_hash": "8fb95bde97cca5563771aafb7eeeab01", "author_url": null, "date": "Dec 10, 2008", "message": "I have no experience with this situation yet, but I'm waiting to see the price of Azure before I do anything for my upcoming website."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Dec 10, 2008", "message": "Forgive me if this is a dumb question, I've never needed to know about these kinds of things before.\n\nI assume that if you own the server, then you must be located somewhere physically near the rack space that you are renting, since there is no one to (say) install a new stick of RAM.  Is this correct?  Or do the rack-space rental guys actually do simple tasks like this for you?\n\nI don't think finding rack space near San Francisco or New York City would be a problem, but what if someone were located in rural Montana (which is to say, anywhere in Montana)?  Would their only option be to rent the server or spend lots of money flying to wherever their rack server is?"}, {"author_name": "Karl", "gravatar_hash": "6f448664cd294829b9ed0cd356f91cb1", "author_url": "http://www.codebetter.com/", "date": "Dec 10, 2008", "message": "You say that your bottleneck is the database as though that justifies scaling vertically. Memcached, sharding, replication, clustering is really what you should be talking about (in that order). Its more cost effective, performs better, can improve reliability and can actually scale. On the down side, it requires changes to your code and thus increases its complexity. Yes, that's a serious downside, but you just can't scale vertically very well and will have to do it right at some point (far easier now than a year from now).\n\nAlso, you're only looking at hardware cost. What does it cost to run a version of windows and SQL server that supports 48 gigs of ram?\n\nBuying vs renting is a good question worth discussing, but you're having it for the wrong reasons. \n\nOh, and any host that charges $4.00/gb overage seriously sucks."}, {"author_name": "Matt Sherman", "gravatar_hash": "3d24f5a7acad9a9263fb1b8eae946ca6", "author_url": null, "date": "Dec 10, 2008", "message": "I've been using GoGrid for my startup and it's been decent so far. A little glitchy here and there.\n\nThe virtual providers all seem to realize that RAM is the limiting factor for scale, and so that's where the premium is. It's too bad, cuz RAM is so cheap otherwise. Maybe one of them will break out of the pack and cut prices."}, {"author_name": "Levi Figueira", "gravatar_hash": "6ec0b4cf6042cac0dcca47dd7c7ac7f4", "author_url": "http://levifig.net", "date": "Dec 10, 2008", "message": "Rent AND disperse. \n\nUse a main VPS for your application and prepare your application to be able to store data on other servers/databases. Keep your databases \"small\", by range of content, so you can easily scale them to several boxes. Use \"cloud services\" like S3 to store files, etc...\n\nAvoid your own server. Your own server is only cost-effective during the 2nd or 3rd year: during the first, renting is cheaper and over 2-3 years hardware upgrades mean more cost. Add to that the fact that if you go with a good host, you have all the support and \"hot-swap\" done by them, which lowers your internal staffing costs...\n\nJust my 2¢ :)"}, {"author_name": "Levi Figueira", "gravatar_hash": "6ec0b4cf6042cac0dcca47dd7c7ac7f4", "author_url": "http://levifig.net", "date": "Dec 10, 2008", "message": "Oh, and don't use Windows/MSSQL...\n\n\n:p (had to fit the rant here ;)"}, {"author_name": "Robin Goodfellow", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Dec 10, 2008", "message": "@Brian, I hate the idea, which seems to be growing in strength, that any mention of a commercial product must be some form of advertisement. I think that model, some sort of bizarre corporatist aristocracy, is fundamentally anti-consumer. I'd rather live in a world where there is an open and honest discussion between individuals about actual experiences with products than a world based on competitive advertising.\n\nI think most people would rather live in a world where \"advertising\" efforts were focused primarily on attempts to make products of high enough quality to encourage spontaneous word of mouth recommendations from appreciative buyers."}, {"author_name": "John S.", "gravatar_hash": "54b75f6fbf4434162bfcda6b0cb9b86b", "author_url": "http://john-sheehan.com/blog", "date": "Dec 10, 2008", "message": "Don't buy unless you make everything redundant (load-balanced servers, reliable switching, etc). If it's still cost effective then go ahead and buy. Server maintenance sucks, is unpredictable (who handles an outage while you're on vacation?), time-consuming and costly. If you must buy, hoard spare parts.\n\nAlso interested in your software licensing costs. BizSpark?"}, {"author_name": "Sascha", "gravatar_hash": "085d8d30ad6b776915b90cfb11dbda8c", "author_url": "http://beached.as/", "date": "Dec 10, 2008", "message": "At the company I work for we've got a great arrangement where we lease/rent-to-buy. Cost of the server is paid off over a period of time meaning no large upfront costs and the monthly bandwidth bill is more than the lease payments anyway.\n\nOur operations team is based down under but the servers are hosted in the US - we do all configuration and maintenance from this end. However because of the large amount of business we do if we need more RAM, a drive replaced, physical reboot or whatever the hosting provider is more than happy to take a walk down the hall and do this for us.\n\nWe looked at Amazon when getting our most recent server, however, like Jeff, we weren't yet at the stage where this was going to provide any benefit. 12 months down the track it might be... but not yet."}, {"author_name": "Diego", "gravatar_hash": "df679bd3d287a21d5ed6020bae384e17", "author_url": null, "date": "Dec 10, 2008", "message": "As others have mentioned. Try Amazon's web services. Add new instances as you need them. Or try Microsoft's Azure. Although I don't know how cooked that is at the moment, may not be ready for prime time."}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://px.denniswilliamson.us", "date": "Dec 10, 2008", "message": "Redundancy is definitely a must for owned equipment.\n\n@Robin Goodfellow: Excellent points. And CrystalTech is definitely worthy of the highest word-of-mouth recommendations."}, {"author_name": "Ryan Doherty", "gravatar_hash": "5877d375dc4cf7762e49979c306c7f95", "author_url": "http://www.ryandoherty.net", "date": "Dec 10, 2008", "message": "If your bottleneck is the database 90% of the time, why don't you just add another database server? Master -&gt; slave or Master  Master.\n\nYou could have 50% of the reads go to each and 100% of the writes go to the master.\n\nThis might be cheaper than buying another enormous server."}, {"author_name": "Tomasz Wegrzanowski", "gravatar_hash": "98e5e1f8fb2da8322a032e3ff2d7e668", "author_url": "http://t-a-w.blogspot.com/", "date": "Dec 10, 2008", "message": "My experience with Amazon Web Services has been so good it changed my way of thinking about servers. It's just so unbelievably simple to spawn and kill servers at a whim, copy a server to play with its configuration without killing the known good version, start old version from a snapshot from any point in time, and there are no annoying sysadmins to spoil the fun. Performance problems? You can resize servers or spawn extra servers in minutes. If you need an extra demo or continuous integration box, it's minutes.\n\nI wouldn't believe how much difference AWS would make before I tried it, but it's really a Ruby on Rails of servers."}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Dec 10, 2008", "message": "I would personally buy if my case was like yours however.  I think you are totally over spending on the web server at least with the quad core CPU.  The web server is pretty much just a pass through from the database, so the load shouldn't be that high on the CPU."}, {"author_name": "Stu", "gravatar_hash": "1b72849488a30c948c2e3fa42f56216e", "author_url": null, "date": "Dec 10, 2008", "message": "Can I ask why you are moving from RAID 5 to RAID 10? What benefits do you think this will give you?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 10, 2008", "message": "\"For safety and performance favor RAID10 first, RAID3 second,\nRAID4 third, and RAID5 last!\"\n\nhttp://www.miracleas.com/BAARF/RAID5_versus_RAID10.txt"}, {"author_name": "mark", "gravatar_hash": "b634f0dcc3d5aefb94bc3192e51db539", "author_url": null, "date": "Dec 10, 2008", "message": "Buying your own makes more sense if it never falls over. However if it does, or might fall over, the lack of one point of responsibility will cause you a lot of grief, time and cost.\n\nHaving said that, if you are set on buying two servers i would highly recommend buying the same two servers, with exactly the same drives, exactly the same RAM etc. Just reduce the number of CPUs, drives and RAM on the web server.\n\nThis way you can canibalise the parts in an emergency or an upgrade plus you can reconfigure between the two servers if needed."}, {"author_name": "Portman", "gravatar_hash": "57dcebe24f9d0359c214d21c8844c849", "author_url": "http://www.gratisinternet.com/careers/", "date": "Dec 10, 2008", "message": "Our company is on the Windows/ASP.NET/MSSQL stack and has grown from 4 servers to 75+ servers over the last three years, so I've definitely lived this exact dilemma. \n\nBelieve it or not, at low server volume, the key cost driver is not rackspace, power, bandwidth, servers, or software; it is NETWORKING EQUIPMENT.\n\nYou need a gigabit network between your DB and Web tiers. Between the cloud and your web server, you need firewall, routing, and VPN devices. The moment you add a second web server, you also need a load balancing appliance. The upfront cost of these devices can easily be 2x the cost of a handful of servers. \n\nHosting providers like CrystalTechachieve economies of scale by sharing these networking appliances across hundreds of customers. In our experience, owning didn’t become equitable until we hit 8+ servers.\n\nMy $0.02: negotiate with CrystalTech for dramatically lower RAM prices. They have monstrous margin on the RAM in high end servers and will usually be willing to cut prices in order to keep you as a customer. I bet you could 8x your RAM (to 32GB) for only $200/mo if you ask threateningly."}, {"author_name": "Bryan", "gravatar_hash": "4a330b7317cb51cafd60b0c345922744", "author_url": null, "date": "Dec 10, 2008", "message": "You should still scale horizontally.\n\nMove all the user account to a separate database.  Move all the search data to a separate database (I think you already did that).  Start moving questions+comments to a cluster of databases.  Either have a lookup service that decides which database a question belongs to, or hash it.\n\ni.e. slug.GetHashCode() % 5 == database # in a 5 machine cluster.\n\nThrowing bigger hardware at the problem seems like the easy solution, but it will more often than not cause you to put off the real critical changes until later when they are that much more difficult to implement.\n\nCode momentum is a bitch.  Scale out horizontally now while it's still relatively easy!!"}, {"author_name": "tomjedrz", "gravatar_hash": "2bd698effae7c91dc93711e1568a2c72", "author_url": null, "date": "Dec 10, 2008", "message": "Greetings.\n\n1- I would not advise purchasing over renting .. the cost savings is illusory when you add in the costs for making redundant, administering, dealing with problems, etc.\n\n--&gt; I'll bet you can cut a deal with CrystalTech to get an upgraded server.\n\n2- If you must buy, have a pro (i.e. a business partner or reseller) spec and build the server.  I like IBM .. but getting exactly the right adapters, memory and disk is tough and if you make a small error you could spend *hours* pulling your hair out over it later.\n\n3- How will you deal with backups?\n\nGood luck!"}, {"author_name": "pavel", "gravatar_hash": "a07bbd52832cf33da41677d0d31f659e", "author_url": null, "date": "Dec 11, 2008", "message": "The reason why we go for owning instead of renting are the unacceptable clauses practically all hosters have in their contracts. If you actually find the time to read them, you will be astonished what you are not allowed to do, for example you must not use the server as proxy for tcp connections, and the provider reserves the right to terminate the service for so many reasons that you are totally at the mercy of the provider. Although it might not happen so often in practice, it is a matter of principle for me not to accept a contract that practically guarantees nothing. Another issue is backups - all contracts I have seen state that if you use their backup facilities and they lose your data, you are not entitled to any damages. Same with availability. So if you want want to provide a reliable service, you have to take care of backup and redundancy yourself. You may rent servers at two different hosters, though.\n\nWhat we typically do is to buy servers from a supplier like Dell where you can get up to four years on-site maintenance within 24 hours, and we had a good experience with that."}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://fordmotorsport.co.uk", "date": "Dec 11, 2008", "message": "With all the above options presented to you Jeff, I'm very interested in which options you finally decide to choose as I am in a similar position to you.\n\nNo doubt this will be covered in a future podcast or blog post :)\n\nGood Luck"}, {"author_name": "Don Dickinson", "gravatar_hash": "c4c6b2ac5b56012b3f3a98809e4cef7b", "author_url": "http://www.greatwebdivide.com", "date": "Dec 11, 2008", "message": "an addendum to my previous post:\n\nI neglected to give one of the best reasons for owning your own ... its very, very easy to move to a new ISP should the need arise.\n\n-Don"}, {"author_name": "David", "gravatar_hash": "200cc24cc0555d1c6bd14b5a7fe8f852", "author_url": null, "date": "Dec 11, 2008", "message": "What do the numbers say about buying vs. renting?\n\nThis assumes the cost of the server at $3,150, and to get the same server would cost $300 a month for rent.\nThe only variable is rack space; if rack space is $20 per month then it will take 11.25 months to break even.\n\nIf rack space is $ 100 a month then it is 15.75 months.  \n\nIf rack space is $ 170 will take just over 2 years.\n\nAnother variable is how long will that server last?  Is it 2 years?  \n\nIs it 2 years, then buying is your option if rack space is $20 a month.  You will save about 3,500 over that year before you replace.  At $100 a month it is $1,650 at $170 a month you will lose $30.\n\nIf the server last 4 years for rack space at $ 20 a month you will save 10k, at $ 100 a month you will save $6,400 at $170 a month you will save $3,000.\n\nFor 3 years the numbers are $6,930 for $20 a month, $4,000 at $100 a month, and $1,530 at $ 170 a month.\n\nIt all depends on the rent for rack space, and how long the server will last.  These numbers may not be exact because you didn’t state how much it would cost to rent the server and the rack space.  This does show how renting vs. buying, you can fill in your own numbers."}, {"author_name": "Mr. Shiny &amp; New", "gravatar_hash": "d78a43ac94c1c0d6cf5740efd7574928", "author_url": "http://eternalephemeron.blogspot.com", "date": "Dec 11, 2008", "message": "As David mentioned, you need to consider the math of the rental costs, plus the sysadmin costs, plus arcane accounting like depreciation and such.  Because you're running a business, rental costs may be considered fully tax deductible while purchasing of assets may not be.  So you need to consider this in your full calculation.  You also need to account for risk, because there are different risks involved in managing something yourself vs paying someone to do it."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 11, 2008", "message": "> This assumes the cost of the server at $3,150, and to get the same server would cost $300 a month for rent.\n\nThere's no way to compare this apples-to-apples; the same server would cost probably a thousand dollars a month at the current rental rates for RAM upgrades. Plus, they don't offer RAID 10, nor do they offer the 50% faster CPU we'd be using, etc.\n\n> I bet you could 8x your RAM (to 32GB) for only $200/mo if you ask threateningly.\n\nUh, no."}, {"author_name": "Eric Z. Beard", "gravatar_hash": "62cc585b9fd3ee7182dadbd09a7f4b47", "author_url": null, "date": "Dec 11, 2008", "message": "I can't imagine renting for something that's getting as big as Stack Overflow.  You've got to own your stuff, so you can manage it yourself.\n\nOne thing about your specs - 7200 RPM drives?  What?!?  Get 15K drives.  IO is probably your chief bottleneck (which makes RAM so valuable, since the more that is cached, the less IO is needed).\n\nWith a 6 disk 2U server, an option I like is 2 controllers - a RAID 1 for 2 drives and a RAID 5 (or 10) for the other 4.  Dell sells Poweredge 2950s with this configuration, which I use for my database servers.  You should get two identical boxes, split up different parts of the database between them, and be ready for either one to assume the entire load if one fails.\n\nYou're probably getting to the point where having data files, transaction logs and tempdb on the same spindles is hurting you, which means you might want to start looking at a DAS (a SAN would be ideal but WOW are those expensive).\n\nAnd what about backups?  Where are you putting them?"}, {"author_name": "Don Dickinson", "gravatar_hash": "c4c6b2ac5b56012b3f3a98809e4cef7b", "author_url": "http://www.greatwebdivide.com", "date": "Dec 11, 2008", "message": "hey, one more thing ... i listed to the latest pod cast and you were discussing failing raid arrays. i've had some fail in the past too. every one of the failed ones have been sata of some sort. i have never (knock on wood) had a scsi array fail. put scsi in your server; there's a reason it costs more imho:D\n\n-don"}, {"author_name": "warren", "gravatar_hash": "236948f12dbe8789edb8238298c61593", "author_url": "http://antipaucity.com", "date": "Dec 11, 2008", "message": "I would recommend Hosted Solutions. They have several colo data centers, and they're very fast."}, {"author_name": "Portman", "gravatar_hash": "57dcebe24f9d0359c214d21c8844c849", "author_url": "http://www.gratisinternet.com/careers/", "date": "Dec 11, 2008", "message": "&gt;&gt; I bet you could 8x your RAM (to 32GB) for only $200/mo if you ask threateningly.\n&gt; Uh, no.\n\nUh, yes. \n\nJeff, NOBODY pays list price for RAM upgrades. The only reason they would NOT offer you this deal is if you were on a month-to-month contract. If you're on any kind of term, then they still make margin at $200*12mo or $200*18mo minus the cost of the ram (which is probably $700 today).\n\nIf CrystalTech doesn't discount, then ask for Don at DataPipe, Ben at Logicworks, Gregg at Verio, or send me an email for two dozen other companies that would definitely give you high-RAM servers at an affordable rate. \n\nIt's a bummer for antisocial people like us, but the only way to find out the ACTUAL prices in the hosting business is to pick up the phone and call. The list prices are simply not even remotely accurate."}, {"author_name": "Francis", "gravatar_hash": "4e96e258e9d3bd640f9917d0ebda2639", "author_url": "http://www.roborooter.com", "date": "Dec 12, 2008", "message": "For the record don't go with mosso, they are very not reliable. I think now is the time to work out how to get your app to run on several lower powered (ie, 4gig not 48 gig) boxes rather then push for large hard to replace or ever move off of boxes. That way you can stay affordable, when it comes time to move, or replace hardware and you won't ever need two gigantic machines. On top of that you could keep it going with vps's and start instances around the world closer to your audiences. Take a page from your reddit friends, a single db master is tough to maintain as you grow. They said the hardest move was from one box to two (that's not talking about moving the db server onto it's own hardware).\n\nAlso 15k rpm drives for your db server and keep the transaction logs on a different set of spindles if you can."}, {"author_name": "Craig", "gravatar_hash": "f70b8a0f18c3ce7477996dca13dce53b", "author_url": null, "date": "Dec 13, 2008", "message": "Two different twists on the approaches to consider ...\n\nif you intend to pursue the purchase, check out the SunStartup programme, as a fledgling startup you'll get hardware at approx 20-25% and support included, the latest gen Intel/AMD systems from Sun are extremely well-built.\n\nAlternatively, if you decide to rent, then why not look at Joyents Accelerator line (OpenSolaris hosted zones), which offer you the incremental upgrade opportunities you want and scale far beyond what you require, whilst keeping the commitment low. At one point the SunStartup and the Accelerator programme could be combined giving very cheap solutions.\n\nJust a satisfied customer of both over time ..."}, {"author_name": "gh", "gravatar_hash": "55567d4148518f34e9dcf43b79d08674", "author_url": null, "date": "Dec 13, 2008", "message": "how much disk space does the db actually use?\nhow many transactions per second (peak)?"}, {"author_name": "Mathieu Arnold", "gravatar_hash": "1b81525081fe9dd2adda2d8a10af1473", "author_url": "http://w.mat.cc/", "date": "Dec 13, 2008", "message": "Something about the other side of the pipes.\nI own a hosting company, and we always prefer when our customer own their own servers. Mostly because if they're not happy, they only have to take the server somewhere else, they don't have to do a painfull and dangerous migration from one server, to another.\nI've seen a reference to server going down, well, yes, things that rotate stop rotating from time to time, but, hey, that's why it's very hard to get your server without the 3 year support from the constructor, being next business day, or 4 hour.\nIn our ten years of business, we've had things breaking, mostly hard drives (and a fan, from time to time), it happens, but, with RAID, it may slow things a bit, but it won't crash the server, and that drive will be replaced in 24 to 48 hours.\nAlso, servers don't, hum, get old that fast. I still have a few customers p4 with 2GB of RAM and 18GB hard drives running perfectly fine.\nIt will cost you more at first, but the server price is usually between 10/15 months of rental, so, after say, the first year and a half, you're winning."}, {"author_name": "Scott Elkin", "gravatar_hash": "e5248bc28b17c988e92aee3eef37c1e8", "author_url": "http://scottelkin.com", "date": "Dec 14, 2008", "message": "It is not the hardware you need to be concerned about, but the 2-proc SQL license you will need to buy."}, {"author_name": "Bryan Rehbein", "gravatar_hash": "6a20b8b9b511574b68518a4e66be8820", "author_url": null, "date": "Dec 17, 2008", "message": "Judging by how well Stack Overflow is growing, I would recommend that you start thinking about running your own servers.  It of course costs more money up front, however you are more flexible to do what you need to do with your hardware.  Also, RAID-10 is awesome in a heavy read/write database workload!\n\nAnother thing I think is worth mentioning, look into the AMD64 Opteron CPUs, they truly have out-shined Intel in a majority of server applications.  MySQL databases have been known to perform poorly on Intel under certain workloads (I know you are using MSSQL).  If you do go Intel, try to get the parts that have the memory controller on-die, which are the really new chips.  \n\nLook into the Sun x64 servers, they have been known to out perform Dell servers of similar configuration and they are priced pretty well, you just have to contact them first.  You can usually get 20% off the list price by asking.  \n\n** Sun also has a 'Startup Essentials' program where you can get Sun hardware for extremely small amounts of money! **\nSun Startup Essentials: http://www.sun.com/emrkt/startupessentials/\n\nGood luck!"}, {"author_name": "Bryan Rehbein", "gravatar_hash": "6a20b8b9b511574b68518a4e66be8820", "author_url": null, "date": "Dec 17, 2008", "message": "Oh yeah, also...\n\nSun x64 Servers RUN WINDOWS!  Despite all the mis-information and old information abundant on the 'net."}, {"author_name": "TorgoGuy", "gravatar_hash": "75a18d19362b3c207483389772ac664f", "author_url": null, "date": "Dec 19, 2008", "message": "For many, renting makes sense, but if you need a not-so-standard configuration, owning is the way to go. I think you're heading in the right direction, Jeff.\n\nI use SuperMicro bare bones for my projects. I've had good luck with them. I need quite a few spindles, so I use their 2U servers that support 8 SAS/SATA drives. Skip the onboard RAID and use a quality PCIe card unless you know the onboard RAID is good (or if you're not CPU-bound and want to go the software RAID route--I'd love it if ZFS was available on Windows). \n\nI spec out cards with good RAID6 perf (in both fully online and in 1-dead-drive degrade mode). I recently started using Adaptec's new line is controllers and have been very pleased. With large arrays (GB-wise), RAID6 gives you SO much more safety during a rebuild. HD manufacturers really need to work on their BER with today's huge drives. Most people don't realize just how vulnerable these big (GB-wise) arrays are when rebuilding. Most of us don't have mission-critical stuff where we COULDN'T go to a backup, but I prefer to not have to."}, {"author_name": "Jason Jackson", "gravatar_hash": "6577dde0800361864cd804c7245da581", "author_url": "http://jasonjackson.com", "date": "Dec 19, 2008", "message": "Jeff,\n\nIf you do go the non-rental route I would by two database servers and use one of the many clustering (fail-over, not performance) solutions available.  At very least if you are mirroring all of the data to the second db server (various solutions are available to do this) when the first db server fails (when, not if) then you could manually switch your internal DNS, connection strings, or whatever to get you web tier to start using the second db server instead of the first.\n\nStackOverflow isn't exactly mission critical.  While downtime costs you money, a few minute probably doesn't hurt you a lot and doesn't cost any lives.  Go with that criteria I wouldn't get too worried about having instantaneous recovery, which will limit the cost and complexity of any db fail-over solution you implement."}, {"author_name": "Jonathan Forck", "gravatar_hash": "8c1a6105aa281aae0a33a2cd7ad103ac", "author_url": "http://0xCAFEBABE.net", "date": "Dec 19, 2008", "message": "Jeff, \n\nI completely agree with your decision to own your hardware.  I have both hosted and rented.  Renting is very nice when a project is in it's infancy, but once you get to the point you have to start thinking about redundancy it will turn into a headache.\n\nWhat happens the first time you have to throw a port sniffer between your web server and your load balancer?  For that matter, if you do not currently have a load balancer, what happens when you want to add one?  Or if you ever host confidential / PCI data (Perhaps adding online store)?  \n\nBy the way, you were saying that you have DB issues,  might I suggest a master/slave relationship where all writes go to the master and reads go to the Slave.  This has dramatically reduced downtime and response time in my experiences.\n\n~Jon"}, {"author_name": "anon", "gravatar_hash": "c510febb9bed68b5cc4a09f076701e0f", "author_url": null, "date": "Dec 19, 2008", "message": "SCSI. It's a database server. \n\nIntel's new SSD would be my dream for log files and the tempdb. You can get one for ~$700 now:\nhttp://www.intel.com/design/flash/nand/extreme/index.htm"}, {"author_name": "Chris Lively", "gravatar_hash": "e2e5ae48ba8cb80b89bbc5fb14c8f8f8", "author_url": "http://www.livelyconsulting.com", "date": "Dec 23, 2008", "message": "Buy.\n\nThe various cloud solutions have a major drawback: once you change your stuff to work in a particular vendors cloud it requires a lot of rework to move it out if you need to.\n\nI have sites with rented space (also on CrystalTech), I also have my own servers colo'd.  At the end of the day, I can build a new fast quad core server with 8GB of for less than $900 (excluding licenses).  You can't rent something like that for the money.\n\nAlso, look at what the big guys have learned: buying Dell, IBM, etc is not an option.  They are outrageously expensive for what you get.  Shop newegg and build your own."}, {"author_name": "Aaron", "gravatar_hash": "efc7a06f93b76251d63dba00ca33debb", "author_url": null, "date": "Dec 23, 2008", "message": "&gt;One thing about your specs - 7200 RPM drives? What?!? &gt;Get 15K drives. IO is probably your chief bottleneck &gt;(which makes RAM so valuable, since the more that is &gt;cached, the less IO is needed).\n\nI second this.  Jeff definitely don't buy SATA drives for a SQL server, you need SAS 15K drives.  That is why the price of your server is low."}, {"author_name": "Josh Schairbaum", "gravatar_hash": "d09a92ae8d780537e32b0936bb48a8b2", "author_url": null, "date": "Dec 23, 2008", "message": "Until there is a cloud that can become PCI-certified for each merchant on it, I'll stick to physical servers, rented or purchased.  It would certainly be possible, but Amazon isn't going to be willing to have their ROC cover me on EC2."}, {"author_name": "Steve Robillard", "gravatar_hash": "22691c0615b6fd46e55c34fa53e1100d", "author_url": null, "date": "Dec 25, 2008", "message": "Have you checked ebay for your drive racks. I had the same problem with a Dell server a few years back.\n\nHTH,\nloved your idea of a good xmas eve LOL"}, {"author_name": "Jay Godse", "gravatar_hash": "e804c2930b1827a52df3b489af28722e", "author_url": "http://www.squidoo.com/sqlitehammer", "date": "Jan 02, 2009", "message": "The costs of these solutions are not always clear-cut. For example, if you own the servers, how much do you have to pay for in-house IT support, power, cooling, firewalls, redundant connections, fault-tolerance, etc? If you rent, these costs are built-in (except some in-house IT support), but are they excessive?\n\nThat aside, buying versus renting comes down to cash flow, growth,  and opportunity costs. \n\nIf you have steady cash flow, then buying may make more sense. If your cash flow goes up and down unpredictably, then maybe something like Amazon EC2 makes more sense. \n\nIf your site is growing rapidly, then you will spend a fortune on server configuration, upgrades, expansions, and performance/utilization monitoring, and the IT staff to do all of this stuff. Amazon EC2 may make more sense.  If your site is not growing, and uses a set of servers \"efficiently\", then owning your servers makes more sense. \n\nIf you are in a lucrative high-margin business (e.g. with a high opportunity cost for not spending on business development), then it may make more sense to invest cash in business development than in the server solution that compromises short-term and medium-term cash flow. If  you are in a steady low-medium margin business, (e.g. with a very low opportunity cost for spending on business development) it may make sense to invest in the server solution that cuts medium-term and long-term costs. \n\nIt's a tough choice. I hope this helps you make a better decision."}, {"author_name": "Max", "gravatar_hash": "70182795ae84b99d25d76640d05b4646", "author_url": null, "date": "Jan 31, 2009", "message": "Buy, buy, buy! :)\n\nIf you have the expertise/confidence to deal with the hardware yourself, including buying cheap parts off the web, you'll save a ton of money for all but the most trivial of environments.\n\nA couple of items I firmly disagree with, especially from the last 4 years of experience:\n\nServer failure risk: Complete, catastrophic failure is just not that likely for modern, current hardware. Individual components such as a memory module or disk may fail, but the replacement cost only gets lower with time.\n\n10k/15k SAS disks: Blogga, puh-leez! They're far more expensive than any possible benefit. Current commodity SATA disks will do 50-120MB/s sequential and approximately 1/10th that for random I/O. You might double that with the 15ks, but at a much higher than double price premium. \n\nIf you need the I/O performance, just add more disks. They're cheap. Array with SAS expander (e.g. from SuperMicro) and HBA/RAID should run you well under $1500 for 24 slots. Less than double that for the whole thing with disks. $3k for 6TB (mirrored) at 120MB/s fully random writes.\n\nIf someone can get either the space or the performance out of 10k or 15k disks for that price, I'd be interestd to know."}, {"author_name": "Samuel Dass", "gravatar_hash": "44d1b62e262cfc22e5f3b0f6c4a5cb6a", "author_url": "http://blog.officeclip.com", "date": "Feb 15, 2009", "message": "Few months ago we moved from colocation to managed hosting. The determining factors were warranty cost + cost of the machine + colocation cost + os cost Vs. cost of renting a similar hardware from a managed service provider.\n\nThe later was the winner."}, {"author_name": "Chris", "gravatar_hash": "aa059c5e579dca83584281ce70e14603", "author_url": null, "date": "Apr 07, 2009", "message": "If you're going to rent rack space and buy your servers, you should really invest in remote management.\n\nI don't know what IBM calls their solution, we use mostly HP servers, but theirs is called iLO. Their marketing fluff here: http://www.hp.com/go/ilo"}, {"author_name": "netrackindia", "gravatar_hash": "9cdab61cd015c176b0ab4c7a109693ea", "author_url": "http://www.netrackindia.com", "date": "Feb 03, 2010", "message": "NetRack is world wide manufactures of network components like Server racks, Network Racks, Power Distribution Unit, Cable Organizer, Cable Runways, Lab Racks, Wall Mount Racks and Fiber Distribution Unit etc."}, {"author_name": "netrackindia", "gravatar_hash": "9cdab61cd015c176b0ab4c7a109693ea", "author_url": "http://www.netrackindia.com/", "date": "Feb 06, 2010", "message": "NetRack is world wide manufactures of network components like Server racks, Network Racks, Power Distribution Unit, Cable Organizer, Cable Runways, Lab Racks, Wall Mount Racks and Fiber Distribution Unit etc.."}, {"author_name": "Mike", "gravatar_hash": "4422407f0746ed36ae883fb729bd78f4", "author_url": null, "date": "Mar 10, 2010", "message": "Netrack blah...  stuff the advertisements and stuff overpriced IBM/HP.\n\nI built my own server for 1/4 the cost, its fast redundant and mine. \n\n1. Stop overpaying for Intel CPU's.\n\n64 gig quad core opteron 2.8 gig(83xx), 4 terabytes raid 10, redundant, management option etc for 4500$, hot swap, backplane and redundant power supplies. For another 1500$ i stomp that box in the dirt :)\n\nI can bump it to 8 way also.\n\nNow simply colo it.  Leasing is only going to get you bent over the table.  Managed? please.\n\nAny kid can swap a hard drive.  You want true redundancy you need multiple boxes in multiple locations.\n\nI think we have alot of server admins here trying to say running a web server is difficult :) Its called install and forget.\n\nWhen you colo if your costs go up you simply take your ball and go play elsewhere.  Leasing your way overpaying again.\n\nManaging a server is not difficult either nowdays. Theres a 9 year old MCSE in Turkey who can handle that for you or you can easily do it yourself.  Its called \"set updates to install automatically\"... :)\n\nThe server has an issue it will text you and let you know."}, {"author_name": "Emile", "gravatar_hash": "4e0e017412def5f7f6c19ed90cd8f8e5", "author_url": null, "date": "Jun 09, 2010", "message": "Well this is probably herism. But why don't u scale the software by using memcached and solr configurations, instead of relational dbs? If sites like facebook, dig and other massive sites have incorpored such techniques i don't know why stackoverflow should be an exception."}, {"author_name": "Hostage", "gravatar_hash": "27dbb88b54207e983a45397d8861ed23", "author_url": null, "date": "Nov 05, 2010", "message": "hey im just thinking about buying 2 servers myself for this business class im in and starting my own i guess server business, ( what ever its called) can i get some opinions? i have like $7-8k to spend. might get a loan still in the works. but if i bought the 2 servers and some quipement as you say spare parts. and learned a bit of knowledge would making money be an issue for a resonable price?"}, {"author_name": "Tuan Bara", "gravatar_hash": "795c0e3f7876335e0adc387e034dff0f", "author_url": "http://industrialuninterruptiblepowersupply.com/?tag=power", "date": "Jan 08, 2011", "message": "I have been exploring and searching for a little bit for any high-quality articles or blog posts on this kind of area . Exploring in MSN Search I at last stumbled upon this site. Wow, great, finally. Upon Reading this info So i’m happy to convey and realize that I've a very good uncanny feeling I discovered exactly what I needed a lot. Thanks a lot. I most certainly will make certain to of course don’t forget this website and give it a glance on a constant basis to compare it with my industrial uninterruptible power supply websiteDefinitely believe that which you stated. Your favorite justification seemed to be on the internet the easiest thing to be very well aware of. I say to you honestly, I certainly get annoyed while people consider worries that they just don't know about. Well,You managed to hit the nail upon the top of the hill and also defined out the whole thing without having side-effects , people could take a signal. Once again I say directly to you I Will probably be back to get more. Good Day"}, {"author_name": "cpanel hostin", "gravatar_hash": "fa62d56d42723f13156d2e1041090c8f", "author_url": "http://www.cirtexhosting.com", "date": "Sep 30, 2011", "message": "Good Post . Nice technical post"}, {"author_name": "Nidia Birch Calderon", "gravatar_hash": "b32c47ce271ebabb1330685c9466eb49", "author_url": null, "date": "Oct 14, 2011", "message": "Please remit all past due accounts to the following \n\nAttn: Td Bank Trust Accounts\n1489 P street NW \nWashington Dc 20005\n\nAttn Nidia Calderon Trustor \n1333 N street NW\nWashington Dc 20005"}, {"author_name": "racksserver", "gravatar_hash": "94ef978cd96fda9a0facd6796763601d", "author_url": "http://www.serverracks.in/", "date": "Apr 06, 2012", "message": "Server Rack, Server Racks, Server Racks manufactures, Server Rack cabinet, Data Center Rack, Server Racks cabinets, Server Enclosures, Network cabinet, Network Enclosures and Network cabinets dealers and suppliers in India.\nServer Rack, Server Racks, Server Racks manufactures, Server Rack cabinet, Data Center Rack, Server Racks cabinets, Server Enclosures, Network cabinet, Network Enclosures and Network cabinets dealers and suppliers in India, Network cabinets manufacturers, Network cabinets manufacturers in India."}, {"author_name": "wayne", "gravatar_hash": "583dce5b0560875a2e32e82123e27902", "author_url": null, "date": "Apr 09, 2012", "message": "I build servers for a living, and if you are a small to medium business, you might look into building your own server. Cost today is around $1200-2000. for an Intel i7 core CPU, 16 gb mem, 1tb HD.\n\nUsing Centos Linux (which is free), you have a full working web server, email server, sql server, etc.\n\nYou can use Webmin to remotely manage the server.\n\nContrary to popular opinion, you can get a medium connection to your local ISP, a decent speed Internet connection will run you about $ 100. a month.\n\nYou then do not have to pay per mhz for usage of your website or email fees. Need more email accounts, add an additional hard drive to it.\n\nYES, it is NOT 100% reliability, but then you are NOT paying high fees every month. In about 3-4 years, you will need to scrap the unit anyway as it will be obsolete hardware wise, the way computer equipment is going."}, {"author_name": "serverrackssecurity", "gravatar_hash": "942f05aaf402702739dd8fb28d9c2253", "author_url": "http://www.serverracksecuritysolutions.com/", "date": "Apr 21, 2012", "message": "http://www.serverracksecuritysolutions.com/\n\nData center Rack Security, server rack security system, Rack Security Solution, Server Rack Security, Network Rack Security Solution in India, Network Rack Security Solutions dealers and suppliers in India, rack security solution and server security solution.\n\nServer Rack Security, server rack security system, Data center Rack Security, server rack security solutions, Rack Security Solution, Network Rack Security Solution, Rack Security Solutions, Network Rack Security Solutions dealers in India, Network Rack Security Solutions dealers in India.\n\nReally good ......."}, {"author_name": "kvmconsolesolutions", "gravatar_hash": "4681f23b1e54894c74e698f348194903", "author_url": "http://www.kvmconsolesolutions.com/", "date": "May 03, 2012", "message": "KVM, Port KVM Switches, KVM Switches, KVM Console, LCD KVM Console, KVM Console Switch, IP KVM Switches, KVM Console Switches dealers in India and KVM Console Switches suppliers in India.\n\nFor more details please visit http://www.kvmconsolesolutions.com/\n\nReally good ……."}, {"author_name": "kvmconsolesolutions", "gravatar_hash": "4681f23b1e54894c74e698f348194903", "author_url": "http://www.kvmconsolesolutions.com/", "date": "May 03, 2012", "message": "KVM Console Switches dealers in India and KVM Console Switches suppliers in India.\n\nCheck this http://www.kvmconsolesolutions.com/ this really helps."}, {"author_name": "Geekyard", "gravatar_hash": "656712753ab3428403b6a5655210b662", "author_url": "http://www.geekyard.com", "date": "Jul 04, 2012", "message": "Is it good to buy a new server and run website on it or to adopt web hosting plan?"}, {"author_name": "Mouli", "gravatar_hash": "4207c8e485b95aba4e5d70f484aeb136", "author_url": "http://Tamilcloud.in", "date": "Jul 28, 2012", "message": "Nice ."}, {"author_name": "Najlepsze hotele", "gravatar_hash": "09b67ba27a1c1462d6dcda2dbdb67ef8", "author_url": "http://spanko.com.pl/index.html", "date": "Sep 29, 2012", "message": "Hi,\nWell in Poland does not have much choice. There are only 2 good servers.\nRegards"}, {"author_name": "Microscope Amscope", "gravatar_hash": "99e621685c9d0c0bee412609ce22d9a9", "author_url": "http://reliable", "date": "Oct 14, 2012", "message": "Hey loved the article thank you"}]}