{"response": [{"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Dec 23, 2008", "message": "Another lesson about social engineering I guess ... Can't wait for more info on your next stackcast."}, {"author_name": "Aaron Digulla", "gravatar_hash": "8a4d6f03a8879432d8563aefbf48e787", "author_url": "http://www.pdark.de/", "date": "Dec 23, 2008", "message": "Thanks for the insight and especially for deciding not to lash back. I feel that too many people believe in the \"hit them harder until they learn\" loop which only causes grief on all sides involved and it's refreshing to meet people who don't."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Dec 23, 2008", "message": "I hope you're actually keeping the original votes, so that if you're effectively \"accusing\" people of fraud and they can convince you that they're innocent, the votes can be restored.\n\nKonrad Rudolph has lost nearly 6000 points, which I *assume* is due to this change. See http://stackoverflow.uservoice.com/pages/general/suggestions/93741-massive-reputation-loss\n\nI don't know Konrad personally, but I doubt he's actually created another account to upvote that many times...\n\nAs an example of how this could go wrong, Marc Gravell and I regularly answer similar questions - and I regularly upvote his answers as they're usually excellent. I guess he probably upvotes mine, too. That might *look* like fraud - heck, we've often commented on how we answer questions almost identically at almost the same time. We really are two people, however...\n\nMaybe Konrad's loss was unrelated to this. All I'm saying is that it's a dramatic change which is likely to have some unintended consequences - so I hope these vote deletions are \"soft\"."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Dec 23, 2008", "message": "I don't think Konrad has up voted himself he also posted a item explaining strange up voting patterns he noticed for his profile:\n\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/42791"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Dec 23, 2008", "message": "@Pop: Indeed. I've noticed strange voting patterns myself before now - particularly getting heaps of badges in a short space of time:\n\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/87373-are-badges-broken-\n\nHowever, I suspect this isn't *actually* dodgy at all. My guess is that someone's read one of my answers (or Konrad's) and liked it - then looked at some of our other answers and liked those too. It's a bit like buying books - is it \"suspicious\" that I bought \"Ender's Game\" and then very soon afterwards bought several more books by Orson Scott Card? Not at all - that's the way these things go.\n\nGiven that Jeff was surprised at how many \"suspicious\" upvote patterns he saw, and the odd results we're now seeing, I think it would be worth rolling the change back and investigating it a bit more carefully. Patterns which seem suspicious at first can easily have entirely harmless explanations."}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "Dec 23, 2008", "message": "I lost around 1800 points, and I suspect it's because some people I know voted up all my stuff early on (just after public release, I think). Sort of like \"Hey Greg, I found you on this new stackoverflow.com and voted up all your answers! Yesterday *and* today!\" Not much I could do about it."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 23, 2008", "message": "Since you asked, most of Konrad's drop comes from one particular user with an unusual and highly consistent voting history. I don't want to single anyone out here, so if Konrad is curious he can email me directly..\n\nMight be related to this:\n\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/42791"}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Dec 23, 2008", "message": "I think Jeff's findings must have a pretty good level confidence, 6000 rep points is 600 votes. It all depends on the timeframe, the votes were cast, the percentage of the votes that were given to a single person and the number of accounts involved in the voting pattern.\n\nIf 600 votes were given by 60 accounts then the confidence is low even if a sequential pattern is noticed, and if those accounts have a small percentage of votes given to Konrad.\n\nOn the other hand if 600 votes were cast by one or 2 accounts, and the percentage of votes given to Konrad is high then there's a high confidence of some sort of automation.\n\nI think only Jeff could shed some light on this."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Dec 23, 2008", "message": "Seems I was a bit late on the last reply ..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 23, 2008", "message": "I'm not blaming anyone, maybe Konrad has a #1 superfan or something.. as I said, it's unclear why this happens, but it's unlikely to be \"normal\" and thus will be removed."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Dec 23, 2008", "message": "Out of interest, have the votes effectively been \"rerun\"? I'm just imagining this situation:\n\nGood user X posts 5 great answers\nBad user Y votes for each of them (+50)\n10 good users vote for each of them (+500)\n\nAt this point, only 200 rep has been gained due to the limit - but there's a lot more \"potential\" rep. When you removed the votes, did you take account of that \"potential\" rep to bring the rep back up to the rep limit?\n\nI suspect the whole time-based rep limit makes your life a lot harder than it would be otherwise - it means you have to rerun history every time something changes in the past :( Interesting problem, admittedly..."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Dec 23, 2008", "message": "I should just clarify that I find the reputation system fascinating in the same way that I always try to fully grok the rules of any game I'm playing. Social manipulation - in this case with honorable goals, don't get me wrong - is also very interesting. I love to see how people *do*  play the system, even within the rules.\n\nFor instance, if I were really trying to maximise reputation (vs time taken on the site) I'd answer \"fluffy\" questions early in the day to get votes, then limit myself to narrow technical questions later in the day to get accepted answers. Fortunately I'm not quite that sad... but I like to think about what I *would* do even if I don't actually do it :)"}, {"author_name": "Paul Tomblin", "gravatar_hash": "99660662e89949a4b53cd97bc199ead1", "author_url": "http://blog.xcski.com/", "date": "Dec 23, 2008", "message": "I lost a gross of 213 points overnight (133 net because I also got 8 upvotes in that time).  I resent the implication that I was doing some sort of vote fraud, but I guess I should be thankful I'm not Kondrad."}, {"author_name": "Paul Tomblin", "gravatar_hash": "99660662e89949a4b53cd97bc199ead1", "author_url": "http://blog.xcski.com/", "date": "Dec 23, 2008", "message": "And of course, right when this happens, the sof.modos reputation tracker is off-line.  I'm guessing it hit a bandwidth threshold for the site as all the unbelieving reputation losers hit refresh over and over again to see if it came back."}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Dec 23, 2008", "message": "Alright, I've lost 5k reputation on 15k. 50%.\n\nWhat I found ridiculous is that a LOT of time I reach 200 reputations in less than half a day and the rest was \"lost\". Why if I would cheat that I would continue to get these reputation for nothing if it's not to contribute? When you fixed the reputation count and reduced those up/down vote that you found as \"cheat\" have you at least consider those vote that wasn't count when reached 200? I do not think so.\n\nMore, I really do not understand your \"down\" vote penalty. If someone post something bad, it's my right to down vote. If this guy edit is post, is my right to take off my down vote or maybe up vote him. I do not see how it can be penalized.\n\nFor the up vote, if I understand well, I can penalize other people by starting becoming a fan of them and upvote them everytime they post something. Pretty easy with the recent tab (or to use my vote tracker) to do that. If people hate me they juste have to vote me up few day in a row and I will be penalized?\n\nLast thing, have you think before taking out that Konrad, or I have a lot of useful post and answer here. Have you think that we are using our free time for you to take out all those subjective stuff and duplicate content and all that for nothing. In fact, we were applying you rules and this morning we got penalized for no real reason because I haven't do anything intentionnaly (well I might poke a lot your server with the reputation tracker... just tell me to stop...).\n\nInstead of doing that you should try to find a way to stop people re-open post. Last week I had to close about 50 times the same post that was duplicate (with 4-5 others people who were helping me). Those post were not belong to SO, is that what make me lost 50% of my reps?\n\nI have no email, no message, just a 50% lost of rep. Nice job."}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Dec 23, 2008", "message": "Euhh not 50% lost but 30% lost oops and I am out of here. You think I cheated, alright for you. Now my free time will go helping somewhere else."}, {"author_name": "Quarrelsome", "gravatar_hash": "890b18939e1eae1eecc193478a7c57e9", "author_url": null, "date": "Dec 23, 2008", "message": "But Daok, rep isn't everything! Newsgroups are teh awesomesauce for help and chat but no rep there!\nStackOverflow is just nice, rep or no rep IMO. There is also a message about it, here and now on this blog.\n\nJon, I start to wonder if one automatically qualifies as \"that sad\" if one has thought about maximising their rep to such an extent. ;)\n\nI don't think I got touched by the vote fixing, my rep is as low as it ever was. :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 23, 2008", "message": "Bear in mind that rep recalcs also cause rep from deleted questions to be lost. Paul, in your case, 30 downvotes were cast against you in a single day.. not very subtle. Those votes are now deleted."}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Dec 23, 2008", "message": "I care about losing that much. Having loss 1-2k wouldn't hurt me, but now, without any explication, I just found it offensive. I wasn't spamming, I wasn't doing anything against the FAQ. I was not only answering a LOT of question but asking a LOT of good question (not those subjective useless question) and I was finally (without gaining nothing) finding duplicate and close them. At the end, the administrator just rip me off 5k reputations without any warning (IF i did something wrong because I do not have any explication). It's like if this morning you get at job, and you have a 30% salary reduction without notice. I have follow your rules, if I broke one of them, tell me which one but at this time your rule is only your FAQ and I haven't broke them neither your TOS."}, {"author_name": "Quarrelsome", "gravatar_hash": "890b18939e1eae1eecc193478a7c57e9", "author_url": null, "date": "Dec 23, 2008", "message": "Additionally I'm not sure that people think anyone in particular is \"cheating\". Framing would be an equally easy and entertaining motive."}, {"author_name": "Paul Tomblin", "gravatar_hash": "99660662e89949a4b53cd97bc199ead1", "author_url": "http://blog.xcski.com/", "date": "Dec 23, 2008", "message": "It would be a greater loss to this site to lose a contributor like Daok or Konrad than whatever harm supposed \"vote fraud\" was causing."}, {"author_name": "Konrad", "gravatar_hash": "6bb589be93f99d855dfef40239420085", "author_url": "http://madrat.net/", "date": "Dec 23, 2008", "message": "Hi Jeff, thanks for finally figuring this problem out. Needless to say, I was quite shocked about the massive dent in my reputation but it makes sense, especially since the perpetrator has come out into the open.\n\nAs to Jon: even without the confession, the pattern was quite clearly *some* kind of fraud, since, for example, all my answers with negative scores got systematically upvoted over the course of these days or weeks."}, {"author_name": "Paul Tomblin", "gravatar_hash": "99660662e89949a4b53cd97bc199ead1", "author_url": "http://blog.xcski.com/", "date": "Dec 23, 2008", "message": "Yes, Jeff, I remember when somebody expressed some annoyance at something I said, and \"coincidentally\" I got 30 downvotes in the next few hours.  I believe I wrote to you at the time it happened.  What I'm talking about today was an overnight 133 net loss, even though the tracker at sof.mosdos showed only 7 upvotes and no down votes.  See http://blog.xcski.com/2008/12/23/what-happened-there for a screen shot."}, {"author_name": "Paul Tomblin", "gravatar_hash": "99660662e89949a4b53cd97bc199ead1", "author_url": "http://blog.xcski.com/", "date": "Dec 23, 2008", "message": "Are you saying that Konrad and Daok lost all those points not because of anything that they did, but because some other user's sock puppet voted for them?"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Dec 23, 2008", "message": "Jon, I've also been the recipient of several badges in  the space of a few minutes.  At the time I assumed, as you did, that it was just one person who liked one of my answers so much that they decided to \"reward\" me for it.  It didn't raise a flag at the time, but it certainly does now.\n\nPaul, I agree that it would be a shame to lose contributors like Daok and Konrad.  I also think it's important that we not be quick point fingers at everyone who lost reputation over this.  The reputation they gained may have been through the questionable actions of others, not through actions of their own.\n\nJeff, is there any chance that you can make public the code you used to analyze questionable behavior?  It might set some minds at ease if we could see in black &amp; white what you're considering questionable behavior."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 23, 2008", "message": "Daok, in your case, 234 and 230 votes came from the same two users -- these users had unusual vote patterns and all their upvotes were deleted. For reference the sort order is 234, 230, 12, 11, 9 .. when sorted by # of votes by user -- just to show you how anomalous that is!\n\nAgain, I'm not accusing anyone of anything. I'm just making the system detect and remove highly aberrant voting patterns.\n\nThis has the unfortunate side effect of destroying \"superfan voters\" who vote up everything someone does, but it's unavoidable, I think."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 23, 2008", "message": "> Are you saying that Konrad and Daok lost all those points not because of anything that they did, but because some other user’s sock puppet voted for them?\n\nI'm saying they gained artificially (not necessarily through their own actions), so that *artificial* gain is now lost.\n\nIn your cause, Paul, I suspect you had some deleted questions/answers in the system. Remember that rep is lost from deleted questions/answers when rep is recalculated, which is a rare and almost manual process.\n\nRep from deleted questions and answers *WILL* be lost eventually. It'll just take a long time, because rep recalc is pretty rare."}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Dec 23, 2008", "message": "How the hell can I block these user I haven't see the button yet after spending about 300 hours on your site? By the way I must have about +100 vote for Jon, I am a real human ... or a really bright bot lol? Ridiculous. Of course maybe Jon has MORE fan and the sort order might be less drastic...\n\nWhat about the 200 limits? Have you adjust to get those vote from other people over that 200. I suppose my super fan vote wasn't always when I have reach that limit?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 23, 2008", "message": "Daok, the two users in question have a vote history that looks like this, when sorted in descending upvote order:\n\ndaok - 234 upvotes\nnext user - 4 upvotes\nnext user - 3 upvotes\n\ndaok - 230 votes\nnext user - 2 upvotes\nnext user - 2 upvotes\n\nMy point is that the only votes that were removed were HIGHLY anomalous."}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Dec 23, 2008", "message": "234 votes on me on how many? Are they top user that have spent 234 votes on me and votes 800 votes on other?\n\nThese vote have been removed after or unders the 200 limits/ day? If before 200 limits, votes that I get AFTER the 200 limits has been counted or not? Because I am totally agress that you remove them but if \"normal user\" vote me up AFTER the 200 limits, it's totally normal that I get those vote up because the \"fan user\" have took the reputation place that these other user would have been. You cannot remove all those reputation without giving reputation from other people that hasn't count. I can't believe with all the answer I gave that I loss 5 000 reputations."}, {"author_name": "Chris", "gravatar_hash": "0710bb2f7d812c6e977d1b943f71e667", "author_url": null, "date": "Dec 23, 2008", "message": "\"easier to earn reputation by posting great answers and questions than gaming the system\"\n\nActually Jeff, it is easier to earn reputation points by posting to a controversial discussion which is generally subjective than to post a technical question.\n\nAnswer a pretty deep technical question, even if it takes you an hour to do it, and often you get nothing.   If the issue is so deep that only the poster and 1 or 2 other people care, you will finish all that effort with just 1 or 2 upvotes.  In the end it is not worth the effort.  Why get 1 or 2 upvotes when you can just answer a subjective question (often just putting in a controversial viewpoint with little technical merit) and you can easily end up with 10 or 20 upvotes.  From a time versus effort payoff, answering a subjective question is often more fun because you can spout your opinion, it is often easier, and you get a million upvotes."}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Dec 23, 2008", "message": "Some people HATE me because I close subjective post. If they are 2-3 they can hit me this way. Let say that I upvote Jon and some people do it too. And we vote him early in the day to take all his 200 first reputation. IN 3 months you will remove all theses \"fan post\" and Job will lost 200 reputation x 3 months. ... but in fact he shouldn't get reputation from people who voted him after this 200 reputations limits, you get it?"}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 23, 2008", "message": "Jeff, you should really consider taking into account upvotes that did not result in a rep gain due to the 200 rep/day cap when undoing votes that did result in a rep gain which you do not appear to be doing.  If you don't do this, you actually create a fantastic vehicle for revenge voting.  For example, if I decide that Jon Skeet has enough rep for now and needs to be slowed down a bit, I can upvote 20 of his answers at 12:05 am UTC when they all will likely result in a rep gain and wait for your check to remove those 200 points at a later date; the net effect is that he lost the potential to gain rep from votes that day.\n\nI wasn't affected by the recent recalculation but I am afraid that if you don't go about this in a more fair manner we may lose some very valuable members."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Dec 23, 2008", "message": "@Jeff: There are two other items I think you should look at (And I've been meaning to put a Uservoice request in, I'm just not sure how much of that you actually read):\n\n1) Comment deletion.  Currently comments are the only feature on the site that can be deleted without being rolled back or 'undeleted'.  There was a case in this thread: http://stackoverflow.com/questions/384764/dealing-with-anti-microsoft-trolls-on-the-internet where many, many comments were deleted; some of those comments were attempts to achieve consensus, others were asking for clarification. All were deleted.  If a mechanism for 'undeleting' comments existed, it would serve to keep a 'paper trail' on the discussion on a question that can be deleted by an arbitrary user.  I would recommend adding an 'offensive' flag to comments as well, so they could be deleted if enough users thought they were offensive (appropriate reputation level notwithstanding)\n\n2)  The ability for the same user to open/close questions ad infinitum.  Once a particular action has been taken once, it cannot be re-taken by the same user.  \n\nWith regards to vote fraud: It's been an issue on my mind, only because I am one of the individuals that prefers to keep the focus of the site more narrow than others; but I also have wide latitude for \"Wiki\" questions.  I also am a proponent of rules for moderators to follow (as outlined here: http://stackoverflow.com/questions/302923/wiki-rules-for-stackoverflow-closed), but neither idea has gained traction as far as I can see."}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Dec 23, 2008", "message": "@Robert Gamble: Exactly what I am saying. But do not be afraid, this will happen in a near future. \n\nI haven't cheated, I can prove it by cheating in the next weeks... since now I know how to do it on other account. The fun begin? Jeff I am waiting your \"go\". But I do not want to do that... come one we are all programmers here... this will end in a fight of bot. I have a lot of free time since you \"fire\" me of your website, and I can get easily few other programmer that are angry too but I am sure we can find a adult way to be all happy. You are a programmer Jeff, not a detective, that's for sure. Find a way that all will benefit. I do not think losing people that haven't been offensive, that was applying YOUR rule (FAQ) and was answering YOUR members questions is the way to go.\n\nAdjust the reputation. What you just did is only provocation and insulting me big time because I haven't been against your TOS. My account is clean and has been dirty by others (and this morning by you with your public action)."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Dec 23, 2008", "message": "Daok some people don't agree with your authoritative actions, they don't hate you, you're just too boneheaded to listen to others. \n\nYesterday you used a script with a timer to close one of my questions for being subjective, even though some people thought it was not, and demanded to be reopened. Then you used your army of clones to downvote it ...\n\nWhen the community asks for a question to be reopened, and you keep closing it using a timer, because you think it's subjective, you won't gain many friends.\n\nCheck you own answers, half of the reputation you got was from subjective answers and questions."}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Dec 23, 2008", "message": "half of the reputation you got was from subjective answers and questions? Get me number of that. I have only answer 1 cartoon thing in my beginning and 1 t-shirt thing. THis is not 8 000 reputations? Give me a break.\n\nYesterday I was just closing post that Kevin was closing and \"Cash\" what closing before me. They got all their comments removed and all the time re-open by the OWNER. THis has made me have to close it about 30 times. I did it from my PC. Not BotNet... And, an army of bot is more than only 1 :P Trust me the day an army of bot will hit SO you will notice it.\n\nI have APPLY the FAQ rules. If you do not agree, ask Jeff to remove Subjective and DUPLICATE. THis was totally duplicate yesterday. Just the title was changed!"}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Dec 23, 2008", "message": "&gt;just too boneheaded to listen to others.\n\nJust to let you know that this post was downvoted at -8 and people who agree upvoted this post. So I guess the boneheaded wasn't me. at -8 the post whould be automaticly deleted tss"}, {"author_name": "Ross", "gravatar_hash": "7b264437c3c5a8621765158cf4ef6b88", "author_url": "http://rgoddard.blogspot.com", "date": "Dec 23, 2008", "message": "Rather then going back and removing the reputation points would it not make more sense to prevent the reputation gains to begin with. \n\nYou would just need to identify irregular voter/votee pairs and store that in a table. Then when ever you see that pair occurring for an upvote, ignore it. Then just periodically update the table. \n\nTaking away people's reputation points will cause more problems and opens the system to more abuse as other people have explained. Plus you create the impression that reputations points can be lost at any moment. They have value because of the work it took to earn them, and that they do not just disappear. Taking the points away ruins that illusion. \n\nAny changes in the reputation policy should always apply from this point and forward, never backwards (any cases which do should be very rare)."}, {"author_name": "DrJokepu", "gravatar_hash": "973c6e2cf1ae9f6615dd883eb14597b1", "author_url": null, "date": "Dec 23, 2008", "message": "Thank you guys. I mean, seeing people who are much more intelligent and competent than me behaving such a childish way makes me feel much better about myself."}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Dec 23, 2008", "message": "http://stackoverflow.com/questions/389096/is-stackoverflow-biased\n\nThis is duplicated. I would close it. But I know that someone will reopen it. This is duplicated. \n\nThe system is so *weak* that someone will reopen it 10 times against me (so I wont close it, happy?). Now it's even *weak* the way you punish people because you cannot code this system correctly and you have open hole that let other punish other by trapping them without they even know it! It's *weak* because if you wrote comment in post and people can delete it without being notice... so they are not point to write comments in SO. (I have already write on UserVoice about that few months ago without any answer of course). This system is *weak* because now it has so many people with \"power\" that it's like not having any moderation, people can reopen their own question if they desire, or close what ever they like (I have posted a solution in UserVoice, without answer of course).\n\nI can write a whole list of weak point of your system, but I have the feeling that you will just find a way to remove me 5k more reps and close your eye on that. \n\nI created a tool for your website that is open source, I was ready to help for API, ready to be involve on the construction ... not to cheat it???\n\nThe whole system is Cool... but *weak*.\n\nWhat ever you give me some reputations, or none, or full reputation, I do not believe on this website anymore. I will keep track of this blog post until I see what you will do, but you just lost someone active on your website. I know you do not care ... not yet."}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Dec 23, 2008", "message": "@DrJokepu : The day you will give your time for free and be kicked in your back (without warning) you will understand that you do not feel happy. But you might be too mature to understand that... sorry to be so emotional this morning."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Dec 23, 2008", "message": "I would like to point out the fascinating fact:  an upvote changes a user's rep by five times as much as a downvote (+10 vs. -2), and upvote-fraud was about five times as prevalent as down-vote fraud.  It may be a coincidence, but the economist in me says that it is the invisible hand of the market at work."}, {"author_name": "DrJokepu", "gravatar_hash": "973c6e2cf1ae9f6615dd883eb14597b1", "author_url": null, "date": "Dec 23, 2008", "message": "I agree with kip, this is really fascinating. I think this whole voting fraud issue is a great opportunity fto create some interesting (and anonymous) statistics with the data available so that we can get a better understanding how \"voting black markets\" work."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Dec 23, 2008", "message": "Well the black market hasn't begun selling SO reputation yet ... has it?"}, {"author_name": "baltimark", "gravatar_hash": "924758d9f3c72e7d8b0eaab75466de8e", "author_url": null, "date": "Dec 23, 2008", "message": "daok -- do you get what Jeff is telling you? \n\nTwo key things:\n\n1) The upvotes you received were 234, 230, 12, 11, 9. . . \n\n2) The two users who gave you 234 and 230 had upvote voting patterns of \n  a) 234, 4, 3. . .\n  b) 230, 2, 2. . .\n\nEven IF there is nothing shady going on, a reputation of 5000 from that voting pattern is probably not indicative  of what the group collectively thinks about you as a poster. \n\nIt doesn't matter if the FAQ doesn't say that. It doesn't matter if there really are two users who love you, and you alone so much that they've crazy-upped you. \n\nJeff (apparently) wants reputation to reflect what the group honestly thinks about a contributor."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Dec 23, 2008", "message": "kip,\nI was thinking the same thing when I read Jeff's post this morning.  It makes perfect sense, given that there's five times the incentive."}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": null, "date": "Dec 23, 2008", "message": "@Konrad -- I may have come out in the open, but I'm not your superfan.  Must be someone else.  Sorry you lost points, but don't blame me."}, {"author_name": "Quarrelsome", "gravatar_hash": "890b18939e1eae1eecc193478a7c57e9", "author_url": null, "date": "Dec 23, 2008", "message": "I don't understand about the value of \"free\" time. I post on SO cause its fun and there are smart people talking. I certainly don't think SO owes me anything for it."}, {"author_name": "John Sonmez", "gravatar_hash": "695e2a956b2dcb5ac45a7095b6ee338a", "author_url": null, "date": "Dec 23, 2008", "message": "Don't succumb to the pressure Jeff.  Excellent job, your making the site better by sticking to your guns.  BTW, your welcome for getting you to notice the problem.\n\n:)"}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Dec 23, 2008", "message": "Can we stop trying to re-invent this broken wheel yet?\n\nFrom the slashdot FAQ:\n\nKarma used to be a number, now it is a word, this sucks!\n\nPeople like to treat their Slashdot Karma like some sort of video game, with a numeric integer representing their score in the game. People who do this simply are missing the point. The text label is one way we've decided to emphasize the point that karma doesn't matter.\n\n[http://slashdot.org/faq/com-mod.shtml#cm706]"}, {"author_name": "csmba", "gravatar_hash": "e8ec9371b0173179ee41dd68e0e80ddd", "author_url": "http://knol.google.com/k//free-tools-and-websites/2p76v0g9rhval/4", "date": "Dec 23, 2008", "message": "I am disappointed at the conceptual way you choose to tackle this problem. You went the \"Microsoft\" way instead of the \"google\" way.\n\nYou and Joel talked about the different approach for spelling right? we can all see why the google way is better: Simpler (on the \"AI\" level) and gives more dynamic, live, changing and correct results.\n\nYou went and made a magical query that has all your insight in it, and based on that you make a decision.\n\nI don't have data to be able to suggest any intelligent Google way of doing it, but here is my starting point:\n\nWhy not simply make the effect of up/down vote a function that takes into account the velocity/mass of votes done by the active user? \n\nSo simply, the first vote is 100% (of 10, or -2), but it is some linear or exponential function from that point. Second vote is 99%? 3rd is 95%? \n\nAll you need is then to adjust the function for the parameters (velocity and mass, or other). It sounds much more smooth approach to such problems as opposed to a \"yes/no\" decision and then \"roolback\" action. Your approach just seems too discrete for a non discrete world."}, {"author_name": "EBGreen", "gravatar_hash": "c5f10d1a484dac4a364246bf9f410e9b", "author_url": null, "date": "Dec 23, 2008", "message": "@csmba - If I understand your system, then all I need to do is post 20 answers per day and have my schill account be the first vote on each one. Easily done and I get my 200 points of rep per day."}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Dec 23, 2008", "message": "I just lost 1/3 of my rep points. I can assume it's for the following \"violations\":\n\n1. If somebody goes out of their way to help me, I've gone and looked at all of their old posts, upvoting all the good ones. (Which is typically most if not all of them). These are legitimate votes; but I'm looking for things to vote for rather than stumbling into them.\n\n2. I've sometimes found users who were close to the 2,000 Edit mark and upvoted enough of their entries to push them over the limit. Again, I read the entries before I vote for them; it's not blind voting.\n\n3. There is one other user who I know in real life. I have his account on an RSS feed and vote for everything he posts that warrants an upvote.\n\n4. For a while I was giving Greg Hewgill a lot of votes to try to keep him ahead of Konrad, since it was clear that somebody had gone in and upvoted everything Konrad had ever posted. That seemed unsporting. (This one is clearly the least justifiable.) Again, I read the things I was voting for before casting my vote.\n\nThe general response to any reputation issue is \"post more quality items\". But most of my points have come from either subjective questions/answers or by simply posting questions. The good solid answers I've posted generally get one vote when I ask me RL friend to go look at them. (And the bastard has actually refused to accept my answers to his questions, so the points aren't gimmies.)\n\nThis reputation system feels...broken. I never thought I'd say this, but I find myself agreeing with Daok."}, {"author_name": "TiredOfDaok", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Dec 23, 2008", "message": "Daok,\nPlease do everyone a favor and grow up. Really, crying this much about rep on a site is just pathetic. Let it go. Go outside, get some fresh air. \n\nYou are certainly not the great contributor you want everyone to think you are."}, {"author_name": "kristian rosenvold", "gravatar_hash": "48ad44fb319fc06a737a082820bff3ea", "author_url": null, "date": "Dec 23, 2008", "message": "@JPLemme Right on! I do exactly the same. Sometimes when somebody gives me an exceptional answer I just have to read through the other stuff they've produced. Can't let talented stuff go away that easily. \n\nAnd if I end up badge-bombing him/her by doing that, so what ? But then again, I don't think that would amount to more than 5-6-700 points for any given user; even Jon Skeet. I suppose this behaviour is legit enough and should go under the radar"}, {"author_name": "Sander", "gravatar_hash": "d01b372fc3d11f273c1a9638e2875c4b", "author_url": "http://weblog.juima.org/", "date": "Dec 23, 2008", "message": "The mention of the slashdot solution above is, IMO, very relevant. Any community website I've been a part of which has tried to express \"reputation\" of its users in a numerical value has at one point or another run into the big problem of users gaming the system, yet feeling *entitled* to this value and reacting negatively to any negative change to their own number, no matter how much better a new algorithm or policy might be for the overall system.\nFor early users, the number is merely a reflection of the respect they give each other. Yet a significant number of users which join later see the respect given, and see the number, and seem to subconsciously revert the arrows, drawing the conclusion that the high numbers are the cause of the respect, after which gaining high numbers themselves becomes an important goal.\nThe only 'solutions' I've ever seen to be workable have been to de-emphasize the number as much as possible, hiding it from public view (no comparing e-peen sizes), replacing it with strings representing \"levels\" which were made as broad as possible, etc, etc.\n\nI'll be watching developments here with great interest, seeing if a better solution can be come up with, or if this is something that's going to remain simmering beneath the surface for a long time to come."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://www.nov8r.com", "date": "Dec 23, 2008", "message": "I had a well-thought out, articulate post earlier but the coffee-shop wi-fi ate it. So i'll summarize:\n\nhighly active users hit the rep-point daily cap every day\n\nso even if 'fraud' votes had not occurred, they would still have high rep\n\nexample: skeeter gets 50 up-votes a day since he answers 100 questions a day; 10 of those are 'frauds' so he loses 100 rep points. Clearly not fair, as without the fraud votes he still has 40 legit up-votes a day, way more than the cap\n\nso recalc over time taking the cap into account; that is fair\n\ncaveat: i was not affected by the adjustments, other than jumping up a couple of slot on the users page"}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Dec 23, 2008", "message": "@Sander\n\nThe problem on SO is that the number isn't just a mark of respect. You can't edit the \"community wiki\" until you get to 750 points. You can't edit other peoples' posts until 2,000. You can't close or re-open questions until 3,000. And so on.\n\nOn slashdot a high karma just means that you'll post with a 2 instead of a 1. On StackOverflow a high reputation means you can fully participate in the site or (at the 3,000 level) prevent others from participating. There's a much stronger incentive.\n\nOf course, any body with 4,000 points or higher after the adjustment has lost no power and is in no danger of losing any. For them it's just respect. But I fell a third of the way back down the ladder I'd been climbing."}, {"author_name": "TiredOfDaok", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Dec 23, 2008", "message": "@JPLemme\nI think we need to remember that any rep people have lost they never should have had. Let's keep this in mind here.\n\nI hope we are all adults and can move on past this, as rep ultimately means nothing in life."}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Dec 23, 2008", "message": "@TiredOfDaok (awesome name)\n\nYour assumption is that placing a lot of votes for one person is prima facie evidence of corruption. Some of the people I upvoted appear to have lost the points I gave them. Those points were given by me, in good faith, and were spent on worthy posts. Even if one were to disagree with my methods of selecting the lucky user, the actual votes were assigned to worthy posts and the recipients shouldn't have lost them.\n\nIf I filter for the \"bash\" tag and vote 30 times on what I find, that seems to be OK. But if I filter by user name and vote 30 times on what I find then I'm committing fraud. !?!\n\nTying power to reputation is spectacularly and obviously flawed, and it doesn't take a degree in economics or poly sci to understand why. It rewards the power-hungry and the obsessive-compulsive, while the quiet majority get marginalized and the noisy minority get \"CLOSED\".\n\nThe site is great, but the rep system gets me more and more frustrated."}, {"author_name": "TiredOfDaok", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Dec 23, 2008", "message": "@JPLemme\n\nThe problem is that you following a user and upvoting a larger portion of his posts is still gaming the system, not in a malicious way, but in a way that gives the person undeserved and unrepresentative rep for no good reason. \n\nAs far as the rep system, it works fine in my eyes so far, but of course there is tuning to do for flaws. We will always have obsessive, abusive people like Daok who care more about rep than about having an awesome place to ask questions and get answers though. The best way to deal with it is to just try to ignore them and always do the right thing.\n\nHis abundant closing of posts is a good indicator of this behavior, but if you hear him tell it, he is a hero. Go figure. The people we really want in this community wouldn't be crying about losing rep."}, {"author_name": "Tim", "gravatar_hash": "39a69312c168c765823ad02d46341de9", "author_url": null, "date": "Dec 23, 2008", "message": "Wow.  Just wow.  Do people really care about the hitpoints that much?  I would have imagined that after 3000 (the last additional functionality of closing and re-opening questions) the usefulness would be over.  Is there some ego thing at work here?\n\nI am just amazed at all the commotion about it."}, {"author_name": "EBGreen", "gravatar_hash": "c5f10d1a484dac4a364246bf9f410e9b", "author_url": null, "date": "Dec 23, 2008", "message": "@JPLemme:\n\n\"Some of the people I upvoted appear to have lost the points I gave them\"\n\nHow do you know that they lost the votes that you gave them? How do you know that they didn't simply lose rep as a result of the latest rep cleanup cycle where rep from deleted questions was removed?\n\n\"If I filter for the “bash” tag and vote 30 times on what I find, that seems to be OK. But if I filter by user name and vote 30 times on what I find then I’m committing fraud. !?!\"\n\nThe \"bash\" tag does not get rep.\n\nI agree that the system can be gamed, but that is true of any system. So it sounds like you're saying the only choice is to not have a system at all."}, {"author_name": "Tim", "gravatar_hash": "39a69312c168c765823ad02d46341de9", "author_url": null, "date": "Dec 23, 2008", "message": "Jeff:\nI am a little uncertain about your proposal.  Given that this is a social site and people will be doing some \"string pulling\" - for example I have read an answer I thought was great and in doing so took a look at a person more closely and happened to like A LOT of his answers for other stuff. (and upvoted them appropriately) Following interesting links from person to person or question to question i didn't think was \"illegal\".  I suspect that this behavior would trigger your alarms.  Just as people have been fanboys of joel or of you in the past following blogs - you will get people with similar mindsets and will \"follow\" certain thought leaders or experts.  How do you filter \"illegal\" or unwanted followers/upvoting from the truly engaged site reader who reads and thinks about the content before voting?  i thought the limit on votes and on points was to address that?\n\nNot an easy issue for you, but I think you have to be careful here."}, {"author_name": "EBGreen", "gravatar_hash": "c5f10d1a484dac4a364246bf9f410e9b", "author_url": null, "date": "Dec 23, 2008", "message": "Tim, I obviously have no idea where the trip points are being set, but from the one case where Jeff provided actual numbers, the percent of votes for one user were on the order of 95%+."}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Dec 23, 2008", "message": "@TiredOfDaok\n\nUnrepresentative: Yes. Undeserved: No.\n\nAnd what's a \"good reason\"? You were on top of the list of Hot Questions? A good post is a good post no matter how it's discovered.\n\nThe problem with ignoring people like Daok is that it's like ignoring a man running around Central Park threatening people. If you just ignore it then you're letting the good people get driven away. And he doesn't just talk--he has the juice to stop others from participating (or earning rep) and he's not afraid to use it.\n\nA person who uses his 3,000+ points of reputation to close down any question that might become popular and earn a lot of reputation for others is a destructive presence. I don't think ignoring the problem is a viable solution.\n\n\n@EBGreen (the tape?)\n\n\"Appear to\" is the operative word. I don't know what happened, but it would make me unhappy if my opinion was de-valued because of my voting patterns.\n\nre Bash\n\nThe bash tag gets no rep, but bash programmers do. If you vote for bash posts all the time you'd be tending to vote for the same users, thus putting you on the naughty voter list.\n\nI'm not suggesting no system, but it would be nice if the system assumed you were trustworthy until you proved otherwise, rather than assuming you're a creep until you have 1,000s of points. Especially since creeps are as capable of earning 1,000s of points as anybody else."}, {"author_name": "TiredOfDaok", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Dec 23, 2008", "message": "@JPLemme\nI stand by my assertion, and by Jeff's decision, and you have done nothing but strengthen my opinion on this.\n\nUnrepresentative votes need to be eliminated just as much as malicious votes. That is the whole spirit of the system here."}, {"author_name": "EBGreen", "gravatar_hash": "c5f10d1a484dac4a364246bf9f410e9b", "author_url": null, "date": "Dec 23, 2008", "message": "\"(the tape?)\" - Yup.\n\nI agree that it would be nice to precognitively determine if someone is gaming the system. I just can't think of a way to do that. Right now the only way that I can think of is to look back and see what was done.\n\nI agree that if you had a very narrow focus there is a chance that you would inadvertently trip the alerts, but I have to think that would be the exception and not the rule. \n\nI think there are three courses of action here.\n\n1) Go back to the way it was where I don't think that there was any doubt that some people were gaming the system.\n\n2) Go with what was just implemented. Accept that there will be false positives and tune the system to minimize them\n\n3) Go with some other way to reduce gaming.\n\nSo far, I have only seen one #3 suggested and it seemed like it was even more easily gamed than the just implemented system. So without any better system to consider, I think the only decision right now is between #1 and #2. Personally I would prefer to do something rather than nothing."}, {"author_name": "David Rodriguez", "gravatar_hash": "1ccfec45e3fba785daf0e89a797c9216", "author_url": null, "date": "Dec 23, 2008", "message": "This is quite funny to me. Is reputation all that important? Ok, at first it may be as it allows you to a richer interface. But after some 3k all the rest is just... I don't know... proudness?\n\nThis reminds me of soccer. I used to play in a city tournament and some people took all games as if they were playing the world cup final. It was just a game!\n\nReputation is not a game, or is it? It could be considered as a boost into ones career if companies used the page, but then again, if that were the case, I would assume that they would read some of the posts more than just plain rep..."}, {"author_name": "TiredOfDaok", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Dec 23, 2008", "message": "@David\n\nAnd if you were concerned so much about rep for a career and pride in real life, shouldn't you be completely embarrassed about behavior like crying over losing undeserved rep?\nIf you were an employer reading posts here including a tantrum because a prospective employee lost a little undeserved rep, wouldn't you reconsider hiring that person?"}, {"author_name": "Daniel Reeves", "gravatar_hash": "02b053ea78b2ab803ba810a386fda1ef", "author_url": "http://ai.eecs.umich.edu/people/dreeves", "date": "Dec 23, 2008", "message": "I started using StackOverflow in the private beta and originally there was no explanation for the \"community wiki\" checkbox so I just always checked it.  I figured it just meant I was open to others editing my stuff.\n\nI finally figured out why I was accumulating badges but never reputation points and felt slightly miffed since I was putting in some real effort to try to earn the ability to downvote and edit and such."}, {"author_name": "Tim", "gravatar_hash": "39a69312c168c765823ad02d46341de9", "author_url": null, "date": "Dec 23, 2008", "message": "The new proposed bounty system gives even MORE ability to game the system.  A user can now shovel off tons of hitpoints to another user just by offering a bounty and then accepting an answer.  The answer doesn't even have to be good.  \n\nGood luck Jeff - you're up for some real challenges with this stuff..."}, {"author_name": "EBGreen", "gravatar_hash": "c5f10d1a484dac4a364246bf9f410e9b", "author_url": null, "date": "Dec 23, 2008", "message": "That is true, as you increase the rep interaction points, the gaming threat surface will naturally increase. Good point."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 23, 2008", "message": "There's an interesting distinction to be made between \"gaming the system\" and \"giving someone more rep than they would get in other circumstances\". If I see someone's correct answer and then go back and upvote other answers they've given, I'm probably doing so honestly, with no ill intent. I don't think that can reasonably be called gaming the system - even if it's something we want to try to prevent.\n\nThe other point to note is that the users who have been receiving the rep are *not* (necessarily, anyway) the ones who've been doing anything even questionable.\n\nAside from that, the point that \"any rep people have lost they never should have had\" is a useful one. I can understand how people feel hurt by the whole thing though. It's like a scandal which broke recently in the UK - a lot of public service pensioners have been receiving more pension than they should have been, for a long time. There may or may not be attempts to recover this money - money which they've already spent, believing it to be rightfully theirs. Clearly the analogy shouldn't be taken very far - rep really *isn't* important in the grand scheme of things - but the feeling of loss through no fault is similar, I suspect.\n\n(One small note - I'm really surprised that I haven't lost *any* rep. Do I really have no stalkers after all?)"}, {"author_name": "Robert C. Barth", "gravatar_hash": "c23ef823ae0ba03daf7675991deb3083", "author_url": "http://www.norimek.com/blog/", "date": "Dec 23, 2008", "message": "I have a really hard time understanding why, if a human-being upvoted one person (as opposed to a bot), their vote counts less than if it was multiple people. It's their vote to use as they wish, so what's the difference? \n\nAs mentioned, the real way to fix this (and I think it's more in the spirit of the rep to begin with) is to diminish the value of person A's upvote for person B as person A continues to upvote person B. What this means to the software is: we've got your opinion, thanks, now we're going to start ignoring you because regardless of the number of times you yell it, we got it. That would cause rep to be gained over a broader user base, which is what I believe the founders want."}, {"author_name": "EBGreen", "gravatar_hash": "c5f10d1a484dac4a364246bf9f410e9b", "author_url": null, "date": "Dec 23, 2008", "message": "That may be a valid solution Robert. It would still have something of a detrimental effect far a situation where I find someone that has given a really good answer and I go look at their past answers and upvote the good ones, but that may be acceptable."}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Dec 23, 2008", "message": "@Jon Skeet\n\nIf you have enough stalkers, it gets called a fan base and it becomes OK.  :-)"}, {"author_name": "EBGreen", "gravatar_hash": "c5f10d1a484dac4a364246bf9f410e9b", "author_url": null, "date": "Dec 23, 2008", "message": "Especially if they are compulsive stalkers and they stalk multiple people."}, {"author_name": "Hamish", "gravatar_hash": "c541c4a5546e6d929d571f459868739e", "author_url": null, "date": "Dec 23, 2008", "message": "I am really looking forward to the next stackoverflow podcast :-)"}, {"author_name": "Tired of TiredOfDaok", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": null, "date": "Dec 23, 2008", "message": "I would like to say to Daok and all others affected by this \"readjustment\":\n\nThank you.\n\nThank you for devoting so much time and effort helping others with your answers (and also for asking good questions).\n\nNo matter how much your reputation was or was not \"gamed\", the sheer number of questions/answers you have posted is an unquestionable tribute to your true valor.\n\nFor me, the reputation is first and foremost a way to express this gratitude. \nTo \"adjust\" it in such a insensitive way seems, to say the least, not the best way to acknowledge those dedicated contributors.\n\nI would hate to see those valuable stakers go away because of some administrative  process and some bullies like \"TiredOfDaok\", and their clear deficit of sensitivity or basic empathy.\n\nSo again, \"Thank you\". I hope to read from you soon."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 23, 2008", "message": "> (One small note - I’m really surprised that I haven’t lost *any* rep. Do I really have no stalkers after all?)\n\nTo give you some ideas of the numbers involved.\n\n135 rows of anomalous upvotes\n46 rows of anomalous downvotes (we check these more stringently)\n\nIt's a very small segment of the community that was affected.\n\nI also want to emphasize just how strongly anomalous these patterns are, the ones we're checking for. It is not in any way subtle or \"shades of grey\" -- the patterns are HUGE statistical outliers. There's no way these could be construed as valid, IMO."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 23, 2008", "message": "> If you vote for bash posts all the time you’d be tending to vote for the same users, thus putting you on the naughty voter list.\n\nNot even *remotely* true, by the way. Consider the example I cited above for doak. A single user cast TWO HUNDRED AND THIRTY FIVE votes for another user. The next most \"popular\" vote target for that user got a grand total of four votes. Four!\n\nLike I said, subtle, it ain't."}, {"author_name": "Michael Pryor", "gravatar_hash": "83678606ffe33ee7c1fb50b97338daed", "author_url": null, "date": "Dec 23, 2008", "message": "Lamers.  I just lost half of my reputation.\n\nI can't help it that my friends like all of my posts at the same time."}, {"author_name": "kevin", "gravatar_hash": "ad6a3db918199fd3f5664951a69e98de", "author_url": null, "date": "Dec 23, 2008", "message": "Why not just remove downvoting?  Also, does anybody take reputation  seriously?"}, {"author_name": "Niels Bom", "gravatar_hash": "e9a63ef61611a91c600fefda639b1b0e", "author_url": "http://www.nielsbom.com", "date": "Dec 23, 2008", "message": "\"A soldier will fight long and hard for a bit of colored ribbon\"\n-Napoleon"}, {"author_name": "GlenG", "gravatar_hash": "6e2c41b96aabf45cff6650968c3e9245", "author_url": null, "date": "Dec 23, 2008", "message": "The most amazing thing I find is the passion that people are showing about this subject... geez louise guys...get a life.\n\nIts not like its $$ coming out of your pocket. Rep is just a bit of fun ..isn't it?  I didn't realise the future of the human race depended on StackOverflows rep system being faultless.  It seems to be that way based on the replies here."}, {"author_name": "Paolo Bergantino", "gravatar_hash": "80ae8ec34e9e3e66c5be50733afaa44e", "author_url": "http://www.rootspot.com", "date": "Dec 23, 2008", "message": "Jeff - could you tell me the anomalous data that you found for me? I used to have 2100ish reputation and I woke up today to 1700. I find it hard to believe that someone upvoted me to the tune of 400 rep. I am pretty upset about this but I'd like to see the data if possible. Thanks."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Dec 23, 2008", "message": "Jon said, \"I’m really surprised that I haven’t lost *any* rep. Do I really have no stalkers after all?\"\n\nJon Skeet has so many stalkers that it isn't considered an anomaly.  It's just the natural state things."}, {"author_name": "Guy", "gravatar_hash": "d9f2c02c23a3013166710a1d24bca056", "author_url": "http://guyellisrocks.com", "date": "Dec 23, 2008", "message": "I can see how there'll be some collateral damage in this. There's a guy that I work with who I have a lot of respect for an whenever I see a post that he's made I read it and almost always up-vote it because it's a good comment.\n\nHowever, taking a quick look at his and my rep they both seem to have gained in value so your algorithm should be given more credit than I initially gave it credit for."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 23, 2008", "message": "Paolo, you can email me directly if you want the details. Hint: it's someone else from Tallhassee, FL."}, {"author_name": "johnrudy", "gravatar_hash": "32dcb4e95fd5eb20c0f61d1ba3468242", "author_url": "http://www.codeheaven.info", "date": "Dec 23, 2008", "message": "@baltimark (re Daok's objections and the pattern):\n\nHere, here. I respect Daok a lot; I've upvoted some (several?) of his answers. I generally like his comments. But I'm kind of surprised by his behavior on this discussion.\n\nGuys, rep ain't nothing but a number. Somehow I have almost 4,400 rep points -- I don't honestly think I deserve but maybe half that! (There are people far more talented than I with considerably fewer.)\n\nThere are too many people placing too high an emphasis on this number. I've seen comparisons to RPGs, people discussing whether or not a potential employer should consider SO rep, whether or not it should be on a resume/CV, etc. That's insane. It's not meant to be an indicator of your knowledge, your technical prowess, your manhood. It's meant to indicate what the community at large thinks of you.\n\nAnd if one member of the community thinks so highly (or negatively) of you, then your number is skewed. You want to leave the community? Go.\n\n(I was not aware of Daok's scripts, by the way. While the act of writing the script is cool, the act of running automated scripts to close questions is absolutely not. Those of us with high rep are given that power because it is presumed we're familiar enough with SO to exercise judgment. Just as red light and speed cameras cannot exercise judgment, neither can a script. Bad juju.)\n\n@Jeff:\n\nOverall, I think you're on the right path. You might want to do something to put some of the doubters' minds at ease, though short of posting the code (or at least query) I don't know what that would be.\n\nI understand people are hurt by the loss of their points. It's easy for me to say \"it's just a number\" (as I did above), as I didn't lose any. (Though I like to think I wouldn't have held it against you if I did.)\n\nI am worried that we will lose good contributors -- but I'm more worried about the motives behind some of them, now. Anyone threatening your site in a public forum like this is an issue. Anyone who takes this little integer field so seriously that they would not only leave a site, but threaten to unleash bots on it, is a severe problem.\n\n(On a side note: I guess this is what happens when a site hits the big time? I should be so (un)lucky on mine!)\n\nRegardless of any other fixes, you might want to be on the lookout for bot behavior in the near term.\n\nTo All:\n\nSO is, in my mind, a great site. It's not perfect, but it has helped me out quite a bit, and I like to think I've helped out some others as well. I could be insane, but I thought we were all participating in it for that reason: To give and receive competent advice from fellow developers, to engage in good conversation with some of them (yes, I know, against the FAQ; we seem to anyway), to learn and educate. That's why I'm here -- even if I have been in more-or-less lurker mode for a week or so. (Hey, it's a busy time of year!)\n\nNo site is perfect, and SO is the same in this regard. No technique for dealing with abuse or potential abuse is perfect. But it sounds to me like Jeff tried to do the right thing, and unfortunately some people who may not have known things were happening got caught in the crossfire. \n\nI hope we can all put this behind us soon. It's just a number; if it's the way you derive your self-worth, you need to step away from the computer and go work on your psyche."}, {"author_name": "Quarrelsome", "gravatar_hash": "890b18939e1eae1eecc193478a7c57e9", "author_url": null, "date": "Dec 24, 2008", "message": "It took me a while to really appreciate the numbers but now I do. It has to be fraud. I mean we're talking about 250 upvotes for person number one and a _maximum_ of two upvotes for Jon Skeet.\n\nWTF? That just doesn't make sense of any level ;)"}, {"author_name": "Anthony", "gravatar_hash": "4226360f69e7847c4492a4efb5ec9203", "author_url": null, "date": "Dec 24, 2008", "message": "Hm, on Everything2 we called this \"Serial Downvoting\". \n\nIt's hard to draw a line between the legitimate \"I think this answer's dangerously incorrect, I'll go and review the other answers that this person has made, see if they're also like that\" and the real Serial Downvoting, i.e. \"I hate you and am want to damage your reputation\". In fact there are grey areas in intent.\n\n\"Vote fraud\" in upvoting is easier to draw a line around. If the two accounts are controlled by the same person, and one upvotes the other, then that's wrong."}, {"author_name": "gamer", "gravatar_hash": "bbd76cf39e8c82b66682b450e8eb1bb3", "author_url": null, "date": "Dec 24, 2008", "message": "Instead of gaming the system, you mean playing the game.  Stackoverflow is a game, not a social engineering wutsit.  Although some who people who believe they're smart are easily led astray to believe this."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Dec 24, 2008", "message": "I think this is mostly a problem of terminology.  Jeff talks of vote \"fraud\". And thus his changes to the reputation calculation are seen as \"punishment\".\n\nIt would perhaps be better to word this rule as simply another limit of the system (of which there are already several) rather then a fraud-detection pattern matching manhunt.\n\nPop Catalin worded it well above.\n\nReputation should reflect the sentiment of the community rather than just enthusiastic individuals--regardless of their nefarious or noble intentions.\n\nEach user is now prevented from conferring unusually large amounts of reputation to a single other user.  What's wrong with that?\n\nWe might quibble over exactly what is \"unusual\", but I don't find the idea itself particularly offensive."}, {"author_name": "Jin", "gravatar_hash": "70ad2c2830eb9a7753bd6312f3811e3e", "author_url": "http://www.8164.org", "date": "Dec 24, 2008", "message": "Jeff, you've created a MMO. :) I'll be a shaman."}, {"author_name": "Chris", "gravatar_hash": "86972d6ee486a082e5a4f5577a9f574e", "author_url": "http://light.widgisoft.co.uk", "date": "Dec 24, 2008", "message": "Although I agree with what has been done; I want think the system should have been a move forward as apposed to a re-write of history; i.e. the new anti-fraud system works on all new votes but doesn't affect previous votes.\n\nThe problem though is that you're left with a \"dirty\" system so to speak; and at the end of the day the whole point of this site is to be able to find answers; so a few users whinging about losing a bit of rep versus a clean system is - I guess - a no brainer.\n\nI'm sure the cleanup was done with the utmost care - again; to preserve the correctness of the data - so I can't see any problem with it."}, {"author_name": "Jonathan Holland", "gravatar_hash": "bbbaba4e065b3dec8976b09f5f6d1351", "author_url": "http://codeEleven.blogspot.com", "date": "Dec 25, 2008", "message": "I didn't lose any data with the cleanup, though I had lost 3,000 reputation before due to serial downvoting.\n\nI find it amusing that Doak had his own sock puppets voting him up (Judging by his actions up above, I don't believe for a minute it was someone else).\n\nWhat a child."}, {"author_name": "HS", "gravatar_hash": "08089fb1576ee5b1e81b800b623a4b67", "author_url": null, "date": "Dec 25, 2008", "message": "I did it, I cost Konrad a lot of reputation and I am very sorry for it. :(\n\nWhy did I do it? Because I like the way he writes and through that writing the way he seems to think. He appears to be brilliant and he is only 23 years old. And he is a fellow German. And I guess, I wanted him to be seen as number one on Stackoverflow.\n\nBut I did not know that it was forbidden to vote for a single person within the daily voting limits! The coding of the site did not prevent such a thing and I wonder if it will be prevented even now after those drastic cuts in reputation (I am afraid to try, might lose someone some reputation).\n\nI might have gone a bit far spending 20 votes each day on a single person for more than a month, but the rules did not say it wasn't allowed!\n\n\nIn my humble and certainly biased opinion the situation was resolved incorrectly. Taking away the reputation is like altering the course of history. This is the sort of thing dictators do. By eliminating this \"anomaly\" there was another anomaly created: take a look at the reputation graph for Konrad Rudolph. It is clearly anomalous now for the month of my \"fan-boy-voting\".\n\nThe only time I would consider taking back any reputation as valid would be when something outside the rules was involved. If the behavior is undesired, then please change the rules first and enforce them afterwards and not invent some double standard later on."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 25, 2008", "message": "@HS: It sounds like you didn't really \"cost\" Konrad reputation - the votes were just rerun as if you didn't exist. Arguably that counts as costing him the reputation he would have gained if you'd voted more normally, but *hopefully* that's all. (i.e. if your votes got Konrad to the limit but he received lots of other votes afterwards, those would count in the \"post-deletion rerun\".)\n\nHaving said that, your comment about the reputation graph is a good point. The reputation graph certainly suggests that Konrad didn't hit the rep limit in that time, but several of the answers certainly didn't get the amount of rep they would have received without limits in place.\n\nMore info needed from Jeff to answer to be sure, by the sounds of it. However, he was talking about \"rep recalcs\" which *should* involve effectively rerunning history from scratch to redetermine the rep, if I understand correctly. (I may well *not* understand correctly, of course.)"}, {"author_name": "Jonathan Holland", "gravatar_hash": "bbbaba4e065b3dec8976b09f5f6d1351", "author_url": "http://codeEleven.blogspot.com", "date": "Dec 25, 2008", "message": "I was always confused as to why Konrad was #1, considering I couldn't find that many posts by him when casually browsing."}, {"author_name": "Greg Dean", "gravatar_hash": "f0eff14ca16e5a87953501a84a3d42e9", "author_url": null, "date": "Dec 25, 2008", "message": "Jeff,\n\nThis needs clarification.  Do the recalcs include reputation that was previously ignored do to the 200 limit?"}, {"author_name": "Jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Dec 26, 2008", "message": "Jeeze, that little number really upsets people, eh?\n\n\"But I did not know that it was forbidden to vote for a single person within the daily voting limits!!\nI think this quote from a previous post pretty much summarizes the confusion.\n\nDon't think of it as \"forbidden\". There is, and was, no rule forbidding you from voting a lot for a single person. It just doesn't count. You haven't done anything *wrong*, and those who lost rep have not done anything *wrong* (probably bar a few people who really did upvote themselves with a bunch of bot accounts or such). The system has simply been tweaked to discard a category of votes that were previously counted.\n\nSome people \"lost\" rep, in the sense that votes that used to be counted, no longer are. So? You're not being punished, your rep is simply being recalculated according to the new rules. Rules which apply to everyone.\n\nI think we need to get over the guilt trip (talking about vote fraud and punishment and \"did I do something wrong?\"), and simply say this is how votes are counted from now on.\n\nAnd if 90% of your rep came from *one* superfan, doesn't it make sense that your rep *in the community* would be 90% lower? Even if your superfan had only the best intentions, and he really liked your answers and no one ever thought of it as gaming the system, it's not representative of the user's rep in the community. And again, this doesn't mean the superfan did anything wrong. He merely upvoted the answers he liked."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 26, 2008", "message": "> However, he was talking about “rep recalcs” which *should* involve effectively rerunning history from scratch to redetermine the rep, if I understand correctly. (I may well *not* understand correctly, of course.)\n\nThis is correct, we re-run history against the newly changed vote table. There's no other way to do it and enforce the +200 per day reputation cap that I can think of."}, {"author_name": "HS", "gravatar_hash": "08089fb1576ee5b1e81b800b623a4b67", "author_url": null, "date": "Dec 26, 2008", "message": "&gt; There’s no other way to do it and enforce the +200 per day reputation cap that I can think of.\n\nWhat would have been an acceptable number of votes for a single user that did not trigger any loss of reputation? Was that number defined by now? Is it a new rule now?\n\nIs this new rule enforced somehow now? Or is there no new rule and the votes were deleted, because they seemed bogus to a casual human observer?\n\n\nI feel seriously betrayed and my votes ignored even so I did nothing wrong. Anybody can list the answers of any user and vote them up. I did so without any scripting or other tools other than my browser and mouse. There is still the open question: why is this \"fraud\" or unusual? Because one human moderator (Jeff?) does not like it? Are some users considered more worthy than others?\n\nIf anything is not allowed, then please write it down and make it known to the users to adhere to it. If there are no (written) rules to violate, you only act randomly and annoy people."}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Dec 26, 2008", "message": "Have you considered doing badge adjustments as well?\n\nI could see a considerably high amount of fake badges earned for people who's stats were adjusted.   I know this will piss off those already pissed of users more, but if you're going to do an adjustment, I think it should be a sound adjustment on all ends."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://www.nov8r.com", "date": "Dec 26, 2008", "message": "Jeff said: \"...we re-run history against the newly changed vote table.\"\n\nThat is fair, and should put an end to the whining.\n\nBut I wonder if the voting records include the client IP address, which might identify more subtle 'bot/multiple accounts... :-P"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 27, 2008", "message": "> if the voting records include the client IP address\n\nThey do, but I'd prefer not to look at that for a variety of reasons."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 27, 2008", "message": "Jeff said: \"This is correct, we re-run history against the newly changed vote table.\"\n\nThis would be fair but I don't see any evidence (from reputation graphs and activity/voting history of the most affected people) to indicate this is what happened."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 27, 2008", "message": "@Robert Gamble\n\nOn the contrary, look at Konrad's reputation graph on the official site:\nhttp://stackoverflow.com/users/1968?sort=reputationhistory#sort-top\n\nNow compare that with the reputation graph on my reputation tracking service:\nhttp://sof.modos.org/tracker/chart/1968/year\n\nThe only way to get the \"new\" history data would be for Jeff to rerun the history, as it's clear that there's no massive down-spike corresponding to the loss in the \"fraudulent\" reputation.\n\nAs a small side note, I think that the official graph is a bit disingenuous as it completely rewrites history to eliminate the suspect votes."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 27, 2008", "message": "The votes are deleted, so they no longer exist."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 27, 2008", "message": "Jeff, to clarify, if Person A received 10 votes from Person B followed by 20 votes by other people, for a total rep gain of 200 (100 from Person B and 100 from others) on a given day, and you then remove the votes made by Person B, will person A lose 100 points or will the 10 votes that did not result in a rep gain originally now be counted?\n\nLooking at the reputation graph for Konrad, for instance, shows that for a 1 month period his reputation gain is relatively flat.  According to HS this corresponds to his fan-boy votes.  It seems incredibly unlikely that almost nobody else voted up Konrad's posts during the time that HS was voting for him while he regularly hit the rep limit on the days before and after this period.\n\nIt looks like votes that Konrad received that did not originally result in a rep gain due to the 200 limit were not re-evaluated when the rep gained from HS' votes were removed."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 28, 2008", "message": "> will the 10 votes that did not result in a rep gain originally now be counted?\n\nYes, because as I said above, history is re-run as if the invalid votes never existed.\n\nEvery time I've spot checked this, it has been correct.\n\nWe did find one user who had lots (over a hundred!) of accepted answers (+15 each) that for some reason were immune to the +200/day rep cap. Recalculating for that user caused him to drop more than usual because some of the accepted answers were (correctly) hitting the rep cap after the recalc.\n\nMust have been a bug in our code prior to the recalc, but I couldn't find it.."}, {"author_name": "Tomalak", "gravatar_hash": "e8a42bc3ef517000a1d4f0f5c94cb0f7", "author_url": null, "date": "Dec 28, 2008", "message": "(that one user was me)\n\nTo be honest, I was enraged and stunned by the mere accusation of fraudulent behavior. The implicit \"you cheated and we found out\" tone of Jeff's original article about just made me mad. Having only my BlackBerry available at the time I didn't feel like reading more than the blog post itself, so I missed the ongoing discussion in the comments.\n\nI'm sure the anger many people felt comes from the not very sensitive wording and the genuinely bad timing of the whole thing. Now that I have read the comments to this post, I feel my anger diminishing.\n\nI understand the reasoning behind the measure. I noticed the anomalous up-voting but as many others here just shook my head and moved on. I still can't agree to how it all has been done, because it feels like undeserved punishment. It has some smell of the politician's fallacy (Something must be done / This is something / So we must do it). But at the same time I am unable to come up with a better fix.\n\nI just hope the detection mechanism is tuned against abuse, because the abuse pattern is quite trivial, as others have pointed out. \n\nRegarding the voting behavior of @HS (as an example) only three words come to mind: WTF?! I don't even understand the justifying rationale. Serial up-voting someone trying to keep him ahead of someone else because [insert reason here] is laughable. And arguing that it must be okay because the system lets me do it is laughable as well. I can just shake my head over this, but I appreciate the honesty.\n\nI don't know if making a vote a more precious and rare thing could help preventing anomalous voting. Currently nothing stops me from gaining the trivially low amount of rep required to start voting and do so wildly and indefinitely. Casting a vote should be the result of thought.\n\nThe amount of up-votes available per time period could be coupled to reputation and/or the number of own up-voted answers/questions (e.g. \"activity\"). Voting the same person multiple times per time period should be capped to make vote distribution more even and vote assignment a more thoughtful process. I don't know if implementing this would open up even more loopholes for exploitation, it is just a raw idea."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 28, 2008", "message": "Jeff, when you say: \"Recalculating for that user caused him to drop more than usual because some of the accepted answers were (correctly) hitting the rep cap after the recalc.\"\n\nDo you mean that the rep cap is meant to be an absolute hard limit? I thought the idea was that upvotes only counted if they didn't take you above 200 for the day, but that accepted answers would still count. That seems to have been the case for me - otherwise I couldn't possibly have an average of 240 per day. Is this a bug then? Should I actually only be on 18600 (or less - I haven't hit 200 every single day)? Have I only not been affected by the recalc because none of my votes were actually removed by the general cleansing?\n\nFor what it's worth, my feelings about a time-based rep limit are already known - but if there really wasn't *any* way of getting over the 200, that would be worse IMO."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 28, 2008", "message": "> I thought the idea was that upvotes only counted if they didn’t take you above 200 for the day, but that accepted answers would still count.\n\nBarring a bug in our code (always possible!) the intent is that +200 day is the max rep you can gain.\n\nI'll double check the code again and see; I couldn't find a problem with it last time.\n\nThe only thing that will be immune to this is the upcoming question bounties; the majority of that bounty will come from the asker's reputation so it must be awarded regardless of daily limits."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 28, 2008", "message": "Jeff, the way it actually works right now is that accepted answers before you reach your cap count towards the limit, but accepted answers after the cap still give you +15, see http://stackoverflow.com/questions/303954/how-to-get-over-200-reputation-points-every-day#304531 for a good description by Jon.  Many of the highest rep members have benefited from this behavior (including myself).  Personally I think reputation from upvotes should be tracked separately from reputation gained from accepted answers with no limit on rep gained from accepted answers."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://www.nov8r.com", "date": "Dec 29, 2008", "message": "OK, this morning I seem to have lost about 300 rep points, and I don't know why. Do I have a fan? Did some major off-topic thread get deleted?\n\nJeff, I suggest some kind of notification when this happens, otherwise you may spend the rest of your life explaining overnight rep changes on this blog post!\n\nSomething simple like the badge banner would be sufficient and appropriate, i.e. when you log in it says \"Congratulations! You've just been hosed out of XXX reputation points because of fraud/deletions/recalcs/whims/etc. Click [here] to see a list of changes.\"\n\n;-)"}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://www.nov8r.com", "date": "Dec 29, 2008", "message": "addendum: looking at the first page of users, it looks like almost everyone got rep-hosed overnight, some (like Jon) seem to have lost several thousand points.\n\nNot complaining, I assume munificence from our fine hosts, but don't you think some level of personal explanation is in order?\n\nFor me, 300 points is probably just a couple of days spent answering questions. For Jon, 3000 points is likewise probably just a couple of days spent answering questions (before they're asked!). Still, rather than being pecked to death by birds, how hard would it be to just tell each person what happened?\n\nthanks!"}, {"author_name": "Tomalak", "gravatar_hash": "e8a42bc3ef517000a1d4f0f5c94cb0f7", "author_url": null, "date": "Dec 29, 2008", "message": "I agree with Robert Gamble. That's definitively the way it has been working until now, and it should continue to work like that.\n\nCan it be that another \"recalc\" took place recently? A look at my vote tracker reveals a bunch of accepted and up-voted answers, but it shows no gain in reputation, but yet another loss. I *really* would like to see what these adjustments are for, as in \"which up-votes were removed, and who gave them, and when\"."}, {"author_name": "Mike Dunlavey", "gravatar_hash": "20cddb219d365dc36f5e1eee92fe79ae", "author_url": null, "date": "Dec 29, 2008", "message": "On the general subject of being nice to others, I've noticed how some questions get closed really fast because some people have accumulated lots of \"rep\" and seem to relish the role of judge, jury, and executioner.\n\nFor example, today there was a question that was basically about where bugs come from. That may seem like a foolish question, but I happen to think it's actually quite profound. I was not able to answer or even leave a comment.\n\nAt the same time, there are other questions, such as names for dogs, that one might think are quite foolish, but seem to be popular."}, {"author_name": "Robert Gamble", "gravatar_hash": "df9dc984d0eede2df0cd514195c461f2", "author_url": null, "date": "Dec 30, 2008", "message": "Brian, regarding revoking badges: I once received an enlightened badge and subsequently had the answer that earned the badge voted down to 9.  I didn't lose the badge but the next time I became eligible for an enlightened badge I didn't get it, the time after that (and every time since) I did.  Apparently the code that handles assigning badges checks the current number of posts eligible for that badge and only gives you a new one if that number is greater than the associated badge count.  Of course it could also be that I ran into a bug that one time, perhaps Jeff can confirm or deny this behavior."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": "http://www.nov8r.com", "date": "Dec 31, 2008", "message": "ok, today a fairly large overnight jump in rep - another recalc perhaps?"}, {"author_name": "Jani", "gravatar_hash": "96a7c73bc7adc8d52269abce6355860e", "author_url": null, "date": "Jan 02, 2009", "message": "There's a page where you choose your home country and start clicking. The point of the game is to get the most mouse clicks for your country. Browsing through user's posts and voting up each and every one reminds me of this page. \n\nSO should be about asking questions and giving answers, not about voting your favourite guy or girl to the top. It's true what has been said earlier, that this could be avoided by using a description about user's reputation instead of numeric value. These levels would be the same as the privileges given to user: voter, moderator etc. (of course with whackier names!) There would be no fighting about the highest place, since there's a huge plateau at the peak with enough room for dozens of people. There's a slight chance that we would miss a few great answers for stripping out some game like aspects of SO, but with SO's userbase I don't think this is a real problem."}, {"author_name": "Stefan", "gravatar_hash": "a76ef8f63dfc66c69b907e3d32b24563", "author_url": "http://blogs.itmaskinen.se", "date": "Jan 05, 2009", "message": "Hide the points. Hide them totally and give users memberships, like \"moderator\", \"helper\", \"editor\" or something from the hidden points stored in the database, but stop focus on the points. Points are allways going to make some people going crazy.\n\nFor me, Im allways happy when someone accepted my answer or give me a solution for a problem I have. \n\nThats my drive, to get a solution or get a \"accept\".\n\nAnything else is of no interrest. The only reason Im looking to the points when I logg in is to se if I helped someone last time I was logged in. \n\nI dont need to have a \"running score\" to be happy, I just need to be granted the one time I happend to give correct help."}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Jan 06, 2009", "message": "Just to make few thing clear (I am not furious about anyone, just to show you some of my point of view).\n\nAsking about privileges over 3k : http://stackoverflow.com/questions/358745/when-is-high-reputation-too-high#359329\nNow it's accepted. But... I have been not really welcome with the preposal... finally it looks to be a good idea...\n\nAsking about to see the complete reputation : I had to delete my post because 2-3 persons was always bashing me... but well now it has been accepted and completed :\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/78726-bring-back-full-reputation-display-?direct_login_token=1a328f662e1f11dfbcb3c650b6cb3983&amp;tracking_code=64e89dac8bc43cb5c30b680f3d22681d\n\nAsking about to be able to make post wiki when question is transformed to wiki is now completed... http://stackoverflow.uservoice.com/pages/general/suggestions/39868-edit-question-post-to-wiki-community?direct_login_token=1a328f662e1f11dfbcb3c650b6cb3983&amp;tracking_code=64e89dac8bc43cb5c30b680f3d22681d \n\nFunny because I have been called to have selfish request by Rich B and other, but most of them are now completed, so in fact they were not so much childish request for myself... when I read all this thread and my reaction I think I was upset to have try to make effort to improve this community and having people trying just to be negative with all my try... now I see that I might not be the best to tell my ideas but in fact they were good suggestion.\n\nI found funny too to see that I might have been rude in my action but in fact I see now that it has at least improve few things. I had many time express myself that it wasn't a good way to close post because a lot of 3k people can re-open. No one was listening, fine, I came back here 3 weeks later and I see a voting system to close post. Very bright! Better than my initial suggestion but I still believe that if instead of having a bunch of people telling that my suggestion was bad, that I wouldn't had to fight to close topic in the past if someone would have simply telling that something will be done because that I was right that something was wrong with the closing action, and this is a fact that you cannot avoid (if not nothing would have been done...).\n\nWhat ever, I think after about 3 weeks off of this website that I understand that It might be frustrating to see people getting reputation and beeing lower and have to find something to bash on. I think I was a good target since I am not the type of person to keep thing in silence. I do not feel guilty of all of this because I still believe my post has correct information and have answered people. I haven't make any spam, any advertise or any attack to affect this service.\n\nLast thing, my reputation is higher than 3 weeks ago, I think somebody adjusted the reputation that I might haven't been count when my fan's reputation was taken out. Instead of losing 5k I lost about 2.7k... \n\nIf at the start I would have receive the good amount of reputation adjustment, a message telling me that something was wrong with my account (with explication of the reputation taking off or to be careful about something instead of being push at the wall a morning like this 23 dec 2008) and having the right admin to see my requests in consideration (most of them are now completed but haven't got any answer since 4-5 months, I would have understand few days or weeks for answer...), I think I wouldn't have done all this talk over here and I would still be here to provide some answers to people and enjoy this website. Pretty bad that all this was badly managed. But well, the improvement that SO have been done in the last weeks is pretty interesting and the new developer coming here to help is a good news. Hope all is fine with all of you, have a nice new year and I am not angry about people bashing me over here in this blog post not even Rich that has a perpetual anger on me :P I might post few answers later in the years, now I found some other interesting projects...when I am compiling ;)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 07, 2009", "message": "daok you are welcome back any time, just don't bring any bots with you this time :)"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Mar 04, 2009", "message": "So a couple days ago I had about 6-12 very old posts all updated overnight.  I suspect, but don't know, that it was the same user.  In this case it's probably not enough to make a blip statistically, but that got me thinking:  what if it were?\n\nLet's say the system catches those votes.  Before deducting the reputation from my account, do you check that I didn't really earn 20 upvotes that day on my own merit?  Most days I do hit the cap anyway, and I'm certainly not alone there.  It seems to me that it would be punishing the wrong party here.\n\nAgain: I suspect it would take more than a few upvotes here or there, but I didn't want to mention this somewhere."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Mar 04, 2009", "message": "Nevermind:  reading some of the other comments again I see you do account for this.  Good on you!\n\nBTW-- captha for this post is \"72 reputation\" :)"}, {"author_name": "dude", "gravatar_hash": "81e649868a7d1914a3c92b2af2d50993", "author_url": null, "date": "Jul 31, 2010", "message": "These comments were a really good, fun read. daok whining and crying in broken english, Jon being awesome, Jeff not taking any shit.\n\nBrilliant."}, {"author_name": "Xaade", "gravatar_hash": "7e8f972382645ebe8e980e7501642327", "author_url": null, "date": "Jan 25, 2011", "message": "What if you just let a profile only target another profile for a vote once per topic per day?\n\nI don't think \"powering\" up a vote by voting multiple times in up or down is a sign of reputation.\n\nA person should only be able to weigh in on another person's rep once per \"cycle\"."}]}