{"response": [{"author_name": "Dave Van den Eynde", "gravatar_hash": "1c3de6158085f955497b46705ffbdebc", "author_url": null, "date": "Feb 22, 2011", "message": "I miss the podcasts..."}, {"author_name": "Wim Haanstra", "gravatar_hash": "0ec84fc5efb4f0dc7db5df8bf6bb41b9", "author_url": null, "date": "Feb 22, 2011", "message": "I believe there is no question that is too simple, because from the users perspective, it's always a good question, just because he doesn't know the answer to it.\n\nIf it really is that simple, just answer it in a good manner and that will help other users with the same question. If you just close it, the question will be asked again by a user with the same problem."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 22, 2011", "message": "> If it really is that simple, just answer it in a good manner and that will help other users with the same question. If you just close it, the question will be asked again by a user with the same problem.\n\nDo we really want to spoon-feed (or even encourage in any way) users so lazy they can't find obvious Wikipedia pages? Or do even the most basic research before asking?"}, {"author_name": "Borror0", "gravatar_hash": "7d2cf5a9c2b110205d2bfab54dbc8b3c", "author_url": null, "date": "Feb 22, 2011", "message": "Consider putting a field to enter an url, for the close reason, like there is for duplicate questions. Like this, we can close the question yet answer the user's question so we don't come across as elitists."}, {"author_name": "Hasgaroth", "gravatar_hash": "f9ad85ccf4bca3a9b62ad82928206d2b", "author_url": null, "date": "Feb 22, 2011", "message": "I agree with @Dave, bring back the podcasts please! Spent many hours listening to the excellent content."}, {"author_name": "Tshepang Lekhonkhobe", "gravatar_hash": "88e60659e997d36af3ff348b3251e1a6", "author_url": "http://tshepang.net", "date": "Feb 22, 2011", "message": "I love the graph. It helps make your argument that much stronger."}, {"author_name": "Zooba", "gravatar_hash": "e24f82e7d3db571b680837784ccc3377", "author_url": "http://stackoverflow.com/users/891/zooba", "date": "Feb 22, 2011", "message": "I've always been on Joel's side in this debate - I think StackExchange and family should have the answer to *every* question on their topics (they only have to be answered once - then \"exact duplicate\" handles the rest).\n\nAs long as the close reason emphasises reference sources over blogs or forum posts, I'm okay with it, since it's obvious the community would prefer it. It would be nice to be able to include an external link with the close reason, which would more strongly implies that the close reason is \"this exists somewhere obvious\" rather than \"I think the answer is too obvious.\"\n\nI still believe that StackExchange sites should be a reference source at least of equal standing to Wikipedia in this context - which means you can find the *answer* to your basic question there - but if it's going to hurt the community then this is probably the best compromise we'll get."}, {"author_name": "Dominic Rodger", "gravatar_hash": "dcce4266f0c054991bf5dbd29794c743", "author_url": "http://stackoverflow.com/users/20972/dominic-rodger", "date": "Feb 22, 2011", "message": "+1 for Borror0's excellent suggestion for adding a URL to the close reason - I think this would avoid the community coming across as closed and unhelpful."}, {"author_name": "duncan", "gravatar_hash": "37758cbf7e480d283959f1e6ba7e3c34", "author_url": null, "date": "Feb 22, 2011", "message": "Question\n\"Do we really want to spoon-feed (or even encourage in any way) users so lazy they can’t find obvious Wikipedia pages? Or do even the most basic research before asking?\"\n\nAnswer\n\"Yes - if it isn't a duplicate.\"\n\nDo people want their site to be the ultimate reference on the topic in hand or do they want to outsource that role, in part, to Wikipedia?"}, {"author_name": "CraigTP", "gravatar_hash": "3b73bbf0341931b13046fef54193218e", "author_url": null, "date": "Feb 22, 2011", "message": "&gt;Do we really want to spoon-feed (or even encourage in &gt;any way) users so lazy they can’t find obvious &gt;Wikipedia pages?\n\nBut Jeff, what happens when the trivially easy to find Wikipedia or Google search result pages drop off the internet, or are changed?\n\nI believe it's still worthwhile to retain even simple questions and answers as it allows the SE sites to truly become the \"go-to\" repository of information, both \"easy\" and \"difficult\" on a given subject."}, {"author_name": "Ward", "gravatar_hash": "f347c53c9cb1ddcb816daeb22aaf89c8", "author_url": null, "date": "Feb 22, 2011", "message": "If you give a URL, you're still answering the question.  Also, unlike a link to a duplicate question w/in SE, the external link might change.\n\nI don't know if ServerFault sees this problem quite as much as some of the other sites, so I don't have a strong opinion on it.  Offhand, I'm more inclined to go with \"Close 'em fast.\""}, {"author_name": "FX", "gravatar_hash": "9e94db9aa0b32c7b91345a813b7615b6", "author_url": null, "date": "Feb 22, 2011", "message": "Serious +1 from me on that one. I strongly support adding this. In particular, on the English site, some people are just asking others to look up very common words in the dictionary (we recently had “What does ‘spouse’ mean?”)."}, {"author_name": "Piskvor", "gravatar_hash": "3fc34e753d1f98a60b12db03bceaf7fe", "author_url": null, "date": "Feb 22, 2011", "message": "@CraigTP: *Then* the question will not be \"too simple\" any more; this current problem is apparently meant to solve the problem of people who won't even search, just come to SO with \"how do i [sic!] install hiphop for phpPLZHELP!?!\" - when searching for the exact same information gives the official reference and tutorial as first result. Personally, I'm tired of answering the same ten questions by help vampires who are too lazy to even use Google, over and over and over and over. (Not to mention that we're conditioning them to come back and dump their problem at SO without any effort on their part - yes, we should help people, but I fail to see any effort in these queries, which makes me reluctant to compensate for that with my own)"}, {"author_name": "Grzes", "gravatar_hash": "712248df6de12dd9b8ba73869a110f1f", "author_url": null, "date": "Feb 22, 2011", "message": "I am definitely with Jeff on this one. People who can't be bothered to google the question are not really going to search the relevant stack exchange site for a duplicate (because its a more advanced type of search), so answering this question is not really going to help anyone. \n\nOn the other hand there will always be someone to answer these questions to get some points for free. From my experience the easiest way to get a lot of reputation points is to quickly answer trivial questions - probably because many people understand both the question and answer and will upvote. The great majority of non-trivial questions (i.e. that you can't find google or find in literature in a couple of hours) don't get any answer. So people with a high reputation are not necessarily experts in the field...\n\nSo I think that closing the trivial questions will make people concentrate on the hard and interesting at least a little bit more..."}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Feb 22, 2011", "message": "Bearing in mind the fact that I’ve never run a site like Stack Overflow, the only problem I can see with this is over-enforcement.\n\nI can see the dilemma — expert users want interesting questions, they can get really grumpy about low-quality question-asking (as it clutters up the site with things they’re not interested in, sucking their valuable time away), and they’re essential to the functioning of the site (because you need them to answer the harder questions).\n\nBut equally, simple questions can be a fine way to get new users into the site, both by asking them, and by finding them in subsequent Google searches.\n\nDid you guys discuss anything like having a flag for “simple” questions, and giving users the option to not see questions that have been flagged as “simple”? I can imagine there would be good reasons to avoid a system like that, but I’d be interested to hear any thoughts you had on it."}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Feb 22, 2011", "message": "&gt;  is not “is this on-topic?”, but rather “is this somewhat interesting and on-topic?”\n\nI think the close reasons should be updated appropriately.  Otherwise the \"Off Topic\" close reason doesn't seem to apply to these types of questions."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Feb 22, 2011", "message": "Yeeessssssss!\n\nI've been waiting for this for months. This is brilliant."}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": "http://echoreply.us/tech/", "date": "Feb 22, 2011", "message": "I agree that very lay / basic questions are causing more harm than good. They typically get voted or flagged into oblivion, harsh comments or extremely condescending answers.\n\nVery rarely do they result in a good experience for the person asking, or the community that reads them.\n\nThat being said, I was hoping that sites such as Stack Overflow would tolerate any question that was on topic and not a duplicate. But lately, the value of 'a little duplication' has come under debate, and some people just don't know _what_ to do with these.\n\nI suppose closed as \"General Reference\" is a bit more welcoming than heated comments and a surplus of down votes. If it really is a choice between the two, I suppose it's the better option."}, {"author_name": "Austin", "gravatar_hash": "842a66fdb75512f3a3f36771d02c80ce", "author_url": "http://metawizardnode.blogspot.com/", "date": "Feb 22, 2011", "message": "I agree, but I think that we're also missing an important point here:\nIf USA Today is written for a 6th grade reading level, and there are lots of people ( users ) who will have difficulty with that, then it is entirely possible that the \"overly simple\" questions that are being asked _are_ somewhat interesting and on topic from that viewpoint.\n\nI seriously think that technology like IBM's Watson is going to be extremely useful in filling in this gap; Watson will not get tired or annoyed answering the overly simple questions that make humans twitch."}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Feb 22, 2011", "message": "Since most of the traffic is from Google, I don't think the issue is that people don't use Google to solve their problems.  Rather, Google steers them to SO (or one of the family of sites) for the answer.  When they arrive, they don't find an answer to their exact question but they do find a handy \"Ask Question\" button -- so they do.\n\nThey have no clue how to use the site, but they do know that they have a question that could use an answer.  I can imagine that getting your first question closed with the equivalent of a LMGTFY response might serve as a strong deterrent against participation.  You might want to consider reserving this particular close reason for questions asked by users over some minimum reputation amount.\n\nAlso, whatever happened to \"we want SO to be the definitive source for all programming questions?\"  This seems like a change of direction."}, {"author_name": "Richard Gadsden", "gravatar_hash": "3c291e7858e6b79e06889fa7dbf16d31", "author_url": null, "date": "Feb 22, 2011", "message": "You need another step in the flow diagram \"is the easily-googled answer on a Stack Exchange site\" - because that should result in \"exact duplicate\" if it's the same site, and, presumably, \"transfer to other site and immediately close as exact duplicate\" if it's a different SE site.\n\nDo we have a \"transfer to other site and then close as duplicate\" option?"}, {"author_name": "mxyzplk", "gravatar_hash": "fde79b61219beecc221ad3e26943a992", "author_url": "http://mxyzplk.wordpress.com/", "date": "Feb 22, 2011", "message": "On the one hand, trivially Googleable questions annoy me personally, and I don't like answering them because I think it encourages someone to be lazy and don't like other people answering them because it seems like easy rep whoring.\n\nOn the other hand, trivial is in the eye of the beholder, and I suspect we'll always have 5 Aspergers-beset smartypantses willing to close any question they consider to be under their own level."}, {"author_name": "George Stocker", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Feb 22, 2011", "message": "One thing that should be added to the list:\n\nIf the question is easily 'googleable', *but* the primary source for the question is a blog or a site that has potential to 'go down' (follow the chain links from the top answer to this Stack Overflow Question: http://stackoverflow.com/questions/218845/defining-a-catch-all-route-for-an-mvc-site ), then a short, concise answer should be posted and linked to the blog post that gives more detail.  \n\nOne of the biggest problems we face on the internet is link rot. Putting content on Stack Overflow proper helps stop link-rot. It may be an easy question; and if it is, answer it once and close it as a duplicate. But for all our sakes, put the answer on Stack Overflow if it's not on a Tier-One site (MSDN, Wikipedia, etc.)"}, {"author_name": "Jeffrey Davis", "gravatar_hash": "6d81d6dc131240aff73b92c2777f1737", "author_url": null, "date": "Feb 22, 2011", "message": "\"Allow your Q&amp;A community to fill itself with enough “General Reference” type questions and you’ll soon find no experts there at all.\"\n\nCan you really fill up the internet?"}, {"author_name": "Jeffrey Davis", "gravatar_hash": "6d81d6dc131240aff73b92c2777f1737", "author_url": null, "date": "Feb 22, 2011", "message": "So wait. You're saying stackoverflow is no longer for answering questions, but now exists as entertainment for those that like to answer difficult questions?"}, {"author_name": "Aaron", "gravatar_hash": "71871324eb2b71d626ca305bc2307411", "author_url": null, "date": "Feb 22, 2011", "message": "To all those stating that the SE family should answer each and every question please keep this in mind...\n\nSO and others in the SE family should be a supplement to the vast information that exists on the web; it should not be a replacement.\n\nThis is a fantastic and welcomed approach Jeff; answering every question enables the very behavior that provides no value to the community at large."}, {"author_name": "Ace Calhoon", "gravatar_hash": "013fbfb6411dbf971dc8623af1096ddb", "author_url": null, "date": "Feb 22, 2011", "message": "It'll be interesting to see how this plays out on RPG.SE, where the questions that people complain are trivial are fundamentally not Googleable."}, {"author_name": "RSolberg", "gravatar_hash": "c6ecd6c96fcfb41c754fc0bf6812e6d0", "author_url": "http://rsolberg.com", "date": "Feb 22, 2011", "message": "I think this is a good example as to why SO and the SE network will fail eventually.  Rather than build up your own content with the full gamut of questions, we'll begin to push people away.\n\nWhat business with as many users as SE would want to cut their traffic to their sites?  Sites that make money through advertisement revenue?  Sites that are already doing very well in the SEO space.  Absolutely mind blowing.\n\nHere are the responses to people who feel like they need help going forward:\n- \"Search on google\"\n- \"That question is too easy to be answered here\"\n- \"You're not good enough to be here\"\n\nJust the kind of site that builds a community, right?"}, {"author_name": "RSolberg", "gravatar_hash": "c6ecd6c96fcfb41c754fc0bf6812e6d0", "author_url": "http://rsolberg.com", "date": "Feb 22, 2011", "message": "Furthermore, I was the one who answered Joel's turtle question.  It took a few seconds to supply an answer to the question.  More time has since been wasted on trying to prove why it was a pathetic question rather than realizing that if you search \"move turtle logo\" on Google, the SO link is at the top of the list.\n\nA basic question at the top of the search engine results page.  No place for that crap on SO right?\n\n#FAIL"}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Feb 22, 2011", "message": "It is humorous how 1 out of every three decisions made by the SO/SE team is yet another 'good example as to why SO and the SE network will fail eventually'.\n\nKeep failing, guys."}, {"author_name": "tim", "gravatar_hash": "94a0e83767dbc71db135454693540015", "author_url": null, "date": "Feb 22, 2011", "message": "I'd rather use a site that answered simple questions that go to a site that has more and more rules about how to ask questions, how to answer, what you're allowed to answer, etc."}, {"author_name": "Tobu", "gravatar_hash": "1582a749cbfa20851170f66d69d554d7", "author_url": null, "date": "Feb 22, 2011", "message": "I'm grateful for this. A question field spends human time. It shouldn't be used as often as a search field, or before it. I want to educate myself and others, but not feel like a chump doing so, and I do want signals that prevent the too lazy and clueless from filling up my front page."}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Feb 22, 2011", "message": "Of course, in a twist of irony, the very first search engine results for \"how to move the turtle in logo\" *is* the question on StackOverflow.\n\n...but I agree. Too many \"blatantly obvious\" questions are being asked on StackOverflow (and some of the other SE sites too from the sounds of it)."}, {"author_name": "Nick", "gravatar_hash": "f3664da2ca305284ab442e34daccc608", "author_url": "http://www.thecodingmonkey.net", "date": "Feb 22, 2011", "message": "The problem that I see here is that if you go through the work to determine whether the question is too basic and should be closed, you either have spent more time determining it should be closed than it takes to answer it, or you have enough information to answer it for the user and closing it without answering it seems spiteful.\n\nWhat that means is that what we're really looking for here is a better way to discourage people from asking incredibly simple questions without doing basic research first. Not getting up votes is simply not enough discouragement. Closing a question as general reference should probably also cost the asker some reputation, or have some other penalty.\n\nOr perhaps if a user has had some threshold number of questions closed for this reason, then asking a question should cost reputation after that point... or something."}, {"author_name": "nos", "gravatar_hash": "e8f00dcda7f8343c1cc94d76872d60d2", "author_url": null, "date": "Feb 22, 2011", "message": "Well, how many views had the \"How do I move the turtle i logo\" question had ? That'll be a good indication of how useful these simple question has. Well - not this particular question, it's had too much PR. Find some other simple questions and ifigure out how many people got to SO because of it :-)"}, {"author_name": "John Saunders", "gravatar_hash": "953e26e80351a67962a6e5840fc1fc14", "author_url": null, "date": "Feb 22, 2011", "message": "If I can copy the title and paste it into my favorite  \"Search\" box, and find the answer in the first few results, then it's too trivial and should be closed.\n\nI personally don't want to require that the OP spend more than two minutes looking for a solution before trying SO. But I really don't think that two minutes is too much to ask when the alternative is asking someone else to answer your question."}, {"author_name": "Russell", "gravatar_hash": "c6ecd6c96fcfb41c754fc0bf6812e6d0", "author_url": "http://rsolberg.com", "date": "Feb 22, 2011", "message": "I'm still baffled not only by this post but a majority of the comments here.  This is reminiscent of a Rich B face palm moment for me.  \n\nLet me confirm something, StackOverflow is now a site that says...\n- If you can Google it, then do so.\n- We are now a LMGTFY site.\n\nIf this is the case, then before a question can be posted, a new browser window should be opened with google results asking the user to confirm the question isn't on the first page of results.\n\nMaybe I'm the only one with this mindset, but what exactly was broken again?"}, {"author_name": "Aditya Banerjee", "gravatar_hash": "bb084e0accfacdb3d8b16c29dae406a0", "author_url": "http://abaditya.com", "date": "Feb 22, 2011", "message": "IMO it'd be better to flag the question as \"general reference\" or something along those lines and place them in a separate section on the site rather than closing them outright. This would prevent duplicates and also ensure that the site gets richer in information. After all, the nature of questions and usage models vary across sites on SE.\n(extracted from my answer on the discussion at Photo SE - http://meta.photo.stackexchange.com/questions/803/what-questions-are-too-simple/806#806)"}, {"author_name": "Banang", "gravatar_hash": "3f75c26671ae636dea2d0aac39946665", "author_url": null, "date": "Feb 22, 2011", "message": "For me there are two kinds of simple questions, the ones asked by people who have no clue, and the ones asked by those who should know better. I totally agree that simple and uninteresting questions asked by people who should know better should be closed with all speed. Those questions are not helping, and these people are likely to continue on with their bad behaviour if we encourage them.  \n\nHowever, I strongly feel that simple questions asked by newbies (first-time askers, or obvious learners) should be answered, but answered in such a way that the newbies learn something about how to find the knowledge in the future. Remember that even the really simple things were not always obvious, and sometimes it might be that people just don't know what to look for, or how to extract the information they need from the information that is available. \n\nI believe that a guiding answer, not just consisting of a link, is the way to answer these questions. Is the question about how to add things to a Map in java? Really simple. Is it possible that the asker is so new at this that he or she is not aware that there are docs (remember that this is possible)? Write an answer linking to the docs, that also explains how to read and navigate them. Make sure that the answer also explains that (and why) this is a really simple question, and explain the steps to asking a more interesting one in the future. \n\nNewbies will always ask simple questions, but if we help them just a little bit at the start they'll soon stop asking simple questions and will start to deliver the interesting ones."}, {"author_name": "Wesley", "gravatar_hash": "7cf5cd2dab3b0dc1936dc29fc112e608", "author_url": "http://stackoverflow.com/users/114147/wesley-werner", "date": "Feb 23, 2011", "message": "I believe its true when you say \"... with enough “General Reference” type questions and you’ll soon find no experts there at all.\"\n\nJust like we don't want duplicate questions, we also shouldn't want duplicate reference material that's available online. Finding that stuff is part of the territory, it satisfies our curiosity, and we often discover other interesting bits while doing reference lookup. \n\nA new close reason is a great idea. I have a suggestion to consider and expand on: supplement the close action with a \"General Reference Ratio\". \n\nHere's what I mean:\n\nThe flowchart rings pretty true, we can correlate this with the community's opinion via a simple vote on a question: \"I know this answer\" / \"I can't find the answer\"\n\nIf you don't know the answer, but can find the answer within a few minutes, then you may vote as such. You can provide a link of your find even. Of course you can only vote if the question is under suspicion of \"General Reference\".\n\nIt's just to provide an indicator for making better informed decisions, of which side the question falls.\n\nThe more people know the answer, the more indication is it that the question is general knowledge, and more likely to be available in reference material. _Yes I realize this is an assumption, and we know what those lead to, but I'm just exploring a possibility here_.\n\nIt could be an alternative to debating a question at length: just put it to a vote and let general knowledge decide. \n\nP.S. see this great FAQ on how to ask questions the smart way - http://www.catb.org/~esr/faqs/smart-questions.html"}, {"author_name": "Jakub Narębski", "gravatar_hash": "672aa8b373071ef9f06db563d1c08d77", "author_url": null, "date": "Feb 23, 2011", "message": "When asking question on SE sites, the site suggests questions which are similar to the one you are asking.  Perhaps doing something similar with external sources would be good idea (search for term, and check if in first 10 references there is Wikipedia result, or Wiktionary / online dictionary result for English.SE)."}, {"author_name": "Piskvor", "gravatar_hash": "3fc34e753d1f98a60b12db03bceaf7fe", "author_url": null, "date": "Feb 23, 2011", "message": "We're strung between two opposites here: if the Scylla of the umpteen-thousandth \"waht is gooder ++x or x++ ! SEND CODEZ PLZ?\" doesn't get us, the Charybdis of \"UTFG n00b, we're too smart to help you\" will.\n\nThis \"general reference\" reminds me of the original \"close as duplicate\" implementation - frankly, I don't care if any specific question gets closed or stays open; the point is \"whatever happened, did that answer the question?\" - and \"LMGTFY\" doesn't do that. If closing as reference will allow to select something like this, it might help (different from \"duplicate\" in that there's a pre-selected \"reference\" question)."}, {"author_name": "Aarobot", "gravatar_hash": "687f8a43b58fe35c8b2933f1f16b13cb", "author_url": null, "date": "Feb 23, 2011", "message": "I see a lot of comments here pouncing on the \"easy to Google\" or \"newbie question\" angle, and I would like to clarify something that I know Jeff has taken to heart but many of the commenters here aren't getting:\n\nWe are talking about answers addressed by GENERAL REFERENCE SOURCES.\n\nGENERAL REFERENCE.  Please, everybody, learn and understand what that means.\n\nGeneral reference means a dictionary, an atlas, an encyclopedia, etc.  Sources that are *universally* available and *extremely well-known*.  Not a blog, not a news article, not an academic journal.\n\nAs I noted in my comments on the Cooking site, people should consider Bloom's taxonomy here.  General reference sources are specially-crafted to be excellent at dissemination of Knowledge-level information.  That is the kind of question we are talking about closing.  It doesn't matter how *easy* the question is, it matters how *basic*.  There's a subtle but important difference.\n\nLook at the front page of Stack Overflow.  Virtually every single question there is at the *Application* level of the taxonomy. I understand the tools and syntax, and I understand what I'm trying to accomplish, but I can't quite figure out how to apply the former to the latter.  A lot of those questions may still seem very simple to experienced programmers, but even the yawn-fest of \"How do I write a LEFT JOIN in Linq\" questions are still challenging and interesting to *someone*, because they take *skill* to answer.\n\nAs we go further down the taxonomy, the questions become less and less interesting.  \"What language is this code written in?\"  or \"What's the difference between Linq to SQL and Entity Framework?\" or \"What does it mean when I get a NullReferenceException here?\" Comprehension questions like these are generally frowned upon, and thought of as prosaic, but are nevertheless tolerated.  You still need to ask a programmer to get the answer. Asking the library reference desk isn't going to get you there.\n\nBut the pure Knowledge questions - ooh, they make us furious, and we always seem to have a hard time articulating why.  \"List of X\" - that's knowledge.  \"Plz send the codes\" - that's knowledge.  \"How do you pronounce SQL?\" - knowledge.  Dry context-less facts, rote memorization.  Those are the Eternal September questions that bore us all to tears.  Anybody can answer them, even those with no programming skill whatsoever.  Many of us have been members of communities that eventually got flooded with these kinds of questions, and we left.  Descend from the mediocre Comprehension questions into the mind-numbing Knowledge questions and that is just too much for many of us to bear.  A glut of such questions it the death knell for any community of experts.\n\nElite communities like Math Overflow and (controversially) Theoretical CS want to deal with *Analysis* level questions or better - so-called \"research level\" questions.  We are *way* more open-minded on Stack Overflow and most of the other Stack Exchanges; we set the bar *much* lower; but we still have our limits.  When we say \"no question too basic\", we actually mean \"no specific programming question too basic\" - general knowledge questions are really in a different category altogether.\n\nThat doesn't mean every Knowledge question should be closed, incidentally; only those that have their own Wikipedia page or dictionary entry.\n\nStack Overflow/Stack Exchange's mission is ostensibly to make the internet a better place; by answering general-reference questions that already have *better* answers on Wikipedia, we're actually making it worse. Oh, sure, we're creating a negative experience for that one user who asked the question, but we are actually doing a favour to future visitors by directing them to an *authoritative* source of information, as opposed to what \"some guy on the internet\" says.\n\nSo I agree whole-heartedly with this idea, and hope that the (IMO very polite) close reason makes it into the repertoire.  I also definitely support attaching a URL to the close vote, like duplicates, because after all, this is essentially a very specialized case of duplication."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Feb 24, 2011", "message": "Case in point: http://stackoverflow.com/questions/5103596/array-walk-array-map-situtaions"}, {"author_name": "Piskvor", "gravatar_hash": "3fc34e753d1f98a60b12db03bceaf7fe", "author_url": null, "date": "Feb 24, 2011", "message": "@Pekka: That seems to be a textbook example of a \"help vampire\", down to dumping every single step of the problem at SO. As such, I'm not sure that \"close as GR\" will help this specific user; as for the question - there is indeed a general reference for built-in PHP functions (php.net - well known and available netwide), so that would qualify IMHO."}, {"author_name": "css", "gravatar_hash": "3e74434d6cf03ab583ef1ab92c10be1f", "author_url": "http://css-css.com", "date": "Feb 24, 2011", "message": "im a web designer.i will find some about css q."}, {"author_name": "markusd", "gravatar_hash": "2307819c404cf670a302c4e33cd7dc45", "author_url": null, "date": "Feb 26, 2011", "message": "I think even simplest questions should just be answered. What's the big deal? It doesn't harm anyone and the answers are typically short. If some people personally do not want to answer such a question, that's okay. But closing the question doesn't make sense to me."}, {"author_name": "André Caron", "gravatar_hash": "64afa42ebc0a920509f959e97307d16f", "author_url": null, "date": "Feb 28, 2011", "message": "What about adding links to the first few \\Google/Bing/Yahoo/...\\ results on the \\ask question\\ form, just like the site displays links to similar questions on SO?\n\nIt might be tempting to not ask the question after all if the trivial link to the reference pops up before you finish typing!"}, {"author_name": "André Caron", "gravatar_hash": "64afa42ebc0a920509f959e97307d16f", "author_url": null, "date": "Feb 28, 2011", "message": "There's a bug on this form!  The double quotes I typed turned to backslashes!"}, {"author_name": "DVK", "gravatar_hash": "f3d2c01f6f55bb34530fcbae9a39d285", "author_url": "http://stackoverflow.com", "date": "Mar 01, 2011", "message": "Jeff - will there be an effort to clean up (close and/or delete) legacy \"General reference\" questions?\n\nIncidentally, as a long term proponent of \"make SO friendlier to experts\", thank you for this wonderful step. \n\nImplementation wise, \"me too\" :)\nI strongly agree with the two ideas presented (allow adding a link to the resource when closing as \"General reference\"; and display top 10 Google or Bing search hits when asking, possibly pytting visual emphasis on reference site hits)."}, {"author_name": "Mark Hurd", "gravatar_hash": "649d0c30b87efd8094abfcb4624b431e", "author_url": "http://www.ozemail.com.au/~markhurd/", "date": "Mar 01, 2011", "message": "It will be \"interesting\" to see how this is applied.\n\nhttp://stackoverflow.com/questions/449627/are-line-breaks-in-xml-attribute-values-valid\n\nThe above is solved by a simple location of the relevant standard document.\n\nBut I've just added a bit more information as a comment that could have been part of an answer given slightly different situations (and could be highly relevant if the situation IS part of the standard and not specific to .NET)."}, {"author_name": "zneak", "gravatar_hash": "4b25144c09555e7d5b5e288469e011ef", "author_url": null, "date": "Mar 02, 2011", "message": "There *are* such things as questions that are too simple. I couldn't agree more. Just a few moments ago, I found a question so simple I felt bad about posting an answer for so little characters; instead, I posted a comment.\n\nI do think, however, that links to such general references should be added when the question is closed."}, {"author_name": "Anonymous Type", "gravatar_hash": "0d1c1cc59618ad2a4afda1ce103f605e", "author_url": null, "date": "Mar 17, 2011", "message": "One of my favourite SE threads.\nKeep raging guys.. but seriously both sides are actually quite correct. I think this is evident from the fact that the people answering questions, are not limited to experts. Plus everyone has a soft spot when they spot a newbie asking a facepalm question. Having said that, if I had more rep I'd still close 'em."}, {"author_name": "sgMarshall", "gravatar_hash": "d087e49079ba7578681db200fb417f51", "author_url": null, "date": "Aug 13, 2011", "message": "Simple questions should be allowed. \n\nIt bothers me that often one actually has to know the answer to understand why a question was closed. Or that the FAQ gets used far more as a hammer than a guideline.\n\nOutside of the math and programming forums it can be a mistake to assume that simple questions only have simplistic answers. Many of the ‘experts’ in forums are specialists who often do not fully understand the question may lie outside their expertise. We should not assume just because a question has a simple Google answer, that there aren’t more complex answers which don’t pop to the top of Google searches. \n\nGiven this, I do believe that many simple questions should be allowed as community wikis."}, {"author_name": "ubru bey", "gravatar_hash": "f4642f5a66fd4dc50df5606ad0335380", "author_url": null, "date": "Oct 04, 2011", "message": "course not, some might be answerable by yes or no but still there are instances that you need to support..so i say no question are too simple:)"}, {"author_name": "chris", "gravatar_hash": "8341c638cb0f767d41b4925d41f0b5e8", "author_url": null, "date": "Oct 26, 2011", "message": "turtle question is gone :(\n\nprobably should have been marked \"historical significance\""}]}