{"response": [{"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Feb 23, 2011", "message": "The new version of careers looks pretty sweet. I paid for my membership, but won't be seeking a refund as thanks for basically \"pulling a google\" and eventually making all your services free."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Feb 23, 2011", "message": "Given Joel's resume page, I'm tempted to sign up just for the kicks of seeing what my own page would look like. Still very happily employed though :)"}, {"author_name": "Chris R", "gravatar_hash": "8cf13bc42e1a9062a0a5d11218a25934", "author_url": null, "date": "Feb 23, 2011", "message": "I, too, paid for a membership and have no intention of asking for a refund assuming that the current high standard of end user support is maintained. I'm glad to see that SO.com is always pushing to Make It Better. Thanks, folks!"}, {"author_name": "Joel Spolsky", "gravatar_hash": "95e6837f350869bfb44e069a98885c58", "author_url": "http://stackoverflow.com", "date": "Feb 23, 2011", "message": "We're hoping that SO profiles become the kind of professional permanent portfolio that people use as their home on the Internet, even when they're not looking for a job."}, {"author_name": "Igal Tabachnik", "gravatar_hash": "c12b67ddd060aa0abbb59da1b0da3530", "author_url": "http://www.hmemcpy.com/blog", "date": "Feb 23, 2011", "message": "I also paid to host my CV on Careers when it just launched, since I knew it would be as successful and high quality as StackOverflow - never would consider asking for a refund!\n\nI love the new changes, as well as the new look and feel. Great job!"}, {"author_name": "Michael Mrozek", "gravatar_hash": "dd7e03fbbfcabd4675844173ec5390d2", "author_url": "http://mrozekma.com", "date": "Feb 23, 2011", "message": "Is all this live? We're having trouble figuring out how to invite others, or how to add our favorite answers"}, {"author_name": "John Fiala", "gravatar_hash": "0ea7bb11e90d00eee00f6c8863f9f654", "author_url": "http://www.jcfiala.net/", "date": "Feb 23, 2011", "message": "I'm happy to have paid for my membership too, but I'm also glad to hear that you've made improvements - I've never really been happy with interacting with careers in the past, and have sometimes returned to my account to discover someone had tried to contact me months ago. \n\nI'll go have a look at the new site soon."}, {"author_name": "Mike", "gravatar_hash": "128b7d2b61160b90b0b4a8d2dca0c6d2", "author_url": "http://madsoftware.blogspot.com", "date": "Feb 23, 2011", "message": "I understand the need to keep the spammers at bay, but keeping the system invite-only will make it basically useless for employers since it's going to take some time for the invites to propagate out to the wider developer community.  Especially those in markets outside of the valley and the northeast."}, {"author_name": "Joel Spolsky", "gravatar_hash": "95e6837f350869bfb44e069a98885c58", "author_url": "http://stackoverflow.com", "date": "Feb 23, 2011", "message": "@Mike we'll be sending house invites to just about anyone with a pulse. Get a handful of upvotes on some of your answers and you should see a \"house invite\" quickly."}, {"author_name": "Danny Tuppeny", "gravatar_hash": "b73c3c87b4b455fcd03f7c49cec0792c", "author_url": "http://blog.dantup.com/", "date": "Feb 23, 2011", "message": "Looks awesome - let's hope invites aren't as hard to get as they were for Google Wave ;("}, {"author_name": "Greg Hurlman", "gravatar_hash": "27e04e6b5a8c7d84b45cb2729b1140b6", "author_url": "http://greghurlman.com", "date": "Feb 23, 2011", "message": "There are a few bugs that I've found already; I assuming that careers@stackoverflow.com are the place to send them?"}, {"author_name": "Joel Spolsky", "gravatar_hash": "95e6837f350869bfb44e069a98885c58", "author_url": "http://stackoverflow.com", "date": "Feb 23, 2011", "message": "Yep. We'll be shaking out a few of those bugs in the next few hours... the team was literally working day and night to get this thing ready to launch in time for the Launch conference, so it was a bit rushed there at the end :)"}, {"author_name": "swilliams", "gravatar_hash": "3429df2e085587406780ca9e776f93b7", "author_url": "http://krazyyak.com", "date": "Feb 23, 2011", "message": "Not sure how it is calculating years or experience, but it's pretty off for me. I have 8 years of C# development, but my profile is only listing 4."}, {"author_name": "Fredrik Mörk", "gravatar_hash": "f40ccff29d3ac083ca1cb511d8824b2f", "author_url": "http://softwareblog.alcedo.com", "date": "Feb 23, 2011", "message": "Really like the update, at least from the job seeker point of view (which is what I see). One question though; how is the \"N years of experience in [tags]\" calculated? I find the selection a bit odd..."}, {"author_name": "Telanis", "gravatar_hash": "7f2b79cd5329a2c04562a873211e5d16", "author_url": null, "date": "Feb 23, 2011", "message": "Bit of a problem though ... says I have \"0 year of experience\" in a bunch of areas.  and I can't edit it.  WTF?"}, {"author_name": "John Feminella", "gravatar_hash": "443151a46d26be04e579305876a6a5e0", "author_url": "http://stackoverflow.com/users/75170/john-feminella", "date": "Feb 23, 2011", "message": "Looks fun! But when are those invites going out? I've got 40k+ SO rep and my inbox is looking pretty forlorn."}, {"author_name": "Corey Sunwold", "gravatar_hash": "1dc5a3039e24154dc887846813e8ab5a", "author_url": "http://csunwold.blogspot.com", "date": "Feb 23, 2011", "message": "I really like the new feature where you can show your favorite answers, but I can't seem to figure out how to use it. Is it a reputation based feature or am I just completely not seeing how to include it on my profile?"}, {"author_name": "Michal Mocnu", "gravatar_hash": "05aa36ab5c7d2c620d27d86415ba2eb7", "author_url": "http://mmocny.wordpress.com", "date": "Feb 23, 2011", "message": "Very cool idea.  I am interested to see in practice how this will compare to just linkedin.\n\nCertainly in principle the integration with Stack Overflow should help match employer - employee.\n\nNow, how do I get an invite? ;)"}, {"author_name": "Eric Belair", "gravatar_hash": "46b2704c26143ab9c430b4250eb28f88", "author_url": null, "date": "Feb 23, 2011", "message": "This is great news. I'm in the market and didn't feel like paying to re-up! Thanks Joel!"}, {"author_name": "Cristian", "gravatar_hash": "7c866ac84e832e585c6bd3abe1149c47", "author_url": "http://careers.stackoverflow.com/ciupicri", "date": "Feb 23, 2011", "message": "Is is to me or there's a bug in the public profile? I'm seeing *Most recently at X; N previous positions listed.* even if X was the first company I worked for."}, {"author_name": "Randolpho", "gravatar_hash": "09117ac8e2599741ee9191777848b598", "author_url": "http://geekswithblogs.net/LessonsLearned", "date": "Feb 23, 2011", "message": "Joel,\n\nI'm an \"original adopter\" of Careers 1.0. Paid my dues, never looked back, don't need a refund, you're welcome to keep the cash as my contribution to the effort. \n\nI've got a friend asking for an invite to Careers 2.0, but he's a lurker on Stack Overflow rather than a contributor and unlikely to get a house invite. I've combed through the new careers site and even looked through Stack Overflow directly, and cannot find any way to actually invite somebody to Careers. Did I miss a link somewhere? How do I actually invite somebody?"}, {"author_name": "Bob", "gravatar_hash": "f7d0553c69f0ed97a32818107a1ef53e", "author_url": null, "date": "Feb 23, 2011", "message": "Can you still pay if you have no friends :-("}, {"author_name": "Joni", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": "http://careers.stackoverflow.com/jonik", "date": "Feb 23, 2011", "message": "CV migration from 1.0 seems to have gone smoothly, but there's one bug I noticed: \"Most recently at [company]\" at the start of the CV works the wrong way, at least on my CV ( /jonik ), showing the *least* recent company.\n\nIt's nice that you offer a refund for old customers, but I won't be asking my $10 back either. Out of the 4 companies who've reached out to me, 3 have been very/extremely interesting (and fourth one, well, totally off). I got my coolest, most valueable job interview expecience so far (they flew me to London; 7.5h of interviews &amp; tests) through one of those. So while I've yet to find a perfect match through your service, I can't really complain. The amount of messages received hasn't been large (partly, I think, because close to zero Finnish employers know of the service), but, in my experience, the quality makes up for it.\n\nBtw, when can I invite people to Careers 2.0? I didn't see that option anywhere. Or are those only given to few, selected users?"}, {"author_name": "ayaz", "gravatar_hash": "f91fa61525530ab1579cea46bc7c47bd", "author_url": "http://ayaz.wordpress.com", "date": "Feb 23, 2011", "message": "Excellent work, guys! I simply adore the new interface and the set of new features introduced. I paid for the service when I signed up over a year ago. I know, as I knew then, I invested my money wisely. \n\nOnce again, kudos for the effort put in."}, {"author_name": "Steve", "gravatar_hash": "c02a0b87f6684312a64c117d22deed3c", "author_url": null, "date": "Feb 23, 2011", "message": "Add careers to the stack exchange process."}, {"author_name": "Oscar Mederos", "gravatar_hash": "30f7d0e60442d70d7e22667520442395", "author_url": null, "date": "Feb 23, 2011", "message": "Hello Joel,\n\nThose are good news.\n\nIs it suppose to be valid for programmers who want to get hired to work at home (maybe in another country) too?"}, {"author_name": "Prestaul", "gravatar_hash": "e268a5c30f1c8fbfd997d5185955e857", "author_url": null, "date": "Feb 23, 2011", "message": "The \"X years of experience in...\" feature seems to be pretty erratic.  I like the concept, but I'd rather not have it there if it isn't going to show the correct values...  Also, with a limit of 10 technologies for each employer, it is not easy to show continuous experience in every technology.  \"Hmm, I've got 13 technologies I'd like to list...  Guess I'll drop SQL, HTML, and CSS because those go without saying for a php developer.  Dang it!  I've got more than a year of experience with HTML!\""}, {"author_name": "Joni", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": "http://careers.stackoverflow.com/jonik", "date": "Feb 23, 2011", "message": "Agree with Prestaul.  For me it now says \"1 year experience in sql\", which is kinda silly and misleading. I only listed SQL for my first job, as a novice programmer - for my later jobs there are far more interesting and relevant tags! \n\nI guess I'll have to drop those too, unless you tweak the feature so that you can actually enter the correct amount of years for each technology."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Feb 23, 2011", "message": "I agree with the \"x years of experience\" concerns mentioned before.\n\nI'd also like to put in a feature request for allowing a choice of which tags are used in the \"90th percentile on...\" and \"80th percentile on...\"\n\nMy 90ths are okay: c# .net java linq generics multithreading\n\nMy 80ths are rather more suspect: startswith begininvoke listt perl scala delphi\n\nI don't do any Perl, Scala or Delphi and if there are *really* any employers looking for experience of StartsWith, I'm worried..."}, {"author_name": "ChrisF", "gravatar_hash": "ee006a67bbbb535dc04afc6a03b1843f", "author_url": null, "date": "Feb 23, 2011", "message": "OK then, how do we include our favourite posts on our profile then? Or do we need an \"invite\" to unlock this feature?"}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Feb 23, 2011", "message": "There's a typo under 'Dislikes':\n\n\"List up to 5 technologies that you are dealbreakers for you.\""}, {"author_name": "Joni", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": "http://careers.stackoverflow.com/jonik", "date": "Feb 23, 2011", "message": "Jon, but then, isn't it kind of nice to be recognised as a top of the line startswith professional. :-)\n\nMore seriously, like Corey Sunwold above, I'm also wondering how to link favourite answers to my CV. There's no such option to be seen at least in the \"Stack Exchange Network\" section (screenshot: http://i.imgur.com/jpPf0.png ). (My highest-voted non-CW answer has a score of +31, which I imagine should be enough, as Joel's example CV has answers with less than that...)"}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Feb 23, 2011", "message": "Also, I have a question. You mention that you can add some of your best answers to your profile, but I can't find that anywhere when editing mine. Where do I look for that?"}, {"author_name": "AviD", "gravatar_hash": "a88248f632c039340efa02505be355e5", "author_url": null, "date": "Feb 23, 2011", "message": "looking real nice!\n\nA question - are there plans to expand this other relevant SE sites?\n\nE.g. SF, ITsec, etc... Still close to the field of SO, just a different specialization."}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Feb 23, 2011", "message": "This new approach to Careers looks to be a big improvement.  I have just one suggestion to improve it.\n\nThe \"x years experience\" functionality isn't going to be accurate enough to be useful.  It would be better to disable it (or at least give individual users the option to disable it).\n\nFor example, if I want to list technology A for every position where I've used it I will have to leave other technologies out of my 10 tags.  On the other hand, if I don't list it for every position my experience will be understated.\n\nAlso, if I list technology B for a position I held for 4 years, it will list 4 years experience, even if I only actually used it for 6 months."}, {"author_name": "Chris", "gravatar_hash": "d6fa109f0556ea5a3f1804732b1d1cc1", "author_url": "http://unix-experts.com", "date": "Feb 23, 2011", "message": "What about UNIX sysadmins and storage sysadmins?  Are we included?"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Feb 23, 2011", "message": "&gt; professional permanent portfolio\nThat's great for SO, but now SE goes beyond anything professional and with the new aggressive auto-login and auto-association features it's impossible to disconnect the hobby/interests sites from SO and hence from your career.\n\nIf this isn't going to run into facebook levels of complaints about privacy can we have a way of disconnecting our id on hobby SE sites ?"}, {"author_name": "Joni", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": "http://careers.stackoverflow.com/jonik", "date": "Feb 23, 2011", "message": "Ah, it became possible some moments ago to add \"Top Answers\" to your CV, from any of the SE sites. Works great!"}, {"author_name": "Cristian", "gravatar_hash": "7c866ac84e832e585c6bd3abe1149c47", "author_url": null, "date": "Feb 23, 2011", "message": "@mgb: you can \"select the Stack Exchange network sites you'd like to display on your profile\"."}, {"author_name": "Tom horn", "gravatar_hash": "7bb5f2493a0683f05729bfd93c4c8636", "author_url": "http://www.cannonade.net/dev", "date": "Feb 23, 2011", "message": "New version looks great. Congratulations guys."}, {"author_name": "Girish", "gravatar_hash": "adea5a1cbcd7c39ff80696f4c216cbc0", "author_url": "http://giri.sh", "date": "Feb 23, 2011", "message": "Joel, I'm one of the guys that paid when version 1.0 came out. Do you think we'd get the invites?"}, {"author_name": "Christian", "gravatar_hash": "ba1b4aaff5f0dc3b80c8fe6c3b3aaf6c", "author_url": null, "date": "Feb 23, 2011", "message": "I've been waiting for Careers 2.0 for years.  Does that mean I'll finally stop getting phone calls and emails from recruiters for every Java programming job all over the country?"}, {"author_name": "Jerome Pineau", "gravatar_hash": "dd5bb5276f09d20c9c78005e29a5462a", "author_url": "http://www.jeromepineau.com", "date": "Feb 23, 2011", "message": "This is so cool - I'm curious if you plan on doing one for social media/community management folks - there's a serious pain point there for both seekers and employers in the market, and it's worldwide.\nThanks Joel, you still rock man! :)"}, {"author_name": "Mat", "gravatar_hash": "444d7370a74549ff25eb034459e355df", "author_url": null, "date": "Feb 24, 2011", "message": "Has anyone else had any luck with getting sensible sample searches with European search terms (e.g. London for a start). All I get is US candidates which is somewhat useless to me."}, {"author_name": "Diego Mariño", "gravatar_hash": "8cc99824b3dfeee23fc4fcc0deb6afc6", "author_url": "http://externalidades.net", "date": "Feb 24, 2011", "message": "Hi Joel,\n\nDo you plan to offer an API for gathering data from the dashboard?"}, {"author_name": "Bas van de Haterd", "gravatar_hash": "a39e704e8f4d6b0a9bdf29f001cbab25", "author_url": "http://www.rectec.nl", "date": "Feb 24, 2011", "message": "Hi Joel,\n\nDoesn't really work that well yet, the search, does it? If I search for example in Utrecht, netherlands, 5 miles the map says there are 4 people, yet, I don't get any. I do get people in New York, yet... last time that wasn't within 5 miles of the Netherlands :)"}, {"author_name": "Stephen Kellett", "gravatar_hash": "88e63373598f22c174053ff0078ab42a", "author_url": "http://www.softwareverify.com", "date": "Feb 24, 2011", "message": "Invite only?\n\nI can pretty much gaurantee I'll never be invited to put my profile on here, as will many other talented folk. Not unless StackOverflow itself invites me.\n\nWhy? Because I live in the middle of nowhere. My list of contacts that I know in the software industry are all building their own businesses (as I am) and none of us see each other any more - trying to get to meet them just for lunch is nigh on impossible these days, just too busy. Also we haven't worked together for so long that what we know about each others skills is totally out of date. THe only thing we do know is that \"Adrian was great at blah blah blah and is now running m-spatial\", etc. No one that knows me by email only would invite me to put my profile here. I haven't exactly spent the last 20 years working the Cambridge networking scene (I possibly should have, but I haven't) or contributing to open source code and trying to get a high github commit profile. The people that know me, know what I can do, but those people are few and far between.\n\nTo give you an idea of how disconnected I am from invite only systems - gmail was invite only for a very long time. I got my first invite for gmail 2 months ago (from a customer of our company). \n\nThis isn't really a problem for me, as I run my own business. But there must be other people in this situation. You are deliberately excluding talented people.\n\nI would have thought just having created a valid answer on StackOverflow would be enough to deter spammers. How many recruitment agencies know enough to post a detailed answer on ASP.Net, Ruby on Rails or (cough) Cobol?"}, {"author_name": "Oliver", "gravatar_hash": "13c44ef2d9d79dcca761a584be868def", "author_url": null, "date": "Feb 24, 2011", "message": "How exactly does the \"passive candidate\" thing work? I guess even for those it would be useful to indicate what type of offerings they're likely to respond to. E.g. fulltime, telecommute, etc. But right now, it appears to be all or nothing.\nIt'd probably also be useful if it were possible to only have that information visible in the employer view, not the public view."}, {"author_name": "Andrey", "gravatar_hash": "8525d1639b960ef0b6b3d7424785d83a", "author_url": null, "date": "Feb 24, 2011", "message": "I have to join this slight disappointment shared by Stephen Kellett. I'm pretty much in the middle of nowhere too and it's highly unlikely to get an invitation."}, {"author_name": "Jason Punyon", "gravatar_hash": "c88159de92d664d35761fe5828cc5ccd", "author_url": "http://careers.stackoverflow.com", "date": "Feb 24, 2011", "message": "@Mat:  You probably want to untick the checkbox that says  \"Include candidates who want to relocate here\""}, {"author_name": "Mat", "gravatar_hash": "444d7370a74549ff25eb034459e355df", "author_url": null, "date": "Feb 24, 2011", "message": "@Jason Punyon: Thanks, but I've already tried that. The map picks up the correct location and shows some active candidate 'blobs' but I only ever get results for miles away. Doesn't appear to be a UK thing - if I search for (e.g.) Kentucky, I still get results for Texas, New York, etc."}, {"author_name": "Jason Michael", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": null, "date": "Feb 24, 2011", "message": "Maybe you could have Careers 3.0 setup so that you only have member resumes of people with 2000 upvotes displayed, and recruiters pay a fee of $12,000 per year to view those."}, {"author_name": "Korneel Bouman", "gravatar_hash": "2c3f79bed945b193634cf6794df49661", "author_url": "http://careers.stackoverflow.com", "date": "Feb 24, 2011", "message": "Just a quick update responding to some point above: \n\n- We've removed the experience feature, but will bring it back better and improved (see: http://meta.stackoverflow.com/questions/80390/why-does-it-say-i-have-0-year-of-java-experience/80421#80421)\n\n- There was a bug preventing you from adding questions to your profile which has been fixed\n\n- We will slowly start to give people invites to distribute, and will also issue house invites to people that actively participate on Stack Overflow (see: http://meta.stackoverflow.com/questions/80408/how-do-i-give-out-an-invite-on-careers)\n\n- We'll keep looking into geo-location issues as they come up - please send them to careers [at] stackoverflow [dot] com when you run into them. \n\nIn general feel free to email any bug reports to careers [at] stackoverflow [dot] com\n\nThanks!"}, {"author_name": "Korneel Bouman", "gravatar_hash": "2c3f79bed945b193634cf6794df49661", "author_url": "http://careers.stackoverflow.com", "date": "Feb 24, 2011", "message": "Oh - and your most recent company should now really be your most recent company"}, {"author_name": "china stone", "gravatar_hash": "eeba5894d4f07fa28a786aeef4f2c136", "author_url": "http://en.chinastone.com", "date": "Feb 24, 2011", "message": "i think this web is batter to answers ."}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": "http://itcookbook.net", "date": "Feb 24, 2011", "message": "It's not clear to me how careers.SO and careers.SF relate. Careers.SF looks like careers.SO with a different header (I find basically no sysadmins jobs available there, all look like dev jobs). And you say you're sending invites to people with rep ... are those invites going only to SO users? Are you pimping careers.* to employers who want operations staff, or primarily to employers who want devs?\n\nWhat's your recommendation for sysadmins? Should they be jumping headfirst into careers.SO right now, or are there some SF specific tweaks upcoming?\n\nThanks for any light you can shine on careers.* for non-devs!"}, {"author_name": "Devang", "gravatar_hash": "3f8941e4096ed69f3646caa76cf0c258", "author_url": "http://www.magnanimoussoftware.com", "date": "Feb 24, 2011", "message": "I think its a beautiful concept. Joel, you continue to influence the entrepreneur in me and continue to surprise me. Loved the SO and am really hoping this takes off too. Fucking tired of find ways to meet good developers :)"}, {"author_name": "Creative Nuts", "gravatar_hash": "c18abc94b940fbaecfa54f92c9f8e588", "author_url": "http://creativenuts.com", "date": "Feb 25, 2011", "message": "very well designed concept, looking forward for it."}, {"author_name": "Dean Hume", "gravatar_hash": "c620790ae5bf5b50c245b2e0ef95f338", "author_url": "http://www.deanhume.com", "date": "Feb 25, 2011", "message": "This is great, really like the new profiles section!"}, {"author_name": "Koen Willemse", "gravatar_hash": "9be2e9fd17102f2469001d5f27621839", "author_url": "http://koenwillemse.wordpress.com", "date": "Feb 25, 2011", "message": "Interesting indeed. However, a lot of people are using linkedin to keep up with their achievements / experience / etc. Will there be an integration? I wouldn't want to keep the information up to date on two sites"}, {"author_name": "Shay", "gravatar_hash": "cb6c7cfbf72da8243888d532bd61b1d4", "author_url": null, "date": "Feb 25, 2011", "message": "So just to clarify, people with no friends or isolated are only able to get an invite if they contribute heaps to SO? :(\n\nAside from personal interest, I know a lot of people who are extremely talented but don't run in these circles."}, {"author_name": "Jason S", "gravatar_hash": "dd5a7ef1476fb01998a215b1642dfd07", "author_url": null, "date": "Feb 25, 2011", "message": "(re: ad -- please don't use Comic Sans: http://www.bbc.co.uk/news/magazine-11582548 )"}, {"author_name": "Grzes", "gravatar_hash": "712248df6de12dd9b8ba73869a110f1f", "author_url": null, "date": "Feb 25, 2011", "message": "Is it possible to say that I actually want to relocate to a few chosen locations?"}, {"author_name": "Jason Punyon", "gravatar_hash": "c88159de92d664d35761fe5828cc5ccd", "author_url": "http://careers.stackoverflow.com", "date": "Feb 25, 2011", "message": "@Koen Willemse:  You can import your experience and education from linkedin using the button in the sidebar of the edit view of your CV."}, {"author_name": "Josh", "gravatar_hash": "3d820fb811e934e6f656a4d6aaa5bb0a", "author_url": "http://pulchritudinousprogramming.com/", "date": "Feb 25, 2011", "message": "Looks great! I'll keep an eye out for an invite ;)"}, {"author_name": "Jose Ayerdis", "gravatar_hash": "7052789b5f3895e4e4aaa640a4d3b904", "author_url": "http://blognecronet.blogspot.com", "date": "Feb 25, 2011", "message": "Great news as alway stackoverflow folks knows how to get thins done"}, {"author_name": "Jason", "gravatar_hash": "9904b127bff836c939152dcd300ea9ea", "author_url": null, "date": "Feb 25, 2011", "message": "I admit that I'm a bit irked on the matter that Careers is so geared to Programmers. I feel that is part of the reason that my hit/view rate is so low. Or it could be the \"lack of education\", you know, whatever.\n\nHaving said that, opening up this release to let me select data from whatever network I choose is much appreciated."}, {"author_name": "The Dawg", "gravatar_hash": "86e30ef227b852eeac588e0a8d84e062", "author_url": null, "date": "Feb 25, 2011", "message": "I find it fallacious that Joel keeps pushing this notion that the best way to get a new job at a new company is to turn your back on your current employer and spend your talents not on your work projects, but on increasing your reputation on SO.   \n\nAs a company owner I find it offensively self-serving of Joel to promote your SO reputation as a primary job qualification.  To me, an obscenely high SO rating is actually an adverse indicator of how much you care about your actual job."}, {"author_name": "Francois", "gravatar_hash": "0d36883567d2974a819917e2f514b996", "author_url": null, "date": "Feb 26, 2011", "message": "One thing about invitation only sites is that it tends to exclude people from other geographic areas. The \"degrees of separation\" principle just works against us.\n\nI am from South Africa and would probably never get an invitation. Most of my friends don't even know about SO. Too bad I don't have the luxury to read/post during work hours :-("}, {"author_name": "Mark", "gravatar_hash": "39596ac60e0ebc387d109d6dcfab8c51", "author_url": null, "date": "Feb 26, 2011", "message": "Nice idea but totally useless to me. Like others have already mentioned I'm a developer right out in the middle of nowhere and a contract programmer at that. I rarely need the services of StackOverflow so I have a total of three question asked and a score to match and I don't have time to hang around forums and get a reputation. As a contract developer I spend all my work hours working and my non-work hours non-working.\n\nSo what does Careers 2.0 offer me?\n\nZero\n\nAnd yet I'm a sufficiently talented developer that my contracts get extended and my customers are happy with the work I do for them.\n\nSo, nice idea but it's not going to be much use for a large section of the developer market.\n\nI do see it ending up a check-the-box thing. You know, on your CV you have \"Member of Careers 2.0\" along with MSVP.\n\nNo thanks!"}, {"author_name": "Chris", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.shrinkrays.net", "date": "Feb 27, 2011", "message": "Can I get some kind of refund as an original payee?"}, {"author_name": "Scott Barnes", "gravatar_hash": "ca85ba92b765e9d7aeba7e5660b7efee", "author_url": "http://www.riagenic.com", "date": "Feb 27, 2011", "message": "I'm confused, you have to be invited in order to look for a job from a peer? what if you're looking for an exit strategy but aren't exactly in the mood to advertise straight away (ie start loading in the data and quietly sneak in the back door?). \n\nThe way i see it, you're basically looking to create a Facebook for Careers.. (which don't get me wrong, i'm down for). \n\nThe downside I see is how do you filter out recruiters annoyances from the equation? specifically pretending to advertise for a role only to bring you in \"for a chat\" to get to \"know you\" (which btw is \"how hard is it type a keyword into a freakin database) :)\n\nIf this site can nerf Recruiters, i'd pay you 10% of my wage each week. As i figure you'd do a better job at it all :)"}, {"author_name": "idlejavaguy", "gravatar_hash": "95600b87e78140ca4b3a02e80e9f58dc", "author_url": "http://web.tiscali.it/claudiopeppe", "date": "Feb 28, 2011", "message": "before i pay 20$ , i should ask:\nis this site suitable for a java dev in europe(italy)?\nthank you"}, {"author_name": "Alison", "gravatar_hash": "3b5c0e139db4767c91454f6705d61717", "author_url": null, "date": "Mar 01, 2011", "message": "@Chris - we'll happily issue you a refund, please email us careers [at] stackoverflow [dot] com."}, {"author_name": "Sarfraz", "gravatar_hash": "3b4af6fbcb37d41021119636bc1a2e12", "author_url": "http://sarfraznawaz.wordpress.com/", "date": "Mar 01, 2011", "message": "Great Stuff ! Anybody invite me please...."}, {"author_name": "Mark Johnson", "gravatar_hash": "4fe464a2e1d9f198d8d83472910b0cb8", "author_url": "http://cool-technology.blogspot.com", "date": "Mar 02, 2011", "message": "This is a great idea indeed, but like many have voiced a concern over the fact that this is an invite-only I too feel that way. What if a friend or relative has gotten an invite to participate in the career SO.com but don't invite his family and/or friends because he or she has grudge against them. Invite only system can go both ways - can help many and at the same time limit who gets to participate for other reasons that is beyond anyone's control. Like this guy Francois from Africa commented."}, {"author_name": "Joel Spolsky", "gravatar_hash": "95e6837f350869bfb44e069a98885c58", "author_url": "http://stackoverflow.com", "date": "Mar 02, 2011", "message": "Don't forget that you can (and will) get a house invite if you participate in Stack Overflow enough to be recognized on the site. It's not just a matter of having friends and relatives."}, {"author_name": "Rajat", "gravatar_hash": "f2b49f2746a13c00223b13d6e485e0ca", "author_url": "http://webuserability.blogspot.com", "date": "Mar 03, 2011", "message": "Hey Joel,\nHow could I get invite for this?\nIf anyone here has one, please share it."}, {"author_name": "Riley Dutton", "gravatar_hash": "71b782df09c648418c3dac69e66ac78b", "author_url": "http://www.rileydutton.com/", "date": "Mar 03, 2011", "message": "I'm a little confused on the \"passive\" side of things. Do you still need to create a profile to be in the passive pool? Or are profiles just for people who are \"actively looking for a job\"? \n\nI guess I'm confused because you cite the reason for having the original signup fee was to filter out people who weren't actively looking for a job. Does this same rule still apply? Or is there somewhere once I create a profile that I can toggle if I am \"actively\" looking for a job?"}, {"author_name": "vorrtex", "gravatar_hash": "289a587fcdbac4b49c7aa6e6c7112dbb", "author_url": null, "date": "Mar 03, 2011", "message": "As far as I understand users can request an invitation if they don't have friends with invites. \nI don't know what kind of activity is required and what amount, but probably someone will succeed."}, {"author_name": "Md. Nazmul Hoque", "gravatar_hash": "d9ba6fe7f02f3409d7883f6fc6904625", "author_url": "http://nazmulweb.com/", "date": "Mar 04, 2011", "message": "How will I receive an invitation? Request for inviting me.\n\nThank you so much."}, {"author_name": "Philip Eki", "gravatar_hash": "026cdf753c92bca30613ff4ebadd439b", "author_url": null, "date": "Mar 05, 2011", "message": "You guys cracked me up with this comment."}, {"author_name": "Jonas", "gravatar_hash": "97fb194122dd1e60e672478600058e42", "author_url": null, "date": "Mar 07, 2011", "message": "Joel or anyone else in the know: What is \"recognized user of SO\" in terms of reputation? I don't spend too much time on the site, so i only have about 500 points."}, {"author_name": "Tonny Xu", "gravatar_hash": "ce4f2d1c999079a0d9f43e3300dc57c4", "author_url": "http://www.totodotnet.net", "date": "Mar 13, 2011", "message": "Awesome! \n\nJoel, I love your web site, and I love your vision on SO. I'm not so active in SO, but I will try much harder.\n\nBy the way, something more is need for me as a programmer working in Tokyo, not USA.\n\n1) Who is looking for telent programmer via SO's career 2.0?\n2) What is common flow for a US company hire a telent programmer outside US.\n\nI know your guys might be already working on these, I just mentioned these as my requirement.\n\nTonny"}, {"author_name": "Dan Miller", "gravatar_hash": "33d9d24c04838b3fe8853c3479b30dfa", "author_url": null, "date": "Mar 14, 2011", "message": "Will we be seeing something similar from serverfault?"}, {"author_name": "Ben Vail", "gravatar_hash": "52535473317348c7f741090611c23c94", "author_url": "http://www.vantagegaming.net/", "date": "Mar 20, 2011", "message": "This is awesome! I'd love to get on there, :)"}, {"author_name": "sergiol", "gravatar_hash": "363c7fb07b9e121acdb8c40115b94e34", "author_url": null, "date": "Mar 23, 2011", "message": "Hello.\n\n@Joel Spolsky: How much is enough to be recognized?"}, {"author_name": "Vladimir", "gravatar_hash": "09c3cde72a274be907be89ab3947cf2c", "author_url": null, "date": "Apr 02, 2011", "message": "Joel, I'm not in site, but I'd like to. It seems no of my friends have invite, so the only way to sign up is to be active on StackExchange sites.\n\nHowever, you are talking mostly about SO, but I'm not programmer, but a systems administrator (BTW, would this site be useful to me?), so I'm mostly contributing to ServerFault. You've told about 'other sites', but I'm wondering, is ServerFault in list of this 'other sites' and will I ever get an invite?\n\nThanks."}, {"author_name": "Ignas", "gravatar_hash": "e67fd55dd45941d13172ee762f69e95d", "author_url": "http://butenas.com", "date": "Apr 14, 2011", "message": "\"Invites only\"... I think I will never get that... Why? Because as mentioned here earlier - I don't have big list of contacts who wants to invite someone... And this is really strange. I prefer to pay these 19$ then waiting for the invitation... Wanna try this, but let's wait for the holy invitation! :)"}, {"author_name": "hubert chang", "gravatar_hash": "700164e2a4ef8953d569af15ce152a3b", "author_url": null, "date": "Apr 14, 2011", "message": "But... Joel, I am reading your book and you said that the best programmer don't go to monster.com .... you said now they will go to Career 2.0 or you only invite those very good guys to the site but you said in the book that good programmers would have lousy programming friends...  :-D just teasing you..."}, {"author_name": "Ryan Cheung", "gravatar_hash": "026ef8bd80d1c5d6d0edd3c5c51ed4b2", "author_url": "http://www.ingfan.com", "date": "Apr 20, 2011", "message": "Awesome! I may get one, since i came here for a while."}, {"author_name": "Matti Virkkunen", "gravatar_hash": "b03410a67ad6b9cf3fce7b0bf45084c8", "author_url": null, "date": "Apr 30, 2011", "message": "Oh great, now I get Comic Sans on my Stack Overflow too... thanks for the great banner ad, guys D:"}, {"author_name": "John Warlow", "gravatar_hash": "7e8dbe60707a57f8dbf7d197b361b48e", "author_url": "http://careers.stackoverflow.com/jlwarlow", "date": "May 19, 2011", "message": "Had the invite a while ago, just switched over to searching now that I'm contracting. Loving the look and feel of the site. I'm hoping it catches on in the UK!"}, {"author_name": "Valery Arkhangorodsky", "gravatar_hash": "4d7be634a1834e829bcf312fa98295e9", "author_url": null, "date": "May 29, 2011", "message": "Good effort, keep it up. The slider for a distance from employer will never work well on touchscreens so you may want to rethink. Maybe just a simple edit field."}, {"author_name": "Benjamin Kaufman", "gravatar_hash": "51aeb5f531f8becce531618f1dd5cd51", "author_url": null, "date": "Jun 24, 2011", "message": "I use stackoverflow.com a lot for help. I read this and had to make an account. Get active, maybe get an invite. :-)"}, {"author_name": "Dmitry", "gravatar_hash": "eb4f57b3756ebdb491f1e202ef7ad7e7", "author_url": null, "date": "Jun 29, 2011", "message": "Ok, the only question is - how to get invite. I guess there are no members in my country yet :)"}, {"author_name": "Subhadip Pal", "gravatar_hash": "390128fdef5356461e66cea9be399745", "author_url": null, "date": "Jun 30, 2011", "message": "Hey, \nCareers 2.0 is a nice concept. How can we get invites?\nI guess in India no 1 is a member :(\nAny invite will be just awesome :)"}, {"author_name": "Giancarlo Calderon", "gravatar_hash": "184cb14d817daff8a6cf49e816252e68", "author_url": null, "date": "Jul 21, 2011", "message": "It looks interesting, but I'm not sure if here in Peru are members that can invite me.\n\nBest wishes to Carreers 2.0 and stackoverflow.com :)"}, {"author_name": "Rob", "gravatar_hash": "3844a3539ade26140483f190831fb8e6", "author_url": null, "date": "Jul 25, 2011", "message": "[Website Horror] \nI'd like to point out as a casual user of SO I've found it difficult to answer questions before a slough of already sufficient ansers are given. I don't camp out all day on your site like some people do so I've found it difficult to build my \"SO persona\". Making the job finding section invite only or based on the quality and breadth of my answers eliminates me from the pool despite having a host of employable skills. I'd also point out, being able to beat someone else answering a question on your site will never equate to being hireable in any capacity. It just means they might be good at a software question gameshow."}, {"author_name": "Kurs jezika", "gravatar_hash": "970fa848b3c1a3a23bb5048520f48f95", "author_url": "http://emanera.rs/", "date": "Sep 05, 2011", "message": "excellent concept!"}, {"author_name": "動靜能量", "gravatar_hash": "389102eb1ab4abf162c1cd1f7b147d5a", "author_url": null, "date": "Sep 08, 2011", "message": "can anybody give me an invite?  I am \nhttp://stackoverflow.com/users/325418/"}, {"author_name": "amir", "gravatar_hash": "18b39a4e0a024fc5cc99681b1118958a", "author_url": null, "date": "Sep 10, 2011", "message": "cgi-bin fix in iran filtering progect"}, {"author_name": "Adarsh Srivastava", "gravatar_hash": "df8c5891d1feda1363d86dceddc322c5", "author_url": null, "date": "Sep 14, 2011", "message": "Sounds gud. But how can I get an invite?"}, {"author_name": "safwat k salm", "gravatar_hash": "3a38a2fa19c0eced27388a4425746592", "author_url": "http://profiles.google.com/safwateconomic", "date": "Sep 14, 2011", "message": "I am an egyptian and hope communication between us and of the peoples of the world in various field."}, {"author_name": "Anon", "gravatar_hash": "c510febb9bed68b5cc4a09f076701e0f", "author_url": "http://hola.com", "date": "Oct 01, 2011", "message": "how is this better thank LinkedIn?"}, {"author_name": "PEDRO", "gravatar_hash": "5cdb05034691ea82a00925b3709ee59e", "author_url": null, "date": "Oct 06, 2011", "message": "Ofrezco creaciones de cocina totalmente innovadores a empresarios y emprendedores, creados para ofrecer un mejor servicio, resolviendo siempre algun problema \nSu mercado esta garantizado por una creciente demanda, abarcando cada dia mas paises que precisan del producto y que mis creaciones ofrecen en multitud de bersiones \nCon mis prototipos demuestro en la practica lo que afirmo mas arriba \n( No informo ni me entrevisto con curiosos ) \ncarlossena@gmx.es"}, {"author_name": "Binish", "gravatar_hash": "23653162dfd09436919c7df87e324804", "author_url": null, "date": "Oct 21, 2011", "message": "I would really like to get an invite, can anyone point me the right place to get it. \n\nThanks in advance."}, {"author_name": "Evgeny", "gravatar_hash": "db77fe6f52095bd53cbd53a406e2c4b2", "author_url": "http://askbot.org", "date": "Oct 21, 2011", "message": "Hello, I would like to post a job ad on stackoverflow careers. How do I do it. What is the cost?\n\nThank you very much.\n\nEvgeny."}, {"author_name": "Ben Logan", "gravatar_hash": "3d0f4deddd2bd48f37707dfe4c842d33", "author_url": "http://www.yourjoblist.com", "date": "Oct 30, 2011", "message": "Careers 2.0 is an excellent tool. It is simple to use and the profile functionality is excellent. I think its lacking a way of handling the recruitment agent/agency part of the process. In certain industries/locations you can't really avoid the use of a middle-man. In the financial services industry, for example, few employers hire directly from the market. http://www.yourjoblist.com attempts to bridge this gap by providing an intuitive way of managing the agencies that you are in contact with."}, {"author_name": "Marcus", "gravatar_hash": "f7721a398118da97e482d8750c58c4df", "author_url": null, "date": "Nov 05, 2011", "message": "This seems quite interesting, but as a solitary programmer I don't know anyone handing out invites  :/\n\nHopefully they'll open it up a bit more in the future, I'll happily check back later  :)"}, {"author_name": "Mervin Johnsingh", "gravatar_hash": "b667b6b2ef737b76fa251200f9ab4bcc", "author_url": "http://www.mervinjohnsingh.com", "date": "Mar 15, 2012", "message": "While I love this initiative, any scope of it this being opened to other stack exchange sites like UX stack exchange ?"}, {"author_name": "sannidhi", "gravatar_hash": "317aae8110f8fe882f55ae8b34a9f4ed", "author_url": "http://groupndeal.in", "date": "May 09, 2012", "message": "Though, I had neither bought the service nor used it, yet. But, highly appreciate the gesture - \"But if you don’t think it was worth it, just email us for a full refund.\", as not many do this. And, I doubt if anybody has availed this offer."}, {"author_name": "Dmitry Pavlov", "gravatar_hash": "0fd1e076f431cf1928c2ee3fbbe8582d", "author_url": "http:www.dimaka.com", "date": "Jun 06, 2012", "message": "I'd like to participate. But nobody from my friends did not hear yet about this - so no chances to get an invite from them. Any alternative options here?"}, {"author_name": "Phu", "gravatar_hash": "ab56c8ce0b50a187460918ceb0ef2b13", "author_url": "http://testuyphu.appspot.com", "date": "Jun 23, 2012", "message": "Very nice to become one of the members here, \nAnybody can help me this issue in carrer 2.0\n\" select the Stack Exchange network sites\"\nI don't know how to fix this"}]}