{"response": [{"author_name": "Hertanto Lie", "gravatar_hash": "f0bcb0a2ad2268cc89a50ab8998d2bb2", "author_url": null, "date": "Feb 10, 2011", "message": "Do you need stackexchange tattoo somewhere visible on the body to get sponsored? ;)"}, {"author_name": "Horia Dragomir", "gravatar_hash": "eb2fd4fc5dd468c43ae4506769428c22", "author_url": "http://horia.me", "date": "Feb 10, 2011", "message": "You've done so much for the community up to now, there aren't enough words to describe it.\n\nThis, however, is like the Mother Theresa of all good things! Kudos!"}, {"author_name": "Brant", "gravatar_hash": "b81c8f121c27f7f39b28b94f4c5b4b31", "author_url": null, "date": "Feb 10, 2011", "message": "Does this mean we can get prominent members of Gaming.SE free trips to PAX? ;)"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Feb 10, 2011", "message": "I volunteer to go to Krispy Kreme on behalf of the donut.stackexchange   site"}, {"author_name": "UncleZeiv", "gravatar_hash": "bd24dab59beada36b501670cd01b8e2c", "author_url": "http://unclezeiv.kerid.org", "date": "Feb 10, 2011", "message": "Interesting. I thought the original idea was more about sending community members to kind-of evangelize about stackexchange at selected conferences, while here it seems that we are sending someone to attend them and report back? But surely several members of the community would already attend in the first place? I'm a bit confused, but it sounds like a nice thing anyway and I'm all for it."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 10, 2011", "message": "&gt; I thought the original idea was more about sending community members to kind-of evangelize about stackexchange at selected conferences, while here it seems that we are sending someone to attend them and report back?\n\nThat is also the goal, and why I said\n\n&gt;  And of course, we will supply you with plenty of swag to take with you and share with your fellow conference attendees at your discretion."}, {"author_name": "BenV", "gravatar_hash": "8a63b6177f426ebb253e62a320328c21", "author_url": "http://audio.stackexchange.com/users/64/benv", "date": "Feb 10, 2011", "message": "Kudos for taking action on something proposed a while ago.  I'm eager to see how it works out!"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Feb 11, 2011", "message": "Honestly, that is really nice its one thing to pay for the conference, but to pay for the hotel, pier diem rates, etc..that is going above and beyond.  You guys are impressing me each and everyday.\n\nMy vision is stackoverflow will be the next google."}, {"author_name": "Jorge Castro", "gravatar_hash": "d4f7d15de2abdec49cacaac7d14f00fc", "author_url": null, "date": "Feb 11, 2011", "message": "It'd be great if SOIS had it's own SE conference at some point down the road.\n\nA day long unconference so people from different SE's could swap techniques, how to grow the communities, etc. Sort of like a real-life-meta."}]}