{"response": [{"author_name": "JacobM", "gravatar_hash": "6704b031163fde4396bf1fdedecbfb44", "author_url": null, "date": "Mar 03, 2011", "message": "I did take the survey you mention (the one that says \".NET DEVELOPMENT\" at the top) and it was painfully obvious who the advertiser was.  The questions repeatedly mentioned one particular vendor and asked about my feelings about that vendor, and the vendor's name was in the URL.  If keeping the vendor a secret is important to you, well, you're not there yet."}, {"author_name": "Patrick", "gravatar_hash": "9ea90ddd1bef464cf65d29ae024f9a4f", "author_url": null, "date": "Mar 03, 2011", "message": "I just tried to take the survey, have not ever heard of the company (or it's products) that was in the one of the questions.  Couldn't complete survey.  Survey creator needs to learn to include answer option of 'N/A'."}, {"author_name": "Chris Phillips", "gravatar_hash": "7e8aafdd3be390048b126775e2847a52", "author_url": null, "date": "Mar 03, 2011", "message": "Seconded for JacobM's comment - the vendor name was directly present in 3 or 4 of the questions."}, {"author_name": "yhvh", "gravatar_hash": "6181a733c7c10b13387f123d604f31e6", "author_url": null, "date": "Mar 03, 2011", "message": "Some of the questions were unanswerable"}, {"author_name": "Korneel Bouman", "gravatar_hash": "2c3f79bed945b193634cf6794df49661", "author_url": "http://careers.stackoverflow.com", "date": "Mar 03, 2011", "message": "@JacobM @Chris: Yup, you're right. We noticed that too and are working with them to make this less obvious (the survey is administered by the vendor).\n\n@Patrick @yhvh: Many thanks for the feedback, we will pass that on."}, {"author_name": "Daniel", "gravatar_hash": "d9ea16ab86518400eb2b695a76a5789a", "author_url": null, "date": "Mar 03, 2011", "message": "I didn't like how I had to \"choose at least one item\" from a list of totally praising characteristics. What if their products sucked?"}, {"author_name": "Dave Van den Eynde", "gravatar_hash": "1c3de6158085f955497b46705ffbdebc", "author_url": null, "date": "Mar 03, 2011", "message": "In addition to all of the above, I didn't like that I was required to enter a valid e-mail address, even though I wasn't interested in the raffle. I was merely curious to who the vendor was. \n\nNow that I know, my life feels just as empty as before."}, {"author_name": "John Gietzen", "gravatar_hash": "5dc3d1e5f2b7676837fdd1fb34b1db15", "author_url": "http://stackoverflow.com/users/57986/john-gietzen", "date": "Mar 03, 2011", "message": "They need to add \"Hanselminutes and Dot Net Rocks podcasts\" to one of the questions..."}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": "http://www.compiler-design.com", "date": "Mar 03, 2011", "message": "Tell the vendor I've never heard of them. But they also had a question that asked me to list three companies that provide something I've never used. What am I supposed to do?"}, {"author_name": "Ben", "gravatar_hash": "af0800495bf764ba4362a5cf79282bd2", "author_url": null, "date": "Mar 03, 2011", "message": "The vendor was no surprise, their name was the dns hostname of the survey provider...\n\nYou captcha might be fooling OCR, but for me its hard to read.\n\nhttp://tinypic.com/r/qspdzr/7"}, {"author_name": "Benjol", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Mar 03, 2011", "message": "The style of the ad really reeks of tacky, sorry :("}, {"author_name": "cHao", "gravatar_hash": "e92a9af9e53cc8e5af575c4b18b34c21", "author_url": null, "date": "Mar 03, 2011", "message": "@Daniel: seconded.  I was not impressed with the products of theirs that i used.  There needs to be a N/A option, or a negative for each of the positives."}, {"author_name": "Weeble", "gravatar_hash": "3ac5db3768c09788ed9fe03c5f4ff171", "author_url": null, "date": "Mar 04, 2011", "message": "I tried to answer the survey, but there are too many questions with no correct answer. I don't know three answers to the question requiring three answers. I haven't used the product that several of the questions require me to evaluate, and I have no perceptions of the company in question other than that they have a lot of adverts in podcasts and have something to do with a \"uuuunited team\". I seriously doubt that this questionnaire can collect useful data and it lowers my estimation of both the company in question and of Stack Overflow. Sorry!"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Mar 04, 2011", "message": "One minor thing is that there are several questions for which you can enter only three choices, but it says so only when you try to submit it - making one think \"Duh! Why didn't you tell me so?\""}, {"author_name": "Korneel Bouman", "gravatar_hash": "2c3f79bed945b193634cf6794df49661", "author_url": "http://careers.stackoverflow.com", "date": "Mar 04, 2011", "message": "@all - thanks so much for all your feedback, we're relaying it all to the vendor."}, {"author_name": "raven", "gravatar_hash": "1426f2e3692f98db654b81c87bc0dc91", "author_url": null, "date": "Mar 06, 2011", "message": "Don't ever use the string \"kthxbai\" ever again.  If you do, we'll have to dust off and nuke the site from orbit.  Just to be sure."}, {"author_name": "Korneel Bouman", "gravatar_hash": "2c3f79bed945b193634cf6794df49661", "author_url": "http://careers.stackoverflow.com", "date": "Mar 14, 2011", "message": "Just a quick follow up: the vendor has updated the survey based on the comments above. Thanks again for all your feedback."}, {"author_name": "akshay", "gravatar_hash": "4f10d37f65d9a1e58e11de0da25aaeea", "author_url": null, "date": "Mar 16, 2011", "message": "Hope I get 200 $ !!"}, {"author_name": "John", "gravatar_hash": "7e8dbe60707a57f8dbf7d197b361b48e", "author_url": null, "date": "Mar 16, 2011", "message": "I bet this is for the US only, it usually is :("}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://about.me/cky", "date": "Mar 17, 2011", "message": "I just saw the ad and answered the survey. Since I'm not a .NET developer, I've never heard of said company and don't know them from a bar of soap (though I probably know a bar of soap better!). Just adding to a handful of comments here that more or less expressed the same sentiment. :-)"}, {"author_name": "Nivas", "gravatar_hash": "eff3175735075d38c6e8f7542c776914", "author_url": null, "date": "Mar 18, 2011", "message": "The intention is good: anonymous feedback from a focused group will (probably) be of great use for companies to customize/fine tune their products. And many SO users trust this site (and StackExchange Inc) that we don't mind participating.\n\nThat said, the first impression spoiled it all (at least for me). The banner ad (the style, colors, background) made me exactly remember what this survey is (supposedly) exactly not: spam.\nIf one passes that temptation (of ignoring this ad, if not AdBlocking) the survey itself was (IMO) a way the company can self-praise themselves\nQuestions like \nWhat are we (required)\n()Cool\n()Super cool\n()Ultra Cool\nIs not going to help the company, nor StackOverflow's reputation.\nI am sorry, but this is not the way to go. \nI place a humble request to the ads team to have a look at the survey before posting."}, {"author_name": "Gordon", "gravatar_hash": "2d7166a220dd552237b82909c0d79c88", "author_url": null, "date": "Mar 23, 2011", "message": "I had to check 3 good things about them when in reality I would have said maybe one good thing and a hundred bad things. It needs to allow you to not have to praise the suite to be able to complete the survey."}]}