{"response": [{"author_name": "Ned Batchelder", "gravatar_hash": "75e9a11371cbe1566607180863efdf4c", "author_url": "http://nedbatchelder.com", "date": "Feb 18, 2011", "message": "Thanks for the shout-out, Jeff!  I wouldn't have thought my kick-the-habit script would have been featured..."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": "https://twitter.com/teh_klev", "date": "Feb 20, 2011", "message": "Nice, but I feel that this will be a cop-out to fixing certain broken UI issues such as the Enter-Submits-Comment UI #fail.\n\nI don't really want to be filling up Chrome with bodges and fixes."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Feb 20, 2011", "message": "@Kev, Why do you find that a bug?\nI think that hitting the enter key is the correct way to 'submit' my comment.  What would you rather do, have end users use the mouse ?"}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": "https://twitter.com/teh_klev", "date": "Feb 22, 2011", "message": "@JonH - comment is not chat where you'd expect that to happen. Also I do realise that new lines are thrown away in a comment.\n\nHowever the comment box can take a substantial amount of text. I like to \"embiggen\" the comment box size (in Chrome) so I can re-order and arrange my thoughts using new lines before submitting. \n\nThe comment box is also a text area and therefore shouldn't submit on hitting return. It was an ill thought out change. They seem to have time to fix/add all sorts of other useless gimmicks on the site recently, why can't they give users a preference setting for this?\n\nFor example in this blog I can hit return and it doesn't submit whilst adding a \"comment\", however Jeff feels he needs to break that convention on the SE/SO sites. \n\nAlso why the hell should I install some grease monkey script to fix this? Or compose my comment in notepad. The site UI shouldn't have these UX roadhumps.\n\nThe comment thing was clearly enough of an issue over on meta.math.se to cause this ruckus:\n\nhttp://meta.math.stackexchange.com/questions/1289/threatening-emails-from-jeff-atwood\n\nWhilst the OP pushed his luck a bit, the comment behaviour is clearly an issue.\n\nFinally, you and I disagree, so it's an example of where user preferences should be considered for stuff like this."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Feb 22, 2011", "message": "Kev - It's not the end of the world :-) so don't get upset about something like this.  I think you are using the comment field more like the actual form to submit an answer.  It's not there for you to create nice lists whilst thinking what else should be on there.  It's a quick mechanism to insert a comment.  If you really want to think out what you write fire up notepad, jot it down then copy and paste."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": "https://twitter.com/teh_klev", "date": "Feb 22, 2011", "message": "@jonh - do you know how condescending it sounds telling people that it's \"not the end of the world so don't get upset\". Seriously. It's a UX \"annoyance\", I've not reversed my car over the cat.\n\nAnyway...I'll agree to disagree."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Feb 22, 2011", "message": "@Kev - So skip the end of the world, and read the rest of my post.  Don't use the comments box like a TinyMCE editor, use it for quick comments."}, {"author_name": "buy scripts", "gravatar_hash": "68b72c5b862f54f6e5f8fcc69fbe28bb", "author_url": "http://www.joolar.com", "date": "May 04, 2011", "message": "This article is cool! \nThanks! ;)"}, {"author_name": "Nikita Katterjohn", "gravatar_hash": "8c5f9ac1d4f6a297f67f708ae9817cbe", "author_url": null, "date": "Oct 07, 2011", "message": "Steve Jobs is such an inspiration"}]}