{"response": [{"author_name": "Brooks Moses", "gravatar_hash": "361baa67583dc1033f2f3b3c97761c2c", "author_url": null, "date": "Feb 05, 2011", "message": "This sounds great!  I like the addition of this as another way for new users to bootstrap some initial reputation by usefully contributing to the site.\n\nI would suggest an addendum to this: Users should be able to approve edits on their own questions and answers."}, {"author_name": "Brooks Moses", "gravatar_hash": "361baa67583dc1033f2f3b3c97761c2c", "author_url": null, "date": "Feb 05, 2011", "message": "Sorry -- I should have read the directions about reading the meta post first.  I see that you've already implemented my addendum, before I suggested it!"}, {"author_name": "John", "gravatar_hash": "dbc2a237d18cead1a1a568bae71bc71f", "author_url": null, "date": "Feb 05, 2011", "message": "Well that's a good idea, recently someone was blabbing on reddit that SO is a closed community in that you can't actually begin to gain reputation since you can't answer or post insightful questions and obtain maximum impression for your expertise and contribution.\n\nI guess this can fix that, you can bootstrap faster"}, {"author_name": "Anonymous", "gravatar_hash": "8153304eaa161ffbe49d77658efe9925", "author_url": null, "date": "Feb 05, 2011", "message": "FWIW, I tried this out and it's really nice except for two issues:\n\n1. Not being able to make small changes is bogus. I went to fix a typo and it wouldn't let me. There's value here. If you took the edit, maybe it would draw me into the community (and the social computing research backs this up). But it didn't let, me leading to my second beef:\n\n2. The messages one gets are bitchy. I don't recall the details, but the clear implication was that my edit had no value - which was wrong. I was fixing a typo that made the OP look stupid. The messages felt condescending, and doubly so because it was a nonintelligent computer doing it.\n\nOther than that, it's a great feature. thanks!"}, {"author_name": "davidThomas", "gravatar_hash": "fa1a6c145457af7ee58efb9409d3b899", "author_url": null, "date": "Feb 05, 2011", "message": "One weirdness that's tripped me up a couple of times is that I'm prompted to review edits to various tag-wikis for which I, myself, am not sufficiently-experienced to approve edits.\n\nI don't know if this is solvable (or even if it's any kind of an issue) but it's a little bit odd being presented with an edit queue to review and being unable to review them constructively..."}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": null, "date": "Feb 05, 2011", "message": "David\n\nI hear you on the tag wiki weirdness. I would like to drop the complex tag wiki requirements and just allow anyone with access to the queue to vote on them"}, {"author_name": "Brian", "gravatar_hash": "f05e3b9aa180fbacdff713e300a7c5f2", "author_url": null, "date": "Feb 05, 2011", "message": "I was worried when I read the title but after reading the details I think this is going to do really well. And engage otherwise passive users."}, {"author_name": "Javin @ Tibco RV Tutorial", "gravatar_hash": "cf478e1835a5980a8b05055cd9a5f9f9", "author_url": "http://javarevisited.blogspot.com", "date": "Feb 05, 2011", "message": "This looks to me a great initiative and encourage otherwise not so active users :)"}, {"author_name": "VoiceOfUnreason", "gravatar_hash": "ea91774321962f70f19362f43568cda9", "author_url": null, "date": "Feb 06, 2011", "message": "\"Not being able to make small changes is bogus. I went to fix a typo and it wouldn’t let me. There’s value here.\"\n\nThat was my first thought too, so I'm glad somebody tried it.  It seems to me that spello/typo errors are precisely the sort of change that I'd expect from drive by users.\n\nIt might be interesting to track the moderation of short edits separately from the long edits.  If a sufficiently large number of small edits are being approved, then maybe it makes sense to skip the moderation step in those cases."}, {"author_name": "Patrick W.", "gravatar_hash": "b17d414f7da2e9bb28bc8e0681af2363", "author_url": null, "date": "Feb 06, 2011", "message": "&gt; Furthermore, you can earn up to +1000 reputation for submitting valid edits.\n\nHow are unregistered users (which now have the ability to edit) able to get that reputation?\n\nAlso weren't users with 2000+ (1000 on other pages) reputation always able to edit questions and answers directly? What actual benefit do those users have then, especially when they cannot put edits in the queue but edit directly (and can't gain that edit reputation that way)?"}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Feb 06, 2011", "message": "@Patrick, \n\nClearly anonymous users do not gain rep, we have no intention of tracking the rep they would have gained if they created an account. \n\nUsers with 2000+ rep are unaffected, they can still edit to their hearts content. Yes, they missed out on the total possible 1000 points of bootstrap reputation, however they gain a better more organised and easier to understand site, which is worth more than points."}, {"author_name": "Patrick W.", "gravatar_hash": "b17d414f7da2e9bb28bc8e0681af2363", "author_url": null, "date": "Feb 06, 2011", "message": "@Sam: Okay, thanks for the clarifications :)"}, {"author_name": "matt wilkie", "gravatar_hash": "875b592087c435ab4a8d533cda9b69c1", "author_url": "http://www.maphew.com", "date": "Feb 07, 2011", "message": "“Not being able to make small changes is bogus. I went to fix a typo and it wouldn’t let me. There’s value here.”  Yup, in agreement here.\n\nHowever I also completely understand and agree with the need to keep the noise level down so that anonymous edits actually do get reviewed. Perhaps an adjacent stream could be created for minor edits(?) No rep points for them and a different review panel. Just a thought."}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Feb 07, 2011", "message": "Now how about comments too?  They just end up writing answers anyways, and when someone mentions \"This should really be a comment,\" they reply \"Sorry, I can't comment yet,\" everyone feels their pain, and we let the answer stay."}, {"author_name": "Joe Thomas", "gravatar_hash": "c6c2632764c19cae567c53838a618a3d", "author_url": null, "date": "Feb 07, 2011", "message": "This is great!\n\nBtw, with the advent of this feature, I think you should open a new Stack Exchange site with anonymous editing as well!"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Feb 07, 2011", "message": "BlueRaja,\n\nYou can flag those for moderator attention.  We can change an answer into a comment now, and I've been using the heck out of that new feature."}, {"author_name": "jorge", "gravatar_hash": "6d444fe8681fcf501faf3844a65862dc", "author_url": "http://hotnamelist.com", "date": "Feb 07, 2011", "message": "Bastards! :)\n\nThe first time I get edit priveledges (2000pts), StackOverflow changes the rules for \"counting points\", and my account went down to 1000.\n\nThen, many months later, when I finally got up to 2000 pts again (a few weeks ago), you give the \"edit right\" to everyone.\n\nIf I didn't know any better, I'd think you were trying to kick me in the teeth."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 07, 2011", "message": "Jorge -- your edits don't have to be approved, and you can make edits of one character in length. AND you can vote to accept or reject edits.\n\nSo it's still worth obtaining edit privileges!"}, {"author_name": "vorrtex", "gravatar_hash": "289a587fcdbac4b49c7aa6e6c7112dbb", "author_url": null, "date": "Feb 08, 2011", "message": "Where can I find an open-source analog for highlighting additions and deletions?"}, {"author_name": "Otaku", "gravatar_hash": "a7702f74f3814b23e7aa6040a211f487", "author_url": null, "date": "Feb 11, 2011", "message": "Can you add a textbox for why we may reject an edit. I'm finding that many, many edits are:\na) not really editing, but changing just one minor thing, like capitalization. in many cases, this edit could have done with more work and forethought towards producing a decent edit instead of just notch for a new badge.\nb) some...many...at least one edit was approved, but the edit was clearly not correct. (on http://stackoverflow.com/questions/4967339/vsto-using-c-outlook-mailitemsemail-send-is-taking-long-time-to-send, the edit was to change Outlook_.MailItem to Outlook_MailItem. Neither the original or the edit are correct. It is Outlook.MailItem)."}, {"author_name": "scunliffe", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Feb 17, 2011", "message": "I like this feature so far, but I've hit a scenario that I'm not sure on the best way to handle it.\n\nI have a review for an edit on JS Libraries.  Some of the additions/edits are correct/helpful, some are too personal/emotional (e.g. not objective).  It would be nice to be able to either accept/reject individual edits, or have the ability to send comments to the original editor (e.g. sort of like code review) indicating what could/should be altered to make this better.\n\nOn a less severe issue, the edit included 90% better content, but added 10% new typos. I opened the original in a separate tab, accepted the edits, then added my own to the revised version in the other tab.  Not a biggie, but highlights the \\trick\\ with an accept/reject all option."}, {"author_name": "Jessy", "gravatar_hash": "405edc1aafeea5253d1d88bc394c1314", "author_url": "http://www.thesleepninja.com/", "date": "Feb 22, 2011", "message": "I think addition of typos have made much good options. This is something relevant."}, {"author_name": "Bilbun", "gravatar_hash": "0e42a40edf02d3147352048ac35a6ee8", "author_url": "http://www.sextoysdiva.com/", "date": "Feb 24, 2011", "message": "But how far the relevance will remain is the quetion?"}, {"author_name": "Otaku", "gravatar_hash": "a7702f74f3814b23e7aa6040a211f487", "author_url": null, "date": "Mar 08, 2011", "message": "Is there anyway you can add the tags of edited post for viewing when we go to edit? That would be helpful in doing a quick page scan on which edits we are qualified to approve/reject."}, {"author_name": "Antony", "gravatar_hash": "a0cd4d25c7996d6a587a43dbcaa7a8e9", "author_url": null, "date": "Jan 17, 2013", "message": "Where did you get the 6 character magic number.\n\nA change from `break` to `continue` is a 3 character differential change, so as a change from if to elif; but these changes have huge impact in the control flow. Somehow this rule seems frivolous."}]}