{"response": [{"author_name": "James", "gravatar_hash": "69d14e2046512d295376b96cb7b1cea5", "author_url": null, "date": "Feb 13, 2014", "message": "Matz of Ruby fame, Mark Bao three words/avecora, Dmitry Skylarov Elcomsoft controversy\n\n\nI just wanted to step up to the \"no googling\" challenge."}, {"author_name": "Tilo Dickopp", "gravatar_hash": "9d8c9b1e28e202f4aea71129683fa681", "author_url": null, "date": "Feb 13, 2014", "message": "Thank you for doing this! \n\nNow and then I find answers in a German language programming forum that I couldn't find on Stack Overflow. Even though English is much easier to learn for native speakers of German, it always takes longer to write in a foreign language, and many developers are, by profession, lazy enough to only take that extra effort if they feel they wouldn't get an answer in their native language.\n\nIt would be great if users of the new Portuguese Stack Overflow would feel they are being part of the *same* big community, for example by using the same URL and having a language filter (e.g. like this: https://www.coursera.org/courses?orderby=upcoming). There is even a chance that friendly community members would start translating questions."}, {"author_name": "Julien", "gravatar_hash": "b00c1dc21634b6d989dc12417f585c91", "author_url": "http://julienschmidt.com", "date": "Feb 13, 2014", "message": "For those wondering what the actual name of DHH is: http://en.wikipedia.org/wiki/David_Heinemeier_Hansson"}, {"author_name": "jmsfg", "gravatar_hash": "4dfc8f56817006ef21327d5ff19ce04f", "author_url": "http://seniorgeek.com.ar", "date": "Feb 13, 2014", "message": "I can't wait for the Spanish version (assuming it's coming)\n\nI have the same use case -- a lot of colleagues that don't participate because of the language barrier."}, {"author_name": "jean", "gravatar_hash": "228a9b988cb0176a87642d542b546af7", "author_url": null, "date": "Feb 13, 2014", "message": "As a native portuguese speaker I see the benefits, not for my self but for the community.\n\nOld hands like me learned the hard way how to post, ask and communicate (at least enough to get the job done).\nNew programmers are likely to seek advice in their native language.\n\nHow many times do you found a bad written question because OP don't honed enough of english skills yet?\nI can tell how much awkward is getting \"Don't understand your question, please use plain english\" as a answer.\n\nI ill use both sites. And for sure one day I'll get a pretty nice answer like it \"I found the answer you seek at SO Mandarin, ill translate here...\""}, {"author_name": "Some dude", "gravatar_hash": "3568876d79f0551ec5d77652eb8ae9ef", "author_url": null, "date": "Feb 13, 2014", "message": "I don't know.  The idea of fragmenting the community doesn't sound appealing to me.  Of course, I's pretty good english.  \n\nSome bright lad suggested a feature over on Meta.SO that would be an alternative to this, but without splitting the community.  It's about a \"translation help queue\" or some such.  Bright lad, he is.  It's scoring pretty evenly, with half liking and half disagreeing.  But no matter.\n\nSomething similar happened to him before--he made a feature request which also saw this half like/half dislike vote pattern that was eventually adopted as the [on hold] system.  Bright lad."}, {"author_name": "David", "gravatar_hash": "f022c7984d0968c0ae8431541209b0b0", "author_url": null, "date": "Feb 13, 2014", "message": "A really bad idea. I am not trolling, I can't explain (it would take me too long). My mother tongue is Spanish, yet I think this that you are trying to do is a very bad idea. I might gather my thoughts later and come back to explain why."}, {"author_name": "Roman Pushkin", "gravatar_hash": "caf957d402b655dd0893530c2ba98c19", "author_url": "http://romanpushkin.blogspot.com/", "date": "Feb 13, 2014", "message": "&gt; Without Googling, name any famous developer from Japan. Or China. Or Russia.\n\nIgor Sysoev, author of nginx. Or"}, {"author_name": "Roman Pushkin", "gravatar_hash": "caf957d402b655dd0893530c2ba98c19", "author_url": "http://romanpushkin.blogspot.com/", "date": "Feb 13, 2014", "message": "Dmitry Sklyarov as mentioned above. Egor Homakov, famous security expert and young talent :)"}, {"author_name": "Carlos Alexandro Becker", "gravatar_hash": "7ef3cd04888c6d17f34d43e29ec3d46f", "author_url": "http://carlosbecker.com", "date": "Feb 13, 2014", "message": "The theory is great, the practice will be very different.\n\nI'm from Brazil, my english isn't that good, but I can easily find and express myself in a way that most people will understand.\n\nNow, the \"global\" StackOverflow is great, even if it have a lot of questions that aren't really questions but still there for some reason. I just take a look at StackOverflow BR and what I found is the same that I found in guj.com.br (brazilian java forum): lot's of people wanting help to do their college stuff. They don't even try. They don't search. They just want it all in their laps, done, working, no effort needed.\n\nHaving this in mind, even if I'm from Brazil, I will still using the global SO. Sorry about that."}, {"author_name": "Travis Briggs", "gravatar_hash": "1b164a615a3f17a7c1c9f9f965c5026a", "author_url": "http://boxofmonocles.com", "date": "Feb 13, 2014", "message": "Yes my first non-English programmer was also Matz, the creator of Ruby. Such a no-brainer!"}, {"author_name": "Varun Agrawal", "gravatar_hash": "830319b21a7b9ade6759f5142a2c8e99", "author_url": null, "date": "Feb 13, 2014", "message": "I am also against this idea. English is my second language.\n\nPeople code in *English*. So, they know atleast basic english required here. Now, there will be a copy of each question in different languages, which I don't think is a good idea.\n\nIt also helped my improve my english, because I have to type in english even broken and then somebody fix grammatical errors.\n\nAnd finally if all the content is available in one most popular language, it will cover a wider audience, than the multi language sites. It will demote a single language over www."}, {"author_name": "Brandon Boone", "gravatar_hash": "f1905edf0faa56e16133ea3289784097", "author_url": null, "date": "Feb 13, 2014", "message": "Why not leverage something along the lines of Google Translate, except more automatic. Post &amp; read content in any language you want without ever knowing the difference. I know it's not perfect, but a quick perusal of http://pt.stackoverflow.com/ using Chrome's built in translator (Portuguese to English) allowed me to read and understand the few questions I looked at."}, {"author_name": "RMS", "gravatar_hash": "ed5214d4b49154ba0dc397a28ee90eb7", "author_url": "http://stallman.org", "date": "Feb 13, 2014", "message": "\"That probably limits the list of potential candidates to Mandarin, Japanese, Portuguese, Russian, Turkish, and Spanish.\"\n\nI would just like to let you know that Mandarin is a spoken language, and that speakers of Mandarin and all other Chinese languages overwhelmingly read and write the same written Chinese language, using one of two sets of characters. Since your website is predominantly focused on text-based interactions, I assume that you would be interested in localizing to the written Chinese language."}, {"author_name": "Maurício Gomes", "gravatar_hash": "3ebeae1b7e621b1b15c9ae477933c726", "author_url": "http://coderofworlds.com", "date": "Feb 13, 2014", "message": "Programmers that are not native english speakers or don't speak english at all.\n\nRoberto ... something (creator of Lua, I never figure how to write his surname).\nThe guy that made Tetris (Russian, forgot his name too)\nPixel (author of Cave Story, he refuses to learn english actually)\nlots of other japanese game developers (for example La Mulana team hired someone to make a kickstarter in english for them, they don't know any english at all).\nSeveral people in the once Conectiva team (that created Conectiva Linux, later merged into Mandriva, that team created the first GUI installer for Linux, Window Maker, and lots of other cool stuff, and most of them only know portuguese and used to hang only in portuguese speaking forums).\nMiguel de Icaza (GNOME and Mono creator)\nToru Iwatani (Pac-Man author)\nHåkon Wium Lie (norwegian dude co-author of CSS)\nOnel de Guzman (filipino that made ILOVEYOU virus)\nAlexander Stepanov (creator of STL, and STL I mean STL, not c++ standard library)\nMany demosceners (several demosceners know only a minimal english to read, but only write or speak nordic or germanic languages)\nPei-Yuan Wei (creator of VIOLA)\nHaruyasu Yoshizaki (creator of LHA)\n\nThere are many, many, many other people, many countries have very closed and inward turned communities that still spit out stuff the outside world end appreciating.\n\nOr sometimes things that are shared between countries but NOT with the US, I particularly knew a machine learning project where all people involved where in Brazil or France, and almost noone knew english."}, {"author_name": "Guilherme Santos", "gravatar_hash": "9432a17db943fc494e13e996ffe4941e", "author_url": null, "date": "Feb 13, 2014", "message": "Hello there. I'm participating in pt.stackoverflow.com, and I'm really happy with this. Why?\n\nI'm Brazilian, and as you could realize, I can comunicate in English, but when I write in english I still make a lot of mistakes.\n\nIt's true that many good developers that I know are english proficient, but I also know a lot of good developers that can't improve their programming skills because of the language barrier.\n\nHere in Brazil, I work with other 15 developers, and from these 15 developers, only 4 are english proficient. All the 15 learned a little of english in school or course, but was not sufficient).\nI also see people using Google Translator, to try to solve things, but it is still very confusing.\n\nAs a result, these 4 english proficient are not better developers than the other, but they are faster to solve problems with new tecnologies.\n\nHere in Brazil, we have good sites to learn, Visual Basic, Asp.NET, Java or PHP but we don't have good sites to learn ASP.NET MVC, jQuery or Knockout.js, for example. Everything that is new have less articles and sites talking about it in portuguese. \nSo if we have a site like stackoverflow (that helps me a lot), in portuguese the other 11 developers will also increase they knowledge and they will be faster to solve problems, because they can ask, answer or discuss in their native language.\n\nSo it's a great idea!"}, {"author_name": "Mason Wheeler", "gravatar_hash": "50facfccdffe2e9cabaa589205959d30", "author_url": "http://tech.turbu-rpg.com", "date": "Feb 13, 2014", "message": "<blockquote>    When I turned 11 we had to leave East Germany overnight because of the political orientation of my father. Now I was going to school in West Germany, which was American-occupied at that time. There in school all children were required to learn English and not Russian. To learn Russian had been difficult, but English was impossible for me. I thought my mouth was not made for speaking English! My teachers struggled. My parents suffered. And I knew English was definitely not my language.\n\n    But then something changed in my young life. Almost daily I rode my bicycle to the airport and watched airplanes take off and land. I read, studied, and learned everything I could find about aviation. It was my greatest desire to become a pilot. I could already picture myself in the cockpit of an airliner or in a military fighter plane. I felt deep in my heart this was my thing!\n\n    Then I learned that to become a pilot I needed to speak English. Overnight, to the total surprise of everybody, it appeared as if my mouth had changed. I was able to learn English. It still took a lot of work, persistence, and patience, but I was able to learn English!\n\n    Why? Because of … a strong motive!</blockquote>\n\n– Dieter Uchtdorf, former German air force pilot, later a commercial pilot and eventually Senior Vice President of Flight Operations with Lufthansa"}, {"author_name": "Luc", "gravatar_hash": "c963f8b5c19452b692aa09777e94b299", "author_url": null, "date": "Feb 13, 2014", "message": "&gt; Without Googling, name any famous developer from Japan.\n\nSatoshi Nakamoko! Yay I got one.\n\nNo but really, I'd even rather you guys start doing free English courses than free foreign websites. And mind you, I'm not natively English, either. I had a period where I thought my English was lacking, but that was mostly before I started writing code (which was around 14), but the internet greatly helped in that, much more than school or television or anything else did.\n\nI just don't think languages are useful in this interconnected world. Perhaps China, Russia and other superpowers disagree with me, but to me it would seem English pretty much won. I speak Dutch natively and English fluently, but hardly a word German, let alone Russian or Chinese. To me English is the language we should all speak and Dutch is only something that might be fun as a dialect.\n\nSo do the world a favor and teach these people English instead.\n\nPS. The form reloaded with \"&gt;\" in place of my \"&gt;\" and a refreshed captcha. My guess is either the session expired or I got the captcha wrong (although I'd say in the case of a human this means the second C in CAPTCHA was wrong), but nothing indicates that and the \"&gt;\" shouldn't have been there."}, {"author_name": "Joaquin Bravo Contreras", "gravatar_hash": "80786226657f731aaca27e2171d39505", "author_url": "http://joaquin.axai.mx", "date": "Feb 13, 2014", "message": "Miguel de Icaza. Mexican programmer creator of Gnome, Mono and mc."}, {"author_name": "Alvaro Carril", "gravatar_hash": "136ee72c5e5c3b04c6b5e143d1b34bcd", "author_url": null, "date": "Feb 13, 2014", "message": "I think you make a compelling point on including people who felt language barriers left them outside the community, but there's now people who will stop making the effort of speaking in another language (as I am doing right now). So it's kind of a win-loose situation."}, {"author_name": "Roman Pushkin", "gravatar_hash": "caf957d402b655dd0893530c2ba98c19", "author_url": "http://romanpushkin.blogspot.com/", "date": "Feb 13, 2014", "message": "&gt; The guy that made Tetris (Russian, forgot his name too)\n\nAlexey Pazhitnov"}, {"author_name": "JiveManNoWantNoHelp", "gravatar_hash": "82e2b0864726211d800c5da6487981a6", "author_url": null, "date": "Feb 13, 2014", "message": "I think we can all agree that Jive would be a great addition to the multilingual SO community...  golly!"}, {"author_name": "Matthias Bauch", "gravatar_hash": "f54f4232435967ab15641871d4ca0d49", "author_url": null, "date": "Feb 13, 2014", "message": "I couldn't care less, I don't have to use those sites. And I doubt that any question on the global site will stay without an answer because the user with the knowledge is only active on the pt, fr, cn, whatevs site. \n\nIt'll be interesting to see how pt.so develops. If I would have to make a guess I would say it will mostly attract beginner questions. Once a question gets more complicated askers will go to the global site because there is a higher chance to get an answer. \nWhich, if you ask me, would actually be a good thing for the global site."}, {"author_name": "Juliano Goncalves", "gravatar_hash": "70fc1752ed75fa968107bbaa500cfe8a", "author_url": null, "date": "Feb 13, 2014", "message": "I also would like to voice my 'against' opinion here, even though I'm Brazilian and have a bit of difficulty to word things sometimes.\n\nI think the fragmentation issue is too detrimental to the whole site for this to be justifiable.\n\nThe translation approach sounds much better, though I can see it being hard to gather enough community help to do it if not properly automated.\n\nPerhaps the first thing I'd try is to translate popular questions into these mainstream languages to test waters. Getting into automatic translation would be ideal, but would need manual intervention in a lot of cases."}, {"author_name": "Roman Pushkin", "gravatar_hash": "caf957d402b655dd0893530c2ba98c19", "author_url": "http://romanpushkin.blogspot.com/", "date": "Feb 13, 2014", "message": "This post will not be complete without mentioning Claude Piron\n\nhttp://dotsub.com/view/54b18453-7176-44ef-b686-952b239975f9"}, {"author_name": "atkumano", "gravatar_hash": "e447b5e669e87a67b0a25011765c9d5d", "author_url": null, "date": "Feb 13, 2014", "message": "I'm from Japan, now living in the US. I speak both English and Japanese fluently. I am against the idea of decentralizing SO for the sake of becoming more inclusive of non-English speakers, because I believe the objective can be achieved without decentralization. \n\nMy proposal is this: instead of creating a copy of SO in a different language, why not create a way of viewing the SO in multiple languages? I think this idea can be integrated into the point system of SO. Say there is a Japanese (or whatever non-English language) speaker J who understands English only a little finds a thread which he/she wants to understand in detail. Then J can flag the best answer as 'translation wanted: to Japanese' so that a translator can come along, translate the answer, and earn points. J can then click on 'view in a different language,' choose Japanese, and read the answer in his/her native language. If the point system can motivate users to answer questions, I don't see why the system won't motivate them to translate. \n\nI'm not sure how realistic this is, or how well this will make SO more inclusive, but it is a possible solution to make SO non-English-speaker-friendly without decentralizing the SO community. Perhaps, something similar is possible with SOs for different languages, as long as the SO instances are kept close to each other (e.g. possible to port Q&amp;As of one SO instance to another; similar question in a SO of a different language is considered duplicate, etc)."}, {"author_name": "Garrett Albright", "gravatar_hash": "a1a12e14b3f6000610afacd2de383f41", "author_url": "http://abweb.us/", "date": "Feb 13, 2014", "message": "&gt; I could probably toss back some saki with Morimoto \n\nHe'd probably wonder what you were talking about. Try \"sake\" (pronounced like \"saw-kay\" but with shorter vowel sounds).\n\nYeah, like this and other comments evident, languages are hard…"}, {"author_name": "Nicholas Shanks", "gravatar_hash": "26009c2d850112f9395b8552e9890c44", "author_url": "http://nickshanks.com/", "date": "Feb 13, 2014", "message": "Yes, eventually there will be one community, each user reading the question in their own first language, via automatic translation. We are not there yet with our technology. SE, rather than advance that technology, have chosen to circumvent it and put up with the status quo. I think this may have been a necessary evil in the short-term, but provision should be made for the time, perhaps five or ten years hence, when the corpus of translated material in our field will be sufficient for machine translation to be accurate (if not exactly perfect) and the scenario outlined above can come a few steps closer, at least for a few select languages.\nTo that end, I suggest that SE encourage the verbatim translation of English questions and their top-voted answers, starting with the most viewed questions on SE. Secondly, user accounts should be merged, and I don't just mean in the same way that a user shares the same OpenID, but that points and badges earned on \"pt.\" are indistinguishable from those earned on \"en.\" and vice versa. Questions asked/answered by the user in either language are shown in one list, viewable either through the pt or en portals."}, {"author_name": "Crístian Deives", "gravatar_hash": "e2ea7c27233a9019a1f91a821726a4d4", "author_url": "http://www.google.com/+CrístianDeives", "date": "Feb 13, 2014", "message": "You're giving an advantage to the English native speakers if you only offer the website in English."}, {"author_name": "André", "gravatar_hash": "a5b7ad417296b4941ff51d91e7503542", "author_url": "http://amoraes.info", "date": "Feb 13, 2014", "message": "The level of english proficiency required to as something on SO be understood is low. Most people will have understanding of english varying from low to medium if they don't dedicate more time to learn it.\n\nAlso, a lot of people use a tool to translate from native to english when asking questions. Now, sometimes, you will need to do that translation when reading answers... Not a big deal :)\n\nMaybe the next language should be Esperanto. And then force everybody to speak/write Esperanto. That way everybody can learn Esperanto."}, {"author_name": "Bob Pacquano", "gravatar_hash": "2140d2af9a996804f8ca60c735220d85", "author_url": "http://www.pacquano.com", "date": "Feb 13, 2014", "message": "You make some very good points and I completely understand your arguments, especially for a person whose first language isn't English. Breaking up SO into different languages doesn't seem like a very good idea. You not only fragment users by language but you fragment the content and highly capable resources as well. Non-English speaking users will not have access to the same question and answers as English speaking users and vice-versa. An answer given in Portuguese, for instance, may be a better than the one available in English. The site with the most content will win and it appears English will given the longer history. Non-English speakers who need expertise will be forced to use the English version of SO anyway.\n\nYou could implement some form of translation, but trying to do it with humans will be impossible given the amount of generated information. SO has enough problems keeping up with moderation, so just imagine the monumental effort it will take to translate every question and answer. \n\nI will go on a limb and say that the entire language issue is mute. The vast majority of information available on programming languages, tools and software are written in English. Even the keywords for most languages are in English and I don't expect this to ever change. Have you ever encountered Chinese C or Pascal? Even the program comments, which can be written in any language is still written in English. Besides, I will take a guess and say that most of the content on SO is code snippets with very little written descriptions.\n\nStill, I think something should be done. Your best bet is to just have a translation button embedded in SO answer box from Google or some other translation service. It will make it easier for non-English speakers to translate text without cutting and pasting into a translation site or program. This can be done in any language. It may not be the best translation, but it certainly helps. Programmers are also fairly good at parsing out the meaning of an awkwardly constructed sentence if they have to.\n\nIf a non-English speaking user wants to answer a question, they can use a translation service like Google Translate embedded in SO. If the translation isn't good enough, SO already has facilities for editing other users answers, so it's not a big deal."}, {"author_name": "Mike", "gravatar_hash": "2042b538b9cb94bf129f22c677b5bb08", "author_url": null, "date": "Feb 13, 2014", "message": "English isn't my first language, I speak Russian, so I couldn't read this post.  What's it say?"}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Feb 13, 2014", "message": "Absolutely terrible idea, dear lord SE what has happened lately?54"}, {"author_name": "Mux", "gravatar_hash": "924b364ad5c19952360dfb15d7bad986", "author_url": null, "date": "Feb 13, 2014", "message": "Linus Torvalds, creator of Linux and Git. He's from the Swedish speaking part of Finland.\n\nOh and I'm Dutch, but please never make a Dutch SO. We're all spoiled here with proper English education."}, {"author_name": "Troyen", "gravatar_hash": "38c4716a36624814c1e0c7fd527150a9", "author_url": null, "date": "Feb 13, 2014", "message": "The people saying \"just use Google Translate\" haven't tried using it with Asian languages.  Google Translate is really bad at translating Japanese, for example.  Having manual translators for questions doesn't really scale either - if someone makes an edit on the English version, now you need translators in eight different languages to update the non-English version.\n\nIt is also not true that all programs are written in English.  The keywords might be, but function names, variable names, comments, documentation, etc., don't - and often aren't when developed by a group of non-fluent English speakers.\n\nThe argument that \"oh, now developers won't have a motivation to learn English because you're providing them with answers in their own language\" is also ridiculous because non-English speakers not using Stack Overflow now are already not motivated to master English just to program something that may never be used by English speakers.  Why do you want to force a group of Russians to learn English to develop an internal tool for a Russian company?"}, {"author_name": "Timothy Kaemmerer", "gravatar_hash": "7ab9cb13c139cc3da4cb51bd01e3e8a8", "author_url": "http://thematicnet.com", "date": "Feb 13, 2014", "message": "Everyone saying what a terrible idea this is, think about this: would you have learned to program if you had to learn chinese before you could really get into it? Probably not. Try going out and getting a calculus textbook in a foreign language and try learning it. Now you have compounded difficulty from the language and the subject.\n\nAlso, all these alternative ideas have already been discussed for years on \"area51\" of stack exchange. Spanish and Chinese SO sites are already in the hopper and have been for at least 2 years."}, {"author_name": "SlugFiller", "gravatar_hash": "74f0f94dd9559087620dfa4c923f1f5d", "author_url": null, "date": "Feb 13, 2014", "message": "I didn't Google, but I did open his Wiki page first, to make sure I'm not wrong. I'm AMAZED no one mentioned him. He is potentially better known than John Carmack, and... who the heck is DHH (btw, Danish, not American)?\n\nI'm talking, of course, about Linus Torvalds. From Finland.\n(If you thought he was from America, shame on you!)\n\nStill, as someone who was not an English native speaker, I can honestly say I learned English -thanks- to computers. And... also... Police Squad, because anyone who can follow Leslie Nielsen, is fluent in English.\n\nBut I do agree that you won't know the fallout from this until you've tried it out. And I'm all for the empirical method."}, {"author_name": "não quero spam", "gravatar_hash": "3c90377199790d4e2d9bdf94a1760008", "author_url": null, "date": "Feb 13, 2014", "message": "the worst part is that the \"portuguese\" stackoverflow isn't even in portuguese. it's in the brazilian version of the language. that's nonsense. if you want to do a portuguese version, do it in portuguese, not in some dialect. or call it the brazilian stackoverflow."}, {"author_name": "Caleb", "gravatar_hash": "d41c3815cb7f40b9bb4a3ba25ca21ff3", "author_url": "http://stackoverflow.com/users/643383/caleb", "date": "Feb 13, 2014", "message": "Instead of creating *different* sites based on language, why not simply start accepting questions and answers in other languages on each site? Add a language filter so that users can choose to see only the posts in the language(s) that they speak. Finally, create a set of guidelines for moderation across languages. For example, a question in Portuguese isn't an exact duplicate of a question in English, even if they cover exactly the same material."}, {"author_name": "Anthony Accioly", "gravatar_hash": "2e1542fe164f8abf326960e219127ac9", "author_url": "http://a.accioly.7rtc.com", "date": "Feb 13, 2014", "message": "I'm actively participating in both SO and SO-PT. I'm all for it and want to clarify some things that I've read in other comments: \n - There are only beginners and beginner questions being asked in SO-PT. Wrong, while there are a lot of beginner questions (this is a new site after all), there are advanced users asking and answering questions for which I couldn't find an answer in English.  \n - All advanced questions will be asked at SO: Wrong again (see item 1).\n - We should have a translation queue: I support this idea - but still think that both sites should remain independent. There are a lot of volunteers porting questions from SO to SO-PT and I'm sure that Portuguese speaking users will be happy to translate questions and answers the other way around. \n - Leveraging machine translation: Open Google Translator, paste a small text in English, translate it back to Portuguese, then from Portuguese to English, then from English to Japanese and back. See my point? I'm know that I'm exaggerating, but even a single translation step is pretty dangerous (My blog have a translation Widget and it completely butchers my text).\n\nOne more point, several users (like me) are sharing links to answers and questions from SO on SO-PT. I'm pretty sure that this will not only increase SO visibility, it will also attract some clever new members.\n\nTrust me, Stack Exchange is doing a greater good by making all of those Portuguese only speaking programmers visible to the world. In the short term it helps them, in the long term it helps everyone."}, {"author_name": "Robert Harvey", "gravatar_hash": "ebe3d6287c84335aa7240d0131f4a9f6", "author_url": null, "date": "Feb 13, 2014", "message": "Your China Traffic analogy seems flawed.  \n\n - Stack Overflow is in English\n - 10% of all programmers are in China\n - 2% of traffic comes from China\n\n - Conclusion: Chinese programmers don't visit Stack Overflow in the expected numbers because it is in English\n\nReally?\n\nGranted, it's probably a factor, but I would imagine there are some other factors that weigh in, particularly cultural ones.\n\n - Equally plausible conclusion: 10% of traffic would come from China if Stack Overflow automatically translated all interactions from China to Chinese.\n\nOh, wait.  Don't we have Google Translate to do that for us?"}, {"author_name": "Lauro Gama", "gravatar_hash": "a30773cb4eb7153cdc4f91e37221bbc9", "author_url": null, "date": "Feb 13, 2014", "message": "One thing i realized accessing the PT.SO is the tags used in the questions.\nThe day it was launched the majority of questions i noticed were about PHP, ASP, Java and Javascript (basic stuff like FOR EACH). \nOnly a few questions had tags python or Node.js or mongo (FOTM languages and frameworks).\nNot flaming but to me it represents that PT.SO community is waaay behind in technology.\nI would like to see if with time new technology will start to be more discussed in PT.SO.\nps. If someone could do a check of the most utilized tags over time in pt.so, compare with the EN.SO data and post the results it would be real interesting."}, {"author_name": "jinglesthula", "gravatar_hash": "089d4696ec1d4fa9f7eb7e8ce288aeeb", "author_url": null, "date": "Feb 13, 2014", "message": "It was mentioned that we hope that all questions asked on a non-english site get asked and answered on the main/english SO as well.  There should be something in the site(s) code to promote that.\n\nWhile I certainly don't think awarding rep for 'translating' a Q&amp;A from portuguese to english would be a good idea, I think that some way of incentivizing the work would be good.  And the english and non-english questions should be linked.\n\nBut that said, it seems that SO is to answer technical questions that, although expressed in natural languages, aren't dependent on any one language.  Useful questions and correct answers (and comments and all the rest) 'under the hood' are natural-language-agnostic.\n\nIn other words, it would fragment things to have duplicate questions on different sites that each have their own surrounding discussions in the form of disparate answers (right or wrong though they be), comments, etc.\n\nI think there's merit in rather having a language setting that allows you to see all user-submitted text in your primary language where such has been translated, with google (or other automated solution) as a fallback, and the language the text was originally written in as a final fallback.\n\nOr even show them all side-by-side so you can benefit from whatever you do know of the other language(s).\n\nJust tossing out another possible idea.  At very least there should most definitely be a way to hyperlink similar/same questions between sites!"}, {"author_name": "Alexandre Fiori", "gravatar_hash": "43e47f35ad5d0429196ead089725a45f", "author_url": null, "date": "Feb 13, 2014", "message": "Obrigado"}, {"author_name": "Simon", "gravatar_hash": "f088c3d0d5b6c20c23be87e8eb21c5b5", "author_url": null, "date": "Feb 13, 2014", "message": "`80% less than we should in the absence of language constraints` How do you know that? May be japanese just don't like SO."}, {"author_name": "Simon", "gravatar_hash": "f088c3d0d5b6c20c23be87e8eb21c5b5", "author_url": null, "date": "Feb 13, 2014", "message": "May be that's something that will change, but right now, coding is done in english, most programming languages are in something that looks like english, 99% of the documentation is in english, error messages are in english. I can't imagine someone that does not read english do anything in programming.\n\nAre there really people who can understand a question, know the answer, can write the code for it, but cannot explain it in a few words of english?\n\n(English is my second language, I have always documented my code in english, not only for encoding reasons)"}, {"author_name": "Sklivvz", "gravatar_hash": "3fd9e5b2c59170ec3d74dde30d233fa4", "author_url": "http://www.sklivvz.com", "date": "Feb 13, 2014", "message": "Folks:\n\n- We support many different communities. We have 100+ sites\n\n- It's perfectly reasonable to provide a non-English interface if our users need it.\n\n- We simply added one community to the 100+ we have. It's composed of new users and users who presumably use both sites.\n\n- The community will prosper and live, or wither and die based on its own merits.\n\n- This is NOT about content. Google translate solves that for the large part. This is about COMMUNITIES. Communities REQUIRE a shared language. We are not going to host different communities that can't communicate on the same site (do you really want Mods that don't speak English moderating SO?)"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Feb 13, 2014", "message": "@Sklivvz: For what it's worth, I don't have any problem with non-English sites.  I'll say a prayer for your localization problems."}, {"author_name": "Derf Skren", "gravatar_hash": "31a32dfcf620a2b88a7eb95ff4b2256c", "author_url": null, "date": "Feb 13, 2014", "message": "Great, so now we'll all have to learn what 'removed thanks at end of post' is in Portugese.\n\nSeriously, SO is the most inhospitable 'discussion' site that exists anywhere on any subject. It's crawling with people who have nothing better to do than incorrectly mark questions as dupes, or pick at the grammar in a question.\n\nWhy are we worried about developers in other languages having a 'nice time' here? We don't get that in English."}, {"author_name": "AloisDeGouvello", "gravatar_hash": "324013a170e93e1adde9d3481d157068", "author_url": null, "date": "Feb 13, 2014", "message": "When I was a child, my english skill was aweful.\nI am pretty sure I could not even read this sentence.\n\nToday, I am not fluent, but I can read it. I can read any blog post or any documentation. Since I started programming, I practice English every day. I would love to learn this langage this way when I was a child.\n\nAnd if someone really dont know english, there is a lot of progamming language in a lot of programming language. Good way to start, isn't it ?\n\nhttps://en.wikipedia.org/wiki/Non-English-based_programming_languages"}, {"author_name": "AloisDeGouvello", "gravatar_hash": "324013a170e93e1adde9d3481d157068", "author_url": null, "date": "Feb 13, 2014", "message": "Cannot edit my post. Sorry.\n\n\"a lot of progamming languages in a lot of languages\""}, {"author_name": "Ramy Al Zuhouri", "gravatar_hash": "04db5519fe4156e0b045879c3239127c", "author_url": null, "date": "Feb 13, 2014", "message": "I totally agree. I learned a lot of english just trying to solve programming problems and bugs. \nWe all have to speak the same language, I am not just worried about information fragmentation. But also about the fact that human resources are wasted if people start talking in different languages. Language barriers are a problem, I think that in all countries they should teach english at school, and I hope that one day english will be the only language spoken."}, {"author_name": "hg", "gravatar_hash": "df1387700686382fab1a48a9eb99ec9a", "author_url": null, "date": "Feb 13, 2014", "message": "Btw, Estonia also has an independent copycat at pinu.ee"}, {"author_name": "Richard Gomes", "gravatar_hash": "0e69532ab257a5f73bb2b185671aa46b", "author_url": "http://rgomes.info", "date": "Feb 13, 2014", "message": "I'm Brazilian. When I was in high school I used to hate English.\nWhen I started Computer Science in college, I quickly realized that English is key not only in computing but everything else in Science.\n\nThen I started to study it hard and all my code was commented in English, all variables in English. My colleagues used to find it funny or even strange for a Brazilian to do this sort of thing.\n\nI've got a job in a research center next to the university. They had a compiler there imported from Holland, half commented in Dutch half commented in English. Needless to say that only half of it I was able to understand. So, that experience proved to me that I was in the correct route.\n\nBrazil is peculiar because it's an isolated country. It's a vast Portuguese speaking country in South America, surrounded by Spanish speakers, mostly. Brazilians don't speak English. Brazilians don't speak Spanish either.\n\nBut the developer community is very active, creative and capable.\n\nWhilst launching SO in Portuguese contributes for segregation of content, which I consider bad, I guess that part of the community will feel compelled to understand English a little better, since the majority of valuable questions and answers are in English.\n\nI guess that, in the long run, the strategy would contribute to make more people proficient in English. Maybe in the long run the popularity of the English site overcome popularity of regional sites."}, {"author_name": "André Roberge", "gravatar_hash": "ca465da45735c9efed28478928fa9fbe", "author_url": null, "date": "Feb 13, 2014", "message": "Eveyone leaving a comment here, by default, has achieved a degree of fluency in English.  You will not see people fluent in Portuguese but not English commenting.  So, in the absence of these voices, people stating \"bad idea, it will fragment the community\" will only have their opinion being reinforced.\n\nThe problem is that there is no single language community.  If you are not fluent in some other language, you just do not see what is going on. Yes, English is the most prominent language in the programming worldwide community, but that does not mean that it has to be the only one.  \n\nI remember perusing an Italian group (I don't understand Italian but got there via a link) and saw a long response from Alex Martelli of Python (and Google) fame.  I already knew Alex from his wonderful posts in English and realized at that point that he did not limit himself to only one community.  His contribution to an Italian forum did not take anything away from the English speaking community, and contributed to a different community which was just as much in need of Alex's wisdom than the English Python community.\n\nSo, I fully support this initiative, even though I will not be able to contribute to the Portuguese stackoverflow."}, {"author_name": "Mário Rodrigues", "gravatar_hash": "139359d74df2fb74d3a42f49c7102861", "author_url": null, "date": "Feb 13, 2014", "message": "I'm Portuguese and I don't think that going multilingual is the answer. There's already forums in portuguese (Portugal an Brazil) for programming and they are a disaster. I think that English is not a tough barrier. It's weird to speak Portuguese with lots of English tech words. I even comment my code in English.\n\nPersonally I can't respect a portuguese programmer that doesn't speak English, it's impossible to deny that English is the de facto language of programming. So many tools, projects and documentation in English. In my opinion, things like multilingual screencasts for explain the first steps in programming, frameworks, SDKs, etc are good for starting but in the long run you will need english. \n\nRight now the best programmers/developers speak good English and \"separating\" a community by language is not going to help. It's good for a programmer to feel the need/pressure to learn English, he'll communicate with the best. All I can see in the future is a Portuguese community (and others) starting with newcomers to programming and failing in the long run.\n\nWhat's next? Translating programming languages? ufff"}, {"author_name": "Anon", "gravatar_hash": "17c4a5784e53e123bfd405dfdb1499e1", "author_url": null, "date": "Feb 13, 2014", "message": "I am French and hope a FR version is not scheduled.\nIt´s one thing to localize the interface, making a competitive website ghettoizing a portion of your audience is another matter entirely."}, {"author_name": "Fabdlnltc", "gravatar_hash": "bd24952e4317c69158a24ee6341d23d4", "author_url": null, "date": "Feb 13, 2014", "message": "What about translating the best questions/answers that are not similar to other existing questions on pages in Portuguese to English and vice versa when they occur?"}, {"author_name": "Stephen Winnall", "gravatar_hash": "1c783ea9d5f9dd740cfefba06f0326f6", "author_url": "http://www.vimia.com", "date": "Feb 13, 2014", "message": "I work in Switzerland in a German-speaking environment. I went to work there because I could already speak German, though I'm a native English speaker. Working in that environment I have noticed the following:\n\n1) people are just as creative and good at programming if they speak German;\n2) many people have invested a considerable effort into learning English, which is - unfortunately - rarely reciprocated by English speakers coming to Switzerland;\n3) being able to speak English in a social context or understand English text books does not equate to being able to hold your end up in a technical or business discussion or writing technical papers or participating in online discussions.\n\nI have experienced meetings in a large organisation here where up to 100 German speakers have been present, all of whom have some competence in English (achieved, let us say, by 300 people/years of language learning). The same meetings are held in English because there is one English monoglot present. The meeting degenerates into solo performance by the monoglot because the locals don't have the confidence to get involved. This is not untypical, though this particular example may be an extreme case.\n\nFor me it is a no-brainer that any given social structure on the web should be available in any language. English speakers are in general notoriously poor at learning other people's languages and thus have little idea of the resources that they are thus overlooking. There shouldn't be any discussion at all about resources on the Internet being multilingual: there should be a discussion about how to encourage English speakers to broaden their horizons by learning another language."}, {"author_name": "Stephen Morris", "gravatar_hash": "710abc1fb46bc12857cd2e1d0cfa2151", "author_url": null, "date": "Feb 13, 2014", "message": "Sejam muito bem-vindos!"}, {"author_name": "Aron", "gravatar_hash": "22afd351ac35eec2609ba7151053b9a0", "author_url": "http://stackoverflow.com/users/1808494/aron", "date": "Feb 13, 2014", "message": "Perhaps another solution would be to release either a site, or we start tagging (maybe geotagging) posts with Simple English a la http://simple.wikipedia.org/wiki/Main_Page"}, {"author_name": "Yu Hao", "gravatar_hash": "c556b9524d5283d700f702328490dde8", "author_url": "http://stackoverflow.com/users/1009479/yu-hao", "date": "Feb 13, 2014", "message": "I'm from China.\n\nIt's true that programmers in China visit Stack Overflow less because of language issues. I hope I can see the Stack Overflow in Mandarin soon even though I myself enjoys more in the English site. The sites in China that has a similar function as SO all suck, either without much people around, or has a rather low quality of contents.\n\nI wonder if there's anything I can do, perhaps a proposal in Area 51?"}, {"author_name": "J Bruni", "gravatar_hash": "ca1fb0d91923b0d58358c9b38c27b31c", "author_url": null, "date": "Feb 13, 2014", "message": "Hi. I'm from Brazil, member of SO for \"3 years, 8 months\" as of now, and now member of Stack Overflow in Portuguese for 10 days, when I came to know about it.\n\nAll I can say is: thank you, thank you, and thank you.\n\nMy personal testimonial is extremely positive - I would write a comment longer than this blog post if I would express how much I am enjoying it.\n\nAll lots of interesting details, experiences, facts, impressions, opinions and observations apart, I will only highlight a single aspect, which I feel it worths the whole thing, despite anything else... and it is as simple as this: I feel a member of the community.\n\nI never felt \"feeling a member of the community\" with such intensity before. I would give SO in other languages as a gift - because it is such a well drafted tool...\n\n...I worked remotely only for overseas companies for several years, always using English, until recently when I worked in two national projects, and was able to use Portuguese. Those of you who only speak English will never experience the good feeling of relief which is simply being allowed to communicate in your first language. Your mother language!\n\nI want to praise SO in Portuguese more and more, but I will refrain myself and finish my comment right here."}, {"author_name": "Martin J", "gravatar_hash": "ba4be56ac8708e51e06fea89304b31e9", "author_url": null, "date": "Feb 13, 2014", "message": "Slightly off-topic, but:\n- 10% of the world’s programmers are in China\n- 1.4% of our visits come from China\n- Only 4.8% of our visits come from China, Japan and Korea combined\n\nI am a western guy living in Shanghai.\nWhile I don't doubt that there are serious language issues preventing a lot of chinese programmers from meaningfully interacting with the Stack Overflow community, there are a few completely unrelated issues that may also have a significant effect for your penetration in China.\n\nIn particular, your CDN (sstatic and imgur URLs) does not work in China most of the time (or at least, it doesn't work for me in Shanghai, on both my home and mobile connections). This means that most of the time, when I try to load Stackoverflow or any other stackexchange website, I get at best an unskinned, no-interaction version of the site (Go to SO, open your web inspector, remove any css and js files, see if you like it). This is not a GFW issue, as the site works correctly sometimes.\nAs a matter of fact, I ended up creating a chrome extension that performs the role of a local CDN cache for static SO resources, so I could have the complete stackoverflow experience whenever I want or need it.\n\nSo, creating new versions of stackoverflow in other languages is fine and dandy, and I respect that, but if you want to increase your penetration in China, fix your CDN issues.\n\nBest regards,\nMartin"}, {"author_name": "Benjol", "gravatar_hash": "501465a53bf1042de206d7d79cc68942", "author_url": null, "date": "Feb 13, 2014", "message": "I'm assuming the little girl you refer to at the end of the post is 13+? Either that or she got someone else to ask her question?\n\nhttp://meta.stackoverflow.com/q/61770"}, {"author_name": "Thomas", "gravatar_hash": "8bba6159c86f6fa31c4785296cc371ef", "author_url": null, "date": "Feb 13, 2014", "message": "Kohsuke Kawaguchi, primary developer of Hudson &amp; Jenkins."}, {"author_name": "proton", "gravatar_hash": "4f07a098ebe0076b0be9456c98507852", "author_url": "http://none", "date": "Feb 13, 2014", "message": "No, we all can't Speak English !!\nSome people(including me) do have strong attachment to the language that our forefathers used and some have even more strong attachement to the languages, that they even won't accept any other language than their own mother tongue,and I don't find it wrong.\nBut yes I do agree that, if any other stack overflow site is made, that will divide the devs that contribute to stack overflow. \nI want  that stack overflow should be in one language\n\nIf someone else requires site in any other language, that community should come together and make it. Like chinese do, they've their own socialNetworkingSite(), their own searchEngine()\n\nStackOverflow should try to maintain the community it has, instead of expanding"}, {"author_name": "bhu1st", "gravatar_hash": "6e273c636c1bc5fe3e6d839dda041e91", "author_url": "http://bhu1st.blogspot.com", "date": "Feb 13, 2014", "message": "Hoping to see SO in Nepali someday."}, {"author_name": "Mr.32", "gravatar_hash": "e61e860e1454db9dcdae1fd72815a060", "author_url": "http://shareprogrammingtips.com", "date": "Feb 13, 2014", "message": "Gujarati is my 1st language, Hindi is my second language and English is my 3rd language. \n\nBut i can/know only type/work in English with system.\n\nThere is a large number of user from india having english as not their 1st language. so would you make it in Hindi stack overflow?\n\n\nMulti language stack overflow will kill it self."}, {"author_name": "David Wallace", "gravatar_hash": "15d3990f6bc667a84c12cb004a7e4a8c", "author_url": null, "date": "Feb 13, 2014", "message": "I would like to applaud the Stack Exchange team for making this bold move. I especially applaud the acknowledgement that it might not work, and that they are prepared to backtrack on the idea.\n\nMy own opinion is that it is a bad idea, and won't be very successful, but I have been wrong about such things before; so actually trying it out is a very good idea.\n\nInstead of being entirely negative, I would like to offer an alternative way of solving the same problem.  Simply make it acceptable to post questions and answers in any language at all, on the existing Stack Overflow.  Encourage bilingual people to append translations to existing postings - either translations into English, or translations of an answer into the language of the question.  These must be actual human translations, not copy-pastes from Google Translate.\n\nHere's an example of why I think this will work well.  I speak Spanish very badly.  I write Spanish slightly worse than I speak it.  I read Spanish reasonably well.  \n\nIf someone posts a question in Spanish, I will probably understand 90% of it.  I may have to look up a few words in a dictionary, or on Google Translate, but if the question is in my field of expertise, I will be able to answer it.  However, I'm not going to be able to write a good answer in Spanish, so I will write it in English.\n\nNow, it's quite likely that the OP's proficiency in English is similar to my proficiency in Spanish; which means that they will understand my answer and benefit from it.  Other Spanish speakers and other English speakers may also benefit from my answer in the future.\n\nIt's even possible that someone will edit the question to add an English translation of it; or edit my answer to add a Spanish translation of it.  That makes it even better.\n\nBut by keeping the Hispanophone people and the Anglophone people separate from each other - or for that matter, keeping any two groups separate from each other; Stack Exchange deprives us of the opportunity to help each other, and also to help future users of the site."}, {"author_name": "ardianzzz", "gravatar_hash": "d3e86dbe2b7d6beb427d8679468164ff", "author_url": "http://ardianzzz.com/static/about", "date": "Feb 13, 2014", "message": "Bahasa Indonesia please :)"}, {"author_name": "Vasco Calais Pedro", "gravatar_hash": "859e53cd3234efef8645b78df955d077", "author_url": "http://www.unbabel.com", "date": "Feb 13, 2014", "message": "Bold move which I support 100%. 75% of the world doesn't speak english. Providing access to information in SO to everyone is amazing. We would love to help the effort at www.unbabel.com. I propose that the best posts in English get translated to Portuguese. We have a really strong English - Portuguese community and would love to be a part of this movement."}, {"author_name": "Aayush Singh", "gravatar_hash": "fe6ab0e2b5347749a13b2db40f65628a", "author_url": "http://aayushsinghrajput.blogspot.co.in", "date": "Feb 13, 2014", "message": "Not really a discussion issue...It's company's choice how they want to expand this site and definitely it would be helpful for non- English programmers, why everyone here is involved in saying that this is bad and SO shouldn't expand in other language..??..Just go for your respective site, what you have to do if there is something in other language also...!!!"}, {"author_name": "Lorenzo", "gravatar_hash": "85e5c60ca8616d3c9269378baec34972", "author_url": "http://dematte.org", "date": "Feb 14, 2014", "message": "@Sklivvz I think you are right: it’s perfectly reasonable to provide a non-English interface if our users need it. I can understand it even more in the light of other sites. \n\nProgramming is one of those areas in which you still have to learn English. And today is even more true than 20 years ago. You are Italian, so you know we had great technical writers (Esposito, Balena, ...), and great journals (Computer Programming) some years ago. Now.. no more. The technical writers publish in English, journals are no more because of globalization, internet and \"free\" online content.\n\nBUT this is not true for every discipline. DIY, for example, would be great in any language.\n\nAnd I personally think SE could think of something more advanced than this, something that -in a very SE philosophy- combines technology (authomatic translation) with community (manual curation). So, instead of having an entirely separate community, have different \"access\" to the content. For example: question in English, German reader. Translate automatically to German; good but not perfect -&gt; Edit translation -&gt; manually curated translation -&gt; every German reader now enjoys good content in his language.\n\nSame for posting an answer: answer in you own language -&gt; automatic translation to English -&gt; review queue (like for edits) -&gt; approve, improve, reject (if the auto translation is bad.. do not translate it!)"}, {"author_name": "Ruslan", "gravatar_hash": "24eba6a5f088ab562d36b4a9b2a27a99", "author_url": null, "date": "Feb 14, 2014", "message": "Thank you for writing this post. This is such an eye-opener. It was totally not obvious to me that there are people who dont speak English. I thought that was eradicated 20 years ago before Polio. Also given the length of the post, I am assuming this must have taken a month of creative thinking on how to fill something as long as this blog post."}, {"author_name": "Dennis", "gravatar_hash": "45beee9b157c1cace13d6fdf180af9df", "author_url": "http://jaheruddin.nl", "date": "Feb 14, 2014", "message": "I think SO just opened a whole new can of worms.\n\n1. There is no longer the best place to ask a question for each question, now this actually depends on who is asking it.\n2. As @Simon already mentioned, everything in most programming languages is already in English.\n3. Now you will always have to do multilingual maintenance and troubleshooting."}, {"author_name": "Gus", "gravatar_hash": "ad871091cf73cc5b53931804e9a36a2d", "author_url": null, "date": "Feb 14, 2014", "message": "Linus Torvalds speaks English..."}, {"author_name": "Binghui Liu", "gravatar_hash": "80d0f9d629ac1eb2b7ea30b2cb410cea", "author_url": null, "date": "Feb 14, 2014", "message": "@Martin J Totally agree, SO does have CDN issues in China. I am Chinese and I can read English quite well (at least those questions and answers on SO), but that doesn't mean I don't need to use twice as long time to ask a question or post an answer in English as in Chinese. \nMost of the time it's not a simple Google translating issue as @Roberts Harvey addressed. Use Google Translate for English-&gt;German, or Japanese-&gt;Chinese? Perfectly fine. At least the translation can be understood by a human being. But English-&gt;Chinese can be like hell. Languages from different systems that are without certain similarities can not be handled well even by Google. \nIt is a fact not all groups of people in this world can learn English as easily as native German or Latin language speakers (for those who don't know, there're no concept of alphabets or tenses in Chinese), so it might be quite harsh if those who don't speak or read in English are yelled at \"go back to your non-English world and stop coding!\" \nA Chinese community is not urgently necessary or currently possible from my view. Yet if there are some translating support for non-English developers in China, just saying, like someone can post a question in Chinese and tag it with \"in need for translation help\" or sorta, before release it to real SO world, so others can help him translate both the Q&amp;A, I guess it may help quite a lot."}, {"author_name": "friendzis", "gravatar_hash": "d4daf703d131c38cf93d794fb9409499", "author_url": null, "date": "Feb 14, 2014", "message": "There are PLENTY of non english programmers. At least someone must use Kaspersky antivirus or at least code in a language by Stroutstup (whatever the spelling is). It's not that hard, actually.\n\n&gt; We’re really only considering launching sites in languages that:\n&gt; Have large, strong communities of high-talent developers, where\n\nThat's the problem: even though my English skills are pretty good I would still prefer to answer in my mother tongue just because I can express myself better (to some extent) and also play with the language.\n\nWhat do you think will make those strong and large communities of high-talented developers to stick to English?"}, {"author_name": "Mark", "gravatar_hash": "dfec196cde03f22c9b0e63b1f7a87d93", "author_url": null, "date": "Feb 14, 2014", "message": "I think it is time to put the hidden elephant in clear view. The last time I have checked StackExchange is not a charitable organization. They need to make profit to pay the bills, the workforce and the share holders. I think that someone in the upper level of their managers has become greedy. I can imagine the reasoning: \"Hey we have a very successful site. Why don't we replicate that great idea in (..... put your preferite language here)?. We could make a bunch of money and the success is pratically guaranteed.\" All the wishful writing and good intentions cannot really hide the real reason behind this move. I suspect that very few of your programmers are really behind this idea and support it, but this is how it works in our imperfect world. You put an emblematic picture on the start of your post. Separate the languages, divide  the cultures and you could start the wars. The Towe r of Babel is one of the places where humanity started its wrongdoings."}, {"author_name": "Criação", "gravatar_hash": "1f75e082dfef04495067d0bbbdebd102", "author_url": "http://www.techload.com.br", "date": "Feb 14, 2014", "message": "This will be a never ending thread of supporters and naysayers. But it is interesting to read all these opinions."}, {"author_name": "Filipe Gonçalves", "gravatar_hash": "5da03d2e233e1a40a4f1923acfb9d433", "author_url": "http://www.codinghighway.com", "date": "Feb 14, 2014", "message": "I don't like the idea. I'm portuguese - live in Portugal, was born in Portugal, and learned English in elementary school.\n\nI just don't think this idea is that good because it will definitely contribute to the fragmentation of the community. Good developers MUST be proficient in English, or do you think Bjarne Stroustrup would have made it so far with C++ if he didn't master English?\n\nFor me, a developer who lacks english knowledge has a serious gap in his curriculum. I can understand that lots of developers in Brazil, Portugal, Spain, Russia and other countries can struggle with English usage, but they are the ones who should be aware that they're limiting themselves to a very specific and local community. It's their call to fix this and learn English, not the other way around.\n\nAs for the children: bullshit. My brother is 14 and he has had basic English knowledge since he was like 11 or 12... he can pretty much keep up an online conversation in English, because he's learning it in school and he learned it while on the Internet. So yeah, he could theoretically participate in SO, just like any foreign kid nowadays who studies English and uses the Internet."}, {"author_name": "zithro", "gravatar_hash": "b397f9f6c66b982916a3fdb581035d35", "author_url": null, "date": "Feb 14, 2014", "message": "Context: I am French, living in France, I have a quite good level in EN, and everything related to my computer is in English. OSes, programs, own scripts&amp;comments, websites I browse (except french-specific ones ofc), even the movies I watch have english subtitles. So, full English on a comp. It allows a lot of words-shortcuts and abbreviations, a lot of acronyms are used (even if lol was translated in FR, we do not have TL;DR for instance).\n\nI realized in my engineer school, where the average english level was really bad, that you can actually learn (good) programming only speaking French. I was amazed, for me all needed ressources were in English, dot. I wasn't even searching for French websites (google gives me EN results, not FR).\nI looked at my mates like martians when I was being answered \"Why would we learn English ? We live and work in France, working with and for French companies. What's your point apart pure knowledge?\". Of course, they didn't already work abroad or for a bigger (int'l) corporation, where my point lies, but they got theirs (point).\nMoreover the average English level of French people is bad, and you see this in all countries with Latin/mediterranean roots (for example, FR/SP/IT/PT/... people speak less english than DE/CH/NL/SE/...). Let's face it, we are lazy people when it comes to learning foreign languages (a 10 year old study showed FR people were the biggest pot smokers in Europe but the last ones to be able to speak English. If there's a correlation is up to you, it's not medicXchange here!). And I think this is still true, even if a lot of english (tech) words related to internet and computers have been assimilated in French, and certainly in other languages.\nAnyways, I prefer reading even 'middle' french than 2yo English.\nAlong that we adapted, and proposed French content, rather than globalizing ourselves. IMDB ? Allocine.fr (cine=cinema=movie in FR). YouTube ? Dailymotion. SO/SE ? developpez.com, fr.openclassrooms.com, ...\n\nConformism is the death of the brain, and that is also for languages. We speak PHP/js/HTML/CSS/brainfuck or whatever but we communicate only in English ? ^^\nLet's not forget what the Catholic church did centuries ago: knowledge was \"stored\" and taught in Latin, and only highly educated people were getting instructed, keeping the masses ignorant. Do we want to step back to this form of knowledge spreading ?! I'll rather die (well, that's a bit extreme).\n\nNo learnt language replaces yours, and your fluency. Even my Spanish grandfather after living 60+ years in France still counts in Spanish! So let PT users have their SE/SO !\nAnd another point, learning English by reading it on a French website, by a French author like me, could lead you learning poor, bad or wrong english. The english level on websites nowadays is way worst than it was, and if I get it, native english readers should feel it even more. I blame no one, I'm an offender, but that's sad.\n\nI'll eventually end up with this, language bridges must be made, so knowledge stays universal forever. Bridges like translations.\n\nTL;DR\nI see this debate as being a bigger question : \"should internationalization means englishifization ?\", and -my- answer is no. English is the language of english speaking countries! Even if you may get the broader audience if your website is in english ..."}, {"author_name": "hattenn", "gravatar_hash": "4f841e920d687e5706b52468061da268", "author_url": null, "date": "Feb 14, 2014", "message": "I haven't read all the comments, so forgive me if I'm just repeating the same things (on another note, I hope I am).\n\nThis is a horrible idea, if you ask me. Language barriers are there because there are languages. If you keep supporting languages, there will still be language barriers.\n\nEnglish speakers, especially Americans, feel bad about \"making people speak their language\". I have seen this many times. But it's just ridiculous. We don't need more than one language. Having more than one language:\n\n1) Creates a language barrier, thus slowing down advancement.\n2) Gives people a reason for discrimination, just like nationalism, racism, and religion.\n\nWhen you say that \"If just one little girl in Brazil sticks with programming because an answer on this site helped her finish her first project, well… that’s not good enough!\", it sounds like a really humble thing to do, but it in fact is the opposite. You are overlooking the fact that there's a lot of information regarding programming and many other things in many different languages already. I'm not a native speaker of English, and I learned English thanks to my interest in programming. First I started with reading stuff in my own language, then I realized that I could learn much more if I read stuff in English. And that's how it should be.\n\nI don't care if it's English or any other language, but we only need one language, not three, not two, only one. The rest is just noise.\n\nTo wrap it up, disguised by a seemingly humble thing, you are supporting language barriers, by supporting languages. I'd expect better from you guys."}, {"author_name": "Rodrigo Deodoro", "gravatar_hash": "8ab08d76aa1e0b3f96f84ef733181af4", "author_url": "http://deodoro.org", "date": "Feb 14, 2014", "message": "For the people talking about \"fragmentation\" of the community: if people aren't able to participate, there is no community. They're simply not a part of it."}, {"author_name": "Xan Xuan", "gravatar_hash": "c75e3778280115b90ba90dfe6e74a538", "author_url": null, "date": "Feb 14, 2014", "message": "And why in English? The most spoken language is chinese, then spanish. If you propose to use google translator, I suppose you wouldn't mind having SO only in chinese translate it into english. Am I right? sure you'd mind"}, {"author_name": "Redd", "gravatar_hash": "b7e4dbb7d71314951f5520e49bcbb554", "author_url": null, "date": "Feb 14, 2014", "message": "What is the issue with formally translating the archives using some Google excellence? They love SO and I would be stunned if they didn't give you the credits to do alot of the bulk translation for free - all the worlds data, right? \n\nIf 90% of the translated words are correct, and 100% of the code is correct, wouldn't a wiki overlay make stack overflow available as a function of content demand?\n\nAnd honestly, I don't like the tone of the article. Language gaps, are like sexism, racism, homophobia, fear of clowns and any other fear of something whose inherent intent is not to harm you, irrational. Bumble Bee's don't think about hurting you, so unless you are allergic to clowns, quit wasting time joking on real topics. \n\nAmerica should represent the global population. As such, we could represent world peace rather than investment in world war. \n\nI had to read this article because of the title and the fact it was on SO. Think twice on the provocative title next time. The real news would have been no news. \n\nBlack, \nRedd"}, {"author_name": "Mikhail", "gravatar_hash": "e2449e6d1cb6b776d6a1b8f3025796cd", "author_url": null, "date": "Feb 14, 2014", "message": "This is ridiculous. I'm Russian. A typical Russian programmer. I speak English. All my friends who are programmers speak English.\n\nWhy stackoverflow.com is great is because it combined all knowledge. Other Russians don't use Russian forums anymore (like RSDN, for example). Whatever question I have, it's answered on stackoverflow. I often get answers from Russians. If you start a Russian version, for example, you'll just split the knowledge. Like it's with wikipedia. Russian version of it sucks. I use it only for stuff that's not in the English version. But there is a reason why a Russian version of wikipedia should exist - not everyone can speak English. My mother can't. But we are PROGRAMMERS, we can. If someone can't, it's THEIR problems.\n\nI understand that you have workforce and need to have something to do, but this is just a bad path. You'll lower the quality of the main site and make some smaller deserted ones."}, {"author_name": "Milan Cvejic", "gravatar_hash": "e2c4b84c4e00451e5998474487f60d5d", "author_url": null, "date": "Feb 14, 2014", "message": "Igor Sysoev , NginX developer"}, {"author_name": "Redd", "gravatar_hash": "b7e4dbb7d71314951f5520e49bcbb554", "author_url": "http://www.proweaves.com", "date": "Feb 14, 2014", "message": "@Mikhail Wikipedia is a nice example. \n\nThere is certainly a balance between fragmentation and localization that we all must strike. But I wonder if you will feel the same way about your local wikipedia in a few years as moderation forces (like you voice) join in to correct the problems you see. \n\nLike Democracy, the Wiki is inherently going to produce positive results. Any deviance is likely the result of anomalous input which can be identified and corrected with proper effort."}, {"author_name": "David Anq", "gravatar_hash": "9a7977fec8e808157b5ae7a801892d89", "author_url": null, "date": "Feb 14, 2014", "message": "Hmmmmm. I'm from China, and thanks to my English skills, I'm always among the best programmers anywhere. Most competitive programmers around me are active users on SO. In fact, in the university I went to, choosing Software Engineer major has some requirements for English skills. I do think that English is THE language that serious programmers should master."}, {"author_name": "f p", "gravatar_hash": "7821ba2a4e70bbc8737e9b737327e095", "author_url": null, "date": "Feb 14, 2014", "message": "How many questions deal with localization in one way or another? These are problems that are different for each languaje, and are a headache for which the solution is specific to a language and sometimes to a country, and english speakin only people simply are not interested.\n\nAlso time will tell, as things evolve in unpredictable ways."}, {"author_name": "James", "gravatar_hash": "63222bd2bbff2beecf9883a90f980255", "author_url": null, "date": "Feb 14, 2014", "message": "I will probably never learn another language other than English, I tried to learn Spanish as a child and my school tried to teach me Indonesian, yet I cannot for the life of me speak either language, I don't know if it's because i started with English but i cannot learn other languages no matter how hard i try they always remain foreign to me. \nInterestingly i have been to Indonesia (Bali) and everybody i met spoke English, all the signs where written in their native language and English below or above.\n\n(For me this problem doesn't extend to programming languages)\n\nBut with that said, I see no problem with SO being in other languages simply because i would assume some people who speak a different native language to English may be like me, they might not have the drive to make sense of a completely new language.\n\nA final word though, from my experience, English does serve as a sort of universal language and i don't think i'm being ignorant."}, {"author_name": "sqykly", "gravatar_hash": "9f77f63b56bb331efaa39d6b33f07cd8", "author_url": "http://play5ong.com", "date": "Feb 14, 2014", "message": "I have mixed feelings about this, and it doesn't look like I'm alone.  Something I don't see a lot of comment about is who we will be losing.  By which I mean:\n\n  - Users whose native tongue is Portuguese that have been answering questions in more-or-less okay English may spend less time here as they can more comfortably use the Portuguese site, depriving us of their talent &amp; expertise.\n  - The same users will probably be able to find answers on global SE *when they ask them*, but will most likely miss all the great answers to *questions they have not asked*.  They are therefore depriving themselves, voluntarily, of the larger body of users who occasionally come up with something that everybody can benefit from, whether or not they knew to look for it specifically.\n  - On the plus side, English speakers who do not speak Portuguese will be spared the task of reading posts from those current Portuguese-speaking users whose English is.... imperfect.  Usually, people don't identify their native language when they post broken English, but one has to assume that at least *some* of those posts are written by users who would really rather be posting in Portuguese.\n\nJust one more thing: please do not integrate Google Translate (tm).  The thought of including - for instance - monolingual Japanese users through an automated translation is truly frightening.  When I did localization of Japanese games to English, I saw Google Translate (tm) turn \"Rodeo\" into \"Jude Law\", and \"Ring of fire\" into \"Circle of hepatitis\".  I am not making that up.  Please don't do that."}, {"author_name": "Adam Zovits", "gravatar_hash": "e1dc5d192bebb370ad276c55a53b635c", "author_url": null, "date": "Feb 14, 2014", "message": "I strongly agree with those who oppose non-english SO sites. The de facto language of programming is english. Pretty much the same for the whole internet. Also for international exchanges and communications. I think we can safely state that english is, or will be the common language of this planet.\nThere are many who don't speak it yet satisfyingly, but the progress is clear.\nHowever, by implementing this site you are working against the trend. Foreign programmers who don't yet speak english are the people who probably need to learn it the most. Yet by doing this you help them avoid learning for a while.\n\nIf I had, as a child, a copy of every game I played, every movie I watched, every comic I read translated to my native language, I'm sure I would never have learned english and, by extension, started programming."}, {"author_name": "Eric Platon", "gravatar_hash": "2d1e9a607c47a89730352dd7b9dacaab", "author_url": null, "date": "Feb 14, 2014", "message": "Experienced programmers speak several languages, no?\n\nJoke apart.\n\nI am surrounded by very talented programmers who can't write clearly in English, but explain perfectly in their own language---often better and faster than some good answers on SO. I heard about some experts for such and such technology who just ignore English---the typical geeks. Enlarging the community to non-English speakers should open new opportunities, present new ways to solve problems. I see mainly benefits in that, with technical difficulties (which are our raison d'etre).\n\nThe challenge is really to keep different-language answers in sync, as done for Wikipedia, but more actively. The badge systems and such mechanisms should work at its best. Looking forward to it, to learn from Portuguese speakers, and hopefully share back."}, {"author_name": "fotanus", "gravatar_hash": "18a3c1154b9f9f35358702920ec9c9a3", "author_url": "http://stackoverflow.com/users/413494/fotanus", "date": "Feb 14, 2014", "message": "How can we know if it is worth without trying?\n\nWhat is the original SO or the SE losing while trying?\n\nAn failed experiment is never wasted effort. At least we discover that something don't work and can reasoning why. Or better yet, discover that works."}, {"author_name": "Jake Kowalski", "gravatar_hash": "746e5c08d715d08dc245d6fad8a965a2", "author_url": null, "date": "Feb 14, 2014", "message": "What is worse, Stackoverflow different language versions are going to decrease the motivation and opportunity for those developers to learn English, thus reducing their progress in a skill that is quite mandatory nowadays."}, {"author_name": "Ruli", "gravatar_hash": "74213fc80b560aa353e552f8c264f09e", "author_url": null, "date": "Feb 14, 2014", "message": "Hmm interesting, I never thought about it like this, my first language is Slovak but I am OK with English, always considered it necessary to speak English as I code in English based code with all docs written in English etc."}, {"author_name": "Werner de Jong", "gravatar_hash": "1fe3dd657f85727df9c4b09cb2c16c93", "author_url": null, "date": "Feb 14, 2014", "message": "Basically I dont care in which language a site is written. Using Google auto translate any site provides me with enough context to understand the discussion. When properly structured code snippets are readable regardless of grammar errors.\n\nMy challenge to you is, don't create a language dependent site but a site where every language is served using simple translation that whenever someone is posing dutch, russian or any other language is translated to the main thread in English and the other way around. That will lift up spirits for all.\n\nI mean, come on you are accepting duplicate posts in multi languages now? That reeks of inefficient behaviour ;)"}, {"author_name": "Ian Wright", "gravatar_hash": "e5f4b1dac6954a32893de006ced98dc8", "author_url": null, "date": "Feb 14, 2014", "message": "@Sklivvz: The problem with the community argument is that your encouraging lots of little communities, rather than the larger community which was the original vision.\n\nHow many developers will prefer their native tounge over english at the determent of stackoverflow.com? Answers will build up over a variety of sites that are no longer easy to search (unless you understand that native language) and are difficult to comment on.\n\nIt's said any question will be mirrored on SO - who is realistically going to do that? There's massive backlogs of community based moderation that can't be got on top of so I don't think there's a chance of questions being replicated.\n\nUnfortunately I think it's a really big step backwards for SO, I don't think it will be the defacto source for issues anymore which is the main reason for its success."}, {"author_name": "Priscila Sato", "gravatar_hash": "4eb6dd0b2331d01b34526d91ba4ec929", "author_url": "http://dev.mayogax.me", "date": "Feb 14, 2014", "message": "this is such a perfect explanation!\nIn special the point \"I believe that everyone – everyone – who can really fall in love with programming should get a chance to.\"\n\nI can speak English? I can. But when I start to learn make code I did can't. Even today I'm still not very good in English, actually. Haha.\n\nThe SO in Portuguese is a great help for newbies (that talks Portuguese) learn code and most olddest programmers (that talks Portuguese) fell most confident to teach.\n\n&lt;3"}, {"author_name": "Allan Doyle", "gravatar_hash": "8875c21822cb8ff4dc7aa0cc7a303163", "author_url": null, "date": "Feb 14, 2014", "message": "Just admit you created SO in portuguese so you can sell ads to the Brazilian market..."}, {"author_name": "Guillaume Maiano", "gravatar_hash": "0356fa65c1c7fb6508e9a94121ea136a", "author_url": null, "date": "Feb 14, 2014", "message": "As a programmer, I believe everyone here is aware that languages shape the way you think.\n\nYou will not solve a problem in Lisp as in Haskell as in C as in Objective-C as in Java.\nYou will not solve a problem in ActionScript3. (troll)\n\nIt's also true in human languages. You will not think in German as you will think in French as you will think in Italian as you will think in Japanese as you will think in Hindi as you will think in Russian as you will think in Dutch as you will think in Malay as you will think in Mandarin. I don't speak (well) these languages, but I've been exposed to them in my life, and I can guarantee they're very different in their approach.\n\nIf nothing else, this pleads for multiple sites. Losing languages is losing approaches to problems.\n\nOn top of it, from what I read, I understand that the reason for no Russian/French site is \"that French/Russian natives speak good English\". It is satisfying to hear the opposite of the usual \"the French can't speak English\", but it does point the French/russian should have been vocal about their inability to speak English, and they would then have gotten a site in French/Russian.\n\nAs to \"English won the language war\", @Luc, I disagree. Currently, English is the language of the richest countries, combining the Commonwealth and the USA. This will change, and English will lose traction to Hindi, Portuguese, Spanish, Chinese, and others. Which one will be the biggest will depend on the economies of Brazil, Spanish-Americas, China and India, and others.  Betting on which is an exercise in SciFi, and hence should be avoided.\n\nWhat we know, is the current situation is: \na- a massive share of the Internet-techs speak English\nb- a non-negligible share of the Internet-techs do not speak English well enough to participate and have their voice enrich the debate\nc- adding language weaken the main site but strengthen the overall knowledge base\nd- automated translation (read, Google) gives access to these foreign languages\n\nI routinely check Dutch/Russian/German/Italian sites for information, technical in nature, that I can't find anywhere else. Google (and my personal small abilities) help me out. If they were not there, the information would just be lost to me. As a consumer, it's a boon, and I can give back in English or French.\n\nI strongly support multiple sites, even though I do believe that some kind of automated mirroring to the main site might help (as a button \"search other languages for similar problem\", for example)."}, {"author_name": "Pankaj Jaju", "gravatar_hash": "18d1edcc46386dd87fefc9d7dda3b820", "author_url": null, "date": "Feb 14, 2014", "message": "Why didn't SO explored a \"tranlsation enrichment\" for its platform? Like, you could still have English as the main communication language, but provide options for users to translate the text in different languages - especially the questions and comments part?"}, {"author_name": "WhatName", "gravatar_hash": "f839e8a286572adb47cd53398554502a", "author_url": null, "date": "Feb 14, 2014", "message": "(German speaker)\nAfter seeing countless atrocius german/french/italian code bits in forums (not SO) which were answered wrong or ignored I can't see a point in splitting the community, lowering overall quality and indirectly telling people \"it's okay, you don't have to learn english\". (I use english as a language to gain more knowledge not to deny my primary language, learning chinese seems just as tempting)\nFrench/german/italian\\brazil variable names kill puppies and limit viewership, there is no gain, at least go for chinese.\n\nBut elitism is just as bad. So the above paragraph is just another example of bad taste?\n\nI honestly don't know what the right answer is. But by going portugese you loose one thing: The ability to go back, go back to the mindset of uniting professionals on one webpage, instead the new goal is \"MORE CUSTOMERS\".\n\n(My guess is that SO is in for a cash grab because brazil is an emerging market for programmers.)"}, {"author_name": "Brian", "gravatar_hash": "04ec8758035b6ca3f6e1678f6f4d839e", "author_url": null, "date": "Feb 14, 2014", "message": "But the programming languages themselves are in English unless there are language specific versions of computer languages that I am not aware of?"}, {"author_name": "Jean-Francois", "gravatar_hash": "4637315b2c9e477b9da2a938f656f305", "author_url": null, "date": "Feb 14, 2014", "message": "It's a bad decision in my opinion, probably pushed by stakeholders in the company to publish more adds."}, {"author_name": "csdelozier", "gravatar_hash": "2234b091dd5e9206b26de8b51b5cf537", "author_url": "http://ohmy.dyndns.info", "date": "Feb 14, 2014", "message": "I think this is a great decision.  Being inclusive of an international community of developers opens up new lines of communication (and perhaps reputation earning opportunities for those who can translate excellent questions and answers to another language?)  Just the fact that they will be visiting the same domain name is going to lead to a bit of overlap.  Perhaps some Portuguese speakers aren't as comfortable speaking English, though they are capable, and so have never used StackOverflow for that reason.  Incentivise cross-translating both subsets of sites and there you have community involvement with less of the fracturing effect."}, {"author_name": "Paul S.", "gravatar_hash": "7962ef5ee5f1f24fd3da8b068a73ba4a", "author_url": "http://stackoverflow.com/users/1615483/paul-s", "date": "Feb 14, 2014", "message": "I can understand why this might make it easier for some people in Brazil, but I think the method is wrong.\n\nThe article mentions that many people may not be fluent enough in English to ask or answer questions, but are still able to read because they have some understanding of English. How are people from that group who don't speak Portuguese going to benefit from this? Surely English works as a better \"common\" or \"international\" language.\n\nIf the consensus is translations to certain languages are required, I think it could be better extended out of the revision, tag and points system than splitting the community.\n\nIf the choice ends up to press forward with this new Portuguese site, I think that there needs to be some system implemented where the questions can be marked as duplicates of questions on the English-speaking site, with the opportunity for users to translate the answers from the English site. Similarly, if it's not a duplicate, there could be a \"Translate this thread for StackOverflow\" link. This would mean two-way communication between the resources and at least would reduce fragmentation."}, {"author_name": "Herberth Amaral", "gravatar_hash": "e71567f551826c783efd8f91a577b43c", "author_url": null, "date": "Feb 14, 2014", "message": "As a native portuguese speaker, I think it is definetely a bad idea. And the author uses poor arguments to make an exception.\n\nYes you can expect that aspiring devs learn english. Our colleges already have a Functional English (just for reading) course. With a little study every day, we can manage to write in english in a short period of time. \n\nWhen you write code, you write it in english. When you search in google, first results tend to be in english. Dissociate english from programming (which I think the author's arguments tend to) is not just harming, but it is evil."}, {"author_name": "hagnat", "gravatar_hash": "33a206cdfb1a2d8cdf8b59014715b4ce", "author_url": null, "date": "Feb 14, 2014", "message": "Another portuguese speaking fellow here who doesn't approves this portuguese version of SO\n\nwhen i begun coding in Symfony - back in the days it just had released its 1.0 version - the documentation was poor, but people all over the world used it. In order for me to solve some problems using the framewokr i had to google a lot, and i frequently had to use tech blogs in english, french, chinese, japanese, russian and even thai once. It was painful.\n\nif these sites had decided to use english, it would have been a lot easier for me back then - even if my knowledge in the shakesparean language wasn't as good as it is now"}, {"author_name": "Daniel", "gravatar_hash": "d8b8e1243dea729820e65620ea253826", "author_url": null, "date": "Feb 14, 2014", "message": "As Portuguese I have mixed feelings about this. \n\nYou should be aware that this will be a Brazilian-only website, I've worked with several Brazilian developers and we use different technical vocabularies (e.g. \"Database\" in pt-Br is \"Banco de dados\", in pt-Pt is \"Base de dados\") and Brazilians have a tendency to adapt english words as verbs (to set -&gt; \"settar\", to scan -&gt; \"escanear\") while in Portugal it's much more common to use the correspondent Portuguese word or keep the english one. Don't know what's the case in African Portuguese-speaking countries.\n\nThere's nothing wrong with either approach but it makes it hard to search for answers that are made in a \"different\" Portuguese which may cause even more fragmentation.\n\nRegardless, I believe this new version will turn into a Brazilian-only stackoverflow and in Portugal everyone will still prefer to use the English one."}, {"author_name": "CQM", "gravatar_hash": "65da61e2d1068dce9bfe8999e3eb6ec2", "author_url": null, "date": "Feb 14, 2014", "message": "you couldn't name Satoshi Nakamoto?"}, {"author_name": "David", "gravatar_hash": "37e98fdde47fe75063d3db3f58a521e6", "author_url": null, "date": "Feb 14, 2014", "message": "Usually when a non-english speaker asks a question on SO, and the question is riddled with grammer mistakes, a member of the community will edit it to improve the clarity of the question.\n\nI think it's better to have all the knowledge under one roof and in one language. I'm completely biased though."}, {"author_name": "Victor", "gravatar_hash": "7e77c1330254ee7fd068e481f6ac47f2", "author_url": null, "date": "Feb 14, 2014", "message": "I think that the feature that makes SO stand above other places is its integratory character. It has become a point of reference for all. Teh high standard of the site information comes from a high concurrency, if you reduce the concurrency you reduce the quality. It's statistics. \nI'm not so worried about a reduction of the quality of the general SO but of the lack of it in the local versions. I think it will just become one more questions place in portuguese. \nWhen I want real answers I do not google in spanish, I google in English.... statistics."}, {"author_name": "Bharath Bhushan Lohray", "gravatar_hash": "4ff132d8ae25053b91318841a741fad5", "author_url": "http://bharath.lohray.com/weblog/", "date": "Feb 14, 2014", "message": "I would second the opinion of having translation tools assist non native speakers write posts in English. As bad as machine translation may be now, it will surely improve."}, {"author_name": "Jeff Loughlin", "gravatar_hash": "d781a145ffbdecc059bfe29a3ce9fb1e", "author_url": "http://stackoverflow.com/users/1703536/jeff-loughlin", "date": "Feb 14, 2014", "message": "I'm all for trying stuff out, but I'm kind of on the fence on this one.  For sure, I can see the benefit for the non-english speaking community, but at the same time I envision a lot of great questions and answers appearing on the Portuguese site that the english speaking community won't be able to benefit from.  The beauty of Stack Overflow is that, as you pointed out, everything is in one place.  Maybe there needs to be some mechanism to allow really good questions and answers from the portuguese site to to be translated and copied over to the english site."}, {"author_name": "jimmy_joyce", "gravatar_hash": "f58b4ded60d3516560ba1b1d180e3c22", "author_url": null, "date": "Feb 14, 2014", "message": "All the comments so far are in English. Might be interesting (and consistent) to offer the option of reading a Portuguese translation of Jay's post. Maybe then we'll get more opinions from native speakers, to balance all the eng-splaining."}, {"author_name": "schumacher574", "gravatar_hash": "2bdf121fc8c2f64e4049be5d11c1994b", "author_url": null, "date": "Feb 14, 2014", "message": "I disagree with this.  A translate feature would be much more efficient (auto-translate, or rewards system for user translations)."}, {"author_name": "koffiemoc", "gravatar_hash": "e54e5bdcbb56d62fce104fb0e21e9973", "author_url": null, "date": "Feb 14, 2014", "message": "Great idea! Why should a programmers community be biased in favor of only the english speaking people? Iḿ all in for equal opportunities. Being a great dev doesn't always mean being great in foreign languages.\n\nBad idea! With the new site(s) I still can't learn anything from the great Russian and Japanese and Brazilian devs mentioned in the other posts. \n\nI've got a great idea! Can't you just make this one platform that unites us all, where we all raise questions and answer in just _one_ language? Preferrably C, Python, Java, Erlang, eh wait...\n\nOK, I'm all puzzled. What should I think about it? Misschien weten mijn Nederlandse collega's een goed antwoord. Misschien is een wereldwijde gemeenschap die niemand buitensluit een onbereikbare droom."}, {"author_name": "Joseph B", "gravatar_hash": "a80b9a5a7d848509708dd2a13bbbc87e", "author_url": null, "date": "Feb 14, 2014", "message": "As a non-native speaker of English, my reading and writing abilities of English are far better than listening and speaking. It is because I learned to mostly read and write the language when I was young. However, for a very, very long time, I could not think in English. I always translated back and forth in my mind. I believe that we learn better in our \"mother tongue\". So, SO-BR-PT makes sense.\nOn the other hand, the criteria listed as to how Portuguese (or other languages) has been selected are very subjective, in my opinion. There are other Indian languages, besides Hindi, which could be candidates, too. So, just SO-BR-PT does not make sense to me.\nOn the other hand, the criteria is determined by SO owners as they deem it best. It's not my business to do it. As others pointed out, it is apparent that SO-BR-PT is motivated by economic drivers. Nothing wrong with it, I guess. SO just accelerated the evolution of the economy of the world. Fast forward, more technologies would arise out of Brazil. However, unless the language flows down to assembly language-level, it cannot become dominant. Another indicator of the dominance of a linguistic group would be when ATC'S at international airports would need proficiency in a language other than English, as it is today, or a different mode of faster travel is developed using a different language."}, {"author_name": "Godwin", "gravatar_hash": "a61318e25105fd9a7253f7d30f1bdb09", "author_url": "http://thegodwin.ca", "date": "Feb 14, 2014", "message": "This is great, however it will generate a lot of duplicate questions thus going against one of the principles of coding, \"Don't repeat yourself\"\n\nHow about something along the lines of awarding reputation for translating questions and answers?\n\nI'm currently working on the same issue on a community site I'm building. We're working on a translation engine that shows copy in the original language but anyone with translation privileges for a specific language can simply click on text and translate it."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Feb 14, 2014", "message": "Building proper communities for other languages is the only way to go. Naysayers - would you rather have a competitor conquer the foreign markets while SO keeps \"everything in one place\", telling the rest of the world to learn English?   \n\nRelying on automatic translations is insane, and a borderline insulting suggestion really. I bet none of you who suggested that have spent any significant time dealing with auto-translated content. Google Translate is great for a lot of things, but its results are garbage WAY too often for meaningful everyday communication. \n\nThe idea of having language \"tags\" within SO and translating content on one site sounds intriguing at first, I can think of few more depressing things than being a member in a SO language community where all content is generated by translating stuff from and to English. How is an actual community supposed to emerge from that?\n\nI don't for a second buy the argument that there's going to be fragmentation - the site has seen nothing but growth since its inception, and several splits (Programmers, DBA.SE, etc.) didn't put as much as a dent in its statistics. Plus it's a chance for new users to gain significant reputation, which has become very difficult on the English site. \n\nMy bet is this is going to end up in massive further growth with very little damage to the existing community, or none at all - and English SO is always going to be biggest and baddest place of them all, so no worries...."}, {"author_name": "David Conrad", "gravatar_hash": "e0d19b3d2b57ab336d78a3f15a69178b", "author_url": null, "date": "Feb 14, 2014", "message": "&gt; Without Googling, name any famous developer from Japan.\n\nHiro Protagonist. :)"}, {"author_name": "Sam", "gravatar_hash": "d6d30aeeb112bede0edbac90604c67e1", "author_url": null, "date": "Feb 14, 2014", "message": "This idea will cause fragmentation. Finding answers to the questions that have been resolved would be much more difficult. While it this idea may make it easier for programmers with the same language to communicate better, it would be horrible to find and comprehend answers for the same problem, from another SO language site. Most people understand enough English to get by, but everyone does not know all the languages out there. Besides, current SO is very comprehensive and to make other SO languages catch up to it, is impractical. Having multiple languages segregates the community to smaller sub communities and weaken SO"}, {"author_name": "Warren Dew", "gravatar_hash": "3e83e511e401770207ffbb0d31b8ffb4", "author_url": "http://psychohist.livejournla.com", "date": "Feb 14, 2014", "message": "An equivalent of Google translate would be fine, actually, and is really the way to go.  I use Google translate all the time on Google+, and it's no problem figuring out what the poster meant.  For a more specialized use like discussion of programming, the translation could be even better - and far better than fragmenting the global programming community, which having multiple language sites inherently does."}, {"author_name": "Taosique", "gravatar_hash": "ba75758057c9dc9f5ae5b33714148bf5", "author_url": null, "date": "Feb 14, 2014", "message": "Wow, great! Looking forward to see SO versions in Somalian, Sanskrit and Yucatec Mayan."}, {"author_name": "luciano", "gravatar_hash": "f2e31f2e34294ba3efce5cb0c6c98a5c", "author_url": null, "date": "Feb 14, 2014", "message": "\"talk is easy. show me the code\" (in portuguese!)"}, {"author_name": "Déborah", "gravatar_hash": "6a548885d4201e70438c5ee0d1961efa", "author_url": null, "date": "Feb 14, 2014", "message": "Obrigada!"}, {"author_name": "Pierre Collignon", "gravatar_hash": "cf13158b57b0fa8bab564c600af9920f", "author_url": null, "date": "Feb 14, 2014", "message": "Well as a french native speaker, I'm saddened SO has taken this path. \n\nIt's already hard enough to learn english, to make clear code with a mix of you native language for business logic and english for technical parts, to force everyone into the big world, if now we lose the portuguese, then the russians and the chinese, whom will we speak with and learn from ? Americans, Brittons and the rare courageous europeans trying to learn english ? \n\nImagine Microsoft translating Excel in dozens of native language rendering their software nearly unusable when you cross a border ?! Oh wait, they too thought that the Turkish and Portuguese were not able to learn english !"}, {"author_name": "l33tz0r", "gravatar_hash": "a878e4a112437be7a3c8c1f2f4c025c4", "author_url": "http://www.azerty0.ironie.org/", "date": "Feb 14, 2014", "message": "Can't wait for the French version...\n\nTunat0r: \"svp quelqu'un sait comment faire une addition en C++ ?\"\n\ndarkl33t: \"j'ai 15 ans de developpez.net derrière moi, alors je sais de quoi je parle !  installe donc boost au lieu d'essayer de réinventer la roue. Cordialement. A bon entendeur salut.\"\n\ndugenou.émilien: \"Salut, mon pote qui travaille dans une SSII me dit que si c'est comme en visual basic, il suffit de passer par les arc-sinus.\"\n\nwar0x: \"sa existe pas sa C+ de koi tu parle lolllll\"\n\nEndless hours of fun and amusement."}, {"author_name": "Uceda", "gravatar_hash": "9f5e01964c255efafeaece8fe3eb6467", "author_url": "http://www.ucedaenglish.com/", "date": "Feb 14, 2014", "message": "Ya know, I've always wanted to learn Portuguese. Beautiful language. My sister and her husband speak it, actually. I wouldn't mind that at all..."}, {"author_name": "Michael Scheper", "gravatar_hash": "c0005b5df967c6d043ecf0c6ae0053b7", "author_url": "http://www.michaelscheper.com/", "date": "Feb 14, 2014", "message": "If SO does this well, such as creating a means for linking to similar content in different languages ala Wikipedia, it would be a win for developers everywhere.\n\nIn any case, I hope there's some level of pisstaking in this post, and that Stack Overflow didn't really assume that all developers of merit are proficient in English. I would've expected a more inclusive worldview from Joel, not just because of his history, but because Stack Exchange sites are amongst the less frustratingly US-centric on the web.\n\n(e.g. Although SO formats dates in month-day-year order, it at least uses an alpha month. It's a low bar, but in general, US sites enlightened enough to reduce confusion for non-US users also eventually provide content in different languages.)"}, {"author_name": "Brett Zamir", "gravatar_hash": "4c750582e23fcf068bdde51cc50416d1", "author_url": "http://brett-zamir.me", "date": "Feb 14, 2014", "message": "I am happy that you have identified the fact that there is a problem with forks, so to speak, even if you feel it is worth it to make one. I can see arguments on both sides of opening up to other languages (kind of like the benefits and disadvantages of creating an independent fork for any software project), but unlike other software where others can relatively quickly pick up the conventions of the project and carry it forward, it is not so easy to learn a new human language and carry it forward with the same proficiency. \n\nI think it is past time that web developers recognize that our solution will not come by fiddling our thumbs and waiting for English to take over (because as you aptly point out, it has not taken over, certainly not yet by a long shot), yet we ought not be content in the long term with the problems that you have aptly summarized with there being a certain kind of unproductive diversity (akin perhaps to un-merged forks in software, incompatible licenses, etc.) This requires coordination at the international level. There is no other way. We need to prompt our leaders to choose an official world auxiliary language, a language to be taught in addition to local or national languages in each school of the world. It could be an existing language like English, a constructed one like Esperanto--whatever will get agreement. If English is as popular as some people believe, it should get the necessary democratic vote, and if not, we ought to get started on it now!\n\nSuch an international agreement wouldn't depend on us sharing all of the same values with the other voting countries. In fact, it is hard to gain some shared values if there is no common language. This needs government intervention, but not just one or two nations. Yet it would be an economic, scientific, and cultural boon to all countries.\n\nCountries such as China and Israel chose a language and were able to achieve greater national unity and consequently development within themselves by requiring by law that a national standard language be taught to their people where one did not exist previously.\n\nIt is time that we of whatever country recognize that \"our people\" ought to go a step beyond our national unity to the whole world, and we developers ought to be at the forefront of an understanding and promotion of this, given that so many of our collectively shared coding contributions or sharing of knowledge of which we are all benefactors comes from people from diverse backgrounds already.\n\nHaving a common language available because of early education in a common international language around the world, will not be preventing healthy diversity, it would eliminate the ultimately needless forks of such sites as this (though again, I'm not disputing the need for such a site right now pending such an international agreement and dissemination of the common language). It has to be taught early enough in enough schools around the world so that the language is indeed common enough; otherwise, it is only reasonable that people will want to share their knowledge in a language more familiar to them."}, {"author_name": "Brett Zamir", "gravatar_hash": "4c750582e23fcf068bdde51cc50416d1", "author_url": "http://brett-zamir.me", "date": "Feb 14, 2014", "message": "One more point on this...\n\nWe're wise enough to see that we need web standards to avoid having to express a few common APIs in a handful of different ways, yet we don't recognize that we can avoid future generations having to write or speak from a repertoire of tens of thousands of possible words in thousands of different ways (i.e., different languages) by gaining international agreement on this issue.\n\nImagine the quality of tutorials we'd have, the quality code libraries, and of course the benefits wouldn't be limited to us as developers!"}, {"author_name": "rafek", "gravatar_hash": "7c3b45d8f867a5e405f8bb54424e2fdd", "author_url": "http://eloquentcoder.com", "date": "Feb 14, 2014", "message": "Nice and unexpected move if it comes to yours assumption from before couple of years. But everything changes. :) \n\nAs soon as SE 1.0 was launched we decided to start Polish version of SO (end of 2009) which was just localised using javascript and then (after SE 2.0) we migrated to OSQA platform. Why? As discussed in on of our threads (http://devpytania.pl/questions/498/czy-nie-mozna-po-prostu-uzywac-stackoverflow [polish]) there are still plenty of developers which are not as fluent in english as it may seem - i.e. they might be able to communicate, read docs or write \"something\" but they might have issues with expressing precisely their thoughts when describing a problem or so. There are always beginner-level developers who will benefit from localised version, etc."}, {"author_name": "tailorsmith001", "gravatar_hash": "564c5062df0e9120a758dad964da40ef", "author_url": "http://nopiy.com", "date": "Feb 14, 2014", "message": "i think we cant eligible for speak English as well as we think because every specific region have it's local language."}, {"author_name": "Ian Kemp", "gravatar_hash": "7c60c8096dc852aae69271d15fcd3682", "author_url": null, "date": "Feb 14, 2014", "message": "This is a really poor idea. The language of technology, the Internet, and programming languages is English. This is not something that is going to change in the future, nor is it something that should change, because then the whole issue of a person from country A not understanding a person from country Z will repeat itself - except in code.\n\nIs it fair that non-native English speakers, or those who don't speak English at all, are excluded? No. But life isn't fair, and it isn't SO's responsibility to make it fair. And fragmenting the site in the name of \"fairness\" is a terrible mistake to make."}, {"author_name": "Simon Mourier", "gravatar_hash": "e863fce93163aa4c79fd4e527343c719", "author_url": "http://www.softfluent.com", "date": "Feb 14, 2014", "message": "I would be very interested to know how you measure these two criteria to determine the best languages to choose: \"Have large, strong communities of high-talent developers, where a meaningful percent of them aren’t comfortable enough to participate in an English-only community\". Do you use stats from your sites?"}, {"author_name": "Lashane", "gravatar_hash": "f1f73deb5983ac46af2a74732752292e", "author_url": null, "date": "Feb 14, 2014", "message": "Very bad idea and it really can kill stackoverflow's the only main idea...\n\nFrom the top of the head:\n\nEdsger Dijkstra, Dutch\nSergey Brin, Russian\nMakoto Matsumoto, Japanese\n\nand Portuguese? 3% of the world population? Maybe it's 1st April joke? then just sync your watches with any ntp server"}, {"author_name": "fireant", "gravatar_hash": "ef390c1dc02d376a8dd714a958f8bedf", "author_url": null, "date": "Feb 15, 2014", "message": "How many widely used fremeworks or apis are not documented in english?\nHow many great programmers that i saw in the previous posts didnt know english well enough to express them selves? None, because if they didnt learn english (or werent forced by the community) we would never know about them, we would never know what great things they built. It is mutch easier to learn english than to learn all the languages around the world just to understand the community and to read documentations.\n\nPlease, please - do not split the community, do not support developers to use their native languages instead of english for code.\n\nPS: im not native english speaker either but this what you are doing is just terrible, not just for english internet but aswell for those you are triing to aid."}, {"author_name": "Muzietto", "gravatar_hash": "1ba7bffbe41ca39353b6f8bbfd4624a8", "author_url": "http://www.faustinellli.net", "date": "Feb 15, 2014", "message": "Here in Italy I know lots of people who do not consult SO nor other fora in English:\n- they don't know English well enough\n- they aren't eager about learning a foreign language - why bother?\n- they aren't eager about learning to program better - why bother\n- they don't program well enough\nIn other words, eagerness to learn gives you both English and programming skills.\nThe asymmetric position enjoyed by the english language in modern technology is the result of an historical trend started centuries ago. Going against it is either a waste of time or a political statement.\nSuit yourself."}, {"author_name": "Lee", "gravatar_hash": "89f7cf4909919ffd0b4f7f584a9f1305", "author_url": null, "date": "Feb 15, 2014", "message": "'We are aware that, “Let’s all try speaking speaking different languages!” hasn’t always worked out for the best.'\n\nDid you mean to put speaking there twice?! ;-)"}, {"author_name": "Salvador Dali", "gravatar_hash": "ad34ec01c3fb46c99d908890873f05c0", "author_url": null, "date": "Feb 15, 2014", "message": "Any famous developer from Russia? Are you kidding? You never heard of \n- Sergey Brin? Try googling him :-)\n- Igor Sisoev? Have you heard of the thing called nginx?\n- Karatsuba? Have you learned algorithms with fast multiplication?\n- Kaspersky? Does not ring a bell? May be antivirus?\n- Levin? Yes that guy with Cook who developed computational complexity theory. Surely he does not deserve to be known by you.\n- Guys who created Algol, far, 7-zip where also from Russia.\n\nWho was the guy who created Ruby? Was not he Japanese? Just because you or I can not remember him because of his hard pronouncing name, it does not mean that he does not exist."}, {"author_name": "Hugo", "gravatar_hash": "2680d5923ec80216675b9a06c5af0c9f", "author_url": "http://mexxer.pt", "date": "Feb 15, 2014", "message": "Why not all be reasonable and speak in Portuguese? All of us, why not? Do you know how many people in the world speak in Portuguese? Don't be stupid, please."}, {"author_name": "Hugo", "gravatar_hash": "2680d5923ec80216675b9a06c5af0c9f", "author_url": "http://mexxer.pt", "date": "Feb 15, 2014", "message": "http://en.wikipedia.org/wiki/List_of_languages_by_number_of_native_speakers\n\nFollowing your thoughts, the Stack Overflow must be in Mandarim or in Spanish, not in English."}, {"author_name": "Seagull", "gravatar_hash": "269202f60fbab38c40ca1b34a31bb92b", "author_url": null, "date": "Feb 15, 2014", "message": "I'm from Russia, and I'm highly against this initiative.\n\nWhy?\n\nThere are too much documentation, good books and articles, there aren't translated to my own language. And it's normal and only applicable way to be.\n\nProgramming is in English and it's too fast advancing, to be translated to any other language. \nAlmost every on-edge technology should be documented in English, otherwise it will be lost, as major part of community UNDERSTAND English. Maybe, they can not write well, as I can't. But learning programming (in which SO help's me) includes English learning.\n\nMaybe there is a lot people speaking oher language, but how much of them is programmers? \n\nI can't name any good programmer in my circle, that can't ant don't want to understand english."}, {"author_name": "Rolf Riehm", "gravatar_hash": "691b762328315e86e62f457d1e349a5b", "author_url": "http://none", "date": "Feb 15, 2014", "message": "I have enterd this page by accident. I have no idea what you are doiog. But  you should  remember two words: UNITARIO. This is a simplified form of Spanish. But the Verb complex is omitted or used from Esperanto: There are no irregularities of the verbs. The vocabulary is a unified form of the Romance languges, partly from Interlingua and partly from Spanish. IO have neve contacted \"Bill Gates\", but  I know that he has similar plans together with the University of Madrid.\nPlease look in Google for a \"Eugen Wüster\". He has demanded a \"Therminologie Schlüssel\". All scientific work on all universities oin he world  should be in the form of a catalogue. Or a dictionary. UNITARIO uses the ideas of  several ontelliogent persons: Ogden reduced the number of words of the English language from 200.000 to 2.000. Interlingua has standardized  the Romance vocabulary. And UNITARIO has made a real language out of it all. So hold your breath and forget  about Portugese.Regards &gt;Pinguin"}, {"author_name": "Pierre Collignon", "gravatar_hash": "cf13158b57b0fa8bab564c600af9920f", "author_url": null, "date": "Feb 15, 2014", "message": "As Seagull said, what you propose is to tell people that it's bad to write badly formated questions on stackoverflow, but it's totally okay to write them into a cryptic language no one understand ! \n\nProgramming has to stay in english, or the next step will be to go Microsoft-style and make a French or Russian programming language, with every glorious beginner jumping into the trap ! \n\nOh how much I wanted at 16 to have a french programming ! And how much I know now what a fool I was ! \n\nWe're standardizing the world, why can't we standardize ourselves too ? We're trying to make clients all over the world accept the computer way of doing things and when faced with a little division, we divided the biggest information exchange website to unstandardize our community and \"at last\", with a glorious blog post, we fill joy seeing  the disintegration !"}, {"author_name": "Joshua", "gravatar_hash": "f81685ba2a5040485725e7e078d157b6", "author_url": null, "date": "Feb 15, 2014", "message": "Here is the reality. The industrial revolution was first in Britain than in America. The computer revolution was simultaneously in Britain, America, and Germany.\n\nHaving actually learned Spanish, I can say it is unsuitable for tech writing as correct grammar garbles higher order logic. I would not be surprised to find the same true of Portuguese.\n\nWe've already reached critical mass in English. Try this experiment (requires a native speaker): change your system to Portuguese, cause some .NET exceptions of the kind \"the programmer screwed up\" or \"networking trouble\", and search for their error messages using any search engine. See if you get comprehensible explanations.\n\nIt's basically come down to we need the return of error codes and formal symbolic logic if we want programming to be multi-lingual, and error codes are bad for the users."}, {"author_name": "Jonathan", "gravatar_hash": "f120898eddf14593923f2649f58b3367", "author_url": "http://ecommerceenable.net/", "date": "Feb 15, 2014", "message": "Yet another \"standardize the world\" crusade.  People who do not take the time to learn the last 10,000 years of history will always make the same mistakes.  It is the cycle of things.  If it weren't so sad, it would be comical.  So begins the self-inflicted downfall of Stack Overflow.  It will take about a week for a new site to replace Stack Overflow.\n\nComputer Science is an amalgamation of only three things:\n\n1. Conditional branching\n2. Memory allocation\n3. Basic arithmetic\n\nThat's it.  Yes, really, that's it.  Everything else is an algorithm, and requires YEARS of diligent study and practice, IN ENGLISH.  Learning to become a real programmer takes as much study to become a real doctor.  Medical schools do not teach Organic Chemistry in non-English, and America does not accept medical degrees from non-English speaking countries.\n\nBut let's take the devil's advocate: if you think cowboy coding (I call it meth-lab programming) is perfectly fine, then the flip-side argument is that, based on the three elements mentioned above, the only English one would need to learn to program are the following words:\n\ndo\nwhile\nfor\ngoto (yes, goto - it's just a jump assembly instruction)\nvar\nmalloc\nand the arithmetic operators, which are language independent.\n\nA whooping six words in English.  If someone can't learn six words in English, he should not be programming.\n\nAnother thought - China did not ask for our entire manufacturing industry.  We westerners just gave it to them.  For free.  Now programming.  For all our intelligence, we western people are very naive and stupid.  So now we will give them the SQL language without requiring them to understand the algorithm of 'data-integrity'.  Fabulous.  Great idea.  Now we can have cheap software to go with our cheap blenders and brooms.  Westerners are the only ones willing to completely destroy the livelihoods our fathers built for us, for no reason at all.  And we pay for it, to boot.  No other culture acts this way.  Not one.\n\nAnother thing: for Westerners to suggest it is \"our\" job to enlighten the rest of the world is to suggest the other world's cultures are incapable of doing it themselves.  That seems to me to be teetering on the big 'R' word.  And don't kid yourselves and pretend that's not what you're doing.  You are in fact 'Alexander-the-Great'ing, period.  There is nothing stopping any other culture from creating their own Stack Overflow.  It's just an electronic bulletin board.\n\nOne other thought to consider: communism always follows capitalism.  This is the universal life and death of things in our world.  Stack Overflow exists in it's current state because people stumbled upon it and together aggregated it, invisible-hand style.\n\nSo now you are going to \"force\" a new incarnation of something that was made great by capitalism... hmmm... haven't seen this before...  Stack Overflow is a B. Fuller geodesic dome, held together by English.  Nobody forced it.  Just watch what happens - taking away English from Stack Overflow is like taking away the coal from a fire to get more energy.\n\nRemember, \"diversity\" is literally the opposite of \"unity\", both in parlance and in practice.  If Stack Overflow wants to sow the seeds of it's own destruction, by all means, commence.  This is a great opportunity for someone who has wanted to create a new programming bulletin board."}, {"author_name": "Adel", "gravatar_hash": "9b63d58c186cb09f63a19b07a1be62ae", "author_url": "http://www.khanacademy.com", "date": "Feb 15, 2014", "message": "Supply &amp; demand I guess. Who's to say that a native-English speaker may find a gold-nugget in a non-English-language site.\n\nPeople say \"translate\" , but put yourself in their shoes. It's an extra hassle. They have a great programming answer they want to bang out quickly, then do laundry. Not necessarily so easy to translate in a good way.`"}, {"author_name": "marcanton.io", "gravatar_hash": "d7575e1528b1beab922ca4113843d03b", "author_url": "http://marcanton.io/", "date": "Feb 15, 2014", "message": "Interesting and controversial. \n\nIt's nice to see SO break the rules and experiment.\n\nI am obviously biased because while I don't speak Portuguese, it's so readable that this SO initiative means unlocking a lot of additional answers I would not have had access to.\n\nIt's also very instructive because it embodies the very problem stated at the beginning of this post, i.e.:\n\n&gt;Even non-native speakers who are fluent enough to read posts in their second or third languages often aren’t comfortable enough to write in them.\n\n.. while I can read Portuguese because of sheer luck (my native language is close enough), there's no way I can write anything in Portuguese. I can read, but not participate. So that's how people who can't write in English feel. \n\nKudos for trying, experimenting instead of guessing, and being awesome."}, {"author_name": "Ad", "gravatar_hash": "3cf63bb95f951e35ffcab218ae0b5336", "author_url": "http://www.didge-it.com", "date": "Feb 15, 2014", "message": "I once had to take over a project from a French speaking collegue and found out that he had named all his methods, functions and variables in french... \nSince that moment I refuse anything coded in something other that English!"}, {"author_name": "Dan L", "gravatar_hash": "b1d1e99138869574d7fe5b8027b43429", "author_url": null, "date": "Feb 15, 2014", "message": "I think everyone who codes enough will encounter the situation where the comments are entirely absent or gibberish left over from a very early segment of development, and you just read the code, and a wordless but highly structured thing begins to form in your mind. What code does in my head is not English, unless I'm mining some piece of documentation to find what I want.\n\nI don't think I would have any trouble getting most of the meaning out of a question-and-answer sequence written entirely in Portuguese, if I were moderately informed in the problem space. I would read the code, and reconstruct, imperfectly, what the questions and answers were.\n\nWhat would help would be the ability to search for answers based on automatic tags generated from the code snippets (API symbols would be a good place to start). Then I could use the semantic content of the code itself to find answers in other languages that I didn't speak.\nI think this feature could also help people that don't speak English very well yet.\n\nIt would also help mono-lingual English speakers to access the technical problems of Chinese and Brazilian programmers, albeit imperfectly, and maybe expose those English speakers to wider markets."}, {"author_name": "Murilo Queiroz", "gravatar_hash": "5720a48974a9809942b90d902a5634f7", "author_url": null, "date": "Feb 15, 2014", "message": "I'm an active \"member for 5 years, 5 months\", and a professional developer since 1998 - I was working with international teams, in English, even before finishing my graduation in Computer Science. I'm pretty sure that English IS extremely useful for any developer, and I basically never hired anyone who didn't read English very well, because they would be part of foreign teams. \n\nBut the main point here, in my opinion, is \"It’s almost impossible to feel like part of a community if you’re not highly proficient in the language\". It's not a matter of doing the job well - I can write correct and clear documentation (or questions and answers in SO), but I don't feel as comfortable as I do when discussing anything in my native language. I always sound too formal, too strict and I have a hard time making even simple jokes in English - a lot of people think I'm a very serious and rigid guy. \n\nYes, there will be a lot of newbies asking trivial questions (or asking for homework answers). I'm not sure if pt.SO will work. But I think it's worth a try, because Stackoverflow is more than a repository of answers."}, {"author_name": "ML", "gravatar_hash": "662b7b0174522062d48431846f7f445e", "author_url": null, "date": "Feb 15, 2014", "message": "I like this idea, yet hate it at the same time. Many people come to StackOverflow from the business world as well, and the language of business in the US is English. However, increasingly, and unfortunately for the unemployed in the US, programmers are in other countries where English is not the native language. That's not really their fault in the slightest, however I've seen first hand where these language differences cause issues with product development and QA.\n\nWhat is my point here? Having some place to go for those who speak different languages is an awesome idea. It's good to be part of a community that can all speak at the same level and communicate their ideas effectively. What this does not do, though, is give the necessary English experience needed for the international business world in regards to development. Learning how to ask a question concisely and accurately is key to project success on time."}, {"author_name": "Mike Rodent", "gravatar_hash": "de73cca7e15d1d8feb243f3c125dc3ca", "author_url": null, "date": "Feb 15, 2014", "message": "Like the idea... I am UK (not US English, so smiled at one Portuguese poster's complaint that your \"Portuguese\" site is in Brazilian, not Portuguese), but I've lived in France quite a lot.  To penetrate the humour and non-technical jargon and cultural references of another culture is frankly the work of a lifetime, even if we Anglo-Saxons tend to assume that Kazakhs (and others) are beginning to come round to the idea that Borat is, um, really funny, and that they should give up their \"backward\" humour and culture as a result.\nBut I also love the idea of centralising all the ideas... given that English is indeed the \"backbone\" language of IT until further notice, might it not be a nice idea to have sort of \"linkers\" who scour their own SO sites (Portuguese, Mandarin, Swahili...) for knowledge that is currently absent from the original English SO \"knowledge base\"... and make a contribution (with due attribution)...?"}, {"author_name": "Adam", "gravatar_hash": "8d50b5a0f838e3ba49b4ac5bb3aa5ff7", "author_url": null, "date": "Feb 15, 2014", "message": "\"we expect almost every question asked on the Portuguese site to also be asked (and answered) on the English site.\"\n\nI'm confused. \n\nBasically we're knowingly duplicating all the content on stackoverflow into a different language? If we are already expecting that, why wouldn't we just translate the current questions and answers to whichever the users comfortable with? I obviously know that translation services aren't perfect, but I believe that it would be much better to aggregate all the data in 1 place for everyone to use, rather than eventually ending up with 12 different duplications of the same exact site. This makes little sense to me."}, {"author_name": "Alice", "gravatar_hash": "6d17ed3a4156af5b594790c8049ba749", "author_url": null, "date": "Feb 15, 2014", "message": "&gt;&gt; Without Googling, name any famous developer from Japan. Or China. Or Russia.\n\nYour limited knowledge is not an excuse for wide generalisations.\nThere are great developers even if you are not aware of them."}, {"author_name": "Alex", "gravatar_hash": "617c3a946e2d5578509b870b57803389", "author_url": null, "date": "Feb 15, 2014", "message": "Todo el mundo deberia aprender le mismo idioma . El lenguaje es una barrera que debeos superar de una vez por todas"}, {"author_name": "ian", "gravatar_hash": "08ad36ba781854fc09658120b064cf0d", "author_url": null, "date": "Feb 16, 2014", "message": "I quote Alex (in english) (I'm italian).\n\"Everybody should speak the same language. The language is a barrier that we, as humanity, must overcome once and for all.\"\n\nYour choice is anachronistic."}, {"author_name": "Joshua", "gravatar_hash": "f81685ba2a5040485725e7e078d157b6", "author_url": null, "date": "Feb 16, 2014", "message": "@Alex:\n\nIf so, sort through the ancient languages: Latin, Greek, Aramaic, Hebrew, and their contemporaries if they are still known to the land of the living, and find one that can handle higher order logic. If your choice has the same artifact as Spanish where a double negative is still a negative, it's right out.\n\nDabble not in Chinese, nor any other language for which you cannot make a one keystroke-one symbol keymap. Any such choice is doomed."}, {"author_name": "Filip Dupanović", "gravatar_hash": "ef09ee2a5aaee27f3630e1842f30fbac", "author_url": null, "date": "Feb 16, 2014", "message": "This is insane!!! But, so was launching SO, so these familiar feelings must mean your doing it right. \n\nThank you, this was a much needed incremental step towards making the world a better place."}, {"author_name": "Imad Nabil", "gravatar_hash": "6ed96e38462eff562f07f39e68ba5727", "author_url": null, "date": "Feb 16, 2014", "message": "Although this is a controversial decision as obvious from the previous comments, it is worth a try.\nMaybe optional translations made by users on SO's questions and answer would have been better, especially if you encouraged the translation of famous questions at the beginning.\nAlso it would be an idea to give the user the ability to write in other languages, but it should be translated to English first (by any user) before answering. Since as you said, a lot of users can read in English but not write in it."}, {"author_name": "Frank Ruperto", "gravatar_hash": "3efd6e727a5f3995543f184e1b2058a3", "author_url": null, "date": "Feb 16, 2014", "message": "Most developers in Non-English speaking locales can somewhat read, write or speak English, as virtually all development languages, tools, documentation, etc. is in English. So, I would keep SO in English. Let them adapt to us, the majority. Most developers in English-speaking locales cannot read, write or speak other languages. I'm one of the exceptions, as I am bilingual (English/Spanish) and have developed most of my applications with Spanish UI's. If you insist on launching SO in a language other than English, do it in Spanish becuase it's a language that the Portuguese, Italians, French and other Latin-based languages can easily understand!"}, {"author_name": "Adam", "gravatar_hash": "6f538965cb5de93a049ceee34aabfa30", "author_url": null, "date": "Feb 16, 2014", "message": "Surely the reason there are a lot fewer non-english speaking programmers is that all programming languages are in english? There is no ```Sistema.fora.impressãolinha``` only ```System.out.println```..."}, {"author_name": "Name", "gravatar_hash": "db863db0e6dfd5b032b5a8c440c7f0ca", "author_url": null, "date": "Feb 16, 2014", "message": "There's a reason sites like phphulp.nl are still visited a lot; things become a lot easier to understand when they're in your native language. When I started to learn to program at an age of 13 I could understand general English reasonably well, but I couldn't ask a proper question and explain my problem well enough to make it pass the SO requirements. So I went to the site I mentioned earlier and asked there and got answers in my own language that I could easily understand and that make me feel like a part of that community. I contributed to the site by helping others and writing some simple articles and it was a good experience for everyone.\n\nSure, providing different languages will create separate communities but at the same time the people part of these communities will feel at home. I doubt many regular English-SO visitors will be making the switch and I believe this will just open the doors to the people currently looking at other services in their own languages.\n\nTherefore I'd suggest providing more languages than just the handful suggested in the original post. People will still head to the English SO for the answers that can be found here and this just expands the reach of SO."}, {"author_name": "StackExchange is down", "gravatar_hash": "6f85f76fbba195bb32b1115cb2ec7475", "author_url": null, "date": "Feb 16, 2014", "message": "StackExchange.com and the other site in the network have been down for more than 30 minutes."}, {"author_name": "Jason", "gravatar_hash": "bfdbab220fdb86245e0f7d1e20e41daa", "author_url": null, "date": "Feb 16, 2014", "message": "English is the global language of commerce, business, even specific things like aviation, in situations where speakers of multiple languages have to communicate on common grounds. I guess I don't really see an issue in having English-only SO. Or just switch it all to Spanish or Chinese, or whatever. Picking a language that readers are most likely to know (or eventually learn) keeps the knowledge base as a central hub. Forking off different languages will only lead to an increasing rift over time. Not to mention \"Hey you have a Portuguese site can we have German / French / Russian / etc.?\" Once you take the initial step of creating a language-specific site, you *will* find it easier to create more later, and eventually, you've strayed too far from the goal."}, {"author_name": "Franck Dernoncourt", "gravatar_hash": "5a151713b9eae8dc566f5957acee3475", "author_url": "http://francky.me", "date": "Feb 16, 2014", "message": "So much time wasted supporting different languages. The only exception I could understand is Chinese as it is radically different from English and widely used."}, {"author_name": "Kevin", "gravatar_hash": "b203650ef6ce3f6632422ed973047760", "author_url": null, "date": "Feb 16, 2014", "message": "English is mandatory for the developer who want to get the latest information in this area."}, {"author_name": "CJ Dennis", "gravatar_hash": "199625c45137a52fb9cf4cf3890b8a0b", "author_url": null, "date": "Feb 16, 2014", "message": "Re: \"one canonical set of answers\"\nWhat would be fantastic would be a set of \"super answers\". Duplicates are inevitable because the search terms one user enters will not necessarily match an already answered question. However, if the contents of duplicates are edited together by an expert covering the salient points and then the original questions are linked to the \"super answer\" it should reduce further duplicates as each one increases the chance that a search will find the relevant answer."}, {"author_name": "kazuho", "gravatar_hash": "a1f8ed12fefd7759ef8838e62ee409a6", "author_url": "http://blog.kazuhooku.com/", "date": "Feb 16, 2014", "message": "Great move!\n\nAs a Japanese, I know many highly-skilled programmers who only read StackOverflow but never post answers.  It is because using English is hard for them.\n\nThe fact is that many programmers in Japan exchange their knowledge using other services that support Japanese instead of using English on StackOverflow.\n\nAs pointed out by this blog post, such situation is not optimal. IMO it would be better for StackOverflow to support multiple languages so that people can at least _know_ that some kind of knowledge is being shared (so that they could _try_ to understand it, by using machine translation or whatever)."}, {"author_name": "Frank Ruperto", "gravatar_hash": "3efd6e727a5f3995543f184e1b2058a3", "author_url": null, "date": "Feb 16, 2014", "message": "To summarize my earlier comments: If non-English speaking developers learned how to develop with english-based syntax, then why not learn the English language. This way we all get to share more content and don't have to worry about maintaining additional forums, which Stack Exchange seems to excessively proliferate!"}, {"author_name": "ninjalj", "gravatar_hash": "9e8b0cb8bd6ac60d9cda79b163ced923", "author_url": null, "date": "Feb 17, 2014", "message": "Kudos!\n\nAs a Spaniard who started programming at 10 in BASIC, I can confirm that you don't need to understand English to program. I didn't need to know the English meaning of IF, WHILE, or, for that matter, WEND: I just needed to know their BASIC meaning.\n\nAs attested by all those badly translated arcade games, being a great programmer doesn't imply having a great commandment of the English language, cf: \"All your base are belong to us!\".\n\nNor is English needed, many local-based Small and Medium sized Businesses can benefit from software expertise, without requiring their business or software processes to be conducted in English.\n\nAlso, I don't see how creating new localized versions of SO can fragment the community, people fluent in English will continue to use the bigger site, while people who didn't participate before in SO will be able to do it. Some people will participate in both communities, transferring knowledge between them.\n\nMany people have shown strong opposition in these comments; all I can say is, pay no attention to the nay-sayers.\n\nMany seem to understimate the effort required to learn a new language to a fluency level that allows effective communication. It can be really hard for native speakers of non-Indoeuropean languages. People should try to learn a language from a different family before so happily proclaiming that everyone should learn a particular language.\n Some of them should also think twice before making such ridiculous claims as \"Spanish is unfit for technical writing\", which I find untrue, offensive, and in bad taste.\n\nThose ones suggesting automatic translation have obviously not made much use of those services. Many times they just give plain wrong translations.\n\nReally, I don't know what kind of elitism, xenophobia, and self-hate make people so vehemently comment against pt.SO, but I should make you know that I think you are on the right track, and this is a welcome change.\n\nBTW, I was kind of surprised to not see French in your list of potential SO l18ns. It seems to me there is a lot of non-necessarily-English-speaking talent there."}, {"author_name": "Victor", "gravatar_hash": "94a3663b015681f74b204a137fa0c8f5", "author_url": null, "date": "Feb 17, 2014", "message": "Brazil is a quite peculiar case... I will try to explain why there is a chance of failure and why it's still worth a try. \n\nFirst of all we are not an old and fully 'developed' country. Our story really begins around 200 years ago. Before that we were just a colony or a \"country for few\". Why does that matter? This history had a great impact on our education and english is still a privilege of few (it doesn't reach 5% of the population). The english level you have to reach to start understanding the required technical language for programming is also a challenge for most of the people (probably less than 1% of the population).\n\nNow some may argue that if they want to be a developer, then this person should just learn english first. Well, I'm not sure people would be motivated to study for a year or so in order to just try something they might not even like. Even kids should have the opportunity to learn to code without taking such a big step and that's what happens in other countries.\n\nAt last, I have to say: I'm sorry for my english, because even though I use it every day reading, writing and studying I don't have many opportunities to use it with people I meet because we are a very isolated country when it comes to language. Take Europe for example. Every country there is the size of one of our regions and full of foreigners. English is commonplace, a language every one must know to communicate with their neighbours. Or take India, that is in a similar situation to ours but has english as official language. All our neighbours speak spanish with whom we can communicate basically in portuguese but we almost never have contact with them.\n\nSo that is our situation. Not a bad or good one, but different.\nI totally agree we should have a language known worldwide and I don't have much problems that the chosen one is english (even though many others have, not without reasons, for instance our 20 years long dictatorship which was organised and financed by the CIA - you probably don't know that). Anyway we are far away from dominating a second language and we can choose: segregate or give the opportunity to all. \n\nThat is why I agree with this initiative and by now you should have realised why it's got some risk of failure, given our small number of people involved with technology, which may prefer to answer and make questions in the global community rather in the BR version."}, {"author_name": "ninjalj", "gravatar_hash": "3ea8a6cc427e284e0bcf6e6008638b79", "author_url": null, "date": "Feb 17, 2014", "message": "As Tom Christiansen put it at http://stackoverflow.com/a/4839551/371250:\n\n\"This idea that English and ASCII were good enough for Grandpa in Iowa so it better be good enough for Rajesh in New Delhi, let alone for Akira in Kyoto, is deeply troubling. It is imperialistic and condescending. It runs right over other people’s sensitivies.\""}, {"author_name": "Jose", "gravatar_hash": "28ab5f82e6a88b40f0682dbcc03b870d", "author_url": null, "date": "Feb 17, 2014", "message": "I guess you missed the whole point. Instead of generating a single API to interface your module, and let the implementers read the documentation and adapt to it, you want to create a customized API for every implementer module, duplicating efforts and missing features in currently-on-development ones.\n\nFurthermore, how any program handles multi-language? Do they code everything from scratch for every new language (comments in the source do need to be in the target language just to feel the mood)? I guess they use look-up tables, something might be the same as using google translate."}, {"author_name": "Robert Went", "gravatar_hash": "b4dd21dc5d4d2f20267da9f0e32a878a", "author_url": "http://www.robertwent.com", "date": "Feb 18, 2014", "message": "Russia has some pretty hot coders.\nThere is a lot of Yii talk in Russian"}, {"author_name": "gbyte.co", "gravatar_hash": "0d7863b0d824ef36456095525608725d", "author_url": "http://www.gbyte.co", "date": "Feb 19, 2014", "message": "The questions and answers on this site are not supposed to be essays. They are supposed to be easy, pragmatic explanations and instructions. Google translate will be sufficient for understanding the majority of the answers. \nRegarding asking questions, maybe some sort of translation request feature with the right tools for content translators should be implemented. This way the knowledge will be kept in one place in one tongue."}, {"author_name": "Karl Isenberg", "gravatar_hash": "68716d0fcc7b110ef7d9fcfb78f302c8", "author_url": "http://karl.isenberg.us", "date": "Feb 19, 2014", "message": "Better Idea:\n1) Allow each user to specify preferred read &amp; write languages (default using geolocation)\n2) Auto-translate posts/comments (except code blocks) into the user's preferred reading language.\n3) Add optional toggle button to show original text on all translated posts/comments. \n4) Show all posts/comments to all users!\n5) Profit!"}, {"author_name": "Shaun Gosse", "gravatar_hash": "020638c6440a3a81c720b7796ceab14f", "author_url": null, "date": "Feb 19, 2014", "message": "The critics are incredibly short-sighted. Ignore them.\n\nOf course these sites are going to start off weaker. And of course the English \"hub\" is going to be stronger for the foreseeable future. Did you bother to read any of the explanation to understand why this doesn't matter?\n\nIt's about giving people a place where they can start. Carlos, for instance, thinks he's got it all figured out and this site will be pointless. Great. Carlos need never go to the site.\n\nAnd there are people trying to take the easy way out? /shocked-face\n\nBut I know from my experience on SO that I can be helped by good responses to people asking questions for their projects. And that people can ask questions about projects because they really want to know more and go further rather than to have it solved for them.\n\nThe truly lazy and unproductive won't make it further. Those who manage to \"crowd-source\" their answers are actually at least mildly productive and might last a bit. Those who really education themselves will probably do best. All of them can benefit from a site in a language they can speak.\n\nThis is a patently obvious and necessary move. The irony of ESL speakers coming on here and saying what a bad idea this is is palpable. No one is saying you aren't welcome on the English-speaking sites. We /want/ you! The more people who learn a common language, the more people we can share with.\n\nBut, again, read the f'ing article! This isn't about the people who already know and are comfortable in English! This is about the people who /can't/ use SO because they don't speak English well enough!\n\nThis is a huge deal to me because I believe in access to information and I believe in bridging language barriers. And people speaking in English who started in a different language arguing that they don't think there should be a bridge for those who don't speak English to be able to access programming material is just sad and wrong.\n\nSO / SE network has been incredibly valuable to me. I didn't first learn to code from it, but it has often been a great resource to me. And the fact that it's in my native language has been a major factor in being useful to me. I hope that millions more people are able to experience that, whatever language they speak and wherever they may be."}, {"author_name": "Jesmin", "gravatar_hash": "d9a10084cc9b3e9a45617ddf300f9627", "author_url": null, "date": "Feb 20, 2014", "message": "English is the one universal language that everyone should use. The only people having trouble with it are the highly racist/patriotic ones from countries like Japan and Russia who just like like living in their own bubble, careless about what goes on in the world, let alone universe. Adding localized sites is just making it easier for them.\n\nIt is sickening to read code that is written in foreign language, clearly the developer has basic english knowledge if he has no problem with language constructs that are in english, but uses his own language out of pride.\n\n\nOne language to rule them all, that's the future."}, {"author_name": "DYN", "gravatar_hash": "94faeea8699097745a39db49a1585a62", "author_url": "http://www.researchpaperlabs.com/write-my-research-paper/", "date": "Feb 21, 2014", "message": "it is good guys that you are targeting non-english regions too as it will enlarge your brand then your thoughts!!!"}, {"author_name": "Hatem", "gravatar_hash": "4c76472d857b539d869f3a3e06b1ad5c", "author_url": "http://hatemalimam.com", "date": "Feb 21, 2014", "message": "Well that reminds me when I used to surf Chinese and Russian hacking websites, I found things that I would never find in normal forum/sites on the internet. although I don't speak or write in Russian/Chinese, but looking into the code/tools helped me.\n\nAnd I think the same would happen to non-English speakers, they would look into the code and learn something from it, but we might run into the problem of searching and finding what you want in a non-English language.\n\nI think we should all speak English in the end (by all I mean developers). I could imagine years from now, I would find some useful answer on the Portuguese version of SO, which doesn't exists on the main one, honestly I wouldn't mind, but the question is, Will I ever find that useful question in a language that I do not know anything about?.\n\nWe can't say it's a bad idea to have a localized versions.. but it's a bad one at least from my point of view!"}, {"author_name": "Fred", "gravatar_hash": "c27c86d14bcf0df30b116998cc81b8c4", "author_url": null, "date": "Feb 22, 2014", "message": "My mothertongue is French. I actually learned English first by understanding what BASIC commands meant in French (I was 9 when I got my Commodore 64)\nI loved the relatively simple grammar and verb usage rules etc.\nIt seemed more logical and regular to the would be programmer I was."}, {"author_name": "AveMaleficum", "gravatar_hash": "e011a426dc8218e9de59116d88c2fce5", "author_url": null, "date": "Feb 24, 2014", "message": "This is not a good idea, if you can't type english properly, you will have to catch up.\nI am not an native english speaker, but you can't use that as an excuse.\n\nDon't do this ,add the so called mutlie language versions."}, {"author_name": "David", "gravatar_hash": "b1b97e00905a659dde58d29e3f6433d9", "author_url": null, "date": "Feb 24, 2014", "message": "John von Neumann was born in Budapest and studied in Berlin before moving to America.  While he could speak fluent English (along with many other languages), it wasn't his native language.\n\nYou have to wonder which of his contributions to computer science, mathematics, physics, statistics, economics, and politics might have gone unheeded if he had had his astounding skill in mathematics, but lacked any facility for languages."}, {"author_name": "e-sushi", "gravatar_hash": "082feba3d01261803ee532b566b2dd60", "author_url": "http://stackexchange.com/users/1100858/e-sushi", "date": "Feb 26, 2014", "message": "&gt; &gt; Assumption: All of the serious developers in the world are highly proficient in English.\n&gt; Which… actually sounds plausible. But it’s wrong.\n\nI was about to agree that the assumption is wrong… until I realized you did not define the word “serious”.\n\nIt's hardly a commonly known definition for a specific group of devs. After all: “serious devs” could be  “seriously bad” at their job too."}, {"author_name": "Anti Common Core", "gravatar_hash": "da4a23d92967bb8b3a531dbc32877421", "author_url": "http://bit.ly/1gCfQHr", "date": "Feb 26, 2014", "message": "It's hard enough getting English-speaking Americans to speak proper English. Look around. I hate to sound like a grumpy old man, but kids today are dumb as a box of hair, especially when it comes to proper use of grammar and communication skills. I blame social media coupled with the downgrade of curriculum standards in public schools thanks to teacher's unions, Common Core, and other components. http://bit.ly/1gCfQHr"}, {"author_name": "Mike", "gravatar_hash": "d4e468bce96a60472bb3d051537f28e9", "author_url": null, "date": "Feb 26, 2014", "message": "I think this is a great. I say this as someone who has grown up with English as a primary language my whole life, and struggled with language classes in high school, college, and beyond. I think anyone who has tried to seriously study and use a foreign language knows that it's not an easy task, and \"just learn English\" is not a responsible answer. It's not like picking up a new programming language. It takes orders of magnitude more time to learn a new \"human\" language.\n\nWe shouldn't let our tongues and where we happened to be born throttle the flow of ideas. The best questions, ideas, and answers will still be voted to the top to be curated and shared; that is a core strength of the Stack Exchange platform. And I believe it will help not just Stack Exchange, but humanity, reach a higher level of awareness."}, {"author_name": "Derek", "gravatar_hash": "d6fab176b3d9d3026ee3eec2dba19fbe", "author_url": null, "date": "Mar 04, 2014", "message": "It might be easy to implement western languages, but when you come to implement a Chinese one you will run into big problem like Wikipedia... Since people from all around world use different branch of Chinese, as well as Traditional/Simplified Chinese and regional word choices, you will be so frustrated at making translations because it is impossible to do with machines. In Wikipedia we have to translate words manually."}, {"author_name": "Adam", "gravatar_hash": "5511880ba1853b6170aef6add8d883c5", "author_url": null, "date": "Mar 07, 2014", "message": "I think this is a great idea, especially since many people who get the most out of SO are beginners, and might not know English very well, if at all.  We want to attract younger people, yes?\n\nOne thought I had: provide a capability to link translated answers between language versions of SO, and provide a capability for people to vote up good translations (or vote down bad translations so someone doesn't just run it through Google Translate)."}, {"author_name": "Wojciech Bednarski", "gravatar_hash": "785a8c350db7560d6f44eba003661ade", "author_url": "http://d300.pl", "date": "Mar 12, 2014", "message": "I think this is very bad idea because it will generate duplicated content in different languages, new programmers will be less likely to learn English, it will mess Google search results since a lot of questions/answers will contain English sentences like error messages or other common used English only phrases.\n\nSO right now is like USA, and you are trying to convert it into EU - many different things under one name.\n\nAnd hey! You will be not able to name those non-English speaking programmers even more now..."}, {"author_name": "zxq9", "gravatar_hash": "a073cbc871c26b0fb4f1cc1f808e9749", "author_url": "http://zxq9.com", "date": "Mar 15, 2014", "message": "I run a small computing company here in Japan and I can tell you for sure that the majority of coders here -- Hiro Abareeji as it were -- do not speak or write English, even if they can get by reading a document or two with the help of Weblio. They *can* read code, though, and an interesting effect of not being highly proficient in in English is that the variety of languages (and operating systems) in common use here is extremely narrow, because if you don't market and publish books and run your spin machine in Japanese *you* are invisible *here*.\n\nThe situation is not at all helped by the fact that localizing to Japanese is a non-trivial task (a fact somewhat mitigated by the fact that Japanese users have generally been beaten into accepting absolutely horrible localization of most foreign programs and systems)."}]}