{"response": [{"author_name": "Billy Mailman", "gravatar_hash": "7062727efa0a6961875555eff693e974", "author_url": null, "date": "Feb 24, 2014", "message": "The main link to pets.stackexchange.com is busted, needs the .com part added. Which is a bit fitting, given Joel's comment on .com versus .cm, but probably should still be fixed.\n\nOr wait, is this a sign that you guys are working on getting a .stackexchange TLD?!?! "}, {"author_name": "Abby T. Miller", "gravatar_hash": "673e91ced57dd8a3e73dd888b07ff95c", "author_url": null, "date": "Feb 24, 2014", "message": "Fixed!"}, {"author_name": "JoshDM", "gravatar_hash": "82762ea3991b3411abab1054dea063a4", "author_url": "http://www.joshdm.com", "date": "Feb 24, 2014", "message": "Yes, you guys talked about pets last time."}, {"author_name": "TAKeanice", "gravatar_hash": "e56e29c333a032c95198aee3ba2c58d3", "author_url": null, "date": "Feb 25, 2014", "message": "That whole wheat thing is simple: whole wheat has a lot of minerals - directly under the shell. The white part is won by REMOVING the shell. So you get a lot more minerals through whole wheat. It is like saying that a peeled apple is as healthy as a apple with its skin.\nSaying some food is \"less healthy\" implicates that there is actually \"unhealthy\" food. Which only depends on the dose."}, {"author_name": "TAKeanice", "gravatar_hash": "e56e29c333a032c95198aee3ba2c58d3", "author_url": null, "date": "Feb 25, 2014", "message": "And besides, I think that site would be fantastic. With the philosophy of always backing what one says - lots of people would love sharing studies they read about and so on..."}, {"author_name": "Eric B", "gravatar_hash": "8153296472e5afa297a1c750b5c93e6b", "author_url": "http://httpjunkie.com", "date": "Feb 25, 2014", "message": "Thank you! We have been waiting patiently!"}, {"author_name": "Isaac Moses", "gravatar_hash": "b06bc716ca856189aae02369e49094ad", "author_url": "http://mi.yodeya.com", "date": "Feb 26, 2014", "message": "Joel discussed Mi Yodeya's Purim Torah policy in the context of rites of intensification in Podcast #32.\n\nhttp://blog.stackoverflow.com/2012/03/se-podcast-32-jarrod-dixon-and-josh-heyer/\n\nNote that the policy is not just to use a certain tag. We allow Purim Torah only during a certain 2-week period of the year, after which we close all the Purim Torah questions. In addition, all Purim Torah questions have a prominent disclaimer in the question body that points back to the Purim Torah policy. All together, this policy allows for some fun silliness for a couple weeks and effectively quarantines it from the serious content that makes up our usual fare.\n\nhttp://meta.judaism.stackexchange.com/questions/797/purim-torah-policy-allowed-but-regulated\n\nAs it happens, Purim Torah season is coming in just a few days, starting Saturday night, March 1. Also, about a week later, we're going to be coming out with a printable Purim book based on content from Mi Yodeya, about 1/3 of which will be past Purim Torah Q&amp;A. Check http://s.tk/miyodeya during the week beginning March 10."}, {"author_name": "Simon Whitehead", "gravatar_hash": "d15c5670dad6eab33c0cccbd7f6b2669", "author_url": null, "date": "Feb 26, 2014", "message": "I don't know if this applies to everyone.. but I can certainly explain hit explains the \"50% google -&gt; SO answer\" scepticism from my point of view.\n\nI have a dedicated SO tab while I'm at work and use it to answer questions. I also Google alot of programming stuff at work (since I'm a developer by trade). Other people might be similar and would explain those statistics."}, {"author_name": "Chris", "gravatar_hash": "e400600450847a664b70eabedb920d2e", "author_url": null, "date": "Feb 27, 2014", "message": "Is there an architecture stack exchange?  I think it could really take off.  With questions like, \"How can I fit a sloping roof to this house?\", \"What software is available for designing houses?\", \"What are some good architecture online lessons?\", \"What are some good examples of Bauhaus design?\", \"Why is Falling Water so unique?\"."}, {"author_name": "Alex Andronov", "gravatar_hash": "542f45519ec27c8147da98b9226f331c", "author_url": null, "date": "Feb 27, 2014", "message": "On the 50% google thing. I like Stackoverflow a lot, my most common use case is google for something I need, find an answer on stack overflow, then attempt to \"pay it forward\" by answering a question."}, {"author_name": "Michael R. Schmidt", "gravatar_hash": "1c2b4fef96c71b580a5302623e11d344", "author_url": null, "date": "Mar 12, 2014", "message": "The 50% Goog thing. Your site search uses Google right. Bazinga!"}, {"author_name": "hervelegerstylish", "gravatar_hash": "5e7a7c554f9886d491bac0d3ebfca3ac", "author_url": "http://www.hervelegerstylish.com", "date": "Mar 14, 2014", "message": "And besides, I think that site would be fantastic. With the philosophy of always backing what one says – lots of people would love sharing studies they read about and so on…"}]}