{"response": [{"author_name": "Andy", "gravatar_hash": "d6fa172f0cdc86dadf568ef8ca263361", "author_url": "http://andyparkes.co.uk/blog", "date": "Jun 09, 2011", "message": "I'm not a regular stack exchange user so not saying this for sour grapes sake but wouldn't a lottery once you'd hit 1 million have been better?\n\nLoyal user number ten loses out to someone who randomly signed up a couple of days ago.\n\nIt's still a great thing to do and congratulations on reaching that number!"}, {"author_name": "Telanis", "gravatar_hash": "7f2b79cd5329a2c04562a873211e5d16", "author_url": null, "date": "Jun 09, 2011", "message": "@Andy 9monkeys made an account on Stack Overflow around a year ago.  I wouldn't call them a \"loyal user\" from their activity, but it's not really that different from a lottery.  Also, unless you were promised a lottery when you signed up, that sounds an awful lot like false entitlement."}, {"author_name": "Tom Hawtin", "gravatar_hash": "ca38e010104d9d255928940c6809ab60", "author_url": "http://jroller.com/page/tackline/", "date": "Jun 09, 2011", "message": "The London DevDays immediately before Devoxx?? I have so already booked my Air France LCY-&gt;ANR flight."}, {"author_name": "Andy", "gravatar_hash": "d6fa172f0cdc86dadf568ef8ca263361", "author_url": "http://andyparkes.co.uk/blog", "date": "Jun 09, 2011", "message": "@Telanis\n\nI think you're missing my point a little.\n\nI never said anything about whether 9Monkeys was a loyal user or not.\n\nTake the word \"loyal\" out of what I typed and it means the same thing.\n\nAll I was trying to say was if you're going to give someone a prize for celebrating reaching 1 million users why not give people who have been on your site for years just the same chance."}, {"author_name": "Andy", "gravatar_hash": "d6fa172f0cdc86dadf568ef8ca263361", "author_url": "http://andyparkes.co.uk/blog", "date": "Jun 09, 2011", "message": "@Telanis Anyway I'm actually agreeing with you?\n\nIf you're talking about loyal user my point was does someone who signed up and doesn't have a lot of activity deserve such a prize? \n\nWouldn't be better going to someone who is a regular contributor?"}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Jun 09, 2011", "message": "@Andy\n\nMaybe because it's fun to give a surprising prize to the guy that \"just walked in the door\"?\n\nMaybe because there can be no accusation of preference, no matter who wins?\n\nMaybe because there is no chance that they find that the winner is unreachable? (Doesn't return, email bounces back, deceased.)\n\nWho knows? But they have given you and me everything they've promised us, and sometimes more."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jun 09, 2011", "message": "My thought is the lottery is as random as you can get.  My neighbor, an old old man, has probably spent hundreds of thousands of dollars in lottery and never seems to win.  I'd say he's pretty loyal...not too long ago  I read an article of a guy who just bought a random ticket for the first time and won millions...its spontaneous and I think even them doing it for one person is nice.  \n\nBesides its their time and money whose to say who they give it to."}, {"author_name": "Jonathan Sampson", "gravatar_hash": "a84a8714fd33f6676743f9734a824feb", "author_url": "http://sampsonblog.com", "date": "Jun 09, 2011", "message": "Wow; that has to be one of the most exciting days 9Monkeys has had in a long time. Post on a topic, expect some rep, gain thousands of dollars in freebies!"}, {"author_name": "9monkeys", "gravatar_hash": "61bb1230a4328c0b260f2b7f1933eb23", "author_url": "http://www.pablasso.com", "date": "Jun 09, 2011", "message": "Beware 9monkeys!\n\nThat is obviously just another marketing gimmick, you can never trust a website that rewards you for being the 1000,000 visitor ;)"}, {"author_name": "Shy", "gravatar_hash": "749b73007119baf94fc077c50bcc58e8", "author_url": null, "date": "Jun 09, 2011", "message": "First time on the internet where a banner saying \"you are the 1,000,000 user!\" is not trying to scam you."}, {"author_name": "AndyP", "gravatar_hash": "d6fa172f0cdc86dadf568ef8ca263361", "author_url": "http://andyparkes.co.uk/blog", "date": "Jun 09, 2011", "message": "wow talk about being misunderstood!\n\nI'm not actually saying it's a bad thing - any sort of prize/gift/whatever like this is a great thing to do - regardless of whoever it actually goes to.\n\nI was just asking the question why not make it a little more inclusive - i'm not actually being critical!"}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://semiaxis.com", "date": "Jun 09, 2011", "message": "Sounds like someone really does want to punch the monkey and win a free trip.\n\nCongrats 9monkeys!  Enjoy the trip and the conference.\n\nBig congrats to Jeff and Joel!  \n\n6 to 8 weeks at a time, and look where you've taken this concept.  Thank you for sticking with it."}, {"author_name": "Jonathan", "gravatar_hash": "f3b9829c592fd7617525afc56118a629", "author_url": null, "date": "Jun 09, 2011", "message": "A bit misleading really, it seems you've reached 1000000 accounts, but not users? So the milestone isn't quite as impressive as it would be if you reach a million users.\nIt would be interesting to know how many users there are on Stack Exchange. (ie associated accounts only count as one).\nStill you reached a milestone so Congrats!"}, {"author_name": "Jonathan Sampson", "gravatar_hash": "a84a8714fd33f6676743f9734a824feb", "author_url": "http://sampsonblog.com", "date": "Jun 09, 2011", "message": "Jonathan, I think it actually is pretty impressive. While there may not be 1,000,000 humans who have used StackExchange, there are hundreds of thousands that have not only used one of your sites, but many of your sites. When you consider the success of getting an individual to participate and contribute in one place, it does nothing but astounds me that StackExchange is having individuals participate and contribute in multiple places.\n\nHip-hip."}, {"author_name": "Benny", "gravatar_hash": "ee98cccb68318cf0ec167c05fd3ace7e", "author_url": "http://geekswithblogs.net/benonsoftwrae", "date": "Jun 09, 2011", "message": "Lucky him. Wanna swap names?"}, {"author_name": "Jonathan", "gravatar_hash": "f3b9829c592fd7617525afc56118a629", "author_url": null, "date": "Jun 10, 2011", "message": "@Jonathan It is indeed impressive, but not quite as impressive as having a million users."}, {"author_name": "Aiden Bell", "gravatar_hash": "60f28d36c1439f965e2fb55419621968", "author_url": null, "date": "Jun 12, 2011", "message": "Damn! Damn! Damn! ..."}, {"author_name": "glowcoder", "gravatar_hash": "eba3df62ea97ea9065ca70e9c06b80aa", "author_url": null, "date": "Jun 16, 2011", "message": "Wait, there's no flashing banner with balloons indicating he's the 1,000,000 user? Doesn't seem legit without it..."}, {"author_name": "Nilesh Pangul", "gravatar_hash": "b4ecf294b633d16e345caaa5b0ad0b75", "author_url": "http://topmodelo.com", "date": "Jun 20, 2011", "message": "Hi,\nMy thought is the lottery is as random as you can get. My neighbor, an old old man, has probably spent hundreds of thousands of dollars in lottery and never seems to win. I’d say he’s pretty loyal…not too long ago I read an article of a guy who just bought a random ticket for the first time and won millions…its spontaneous and I think even them doing it for one person is nice. \n\nThanks,\nNilesh Pangul"}, {"author_name": "gobernador", "gravatar_hash": "cdfa7e5fd903c9e6f6159a4351617764", "author_url": null, "date": "Jun 13, 2012", "message": "All I have to say is http://xkcd.com/570/"}]}