{"response": [{"author_name": "AttackingHobo", "gravatar_hash": "0f47d8d088dfa4f8040680fd8f2112fe", "author_url": null, "date": "Jun 27, 2011", "message": "\"...each tutorial starts at the ground level and gives you a whirlwind tour through a technology by showing you actual code.\"\n\nI think you meant \"your\" instead of \"you.\" Although it could work as \"you actually code\" as well."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://semiaxis.com", "date": "Jun 27, 2011", "message": "&gt; learn as much as you would learn in two years of reading Twitter.\n\nlol"}, {"author_name": "Dave S", "gravatar_hash": "e14c474117597f3b8c7c6489a5ace397", "author_url": "https://twitter.com/pcubed", "date": "Jun 27, 2011", "message": "&gt; Save $100 using the code \"blog\"?\n\nWell, that's what I get for signing up early...."}, {"author_name": "AttackingHobo", "gravatar_hash": "0f47d8d088dfa4f8040680fd8f2112fe", "author_url": null, "date": "Jun 27, 2011", "message": "Ignore my comment above, as Michael Myers pointed out to me in chat, I was parsing the question incorrectly.\n\nIt might be less confusing if the last \"you\" was ommited entirely, but even that might be less than ideal."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 27, 2011", "message": "@dave I believe the price went up by $100 already, so if you signed up earlier, you got the lower price. I think."}, {"author_name": "James Greenhalgh", "gravatar_hash": "3535b571ae96b0bc8fec4eb6c828f193", "author_url": null, "date": "Jun 28, 2011", "message": "The restriction that student volunteers should have a .edu email address will prove a barrier for the London event.\n\nUK academic email addresses end .ac.uk"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 29, 2011", "message": "Although there may be no funny *pictures* of cats, I will probably be bringing along Tony's new friend, Evil Code Hench-kitty, for my London talk. She may talk to Tony, too. (I was considering crouching behind the podium and doing the whole talk as a puppet show, but I think that may be going a little too far...)"}, {"author_name": "Rich", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Jun 29, 2011", "message": "Jon, here's a request: Why don't you treat the audience like grownups instead of doing some stupid sunday school shtick?"}, {"author_name": "Kobi", "gravatar_hash": "fd75cd399cd893182d6e3d06d738d6d4", "author_url": "http://kobikobi.wordpress.com/", "date": "Jun 29, 2011", "message": "I saw an interview with Patch Adams, who said something like this: \"Almost every week a new study is published showing how laughter is good for your health. No benefits have yet been found to being serious.\""}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 30, 2011", "message": "@Rich: If I thought people would prefer a purely-serious talk, I'd obviously do that. My experience is that people *enjoy* a bit of light-hearted cheesiness - mixed in with important points, of course.\n\nDespite everyone protesting to their bosses that they go to conferences to learn all about the newest technology etc, my experience suggests that they go to conferences to be entertained as much as anything else.\n\nI'm sorry if my preferred presentation style isn't to your taste, but I've never been under the illusion that I'll be able to please everyone."}, {"author_name": "Craig", "gravatar_hash": "24b0bc1aa9599ca5b59300376b12a8b2", "author_url": null, "date": "Jun 30, 2011", "message": "Arrrrgggghhhh... Allowed my 2009 Alum discount code to expire, booked up yesterday at the increased price and then read this! \n\nAh well, hopefully I can get work to cover it. Looking forward to it."}, {"author_name": "Rod Howarth", "gravatar_hash": "aad3058d94069f9f748f42adae43df38", "author_url": "http://rodhowarth.com", "date": "Jun 30, 2011", "message": "Interesting that Twillio is a sponsor, I was under their impression their product musn't much use to anyone outside of the USA/Canda?"}, {"author_name": "Jasper Rijkeboer", "gravatar_hash": "82029270b67d41fd77c16cfcce4056b8", "author_url": null, "date": "Jul 01, 2011", "message": "I really enjoyed DevDays Amsterdam 2009. People came from far and wide: Italy, France, Spain, Bulgaria, Hungary and some from the Benelux too ;).\n\nGood luck with the show this year."}, {"author_name": "Skilldrick", "gravatar_hash": "2b0a93dc132be4bf3b15b50c8a7e8089", "author_url": "http://www.skilldrick.co.uk", "date": "Jul 01, 2011", "message": "I'm with Jon - his talk at the last Dev Day was one of my highlights. Bring on the fun!"}]}