{"response": [{"author_name": "Alex", "gravatar_hash": "e96a421d76c1fc107a5d291c6999b2ef", "author_url": "http://alexanderdickson.com", "date": "Jun 13, 2011", "message": "I love the free down voting on questions. I'm more likely to downvote a poor question now."}, {"author_name": "Barry Kelly", "gravatar_hash": "4a7b08fcb7e3d9a52ae473613b71bc3d", "author_url": "http://blog.barrkel.com/", "date": "Jun 13, 2011", "message": "What stats do you have on multiple accounts sharing the same IP?\n\nI would expect that many large organizations still use a shared web proxy for various reasons - from caching to monitoring and web filtering - and certainly they'll be using NAT to multiplex lots of clients on a single public IP.\n\nAre the limits on a per-IP basis higher than on a per-account basis to compensate for this?"}, {"author_name": "Benjol", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Jun 13, 2011", "message": "\"quality answers to quality questions\" should be the tagline of Stack Exchange."}, {"author_name": "AviD", "gravatar_hash": "a88248f632c039340efa02505be355e5", "author_url": null, "date": "Jun 14, 2011", "message": "See some interesting discussion re the contrary point of view, on http://meta.judaism.stackexchange.com/q/213/459, about the value in asking a question that doesnt get a good answer."}, {"author_name": "Andrew Stacey", "gravatar_hash": "c9359d5d299cd6f7b0bf8cc123c69234", "author_url": "http://www.math.ntnu.no/~stacey/CountingOnMyFingers", "date": "Jun 14, 2011", "message": "I still think that you're going about this the wrong way.  You want to produce pearls; with that I agree.  But you *don't* optimise for pearls: they are the result of the process.  You optimise for *high quality sand*.\n\nThe incentives are all wrong.  As a questioner, I don't give a fig about reputation, nor about the ability to ask questions at some later date.  All I care about is getting an answer to the question that I have *right now*.  I don't care if I have to set up a proxy to get round a blocked IP (I could just switch my wireless off and on again to get a new one!), all I care about is *getting an answer*.  So long as I can actually ask it, that's all I care about.  Of course, if I phrase it well then I optimise my chance of getting an answer, but with the size of the user base then there's always a good chance that someone will come by looking to pluck low-hanging fruit and I'll get my answer.\n\nSo that's the problem you have to fix: remove all incentives for *answers* to bad questions.  If a question is bad, an answerer should get *no reputation* from it.  Then the only incentive for answering is the one to help someone out, and as an answerer I know that I'd rather help someone who shows some investment in the question.  Then as a questioner, if I see all these other questions getting answers but mine doesn't, I have all the incentives I need to figure out how to make my question better to attract answers.  They beauty of this is that it makes it the questioners job to make the questions better, not your job to keep bad questions out.\n\nIt may be a bit complicated, but if you really want to produce pearls, then you need to optimise for sand.  But good sand.  Here's some ideas (not fully thought through: but that's *your* job!):\n\n1. An answer does not, in general, accrue reputation until the question has more than N votes (where N is 1 more than the \"typical sympathy\" vote level).\n\n2. If the answerer does not vote for the question, they get no reputation for it!  But answerers' votes should not count in the computation above.\n\n3. A *really good* answer can accrue reputation on a bad question, but only once it reaches a certain threshold (again, probably site-specific).  Thus if you are going to answer a bad question, you'd better be sure that you give a really good answer.\n\n3. The reputation for the answer could scale with the votes on the question (maybe, depends on whether \"good\" questions and \"popular\" questions are reasonably aligned for the site in question).\n\n4. Votes on a question should give reputation in a similar fashion: they don't give reputation until an answer with enough votes has been supplied.  In this case, I wouldn't have votes giving reputation at all until an answer has been given, even if the question gets 100 votes.\n\nThe idea is that the votes on a question give an indication of the *potential reward* for answering it.  They say, \"This many people are interested in finding out the answer to this question\" (or perhaps: \"This many people think that this question is worth answering\": how many people vote for a question and then never go back to see if it has been answered?).  So to an answerer, it helps focus their attention and it backs-up that focus with an appropriate reward: \"Answer *this* question and you get a warm glow of having helped one person.  But no reputation.  Answer *that* question and you get a warm glow of having helped lots of people.  And a whole hunk of reputation in to the bargain.\".\n\nI'll say it again: Don't optimise for pearls.  You'll kill the golden goose.  Figure out what kind of food your goose likes and then feed it with that!\n\n(With extreme apologies for mixing my fairy tales.)"}, {"author_name": "Andrew Stacey", "gravatar_hash": "c9359d5d299cd6f7b0bf8cc123c69234", "author_url": "http://www.math.ntnu.no/~stacey/CountingOnMyFingers", "date": "Jun 14, 2011", "message": "Just to point out one more thing.  You say:\n\n\"If this means aggressively downvoting or closing unworthy and uninteresting questions, so be it.\"\n\nThat says to me: \"If we have to make our best users put in a lot of work to make up for the worst ones, so be it.\".\n\nSomething feels a bit topsy-turvy with that."}, {"author_name": "a", "gravatar_hash": "d10ca8d11301c2f4993ac2279ce4b930", "author_url": null, "date": "Jun 14, 2011", "message": "I agree with the idea but the language of this post is a little bit too harsh. You could have said the same thing without being harsh."}, {"author_name": "a", "gravatar_hash": "d10ca8d11301c2f4993ac2279ce4b930", "author_url": null, "date": "Jun 14, 2011", "message": "Also I think the real problem is that SO has too many users and too many questions, you need to improve the filtering for users so they can find the needles (interesting questions) they are looking for to read and answer them without needing to go over all of the sands. \n\nYou are using users to check the quality of the answers and questions and to make sure nothing is wrong, and that is the cause of the problems. You should give up the idea of forcing every user go over all questions just to make sure there is nothing wrong. If a user doesn't care if there is something wrongs in questions or answers on topic X, then don't force them to check them, if no expert cares about X what is the point of forcing them to fix questions about X?"}, {"author_name": "BrunoLM", "gravatar_hash": "ef1a0f00d57917768acdc5b379ca1b28", "author_url": "http://www.orkutmanager.net/", "date": "Jun 14, 2011", "message": "I just disagree about the question mentioned. It might be a mundane question, but it is still a question, and not just any question, the community voted over a hundred times on it. So it is interesting and might be useful for other people. Isn't the community who should build SE websites?\n\n\nWhat if you add a system that we can browse questions by questioner reputation.\n\n\nDoesn't the reputation of the user also determine the quality of his questions, at least most of the time? It is like getting a class and splitting them in groups by their knowledge."}, {"author_name": "Zdravko", "gravatar_hash": "f146a2c4c11d7c8a2c2c0949f65a2ac0", "author_url": null, "date": "Jun 14, 2011", "message": "You want less questions with more answers. You will make the perople make new account if they have more than 2 question in a single day. If you really don`t want that much low quality questions filter China and India. It is a little bit unfair bit they produce the biggest part of the \"write me the code\" questions.\n\nThis is a community site, let the community dicide which question is good. Give the users more permissions to downvote for example. Maybe not only once, but twice.\n\nHere is an axample, which I think is the best decision. In school were whining about the poor grades were receiving from a vary strict teacher. He made a very simple decision - we, the kids had to evaluate our works. Believe me nobody got an A."}, {"author_name": "Adam", "gravatar_hash": "fcbf8b1d0bffb1b55239250bd3e1f321", "author_url": "http://suspensaodejuizo.wordpress.com", "date": "Jun 14, 2011", "message": "Hi, Jeff.\n\nI find the decision of restricting the number of user questions strange. Have you ever verified that users asking a lot of questions in a day are necessarily asking bad questions or did you pull it of your mind?  Also, why do not loose the restriction in function of the user rep?"}, {"author_name": "TBS", "gravatar_hash": "dd14249e07e1f1d6a949bffa569377ad", "author_url": null, "date": "Jun 14, 2011", "message": "I used to visit stackoverflow.com for fun but recently I have stopped visiting stackoverflow.com regularly because the quality of the questions has dipped below my threshold for signal-to-noise. IMO the proposed \"question quota\" of 6 per day or 50 per month seems WAY too generous! IMO such a generous quota will not reduce the spam/noise enough."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Jun 14, 2011", "message": "By putting such an emphasis on answers, you discourage people from asking questions.\n\nWhile that may be all well and good for high traffic sites (i.e. the trilogy), it's a terrible idea on the low-traffic sites.\n\nTo keep with the pearl metaphor: If the sand isn't there, the pearl never forms.\n\nAlso keeping with the pearl metaphor: If you find the questions (sand) irritating, you shouldn't have started a Q&amp;A site."}, {"author_name": "Jez", "gravatar_hash": "4cfe34bc2c01e031a60a98182eb5b94d", "author_url": null, "date": "Jun 14, 2011", "message": "This strategy makes sense for main sites, but if you're going to be telling people to downvote questions on Meta sites if they're suggestions people disagree with, it makes no sense either to remove someone's reputation for having asked the question, nor to ban them if they receive a bunch of downvotes (or 'people disagreeing with them').  I really think you should either modify they way Meta works fundamentally (have an agree/disagree vote as well as an up/down quality vote), or at least decouple votes and reputation, and don't ban people from asking questions on Meta because they got a bunch of downvotes.  It doesn't make sense for Meta.  You're punishing people potentially for putting out novel, yet unpopular ideas... basically saying that if you post an idea, it better be populist.  I don't think that's a good formula for getting good new ideas on Meta.  You have to accept that there will be good and bad ones, and people need to take the risk of unpopularity in suggesting them."}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Jun 14, 2011", "message": "Does the \"interesting questions\" list take into account what types of questions *I* have previously answered (and the votes those answers received)?  Right now I'm seeing a number of questions that I don't really know anything about."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Jun 14, 2011", "message": "Jez,\n\nMost of the Meta sites (all of the site-specific Metas) don't give or take any rep for upvotes and downvotes.  Reputation is a reflection of activity on the main site, so you shouldn't get banned on a normal Meta just for posting ideas that people disagree with.\n\nMeta Stack Overflow is the only one that has a reputation system all its own.  I don't know of anyone who has lost the ability to ask questions on Meta SO due to the low-quality block, but if they have it's exceedingly rare."}, {"author_name": "Marian", "gravatar_hash": "4c420893fb595edc3cc05e7dfdcfde11", "author_url": null, "date": "Jun 14, 2011", "message": "I love the voting system, even if it costs to down-vote a question. If I think a question or an answer is low enough and deserves a down vote, by all means, take all my points, as soon as I have enough privileges I'll still vote it down.\n\nWe're not here to replace a google search. We're here to add a personal touch to a technical answer. Otherwise we'd all be checking only the documentation of our technology provider."}, {"author_name": "Jez", "gravatar_hash": "4cfe34bc2c01e031a60a98182eb5b94d", "author_url": null, "date": "Jun 14, 2011", "message": "@Bill I have.  And as far as I can tell, it wasn't because the question quality was low; at no point did I have any trolling intention.  It was because frankly a lot of people disagreed with them.  Is that a good reason to be banned?"}, {"author_name": "Jonathan", "gravatar_hash": "f3b9829c592fd7617525afc56118a629", "author_url": null, "date": "Jun 14, 2011", "message": "The limit, is that network wide or per site? How will this work in places like libraries, work or schools?  It's good to have a limit but I hope it doesn't cause problems for people that it shouldn't do. \n\nBtw on meta sites voting should be whether you agree Witt the persons post or not. So reputation modifications should be removed for the caster and castee"}, {"author_name": "Tony", "gravatar_hash": "886427a445a180eb6618d77ee4ec4894", "author_url": null, "date": "Jun 14, 2011", "message": "Did you query the database and determine people who ask many questions do ask questions of poor quality? While personally I won't hit the 6 &amp; 50 limits, I think others will and this encourages creation of multiple accounts. Yes.. some users don't care about reps. They just need answers.\n\nPersonally I noticed most low quality questions come from users who have names like userXXXXX (XXXX is a number) or with rep less than 10. I just did a quick search and the most recent queston from a userXXXX, 5 mins ago, has one down vote on their question."}, {"author_name": "LarianLeQuella", "gravatar_hash": "08f2eeded9d67d89d14a1939b11a9557", "author_url": "http://larianlequella.com", "date": "Jun 16, 2011", "message": "*blush*"}, {"author_name": "Dave", "gravatar_hash": "6fffbf547f0efa568396d6e21631884d", "author_url": null, "date": "Jun 16, 2011", "message": "While I understand the need to limit duplicate questions, I have to say that this shouldn't be something that you don't give a little wiggle room on though.\n\nIt's ok for the community to say to a poster \"Hey, this was already posted over here\".  Fine, and definitely the poster should be looking at them when referred and closing or deleting their own question if the others have answered their current/new post.  \n\nSo on the other hand, in some cases (many) the poster goes and takes a look at these duplicates that people are bitching about.  But if the poster feels that the answers given in other user's post(s) is not adequate then the poster shouldn't have to put up with people trying to close his/her question just because people take out the \"it's already been asked\" flag.\n\nThe point is, sometimes there are reasons people re-post a question that may have been answered even in 3-5 other threads.\n\nWhy would one possibly repost a question that's already been posted?  Possible reasons:\n\n\n1) Other posts that were researched did not answer their question, therefore they know they are posting it again but they try to do it in a different light or hope that this time around there comes a better set of answers.  Some people know they have a better way to ask a question than previous posters and know they can get a better response in these cases as the other previous posts by other users out there have not helped after review.\n\n2) Everyone learns differently.  And everyone explains things differently.  Some people just suck at explaining things.  They are poor communicators and even sometimes asses.  So the point here is just because \"the question has been answered\" in x post, doesn't mean that the answers (regardless of the fact that the answer was liked by many) are sufficient for someone because they still may not understand it.  So they are posting it again so they can mold their own communication style in possibly a new context and might have a better way at getting better responses than that \"other\" post\n\n\n3) Just because I post something similar to another, doesn’t mean I’m asking for necessarily the same info. I may be asking for the same and MORE as stated in the post detail. There are often times I see people closing posts just because the title is the same but they don’t even look at the content of the post which might have a variation to the same topic. They think it sounds the same and try to force the poster to close it but they really don’t read. And they don’t think about the context or new problem that the poster who appears to be duping is bringing up which the enitire intent may be different even though it’s the same question being asked (plus possibly a twist to the previously answered questions).\n\nNow take that and collectively yea, you have a bunch of \"duplicate posts\".  But that's really kinda of a narrow minded attitude toward this.  Because collectively those 5-10 posts on the similar topic ends up with 50-100 replies that collectively has a wealth of information about that issue, and has 50-100 ways of it being communicated which would mean that in one of those posts, it's going to help this person or that person depending on their learning style.\n\nSo I totally disagree that having duplicate posts are a downfall of forum quality.  I agree that we should definitely first off be pointing people to posts already made.  Because half the time they will answer the question and thus the poster can just delete his dup.  But that's not always the case...not at all.\n\nThe human aspect needs to be in this equation.  It shouldn't be a clear cut flag.  There are benefits that people have not even considered it looks like here where duplicate posts are not 100% horrible in any forum.\n\n\nNot all problems are the same 100%. It’s assumed that if one question was answered already that surely it will resolve any future question whatsoever on that topic or error or whatever you have…but that is not how code is. Code is not black and white. And questions and answers shouldn’t be expected to be black and white. Variations of the same question should be allowed and accepted by the community here trying to help someone understand or assist in a real problem or learning blockage.\n"}, {"author_name": "Eric", "gravatar_hash": "4e99da570c58f9d0b99d64df07cba078", "author_url": null, "date": "Jan 24, 2012", "message": "http://ithavoc.wordpress.com/2009/08/31/stackoverflow-com-sucks-take-1/\n\nthe point is, our craft is not always black and white.  A forum is social, and Stack is missing the point.  While the intent may seem good to the owners to try and get perfect toned, specific, problem type of Q+A, the fact is development is not black and white.  Architecture is not black and white.  And so Stack will try but in the end it shouldn't try and can't be black and white expecting people to put up with their questions constantly being closed no matter if it's a repeat or if it's open ended, argumentative, advice oriented, whatever you want to call them."}, {"author_name": "Jonathan Hoyland", "gravatar_hash": "a1d4314c349eacd28a0a7df233246a51", "author_url": null, "date": "Jul 25, 2012", "message": "Perhaps you could add incentive to editing posts with a negative vote count, which then become questions with a positive vote count. \nFor example a badge named \"Gifford\" awarded for a reversal of votes on a question after editing five times. William Gifford is claimed to be the editor of the works of Jane Austen, whose hand-written prose featured \"a powerful counter-grammatical way of writing\" and \"a limited range of punctuation\" quite unlike the much beautiful prose we know and love today. \n\nhttp://www.bbc.co.uk/news/entertainment-arts-11610489"}]}