{"response": [{"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 16, 2011", "message": "Great podcast, but these show notes aren't. They're basically just a summary of the entire conversation; while that's good for searching, it's not very useful for a listener to read to accompany the show.\n\nAnd where are the links? I understand that it's hard to get links for every single item, but there are several things in this podcast that it would have been helpful to provide links to, yet there's only *one* link in the bulleted section."}, {"author_name": "Kris Koeller", "gravatar_hash": "52af93c57493c8c63fcf6d827d6bde4f", "author_url": "http://www.kriskoeller.com", "date": "Jun 16, 2011", "message": "Notes aside, a great episode."}, {"author_name": "Jonathan Sampson", "gravatar_hash": "a84a8714fd33f6676743f9734a824feb", "author_url": "http://sampsonblog.com", "date": "Jun 16, 2011", "message": "Excellent show; really glad you guys have added video. If I might make one suggestion, work on finding a solution to the problem of Jeff having no on-screen presence (well, excluding the monitor in the far back of the room). It's very odd watching two people discuss a topic, and then a third voice speaks up and engages the two on-screen faces. This aside, I'm very happy the SE Podcast is back, and it's a great pleasure to tune in each episode!"}, {"author_name": "matt b", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Jun 16, 2011", "message": "Is the video stream not saved for watching later?"}, {"author_name": "Scott", "gravatar_hash": "6285ff8f79ce11a5c9161011137258bc", "author_url": null, "date": "Jun 17, 2011", "message": "Why does the mp3 file always have a stupid name? The link appears to be 17251043-stack-exchange-se-podcast-08-w-marco-arment.mp3 but it always tries to save as boCJurhmwpel.128.mp3..."}, {"author_name": "doug", "gravatar_hash": "cdfc4210152d2feae95daaf990f1f04e", "author_url": null, "date": "Jun 17, 2011", "message": "love the outro music. good podcast."}, {"author_name": "Ryan Ische", "gravatar_hash": "b3c9907de4bd649b93708d723dbc9ae1", "author_url": null, "date": "Jun 17, 2011", "message": "The alt-text for the hug icon should be \"completely platonic\".\n\nI think producer Alex should get a microphone... so he's not a second-class host."}, {"author_name": "Brad Campbell", "gravatar_hash": "fcfb92ad2a467a95166bb464e584bd34", "author_url": null, "date": "Jun 17, 2011", "message": "Awesome episode. Lively debate about computing topics by people with various backgrounds is what I missed during the hiatus. Good balance of tech news/issues and SE news.\n\nProducer Alex needs to work on the audio mixing. I could barely hear Joel and Alex (hey Joel, speak into the microphone!) without turning the volume way up, and then Marco's voice was booming.\n\nThe live broadcast with chat is a nice addition. Keeps Joel honest :)."}, {"author_name": "arrocharGeek", "gravatar_hash": "dc32e75e99a6e56a2ed856412a04ba3c", "author_url": "http://arrochargeek.com", "date": "Jun 18, 2011", "message": "Awesome show.  Awesome podcast.  Awesome guest.  I've listened to #3-#8, and it appears producerAlex is not only chiming in more, but is sometimes asked to make announcements.  When you get a chance, I agree he should get a mic.\n\nRegarding the topic of how to provide an outlet for the gratitude of anonymous users that find their answer on SE, I offer these thoughts:\n- can the button be called \"thank the author of this answer\"?\n- can each SE user simply have a \"# of times thanked by anonymous users\" counter on their user page?  sort of a little friendly kudos for writing a great answer that was accessible via search\n- only the author of the answer is impacted by the thanks - it does not impact any of the voting, sorting, etc.\n- internally you could put these anonymous pseudo-up-votes (literally \"thank-yous\") in a separate container from votes."}, {"author_name": "arrocharGeek", "gravatar_hash": "dc32e75e99a6e56a2ed856412a04ba3c", "author_url": "http://arrochargeek.com", "date": "Jun 18, 2011", "message": "oh... one more thing... the author of the question also deserves the feedback of the \"thanks\" button - for their part in writing a great question that was findable on search (leading to the anonymous viewer). &amp; only show thank-you buttons when the visitor is anonymous.  Do not show when user is signed-in SE user."}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": null, "date": "Jun 19, 2011", "message": "Brad Campbell noted: \"Producer Alex needs to work on the audio mixing. I could barely hear Joel and Alex (hey Joel, speak into the microphone!) without turning the volume way up, and then Marco’s voice was booming.\"\n\nI know I've harped on this in the past, but I gotta keep harping on it. Are you guys still using the Levelator? If not, please start!"}, {"author_name": "BradC", "gravatar_hash": "c5c2165949f71bcd1fafbd8e694ab5f2", "author_url": null, "date": "Jun 20, 2011", "message": "Definitely like the idea of \"non-member\" upvotes. \n\nI have an account on a dozen or so SE sites, but occasionally will find my way to a quality question/answer on one of the (numerous and growing) SE sites where I don't have an account (via a link, or sometimes by browsing the \"interesting questions\" list on stackexchange.com).\n\nI find it MASSIVELY ANNOYING to try to upvote a question or answer on one of these other sites, only to be told to create an account."}, {"author_name": "CarlF", "gravatar_hash": "18e6b959447f3bba9117f1392a52e8cd", "author_url": "http://blog.nitpicking.com", "date": "Jun 22, 2011", "message": "Jumping in late, but the above two comments about volume are absolutely right. Joel was almost inaudible.\n\nAnd if Producer Alex is going to be <i>asked questions and expected to answer as part of the show</i> ...\n\n<b>GIVE HIM A DAMNED MICROPHONE!</b>"}]}