{"response": [{"author_name": "David", "gravatar_hash": "fc12dcffc04bb2b7d59caa8f70776f38", "author_url": null, "date": "Jun 08, 2011", "message": "Are there any plans to make the videos available after the podcast has been streamed? I'd like to watch it but I live in Australia and I'm not interested in getting up at 6:00am (yes there is still laziness in the future!) to watch it live."}, {"author_name": "Sai", "gravatar_hash": "094697adcec6b1d9a4cf17d6a3bd81a8", "author_url": "http://www.dramira.com", "date": "Jun 09, 2011", "message": "Hey guys can you please text format the blog content otherwise I really like the blog."}, {"author_name": "Joss Delage", "gravatar_hash": "a3d1f769479931a7770618c43e49654d", "author_url": null, "date": "Jun 09, 2011", "message": "Would love to hear Steve Yegge as a guest one more time."}, {"author_name": "a", "gravatar_hash": "d10ca8d11301c2f4993ac2279ce4b930", "author_url": null, "date": "Jun 09, 2011", "message": "There were a few general CS proposals on area 51 where the technical computer science questions on Stack Overflow could go but they were all shut down by some high reputation users on  area 51 for no clear reason."}, {"author_name": "Richard", "gravatar_hash": "95e28ac250c4604a6f9d7e34705c3259", "author_url": "http://rjcox.co.uk", "date": "Jun 09, 2011", "message": "It world be better if store.stackexchange.com gave some indication of shipping costs (at least without starting checkout)."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Jun 09, 2011", "message": "The difference between reddit and the Stack Exchange home page is that on reddit I can subscribe or unsubscribe to different subreddits.  If I disagree with the general politics of reddit, I can just unsubscribe from reddit/r/politics and it never shows up on my reddit home page.  Give users control of what SE sites show up on the SE home page and it will become a lot more useful.\n\nRelevant Meta discussion: <a href=\"http://meta.stackoverflow.com/questions/93535/hot-questions-inability-to-filter-sites-and-now-german-questions-too-much-n\" rel=\"nofollow\">Hot Questions, Inability to Filter Sites… and now German questions? Too much “Noise”!</a>"}, {"author_name": "trampster", "gravatar_hash": "1c5255f8496fcade0244f12cb6ca6405", "author_url": null, "date": "Jun 09, 2011", "message": "The question you want to ask yourself regarding hell banning is this:\n\nDo you want to educate the user so he can learn to contribute constructively?\n\nor\n\nDo you want the user to just go away?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 09, 2011", "message": "@bill \n\nThis feature used to exist on http://stackexchange.com but it was removed due to lack of use. I asked David about this and he indicated \"Yes, it was not used very much. After we got rid of it, only one person even noticed for several weeks.\"\n\nI suspect once we filter out questions with too many non-English words -- this is live now -- the desire for this will wane as before.\n\nThat said, there are plans to use a <a href=\"http://blog.stackoverflow.com/2011/04/improved-tag-sets/\" rel=\"nofollow\">tag filter</a> as the homepage on http://stackexchange.com if you so desire."}, {"author_name": "Maxim Zaslavsky", "gravatar_hash": "319bd6ef9c9c8d876f731150cb4951c7", "author_url": null, "date": "Jun 09, 2011", "message": "Hey guys,\nGreat podcast! One quick off-topic question: what was the music that played at the end? :)"}, {"author_name": "DavidS", "gravatar_hash": "01632db9787f8da89709d5aa098ddd5e", "author_url": null, "date": "Jun 10, 2011", "message": "Re: Questions about CS theory which are too low level for cstheory\n\nI would suggest math.SE . This was discussed previously on the math.SE meta http://meta.math.stackexchange.com/questions/1966/migration-from-cstheory-to-math-se and people there seemed welcoming. If you look at the tags computability, computer-science, np, asymptotics or automata on math.SE, you'll see that there are a lot of math.SE people with a decent understanding of undergraduate level CS theory who are willing to answer these questions."}, {"author_name": "Stephen Darlington", "gravatar_hash": "de1c8686d474f502849acbf1d19ac4b7", "author_url": "http://www.zx81.org.uk/", "date": "Jun 12, 2011", "message": "On the whole Reddit/language/interesting thing, to pick an example in the current \"hot\" list, I find the question \"How can I kill adorable animals?\" way more jarring than anything in a foreign language. I have no expectation of understanding, say, Japanese but Gaming questions often seem out of place or in bad taste when mixed with Computer Science or Photography or Skeptics questions."}, {"author_name": "Guy S.", "gravatar_hash": "6a9585f2d8e8f07a83712a5dc61e35f9", "author_url": null, "date": "Jun 12, 2011", "message": "Think I've suggested it before - but have you considered hosting a Experts Exchange guest spot to clear the air? Perhaps a community volunteer or corporate staffer. It could make for an interesting chat if this post is any indication:\n\nhttp://meta.stackoverflow.com/questions/92683/what-experts-exchange-thinks-of-stack-overflow\n\nThat said, I suppose it's far easier to throw stones from afar without needing to directly respond to claims you've made about thy sworn enemy."}, {"author_name": "Eber Irigoyen", "gravatar_hash": "fa9ea5f13c571513f96d73fec07f99d8", "author_url": "https://twitter.com/BlackTigerX", "date": "Jun 13, 2011", "message": "you already let the users chose their favorite tags, why don't you use that feature to let the users group the stuff that they want to see (ony questions related to that), instead of you creating subdomains to group tags\nthe feature could be something like \n\nstackoverflow.com/username/name_for_group_of_tags\n\nor even just have a section (like questions, tags) where it shows only questions related to the favorite tags"}, {"author_name": "Evan", "gravatar_hash": "35fc5853be2c9206609f1483b83b5808", "author_url": "http://www.michevan.id.au/", "date": "Jun 16, 2011", "message": "With regard to not showing questions on http://stackexchange.com that contain little English, and mostly another language, I was thinking you could use the \"Accept-Language\" HTTP header from the browser to allow questions in accepted languages through for an individual."}, {"author_name": "Newt", "gravatar_hash": "4c571019bd5045b38011ce8d5136e18e", "author_url": null, "date": "Jun 17, 2011", "message": "Have you guys talked to your EEOC compliance officer or your lawyer about these employment aptitude tests?  They are presumptively against federal law.\n\n(google:  Griggs v. Duke Power Company)"}, {"author_name": "Jason C. Levine", "gravatar_hash": "571fb6e951518d537f67d714bf1b9bc2", "author_url": "http://www.experts-exchange.com/", "date": "Jul 22, 2011", "message": "@Guy\n\nI'd be down with it if Jeff/Joel are."}, {"author_name": "Mark Barbir", "gravatar_hash": "e5d1cc3ce9578d0b67de0a3fe68780f6", "author_url": "http://www.experts-exchange.com", "date": "Jul 22, 2011", "message": "Likewise, Jason.\n\nWe could pretend it's AM talk radio and pit EE vs SE in a social war/apocalyptic context.\n\nJoel and Jeff can play less than accommodating hosts. We can scream at each other. It'll be great fun."}]}