{"response": [{"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": null, "date": "Jun 29, 2011", "message": "Kudos on the sound quality on both #9 and #10. I know you felt you had a few problems with Greg's mic in #9, but, over the course of the entire show, things were much improved over what we heard in 1#-#8. \n\nI criticized several of those shows for their sound levels, so just wanted to let you know, whatever changed in these last two episodes has made a very positive difference and (as a person with hearing problems) I greatly appreciate it!"}, {"author_name": "Justin Nelson", "gravatar_hash": "d787caaf04b85641692a24099fcee990", "author_url": null, "date": "Jun 29, 2011", "message": "It was fantastic to hear from a person with a non-software background!\n\nPlease try to do that more often.  Super refreshing!"}, {"author_name": "MBraedley", "gravatar_hash": "faee7c8a4f200567714ca387446d8721", "author_url": null, "date": "Jun 30, 2011", "message": "I like this guy.  Thumbs up for mentioning Mike Holmes.  Speaking of Mike Holmes, he needs to get on the DIY SE."}, {"author_name": "Brian", "gravatar_hash": "0543a80ecf4a3396264e892d87a6297c", "author_url": null, "date": "Jun 30, 2011", "message": "Steve Karantza was great! I could have listened to another hour. Great job guys!"}, {"author_name": "Jorge", "gravatar_hash": "d4f7d15de2abdec49cacaac7d14f00fc", "author_url": null, "date": "Jul 06, 2011", "message": "I totally want a different non-tech subject each time now, it's interesting to hear how other non-software people talk shop."}, {"author_name": "steve karantza", "gravatar_hash": "d81e2e3c85fece374d8c01390b80c821", "author_url": "http://axiomhomeservices.com", "date": "Jul 07, 2011", "message": "Glad to hear others enjoyed the podcast as much as I did. It was a lot of fun to do, and the crew at SE are a great bunch of guys. The hour flew by. I am looking forward to hearing from other disciplines on future podcasts as well. Thanks for the nice comments."}]}