{"response": [{"author_name": "Troyen", "gravatar_hash": "38c4716a36624814c1e0c7fd527150a9", "author_url": null, "date": "Jun 01, 2011", "message": "Just a quick suggestion for the next live podcast: when you're answering questions from the chat room, can you please read the question you're about to answer?  A few of the earlier questions just jumped right into the answer, which made it hard to figure out what was being talked about purely by listening (the war question, for example)."}, {"author_name": "Benny", "gravatar_hash": "ee98cccb68318cf0ec167c05fd3ace7e", "author_url": "http://geekswithblogs.net/benonsoftwrae", "date": "Jun 01, 2011", "message": "About the job, Why not post it on Carers 2.0?"}, {"author_name": "Grzes", "gravatar_hash": "712248df6de12dd9b8ba73869a110f1f", "author_url": null, "date": "Jun 02, 2011", "message": "Nice one @Benny :). \n\nFor people who didn't try it yet - its because Careers are pretty much empty atm."}, {"author_name": "Justin Nelson", "gravatar_hash": "d787caaf04b85641692a24099fcee990", "author_url": null, "date": "Jun 02, 2011", "message": "I enjoyed listening to the podcast live.  I hope you keep it up.\n\n'See' ya next Tuesday."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": "http://blog.stackoverflow.com/", "date": "Jun 02, 2011", "message": "@Benny\n\nBecause its not a programming job?"}, {"author_name": "Richard", "gravatar_hash": "95e28ac250c4604a6f9d7e34705c3259", "author_url": "http://rjcox.co.uk", "date": "Jun 03, 2011", "message": "FYI the tendency of numbers starting with 1 to be more common is a real statistical effect: Benford's Law."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jun 03, 2011", "message": "In the beginning of the post you mention some people don't like the way the system works, pointing to a stackoverflow meta post about a rather good \"rant\" about how voting doesn't seem to appeal him.  \n\nThen you go on to say\n\n\"Down votes no longer cost you, the down-voter, any reputation points on questions only.  We found that too many people weren’t willing to down vote questions because of the -1 cost to the voter. Downvotes on questions are a critically important signal for us in separating the good questions from the not-so-good questions\"\n\nMy answer to that is they should of NEVER cost me anything, and for that matter, why are downvote answers -1 to the person making the downvote?  It is an opinion and should not be a charge and a slap in the wrist.  Shouldn't the whole point of the system be a good q&amp;a site that really doesn't run on a +/- rep voting scheme.  I am not saying get rid of voting, what I am saying is make it fair.  If I downvote an answer there is a reason for it, yet you charge me for the downvote..."}, {"author_name": "John Dyer", "gravatar_hash": "0fc637a07270d4dfbf6958a281a5305e", "author_url": null, "date": "Jun 03, 2011", "message": "Just a comment about the audio quality, I listen to the podcast during my hour commute in the car.  It really sounds like Jeff is moving around a lot relative to the microphone, his sound level goes up and down through quite a range.  If I was listening with ear-buds I don't think this would be an issue but with car noise it makes it difficult at times.\n\nOther than that, another excellent show and I'm looking forward to listening live soon."}, {"author_name": "Brian", "gravatar_hash": "4f3a4689573d08344693d5b68b004f42", "author_url": null, "date": "Jun 05, 2011", "message": "Is there a version of the Gordon Bing gamification talk online anywhere?  I listened to the podcast and now  I'd like to hear it."}, {"author_name": "Guy S.", "gravatar_hash": "4d1fc0d8cd4ed9dcec72731a519035cf", "author_url": null, "date": "Jun 07, 2011", "message": "Guys - have you considered hosting Experts Exchange a guest to clear the air? Perhaps community volunteers versus the corporate folks. Perhaps both.\n\nhttp://meta.stackoverflow.com/questions/92683/what-experts-exchange-thinks-of-stack-overflow"}, {"author_name": "Mark", "gravatar_hash": "841dcabec488729f9d583ebb11e9b14a", "author_url": null, "date": "Jun 09, 2011", "message": "If I could change something about Stack Exchange, it would be to make it very easy to never see closed questions. \n\nHonestly, for every closed question due to it being a dupe or obviously wrong, it feels like I run across at least two other questions that it _appears_ that some people simply don't like. I've seen questions get closed that had several answers already, etc. etc. \n\nI'm almost certainly oversensitive about this, but honestly if I could just somehow never see a closed question again, I'd be much better off, and could stop equating Stack Exchange with the Wikipedia modmins."}]}