{"response": [{"author_name": "Josh Smeaton", "gravatar_hash": "3891f38e5165127cac92a4e9e4aba688", "author_url": null, "date": "Apr 05, 2011", "message": "You got 21 up-votes for that question? There really ARE perks being at the top of the ladder aren't there? :P"}, {"author_name": "Arjan", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "Apr 05, 2011", "message": "&gt; hey, there’s a site for that!\n\nOr, two! (Spreading some love for Super User.)"}, {"author_name": "Mike Burton", "gravatar_hash": "5b800d2444930f6f465fb284647b5204", "author_url": "http://about.me/michaelburton", "date": "Apr 05, 2011", "message": "Jeff,\n\nAt one point a few months ago I tweeted a complaint about Zendesk, and was surprised to see them tweet back with a zendesk ticket addressing my complaint.\n\nTurns out they have a very nice integration for addressing issues raised on twitter.  Getting a real person to follow through and try to address my tweet impressed me immensely.\n\nSeems like it would be very cool if there was an easy way post twitter questions to stackexchange.  One can imagine many ways to do it, but ideally it would allow the asker and/or their followers to post a tweet to stackexchange, reply to the original poster letting them know of the question, and allow them to sign up for twitter replies as new answers are posted.\n\nWould be a great service to the twitter community by making the sorts of interactions in your blog post happen more easily."}, {"author_name": "Hogan", "gravatar_hash": "face3276756bf64319a7d1df0d194d5c", "author_url": null, "date": "Apr 05, 2011", "message": "@Jeff - Please consider marking more answers as excepted.  50% is not so good, you will get answers quicker if you improve this rate.   (grin)"}, {"author_name": "Trufa", "gravatar_hash": "b685494fc3e6341655360971b1178e0d", "author_url": null, "date": "Apr 05, 2011", "message": "@Jeff:\n\nBeing the devil's advocate here, this question got special attention being you that asked... \n\nEven so, I completely agree with the main point of the article."}, {"author_name": "Nathan", "gravatar_hash": "0a1a220854cb0e2a7d4d7a1e1bc638b8", "author_url": "http://nathandewitt.net/", "date": "Apr 06, 2011", "message": "So did it work?  I went to the Apple stackexchange, and I didn't see any indication that Tim Bray joined the site or even noticed that you asked the question on his behalf.\n\nSaying this is a great way to get experts to come to the site is only valid if it does, indeed, get experts to come to the site."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 30, 2011", "message": "@nathan like anything else, you have to do it over and over to get better at it. I'm pretty sure Tim saw the answer there, and that's all I care about -- but I'm confident others probably noticed as well.\n\nWorst case scenario, all we have to show for our efforts is another GREAT question with GREAT answers. How terrible! :)"}, {"author_name": "Standback", "gravatar_hash": "3d128cc7f8c5851f34e6a591aa98fa43", "author_url": null, "date": "May 03, 2011", "message": "@Nathan: No less to the point - if the site gets questions that experts are asking, it'll be a better, higher-level Q&amp;A resource than if it doesn't."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 01, 2012", "message": "Real world example of this in action with John Carmack:\n\nhttp://superuser.com/questions/419070/transatlantic-ping-faster-than-sending-a-pixel-to-the-screen"}]}