{"response": [{"author_name": "Ivo Flipse", "gravatar_hash": "f7ae8c8fb83e502a854e2db3410f3827", "author_url": "http://superivo.wordpress.com", "date": "Apr 27, 2011", "message": "I still think its awkward I have to keep set favorite tags on all sites I participate on. Surely you have enough information about me to guesstimate what kind of questions I might find interesting?"}, {"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Apr 27, 2011", "message": "Personally I wish tag sets directly correlated to what I set on the site. Also in our \"notifier dropdown\" I could care less about \"hot questions\" What I want is to see my \"inbox\" and maybe questions in my tag sets, visiting yet another page makes little sense to me."}, {"author_name": "Ben Hoffman", "gravatar_hash": "04c4599036f6856ae5c2772f780c1886", "author_url": "http://www.randomben.com", "date": "Apr 27, 2011", "message": "I just tried the updated filter out and it is very confusing to me.  The \"Just Questions Tagged\" input is either not working properly or is confusing to me.  If I choose C#, then press space and type in linq in an attempt to add the linq-to-sql tag the auto-complete finds nothing. On top of that I would like to enter 10+ tags and the field currently maxes out at 25 characters. Am I doing something wrong?\n\nAll I want is to be able to see is all of questions on the sites I choose that have a tag matching one of my favorites for that site.\n\nLooking at it, I think it would make more sense to choose sites first and then choose the tags you want to follow.  That way you could possibly show the tags I already have favorites for on those site.  Then it would be really easy to fill out."}, {"author_name": "Rebecca Chernoff", "gravatar_hash": "dabd223496ac04bc7ae811f815008a2b", "author_url": null, "date": "Apr 27, 2011", "message": "@Ben, you need to create multiple rules in the filter for that.  Put in c#, then hit \"add rule\".  Then do it again for linq-to-sql and hit \"add rule\"."}, {"author_name": "Umur Talib", "gravatar_hash": "294126d72140d02bf5ceacc9514c5df2", "author_url": "http://demle.net/tag/Sevgi/", "date": "Apr 27, 2011", "message": "I am doing a study like this on my own website. My goal is to create automatic label the words used in the text. But the Turkish language will be quite difficult as it seems."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 27, 2011", "message": "@ben we're clarifying the UI to make it more clear it's one tag at a time."}, {"author_name": "Smashery", "gravatar_hash": "04c4396f3d538f5aad32adb496467de3", "author_url": null, "date": "Apr 28, 2011", "message": "Nice work! I'm still confused by the list of popular filters. Looking at them puts me off a little, because to understand a filter, I have to read all of its parameters. It would be nice if the filter's name was prominent in that list."}, {"author_name": "Morgan Craft", "gravatar_hash": "199139d3e9e288e8da365eb598d86b81", "author_url": "http://morgancraft.com", "date": "May 01, 2011", "message": "Just stumbled onto this filtering system, entry into it was a little rough.  However, I love the idea and have already created several filters.  I saw the support for ATOM feeds was curious if you plan to support a read API for filters?"}, {"author_name": "awe", "gravatar_hash": "bb430dc40c4648586562d2ef22c8557b", "author_url": null, "date": "May 30, 2011", "message": "@Smashery: I guess the popular filters would not be set a name by everyone use it, and even there can be identical filters where people assign different names to the same filter. I agree that it would be helpful thought, but this will need some well defined rules for how to display the name. If it is just \"My filter\", it should not be displayed, and if there are multiple names, then it might be the first one that named the filter, or the most used if same name is used for it by more than one."}]}