{"response": [{"author_name": "dmo", "gravatar_hash": "bfc44a56d7d906ed17d0c2059933f25b", "author_url": null, "date": "Apr 27, 2011", "message": "I'm not sure if you guys have any recourse, but your podcast takes a long time to show up on the mobile iTunes store."}, {"author_name": "mj", "gravatar_hash": "0197c1e31b3a0146bc6cdbc95f399f11", "author_url": null, "date": "Apr 27, 2011", "message": "Is there any solution for mobile folks who don't have iphones?  Any Android users here?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 27, 2011", "message": "@mj there is a \"download\" link above which should work"}, {"author_name": "Daniel", "gravatar_hash": "1c5255f8496fcade0244f12cb6ca6405", "author_url": null, "date": "Apr 27, 2011", "message": "Problem is you deliberately devalued questions when you halved the rep gained on up votes. Which you applied retrospectively to peoples existing reputation. This was a hard lesson to people with lots of questions and taught them that you did not value questions and thus reduced their incentive to upvote. Why should I upvote something with low perceived value?"}, {"author_name": "Banang", "gravatar_hash": "3f75c26671ae636dea2d0aac39946665", "author_url": null, "date": "Apr 28, 2011", "message": "Jeff, I was on the bus listening this morning, and I couldn't wait to get off it just so that I could tell you (even though you probably already know) that for cross-cutting concerns and patterns you find yourself applying over and over again, like what you describe with your caching, you should really consider using aspects. Seriously, it will make your life easier, and your code more maintainable and pretty. \n\nThere are several frameworks for AOP in .Net. I have used (but am not affiliated with) an excellent one called PostSharp (http://www.sharpcrafters.com) that will let you factor your \"check if this is in the cache - otherwise go fetch\"-pattern out into one single aspect that you can then apply to all the places where you use this. In this way, if you ever need to change your caching strategy, you'll only need to change the code in one place, rather than in a thousand of them. This also applies for your error handling, your transaction handling, and your performance tracing (guerrilla style). Aspects totally changed my way of coding, for the better. \n\nLove that the podcast is back, can't wait for next week's instalment."}, {"author_name": "Tshepang Lekhonkhobe", "gravatar_hash": "88e60659e997d36af3ff348b3251e1a6", "author_url": "http://tshepang.net", "date": "Apr 28, 2011", "message": "I haven't listened to many podcasts, but I really enjoyed this one.\n\n* The justifications for closing How Things Work (which I committed to) are excellent.\n* I also the explanation of the behind-the-scenes server stuff.\n\nThe whole experience leads me to think that you guys really takes this project seriously. I guess I always knew that, but listen to you guys reinforce it.\n\n[sidenote] Joel kept irritating me by interrupting Jeff way too often. It reminds me of me when I talk to people, when trying to keep interested/focused in what they have to say (I lose interest/concentration real easy)."}, {"author_name": "THenrich", "gravatar_hash": "886427a445a180eb6618d77ee4ec4894", "author_url": null, "date": "Apr 28, 2011", "message": "Why the random filename?"}, {"author_name": "tim", "gravatar_hash": "94a0e83767dbc71db135454693540015", "author_url": null, "date": "Apr 28, 2011", "message": "You lost me at the point where I was asked to donate to an internets museum."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 29, 2011", "message": "@tshepang Joel and I interrupt each other all the time.. we try to avoid doing it as much as we can, but we're both natural chatterboxes, so it's a best effort sort of thing."}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": "http://alertfalse.com", "date": "May 01, 2011", "message": "Any thoughts to when the 'General Reference' close reason might appear on Stack Overflow, or criteria for what would make you decide to deploy it?"}, {"author_name": "Jesse Gavin", "gravatar_hash": "09e59b0f8ac4ce9f50db49dc35cedb17", "author_url": "http://codegavin.com", "date": "May 02, 2011", "message": "Thanks for not putting an intro or any \"bumper\" music in the podcast. Nothing is more annoying."}, {"author_name": "David McKenzie", "gravatar_hash": "c8675f33db6abf21dfda734e66d53f09", "author_url": null, "date": "May 03, 2011", "message": "I love that the podcast is back, but please, please fix the audio levels. The overall level is too low, and the level on Joel's mike is way, way too low. Listen to your podcast and .NET Rocks side by side, and you will see what I mean."}, {"author_name": "Paulovski", "gravatar_hash": "053411d4b35e2e33faeca76a8613b728", "author_url": null, "date": "May 04, 2011", "message": "I heartily welcome the return of the podcast...Joel's monochordic voice turns out to be the best sleeping pill for me...It really works!"}, {"author_name": "Chris", "gravatar_hash": "5796cb83a9abf0244d4e2eb295999368", "author_url": null, "date": "May 07, 2011", "message": "Can we get a proper podcast rss feed please?"}, {"author_name": "Richard", "gravatar_hash": "13ddf03fd88f7c02616528077210ec64", "author_url": null, "date": "May 17, 2011", "message": "@jeff\n\nHave you taken into account that your filter takes away information I might need because it provides me what I want instead?\n\nDiscussed in this ted talk:\nhttp://www.ted.com/talks/eli_pariser_beware_online_filter_bubbles.html"}]}