{"response": [{"author_name": "Felix", "gravatar_hash": "2863e506256679592c6d824b2a1b69a5", "author_url": null, "date": "Apr 08, 2011", "message": "My only advice: next time, do it on a weekend (at least Friday). I didn't attend my local meetup because I was after 6 hours of work, another 6 of school (I would've been late to the meetup anyway) and with the alarm clock set to 8 A.M. the next day. I was really sad!"}, {"author_name": "Feanor", "gravatar_hash": "a0755352547743c97a290e7158e144c6", "author_url": null, "date": "Apr 08, 2011", "message": "@Felix: Agreed. I was at the Seattle meetup but I had to leave rather early. I'm glad I got to go and hang out with a bunch of very smart people, though. Love to do it again soon."}, {"author_name": "Bill P. Godfrey", "gravatar_hash": "760bfd359153d0682dbe113dc02f81ba", "author_url": "http://billpg.com/", "date": "Apr 08, 2011", "message": "No one came to my local one, even though three people signed up. :("}, {"author_name": "Chris", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.shrinkrays.net", "date": "Apr 08, 2011", "message": "I'm curious - what do you talk about at these meetups? Programmers only? Or do people get to 'network'?"}, {"author_name": "Ben", "gravatar_hash": "7fc08a3fdbc3e903bd25960e2a00e35a", "author_url": "http://bytesrc.com", "date": "Apr 08, 2011", "message": "Hey I took that Seattle photo! :-) Now I wish I was in it."}, {"author_name": "Sandeep Kumar M", "gravatar_hash": "1fd85b1d1fd187c0c058066ad3823afb", "author_url": "http://stackexchange.com/users/c9387e9d-9308-4b5b-af7f-f95d605b3f55", "date": "Apr 08, 2011", "message": "OMG! Our photo listed in SO blog... :)\n\nKozhikode, India\n\nhttp://www.meetup.com/stackoverflow/Kozhikkod/"}, {"author_name": "Marco Ceppi", "gravatar_hash": "c127c8150f8052e4b89d66f42b99be56", "author_url": "http://marcoceppi.com", "date": "Apr 08, 2011", "message": "@Chris a whole host of things. We had conversations ranging from the latest video games out, technology people were developing in the mid-90s, literature, vi v emacs v pico, trash talking programming languages, and an interesting discussion on liquor - to name a few.\n\nIt was a rip-roarin' good time and I look forward to helping setup and attend the next one!"}, {"author_name": "Daphne O'Keefe", "gravatar_hash": "6e311c25c3c0187b3499320576a5298d", "author_url": null, "date": "Apr 09, 2011", "message": "The four of us in Charlotte, NC, USA, had a great time sharing stories about work, programming, SO strategies and other stuff. We now have bragging rights for attending the first SO meetup. I'm hoping SO initiates another one next year -- it was fun, but it won't happen without a catalyst."}, {"author_name": "Efazati", "gravatar_hash": "d5315db26a30caf851eb437e1f21f167", "author_url": "http://www.efazati.org", "date": "Apr 10, 2011", "message": "in Tehran 4 persons comes and great be come frequently in month. \nthank you SO"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 10, 2011", "message": "@Bill that's a bummer -- what was the location?"}, {"author_name": "Nick Johnson", "gravatar_hash": "dc69af7dd7151a00843602888638fabb", "author_url": "http://blog.notdot.net/", "date": "Apr 10, 2011", "message": "Heh, glad to see my sign taking pride of place. Where did you find the photo of it?"}, {"author_name": "Tom horn", "gravatar_hash": "7bb5f2493a0683f05729bfd93c4c8636", "author_url": "http://www.cannonade.net/dev", "date": "Apr 10, 2011", "message": "We had a great time in Sydney. Looks like it might become a thing.\n\nWe ate the Google food, we grilled @samsaffron on scaling and performance, we discussed crappy questions, we pondered the RPG StackExchange, we drank beer, we distributed t-shirts. \n\nalso ... ChairOverflow (via @izevaka) ... well I thought it was funny :P\n\nhttp://izevaka.posterous.com/chairoverflow-at-someetup-sydney"}, {"author_name": "Martin", "gravatar_hash": "f81482fa92712e3e58c39ad6f8580313", "author_url": null, "date": "Apr 11, 2011", "message": "The Seattle picture is 1.5 Jon Skeet's (Jarrard is the .5 :-)"}, {"author_name": "Jeff Yates", "gravatar_hash": "3b0d930715cf8f5729e177981f69f44e", "author_url": null, "date": "Apr 11, 2011", "message": "It was a thoroughly enjoyable thing even though there were only two of us (out of the five that signed up). Next time around, I intend to be more on the ball about organising but I'm reluctant to set something up outside of a global set-up like this time - imagine how many out of 5 would show then?! :D"}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Apr 11, 2011", "message": "@Bill same happened here.\n\n\n5 sign up, only two show up. \n\nI think the problem here was, nobody really knew how to spot each other.  I wear my Stackoverflow shirt and that's how the other guy recognize me.  \n\n\nI saw 3 or 4 guys walking in the Café looking for .. \"something\" in the ceiling and walls. They looked at me the same way I looked at them \"... I wonder if ... nahh\" and then they leave. That's when I decided to take my jacket off but probably was a bit late :P\n\nOut location, Mexico City!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 11, 2011", "message": "Awesome! Two (now three) bits of feedback:\n\n- we should give meetups a budget based on size that we fund (USA only? dunno about international) where we reimburse say $100 for meetups of 30 people and $200 for meetups of 60 people. This should be enough to cover pizza and drinks.\n\n- we should have guidelines about printing out (or hand-writing) name tags that include your gravatar, your tags of interest, your rep, and user name.. basically, your \"user card\" as it appears on the site. This helps immensely when getting to know people\n\n- make sure they know to clearly mark the venue and/or the participants so people can find each other -- perhaps \"seed\" the organizers with a t-shirt and ask that they prominently wear it so others can find them (like @oscarreyes)\n\nI think those three simple changes would help a lot in the future."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Apr 11, 2011", "message": "@Jeff Atwood - I think I've asked you this before, Are you serious?  If so how can I up vote your blog post comment?\nThat is totally awesome!  What an awesome awesome awesome company!"}]}