{"response": [{"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Apr 07, 2011", "message": "Have you ever considered not making them separate sites, but using google's translation API and adding subdomains to access the site in different languages and and add some kind of  \"translated from\" representation? At work I find that google translate works well enough, and better even than people who don't know english trying to write it. \n\nBiggest problem with this suggestion... would be the edit capabilities... but maybe you could make it work.\n\nPlease take this suggestion with a grain of salt as I don't speak multiple languages, and it's just my first thought, as why duplicate effort, chances are their problems are the same, we just have language barriers."}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Apr 07, 2011", "message": "I know I said this before, but there is no need for deep changes in the engine, we only need to add meta-tags so we can filter by language.\n\nHere's the rejected proposal:\n\nhttp://meta.stackoverflow.com/questions/3774/add-meta-tag-to-support-internationalization\n\n\nIn yesterday Mexico's Stackoverflow meet up, we were talking precisely about this. Why aren't there more Mexicans Software developers using Stackoverflow? There's quality, and very interesting stuff going on in the last 3-5 years, and still they are still floating around in their own communities.\n\nI think the most important barrier is the language. While most of us understand easily English ( after all we are very used to the language ) creating a question or providing an answer is a different story.  I would say we are a read-only community."}, {"author_name": "Dan Dumitru", "gravatar_hash": "dead5c6457591268b4bd4c6199fa16b6", "author_url": "http://riotingbits.com", "date": "Apr 07, 2011", "message": "Woot for Romania!\n\nI agree with you, Joel, for some audiences the only way to reach them is by creating communities in their native language.\n\nAnd although it would indeed in the beginning be more beneficial to do Stack Overflows in Asian languages, I suspect that, given how Area 51 works, we'll first see a SO in some other language - like German, French, Spanish or Portuguese  - a language widely spoken by existing SO users."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Apr 07, 2011", "message": "I don't agree with using tags for different languages. I would then miss the opportunity to answer a C# / SQL Server question because it was tagged DE (for german).\nThe true solution to this is a seperate community per language.  I know its a lot of work but maybe it is well worth it.  But and this is a but it would only work if we gain enough momentum and people from the community members.  That is if we had enough people in germany to run a stackoverflow in their language I see no issue with de.stackoverflow.com.  All content is in german.  I guess the question is what if something really cool is posted in de.stackoverflow.com, how will I ever see it?  I guess I'd then have to learn German.  Why is life always difficult :)."}, {"author_name": "Justin Nelson", "gravatar_hash": "d787caaf04b85641692a24099fcee990", "author_url": null, "date": "Apr 07, 2011", "message": "We already let any user on all of the sites edit our content.  How about adding the ability to translate content on the site.  So, instead of having new questions and answers in different languages, we modify current and future questions to be in multiple languages."}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Apr 07, 2011", "message": "@Justin: I don't think that's a good idea. Then we'll get people answering questions in foreign languages... and that will lead to a MESS."}, {"author_name": "Dan Dumitru", "gravatar_hash": "dead5c6457591268b4bd4c6199fa16b6", "author_url": "http://rdocumentaries.com", "date": "Apr 07, 2011", "message": "So far, we have:\n\nSpanish: http://area51.stackexchange.com/proposals/13664/desarrollo-de-software-en-espanol \nPortuguese: http://area51.stackexchange.com/proposals/23539/software-development-in-portuguese \nFrench: http://area51.stackexchange.com/proposals/12692/french-stack-overflow\nItalian: http://area51.stackexchange.com/proposals/25466/stack-overflow-in-italian \nGerman: http://area51.stackexchange.com/proposals/31024/programming-in-german \n\nIt will be kind of exciting to see a SE site in a different language :)"}, {"author_name": "S.Mark", "gravatar_hash": "4c171b0b48278528eaa76506ecb6dbd8", "author_url": null, "date": "Apr 07, 2011", "message": "I've undeleted my proposals of Japanese version Q &amp; A Site\n\nhttp://area51.stackexchange.com/proposals/1714/japanese-language-based-qa-site"}, {"author_name": "Ingve", "gravatar_hash": "90f3cb7214f6636f3c5c5cf25715caa0", "author_url": "http://stackoverflow.com/users/563941/ingve", "date": "Apr 07, 2011", "message": "3 of the top 4 countries are Scandinavian, but Norway doesn't even make the top 30? That seems a bit odd.\n\nIt would also be very interesting to se a similar list based on participation (questions asked/answered) per 1000 population, not just visits."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Apr 08, 2011", "message": "Kudos to Estonia for having the LARGEST meetup group, larger than New York and London! How many did show up?\n\n@Joel re, \"we want your ideas\" - I think pretty much every conceivable variation of how to tackle internationalization has already been suggested on Meta.SO at some point. Check out the i18n tag: http://meta.stackoverflow.com/questions/tagged/internationalisation"}, {"author_name": "Benjol", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Apr 08, 2011", "message": "Transmitting the Stack Exchange 'culture' is effectively going to be the hardest thing.\n\nI'm not sure how you will get a foreign language off the ground with sufficient Stack Overflow bilingual users. I don't know if I'd want to start following *another* Stack Overflow in parallel, and keeping thinking stuff like \"dupe, oh, wait, no it's not\"...\n\nOn the other hand, you could be raking in the reps just by finding equivalent existing answers in English and translating them. The highest rep user on 'language.stackoverflow.com' could just be a translator :)\n\nThere's a lot of stuff to think about, for sure."}, {"author_name": "Tiendq", "gravatar_hash": "5e397ec6e8d5b767d19ac4ebc99b5145", "author_url": "http://www.tienonsoftware.com", "date": "Apr 08, 2011", "message": "I don't agree to tag in different languages too, it's unnecessary complexity. And I don't like localized versions for non-English speaking countries too. For example, English is not our native language and most of our developers use (writing/speaking) English not very well but we can still understand (thoroughtly?) most of the English content here. Only 4 visits/1000/month from Vietnam is not English's fault :), there are other our own reasons.\n\nSadly we (Vietnam) are near the end of the list but luckily we are still in the top 30 countries :D"}, {"author_name": "Paul Morriss", "gravatar_hash": "8691b744cb9151e4a173a23eb44eab3b", "author_url": "http://paulmorriss.com", "date": "Apr 08, 2011", "message": "By way of starting that discussion I created a question and answered it:\nhttp://meta.stackoverflow.com/questions/86572/how-we-can-establish-useful-thriving-communities-in-other-languages/86574"}, {"author_name": "russ", "gravatar_hash": "fb8f14461d037d601087c32f9fa9fea5", "author_url": "http://tinisles.com", "date": "Apr 08, 2011", "message": "why do Scandanavian countries top everything? :)"}, {"author_name": "anonymous", "gravatar_hash": "d10ca8d11301c2f4993ac2279ce4b930", "author_url": null, "date": "Apr 08, 2011", "message": "It might be more reasonable to make an interface for each language and work with companies like Google to automatically translate the posts between languages. I don't think having one StackOverflow for each language is a good idea. It is like creating many copies of the same thing, like having a French, a Spanish, a Chinese, ... Java languages. It will divide the community and restrict each to their language communities."}, {"author_name": "rafek", "gravatar_hash": "7c3b45d8f867a5e405f8bb54424e2fdd", "author_url": null, "date": "Apr 08, 2011", "message": "I think that the Area 51 process (meeting a specific criteria for a site to launch) may not be appropriate from language to language (country to country). It'd be hard for small countries to have their own SE-sites - but still these communities would benefit from smaller SE-sites. So my idea is to have a separate Area 51 instance per language (where we could tweak the process), hire some community coordinators, and rule the world :) Or maybe do sth like franchising for StackExchange."}, {"author_name": "S.Mark", "gravatar_hash": "4c171b0b48278528eaa76506ecb6dbd8", "author_url": null, "date": "Apr 10, 2011", "message": "Just FYI, stackoverflow has around 200 answers per hour,\n\nhttp://api.stackoverflow.com/1.1/usage/methods/stats\n\nbut japanese version of yahoo answers (called Chiebukoro here) has around 5600 answers per hours according to their stats at http://chiebukuro.yahoo.co.jp/\n\nSo, Its hard to beat local sites, IMHO."}]}