{"response": [{"author_name": "mark", "gravatar_hash": "a7aed5c80c0c26f387eea2b26052dec6", "author_url": null, "date": "Jan 27, 2015", "message": "I'd like to block certain tags. The system detected strong SQL activity for me but I'd never consider taking a database job. It's not my career path.\n\n.NET is about as strong as SQL according to the system. .NET is my focus. That means that half of the job ad slots are wasted."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jan 27, 2015", "message": "My feedback for so careers is that it doesn't work..it really doesn't.  We've paid for 2 \"ad\" runs and never get any hits.  Sure it may depend on what your company is offering but I think there is still a lot of work to do on careers.  The UI is hard to follow when your role is both a person logged in looking for a career AND your role is also an employer looking for someone to hire."}, {"author_name": "Trevor", "gravatar_hash": "bda66896b4f71e20bdfb232e537ba189", "author_url": null, "date": "Jan 27, 2015", "message": "What about those who are stuck using a technology they don't love?  They spend most of their time in those tags, but if they take another job, maybe they want something completely different than what they are doing now."}, {"author_name": "Sumurai8", "gravatar_hash": "191dbc0ae8b2e1192d867f5e806bbf71", "author_url": null, "date": "Jan 27, 2015", "message": "@Trevor Nothing prevents you from looking for other jobs, right? I think it is a fair assumption of StackExchange that it is easiest for you to find a job in tags that you were/are most active in."}, {"author_name": "Gio", "gravatar_hash": "c60f7f931ee1f67ffc27b16a95c7e187", "author_url": null, "date": "Jan 27, 2015", "message": "This seems good. That based on the questions and tags I used in my questions I will be able to see more targeted jobs - is it what it's all about? Did I get it right? I think it makes sense!.\n\nWill this happen automatically? \n\nIn general good luck to StackOverflow.\n\nalthough indeed it is fair comment that although I maybe posting questions using some tag now, I might be interested to get job in different area."}, {"author_name": "Dan", "gravatar_hash": "c60f7f931ee1f67ffc27b16a95c7e187", "author_url": null, "date": "Jan 27, 2015", "message": "Another feedback I would like to give SO careers. Is the need for online stack overflow CV? I mean I find it mundane to create a new CV for myself for each and every place. That is why I have written all that suff in my original CV (pdf file), and use it when applying. I find it mundane to create yet another CV be it even on Stack overflow. Did you really consider the need for Careers profiles on SO where users create their CV I mean?"}, {"author_name": "Will Cole", "gravatar_hash": "dc7c087b0a3f4082e913f7f6dd7354e7", "author_url": "http://careers.stackoverflow.com", "date": "Jan 27, 2015", "message": "@Gio Yes.  The fact that a question you asked is a question you also viewed, those tags will affect the type of jobs you'll see in the ads."}, {"author_name": "Will Cole", "gravatar_hash": "dc7c087b0a3f4082e913f7f6dd7354e7", "author_url": "http://careers.stackoverflow.com", "date": "Jan 27, 2015", "message": "@Trevor It's certainly not perfect.  Ideally in the future you could confirm/edit the data that informs types of ads you see as easily as you can search for jobs on SO Careers itself.  We're not there ye."}, {"author_name": "PM 77-1", "gravatar_hash": "94ec4ccdda7974c8430c2aa84b7fae20", "author_url": null, "date": "Jan 27, 2015", "message": "I thought that what `Careers 2.0` was for."}, {"author_name": "Namphibian", "gravatar_hash": "c8a94d6775dbec2c289687ef0faaa643", "author_url": null, "date": "Jan 27, 2015", "message": "I prefer applying for jobs on Careers than any other site. Just wish more companies would advertise. My tags are rather... esoteric by main stream standards I guess."}, {"author_name": "Chris", "gravatar_hash": "110837216b1871f75ef4b2e3e34eb38c", "author_url": null, "date": "Jan 28, 2015", "message": "I'm a big fan - I got my current position through Careers 2.0. Are the same ads now fed through to the mobile apps?"}, {"author_name": "alex", "gravatar_hash": "97c45b1d1a1872463b542c0dd7d66082", "author_url": null, "date": "Jan 28, 2015", "message": "Blocking seems important.  You might want a non Perl job because you're sick of Perl because you spend so much time looking for help with Perl related problems; the last thing you want is \"Hey!  Love Perl?  You're going to love working at....PerlWorld!!!!\""}, {"author_name": "David Larsen", "gravatar_hash": "61fcda6377c3941f33130902c15ba27e", "author_url": null, "date": "Jan 28, 2015", "message": "I really like that we can download our personal data.  Love the transparency."}, {"author_name": "Anonymous", "gravatar_hash": "c34e354623516589b7f57f317a5fa106", "author_url": null, "date": "Jan 28, 2015", "message": "It's about darn time that Stack Exchange has finally implemented this! I've been waiting for better ad targeting *for years*! I look forward to seeing how well the new targeting algorithms do! :D"}, {"author_name": "Filip Dupanović", "gravatar_hash": "ef09ee2a5aaee27f3630e1842f30fbac", "author_url": null, "date": "Jan 28, 2015", "message": "Free personal data, huzzah! I can totally see someone building up a fictional character sheet from this!\n\n\nEditors, please give the user preference page more prominence in the article."}, {"author_name": "Suplemen Pelangsing Badan Alami", "gravatar_hash": "8658eeaf973def683fe5ad5b40eb08db", "author_url": "http://goo.gl/WW0unP", "date": "Jan 28, 2015", "message": "very good post"}, {"author_name": "Trilarion", "gravatar_hash": "116d41b431fd16348c9aeb8f96d0272d", "author_url": null, "date": "Jan 29, 2015", "message": "I strongly advocate Trevors notion. What if one searches for jobs in less active tags. The best is to also evaluate on which job offers one actually clicked and strongly gear future results towards this direct exhibition of interest. And also to aim a bit wider and also show ads that others find useful or are in other tags."}, {"author_name": "Gavin Simpson", "gravatar_hash": "c8cb7ed57af9cc1137b6686c1a68d7d7", "author_url": "https://www.southcoasthosting.com", "date": "Jan 29, 2015", "message": "Good move. Most of the ads I see only seem to care about the country I live in, and the plans to be able to block some types are a must methinks."}, {"author_name": "Simon Falsig", "gravatar_hash": "59764db094c8dd25ad094a0a8951f1b3", "author_url": "http://www.falsig.org/simon/blog", "date": "Jan 29, 2015", "message": "This sounds like a great idea - but all the targeting options seem focused on high-level development. No options for embedded developer jobs for those of us not interested in mobile or web stuff?"}, {"author_name": "Khoa Pham", "gravatar_hash": "16bebb36e0e28572a316ba0450e190d1", "author_url": "http://www.fantageek.com", "date": "Jan 29, 2015", "message": "Why don't just ask instead of predicting?"}, {"author_name": "Brian", "gravatar_hash": "c54d4c111c4564b116ff1efca8c56788", "author_url": "http://www.briantist.com", "date": "Jan 29, 2015", "message": "I'm glad to see System Administration in the dropdown (even though the dropdown's title is Developer Types). Hopefully this will make it easier to actually find those rare postings on Careers because as it is now, it's difficult."}, {"author_name": "John", "gravatar_hash": "49c251cd66df02500a2779c7295fc466", "author_url": null, "date": "Jan 30, 2015", "message": "Why is my prediction data available for download as a .json file rather than viewable online? I'm not a web-dev so other than knowing JSON exists I know little about it!"}, {"author_name": "John", "gravatar_hash": "49c251cd66df02500a2779c7295fc466", "author_url": null, "date": "Jan 30, 2015", "message": "Also it's all very well saying \"your data is always available to view\" but if I have no idea what the data means, how does this help me.\n\n\"FullStackWebPHP\": 0.0112637873502739\n\nWhat does that mean? That there's a 1.1% chance I'd be good at PHP?!"}, {"author_name": "Will Cole", "gravatar_hash": "dc7c087b0a3f4082e913f7f6dd7354e7", "author_url": "http://careers.stackoverflow.com", "date": "Jan 30, 2015", "message": "@brian Yeah, putting that in developer type doesn't make a lot of sense to you and me, but it does for recruiters."}, {"author_name": "Will Cole", "gravatar_hash": "dc7c087b0a3f4082e913f7f6dd7354e7", "author_url": "http://careers.stackoverflow.com", "date": "Jan 30, 2015", "message": "@Trevor @Trilarion  I think these are actually two separate points.  To Trevor's point, yes.  This is good at observing behavior, but isn't always 100% correct because you don't directly give us intent.  Just because you work in Java, doesn't mean you want another Java job. Over time, we'll get better at this.\n\nTo Trilarion's point, we do have plans to bring in data from your actual job searches as well.  There is considerably less data there than say, browsing questions on Stack Overflow, so we started at the fat side of the funnel. Everything you mentioned though are experiments we do plan on running to make this smarter."}, {"author_name": "Tom", "gravatar_hash": "e37c8fe56658e76fd3569414adfe8a51", "author_url": null, "date": "Jan 30, 2015", "message": "These sounds good as a first step but as @Trevor mentioned working in or with a disliked technology can skew the posts in the wrong direction for a particular candidate.  If the candidate has a profile on careers, why not use there disliked technology list as a way to help mitigate that problem. For that matter why not use the liked technology list as well?"}, {"author_name": "Lode", "gravatar_hash": "408a92bd3c66bedd2cac22f03db029a6", "author_url": null, "date": "Feb 01, 2015", "message": "As a backend/fullstack developer I frequently ask questions about javascript, because that is not my strongest part. Thus I most often get job offers for working in the frontend, which is not my interest at the moment. I can also see this reflected in the tags (via downloading my data); javascript is the highest tag. The kinds of webdev start with fullstack, followed by frontend, and backend is 0. As such, it is quite useless for me."}, {"author_name": "sagari", "gravatar_hash": "e1aac60ffa536a46d26645d7e176904d", "author_url": "http://sagari.web.id/", "date": "Feb 02, 2015", "message": "i think the recruitment just give the location is to they can explain what they are doing face to face with this new employer\n\nnice feature."}, {"author_name": "marian", "gravatar_hash": "3b070adb6a39a497165880c1342636b1", "author_url": "http://catalogosrevistas.com/", "date": "Feb 03, 2015", "message": "I like very much hope that labels help us find a specific job for every need search"}, {"author_name": "Carlos", "gravatar_hash": "d7ee7e868b347db99a74de3684d332e1", "author_url": "http://www.geradordecartaodecredito.com.br", "date": "Feb 09, 2015", "message": "It is so helpfull! I do not believe I have read through anything\nlike this before. What a great idea!"}, {"author_name": "Nirav", "gravatar_hash": "e14f10bb7e2d3d8a77d8b3813f0b744f", "author_url": "http://iphonegamezone.net", "date": "Feb 15, 2015", "message": "My experience so far hasn't been great as a candidate. I got offers from Mobile startups and after knowing about my whereabouts they just left the trail. Which means that many of them do not notice before contacting a candidate."}, {"author_name": "Mark", "gravatar_hash": "5fcdde433947eac3117ea03ff941321a", "author_url": "http://www.codicescontoit.com", "date": "Feb 16, 2015", "message": "Good article thank you"}, {"author_name": "Pnc", "gravatar_hash": "d63b173144c4615228d650799d79f594", "author_url": "http://www.alisveriskupon.com/", "date": "Feb 23, 2015", "message": "To find the right job is very essential, I think and thanks stack for bringing out this point."}]}