{"response": [{"author_name": "Alexander", "gravatar_hash": "ad6a0189537d12abb6c52b053f17ff30", "author_url": null, "date": "Jan 16, 2015", "message": "At lest someone in this industry knows how it has to be done..."}, {"author_name": "allquixotic", "gravatar_hash": "3e53e57f97ff1a63f41e421818d4836b", "author_url": null, "date": "Jan 16, 2015", "message": "Seeing SE's ideals and their awesome offices just reminds me how depressed I am that I'm in a drab, micro-cubicle with two walls and coworkers who seem to have non-stop phone conversations all day long. I don't have the CV to get hired at SE, else I'd already be there."}, {"author_name": "Bruno Brant", "gravatar_hash": "b1ae2268c7a69c4bb180a2665736a804", "author_url": "http://brunobrant.net", "date": "Jan 16, 2015", "message": "As I work on a consulting company, I switch clients frequently. They almost all have abandoned even the slightest separation of employees. \n\nThe fun(ny) part is that no employee thinks its better. Most of us use a headphone to concentrate in a noisy and messy environment (how I wish I could share a photo with you guys).\n\nOpen plans seems to me a way to squeeze more employees in less space. Contradictory to the notion that you probably only need more employees because they aren't productive given the hard time they have concentrating and the time they waste chatting to each other (If I remove my headphone I'm sure I can listen to at least one chat about bs instead of work stuff).\n\nTL;DR I'd give an arm to work for you guys. Or, better yet, a leg, so I can still write code efficiently."}, {"author_name": "Ryan", "gravatar_hash": "353d8d3742201a644f79e02642504830", "author_url": "http://www.trekkit.com", "date": "Jan 16, 2015", "message": "Amen! Common sense approach to developer space."}, {"author_name": "Withheld to protect the innocent", "gravatar_hash": "442e0550feaf99fd31995c5c9280eb75", "author_url": null, "date": "Jan 16, 2015", "message": "I sit in a 4 square cube, i.e. there are 4 of us staring at the center of a square.  The guy to my right has allergies and refuses to take medication so he is constantly clearing his throat.  The girl to my left a smoker and has a constant cough.  The guy in front of me can't sit still for more than 5 minutes without getting up and interrupting everyone with something stupid he found on the internet.  Wait....what?  I guess there are some cute cats I have to look at...."}, {"author_name": "Furiant", "gravatar_hash": "4d5881813443cf89e2f7126ff3e335c4", "author_url": null, "date": "Jan 16, 2015", "message": "I'm not SE caliber, and I probably never will be. But I deserve better than my current job, which is a horrific soul draining cubicle farm, where your chances of getting an office are inversely proportional to the amount of actual work you produce. This post reminds me of that, and inspires me to look for a better employer."}, {"author_name": "Someone Over The Rainbow", "gravatar_hash": "a9f835019994c45c634afb0b77b170c8", "author_url": null, "date": "Jan 16, 2015", "message": "I want to work for you so much but I'm pretty sure it's illegal to hire a 16-year-old."}, {"author_name": "Ross", "gravatar_hash": "2fa6a803a5e79e2df9351ed3969389e2", "author_url": null, "date": "Jan 16, 2015", "message": "Feature request: Allow upvotes on blog posts. Because I would definitely upvote this one. Fortunately, my company doesn't have a large open floor plan. We do have offices, but there are 4-5 engineers per office. Back when I was an undergraduate, I interviewed for an internship at one company with an open floor plan. It was weird. I can't imagine working there. Being pretty much the stereotypical geek, I greatly value privacy and being left alone to do my work. I don't mind meetings to hash out designs and what needs to be done, but when I'm actually coding, I greatly prefer to be left alone."}, {"author_name": "Igor Levicki", "gravatar_hash": "be743462cd257b8490bed6cc0d3795ea", "author_url": "http://levicki.net/", "date": "Jan 16, 2015", "message": "Amen."}, {"author_name": "keng", "gravatar_hash": "15769bbea999aee421458f52e7c9d011", "author_url": null, "date": "Jan 16, 2015", "message": "SE vs. Menlo Innovations...now that's a Pay Per View that I'd pay for!\n\nhttp://www.menloinnovations.com/our-method/"}, {"author_name": "jmmy5", "gravatar_hash": "4b7433cdb4d4bcaf609735a54784c3c8", "author_url": null, "date": "Jan 16, 2015", "message": "This looks perfect, and certainly productive. It seems like a dream as I sit here listening to music I hate being blasted into my ears and 3 different conversations echoing around the office."}, {"author_name": "SR", "gravatar_hash": "0e015323e2ef324b76c7cf3bf720e5ef", "author_url": null, "date": "Jan 16, 2015", "message": "I used to program in a two-person office with a door. Often our hours were a bit non-overlapping. I brought discarded cubicle panels in and stacked them around the walls and between us - it was quiet as a tomb in there. People walked in and the silence took their breath away. I put a non-functional \"doorbell\" panel with our names on it in the hallway as a gag, people fell for it, haw haw. \n\nNow I am an instructor, so I sit in class in front of my students all day, but the environmental people raised all their monitors so high that I cannot see them (mine is still down where it is supposed to be, and yes, I use a wrist-rest and my keyboard legs are down)."}, {"author_name": "Ravenstine", "gravatar_hash": "0992792065ecde6714354dc12b953046", "author_url": null, "date": "Jan 16, 2015", "message": "I think there's something to be said for both privacy and an open work environment.  In my company, there isn't anything separating us except for 5-10 feet of space.  When I started, I wasn't too keen on it but I've gotten used to it and actually prefer being around my co-workers to the isolation of a private office.\n\nThere just isn't a clear answer on this issue and it depends on the chemistry of a department.  We all get along very well in my department, but one with a toxic chemistry can end up disastrous without some form of separation, yet good employees can feel distant and demoralized without the reinforcement of social interaction within a team.  It's said that a lack of separation leads to wasted time chatting, yet it can also be said that too much separation can lead to a loss of productivity if people are less-inclined to put their heads together to solve an issue.\n\nPersonally, I'd rather work in a place where I feel like a part of something I can care about as opposed to a cog in a machine.  Even if I hate a company, feeling comfortable among a group of people can make every day tolerable and even enjoyable.  One of the reasons I own a home is so that I can have a private place to myself; I don't need a level of privacy even close to that at work, and for the most part I think that someone feeling like they need that level of isolation can be a sign that they don't enjoy their job(and aren't in a mindset where they could be as productive).  I'm not saying that this is always the case, but it's my guess from looking at my own experience.  I just can't see why a whole team of developers would even need so much as an office for each person.  Perhaps one for the technical director or sysadmin, but not for every developer.  Again, whatever works for whatever team chemistry.  This opinion comes from a lowly employee."}, {"author_name": "uhsarp", "gravatar_hash": "9e8196fdc6e4f1ddac34df73c0a10ef1", "author_url": null, "date": "Jan 16, 2015", "message": "Great article!"}, {"author_name": "usersomthing", "gravatar_hash": "541755437f2d161ccbd29d9a743cdbb7", "author_url": null, "date": "Jan 16, 2015", "message": "those are some pritty nasty gaming setups"}, {"author_name": "Mike", "gravatar_hash": "c87ed344c463ff4eaf588a722793e6a8", "author_url": null, "date": "Jan 16, 2015", "message": "The designer is also farming in world of warcraft"}, {"author_name": "Fred", "gravatar_hash": "9bab7a407c8c8ff848778db8aaefe4ae", "author_url": "http://www.runtime-era.com", "date": "Jan 16, 2015", "message": "Great to read something other than the \"open offices rule\" mentality that has pervaded the industry. There are other ways to foster information-sharing and communication, seems like you guys nailed it."}, {"author_name": "Vicki", "gravatar_hash": "2cd8a74d15dbb3b1d788899868554af9", "author_url": "https://twitter.com/vlb", "date": "Jan 16, 2015", "message": "I worked for Taligent (the Apple / IBM / HP joint venture) when they were building out their new office buildings. The Facilities folks did the math and went with private offices over cubicles (this was back when \"open plan\" meant the stock exchange or a call center).  Only one team got low-walled cubicles - a design team that claimed they needed to be able to call to each other around the space. They were also housed in a small wing of their own, away from everyone else.\n\nMy own door. My own light switch! It may have been 8' x 10' but it was the best office space I've ever had."}, {"author_name": "Mat Gilbert", "gravatar_hash": "7e652cc39cd949d75c575c652f0c1086", "author_url": null, "date": "Jan 16, 2015", "message": "Looking at this makes me sad and jealous. Looks like a fabulous work environment."}, {"author_name": "SuperScript", "gravatar_hash": "4e9cc20521a8a0bf77b7dfd7d37ba73e", "author_url": null, "date": "Jan 16, 2015", "message": "Glass walls also work as whiteboards. Some discussion about communities with no moderators...\n:-)"}, {"author_name": "Malcolm", "gravatar_hash": "c126778f7aef0a53e89643a226a7b7d4", "author_url": null, "date": "Jan 16, 2015", "message": "Open plans can work. They need:\n- correct acoustic setup (i.e. prevent train station feel)\n- privacy\n- conference rooms for longer meetings\n- \"libraries\" where people can withdraw to for silent time\n\nDone right, this is much more expensive than individual offices, which is why most exploiters ... erm, employers ... don't do them right, but instead cramp 50 people in one room and call that an open plan.\n\nAnd obviously open plans are suited best for creative positions and/or those where collaboration and team-switching are frequent.\n\nThey are not suited for typical office work, where each employee is an island and five people are talking on the phone at any given time."}, {"author_name": "Perry", "gravatar_hash": "3fb22b140095bedfab6fe903ee445546", "author_url": null, "date": "Jan 16, 2015", "message": "How can you tell a New Yorker?  They think being in a tall office building, and being able to see lots of other tall office buildings, is a \"view\".  :-)"}, {"author_name": "Kevin", "gravatar_hash": "98892a1d4975fc733e5401daca370b47", "author_url": null, "date": "Jan 16, 2015", "message": "I worked at a company doing analytical work and doing training/installation work for groups doing their own analytical work (law enforcement, national security stuff; organizing investigations and the like). For that company, the open floor plan seemed to work well: it meant the engineers were frequently interacting with the analysts, seeing the things they were talking about, hearing their frustrations with the software, and so on. Some engineers did find it distracting, but headphones seemed to work, and the rest of us found it exciting and engaging (the analysts' conversations were often fascinating). And it meant that the company had engineers who were perhaps second-to-none in understanding analysts' jobs and how they worked, which made for an agile, efficient company in that space.\n\nNot that I disagree for development. This was not a development company, and that's why I'm no longer there. But for that company, the environment was the correct choice I think."}, {"author_name": "B", "gravatar_hash": "8c4fea5cf5514e01736c7029df77970c", "author_url": null, "date": "Jan 16, 2015", "message": "Ohhh, the irony of the open floor plan kitchen/living room/work space in an article about private offices.\n\nMust live alone..."}, {"author_name": "Abby T. Miller", "gravatar_hash": "673e91ced57dd8a3e73dd888b07ff95c", "author_url": null, "date": "Jan 16, 2015", "message": "@B: I'm pretty sure that's Ben's private office with wet bar. It's perhaps the *ultimate* private workspace.\n\n@Perry: What you can't see in that shot is that the coffee bar looks out on the East River with a perfect view of the Brooklyn and Manhattan bridges. It's a view tourists pay lots of money for by going to the tops of other tall buildings (that don't have coffee as good as ours)."}, {"author_name": "daniel", "gravatar_hash": "6fefc1f0481eb7c907f7fc4097954420", "author_url": "http://danielstern.ca", "date": "Jan 16, 2015", "message": "Joel DID win the argument. That is so true. I can't believe the state of affairs is still where it is."}, {"author_name": "Matt", "gravatar_hash": "0b8118cdc9a829396e844f10c39720ee", "author_url": null, "date": "Jan 16, 2015", "message": "The reason this hasn't died is kind of pointed out in the article. Quote: \"Facebook brags that its new building will be the largest open floor plan in the world, consisting of a single, ten acre open room.\" \n\nI have heard too many CIO's say... well how does Facebook do it, instead of having a single thought of their own and designing a working environment that works for their company and needs."}, {"author_name": "Aston", "gravatar_hash": "46d9cc3994e483150a1d7c6652df9f8e", "author_url": "http://none", "date": "Jan 16, 2015", "message": "Except for about 2-3 hours in a day for meetings and collaboration, I love private space to do my work preferably with a pin-drop silence. Since I don't have this anymore, I waste my time for about 8 hours at office, and accomplish my work from home at night after my kids are asleep. That is very stressful though."}, {"author_name": "Danny", "gravatar_hash": "906a618517b4f18e732e4c66adff1df4", "author_url": "https://twitter.com/hyliandanny", "date": "Jan 16, 2015", "message": "Good stuff! While studies are great for showing trends and averages, it's fantastic to get patterns' feedback directly from companies trying them out. It's worth noting that you seem to have a mix going on with private offices, shared private offices, employees without private offices, and remote employees. I'm excited to read a firsthand account of such settings being choices or optional, where the culture formally allocates spaces for each environment to be elected by employees depending on their current place in the pipeline.\n\nThanks for sharing!"}, {"author_name": "Just an above average guy", "gravatar_hash": "4efb41b7266ab56be3637e5688e84c5c", "author_url": null, "date": "Jan 16, 2015", "message": "Well I can attest to this greatly. Sometimes you need to be in the office, sometimes its important to be able to be face to face with others on your team. However, working from a Jr Security Engineer (where I really need to be in the office - but separated from the constant phone calls and other distractions) to support and system engineer roles where in reality, some people work better and function better in regards to productivity because they can stay focused on one thing and one thing only 'work'. Not driving through a nightmare of traffic to get to and from, going to constant meetings that have the same slides as the other global teams all listening and viewing the same content. When the bottom dollar comes down to the client and the engineer - the engineer facilitates the resolution and the client creates it. The employer is impartial (other than ongoing education and facilitating the trust, until the engineer builds it). This is why many organizations lose clients, because they trust the engineer and therefore employee the engineer or find a legal way to recruit the engineer outside of the NDR and NCA legal documents. It's not just software developers but those who support serious software applications that really need to be permitted to be 'innovative'. If we truly are innovative and productive - our reports compared to peers who should be doing the same will ultimately demonstrate the truth. Furthermore, to allow some to do this and to not allow others promotes a culture of favoritism and mistrust. I enjoy what I do but I feel confident I would be more productive to my team if I was able to utilize the same benefits that they can partake in (hence they are more productive). I can only suppose that management simply has either not realized this or has had a few abuse this, which ultimately can be addressed individually if was the case. Software companies I think are really missing out on true gains in metrics when innovation and productivity are suppressed in favor of coming into an office daily (we are already connected via IM and we already have audio/web conferences sometimes more than once a week). If we are already paid on salary, where is the benefit to the employer? From a business perspective, its a loss to both and a moral/trust issue to those who can, to those who cannot. I believe this creates an atmosphere of inequality.\n\nWhat say all of you?"}, {"author_name": "Ted O'Connor", "gravatar_hash": "f6dffe91f4bde6873033190901e66b07", "author_url": "http://www.wingspan.com/", "date": "Jan 16, 2015", "message": "I think my company has actually done this right.  Our largest developer team room has 3 developers in it and they are all working on the same project right now.  The rest of the offices are only one or two people.  We also keep several empty offices that anyone can use for as short or as long as they like.  It might be just to make a phone call or it could be to better facilitate a heads down development push."}, {"author_name": "Michal", "gravatar_hash": "96447af29d7bd4462edcdb5ecd666bef", "author_url": "http://stackoverflow.com/users/2128900/micha%C5%82-ciuba", "date": "Jan 16, 2015", "message": "It is known that noisy working conditions have a negative impact on developers' performance. It was proven in the studies conducted in the 80s! Source: \"Peopleware\" book, and of course there is something on Stack Exchange on that: http://programmers.stackexchange.com/questions/132952/studies-on-how-noise-affects-productivity-of-programmers\nIt's amazing how an industry calling itself high-tech can be so ignorant. They take a lot of time to hire the smartest people, pay them a lot of money.All this just to put them together into an open space which is damaging to their performance, just to save few bucks."}, {"author_name": "William O. B'Livion", "gravatar_hash": "f0c04cc8080c57734c1a923e3aa87278", "author_url": null, "date": "Jan 16, 2015", "message": "I sit in an open plan office (we have hip-high cube walls) facing the \"side\" door that 1/2 the people use to get in and out of the office. Because of the structure of the \"not-quite-cubes\" I can't turn around. \n\nThis means that as I stare at the monitor composing this missive, if someone opens the door I'm slightly distracted. Which isn't as bad as if the door was right *behind* me (because the Ninja-Pirates have picked up the contract to kill me, and ...) \n\nI can hear every conversation in the room. \n\nNot good for maintaining focus. \n\nBut they pay the bills."}, {"author_name": "Agustin Marseillan", "gravatar_hash": "9d769a913d6a5613419db9ca68b27939", "author_url": null, "date": "Jan 16, 2015", "message": "Shut up and take my cv!\n\nTill then, I got myself a pair of noise cancelling headphones and made a red flag which I put in the back of my monitor whenever I'm \"in the zone\" and anyone who distracts me gets a finger pointing at the flag until they will eventually (I hope) stop doing it"}, {"author_name": "Craig", "gravatar_hash": "fe648807e29dc820a2a71ff7f5c587a3", "author_url": null, "date": "Jan 16, 2015", "message": "Yes.  Open space is just cool.  What's cool does not equal what is right or what works.   \n\nThe Myth of Multitasking book and research has proven too many inputs decreases productivity and creativity."}, {"author_name": "Todd", "gravatar_hash": "7f204621d81b4bbfa4e3eab6690bc63a", "author_url": "http://stackoverflow.com/users/2859525/todd", "date": "Jan 16, 2015", "message": "Hehehe this really makes me question my departure from the Corporate NYC tech culture ^_^"}, {"author_name": "Andrei", "gravatar_hash": "a22baeddf1d873771cde0af17a46186f", "author_url": null, "date": "Jan 16, 2015", "message": "Indeed, can't beat the view of Mr. Spolsky ;)"}, {"author_name": "J. Musser", "gravatar_hash": "cdc56124cfb5230a7b666cb7ad6ead9b", "author_url": "http://gardening.stackexchange.com/users/419/j-musser", "date": "Jan 16, 2015", "message": "The glass walls... It will be funny to see people walking into them :p"}, {"author_name": "Alex Gil", "gravatar_hash": "e3d19df8b726789f4f0c13f2b0142aba", "author_url": null, "date": "Jan 16, 2015", "message": "Only an office partition separates my desk from the call center..."}, {"author_name": "Justin", "gravatar_hash": "110900462ee1526974e266f34ea30c8e", "author_url": null, "date": "Jan 16, 2015", "message": "Random question: Can anyone identify the make and model of those chairs with the wood/laminate backing (above the caption: \"Serious work being done\"). I've been looking for a lounge-ish chair and I really dig that style. Thanks!"}, {"author_name": "Daniel", "gravatar_hash": "d79da72d537151678c9c4433b0b798b7", "author_url": null, "date": "Jan 16, 2015", "message": "You should look like a 1800 worker in a 1800 workers plant.\nyour boss however will have his private office, just like 1800.\n\nOrders has been restored!"}, {"author_name": "Anonymous", "gravatar_hash": "b04c40b672d5af14febddadc56c91a2b", "author_url": null, "date": "Jan 16, 2015", "message": "In our office it's like the middle ages: team leads have higher cube walls than engineers.  VPs get walls.  Execs don't even come to the kingdom except for people to hail them."}, {"author_name": "Daniel", "gravatar_hash": "d299df8d0390e615b9c6fd0002feb865", "author_url": "http://danielsadventure.info", "date": "Jan 16, 2015", "message": "To those of you who say you are \"not SE material\", don't be discouraged!  SE is an awesome company and with work, you can improve your qualifications.\n\nI, myself, applied for a job at SE last year and was turned down with what appeared to be a form letter e-mail.  I don't know if anyone even read my resume.  Regardless, I am not going to be discouraged by a single rejection!\n\nHowever, I have become a better developer every year than I was the year before and I intend to continue that.  To me, the fact that you are even reading a blog like this suggests that you have aspirations to be more than an average cubicle dweller."}, {"author_name": "Bruce", "gravatar_hash": "5bb60833559a2d808bb4905efe1c9afe", "author_url": null, "date": "Jan 16, 2015", "message": "I'm sorry but this is still a FAIL. Companies don't get it. Having \"offices\" where a workers back is totally open and exposed (using a glass wall) is a real issue here.\n\nPeople don't understand that humans can \"sense\" a lot of information and energy from their back. Ask anyone that studies energy arts or Feng shui and they will tell you that your back needs to be guarded at all times and always face a wall. The phrase that someone has eyes in back of their head is very true in a sense. \n\nThis design here, although I'm sure meaning well, still conveys a lack of trust from the management in their employees, and is no different then any open office or cubicle design where employees backs face out. These designs are all so management can make sure you aren't web browsing or whatever they are worried you are going to be doing in your cubicle. \n\nEmployees in these environments will still suffer from a type of energy anxiety, cause by not knowing what is happening behind them. Anybody that listens to headphones while they work and has a someone come up behind them and tap them on the shoulder knows what I'm talking about. \n\nUntil companies start giving their employees real closed office environments again, they will continue to foster environments of distraction. The worse offenders are the open work environments where you not only have tons of noise pollution (causing everyone to wear headphones) but even worse are the visual distractions of people crossing and moving in your visual field every 5 minutes. \n\nIn this age of software innovation, it amazes me that we had fallen back to the stone-age in the HR department. It's sad because I like a lot of things I hear coming from these smaller companies, but they still fall short. \n\nThe truth is that Microsoft got it right a long time ago advocating offices, although I believe they have since abandoned that. Designers need to adopt a function over form approach instead of a form over function when building work spaces. Instead they build fancy looking offices to impress investors and such but the employee always suffer because of it."}, {"author_name": "Keith Smith", "gravatar_hash": "5d0e851c2437acaff1cf73f85309ab86", "author_url": null, "date": "Jan 16, 2015", "message": "Should read the book PeopleWare by Lister and DeMacro, especially the chapter \"The Furniture Police\"."}, {"author_name": "Gardoglee", "gravatar_hash": "fa9adcd7ca8e9850e7dd8c999e865bb0", "author_url": null, "date": "Jan 16, 2015", "message": "A simple comparison. If open space is so great, why don't more companies encourage their people to work in REALLY open spaces like bus depots, airports, fast food restaurants, shopping mall food courts, or even just riding public transportation? Most of the open space cube farms I've worked in, and particularly those where they included the customer call center reps in the same space as the developers and analysts were certainly at least as noisy and distracting as any of those."}, {"author_name": "Ryan B", "gravatar_hash": "b283d61dab7e99711870475a15d17aab", "author_url": "http://covario.com", "date": "Jan 16, 2015", "message": "I have only worked in cubes and open space offices, never been somewhere nice enough offer non-managers offices. As much as I don't like cubes, they are FAR better than an open space plan for software development. The open plan is stupid on many many levels. In one company I was at, that transitioned to an open plan, I noticed during the weeks following the switch away from cubes that the non-productive employees got louder and louder as time went on. Meanwhile the prductive people turned further and further inward, tryign to isolate themselves with headphones, ignoring everything around them when they walked into the office, and working as short of hours as they could get away without being noticed. It was a strange experience, especially trying to code in that environment, where marketing people 20 feet away were literally yelling at each other over the din. I found employment elsewhere after a few months and was very clear in my exit interview that the shift was detrimental to the quality of the software. That company shrunk in size and became an ad agency (from a software company) over the next 2 years after I left."}, {"author_name": "Jill", "gravatar_hash": "4006d89f4992c1a08583b3829545f91a", "author_url": null, "date": "Jan 16, 2015", "message": "There is no way I can ever work sitting with my back to the door or open walls...."}, {"author_name": "Bruce", "gravatar_hash": "5bb60833559a2d808bb4905efe1c9afe", "author_url": null, "date": "Jan 16, 2015", "message": "@Keith I read PeopleWare years ago, it's a great book. \n\nThere is just really no excuse for these type of work spaces anymore. When it comes down to it, the suits with the money get to decide how to decorate their \"house\". \n\nThis is why Microsoft had offices from the get go. Bill Gates was a programmer and understood the value of an office. \n\nNo smart programmer would pick an open workspace or cubicle over an office, period. \n\nI would also bet the same programmer would give away all \"perks\", free lunch, etc.. for an office where they could think quietly and do their work efficiently. To many programmers are force to either come in early or stay late just to work in quiet. Or worse, make up work at home because they can't get anything done with all the distractions. \n\nThe fact is, most programmers (and creative thinkers) need BLOCKS of uninterrupted time to be efficient and stay in the zone. These blocks usually run in the neighborhood of 4-5 hours at a time. \n\nMost offices cannot satisfy these conditions for their programmers, and therefore are really dumb workplaces. They may have the smartest people on the planet working there, but they are crippling their minds with \"noise\". \n\nNoise or interference in any system is bad."}, {"author_name": "Jason", "gravatar_hash": "531dfbc444ebf34c651c5a02877b5d2a", "author_url": "http://schock.net", "date": "Jan 16, 2015", "message": "Okay, did Standing Desk Woman *actually* have that Edward Tufte book open and in use at the time, or did the photographer just need something smart-looking in the foreground? \n\n:-)"}, {"author_name": "Ernestas", "gravatar_hash": "16e4d873bd6ccffd56be5a3f89c73f9a", "author_url": null, "date": "Jan 16, 2015", "message": "I want to work in Stack."}, {"author_name": "Bruce", "gravatar_hash": "5bb60833559a2d808bb4905efe1c9afe", "author_url": null, "date": "Jan 16, 2015", "message": "I just have to say this to all the smart suits that think their Aeron mesh chairs look so cool...\n\nThey are actually horrible for sitting in all day because they have a plastic rim in the front that can actually cut off circulation to the legs! Sure they may look super cool, but again, it's form over function. I'm pretty sure people can figure out it's not a good idea to have a hard plastic rim digging into their thighs all day.\n\nUnfortunately, I got duped into buying one of these chairs years ago so I know what I'm talking about. It's a good thing I bought it from my company for $250 instead of the $1000+ price tag they carry with them or I would have been pissed. \n\nAnyway, just another example of bad office choices made by choosing form over function."}, {"author_name": "Ahaan S. Rungta", "gravatar_hash": "3f59c395e1870b0741540fefac21afbd", "author_url": "http://www.calcbee.org", "date": "Jan 16, 2015", "message": "Looks like a dream place to work!"}, {"author_name": "Jill", "gravatar_hash": "4006d89f4992c1a08583b3829545f91a", "author_url": null, "date": "Jan 16, 2015", "message": "@Bruce: \"No smart programmer would pick an open workspace or cubicle over an office, period.\"\n\nBINGO!\n\nAnd as far as distractions go - the cancer of all disruptions  are meetings. \n\nIt even goes beyond programmers or designers... Interrupt anyone at all and they need at least 30 minuter to get back on track.\n\nIts no wonder that most software is bug-ridden."}, {"author_name": "James S. Cook", "gravatar_hash": "5cac053e3617211eba08934d94a3032d", "author_url": "http://www.supermath.info", "date": "Jan 16, 2015", "message": "I recently left my cubical/office and found an actual space with walls, a ceiling. It is nice to be able to talk to a student without talking to all the other professors. No professional chef just yet, maybe I'm in the wrong business."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Jan 16, 2015", "message": "I laughed when I saw the Unicorn Head Dude in the office tour. That's the kind of culture I like!\n\nHere's a picture of me in Unicorn Head, wearing the Stack Overflow unicorn tee, of course: https://pbs.twimg.com/media/B0pNjpBIMAEX1Tc.jpg If I get around to visiting, I should wear the same outfit. Maybe I'll appear in the next version of the office tour. :-P"}, {"author_name": "Jeffrey Bosboom", "gravatar_hash": "7349581b85c8d503fe8d907b74d35e5c", "author_url": "http://stackoverflow.com/users/3614835/jeffrey-bosboom", "date": "Jan 16, 2015", "message": "Why is the last image mirrored?"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Jan 16, 2015", "message": "@Jeffrey Maybe it's a picture taken by Photo Booth."}, {"author_name": "H3br3wHamm3r81", "gravatar_hash": "144d2c3c0b23baf2a6670bc161c8d2a2", "author_url": null, "date": "Jan 16, 2015", "message": "\"...if they’re talking, the best you can do is crank up your headphones and hope to drown them out...\"\n\nI hate my office with a passion. People talk loudly; they don't turn off their keypad or ring volume on their cell phones; they smack while they eat their food. I simply cannot wait to win the lottery. Pray for me! LOL"}, {"author_name": "Tom C.", "gravatar_hash": "40b89966b6070a3307ea7e4bb0381b97", "author_url": null, "date": "Jan 17, 2015", "message": "re your coffee bar, where's the Coke machine?  At least our company has free soft drinks.  I hate coffee."}, {"author_name": "Lorenzo", "gravatar_hash": "7f3622889f80717fbe78803ab6e1890b", "author_url": null, "date": "Jan 17, 2015", "message": "I'd kill for a cubicle. Now I'm in a huge open space, zero privacy, incredible noise."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Jan 17, 2015", "message": "@Tom Not sure whether, by \"Coke machine\", you meant a vending machine or soda fountain. Anyway, for extreme bonus points, provide a Coca-Cola Freestyle machine."}, {"author_name": "Clark", "gravatar_hash": "0846000f80a9c8c023eabd466801612f", "author_url": null, "date": "Jan 17, 2015", "message": "I work remotely because I simply do not like people in general. Phones, talking, and generally just people swanning around do my head in. At home, a 9 hour stretch of pure code. Sweet. The job gets done, the weekend is free from stress and everyone is happy. Apparently, unlike the rest of the industry, we get paid to complete projects well and move forward. Allowing each personality (such as mine) to choose their own method simply gets the job done. Good call StackExchange, and thank you for making an effort to find staff. Recruitment agencies are death."}, {"author_name": "Mike", "gravatar_hash": "f82aff7245ddce9cd2b24da0341290f7", "author_url": null, "date": "Jan 17, 2015", "message": "Did I read that wrong or is it being suggested that people who are in the same office should chat, THEN proceed to do a hangout if they need to discuss further? That seems really really strange to me. Why pay the big money for big city locations if everyone is going to act like they are remote employees. There are always benefits to in-person conversations."}, {"author_name": "C", "gravatar_hash": "652851656636218e8390bcae05184ad5", "author_url": null, "date": "Jan 17, 2015", "message": "Sun Microsystems (now Oracle) had some interesting personal offices that I saw recently when I visited their old Santa Clara offices. They were small, perhaps the size of a train compartment, but were proudly decorated with plants and pictures and all sorts of homey things. Obviously the people there took pride in being there. The doors were sliding glass and 2/3rds of the glass is frosted for privacy. Everything was very quiet and well sound proofed. A nice change from modern open plans."}, {"author_name": "Chris Marisic", "gravatar_hash": "f0e7c2d0d5d83c928cfcfce66928160e", "author_url": "http://www.marisic.net", "date": "Jan 17, 2015", "message": "I am so opposed to cubicles for developers. Developers should be provided a large spacious desk (or a desk that can be a standing desk if desired). I do however support limited open floor plans. I find them to be far more inclusive. They need to be limited. You can't stack a dozen people into a shared space. Also things should be done to reduce some levels of noise such as having short walls to deaden sound for when developers are sitting at their desk.\n\nFurther things that are important are meeting areas for people to get up and take long discussions to. Meeting rooms that are available. It's worthless to have meeting rooms that are always full and defeat the purpose.\n\nFinally I feel leadership must lead by example. You cannot be an effective leader if you promote an open office layout and then sit in a private office. That is the epitome of hypocrisy. Yes there needs to be private areas for private discussions such as interviews, employee reviews, and other needs. But leadership in development should not need their own private offices as a \"status symbol\", this just makes you a pointy haired boss ala Dilbert."}, {"author_name": "athos", "gravatar_hash": "1ae7b03db7483523fc909e19edbe5dec", "author_url": null, "date": "Jan 17, 2015", "message": "what' the salary of a Software developer in stack overflow?"}, {"author_name": "Seb", "gravatar_hash": "8ce28ee09eef23930accbff851dfa5b4", "author_url": null, "date": "Jan 17, 2015", "message": "Your offices look great and I totally agree that open plan sucks. I'm surprised Facebook is going that direction since so much research and personal stories point the opposite direction..."}, {"author_name": "Matt", "gravatar_hash": "26f94198b00f83f1ec2adae011ba56ca", "author_url": null, "date": "Jan 18, 2015", "message": "@Bruce\nI work in a very well known big software company with a mostly open floor plan, and while I dislike it, we are free to position our desks however we want, so my back is indeed guarded.  None of my managers care about checking if I'm browsing the web.  I can't really speak for SE, but I would bet that the occupants of those glass offices are similarly allowed to move their desk wherever they want and also guard their back."}, {"author_name": "GiantCowFilms", "gravatar_hash": "086a19e92dca8771bfa2cfd42552cf83", "author_url": null, "date": "Jan 18, 2015", "message": "Just curious: What standing desk to you buy for your employees, I've been looking into getting one, and I'm curious how well those work for you, and which ones you've chosen?"}, {"author_name": "anil", "gravatar_hash": "e5ad1310b703a269ecc57f5ceb923905", "author_url": "http://as", "date": "Jan 18, 2015", "message": "10000000000000"}, {"author_name": "anil", "gravatar_hash": "e5ad1310b703a269ecc57f5ceb923905", "author_url": "http://as", "date": "Jan 18, 2015", "message": "1000000000000000000000$"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://about.me/cky", "date": "Jan 18, 2015", "message": "@athos Read this article: http://www.inc.com/magazine/20090401/how-hard-could-it-be-employees-negotiate-pay-raises.html\n\nBasically, when you get a job offer, they will work with you to establish the level you're at, and your salary will be set by that level. Every developer at a given level gets the same salary, and it's intended to be completely non-negotiable.\n\nThe level-to-salary table is not public information, as far as I know. So the only way you'll know what salary you'll get is to get a job offer from them."}, {"author_name": "Natalia Burina", "gravatar_hash": "578205bee312002f74b1f2ea6b36d781", "author_url": "http://parable.it", "date": "Jan 18, 2015", "message": "Can't agree with this more."}, {"author_name": "Ciro Santilli", "gravatar_hash": "c979bd881b6755f84947a5a8ecc7c6f7", "author_url": null, "date": "Jan 18, 2015", "message": "+1!!!"}, {"author_name": "Mason", "gravatar_hash": "ac0f5806a57ad801fec9f5619763f667", "author_url": null, "date": "Jan 18, 2015", "message": "I'm 29. A lot of guys my age have never worked in a private office. We were reared in cube farms or open floor plans, so we don't know what we're missing. In just the past two years I've been working in a place with a semi-private office and it is mana from heaven - or perhaps it is the forbidden fruit. For, having once eaten, I shall never again return to the simple, naked innocence of the cube farm."}, {"author_name": "George", "gravatar_hash": "a544696674d09859ba34927ee847c927", "author_url": null, "date": "Jan 18, 2015", "message": "I worked for a large international tech company.  So large you likely have one of their products on your desk right now.  They actually spent money to, get this, remove all cubicle partitions, and REPLACE THEM WITH SHORTER ONES.  Like 10\" shorter.  So, not only did I have eyeballs looking at me right over the top edge of my monitor, but I could now better see every g*#$damn person walk by.\n\nIt was almost as if it was done to demoralize everyone.  What the heck else could the motivation be?"}, {"author_name": "jyoti", "gravatar_hash": "507e662421fda2ec8c294f12d8a2073e", "author_url": null, "date": "Jan 18, 2015", "message": "cool company"}, {"author_name": "Sigh", "gravatar_hash": "c00b7423e25f45959690ed41fb84f141", "author_url": null, "date": "Jan 18, 2015", "message": "So working in a quarter-cubicle directly across from someone's eyes in a room where everyone can hear everything spoken by everyone else even in the quietest voice is not the only type of office that exists?"}, {"author_name": "Sigh", "gravatar_hash": "c00b7423e25f45959690ed41fb84f141", "author_url": null, "date": "Jan 18, 2015", "message": "<blockquote>This design here, although I’m sure meaning well, still conveys a lack of trust from the management in their employees</blockquote>\n\nYeah, I would hate to work in that kind of office.  It's literally a panopticon (which was invented to make *prisoners* feel like they were being watched at all times).\n\n<blockquote>The concept of the design is to allow a single watchman to observe (-opticon) all (pan-) inmates of an institution without the inmates being able to tell whether or not they are being watched. Although it is physically impossible for the single watchman to observe all cells at once, the fact that the inmates cannot know when they are being watched means that all inmates must act as though they are watched at all times, effectively controlling their own behaviour constantly.</blockquote>"}, {"author_name": "Mark G. Woodruff", "gravatar_hash": "30eb081e16a2ff4bd649ad904e0c72ef", "author_url": null, "date": "Jan 18, 2015", "message": "I'm old. Since starting to program professionally at the age of 12, I've now written programs for longer than most programmers have lived. Eeks! I've worked in single person offices, cubicle farms, single offices person stuffed with six programmers, factory floors, and even closets. At the last company I worked for, I worked from both home, with treadmill and desk workstations, as well as the main office, with an open floor plan. What works best? It depends...\n\nWhen I wrote the dispatcher that refactored queries then ran them in parallel across multiple servers simultaneously, I worked from home with phone disconnected, blinds closed...even Skype off. I needed total concentration and couldn't tolerate any interruptions.\n\nWhen I wrote web pages, I worked at the office, so I could both answer others' questions, as well as get a sense of how they were working, whether I could do anything to make them more productive (management by observation if you will). What works best varies from culture to culture as well as person to person, and even for the same person, from need to need.\n\nThis remains constant, however: Good programmers want to be good programmers and work towards that aim regardless of their environment. Good companies want to be good companies; they work towards that too. If a company has an open floor plan because they're trying to improve communication, that may be a good company to work with. In another, if everyone has an individual office because they're trying to boost productivity, that may be a good company to work with. \n\nOnly if no one really cares, because no one is trying to do more than the minimum, should you run. For no matter how nice the office view, how pleasant the perqs, or how lucrative the contract, a company without people driven to better themselves and others is a morgue. No incentive can cover that smell of death and decay."}, {"author_name": "StackMan", "gravatar_hash": "b1732a99702ad3922fbea6e2becbcffb", "author_url": null, "date": "Jan 18, 2015", "message": "Apparently, putting many people into an open space enables agile. I wonder how can they be agile when they are constantly distracted by sounds near them. I have heard a developer or two complaining about \ntoo much noise."}, {"author_name": "Amit", "gravatar_hash": "5d78474918f54bccc3792f9e5a157c60", "author_url": null, "date": "Jan 18, 2015", "message": "Apparently negatives of open spaces out weigh the positives.. +1 for such a great article. I wish I worked in a company like SO."}, {"author_name": "Emil Tzvetkov", "gravatar_hash": "d9c70318f6f10ae128cb32d9d6d56189", "author_url": null, "date": "Jan 19, 2015", "message": "I'm curious, what kind of software are you using for text chats and text chat rooms?"}, {"author_name": "Peter", "gravatar_hash": "aa1e06d3f614866b87d81f6770698080", "author_url": null, "date": "Jan 19, 2015", "message": "My workplace is in a kitchen. Hungary, 2015"}, {"author_name": "Heckler", "gravatar_hash": "943c295af3a3af18c8b8bceeb30d028e", "author_url": null, "date": "Jan 19, 2015", "message": "The links given don't actually prove much. One of the links is even a blog piece. It's a matter of team management and the ability of the owner to hire people that mesh well with the existing team (or subteam, in the case of larger companies).\n\nI'm glad it works for you. But I wouldn't trade my open office environment for anything. My co-workers are great, and when we're all working the ambient noise is basically nil.\n\nCertainly, I wouldn't like other commenters claim that one way is objective correct, and the other way sucks :D"}, {"author_name": "Joris Hilhorst", "gravatar_hash": "f9d31531b64ded251e0b0c99c77bf3e5", "author_url": null, "date": "Jan 19, 2015", "message": "I'm so envious. The last employers all chose to work in open plan offices and it's hell. Some devs like it it seems (my ex boss told me) and a lot of designers like it, but it's hell on concentration."}, {"author_name": "stib", "gravatar_hash": "83b959e13ace9f8b3f4f718e09e4f985", "author_url": null, "date": "Jan 19, 2015", "message": "I have a separate office with soundproof walls and door. But that's because among other things I'm a sound editor and my monitor speakers can make the furniture start moving around the floor when I crank the bass."}, {"author_name": "badboy", "gravatar_hash": "a5ded7f3cd6fa15ab3e9d5bd153b230f", "author_url": null, "date": "Jan 19, 2015", "message": "it's telepaty Company!!!!!!"}, {"author_name": "Invent - Animate", "gravatar_hash": "0667170dad44f573a53b8c8c50d907ba", "author_url": null, "date": "Jan 19, 2015", "message": "I'm drooling. I wish I worked for a software company (assuming the grass is greener on the other side).."}, {"author_name": "John R.", "gravatar_hash": "3749b9fd42e5ebf96a12e8b9fb2f8244", "author_url": null, "date": "Jan 19, 2015", "message": "@Ravenstine \n\nBla, bla, bla, part of something, bla, bla, bla, team chemistry, bla, bla."}, {"author_name": "jerryk", "gravatar_hash": "6850e026be7e387944c5af988f598b9a", "author_url": null, "date": "Jan 19, 2015", "message": "Good to see private offices.  I do consulting and hate when I go to a client that has cubes or worse yet an open office.  When you are trying to work through some complex logic you need silence and no distractions. Also, if you are on a concall you do not want to disturb others.   At my own office I ensure everyone has a private office."}, {"author_name": "CT", "gravatar_hash": "c67700182b7ef1f92ecce945db1eb69c", "author_url": null, "date": "Jan 19, 2015", "message": "Boy this is exactly How I want to work. I am glad to hear there are companies out there!"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://about.me/cky", "date": "Jan 19, 2015", "message": "@Emil The chat system is developed in-house by the Stack Exchange dev team, and is tightly integrated with the Stack Exchange accounts system. You can't get it outside of the Stack Exchange network. :-)"}, {"author_name": "Skiamakhos", "gravatar_hash": "ca9bf278f11a5fa836ce687cf092b12a", "author_url": null, "date": "Jan 19, 2015", "message": "Obviously some kind of informal communal space is needed for agile, but so are spaces where programmers can go &amp; work as pairs or alone undisturbed &amp; undistracted. I've always worked in open-plan offices &amp; I've always hated it with a passion. I suspect that even as I type this someone is taking note &amp; there'll be an item in the next standup about people \"using the internet\"."}, {"author_name": "JM", "gravatar_hash": "0c2672d183877f7fcd8d46970ef03f1f", "author_url": null, "date": "Jan 19, 2015", "message": "Having been attacked in the office, just looking at those awful pictures of offices where you are stuck with you back to the glass wall made me want to throw up. Offices are great, offices where you have glass walss are creepy, offices where you are stuck with your back to the door are  dangerous."}, {"author_name": "ForceMagic", "gravatar_hash": "989187c895635538a21addb18a9a4fab", "author_url": null, "date": "Jan 19, 2015", "message": "This is so brilliant, I love the windowed office walls, you can write stuff on them, so no need to have a whiteboard, plus you get all the light and stay focused!\n\nToo bad, in my office, it's open space and we are packed together like sardines... What a shame!"}, {"author_name": "Hatem", "gravatar_hash": "4c76472d857b539d869f3a3e06b1ad5c", "author_url": "http://hatemalimam.com", "date": "Jan 19, 2015", "message": "Recently the company I work for decided to have an open space, and not only this, the support team and the help-desk are located side by side with the developers. I honestly hated the open space after this experiment!"}, {"author_name": "Lakeisha", "gravatar_hash": "5cac95afc4db287e97b17f392066d012", "author_url": "http://www.cix.me/affiliate_marketing_uk_forum_6955443", "date": "Jan 19, 2015", "message": "Touche. Great arguments. Keep up the amazing work."}, {"author_name": "Carlos", "gravatar_hash": "646dd8738f0b2f26720011bcb15dd545", "author_url": null, "date": "Jan 19, 2015", "message": "As I see it.  Offices are for people who want to get work done.  Open spaces are you to help other people get their work done.  The last job I had, we moved into a building with open office space for the software/mechanical and electrical teams.  It was a disaster and continues to be a disaster.  I only lasted another 2 1/2 years.  I now work for a start-up where I work from home 3 days a week, where I get most of my work done.  The other 2 days I go into the office, mostly for meetings.  It is an open space but it works because those 2 days I am actually working with the other departments.  It's been 4 months and works perfectly for me."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Jan 19, 2015", "message": "@JM I am so sorry to hear that you experienced trauma in the workplace. I agree that having your back in the open is a vulnerable position.\n\nI understand the rationale behind the positioning, so that people walking around in the corridors are less of a distraction, but, if it makes you feel vulnerable or triggered, then it's definitely more of a distraction, not less.\n\nIf you plan to apply to Stack Exchange, you should definitely make that a known point. You may opt to work remotely from home, if they don't have an office arrangement that would make you feel safe."}, {"author_name": "Peter Alfvin", "gravatar_hash": "ec173eb866e0d1d97bcd22cf6ad6550a", "author_url": null, "date": "Jan 19, 2015", "message": "I'm surprised there hasn't been more of a discussion of the impact of pair programming on the effectiveness of a particular office layout.\n\nWhen I'm working by myself, I very much prefer quiet and privacy. Noise and conversations in particular are a significant distraction. Translation: I prefer a private, walled office if I'm working by myself, provided I have ready, electronic access to my teammates.\n\nWhen I'm pairing with someone, I'm in a near constant state of dialog and am pretty much oblivious to what's going on around me. I also find that pairing and the reliance on TDD and other lean/agile practices lead me to break problems down into small pieces which reduces the amount of information I need to keep in my head and reduces the need for total concentration. Translation: I prefer open space if I'm doing pair programming (which is pretty much all the time these days).\n\nI've fortunately only spent a small part of my career in a cubicle, but it was long enough to convince me that it provides the worst of both worlds, maximizing distractions while minimizing the ability to collaborate."}, {"author_name": "Joan", "gravatar_hash": "1a3105fee1666afbf81b4640fb20ba3b", "author_url": null, "date": "Jan 19, 2015", "message": "No one has commented on the poor hearing impaired individuals that can be extremely productive if not put into a bullpen of noise.  I am WAY more productive working from home, but my current company does not allow for this policy."}, {"author_name": "T.J. Crowder", "gravatar_hash": "ca3e484c121268e4c8302616b2395eb9", "author_url": "http://www.farsightsoftware.com", "date": "Jan 20, 2015", "message": "I simply could not accept a permanent position if it required working in the pictured \"offices\" unless I could rearrange the furniture so I was looking out the window (e.g., back to the wall). A few others have raised that point as well. I had an on-site contract once where the only available desk had its back to the room; productivity was easily halved by the constant pinging from my lizard brain about possible danger behind me.\n\nJoel, are they re-arrangeable?"}, {"author_name": "Mark Vitek", "gravatar_hash": "eb1512a1468013ab16192afd64983f09", "author_url": null, "date": "Jan 20, 2015", "message": "When I started as a developer in 1993 - my first \"real\" software development position - I had my own office with a view. \n\nSince 2002 I've been in cubes, with the height of the dividers slowly descending.\n\nProgress FTW."}, {"author_name": "Blundell", "gravatar_hash": "ebf7667adca9f4d2ced8a6f48f4baa41", "author_url": "http://blog.blundellapps.com", "date": "Jan 20, 2015", "message": "Great post! I can see the benefits of open and closed, I love the glass offices, but the thing I love the most is having hangouts for any discussion even if you are on the same site, great idea!"}, {"author_name": "J", "gravatar_hash": "dc6e010a9643b9f6406510422744d645", "author_url": null, "date": "Jan 20, 2015", "message": "I don't think companies actually believe open plan offices are better for creativity/productivity etc. They are cheaper and that is the spin. \n\nAlthough, perhaps the spin has been spun so long that companies actually believe it?"}, {"author_name": "Someone", "gravatar_hash": "37c8f6ba837be84dab4aeaf4098df05c", "author_url": null, "date": "Jan 20, 2015", "message": "Ooh la laa!"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Jan 20, 2015", "message": "@Perry It's actually referring to a view of Joel Spolsky, as @Andrei pointed out. (Oh, how I wish this blog had upvote buttons!)"}, {"author_name": "Zircon Interiors", "gravatar_hash": "1b82f09985618951e1e699e82fa4e8a2", "author_url": "http://www.zirconinterior.com.au/", "date": "Jan 21, 2015", "message": "WOW! This is amazing. One of the most beautiful office I have ever seen."}, {"author_name": "James Jones", "gravatar_hash": "d82f002a9884282fb76871d63027ab59", "author_url": null, "date": "Jan 21, 2015", "message": "Yep, not only did my company force us into a large open floor plan with our newest building, but one of the directors dictated that there would be \"NO Headphones Allowed\" because he was worried people would be listening to music when they should be working.  Just another comment on clueless upper managers, who sit in closed offices and do exactly what??\n\nI've worked in offices and cubicles over the years and there is no doubt my productivity is about 2x with an office as compared to cubicles!!"}, {"author_name": "Bill Turner", "gravatar_hash": "2fdd96b74e3138d71668400afd01659e", "author_url": null, "date": "Jan 21, 2015", "message": "Like @GiantCowFilms - I really wish to know from where the sit/stand desks come. My neurologist recommends it. I shall be working extensively from my home office on my next gig.\n\nIn nearly 36 years as a professional developer, I have worked in many environments, like @Mark G. Woodruff - including many of the same experiences, such as factory and warehouse floors and closets. Guess that is what happens when you are a contractor. I once was fortunate enough to be placed in a private office - being no space in the cubicle farm and the FTE for the space was yet to be hired. This really opened my eyes. I was so productive! Since then I have worked off-site on several projects. I find this nearly as productive, though casual communication - the quick question tossed to the person next to you - is missing, even with tools like skype, trello and join.me. So, a bit of a loss, but far better than cubicles, and, worse, the open spaces."}, {"author_name": "Nick Stokman", "gravatar_hash": "35a9af3573901876ff0b1a598026ce1d", "author_url": "http://ilosvideos.com", "date": "Jan 22, 2015", "message": "Thanks for the post. I noticed you mentioned Trello and was wondering how your team uses it (my company has been experimenting with it the last couple weeks). Do you still use a bug tracking applications like Jira etc? Any advice on this subject would be killer. Thanks!"}, {"author_name": "LJL", "gravatar_hash": "d6d8cc64783081bfdc87700c986993e5", "author_url": null, "date": "Jan 22, 2015", "message": "I would almost kill to work in a company that understands the need for privacy and quiet, and why deliberate collaboration behind a closed door is better than a bullpen of noise.\n\nI have now worked in five different open space configurations, and they all suck.  I would prefer even a low cube to hanging my butt out into a walkway and having people talking and moving around me.  Open plan dog pits have no ability to have your own space, your own whiteboard, your own books or your own thoughts!  I feel like a replaceable cog in a meat grinding machine.\n\nI would apply to work for you, but I could not live on the East Coast."}, {"author_name": "John Hardy", "gravatar_hash": "49743a93e0cb8e9944d217ffa7d62d1b", "author_url": "http://www.yarrabee.com.au", "date": "Feb 13, 2015", "message": "It looks perfect. Office design should be like this. Now i thinking about to renovate my office like this design."}]}