{"response": [{"author_name": "TylerH", "gravatar_hash": "1cd9e6edf9f4defca0c0d5b68ac9cded", "author_url": null, "date": "Feb 12, 2015", "message": "On the ideas front, how about letting us view all jobs on Stack Overflow careers, without having to search for something? Then we could also sort by language requirements (what are the five hottest languages on SO Careers? I can't easily find that info, but I should be able to), or some other attribute/combo of attributes."}, {"author_name": "Mooseman", "gravatar_hash": "6bd562c1aef71c9d715f6b982a5fd71c", "author_url": null, "date": "Feb 12, 2015", "message": "How about an office hours program for 10k+ users? It would have to be scheduled, but it would be really interesting to visit SE and have lunch with a few folks we know from the meta."}, {"author_name": "Avi D", "gravatar_hash": "a88248f632c039340efa02505be355e5", "author_url": null, "date": "Feb 12, 2015", "message": "What about expert trainers in specific niche areas, such as e.g. secure coding and security in general?"}, {"author_name": "Lando", "gravatar_hash": "cd54be77e01e94b46b474e5fc64bd725", "author_url": null, "date": "Feb 12, 2015", "message": "Would love to live &amp; work in NYC, but from what I've seen, the open positions don't pay enough.  Why make 120-150K in NYC when you can make 110K in Austin, TX?"}, {"author_name": "John Summers", "gravatar_hash": "dba25aa1ee22743ba2616c12bd320337", "author_url": null, "date": "Feb 12, 2015", "message": "@Lando I think the decision to live in the greatest city of the world (NYC) and Austin is a very easy one to make :)"}, {"author_name": "Rafflesia arnoldii", "gravatar_hash": "dce0b9873422a08a79a71743aaf0107a", "author_url": "http://math.stackexchange.com/users/147263/rafflesia-arnoldii", "date": "Feb 12, 2015", "message": "\"or a lot of websites aren’t going to get built.\"\n\nWhere's the bad part?"}, {"author_name": "DeveloperDude", "gravatar_hash": "57876cdf5ca376c6667a361ebf2b9d2c", "author_url": null, "date": "Feb 12, 2015", "message": "Nice! Now one more reason to envy the developers living in NYC. I so wish.. there was something like this going on in her at Bangalore too!"}, {"author_name": "Thomas", "gravatar_hash": "baf7ac02528b89e20ea8ede34e299966", "author_url": null, "date": "Feb 13, 2015", "message": "i'll move to NYC if someone wants to give me a visa or work permit. Developing in Berlin and London for the last few years so not a complete noob :)  Check out my linked in https://www.linkedin.com/profile/view?id=147512267&amp;trk=nav_responsive_tab_profile_pic"}, {"author_name": "Invent - Animate", "gravatar_hash": "0667170dad44f573a53b8c8c50d907ba", "author_url": null, "date": "Feb 13, 2015", "message": "Very cool! As a new developer learning on the job, this is an awesome initiative! I only wish there were more minds like yours! I would love to get to that \"next level\" and have fun doing it - not get frustrated because I'm a novice and don't have clear guidance. Which is, in my opinion, the hardest part; getting started with clear direction. Bravo."}, {"author_name": "CraigG", "gravatar_hash": "8bb7e18c6a1e70efb6f94d10c8a882f1", "author_url": null, "date": "Feb 13, 2015", "message": "\"As you probably know, there’s a vast disparity between open tech jobs and qualified developers in today’s market. At last count, there are nearly 5 job openings for every one job-seeking developer.\"\n\nInteresting that salaries aren't rising significantly if there really is this much demand.  I'm curious why developer salaries seem to violate the basic economics behind supply and demand.  Generally people who are (or would be) excellent developers can go to another field and be very successful there and make a lot more money than as a developer.\n\nWhile places like NY, Seattle and Silicon Valley are hurting for developers, it's likely because many of us just don't see it as worth it to move there for what we see the jobs are offering.  While working on an interesting project with a great group of people goes a long way, we still gotta pay the bills (and the bills are much more expensive in those places).\n\nAs such, initiatives like the one noted in this blog, while seemingly well-intentioned, really seem to be a means to try to fill the demand for developers in these locations without raising the salary level."}, {"author_name": "Bethany Marzewski", "gravatar_hash": "2223637b994c460e6653d016ba972316", "author_url": null, "date": "Feb 13, 2015", "message": "@TylerH Thanks for calling this to our attention! For now, to view all jobs on Careers, just click the blue \"Search\" button without typing anything in the text fields.\n\n@Thomas Why are you posting your LinkedIn profile in these comments instead of your Careers profile?? :) https://careers.stackoverflow.com/cv/get-one"}, {"author_name": "mike", "gravatar_hash": "e26bcfbe1c63b28805dfcc1ddd07ef0d", "author_url": null, "date": "Feb 13, 2015", "message": "What we need is an orientation package to get significant others onboard with moving."}, {"author_name": "Roman C", "gravatar_hash": "b95463bf1a78696afd3ffe7d2d2a2faf", "author_url": null, "date": "Feb 14, 2015", "message": "Who is hiring?"}, {"author_name": "Ashwin", "gravatar_hash": "db3f2099833941a265e8341d75b0e510", "author_url": null, "date": "Feb 15, 2015", "message": "I read that the current curriculum will be instructed at CUNY, are there any provisions for students who want to learn, but cannot commute to CUNY ?"}, {"author_name": "CJV", "gravatar_hash": "6884bcd4f75512258daec01d25d77d0b", "author_url": null, "date": "Feb 15, 2015", "message": "So the actual program (not tax-deductible schmoozing) only exists for CUNY students? And those putting it together get to scam coeds all the while? Sounds par for the course."}, {"author_name": "Yup", "gravatar_hash": "85b36af7965cc2eab6a8ffafbc68c8d3", "author_url": null, "date": "Feb 15, 2015", "message": "@CraigG\n\nYup. This is exactly how it's been. There are 300k openings and not enough people to fill them because everyone wants to hire the next great software engineer and pay them like the next great burger-flipper.\n\nIf salaries would rise, more people would come to NY. The fact is that even if you're an amazing developer, it's extremely rare for a job to pay enough for you to live and raise your family in a decent area.\n\nI pay $2500/mo for a crappy studio in Manhattan. The bathroom tiles are cracked, the bathroom ceiling is peeling, a strip of the wooden floor has been torn out perpendicular to the other wood planks and anther non-matching plank was replaced to fill it. No central heating or cooling and I can always smell my neighbors smoking in their apartments. All for $2500 - which is below market for a studio in this area.\n\nIf you want a 1-bedroom in this area or another decent area, with central heating and cooling and a decent amount of space so that you can have something resembling a modern lifestyle instead of a garbage-living, that'll cost you 3.5k-4k per month.\n\nIf you have a kid, then you'll want a 2-bedroom apartment. That'll be 5k/mo.\n\nIf you have two kids, you'll want a 3-bedroom apartment. That'll be $6k/mo.\n\nOtherwise you can have 60-minute commute from a crappy area and your kids can go to crappy schools.\n\nYou'll need to have a minimum of 40-50x the monthly rent to qualify for a place. So you if you want that $6k/mo 3-bedroom apartment for your kids, you'll need to make $240k-300k/yr. But the average senior software engineer makes maybe $140k/yr here. Companies don't want to pay enough for their engineers to have a decent lifestyle, so of course they have trouble hiring engineers."}, {"author_name": "TylerH", "gravatar_hash": "1cd9e6edf9f4defca0c0d5b68ac9cded", "author_url": null, "date": "Feb 16, 2015", "message": "@Yup We should go one step further down this rabbit hole and work to get property values and cost of living reduced in such areas. $140,000/year is wealthy in America in many states, and most countries in the world. There shouldn't be localized inflation of 100% to 300% within the borders of a single country. If I can work for a New York or San Francisco company for barely over six figures and work remotely in the south, I will be living in the lap of luxury. \n\nSurely this is a more worthy cause than perpetuating the problem by reinforcement and simply paying more?"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "b653b7151d55cded30759a5c35f95390", "author_url": "http://stackoverflow.com/users/13", "date": "Feb 17, 2015", "message": "@Bethany You forgot to give Thomas an invite code. ;-)\n\n@Thomas Contact me (my email address is listed in my GitHub profile) if you need an invite code for Stack Overflow Careers."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "b653b7151d55cded30759a5c35f95390", "author_url": "http://stackoverflow.com/users/13", "date": "Feb 17, 2015", "message": "@Mooseman Do you know how many 10k+ users there are? http://stackexchange.com/leagues/1/alltime/stackoverflow says there are nearly 7000 (at current time of writing). That's a lot of people to be opening doors to!\n\nI propose a 100k+ cutoff. Then only about 250 users (at current time of writing) need to be accommodated. :-D"}, {"author_name": "Aaron Hall", "gravatar_hash": "4c5cdff5552fce93f0ffd371b2647be0", "author_url": "http://stackoverflow.com/users/541136/aaron-hall", "date": "Feb 19, 2015", "message": "Note that we've got a thriving tech meetup community and multiple groups with office/hacker hours (particularly for Python and Rails). \n\nIt would be nice if Stackoverflow would open their common areas for this sort of activity, (consider if it were a workshare space.) \n\nExpectations are for conference room type areas, with wifi and powerstrips. We typically have coffee or tea provided by our hosts at a minimum on the weekends. For weeknight talks, our hosts sometimes provide pizza and beer. If we're put in a kitchen/pantry type area, put a note on the fridge or shelves if you don't want us to drink your drinks and eat your snacks.\n\nI personally am an event organizer with NYCPython and Learn Python NYC, and I'm friends with other organizers in other groups. If you're interested in talking more, please contact me.\n\nAs for a reputation floor as suggested by some commenters, I don't think you'll want that. There's plenty of qualified programmers with low SO rep, simply because they haven't fully engaged in participating on the site, and limiting participants by that is likely to ensure no-one shows up."}]}