{"response": [{"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 07, 2009", "message": "Also, I removed all the initial +100 reputation bonuses from Server Fault for \"account migration\", as this account association method effectively replaces it."}, {"author_name": "Bremen", "gravatar_hash": "9a45de8df0c5c3f6e137c785e71557b8", "author_url": null, "date": "Jul 07, 2009", "message": "Sweet. Now hurry up launching superuser.com so we can get another 100 rep! On that note, I wonder how much rep-farming superuser.com is going to generate.. people could go on for days asking simple-to-answer questions about everything, even if they already know the answer. Or even asking questions and answering them. It'll be interesting to see how it pans out, since superuser is certainly a broader audience and a much, much broader question-space."}, {"author_name": "malach", "gravatar_hash": "09eb3720b1c9d33bedd35a3bd47ec1c9", "author_url": "http://rickenba.ch", "date": "Jul 07, 2009", "message": "Thanks for the +100, but I do feel a little cheated. Since my openId works as expected (not googelish), I did have the +100 for account migration and lost them now, which effectively halfes my earnings through account association (I lost +99 in both serverfault and meta). Maybe I'm just too much into rep, but I have to say it's fun. Keep up the good work!\n\nToo bad my name is not George, otherwise my Captcha would count for the list of great one: \"fervent Jorge\"."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 08, 2009", "message": "> Since my openId works as expected (not googelish), I did have the +100 for account migration and lost them now, which effectively halfes my earnings through account association (I lost +99 in both serverfault and meta)\n\nAs long as you have one account with >= 200 rep on ANY site, you should be able to get the +100 per-site bonus for all 3 or 4 associations. Just make sure the association pair includes the account with >= 100 rep."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Jul 08, 2009", "message": "I see you've taken Joel's advice :) Very well done, worked as a charm."}, {"author_name": "Jakub Narębski", "gravatar_hash": "672aa8b373071ef9f06db563d1c08d77", "author_url": null, "date": "Jul 08, 2009", "message": "I did that (associate StackOverflow and Meta accounts) after \"accounts\" tab appeared, but I think before workaround for Google OpenID quirks, via secondary OpenID using Technorati. Nice bit of code!"}, {"author_name": "Neil Trodden", "gravatar_hash": "10701e62fff85c082ba4cb2a08258479", "author_url": null, "date": "Jul 08, 2009", "message": "Well done, this was pretty painless!"}, {"author_name": "Colin Pickard", "gravatar_hash": "463ef1b716cb5d6db0f5b43a07dd06d4", "author_url": "http://cpickard.net", "date": "Jul 08, 2009", "message": "Associating SO with Meta gave the message:\n\"You've associated your Stack Overflow and Server Fault accounts: +100 reputation\"\non SO.\n\nI got the correct message on Meta.\n\nI had previously associated SO and SF (with correct messages)"}, {"author_name": "Colin Pickard", "gravatar_hash": "463ef1b716cb5d6db0f5b43a07dd06d4", "author_url": "http://cpickard.net", "date": "Jul 08, 2009", "message": "Actually scratch that, the next time I went back to SO, I got the correct message, I guess it was just something strange with the message stacking, it hadn't registered me clearing the initial message"}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Jul 08, 2009", "message": "This is very cool. Thanks!"}, {"author_name": "Matthew Stewart", "gravatar_hash": "a2342ef5b27305d9b08d44e0e11c14b1", "author_url": null, "date": "Jul 08, 2009", "message": "Just tried this out and it didn't work.  Maybe because I had exactly 100 rep? Or maybe I messed something else up. Odd."}, {"author_name": "timepilot", "gravatar_hash": "584fce2e32923196e7286d1def0584be", "author_url": null, "date": "Jul 08, 2009", "message": "I just tried this and I'm getting errors.  Stack and Server give me an error message.  Meta shows my Stack and Server accounts but says my email is \"already registered\".  Given the above, I'm not surprised but also no rep awards."}, {"author_name": "Dillie-O", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://dillieodigital.net", "date": "Jul 08, 2009", "message": "Well that answers the interesting drop in rep on SO and MSO the other day. I had just figured another recalc went in somewhere.\n\nGreat feature!!! Keep up the great work!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 08, 2009", "message": "@timepilot try again -- we were enforcing \"must be same IP\" restrictions between requests, but some users have incrementing IPs. Now it's only the same subnet."}, {"author_name": "kost", "gravatar_hash": "335fc20f7203bda8fdcd109410ad1683", "author_url": null, "date": "Jul 09, 2009", "message": "Strange bug - had an active SO account and a meta account with 1 rep, linked the meta from the SO account, both got +100 rep. Didn't have a SF account, went to the SF site, create an account, linked the SO account *from the SF account*. Now, the SF account got +100 rep, but the SO account didn't. What's even more strange is that the SF \"flair\" in SO just displays the rep, no name or badges."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jul 09, 2009", "message": "@kost: I wouldn't expect the SO account to get any more rep, if it had already got the bonus from Meta. Basically any account can only be \"blessed\" with the bonus once, if I understand correctly."}, {"author_name": "kost", "gravatar_hash": "335fc20f7203bda8fdcd109410ad1683", "author_url": null, "date": "Jul 09, 2009", "message": "@Jon Skeet: right as always, my bad. But the strange thing is that the flair thing still doesn't have my name: http://img40.imageshack.us/img40/9356/flairh.jpg"}, {"author_name": "mafutrct", "gravatar_hash": "a7c22254d91baa9ca18786a9d46549f0", "author_url": "http://mafutrct.wordpress.com", "date": "Jul 09, 2009", "message": "Everything worked perfectly fine for me. Thanks for the feature!"}, {"author_name": "Marc", "gravatar_hash": "f4ddf936e14a4b753a8dfc3a6a8072be", "author_url": null, "date": "Jul 09, 2009", "message": "This is a great change!  It definitely helps encourage more of the existing users to branch out and use more of the sister sites.  At this pace, Jeff &amp; Joel are building a full-on cult of highly talented computer users, from novice to 40-year pro.  I feel home.\n\nQuestion from the less-active member's perspective.  I've got accounts on SO and SF, both of which have less than 100 rep.  (I know, I need to step it up)  If I associate my two accounts now, will they see this boost once one of them goes above 100?  Or should I wait until after one of them has 100 to associate them?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 09, 2009", "message": "Hi Marc, as long as at least one of the accounts in the \"pair\" being associated has > 200 rep, the +100 bonus will apply on both sites (but only once per site in total)."}, {"author_name": "Curtis Tasker", "gravatar_hash": "98ccc7a511f79023e56c0b143d9ae18b", "author_url": "http://curtistasker.com", "date": "Jul 10, 2009", "message": "I mistakenly linked my accounts before any of them had reached the proper reputation threshold for the bonus.  When I passed the threshold, I wasn't awarded the bonus retroactively.\n\nWith the advent of the 'Clear All Associations' button in the accounts tab, I removed my associations and re-linked my accounts.  I still was not awarded the bonus, and I'm still sporting a lonely little 1 for my meta.stackoverflow.com rep."}, {"author_name": "Marc", "gravatar_hash": "f4ddf936e14a4b753a8dfc3a6a8072be", "author_url": null, "date": "Jul 14, 2009", "message": "Thanks for the reply, Jeff.  Curtis articulated my question more clearly, or rather confirmed my suspicion.  What happens when you pass the threshold -after- having linked your accounts?  It seems that right now, you don't get the bonus in that case.  Any plans to change this in the future?"}, {"author_name": "Zhaph - Ben Duguid", "gravatar_hash": "ef3e872b7359633a74dc57bd708fde22", "author_url": "http://www.doodle.co.uk/Blogs/", "date": "Jul 21, 2009", "message": "Hmm, this did seem to work on Meta for me some time ago, I distinctly remember having 101 rep there, I've even got a record of having up-voted twice:\nhttp://meta.stackoverflow.com/users/33051\n\nHowever, I now appear to have only 1 rep on meta :(\n\nSeems to have worked quite nicely on ServerFault and SuperUser however."}]}
