{"response": [{"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Jul 31, 2009", "message": "Well I certainly want to thank the fine Admins here that keep this (quad?)trilogy up and running. I'm sure you guys have been the target of a few who would like to embarrass the likes of Joel and yourself.\n\nYou guys do a wonderful job. :)"}, {"author_name": "Diago", "gravatar_hash": "d3eab8ee69d374c150510ced730cd6f6", "author_url": "http://diago.co.za", "date": "Jul 31, 2009", "message": "Thanks for this. Just sent a very nice e-mail to the hard working network team here at work. We left late last night having to rebuild a Windows 2008 DC after a old driver killed the upgrade.\n\nHappy SysAdmin day to the SO Team!"}, {"author_name": "Macha", "gravatar_hash": "f459a08d819d306193851c1d6871797a", "author_url": null, "date": "Jul 31, 2009", "message": "Any idea what happened to the computer in the picture or is it just a random picture?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 31, 2009", "message": "Bad sysadmins, obviously.. :)"}, {"author_name": "cubicZ", "gravatar_hash": "83ae53d8d2d8589dc317f717828cee26", "author_url": "http://technocracycheck.blogspot.com", "date": "Jul 31, 2009", "message": "\"System Admin, you're my hero\" - Cameron Fry"}, {"author_name": "Stewart Johnson", "gravatar_hash": "9f367b07b33be399fc8c13226d54adc2", "author_url": "http://bolidian.com/", "date": "Jul 31, 2009", "message": "The sysadmins where I work (a govt agency) are paid to do all that stuff, and it's in their job descriptions, but they sure as hell don't do most of it, and don't care about it.\n\nI've found that a lot of guys working in sysadmins prefer to let things fall apart and then work in put-out-fires mode, since that way they get publicly lauded for 'saving the day'. Nobody really notices or cares if you're proactive and nothing visible to the users goes wrong.\n\nClearly those guys shouldn't be working as sysadmins, but there's lots like them that are."}, {"author_name": "Eric", "gravatar_hash": "f9f349676938cdd38abbbe6e619d7315", "author_url": "http://eric.eisenhart.name/", "date": "Jul 31, 2009", "message": "@Stewart: Sadly, there are sysadmins out there with a case of \"sysadmin hero complex\".  The put-out-fires mode often comes with its own perks, like adrenaline and profuse thanks; it can be addictive to certain types of personalities. Good system administration is largely invisible to the end users.  From what I've seen, it's a small minority, but they tend to be more likely to be visible than the good sysadmins because of the hero complex.\n\nMaybe you should be thanking the sysadmins for all the OTHER systems you use instead, then.  :)  Like the ones where you haven't even had to think about the fact that there's a sysadmin."}, {"author_name": "Matt Hamilton", "gravatar_hash": "2bd5f782c135ff7ed12a95bf209eb973", "author_url": "http://www.madprops.org", "date": "Jul 31, 2009", "message": "This post has help me understand who our sysadmins are - they're the consultants and contractors that our IT support department pay $300 per hour to do all that stuff!"}, {"author_name": "vortecs", "gravatar_hash": "0ac344f5e5bcb80fd9eb6d1393b17ca8", "author_url": "http://vortecs.ro", "date": "Dec 09, 2009", "message": "hmmz ... what is the probablility that my server ends up in flames while i`m not at home to watch over it ? :-s"}]}