{"response": [{"author_name": "Rowland", "gravatar_hash": "8c8779a33adeec01e05d5a480c7cd3c3", "author_url": null, "date": "Jul 14, 2009", "message": "We don't have four. Yet..."}, {"author_name": "jjnguy", "gravatar_hash": "2e3bb9e76b9e5cd8f7eedc040d5ccd58", "author_url": null, "date": "Jul 14, 2009", "message": "Today is the day according to Jeff."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Jul 14, 2009", "message": "http://dev.superuser.com/beta-access\n\n&gt;_&gt;"}, {"author_name": "jjnguy", "gravatar_hash": "2e3bb9e76b9e5cd8f7eedc040d5ccd58", "author_url": null, "date": "Jul 14, 2009", "message": "@jeff  Should we start migrating so-faqs now?"}, {"author_name": "Andrija", "gravatar_hash": "3033051819dcdf850b0ee3251cfdafa4", "author_url": null, "date": "Jul 14, 2009", "message": "How do you get beta access code for superuser?"}, {"author_name": "jjnguy", "gravatar_hash": "2e3bb9e76b9e5cd8f7eedc040d5ccd58", "author_url": null, "date": "Jul 14, 2009", "message": "@andrija  You can't just yet."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Jul 14, 2009", "message": "TRWTF is \"What the hell is the bartender doing in StackOverflow?\""}, {"author_name": "Bruce Atkinson", "gravatar_hash": "0c241cebbad2e93625acc181329223cc", "author_url": null, "date": "Jul 14, 2009", "message": "I believe this shows that it would be a lot simpler and cleaner if you just had tags that reflect the question's audience rather than different sites.  What's more annoying then answering a question that is closed while you are answering it.  Having it moved to a different site."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 14, 2009", "message": "Bruce, indeed! Why have multiple websites on the internet at all -- why not have one enormous giant mongo website that covers every possible topic! Just tag it!\n\nThe truth, as usual, lies somewhere between these two extremes."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Jul 14, 2009", "message": "Jeff Atwood: \n\nNow that I have earned two mentions in a row on your blog, I think it's time you institute a \"TheTXI Watch\" on your blog. This is serious business."}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jul 14, 2009", "message": "It's great that post ownership and CW status are resolved with the new migration mechanism. It's also good that the original post retains its score and favorite votes. However, it looks like the scores on the answers aren't maintained when the question was moved over. In the example above, there was an answer by lc that had a score of 35, but it only has a score of 5 on Meta. If a rep recalc is done on SO, won't lc lose those points? What about badges? Since the post is deleted, this also effectively removes the badges gained (Nice Answer, Good Answer), as lc won't get them the next time an answer of his gets a score of 25, right?"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Jul 14, 2009", "message": "Kyle: I mentioned something exactly like what you were saying concerning the blog in a comment to an answer concerning this problem on the Meta. You won't \"lose\" the badge, but if you earn a new one it won't get added because it will just take the place of the badge that you no longer have proof of."}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jul 14, 2009", "message": "@TheTXI: Right, which I consider a net loss. For those with very highly ranked answers this acts as a major disincentive to move the post to the 'right' site."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "Jul 14, 2009", "message": "Have you given much thought to how tags will map when moving questions from site to site?"}, {"author_name": "Bruce Atkinson", "gravatar_hash": "0c241cebbad2e93625acc181329223cc", "author_url": null, "date": "Jul 14, 2009", "message": "@Jeff, It seems like you are taking my post to an extreme that changes what I am saying. I already know that my views on this topic, differ greatly from yours.  My point is that whether a question/answer is programming/admin/user related or some combination of them can be hard to decide.  Not only can it be hard to decide, it is different for different people.  I wear all three hats all the time, so for me filtering by tags would be simpler then having to decide which Stackoverflow site I should be using. Maybe I'm really requesting a feature like a top level SO site that lets me ask my question in one place and then see the results from all the SO sites."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 14, 2009", "message": "We can backfill scores to award the badges on meta.*, but the loss of the rep and badge on SO is sort of inevitable -- these are the \"fun\" questions that, per Gortok et al, should never have gotten badges at all.. so moving them to meta.* is a way for the badges to exist, but in a different area so there's less frustration and angst over badges awarded for \"fun stuff\"\n\nfex: Please Remove Badges from \"Fun\" Questions\n\nhttp://meta.stackoverflow.com/questions/1662/please-remove-badges-from-fun-questions"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 14, 2009", "message": "> Maybe I’m really requesting a feature like a top level SO site that lets me ask my question in one place and then see the results from all the SO sites\n\nWell, for read-only (search) access, that already exists in the form of Google.. I'm not convinced that figuring out where to ask a given question in the \"family\" (programming/sysadmin/software-hardware/meta) is terribly difficult."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Jul 14, 2009", "message": "Jeff Atwood: \n\nIt's not difficult, and if you make a mistake there is a high chance it will get moved to the correct location. All in all that sure sounds like the case is solved to me."}, {"author_name": "Bruce Atkinson", "gravatar_hash": "0c241cebbad2e93625acc181329223cc", "author_url": null, "date": "Jul 14, 2009", "message": "@Jeff, you wouldn't need the move command then.  The real problem though is when the question/answer bridges sites.  Powershell is a good example of how questions can bridge programming/admin."}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jul 14, 2009", "message": "&gt;We can backfill scores to award the badges on meta.*, but the loss of the rep and badge on SO is sort of inevitable\n\nI'd be OK with transferring the post scores, rep, and badges from SO to Meta (or wherever) - I just want to make sure I don't lose it somewhere in the transition."}, {"author_name": "Brian Duffy", "gravatar_hash": "974938b8250a08cf9e22714aff1f9fcc", "author_url": null, "date": "Jul 14, 2009", "message": "This is a bad idea, particularly since the sites are self-policed. You already see really dumb behavior and inane debates over the appropriateness of questions.\n\nHopefully the stackoverflow family of sites don't turn into a dysfunctional IT department. \"The server's fine, it must be your app\""}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Jul 14, 2009", "message": "Shouldn't this apply to question that are already closed as belongs on {other site}?"}, {"author_name": "Arjan van Bentem", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "Jul 15, 2009", "message": "I don't want to game the system, but I assume I cannot undelete my answer on the original site? I can see that the answer on the original site has been auto-deleted a few hours ago, and I could click \"undelete\"...\n\n(And I assume that the ownership migration might take some time -- http://superuser.com/questions/2/free-antivirus-solutions-for-windows/23#23 does not (yet) belong to me right now, but maybe that's because it's actually community wiki and I don't have the reputation for that yet on SU.)"}, {"author_name": "Jakub Narębski", "gravatar_hash": "672aa8b373071ef9f06db563d1c08d77", "author_url": null, "date": "Jul 15, 2009", "message": "I agree with what Juan Manuel says; there should be possible  (perhaps to author of question, perhaps to moderator/user with sufficient power) to move **closed** questions to Meta or SuperUser.\n\nAlso moderators probably would want tools to mass migrate such questions (not-programmin-related usually)."}]}