{"response": [{"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Jul 22, 2009", "message": "It has been my experience that people who apologize for their English inevitably use it better than the worst native speakers and often as well as average ones.\n\nBy the way, I don't think \"random\" means what you think it does. ;-)"}, {"author_name": "Nathan", "gravatar_hash": "5047fa2fea06d172138afc24e376b031", "author_url": null, "date": "Jul 22, 2009", "message": "I think you'll find that's a perfectly cromulent usage of the word random; in this instance it is used as a synonym for arbirtary.\n\nBut really, how are we supposed to deal with other languages when we can't even agree on how english works? ;)"}, {"author_name": "Maciej Rutkowski", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Jul 22, 2009", "message": "Native english speakers - their supposed to set the example on how to use they're language properly!"}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Jul 22, 2009", "message": "Arbitrary (or should I say \"random\"?) use of \"synonyms\" can lead to problems in understanding: http://stackoverflow.com/revisions/1108876/list (http://stackoverflow.com/questions/1108876)."}, {"author_name": "Nathan", "gravatar_hash": "5047fa2fea06d172138afc24e376b031", "author_url": null, "date": "Jul 22, 2009", "message": "@Dennis: I agree, but the context that Jeff used it in makes it pretty clear what he is actually getting at...\n\n@Maciej: that would have been an even better sentence if you'd managed to put \"there\" in it as well!"}, {"author_name": "Mike Stone", "gravatar_hash": "c8ba7ccacc70a7b826184e8d717bfcd7", "author_url": "http://smellsblue.blogspot.com", "date": "Jul 22, 2009", "message": "I wish I could downvote this blog post.\n\nI remember back... I think in beta, or shortly after launch, seeing a post in some other language.  It got a lot of negative feedback for being in another language, and I then felt (and still feel) it rather... rude to just block out other languages.\n\nGranted, the features that give the most bang for the buck should be tackled first, so take this with a grain of salt.  I feel like there could be a pretty reasonable way to support multiple languages, but keep the communities separate at the same time.\n\nThink Wikipedia and the separation of the various languages.  I think this analogy works great, and it might even be easy for you to implement, given the already broken up sister sites.  es.stackoverflow.com could become a brand new site (just like serverfault and superuser), except it shares the same styles of stackoverflow.  The difference is, it is for espanol (pardon lack of tilde) speaking people.  But in every other respect, it acts as a new community... new reputation, separate set of questions, etc.\n\nThe same kind of separation could work for as many languages as you see fit, though there are probably a few key languages that would gain the most traction if you built them.\n\nI think it would be an interesting experiment, and a great way for you to expand the business with minimal effort.  You could test drive it with a language you know would have some amount of traction, like Mandarin Chinese, German, or some other language where there is a large amount of developers that natively speak it.\n\nYou could probably crowd source the localization to some extent (provide a public place for people to translate the list of strings needing translation, and I'm sure the community would step up and fill in for you, at least if there is any interest for the given language).\n\nPlease consider it... it would be pretty cool to see Stack Overflow be the defacto place for ALL people of ALL cultures and ALL languages.  If you provide a way for people to duplicate questions among the languages, and change to be translated to that language... you might gain a boost in content as interesting content is translated by bilingual users."}, {"author_name": "JP", "gravatar_hash": "2bbfeae515500e1b7eb41dc8e8d396f6", "author_url": null, "date": "Jul 23, 2009", "message": "Sorry to say this -- but this is the typical attitude of Americans: They do not know *any* second language and expect all other people to speak english at least half-decently. Joel is totally right, Jeff -- in a couple of years, you'll be regretting this gung-ho attitude."}, {"author_name": "Andrea", "gravatar_hash": "d442474b9c83d51a32049cd3f61cb44f", "author_url": null, "date": "Jul 23, 2009", "message": "StackOverflow and ServerFault, due to their audience, have no sense in a language that is not English, SuperUser has.\n\nPS:\nSorry for my \"littleitalian\" english :P\n\nCaptcha: spain refugio (?)"}, {"author_name": "Sander Versluys", "gravatar_hash": "6a2edc913e801a2e6579d7a9a0356b4d", "author_url": null, "date": "Jul 23, 2009", "message": "I'm from Belgium, so dutch is my native language and while I do understand some people would like to see other supported languages on SO, SF or SU, I'm happy the knowledge isn't scattered on different websites.\n\nWhy choose English as the main language? Yes why, i really understand the frustration but history lead us to English as the native programming language and it is not going to change overnight.\n\nSo when thinking of this problem, you can conclude that choosing any language will always end with people complaining it wasn't their language.\n\nBut as suggested before, Wikipedia does it very well, but it works because of the large user base in almost all the supported languages and because of it's mission to provide 'all' knowledge to everybody in the world.\n\nWould this work for StackOverflow? I personally prefer to find an answer, even if it's bad English, in one location than to find no answer and knowing it is perhaps out there but i can't understand it.\n\nBut maybe the StackOverflow team will find a good solution to link answers in different languages and automagically translate them to a language of your choice, if they ever do decide to globalize the SO software."}, {"author_name": "Sander Versluys", "gravatar_hash": "6a2edc913e801a2e6579d7a9a0356b4d", "author_url": null, "date": "Jul 23, 2009", "message": "@Andrea, that's so true, StackOverflow doesn't need it, but especially SuperUser would be so much more successful when available in other languages. Good point!"}, {"author_name": "GaryA", "gravatar_hash": "bb8b23b10d7576fc173da1b79b7825e9", "author_url": null, "date": "Jul 23, 2009", "message": "Agreed.\n\nThe idea of the website is to share information.  Posts in other languages restrict the sharing of that information.  Just as we use HTTP for common computer to computer communication, we need a single language for people to people communications.  Sorry, English got there first!"}, {"author_name": "robaker", "gravatar_hash": "d5d30c9e90324b7fb0d33ff969cbfdd0", "author_url": null, "date": "Jul 23, 2009", "message": "I don't see why you even need this policy? If you can't understand the question (due to not knowing the language) then ignore it. Presumably those that do know that language will up/down vote it appropriately? If a good question isn't attracting responses then I'd expect someone to translate into a new question (with link to original) and pick up the kudos themselves."}, {"author_name": "Chris", "gravatar_hash": "e400600450847a664b70eabedb920d2e", "author_url": null, "date": "Jul 23, 2009", "message": "JP is totally right, I was going to say something similar.  Typical American...\nWhy not just tag it, ie. \"French\" and then set up rules like, I want to see, \"All\", \"English\", \"French\", \"German\" etc.  Then there would effectively be 20 StackOverflows for 20 languages.  Even better, if you could automatically identify which language they were speaking in and tag it for them.  Same goes for identifying programming language.  Another idea, if a question is tagged \"French\" say, then if a French reader can tell it is the same question as an \"English\" tagged question, it could be merged and then at some point ideally each answer would also be translated."}, {"author_name": "Nick Pierpoint", "gravatar_hash": "6a6e7d806c4445cb14a33e25cdb1163f", "author_url": null, "date": "Jul 23, 2009", "message": "Hi Jeff. I *do* understand your reasons - wanting to develop a single community where all can at least attempt to provide input to every question - but doesn't saying \"all questions WILL BE IN ENGLISH\" give you an incy tincy evil feeling in your gut?\n\nWhat's the worst thing that can happen if someone asks a question in Welsh, say? The questioner will probably not get a great answer because my guess is not many folks on the site speak Welsh. So... not many votes and the question quietly disappears. Next time round the questioner probably won't ask the question in Welsh or will ask in Welsh and paste in a google-translation below it. Everyone's happy. Questioner feels confident in asking a question in his/her mother tongue - everyone else sees a reasonably ok translation.\n\nSo - there's a question in Welsh that most people can't answer. Never mind. Move on to the next question but be happy in the knowledge that you have a lovely warm and inclusive feeling in your gut."}, {"author_name": "John Saunders", "gravatar_hash": "953e26e80351a67962a6e5840fc1fc14", "author_url": "http://johnwsaundersiii.spaces.live.com/", "date": "Jul 23, 2009", "message": "Point by point: \"Direct programmers to native language resources\": ok, let's create a list of them on meta. Then we can just paste in the URL. \n\n\"It is not our goal to teach English. It is our goal to teach programming.\" Yeah, but if English is the language of programming, then we'll need to teach some English, or at least, help the non English-speakers to learn it. They won't learn much from having their questions downvoted and closed, except possibly contempt and anger at us English-speakers. I'd rather not, thanks.\n\n\"The asker has to put effort into the question.\" Absolutely. My suggestion is that they should do their best in English, and then do their best either in their native language, or in the next language they know better than English (I can imagine someone from Algeria might know French better than English). \n\nIf there's a cogent question in _some_ language, following an incomprehensible question in English, then we stand a much better chance of editing the English version into something that makes sense. This should not just be the Google Translate version! \n\nI think such questions will allow us to include more of our fellow developers from around the world; may cause fewer \"drive-by questions\"; and may eventually lead the asker learning enough English that this point will become moot."}, {"author_name": "Felix Leong", "gravatar_hash": "2ec836f495a5a58b1df5ae191488acf6", "author_url": "http://felixleong.com/", "date": "Jul 23, 2009", "message": "In this regard, I have to side with Jeff in limiting SO strictly to use English only: I could imagine how much of a mess if the main page is showing questions of a bunch of completely different languages (as in a mash of English, French, Chinese etc.) - it's kinda counter productive and a turnoff really.\n\nI seriously doubt tagging would work in this scenario really... if it had to work that way, my Ignored Tags list would be extremely unmaintainable :p. If all questions of different languages appear on the same site, I might really hope that SO would have the capacity of auto-detecting what native language it is written and SO have the option of \"Only show questions in... [choose list of native languages here]\".\n\n... I'd rather have Jeff et al. to work on other great SO features than tackling that mountain.\n\nInternationalization is quite tricky on it's own, I could imagine if SO would to expand to accommodate other international languages, there's a few things that is needed:\n\n1. Having native versions of the site (e.g. http://fr.stackoverflow.com/ for French), which have questions being exclusively asked in that native language - which could be quite easy by using the same code base - even sharing a database even, but that would mean scaling challenges\n\n2. Translation to native languages, probably the volunteer model of Facebook could be used here\n\n3. Mechanisms to move question over the correct native language site (quite trivial, really)\n\n4. Hiring moderators. And my guess is that this would be the real ultimate pain point and it greatly depends on the level of trust that Jeff could handle"}, {"author_name": "Alistair", "gravatar_hash": "438c91736f20d0821c7a358ee8b00790", "author_url": null, "date": "Jul 23, 2009", "message": "I agree with John Saunders - I think that having non-native english speakers on the site is more beneficial to not having them at all, and the solution of having a semi-coherent english portion followed by their language of preference, means there is a chance the english portion can be edited and cleaned up either because it's close enough to get the gist, or edited by another speaker of their language who can translate from the non-english.\n\nchances the OP can understand english enough to read the answers in english (and maybe repost in their language) and still benefit from the responses.\n\nHmmm 16 extremes - new startup name? (captcha)"}, {"author_name": "Jonik", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Jul 23, 2009", "message": "JS says: \"Sorry to say this — but this is the typical attitude of Americans\"\n\nBah, nothing to do with that. (I stand by what I said earlier: http://blog.stackoverflow.com/2009/04/joke-questions-please-refrain/#comment-20583) The policy makes perfect sense, and I'd give it a +1.\n\nHowever, I do agree with Mike Stone that separate sites Wikipedia-style (fi.stackoverflow.com, ...) would probably work fine. (Different languages on the same site would *not*.) But it's not like Jeff and others running these sites have any kind of *responsibility* to start sites for all different languages. \n\n(For the record, if fi.stackoverflow.com did exist, I most likely wouldn't bother with it - and I think most other Finnish programmers wouldn't either. I might participate a little on es.stackoverflow.com though, just for fun. But it's also true that localising Super User would make more sense than localising SO and SF...)"}, {"author_name": "Jon Smock", "gravatar_hash": "7cf5af9e0f94976adae00ce7dfdd467b", "author_url": "http://jonsmock.com", "date": "Jul 23, 2009", "message": "Jon Skeet is telepathic.  If Chuck Norris used SO, that would make 2 telepathic users."}, {"author_name": "Kibbee", "gravatar_hash": "2b568071163c0d009635cfa63cf6e6ac", "author_url": "http://www.kibbee.ca", "date": "Jul 23, 2009", "message": "I really disagree with this.  When I look down the front page of stack overflow, I see mostly stuff I have no idea to answer.  C++, iPhone, Ruby, R, WPF, JQuery.  I couldn't answer any of these.  However, I can still make a good contribution to the site.  I have over 15,000 Rep, even though I can't even come close to answering most of the questions being asked.  I don't think add other human languages to the site will make things any different.  I probably have a better chance of putting a spanish VB.Net question through Google translate, and answering that, then I do of answering a question on python.  I think you might as well let people ask questions in whatever human language they want, just as you allow them to ask questions about whatever programming language they want.  Just let them be tagged, and then people can ignore them if they want to."}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Jul 23, 2009", "message": "We should just pointing people to http://translate.google.com/.  It does a good enough job to get the point across even if it is not the best english.  And then native english speakers can edit for clarity."}, {"author_name": "jj33", "gravatar_hash": "0d13010631066f56b30dc21d9fec0022", "author_url": null, "date": "Jul 23, 2009", "message": "\"(Please do try to make sense, as our users are often brilliant, but not telepathic as far as I know.)\"\n\nIf a telepath tries to read the thought of someone who speaks another language, will he succeed?  I'm going to spend the rest of the day pondering that..."}, {"author_name": "kost", "gravatar_hash": "335fc20f7203bda8fdcd109410ad1683", "author_url": null, "date": "Jul 23, 2009", "message": "yeah making a fr.superuser.com (and all 50 or so other) would really really make sense. Not only does it make sense to let users ask question in their own language, but also there are things in general computer use (unlike most of programming/sysadmin use) that are not the same in different countries.\n\nFor example, if I want to buy a cellphone or laptop, I would get a better answer on what is available in my country in a country/language specific SU. Another good example for this is Windows 7 E..."}, {"author_name": "brad dunbar", "gravatar_hash": "0168f51cd822a820c606c259b80e253f", "author_url": null, "date": "Jul 23, 2009", "message": "-1\n\nI think you're more creative than this Jeff.  You can solve this without excluding useful information.\n\nYou're saying \"non-english speakers can't receive knowledge from stackoverflow\" but all I hear is \"the potential pool of knowledge has been decreased\".\n\nThis is not an unsolvable problem.  Gmail automatically translates my emails.  GTalk translates my conversations.  Do something creative, allow questions to be tagged as other languages and give the option to translate them.  \n\nDon't fragment the community because of our differences."}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Jul 23, 2009", "message": "i will always post in simlish. and you cannot stop me."}, {"author_name": "AaronSieb", "gravatar_hash": "72f8e04bbd904ab1e869b3422802dbf3", "author_url": null, "date": "Jul 23, 2009", "message": "A few thoughts:\nAsking a poster to post something on fr.stackoverflow.com is ultimately no better or worse than asking them to post it on any other non-Stackoverflow site: the communities will still split along language lines with posters on fr.stackoverflow.com being unlikely to post on en.stackoverflow.com (and vice versa).\n\nModerating a multilingual site is a non-trivial problem.  If Jeff does not speak French, he would both have difficulty moderating French questions and have difficulty judging the merits of potential French moderators.\n\nRelying on tags (or anything in the user's control, really) to establish language is unlikely to work consistently.  How are Spanish language speakers supposed to know that they need to tag their questions \"spanish\" (or espanol)?\n\nWhat is the cost of implementing automatic translation?  Is Google's translation engine open to other companies?  How difficult is it to interface with?\n\nAnd, if automatic translation is up to the task, why can't the asker use their own tools to translate their question, and then translate the answers they receive?"}, {"author_name": "Daniel Sobral", "gravatar_hash": "6d43da5df0e52fc31c55e6a227bb23f4", "author_url": "http://dcsobral.blogspot.com", "date": "Jul 23, 2009", "message": "I think the point about splitting communities is relevant. While I'd perfectly capable of using both English and (hypothetically) Portuguese Stack Overflow, I would be unlikely to check both, at least with the same frequency. I'd be willing to see questions in both languages, though.\n\nI think the problems of mixing content are being overrated. Let's see...\n\n1) Browsers inform accepted languages. These can be taken as default, and overridden in the profile. So the initial experience can be optimal with no effort on the user.\n\n2) Automatic recognition of language can be done the same way we do automatic recognition of spam, Bayesian filters. Word does it, by the way.\n\n3) Language-specific URLs can then be used to _force_ a language regardless of profile settings.\n\nThat is my suggestion. I'll leave a question here, though. What is the percentage of good answers/nice answers from users coming from non-English speaking countries? I ask this, because these are the answers you are likely to lose if you send the native speakers of these countries to other sites."}, {"author_name": "Nick Pierpoint", "gravatar_hash": "6a6e7d806c4445cb14a33e25cdb1163f", "author_url": null, "date": "Jul 24, 2009", "message": "Following up on my last comment (rant) I think AaronSieb makes a good point. Ultimately, SO is a moderated site - there would need to be sufficient moderators for each accepted language."}, {"author_name": "John Saunders", "gravatar_hash": "953e26e80351a67962a6e5840fc1fc14", "author_url": "http://johnwsaundersiii.spaces.live.com/", "date": "Jul 24, 2009", "message": "@Nick: I think of it the other way around. If someone posts in a language for which nobody will translate, and if the English version is incomprehensible, then the question will be closed and eventually deleted.\n\nThe definition of \"accepted language\" would be \"language that gets translated before the message is closed\"."}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Jul 24, 2009", "message": "There is no need for separate domains!\n\nThere is no need for automatic translation!\n\nThere is no even need to see question in languages we don't understand!\n\n\nThink about this. What do you do currently to avoid seeing questions in mmmhh let's say.... \"subjective\".\n\n\nYou may TODAY without any modification add the tag \"subjective\" to the ignore tag list and in the preferences select \"hide ignored tags\".\n\n\nThat's it, you won't see any subjective question anymore.  \n\nThe same approach may be used for natural languages. \n\nIf I ask something in Spanish, I may add the tag \"Spanish\" to my favorites.  If you don't know a single word of Spanish, you just add \"Spanish\" to your ignored tags. Voila!!!\n\n\nThere are two problems though!\n\n\n\n1. I definitely don't want to pass all day adding languages to my ignored tabs.\n\n2. There is only 5 possible tags to be used. I don't want to use one of them for the language ( nor type the language in which my question is being written each time )\n\n\nThe solution would be to add more power to the tags:\n\n1. Everyone have as default \"English\" as preferred language. \n\n2. Everyone have \"ignore all other\" by default.\n\n3. This spacial tag don't count toward the regular tag count. \n\n4. Finally a if you know more languages ( in my case English + Spanish, for others may be Welsh + German only etc )  You may add more languages in the preferences and when asking a question if you have more that one language in your preferences a drop down with the default ( again ENGLISH for everyone ) would be preselected.\n\n\nI'm not saying this is easy, nor trivial, I know it would take some time. \n\nI have of course added this proposition to meta and it has an official response: status-declined. \n\n\nI agree with Jeff of course: \"...Community should form around the gravity of native human languages...\"  \n\nEach one's native language community can be created INSIDE the platform. I think a distinction here is needed between StackOverflow the community and StackOverflow the platform.\n\n\nIt is possible to create own communities inside the platform and still be insulated from the rest. Gee, I definitely don't want to see japanese questions in my frontpage, because I don't know even what the script name is ( is it Kanji right? ) \n\n But I think also knowledge  goes beyond  a single natural language barrier and not knowing English should not prevent non English speakers to get help  ( read it like this I DON'T WANT to COME BACK TO Yahoo! Answers to help beginners only because of the language )  \n\nOtherwise this would be C# or Java only community right? But is not ( actually  R guys are being welcome to migrate to SO, but non english speakers as asked to leave ) \n\n\nHere's the link for in meta: http://meta.stackoverflow.com/questions/3774/add-meta-tag-to-support-internationalization\n\n\nRegards Oscar Reyes"}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": null, "date": "Jul 29, 2009", "message": "Another agreement with the policy.  As much as I'd like to see non-english native speakers accommodated I'd much rather SO have more questions/answers even if they start off crummy.\n\nThen again, I'm chasing the \"Strunk &amp; White\" badge, so yeah..."}]}