{"response": [{"author_name": "Henrik Paul", "gravatar_hash": "33f7b52ddceb5ed2ffb12400a4cbceb8", "author_url": null, "date": "Jul 22, 2009", "message": "The kanban-reference was left from the shownotes, it seems. Here's a good comic that made me understand the thing: http://blog.crisp.se/henrikkniberg/2009/06/26/1246053060000.html"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 23, 2009", "message": "Excellent Henrik, thank you -- I totally forgot about that! Great link too."}, {"author_name": "Richard Gadsden", "gravatar_hash": "3c291e7858e6b79e06889fa7dbf16d31", "author_url": null, "date": "Jul 23, 2009", "message": "You mentioned the problem with building plugins that then get pulled into the main product.\n\nJoel identified one possible plugin marketing position where you don't get steamrollered - with verticals, but I can think of several more:\n\n1. Plugin that connects to a commercial product.  IE company 1 makes a product, company 2 makes a product and also makes a plugin for company 1's product to connect them together.  If your product is valuable in itself as a standalone, then the plugin is added value - and if it gets integrated into the platform, then that's just free marketing for your real product.  Balsamiq plugin for FogBugz is an example - Balsamiq's business is selling Balsamiq, not the plugin, and that's still true even if they charge for the plugin.\n\n2. Plugins that break the business model of the core product.  I'm thinking of AdBlockPlus here - FireFox don't want to put it in the main product as it would wipe out the ads on the integrated Google search, which is their main income source.\n\n3. Plugins that intrinsically need to cost money.  If the plugin gives access to subscription data, then it won't get pulled into the main product unless the developer can find a free way of getting the same data.  There are some stock tickers that come to mind.\n\n4. Plugins that make the product UI more complex.  My best example here is NoScript.  I use it and like it, but I know I'm always adding new sites to my whitelist.  I've dealt with a lot of users who are not prepared to put up with that - it's an extra UI step that they don't want to have to deal with."}, {"author_name": "John", "gravatar_hash": "0fc637a07270d4dfbf6958a281a5305e", "author_url": null, "date": "Jul 23, 2009", "message": "Jeff, I find it interesting you like automatic updates so much but also hate the software that comes with things like digital cameras.  \n\nWhat about companies that push crapware out through their auto-update system?  \n\nWhat about new features that get pushed out and cause problems and confusion?\n\nI have to agree with Joel on this one, I don't like auto-updates.  In general whatever is fixed is something that doesn't affect me and just causes grief.\n\nJohn"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Jul 23, 2009", "message": "Regarding Plugins being implemented into the product. Just as an example. Blizzard does this regularly with World of Warcraft.\n\nBut they do it a little differently. They don't take the addon and add it in but build it from scratch in their way.\n\nJust wanted to add since it's a good example and it was missing."}, {"author_name": "Neil Trodden", "gravatar_hash": "10701e62fff85c082ba4cb2a08258479", "author_url": null, "date": "Jul 23, 2009", "message": "Don't forget that sometimes just having an API is enough without people planning to release a plugin. We may wish to wire our software in to fogbugz but accept it is no use to anyone else.\n\nChances of FC steam-rolling us? Close to zero. Amount we would care if they *did* somehow make it redundant? Closer to zero - we'd be very happy (and surprised)"}, {"author_name": "Jonathan Sampson", "gravatar_hash": "a84a8714fd33f6676743f9734a824feb", "author_url": "http://www.sampsonresume.com", "date": "Jul 23, 2009", "message": "After hearing the great praise for websites having a developed API, I'm curious when SO will take that path. I understand it's a tedious process, planning and developing a great API, but what (if any) talk has taken place around it?\n\nI can't help imagining all of the amazing tools that would flourish if the core of SO were opened up a bit.\n\nThanks guys, and keep up the great work.\n\nJonathan Sampson"}, {"author_name": "Matt", "gravatar_hash": "03cd042b82ac85b2c5fe0757a94e0413", "author_url": null, "date": "Jul 23, 2009", "message": "Jeff...I can't believe that in your question of the week, you have not chosen an accepted answer...shame on you!  :)"}, {"author_name": "JD Long", "gravatar_hash": "d2e5bf1cdb782a02ef30e41563702541", "author_url": "http://cerebralmastication.com", "date": "Jul 23, 2009", "message": "Hey Jeff and Joel, thanks for answering my question about R and StackOverflow. We held the \"flash mob\" last night and had a good response. This greatly raised awareness of StackOverflow in the R community and possibly vice versa! Thanks for mentioning R on your podcast and to Jeff for blogging about the OSCON meet up. \n\nNon of the negative predictions made in Jeff's blog comments came to fruition. The questions were reasonable and the S.O. community recognized that. \n\n-JD"}, {"author_name": "Alex Rozanski", "gravatar_hash": "fb64cbaeb7b19566f9466ed812620740", "author_url": "http://www.perspx.com", "date": "Jul 23, 2009", "message": "In response to Joel's comment about software being updated when an application first runs as opposed to when it's running/idle, this is something which is encouraged, certainly for the Mac platform, through the Apple Human Interface Guidelines: http://developer.apple.com/documentation/UserExperience/Conceptual/AppleHIGuidelines/XHIGInstallationsUpdates/XHIGInstallationsUpdates.html#//apple_ref/doc/uid/TP40002722-SW7\n\nIt basically says that you should only provide updates (and I'm not necessarily saying that this is right) at launch time; to quote: \"The goal of a software update mechanism is to be convenient, yet unobtrusive. To achieve this, it’s essential that your application perform all software update procedures at launch time only.\"\n\nNot sure whether this was what Mozilla were thinking of when providing updates this way for Firefox, but certainly with applications for the Mac this seems to be encouraged."}, {"author_name": "Overflowing Stacks", "gravatar_hash": "b5b2064e1990869b96b45dbcb51d69fc", "author_url": null, "date": "Jul 23, 2009", "message": "I couldn't disagree more with the idea that all software should just be silently updated without any warning.  Using Firefox as an example (since it was mentioned many times in the podcast): new releases of Firefox occasionally break a significant percentage of existing plugins until the plugins are updated to the new version.   Do you really want Firefox updating you to such a version without any kind of warning?   I don't.  I'd much rather wait the update out a few months and only make the move when the plugins *I* use have been updated (and keep in mind that the set of plugins that are must haves is different for every person, so you can't even fallback on a solution like pushing the Firefox update once plugins X, Y and Z have been updated to the new version.\n\nThis isn't unique to Firefox, of course, and there are many reasons (other than plugin problems) why updating to the newest version doesn't always make sense.  The newest version could be incredibly buggy, the developers could have made UI changes for the worse, etc, etc.\n\nAlso, I'm completely fed up with every company thinking they absolutely need to run a persistent update manager daemon in my system tray.  No matter how well behaved they make their updater, the model just doesn't scale, once I've got 5 different updaters running there is going to be just that much more chance of them causing system performance issues, or UI issues, etc.   Unless the software vendors can agree to one unified updater service they really need to fuck off with these things, they reach a point where they are almost as bad as malware just because you're running so many of them.\n\nLastly, the podcast really needs more guests.  Episodes with guests (like last week) are fantastic, episodes without guests, not so much.  You guys are falling into the trap that Joel used to avoid by publishing longer blog posts less frequently.  I can pretty much predict what each of you is going to say through the entire podcast once I know what the topic of the podcast is."}, {"author_name": "Overflowing Stacks", "gravatar_hash": "b5b2064e1990869b96b45dbcb51d69fc", "author_url": null, "date": "Jul 23, 2009", "message": "@Alex,\n\nApple guidelines or not, I think it makes much more sense to do updates at shutdown time.   This is what Windows Update does by default these days and I *much* prefer it.   In the case of Windows updates, it will download the available updates but not install them (unless you manually tell it to install them sooner) until you shut the system down, as part of the shutdown process.  This is awesome because I can just tell the system to shut down, walk away, and the updates are being installed when I don't care that the updates are impacting my ability to use the system because I've already walked away from it.\n\nI believe the same system applied to applications (having them update in the background, after I close them) would also be much preferable to them interrupting me as soon as I open them.   I totally agree with Joel on this, update manager dialogs that pop up as soon as you open an app are totally frustrating because you are almost always opening the app up with a purpose to get something done *now*, and even having to think about the update is just a context switch that is annoying and unnecessary."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jul 23, 2009", "message": "I think Apple's concept was correct but their wording was poor. An app shouldn't interrupt you for updates while it is being used or check everytime the mouse stops moving - but checking on shutdown makes a lot more sense than startup. This is also obviously an easier point to actually install new code when the app is closed."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jul 23, 2009", "message": "Plugins really only make sense for verticals.\nSo a visual studio app plugin that added support for your own in-house language (like anyone would ever do that!) wouldn't be subsumed because it is no advantage to MSFT to create a wasabi.net clone but having the API in place means wasabi users buy VS instead of using Eclipse.\n\nThis model is very common in CAD and modeling/rendering - platforms compete on who has the richest add-in infrastructure."}, {"author_name": "Alex Rozanski", "gravatar_hash": "fb64cbaeb7b19566f9466ed812620740", "author_url": "http://www.perspx.com", "date": "Jul 23, 2009", "message": "@Overflowing Stacks\n\nI know, and I agree with Joel here too - it makes more sense; I was just saying that that was perhaps where the idea came from. As I said I wasn't necessarily saying it's the right way to go about doing it."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jul 23, 2009", "message": "@Overflowing Stacks\nOn the other hand what about the updater asking you questions that you have no idea about the answer to?\nDo you want to update system library blah.3141 to blah.31415 ?\nWhat is the point of asking this, I have no way of knowing - if Microsoft/Sun/Ubuntu etc don't know if I should upgrade how am I supposed to?\n\nFor apps what about auto-updating point/build releases but asking about major version?"}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Jul 23, 2009", "message": "I have a few comments: \n\n#- I disagree with Joel when he says that a question should not include all the troubleshooting steps I took. If I don't do this, I am going to get all kinds of answers which would treat me like a newbie. I want answers that take me forward from the point where I am out of ideas. Because SO suffers from questions getting stale quickly, I need to take advantage of the \"smart productive\" answers which hopefully will get posted the day my question is posted. That's why I have to mention \"I tried this and this and that.. no what?\". \n\nJoel wants a checklist in the answers. This is where we have a conflict of interest. I want to solve my problem NOW. Joel wants his site to be a reference, a repository of information, in the web where it doesn't matter to him if it takes days to build.\n\n#- Jeff: why do you hate the meta site? It's just another term for \"discussion forum\" which can include support forum. Respectful companies need to have a listening ear to customer feedback.\n\n#- Applying updates either at the open or a close of software depends on the software. Some software never close like running services. My Outlook is always running. It only closes when I reboot. Best thing is give the user an option when to apply the update. Firefox did an update once without asking me. I didn't like that."}, {"author_name": "Mark", "gravatar_hash": "f13af12d1c3ed9cc7d39381305df90c0", "author_url": null, "date": "Jul 23, 2009", "message": "I can't believe you didn't mention Google Chrome while discussing updates! The Google Chrome client silently updates itself all the time and you never know. They always have high adoption rates of their latest builds and low retention rates for their old builds."}, {"author_name": "huh", "gravatar_hash": "164689612048d6cc7689e6b4f2a3b35c", "author_url": null, "date": "Jul 23, 2009", "message": "Just to clarify, Apple does not ship automatic updates \"everyday or two\", sometimes once a week, once a month. Not \"everyday or two\" ;)"}, {"author_name": "UpAndDownVotes", "gravatar_hash": "90390181c03b8278a216a4f098bd9682", "author_url": null, "date": "Jul 23, 2009", "message": "Regarding the \"lame questions being voted up too much\" issue... one solution is let users with large amounts of reputation down-vote for free.  This way users who prove themselves over time get a little tiny bit closer to moderator status."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jul 24, 2009", "message": "Voting for questions makes no sense.\nVoting for answers is intended to show the questioner which answer the community thinks is correct/useful.\n\nBut why should my erudite question about C++ iterators be worth more than your newbie question about asp.net?\n\nHaving starred questions, or simply marking those with most views is useful - but generally for non-programming related questions that are really more like discussions."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Jul 24, 2009", "message": "I find the question that Sergei asked to be rather silly.  He is pretty much stated (in the form of a question nonetheless) \"I think I am a great programmer, everyone should do as I say\".  \n\nI interned at a place that had a guy such as Sergei (or how he comes off in his \"question\").  There is no doubt that they know their stuff, but they definately lack in the whole \"relating-to-people\" thing.\n\nI wonder if this guy knows he even has a lawn that he wants me to get off of."}, {"author_name": "Kevin Dente", "gravatar_hash": "23c1e2063688620b75b248e08c0d5c24", "author_url": "http://weblogs.asp.net/kdente", "date": "Jul 24, 2009", "message": "FYI, the Team Database Edition used to be a separately purchased product (included in the uber-expensive Team Suite edition). But they now include it with any Team system version (e.g. Team Developer version, which is much more common and cheaper than Team Suite). So if Joel &amp; company have Team Developer, they can now install the DB Edition for free. OTOH, if they only have Visual Studio Professional, then they can't (in which case ignore this entire comment ;)"}, {"author_name": "Jon Hjelle", "gravatar_hash": "bd1523db7afb9084cc4ad81bc48a9d6e", "author_url": "http://calftrail.com", "date": "Jul 24, 2009", "message": "By the way, the iPhone app for FogBugz we release this week is called \"Inbugz\", a play with Inbox and FogBugz. More information can be found here: http://calftrail.com/inbugz.html"}, {"author_name": "Jeremy P.", "gravatar_hash": "ea0cba564f394857d49764730da96d83", "author_url": null, "date": "Jul 24, 2009", "message": "Anyone know of an app like SQL Compare for MySql?!\n\nThanks"}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Jul 24, 2009", "message": "Google Chrome  update is nice. \n\nOf course the update must be small. Here's how they do it:\n\nhttp://dev.chromium.org/developers/design-documents/software-updates-courgette\n\n\nAdding: \"I already check this, that etc.\" do helps too to the future guy in problems, because he may start checking what you added in your \"I already check...\" list. \n\nOtherwise it may not be a \"Do my homework\" question but a \"Read my mind..\" question."}, {"author_name": "Sponsz", "gravatar_hash": "cae93d12a6a39d5dc68eadf4cf45e526", "author_url": null, "date": "Jul 25, 2009", "message": "@mgb Your erudite question about C++ iterators may be better than someone else's badly written C++ question that may or may not be about iterators.  That newbie asp.net question may not be intrinsically such a good question but may have a much wider appeal.  Voting for questions shows which the community thinks is useful.\n\nAs an example of this I'm increasingly finding SO questions turning up in my Google searches and if it is helpful I will give the question an upvote - the questioner deserves the rep bonus as far as I am concerned."}, {"author_name": "raveman", "gravatar_hash": "476b5bd46752f497c49d42ce75e5d972", "author_url": null, "date": "Jul 27, 2009", "message": "I really enjoyed last joey's comment. the sad true that it doesnt matter in our job how good we are and how bad some programmers are.\n\nmy friend that works not in it told me lately that she did job that took previous employee week in one day, but she told the boss that it took 3 days, because the more you do the more you will have to do. \n\ni for example work very hard, because i like to, but i think base on hard work i only make a little more than bad co-worker. however i think i earn a lot more, because i like to switch jobs(its mostly CW wars, they wanted me to know everything, so i will - that will show them).\n\nHowever I see nothing bad at being just average at your job and i think its only because job interviews i got the need to always get better, so i can answer all the questions and get every job."}, {"author_name": "russau", "gravatar_hash": "fb8f14461d037d601087c32f9fa9fea5", "author_url": "http://tinisles.blogspot.com/", "date": "Jul 27, 2009", "message": "Re: Sergei's question I have two points on this.  What do you mean by \"optimal\"?  The 2nd biggest crime a developer can commit is to write code that is unmaintainable (1st is code that doesn't work).  These are both mistakes that are fairly obvious to point out to management where this is costing the company money.\n\nDoes management consider you to be in a senior position?  If so then they WANT you to get things running efficiently.  If not, pointing out solutions to get the company running efficient will help you get to the senior position quicker."}, {"author_name": "Sergey", "gravatar_hash": "eccdcfacff0a3aa150b47431fedb2006", "author_url": "http://sergeys-tech.blogspot.com", "date": "Jul 28, 2009", "message": "You see, in Oracle world it's pretty simple to measure. For example, some SELECT expressions may run for hours. But often it is possible to make them execute in minutes. That is called \"optimization\"."}, {"author_name": "Ryan", "gravatar_hash": "71509c133412b51803153871a8de560b", "author_url": null, "date": "Jul 29, 2009", "message": "Regards the discussion over database schemas / documentation.\n\nWe use an really neat tool called BI Documenter [http://www.bidocumenter.com/] to document our databases.  \n\nIt generates chm or html documentation of the database (table, views, procedures, functions etc..), including diagrams if you want them.\n\nOnly downside is that it's SQL Server specific."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jul 29, 2009", "message": "@Sponsz \nMy point was - what makes one question better than another, and so worth voting for?\n\nThat it was written in perfect prose?\n\nThat is asks a question nobody else has asked?\n\nThat is asks a question that you are also interested in?\n\nAs far as I can see the only value in voting up a question is to bump an existing unanswered question that you are interested in getting an answer to."}, {"author_name": "Jeremy French", "gravatar_hash": "ce06772afa81dcbd4dbdd8273234152b", "author_url": "http://www.jeremyfrench.co.uk", "date": "Jul 31, 2009", "message": "Re: Sergei’s question\n\nThe move jobs answer is not always practical. I have been reading a great book lately about introducing new ideas in the workplace. It is called \"Fearless Change\" and can be found on reputable online bookstores. I would recommend it for anyone who finds themselves in such a situation."}, {"author_name": "Ben Combee", "gravatar_hash": "d58ac41c5962f5caca60793591a589d2", "author_url": null, "date": "Aug 04, 2009", "message": "Mozilla is paying attention to the grips about the update experience.  There's a big thread about how to design this well over at http://groups.google.com/group/mozilla.dev.apps.firefox/browse_thread/thread/f6e197f572d8ac6e/63e5d97fcce57883, which has opened a few bugs.  We're currently working on FF 3.6 and FF.next, and I think it's likely that this will be a priority for front-end development along with improving performance and modernizing the look of the browser."}, {"author_name": "Jin", "gravatar_hash": "70ad2c2830eb9a7753bd6312f3811e3e", "author_url": "http://8164.org", "date": "Feb 27, 2012", "message": "good times"}]}