{"response": [{"author_name": "Alistair", "gravatar_hash": "438c91736f20d0821c7a358ee8b00790", "author_url": "http://stackoverflow.com/users/379/geocoin", "date": "Jul 02, 2009", "message": "As far as what code is portable goes, unless you actually invent and patent a new algorithm or methodology, then anything goes as long as it's not wholesale taking one product codebase to another company. v. unlikely you alone worked on a particular project and therefore would be taking other people's code with you anyway if you did that."}, {"author_name": "Damian Hickey", "gravatar_hash": "e936bf226b0921257c47cfd7647e4578", "author_url": null, "date": "Jul 02, 2009", "message": "Regarding the fork, no I can't see version control working for you. It is a higher level design issue. I reckon you will have to refactor out a \"base\" product and design in appropriate extensibility points to allow both editions of your product to build on top of.\n\nWelcome to becoming a 'platform' :)"}, {"author_name": "Malach", "gravatar_hash": "09eb3720b1c9d33bedd35a3bd47ec1c9", "author_url": "http://www.rickenba.ch", "date": "Jul 02, 2009", "message": "Here in Switzerland we always have to sign a contract that all work achievements belong to the employer. Usually infringement is bound to a fine.\nThere is one problem though: as this contract is part of your work contract, it should be finished whenever your work contract is finished. But courts do tend to rule in favor of the employer."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": "http://softhardsoft.com", "date": "Jul 02, 2009", "message": "@Jeff: you say you think the caller is ok to take the reference code with him. Then you say that a good way to tell if something like that is a good idea, then you should explain it to a programmer -- if they object then it's likely not a good idea. Did they not just do that exactly to the 2 of you? And did Joel not object?"}, {"author_name": "Richard Campbell", "gravatar_hash": "b7fd1496cebed0a3c286549e52d49cfa", "author_url": null, "date": "Jul 02, 2009", "message": "Jeff,\n\nYou are dangerously wrong in the work for hire statement above.\n\nA \"work made for hire\", as defined in 17 U.S.C. 101, is *either* of:\n\n\"(1) a work prepared by an employee within the scope of his or her employment; or\n\n(2) a work specially ordered or commissioned for use as a contribution to a collective work, as a part of a motion picture or other audiovisual work, as a translation, as a supplementary work, as a compilation, as an instructional text, as a test, as answer material for a test, or as an atlas, if the parties expressly agree in a written instrument signed by them that the work shall be considered a work made for hire. For the purpose of the foregoing sentence, a “supplementary work” is a work prepared for publication as a secondary adjunct to a work by another author for the purpose of introducing, concluding, illustrating, explaining, revising, commenting upon, or assisting in the use of the other work, such as forewords, afterwords, pictorial illustrations, maps, charts, tables, editorial notes, musical arrangements, answer material for tests, bibliographies, appendixes, and indexes, and an “instructional text” is a literary, pictorial, or graphic work prepared for publication and with the purpose of use in systematic instructional activities.\"\nhttp://www.copyright.gov/title17/92chap1.html#101\n\nMost programmers would be writing code inside the scope of their employment, and thus the copyright would be vested in their employer.\n\nDISCLAIMER:  I am not your attorney (neither Jeff's, nor anyone reading this); the above is for general education use only."}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Jul 02, 2009", "message": "Jeff you are so naive about business and open source. Listen to Joel before you make a major mistake.\nTheres nothing wrong with making money."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Jul 02, 2009", "message": "Can you please link to information about the thedailywtf logo contest?  I'm curious."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 02, 2009", "message": "@dinah Well, I meant more like another peer, someone outside the topic who can be disinterested / objective. I guess I was thinking more along the \"ask my wife\" axis."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 02, 2009", "message": "\"Theres nothing wrong with making money.\"\n\nDo you want to make money, or do you want to live forever? I know which one I'd pick."}, {"author_name": "Jon Smock", "gravatar_hash": "7cf5af9e0f94976adae00ce7dfdd467b", "author_url": "http://jonsmock.com", "date": "Jul 02, 2009", "message": "Even if a clone came out, don't you also have the advantage of taste?  You guys have the vision that built this and it's going in a particular direction.  Any clone can only gain an advantage on you in this respect if they actually improve the codebase.  People will always pay you guys, because they will guarantee themselves all the newest features as soon as they hit the market."}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Jul 02, 2009", "message": "You know I figured that was what you were thinking. You really do have an obsession with being this legendary voice in the programming world."}, {"author_name": "Bill Z", "gravatar_hash": "d3023466b891cbcc3f9d565f4f48f18a", "author_url": null, "date": "Jul 02, 2009", "message": "Living forever with no money would be pretty terrible, in my view, but I'm just a person who doesn't want to panhandle until the end of the world."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Jul 02, 2009", "message": "Can Fogcreek just become an OpenID provider?  And implement it in its own style?"}, {"author_name": "Bernard", "gravatar_hash": "af29baa43e6e6f77180e631cea686847", "author_url": null, "date": "Jul 02, 2009", "message": "@Donny: Why do you care anyway? What is it to you what Jeff does or does not want?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 02, 2009", "message": "My point is that making money (at least making decent money, not obscene amounts of it) is not really the hard part, and therefore not the really *interesting* part.\n\nI'm a fan of money, believe me, but I'm a bigger fan of changing the world for the better in some small way.\n\nAnd open-source, it seems to me, is *CLEARLY* the best way to accomplish the latter. Do you disagree?"}, {"author_name": "Kieran Hall", "gravatar_hash": "e77642418a5cdc3213092c94000ec836", "author_url": "http://www.kieranhall.co.uk", "date": "Jul 02, 2009", "message": "@Jeff what was the new LCD display that mentioned?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 02, 2009", "message": "@kieran\n\nhttps://twitter.com/codinghorror/status/2302998789"}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Jul 02, 2009", "message": "@Bernard\nI just don't want Jeff to miss an opportunity that can really help him and his family.\n\nOpen source is definitely a good way to give back to the community. But if your trying to build some type of business around your work. You need to be careful about balancing how much you give back and how much makes business sense. Take Google for an example. They have a lot of great open source projects out there. But you don't see them open sourcing there code to Google Docs or there Search engine because its part of there core business. \n\nI may of come across to strong with my \"naive\" comment. I just got off from listening to the podcast so I was type happy. :-)\n\nI just think you need to look at the business side of things. \n\nMy 2 cents."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Jul 02, 2009", "message": "Interesting.  I've been using 1680×1050 pixel monitors which split to 840 pixel wide halves.  I agree that web browsing (especially) is somewhat painful at that width.  But, these 2048×1152 monitors would be perfect!"}, {"author_name": "Kieran Hall", "gravatar_hash": "e77642418a5cdc3213092c94000ec836", "author_url": "http://www.kieranhall.co.uk", "date": "Jul 02, 2009", "message": "@Zack @Jeff I'm setting my 1680×1050 monitor as a second screen and running it in portrait mode so I can have several test browsers open at 1024×768 (will have to use the web developer tool bar to resize, but is a fair compromise, I think)."}, {"author_name": "Brent Ozar", "gravatar_hash": "77f776c2eaf0cc691e8a0880bb8a191f", "author_url": "http://www.brentozar.com", "date": "Jul 02, 2009", "message": "I bet you're going to end up forking the code too.  I went through this once with two groups of coders on the same code base.  One group would start working on a release, and they'd need to futz with the code base for a few weeks straight.  Meanwhile, the other guys would make several small changes to the same code base to fix bugs or add features.  Inevitably, we'd end up with differences that couldn't be reconciled without phone calls and coordination, and that bred some discontent between the two teams.  You're screwed the instant one team starts using the excuse, \"Well, we have to wait for those oooother guys before we can go live....\""}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Jul 02, 2009", "message": "Kieran, I'm not sure what it is but for some reason these monitors don't look good to me when rotated 90 degrees.  The picture looks to shiny.  They've got a poor viewing angle or something at that orientation."}, {"author_name": "Jim McKeeth", "gravatar_hash": "e5ca3abec062f8174570a4b1d1c840d8", "author_url": "http://www.Delphi.org/", "date": "Jul 02, 2009", "message": "The reason WordPress.com and MovableType are successful while there are open source alternatives with commodity hosting is because the official hosting has additional exclusive services and management.  \n\nJust as you mentioned toward the end of the podcast about forking, the hosted / managed version will be different.  Even if it means actually removing the IFDEF'ed code specific for the managed version.  \n\nAlso, specifically with WordPress is they create the new features for WordPress.com first, and then release them open source later."}, {"author_name": "Nathan Fellman", "gravatar_hash": "898c2217a5457bdef0a0ed58283010dc", "author_url": null, "date": "Jul 02, 2009", "message": "Aren't you guys afraid that StackExchange might be linked in some minds to another Exchange site?  One with a hyphen in it?"}, {"author_name": "Ryan", "gravatar_hash": "cbbc31b73a7bdea8587d563701ae5d16", "author_url": "http://lucydebate.blogspot.com", "date": "Jul 02, 2009", "message": "Jeff, I like the Amanda Palmer link (and I'm a fan of her music), but the description of making $19,000 \"On Twitter\" is silly. She made $19,000 by doing years of hard work recording, touring, and building up a loyal fan base. \n\nYour description of the article was legit, but unfortunately this story will be re-broadcast and re-hashed around the internet as \"how to make money on twitter\", which misses the point entirely."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Jul 02, 2009", "message": "Jeff says Windows is dead! It's dead when nobody uses it anymore and when people like him stop using Microsoft's stack which includes SQL Server in creating software and good sites.\n\nWhen will SO move to Linux and MySQL? Probably never.\n\nAs long as an operation system or software is easier to use, friendlier, and just works, people don't mind paying for it, regardless if it's open source. Being open source is secondary. \n\nWhy don't people demand the software that runs an airplane, car, GPS units and millions of devices be open sourced? Why pick on Windows?"}, {"author_name": "docgnome", "gravatar_hash": "ea163fde37f23c4a4eb6417060aa8e5f", "author_url": "http://docgno.me", "date": "Jul 02, 2009", "message": "@Abdu I believe that Jeff meant that it is evolutionarily dead. Similar to how Paul Graham says that Java is dead. http://www.paulgraham.com/hundred.html\nAlso, Free as in Freedom and Free as in Beer are two totally separate questions. Red Hat Enterprise Edition, for example, is Free as in Freedom but not Free as in Beer.\n\n@Jeff I couldn't agree with you more about FOSS, but then I find myself agreeing more and more with rms."}, {"author_name": "Steve", "gravatar_hash": "d607f119e8d6ce52f35aa24424a9c5a9", "author_url": null, "date": "Jul 02, 2009", "message": "I agree with Joel on the two big discussions.\n\n1. Going 'open source' would kill off Stack Exchange and don't think you'll benefit as much by releasing the code.\n\n2. Don't fork. Use Dependency Injection (not 'IF' statements http://www.antiifcampaign.com/ ;) That way you can benefit from useful enhancments from Joel's team while hiding away the parts you aren't interested in.\n\nSorry not adding much with this post, just reinforcing some points :)"}, {"author_name": "docgnome", "gravatar_hash": "ea163fde37f23c4a4eb6417060aa8e5f", "author_url": "http://docgno.me", "date": "Jul 02, 2009", "message": "@Joel As someone who works on a pair of related projects working from the same codebase, where we use ifdef (more or less) to define bits that are different, I can say from experiance, it's a headache. You can introduce bugs that you'll not see in one app, but blow apart another. You always have to be thinking about two apps and trying to hold them _both_ in your head instead of the strugle of just one."}, {"author_name": "Bartosz", "gravatar_hash": "49cb47842fdbd426134581fa77830688", "author_url": "http://bradaczynski.wordpress.com", "date": "Jul 03, 2009", "message": "Jeff, the link to the transcript is incorrect (it's a link to episode 59 transcript)."}, {"author_name": "Bartosz", "gravatar_hash": "49cb47842fdbd426134581fa77830688", "author_url": "http://bradaczynski.wordpress.com", "date": "Jul 03, 2009", "message": "Also, could anyone please post the name of the headphones with noise cancellation that Joel was talking about?"}, {"author_name": "docgnome", "gravatar_hash": "ea163fde37f23c4a4eb6417060aa8e5f", "author_url": "http://docgno.me", "date": "Jul 03, 2009", "message": "@Bartosz I think he was talking about one of these, but not sure. http://www.bose.com/controller?url=/shop_online/headphones/noise_cancelling_headphones/index.jsp"}, {"author_name": "Bobby Jack", "gravatar_hash": "9b5c260dc8b7374186b3bebc28b08ce7", "author_url": "http://www.fiveminuteargument.com", "date": "Jul 03, 2009", "message": "'I don’t see a conflict between these two audiences; one has infinite time and no money, and the other wants a turnkey, \"it just works\" solution for a reasonable price.'\n\nWhat's with the continual bashing of OSS? Plenty of proprietary applications don't \"just work\", whilst plenty of OSS does."}, {"author_name": "Paul Morriss", "gravatar_hash": "8691b744cb9151e4a173a23eb44eab3b", "author_url": "http://manypies.blogspot.com", "date": "Jul 03, 2009", "message": "I clicked through to the stackexchange site and lo and behold, what should I find, but a pricing chart for different numbers of things. Didn't you write a blog post about that Jeff? Do 9 million more pageviews cost $870 more a month to serve up?"}, {"author_name": "jcollum", "gravatar_hash": "350f30695a2ab75b99d3fce947e856b9", "author_url": null, "date": "Jul 03, 2009", "message": "It's funny that you mentioned plentyoffish twice now. I used that site for about 6 weeks and I thought it was really awful in comparison to other free dating sites. PoF seems like a site that hasn't been updated in 5 years. I mean really really clunky and rough on the eyes. He needs to find a real designer."}, {"author_name": "Joshua Foster", "gravatar_hash": "2c21bed614c58c9e1c48fe272e79efd2", "author_url": null, "date": "Jul 04, 2009", "message": "The scenario Joel mentioned is forking. It will most likely be the best environment in the long run. Remember, shorter codebases are easier to maintain - Steve Yegge had a good blog on it. Controlling it by patches at entry point also provide a good entry point.\n\nDependency injection is a coding approach. Sometimes, it doesn't make sense when the level of abstractions complicate the codebase out of control. All abstractions come with a price."}, {"author_name": "juul", "gravatar_hash": "efc2e2841d649f1cadbb4d75b43f125f", "author_url": null, "date": "Jul 05, 2009", "message": "About open-source/giving away for free/living forever.\n\n1. B Gates/S Jobbs/Google will live forever and they are not based on OS/Free.\n\n2. I tend to think that software developers devaluate their profession by giving stuff away for free.\n\n3. I think some (commercial) companies make money based on the hard work done by programmers for free.\n\nThink about Mac OS and IBM \"supporting\" open source etc. They sell stuff that isn't even built by them. Why do you let hosting companies make money based on your hard work on SO ?\n\n4. Open-sourcing doesn't mean that the code will live forever. An example.. PHPNUKE ? Projects die. Open-source or not."}, {"author_name": "Mariusz", "gravatar_hash": "49187344be3e46c0549bf7f507824b25", "author_url": "http://www.aristo-samar.com", "date": "Jul 05, 2009", "message": "Hi Guys,\n\n43rd minute of the podcast solved a small problem I had with my employer.\n\nA part of my work is programming, but just a part. Rest is general IT and that what my contract is about.\nThere is nothing about programming at all.\n\nI have developed quite huge system for my employer within last two years and I was wondering who owns the rights to this software in case I want to leave or get fired.\n\nI haven't spoken with any lawyer so far but thought that rather the company owns everything I have created during \"working hours\".\n\nIf it is not true it makes me very happy...\n\nI wouldn't mind if someone could confirm it again here...\nI live and work in UK\n\nMariusz\n\nps. GOOD job with, keep it up guys..."}, {"author_name": "Daniel", "gravatar_hash": "1c5255f8496fcade0244f12cb6ca6405", "author_url": null, "date": "Jul 05, 2009", "message": "LINQ to SQL is not yet supported in MONO. The mono roadmap says it is planned for September 2009.\n\nLinq to Objects is supported that may have caused your confusion."}, {"author_name": "Daniel", "gravatar_hash": "1c5255f8496fcade0244f12cb6ca6405", "author_url": null, "date": "Jul 05, 2009", "message": "Also on the open source question.\n\nIf you open sourced the code as it is. Their is a good chance the community would step in and do the port to Linux, mono and MySQL for you.\n\nIf you did it right you would also get free bug fixes and enchancements provided by the community. You always say that developers are expensive and hardware is cheap. However in an active opensource project the reverse is true."}, {"author_name": "raveman", "gravatar_hash": "a86239e641ff9a31e6d5451202650efe", "author_url": null, "date": "Jul 06, 2009", "message": "One simple question, because I cant understand that. Why everybody think that coping Stackoverflow is so hard? I bet any programmer can do it, it might not be as fast, but it would look and behave the same.\n\nOpen Source is nice idea, however I think .NET programmers are not really into open source and programmers that are into open source are not into .NET."}, {"author_name": "Daniel", "gravatar_hash": "1c5255f8496fcade0244f12cb6ca6405", "author_url": null, "date": "Jul 06, 2009", "message": "@raveman - On my ubuntu desktop I have the following default applications written in c#/mono\n\nF-Spot - photo manager\nTomBoy - notes program\n\nadditionally on my ubuntu machyine a have the following open source c#/mono applications:\n\nBanshee - media player\nGnome Do - smart lancher and dock\nMonoDevelop - IDE\n\n\nAlso at work where I develop for window I use the following opensource .net applications.\nNUnit - unit testing framework\nMoq - Mocking framework\nLog4net - loggin framework\nninject - injection framework\nCriuseControl.net - continuous integration\n\nSo you see you couldn't be more wrong."}, {"author_name": "dtjm", "gravatar_hash": "afbfd5181cd4050b78dbbf5ebef6ff0b", "author_url": null, "date": "Jul 06, 2009", "message": "As far as open-sourcing goes, what seems to be the case in the WordPress ecosystem is that value gets added in customization and maintenance.  My company uses WordPress to run our main site and a few of the pain points starting at the application level seem to be: \n\ncustomization of visual design \ncustomizing functionality\nmaintenance (keeping backups, running upgrades)\n\nSo even if hosting companies are competing on base installations, driving down prices, there is still value to be captured at these pain points."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jul 07, 2009", "message": "Holy cow.  Jeff uses the \"Ask Jennifer Anniston\"/ \"Office Space\" legal/ethical test - if the wife says its ok, the it is ok to steal software.  Wow.  I can't believe the policy that Jeff advocates - if you don't get caught and you don't give it to developers then it is ok to take source code when you leave a job.  Wow.  Mind boggling."}, {"author_name": "Igor", "gravatar_hash": "19efb7291755c88107e37dffabeb77ad", "author_url": "http://igordevlog.blogspot.com/", "date": "Jul 07, 2009", "message": "You *can* connect to SQL Server in Mono."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jul 07, 2009", "message": "@bobby\nI don't think it's so much that closed source 'just works' as a hosted solution just works.\nThe companies that are buying StackExchange wouldn't buy a copy to install on their own servers, they are buying the convenience.\nAn open source local install version wouldn't compete for the same reason - these people don't have time to support any local version.\nBut an open source version would allow a hosting co. to setup their own fully supported 'just works' competitor - that's Joel's point"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jul 07, 2009", "message": "Isn't it funny how the companies with the stiffest non-compete clauses always want the most experience?\n\nWe hired a salesman from a direct competitor for their 'industry knowledge' = they presuambly brought their inbox from the last job."}, {"author_name": "Roland Tepp", "gravatar_hash": "2f38a95d606ca1d1c8caa9def9e97bcc", "author_url": null, "date": "Jul 08, 2009", "message": "Re: @juul\n\n&gt; 1. B Gates/S Jobbs/Google will live forever and\n&gt; they are not based on OS/Free.\n\nWhoah! hold your horses man - these guys ain't even dead yet and you claim that they will live forever... I'd put that statement on hold for couple of decades concerning any person working on / leading an OSS project or proprietary software company alike...\n\n&gt; 2. I tend to think that software developers \n&gt; devaluate their profession by giving stuff away\n&gt; for free.\n\nWell, I do not think you really understand the OSS software then.\n\nThe big fuzz about OSS software is not so much about material value of the work put into it (although in many cases it is not an inconsiderable amount). The real value of the OSS is in the value of innovation that developing software in open brings.\n\nJust like patent laws of old, OSS software is all about encouraging progress through freedom of innovation. And innovation only comes from the free flow of information. The original patent laws were designed for exactly the same reason - to encourage people to disclose their \"trade secrets\" so that others could benefit from them and build on top of them.\n\nOSS is not devaluation of their work - in fact the programmers working for the OSS see it as giving their work even more value.\n\nNot to mention another side of the coin which is freedom of use - with closed source software you are generally stuck with what the Big Co. gives you. With open source you have the freedom to \n\n&gt; 3. I think some (commercial) companies make money\n&gt; based on the hard work done by programmers for free.\n\nMac OS and IBM are not just selling repackaged versions of OSS software - they are putting lots of resources behind their OSS projects and they also put in a huge amounts of value-ad in software and services.\n\n&gt; 4. Open-sourcing doesn’t mean that the code will\n&gt; live forever. An example.. PHPNUKE ? Projects die.\n&gt; Open-source or not.\nWell, on that I can agree with you :)"}, {"author_name": "db guy", "gravatar_hash": "3c2ba67b59225900387448a5e5cf235c", "author_url": null, "date": "Jul 08, 2009", "message": "As per the comment that Microsoft has \"no built in way\" to split across to different databases: \n\nFederated databases... one way to push data across to different instances auto-magically - \n\nhttp://msdn.microsoft.com/en-us/library/ms187467.aspx"}, {"author_name": "raveman", "gravatar_hash": "0cd3b1532ee9c89941ba705419dfcb6a", "author_url": null, "date": "Jul 10, 2009", "message": "this should be closed as \\belong on ugly user-voice\\(or \\dont talk about it\\). \n\nits cool that you did meta, but now i dont care about it any more. too late for me."}, {"author_name": "Steve Hanov", "gravatar_hash": "83941efbdc5db60168254d29859053eb", "author_url": "http://stevehanov.ca/blog", "date": "Jul 13, 2009", "message": "Where's the next podcast??? It ain't the same doing my laundry with nothing to listen to, so it's been building up!!!"}]}