{"response": [{"author_name": "Hunter", "gravatar_hash": "fed6c543fa3473193cecf34d0ccb1b77", "author_url": "http://www.ratevegas.com/blog/", "date": "Jul 15, 2009", "message": "As someone that does Cocoa Touch development, I can't say I can relate to Miguel and his discussion of endless repetition.\n\nYes, it's true that the iPhone doesn't have garbage collection but that decision was made because the device is so resource constrained. ObjC-2.0 on the Mac does include GC.\n\nIt seemed like Miguel was confusing Cocoa, Cocoa  Touch and Objective-C, all of which are distinct.\n\nAs for iPhone apps built with Mono, any examples? I'm curious to see what they look like.\n\nThose kind of tools seem to generally work best for games where the UIs are non-standard. Curious if anyone has done apps of other types and how well they conform to the Apple iPhone HIG guidelines and just general usability."}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Jul 15, 2009", "message": "It's Fitts, so possessive would be Fitts' or Fitts's."}, {"author_name": "Joshua Foster", "gravatar_hash": "2c21bed614c58c9e1c48fe272e79efd2", "author_url": null, "date": "Jul 15, 2009", "message": "I can just see Jeff's eyes when Miguel offered to help getting SO running on Mono. All the licensing costs for the Windows and SQL server go up after a few years."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": null, "date": "Jul 15, 2009", "message": "@Hunter\n\nIf you're using Objective-C, you're probably using Cocoa/Cocoa Touch; there's really no point in separating them.  I'd back Miguel up on the \"weird\" part, not so sure about the boilerplate.\n\nThe iPhone is not constrained in any manner that would preclude garbage collection, not even close.\n\nI also don't think iPhone apps generally conform to the Apple's UI suggestions, and Apple certainly doesn't enforce them."}, {"author_name": "Hunter", "gravatar_hash": "fed6c543fa3473193cecf34d0ccb1b77", "author_url": "http://www.ratevegas.com/blog/", "date": "Jul 15, 2009", "message": "@Kevin,\n\nWell, he intermingled features of Cocoa on the desktop and CocoaTouch as if they were the same thing, making it sound like he didn't have a handle on the nuances. Also, he 'mmm-hmmd' when Joel make several statements that were straight up wrong.\n\n'Weird' is subjective. Trying things that are foreign is a delight of all aspects of life.\n\nGenerally speaking, I don't really understand the appeal of developing for any platform in a non-native toolkit. If you want to code for xyz platform, seems to me you're better off using the native tools.\n\nRegarding GC on the iPhone, I have read and personally heard statements from Apple engineers that they left GC out of the iPhone OS due to hardware performance limitations. Given that they already have an ObjC runtime with GC in mass deployment (Leopard) and the ABI is the same other than the GC bit, what do you believe their rationale is if not hardware performance?\n\nJust because a lot of apps don't conform to the HIG doesn't mean it's worthless. The good apps do. There are crap apps for every platform under the sun. As stated in the name, they are 'guidelines', not requirements.\n\nIn my experience, non-native toolkits often just 'don't feel right' and it usually has to do with UI issues. That's what I was wondering with regards to MonoTouch and why I wanted to see examples."}, {"author_name": "Nicholas Bieber", "gravatar_hash": "cb9e249283eea099f5cc5a3e48fe04f4", "author_url": null, "date": "Jul 15, 2009", "message": "\"More honor'd in the breach than the observance\"\n\n-Hamlet\n\nhttp://www.enotes.com/shakespeare-quotes/more-honored-breach"}, {"author_name": "Wayne Koorts", "gravatar_hash": "ae020e99cc0f4e8a49961da01f07aafe", "author_url": "http://www.wkoorts.com", "date": "Jul 16, 2009", "message": "Wow, best guest ever!  I can't believe you guys actually got bad-boy GNOME master Miguel de Icaza himself!!!  I so want to get into Mono now."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Jul 16, 2009", "message": "&gt; Miguel divides the world into PutPixel Programmers and printf programmers. Which type are you?\n\nMy nickname in high school was \"PutPixel\" :), because I was always toying around with BGI graphics in Pascal on my lab hours, and my class mates notices that particular function in my code allot."}, {"author_name": "Tobias Hertkorn", "gravatar_hash": "326cdf8ab079c8f3bef505894d544939", "author_url": "http://saftsack.fs.uni-bayreuth.de/~dun3/", "date": "Jul 16, 2009", "message": "@Jeff:\n\nIf you really want to be up there with phpBB - you really don't have to open source. What you really have to do is get a freaking awesome API and plugin system. \n\nThe fun part is that once the awesome API and plugin system is in place you could open source the core and monetize via plugins (like AD integration, ...)\n\nBut, as you surely know, a plugin system is extremely hard to get right. Why not try to get Paul Bakaus on your team and go from there. ;)\n\nCheers,\nTobi"}, {"author_name": "Dave A", "gravatar_hash": "970e3daa6f32f6a6fd7c5ce2fec9618d", "author_url": null, "date": "Jul 16, 2009", "message": "Cheers for the podcast.  Really impressive what the Mono guys are doing.  \n\nVery excited about the monoTouch thing and looking forward to the beta (if it's not too private...)"}, {"author_name": "Malach", "gravatar_hash": "09eb3720b1c9d33bedd35a3bd47ec1c9", "author_url": "http://www.rickenba.ch", "date": "Jul 16, 2009", "message": "You mentioned Delphi on this podcast. Codegear used to have Delphi.net, a flavour of Object Pascal in its Codegear IDE that lagged behind the newest .net development just due to integration complexity.\n\nOn the other side, RemObjects had Chrome, which was a Object Pascal compatible language, available in Visual Studio.\n\nIt seemed natural to marry the two. So Codegear and RemObjects agreed to collaborate. Codegear brought in the full RTL (as fit for .net) and the whole thing emerged as Delphi Prism (after some talk with Google obviously).\n\nDelphi Prism is a major undertaking for Codegear and well supported. Have a look at the roadmap at codegear.com ...\n\nThere are even some questions on SO about it."}, {"author_name": "Nicholas Bieber", "gravatar_hash": "cb9e249283eea099f5cc5a3e48fe04f4", "author_url": null, "date": "Jul 16, 2009", "message": "The Microsoft thing sounds interesting, but how are we going to get WordArt with just javascript? Canvas?  Something IE will support?"}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Jul 16, 2009", "message": "Wow, all that stuff about the iPhone and objective-c was really clueless. Ofc. we can't expect Jeff or Joel to know much about it as they're not Mac/iPhone developers, but is Miguel really claiming to know the platform?\n\nIt seems to me that he is showing the signs of so many other clueless .NET developers that plague the iPhone scene at the moment. They want to make iPhone apps because of the stories of gold, but they want to learn as little as possible about it. That is the wrong way to go about things in general and making iPhone development possible from Visual Studio (or the VS-alike MonoDevelop) using C# is just going to result in a rash of even worse iPhone apps. \n\nI mean honestly, if you are too clueless to work out how memory is managed in Objective-C then you are too clueless to program full-stop.\n\nFWIW I think that the iPhone gold-rush is pretty-much over now anyway. Individuals and companies will still be making money from selling apps for a long time to come of course, but there won't be the influx of newbie programmers that there has been. This does not bode well for companies starting now on tools for making iPhone development easier. I mean, does anyone look at the App Store now and think: \"wow, there's a real dearth of apps here, I sure wish iPhone development was easier so that more apps could be made\"? No."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Jul 16, 2009", "message": "u62: \n\nWow, fan boy alert.\n\nI don't see how the choice in development environment or language is going to determine how the end-result app is going to turn out. \n\nIf they can make it easier for people more used to .NET development to make apps for the iPhone, I say more power to them."}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Jul 16, 2009", "message": "@TheTXI\n\n\"Wow, fan boy alert.\"\n\nHeh, I usually get called elitist in these kinds of arguments :) FWIW, I am a long-term .NET developer and before that, classic VB. Luckilly I did quite a bit of C/C++ programming before that. Oh, and I never owned a Mac before I started doing iPhone development.\n\nBut while a lot of people (including people I know are great programmers) wasted a ton of energy whining about \"gee, do I really have to use a Mac\" and \"man, objective-c sucks\" etc. I decided I was going to learn how to do everything the right way from the beginning so that when I made assessments about how the platform compared to others I've written for, I could do it from a neutral point of view instead of one that was stupidly biassed one way (the \"Cocoa is my girlfriend\" guy) or the other (most .NET converts I hear from).\n\nIn reality none of it is actually hard, you just have to go in with the attitude that you're going to have to learn everything eventually so try and learn how to do things in the proper platform-centric way from the beginning and you'll find it a lot easier.\n\nGo in with the attitude that you just want to make money while putting in the least possible effort and everything will seem like a chore. And honestly I'd have thought that with this programmer attitude being a big focus of both Jeff's blog and Joel's hiring policy, people following their podcast would appreciate this fact better.\n\n\"I don’t see how the choice in development environment or language is going to determine how the end-result app is going to turn out.\"\n\nI guess you've not used that many cross-platform apps with their uncanny-valley user interface stylings?\n\nThe last time I heard Miguel talk about their plans for iPhone, they were planning to port Moonlight (their Silverlight clone) to the iPhone and then make some look-alike iPhone controls so that people could write iPhone apps without using Cocoa Touch at all. Judging by the way Linux developers always copy the look of other platforms for their GUI's, but never get the feel quite right, I can imagine how this is going to turn out.\n\nThe idea is reasonably sound when you're doing a game or something else that wouldn't make use of the normal controls anyway, but if you're making an app that looks like a normal Cocoa Touch app, but uses your own control library, I expect Apple to reject it."}, {"author_name": "Question Man", "gravatar_hash": "83b6c909386e3d5538f8b9ccacac5d9b", "author_url": null, "date": "Jul 16, 2009", "message": "I was hoping someone would ask what are the licensing implications of MonoTouch?   Because dynamic linking is more or less impossible in the LGPL sense, the licensing gets really weird when using frameworks that are largely LGPLed, as Mono is.   You're basically forced to adopt copyleft for your own code.\n\nAre they going to amend the Mono runtime licenses for MonoTouch?  Or will they do the open source/commercial license thing, with a cost associated with a commercial license?"}, {"author_name": "jjnguy", "gravatar_hash": "2e3bb9e76b9e5cd8f7eedc040d5ccd58", "author_url": null, "date": "Jul 16, 2009", "message": "Dev Days in Des Moines??  I'm totally there!!!  Where do I sign up?"}, {"author_name": "Mike Akers", "gravatar_hash": "2336ace23e546b29059a149fac15a8c8", "author_url": "http://www.michaelakers.net", "date": "Jul 16, 2009", "message": "I understand some of Miguel's arguments about Obj-C/Cocoa. It's not a very DRY language/framework for instance. If you want to add an instance variable to a class you need to touch -6 places in your code\n\n1. Add the ivar to the classes .h file\n2. Add the @property to the .h file\n3. Add a @synthesize line to the .m file\n4. Add a call to release in the classes -dealloc method\n5. Add a self.ivar = nil line to viewDidUnload if it's a view being added to a viewcontroller\n6. Add the view in Interface builder\n\nThis is a real pain in the ass, and Xcode doesn't help too much with this. I have the feeling that apple wants to fix this, but they're held back from adding too many new features to the language until they have finished moving off of GCC. This is why they're dedicating so many resources to LLVM's clang project."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jul 16, 2009", "message": "Do I care about platform look and feel on a phone?\n\nOn a desktop app having the quit short-cut consistent might be important but does it matter that shaking the iPhone means something different in iTunes than it does in my invoice manager?\n\nIf I have a corporate app on Blackberry I want it to look and behave the same on an iPhone so my users can switch platforms - I don't care if it doesn't match what a native Mac app would do - my corporate users don't have Macs."}, {"author_name": "Brian", "gravatar_hash": "1e91f99fb1be0a7f7ed1e147196be8f7", "author_url": null, "date": "Jul 16, 2009", "message": "I think the audio quality can be used as a metaphor (is that the right term?) for the Linux OS and Mono's attempts to broaden its adoption and get its message out.  Apparently they have a great message and story; but can't take the time to invest in a good microphone to make sure their message is clear and crisp.  I was trying to listen and get excited and all I could focus on was the muffled audio quality of the guest."}, {"author_name": "Paul Barry", "gravatar_hash": "6661ef9d747db3af8896cd94959d717d", "author_url": "http://paulbarry.com", "date": "Jul 17, 2009", "message": "Miguel and Joel's statements around the 9:30 mark regarding running scripting languages on the iPhone are incorrecet and a common misconception.\n\nFirst of all, the SDK comes with a scripting language interpreter, the JavaScript interpreter in Safari/Webkit.  People are taking advantage of that to build apps using things like the Phone Gap framework.\n\nhttp://phonegap.com\n\nOther examples of interpreted, dynamic languages being used on the iphone are Lua via the Corona SDK:\n\nhttp://anscamobile.com\n\nRuby via the Rhomobile platform:\n\nhttp://rhomobile.com\n\nBTW, see their FAQ:\n\nhttp://rhomobile.com/documentation/faq\n\n8. But is it really legal to have a Ruby interpreter on iPhone applications available on the AppStore?\n\nThe iPhone development terms do not disallow interpreted languages. They disallow interpreting code that has been downloaded independent of both Apple's official distributions channels (i.e. not contained in the app bundle) and Apple's own code.\n\nSo this is exactly my point, that putting an app with an interpreter in the app store is allowed, you just aren't allowed to have the app connect to the internet and download code and run that.  Despite the fact that that is exactly what safari does :).  \n\nYes, Apple does want to prevent people from creating their own different kind of app store, but that doesn't preclude people from using an interpreted language and bundling the code with the actual app."}, {"author_name": "Filip", "gravatar_hash": "a8cbb1ff855d6785e9bb64d2fcab4c14", "author_url": null, "date": "Jul 17, 2009", "message": "I don't like sweeping statements like the one about obj-c and cocoa by Miguel, or the \"it took them 20 years to get to obj-c 2.0\" by the other guy. Both C#/.net and obj-c/cocoa have their own strengths and weaknesses. But I assume that it's hard to find people, who are ready for a more in-depth conversation about it, it will probably turn into fanboys' war after few minutes. Re: boilerplate code - it's true for memory management, but it's still easier to design and implement apps using MVC in XCode/IB than it is in VS/Monodevelop."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jul 17, 2009", "message": "Great podcast - great guest."}, {"author_name": "Martin", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Jul 17, 2009", "message": "\"One of my long term 5 year goals is for the Stack Overflow discussion engine to become a go-to choice for public internet discussion, on par with phpBB and its kin.\"\n\nYou might want to revise the pricing structure then :)"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Jul 17, 2009", "message": "I'd attend a conference in Des Moines!  There's no love for the Midwest. :("}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": "http://softhardsoft.com", "date": "Jul 17, 2009", "message": "The first things you open-sourced were your 2 pieces of code sanitation on refactormycode and they're wonderful!"}, {"author_name": "Judah Himango", "gravatar_hash": "2142b1a501386ed0af9232862af48df9", "author_url": "http://judahgabriel.blogspot.com", "date": "Jul 17, 2009", "message": "Did anyone else notice after the end of the show, you can hear Jeff and Joel talking about banking? And that Michael from FogBugz screwed something up? LOL I'm not sure that was intentionally in the podcast."}, {"author_name": "JulianR", "gravatar_hash": "d2f65b970cccd83fa86bb4c4600d490c", "author_url": null, "date": "Jul 18, 2009", "message": "As far as I know, Office 2010 Web does use Silverlight, but falls back to HTML/CSS/Javascript when that's not available."}, {"author_name": "Duncan McGregor", "gravatar_hash": "fb95aca1c80de718bbfa01447220633b", "author_url": null, "date": "Jul 21, 2009", "message": "Hey Joel, please stop Jeff saying that the WMD guy _literally_ fell off the planet."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 21, 2009", "message": "I am going to keep saying it until someone produces John Fraser.\n\nOtherwise, prove to me he *didn't* fall off the planet.\n\nLiterally!"}, {"author_name": "Brian", "gravatar_hash": "ac59f99e5f6958e4df7466134a70c085", "author_url": null, "date": "Aug 07, 2009", "message": "I stopped listening to this podcast when Miguel bashed the MacOSX interface. Probably, the worst podcast out of 61 I have heard."}, {"author_name": "Cory", "gravatar_hash": "a19e015c4080f9f70158c85a8014c8fb", "author_url": null, "date": "Sep 14, 2009", "message": "Just heard DevDays in Des Moines mentioned in podcast #61.  Is this a joke?  I'd love to be there if not."}, {"author_name": "iHeartDucks", "gravatar_hash": "28772e8dc1742bbab62b7c36398cd369", "author_url": null, "date": "Oct 23, 2009", "message": "IMHO \n\nAny programming language that you are not familiar with, will feel weird. Like \"Klingon\" feels weird to me ;-)\n\nI do like the podcasts... may be not the guest (Miguel) so much. Hey, but you cannot make everyone happy :-)"}]}