{"response": [{"author_name": "Keith", "gravatar_hash": "380f0a3e0c931920d833fd3a5d5f1a94", "author_url": "http://www.keithdonegan.com", "date": "Jul 29, 2009", "message": "Nice one guys, looking forward to this one."}, {"author_name": "Entity", "gravatar_hash": "e326f7efc603a1881cd645d22a663de2", "author_url": "http://www.vbs2.com", "date": "Jul 29, 2009", "message": "Sweet! Listening now"}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Jul 29, 2009", "message": "I completely disagree on \"Velocity ... a clone of memcached\". It's much more than that. However for the audience I would say that it offers similar (but improved) functionality."}, {"author_name": "Andrew Cholakian", "gravatar_hash": "c95dca5d1d916d9c854a3035f3ea98f3", "author_url": "http://www.andrewvc.com", "date": "Jul 29, 2009", "message": "\"Speaking of sticky sessions, we were surprised to find that there are those rare few users whose IP addresses will change radically from request to request.\"\n\nAh yes, the rotating proxy, bane of IP based authentication schemes."}, {"author_name": "Daniel", "gravatar_hash": "1c5255f8496fcade0244f12cb6ca6405", "author_url": null, "date": "Jul 30, 2009", "message": "Android is an OS not a hardware product. Blaming Android for short battery life is like blaming windows for bad laptop battery life. There are already several phones running android in the market place, so which on are you talking about?\n\nPredictions are that by the end of the year their will be 18 different phones running android. http://bits.blogs.nytimes.com/2009/05/27/google-expect-18-android-phones-by-years-end/"}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": "http://stackoverflow.com/users/80572/kevin-montrose", "date": "Jul 30, 2009", "message": "Supporting an upgrade path from a Beta/RC operating system would be an incredible waste of time.  The upgrade experience from Vista -&gt; 7 should not suffer (by being given less attention/developer time/testing) so the handful of us running 7 RC/Beta don't have to re-install.\n\nThat being said, there was an unofficial way to upgrade the Beta to the RC:\nhttp://maketecheasier.com/upgrade-windows-7-beta-to-windows-7-rc1-without-formatting-your-hard-disk/2009/05/08\n\nThere might be one for RC -&gt; RTM."}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Jul 30, 2009", "message": "@Kevin Montrose (any relation to the band?) - As I understand it from listening to \"Windows Weekly\", there will be an \"unofficial, unsupported\" (read: don't call us if you system ends up FUBAR) upgrade path from the RC to the final version. It was a point of discussion in episode 116...\n\nHaving said that, like Paul, its not something that I recommend. If you're the sort of person who goes around playing with pre-release software you should have no problems doing a clean install."}, {"author_name": "jjnguy", "gravatar_hash": "2e3bb9e76b9e5cd8f7eedc040d5ccd58", "author_url": null, "date": "Jul 30, 2009", "message": "Wow, a 10 week internship would suck!  Mine is 15 and I hardly feel like I had any time."}, {"author_name": "jjnguy", "gravatar_hash": "2e3bb9e76b9e5cd8f7eedc040d5ccd58", "author_url": null, "date": "Jul 30, 2009", "message": "Oh, and thanks for equating programming teams to three-ways!  I was cracking up in my cube."}, {"author_name": "Sam152", "gravatar_hash": "d9d3bffa0ca503c495b2461881688467", "author_url": "http://www.sam152.com", "date": "Jul 30, 2009", "message": "I hope Joel realizes all he has to do is edit an ini file and he is fine to upgrade to the release version of Windows 7."}, {"author_name": "Perica", "gravatar_hash": "a073866682e4ce8df7ab09d337d3e576", "author_url": "http://www.PortablePython.com", "date": "Jul 30, 2009", "message": "I just love the \"background\" sounds every time Vista is mentioned :-))))"}, {"author_name": "Steve", "gravatar_hash": "28fdca798e4129cc895ac8123f0a4fc7", "author_url": null, "date": "Jul 30, 2009", "message": "Our load balancer will use cookie values to determine the sticky server.  It's a hardware load balancer, so it's fairly expensive.  If cost is an issue, I'm guessing that someone has a software load balancer that will read cookie values."}, {"author_name": "Jack M.", "gravatar_hash": "9ecd2f59de5e03ba481723637fc74fad", "author_url": "http://stackoverflow.com/users/3421/jack-m", "date": "Jul 30, 2009", "message": "Forgive me if this is the wrong place to post this, but the load balancing conversation reminded me of a project I've recently completed.\n\nJeff commented that they were worried about sticky sessions, and storing state in the database.  Have you considered storing your state in Memcached?  Memory is cheep, after all.  This helps you not raise your CPU usage on the database.\n\nAnother concern Jeff had was how the caching would work.  There is a two-part solution that I recently implemented for this.  Using nginx (http://nginx.net/) and Memcached (http://wiki.nginx.org/NginxHttpMemcachedModule), you can do some great things.  Your application servers can cache a page into Memcached, and nginx can serve this data back automagically.  This allows you to offload the serving of cached data from your app servers into your load balancer itself.\n\nI found that using this method reduced CPU load significantly and increased page load time by ~10% (granted this was a home-brewed perl app, so grain of salt and all)."}, {"author_name": "Kevin Dente", "gravatar_hash": "23c1e2063688620b75b248e08c0d5c24", "author_url": "http://weblogs.asp.net/kdente", "date": "Jul 30, 2009", "message": "Apparently Joel is not familiar with the mean of \"release candidate\" as used my Microsoft now. It's been years since it meant \"maybe this thing could ship\". Now it just means \"late beta\"."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": "http://stackoverflow.com/users/80572/kevin-montrose", "date": "Jul 30, 2009", "message": "@Kevin Dente\n\nYou haven't used Windows 7 have you?  The Beta was RTM worthy.\n\nWhat makes Joel's comments so damning is that this has been a known policy for a really long time, and even if it weren't it wouldn't make any sense to support RC -&gt; RTM upgrades."}, {"author_name": "David Hicks", "gravatar_hash": "a47a40b3520942a71990aaaa6874aee2", "author_url": "http://www.sansay.co.uk", "date": "Jul 30, 2009", "message": "The rotating IP address issue could be Tor (or similar), an anonymity network that hides people's web browsing habits, handy for those in suppressive regimes:\n\nhttp://en.wikipedia.org/wiki/Tor_(anonymity_network)\n\nIt's unlikely that your average suppressive regime is bothered about StackOverflow, but the whole point of running something like Tor is that the more people who use it for everday stuff, the more secure it is for those who really need to use it, so some perfectly legitimate StackOverflow users might be using Tor.\n\nFor Python speakers at Dev Days, I suggest Randall Munroe, author of the XKCD cartoons - certainly a big fan of Python, and I bet he would make a good speaker."}, {"author_name": "Jack M.", "gravatar_hash": "9ecd2f59de5e03ba481723637fc74fad", "author_url": "http://stackoverflow.com/users/3421/jack-m", "date": "Jul 30, 2009", "message": "@David:  Large proxies, satellite ISP's and some \"filtered\" ISP's (porn filtering, for example) often have shifting IP addresses as the connection runs through a proxy (or cluster of proxies) before hitting the web."}, {"author_name": "Mark", "gravatar_hash": "08c46737e830c3aeb4cbbde14dd57393", "author_url": null, "date": "Jul 30, 2009", "message": "To follow on to Kevin Montrose, he's correct and I can go further: You can upgrade from RC to RTM. It's not supported, but it's really easy to do and it worked PERFECTLY on my laptop. \n\nhttp://blogs.msdn.com/e7/archive/2009/04/07/delivering-a-quality-upgrade-experience.aspx"}, {"author_name": "mattiast", "gravatar_hash": "bf6698da693c7122ff7e21e32f2c7167", "author_url": null, "date": "Jul 31, 2009", "message": "\"n choose 2\" is actually (n^2-n)/2 and not n^2/2-1 as Joel said."}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Jul 31, 2009", "message": "Don't know if this is the result of Joel flipping out about not providing an upgrade to the beta testers but this is pretty coincidental.\n\nWindows 7 tech testers will get free copy of OS\nhttp://www.channelregister.co.uk/2009/07/31/microsoft_windows_7_tech_beta_testers/"}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": "http://softhardsoft.com", "date": "Jul 31, 2009", "message": "ENOUGH ABOUT TWITTER! You two can turn anything into a back and forth about Twitter. It's awful."}, {"author_name": "Kevin Dente", "gravatar_hash": "23c1e2063688620b75b248e08c0d5c24", "author_url": "http://weblogs.asp.net/kdente", "date": "Jul 31, 2009", "message": "@Kevin Montrose\n\nActually, I'm running the RC as we speak. Given the numerous changes that happened between RC and RTM, it clearly wasn't \"done\"(even if it was plenty stable). And Microsoft knows that good and well when they label something RC."}, {"author_name": "Duncan Godwin", "gravatar_hash": "40c5fca082da05cc17de12ee91be3363", "author_url": null, "date": "Jul 31, 2009", "message": "Gear6 have a Memcached applicance that can be used to provide multi-server caching:\nhttp://www.gear6.com/web-cache/overview\n\nI have no affliation with Gear6.\n\nAnother reason for IP address changes is corporate networks that maintain multiple Internet connections (sometimes to different suppliers) and load balance across these."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": "http://stackoverflow.com/users/80572/kevin-montrose", "date": "Jul 31, 2009", "message": "@Kevin Dente\n\nYou have a list of those changes somewhere?  Google comes up blank on RC -&gt; RTM changes, and the Beta -&gt; RC changes were nearly all cosmetic."}, {"author_name": "Cesar Eduardo Barros", "gravatar_hash": "14ab1ae9d0573438fdda37fdf8be7887", "author_url": "http://stackoverflow.com/users/28258/cesarb", "date": "Jul 31, 2009", "message": "Those rare few users whose IP addresses which change radically from request to request were a huge problem for Wikipedia administrators a few years ago (and they were not so rare there, since the biggest offender was AOL). Their IP address changed with every single edit, making them almost impossible to block when they were misbehaving (and any block attempt caused collateral damage). See the historical page at http://en.wikipedia.org/wiki/Wikipedia:AOL for more detail."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 31, 2009", "message": "> ENOUGH ABOUT TWITTER! You two can turn anything into a back and forth about Twitter. It’s awful.\n\nI'm putting this on my twitter."}, {"author_name": "Ryan Barrett", "gravatar_hash": "71509c133412b51803153871a8de560b", "author_url": null, "date": "Jul 31, 2009", "message": "Jeff, you know that with Windows 7's libruary feature you can set the 'storage' location yourself?  Just right click on the directory and you can choose the location.\n\nIt's then really easy to share / stream to other network users, and the Xbox 360.\n\nWorks well, much better than Vista's terrible UI."}, {"author_name": "Ryan Barrett", "gravatar_hash": "71509c133412b51803153871a8de560b", "author_url": null, "date": "Jul 31, 2009", "message": "RE: users changing IPs.\n\nAt work we've got an ADSL and cable connection, with an load-balancing router inbetween.\n\nSo our IP can (and does) change between requests.\n\nWe usually have to pull the plug on the ADSL in order to get anything done."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jul 31, 2009", "message": "I found it hilarious that when Jeff didn't seem to understand Joel's n squared analysis of communication paths int he beginning of the podcast he insulted the audience by saying he would put the concept in terms the audience could understand... A menage a trois...\n\nThanks Jeff, but I was following along just fine without that analogy.  I also suspect that any person who took any level of high school math (not to mention a BS in computer science) would have no trouble with the concept.\n\nI hope we also have heard the last of the whining about how much email you two get...  you have each spent a great deal of time and effort on creating very public profiles on the internets.  You can certainly return to a more low-key profile if you wish.  Then you wouldn't have to deal with emails from the unwashed masses."}, {"author_name": "Greg", "gravatar_hash": "6385c95f0c87b7990fc31e8372952ce8", "author_url": null, "date": "Aug 01, 2009", "message": "The rotating IP thing... as mentioned earlier, higher-end LB's use a cookie to tag each unique user, so concurrent requests will always go to the same server, despite any change in IP address."}, {"author_name": "Dan", "gravatar_hash": "566a4f660b49ee4a683866aaf8dff9d4", "author_url": null, "date": "Aug 01, 2009", "message": "Listening to the podcast now, as others have mentioned. I think Memcached is the competitor or Velocity you're thinking of. Hadoop is a implementation of the Google's MapReduce. I think the Microsoft Hadoop equivilent is called Dryad. Excellent podcast keep it up, especially love the talk of scaling. Now all I need now is a site people give a crap about :)"}, {"author_name": "drewster", "gravatar_hash": "5cb486e9d97aaab8b778a7b35365be9e", "author_url": null, "date": "Aug 03, 2009", "message": "I feel compelled to point out (contrary to the information in the podcast) that Opera ships with good per page javascript and ad blocking features built in."}, {"author_name": "Jay", "gravatar_hash": "9791be47599911bd88ae9d5f1d74bc7f", "author_url": "http://gloryfish.org", "date": "Aug 03, 2009", "message": "Ewwww, please don't eat while on mic. That's gross."}, {"author_name": "António Farinha", "gravatar_hash": "7ef637bfe1467faf361c768e9e6894f5", "author_url": "http://antoniofarinha.com", "date": "Aug 04, 2009", "message": "Is anyone else having problems listening to the podcast?\n\nFor me it breaks down at 19:29. Downloading Chrome suddenly at some point and only those 19:29 are in there. And downloading with Firefox just fails with an error message saying it can't read the source file.\n\nAny ideas? Thanks."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": "http://softhardsoft.com", "date": "Aug 04, 2009", "message": "&gt; I’m putting this on my twitter.\nHa!\n\nOn a serious note though: go for it! I'm not anti-Twitter. However, I only listen to 3 podcasts and 2 of them (I'm including this one) talk about Twitter a LOT even though (supposedly) none of them are about Twitter.\n\nAnd I have to share, my captcha for this post is: the ickiest"}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Aug 04, 2009", "message": "I think the rule of thumb isn't that you can't schedule software products at all, but that you can't control time, quality and scope at the same time. This means that if you need a specific quality and scope, you can't schedule the time.\n\nThe relation between time, quality and scope can be expressed as: time = scope * quality."}, {"author_name": "Michael Kniskern", "gravatar_hash": "8bc8c43c5ccc7e045c7158cb303ff107", "author_url": "http://stackoverflow.com/users/26327/michael-kniskern", "date": "Aug 04, 2009", "message": "Love the shout out to the Ace man in the podcast!  \n\nGet it on, Got's to get it on, no choice but to get it on!"}, {"author_name": "buti-oxa", "gravatar_hash": "0d16b92eaba8eb522b69a64f408cb8a2", "author_url": null, "date": "Aug 05, 2009", "message": "IE8 has built in ad blocker as well. Jeff should know, he edited my question concerning InPrivate Filtering on meta."}]}