{"response": [{"author_name": "Miff", "gravatar_hash": "19da349ae3a7835f7bef46906f7f4cb1", "author_url": "http://miff.furopolis.org/", "date": "Jul 21, 2009", "message": "When I first skimmed through this, I was like, \"Wait, they're spamming SO with R-rated language?\"."}, {"author_name": "Nick Josevski", "gravatar_hash": "47ea641609d2e7895b9dd3f20ca3ffe5", "author_url": "http://nickjosevski.com", "date": "Jul 21, 2009", "message": "That does sound like a great coordinated use of Stack Overflow and \"sparking\" interest is a great potential outcome of the efforts. The strong community building aspect is what I greatly admire about Stack Overflow and its sister sites, and it's good to see particular user groups jumping on board."}, {"author_name": "Ryan", "gravatar_hash": "cbbc31b73a7bdea8587d563701ae5d16", "author_url": "http://lucydebate.blogspot.com", "date": "Jul 21, 2009", "message": "That is really neat."}, {"author_name": "Michael E Driscoll", "gravatar_hash": "faef2c296b5989d5df52e251bf3105fb", "author_url": "http://www.dataspora.com/blog", "date": "Jul 21, 2009", "message": "Hi all - \n\nThe event is happening tomorrow night (Tuesday July 21) at 7pm PST at OSCON and around the country.\n\nFollow @rstatsmob on Twitter to participate!\n\n  https://twitter.com/rstatsmob\n\nThanks for the shout-out Stack Overflow!"}, {"author_name": "Jake", "gravatar_hash": "1c3a95ab1ca319181322d6a1bbacec31", "author_url": null, "date": "Jul 21, 2009", "message": "@Miff haha, that's what i thought too\n\nI think this is great! I'm learning R and am often frustrated navigating the mailing list webpages that might have the answers to my questions."}, {"author_name": "Daniel Jomphe", "gravatar_hash": "ad73def80018774e4f73ee46d6c437fe", "author_url": null, "date": "Jul 21, 2009", "message": "Please help me understand what you mean here. I might have got it wrong.\n\nAre you telling them SO officially doesn't like their plans of doing that, although you personally think they are very applaud-able?\n\nAlso, in my developing of a future product, I often caught myself envisioning the day I will suggest to my product's community to ask their questions in SO. Do you say I wouldn't be welcome to suggest that? I think your opinion is that it would artificially drive the community to SO for this official purpose and is thus not a good way to promote SO usage for my product. Am I right?\n\nThanks"}, {"author_name": "Anon", "gravatar_hash": "28bdd5298558caad2744c8b32ad913c9", "author_url": null, "date": "Jul 22, 2009", "message": "@Jomphe: \n\n\"I applaud the way the R language enthusiasts have tackled it — it’s clever, effective, and *completely* in tune with the spirit of Stack overflow.\""}, {"author_name": "DrJokepu", "gravatar_hash": "973c6e2cf1ae9f6615dd883eb14597b1", "author_url": null, "date": "Jul 22, 2009", "message": "So here's what's going to happen: the local militia will simply shut the project down by closing these questions immediately as \"not real questions\" or flagging them as spam."}, {"author_name": "Will", "gravatar_hash": "7f1cd1b68caaf0505d947e09e97c8b8d", "author_url": null, "date": "Jul 22, 2009", "message": "The best thing the 'R' community could do to help themselves help people learn it would be to change the name of their product to something which could be searched for on the Internet."}, {"author_name": "StompChicken", "gravatar_hash": "c97876b3b4e3954ca92f8a12745d800b", "author_url": null, "date": "Jul 22, 2009", "message": "Someone should sort out the ambiguity over tags for the R Language: i.e. 'r' (58) and 'r-language' (29)"}, {"author_name": "Caoilte", "gravatar_hash": "1fa7c3fbf35b6b950ce5717ceb7e6cdd", "author_url": null, "date": "Jul 22, 2009", "message": "I hate to quibble, but they're not \"real\" questions so what you're actually condoning is the asking of fake questions as long as more than the first person is involved in answering them.\n\nI approve, but I think what would be even better would be if Stack Overflow provided an official and weighted mechanism for asking and answering your own question."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Jul 22, 2009", "message": "I would find it amusing if the questions ended up getting closed by people thinking the site was getting spammed up. That would actually make my day."}, {"author_name": "Nathan", "gravatar_hash": "ec2b04ac1bad14fea8244a78ef0f2133", "author_url": null, "date": "Jul 22, 2009", "message": "@Caoilte,\n\n Sure they're real questions. The questioner may already know the answer, but if they are valid questions and they get answered then that's good.\n\n A couple of weeks ago I couldn't find an answer for my question on the net, I asked a friend and he gave the the correct answer, I then \"asked\" a question here on SO and answered it myself so that it was recorded. This, I believe, is a quite valid way to use the site."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Jul 22, 2009", "message": "Nathan: \n\nIt is a valid way of using the site, it just still gets a lot of negative views from the community because it is not necessarily appreciated. I personally tend to ignore those types of questions, but some will go out of their way to down vote those questions and answers if they feel they were just attempts by the Question/Answerer at cheap rep."}, {"author_name": "Brian Duffy", "gravatar_hash": "974938b8250a08cf9e22714aff1f9fcc", "author_url": null, "date": "Jul 22, 2009", "message": "Channeling SO commentary from the future:\n\"Statistics isn't programming, question should be moved to SuperUser with the other Excel questions\""}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": null, "date": "Jul 22, 2009", "message": "..and in the third hour, all the questions get closed as \"not programming related\" ;-)\n\ncaptcha: teal surprise"}, {"author_name": "gnovice", "gravatar_hash": "f10d46954aba4a7207ea3ba66d4e6f86", "author_url": null, "date": "Jul 22, 2009", "message": "I agree that it's a good use of SO, but there are good and bad ways to go about it. Based on what I've seen in the past, the best way (i.e. the way that will garner the least negative response from the community) is to post the question first and hold off on adding the answer for a time (maybe a day or so). Basically, let the community weigh in first, then add what you feel is the most correct answer.\n\nWho knows?... you might even get an answer from the community that is better than the \"official\" one."}, {"author_name": "John Farrell", "gravatar_hash": "c9e49f4aaadc8a330f70a224a9ab1bfc", "author_url": "http://fizzbuzz.net", "date": "Jul 22, 2009", "message": "What about a library or product writing using stackoverflow as an off site CMS for faqs or documentation?  Seems like a lot of potential there.\n\nI'm glad answering your own questions has been more condoned lately.  Using stackoverflow.com as a bookmarking service for code snippets or techniques I've been collecting looks useful."}, {"author_name": "Brian Reindel", "gravatar_hash": "22968e1d59bbc6816ff7f50f75d78dbd", "author_url": "http://blog.reindel.com", "date": "Jul 22, 2009", "message": "So instead of taking the time like so many others before you to create solid documentation that goes beyond the API, providing easy to follow examples and a context for a friendly community to flourish, a site such as Stack Overflow will simply be gamed to increase search engine rankings? I applaud the energy and effort, but I have to say the idea is lacking the proper direction. When I read this, I think to myself, \"Why would I want to learn R programming if I'm being told it's so freaking difficult, the community is already tired of answering questions, and more than likely I can't find the answers I will need anywhere else.\""}, {"author_name": "JP", "gravatar_hash": "4b4f6c773b0fc5997b76e736fef9330c", "author_url": null, "date": "Jul 22, 2009", "message": "Thanks for the warning. :)  I would have thought it was a rep. exploit."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jul 22, 2009", "message": "So what's the cut-off for real questions?\nThere are a few popular libraries/projects with very poor yahoo groups or sourceforge based user forums.\n\nCould we move all the eg. opencv questions to SO? Or is this the target market for hosted stackexchange?"}, {"author_name": "Matt", "gravatar_hash": "cc942d2d8a74652acd9fe06fe9cc55fe", "author_url": null, "date": "Jul 22, 2009", "message": "I don't think there's _necessarily_ anything sinister about this \"flashmob\", but I can see why some folks might be skeptical.  After all, if you remove the conference context and language specificity, what you're left with is this:\n\n\"In the first hour, participants will pair up to claim a question, formulate it on StackOverflow, and provide a comprehensive answer. In the second hour, participants will rate, review, and comment on the set of submitted questions and answers.\"\n\nWhich sounds a lot like: \"a bunch of us are going to get together on SO and ask a whole bunch of questions to which we already know the answers, then answer them, and then \"review\" (i.e vote up?) each other's stuff.\"  In the right (wrong?) light, that probably could be regarded as gaming the reputation system.\n\nTo be clear, I don't have a problem with answering your own question, especially if you posted the question w/out already knowing the answer.  And I think Brian Reindel's comment makes a good point about shortchanging their own documentation and community; however, I can totally see why Jeff likes this - SO is, after all, a site driven by user contributed content and as long as it's programming related, it probably can't hurt."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 22, 2009", "message": "> answering your own questions has been more condoned lately.\n\nIt's been condoned from day one -- see http://stackoverflow.com/faq"}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Jul 23, 2009", "message": "&gt; We have developed a list of the most common 100 technical R questions, based on an analysis of (i) queries sent to the RSeek.org web portal, and (ii) an examination of the R-help list archives, and (iii) a survey of members of R Users Groups in San Francisco, LA, and New York City.\n\nYou’d never guess they were statisticians."}, {"author_name": "Daniel Jomphe", "gravatar_hash": "ad73def80018774e4f73ee46d6c437fe", "author_url": null, "date": "Jul 23, 2009", "message": "About my previous comment: I was reading you were *condemning*, not *condoning*. Now I understand. (Didn't know of this English word.)"}, {"author_name": "Dan Goldstein", "gravatar_hash": "986cd85f81c714b77bae8b6c6b43227b", "author_url": "http://www.decisionsciencenews.com", "date": "Sep 04, 2009", "message": "Gang,\n\nThere will be another R flashmob on Tuesday, September 8th, 2009. Join the fun!\n\nhttp://www.decisionsciencenews.com/?p=1042"}]}