{"response": [{"author_name": "Stefan aka splattne", "gravatar_hash": "7847006dbf49f1722b07c8da396f1275", "author_url": null, "date": "Jul 04, 2009", "message": "*First*! (I'm kidding)\n\nThank you Jeff for the kind words!\n\nAnd it was really an honor for me that I was asked to become a moderator on ServerFault. \n\nLet me add some words by Clay Shirky:\n\n\"We have lived in this world where little things are done for love and big things for money. Now we have Wikipedia [and this could be replaced with many other Internet community projects, like SO/SF/SU]... Suddenly big things can be done for love.\"\n\nAs moderator, I'll try to stick with the following description of David Winograd:\n\n\"[A e-moderator]... helps people get started, give them feedback, summarize, weave the contributions of different folks together, get it unstuck when necessary, deal with individuals who are disruptive, or get off the track, bring in new material to freshen it up periodically, and get feedback from the group on how things are going and what might happen from the group on how things are going and what might happen next...[Further the moderator needs to] communicate with the group as a whole, sub-groups, and individuals to encourage participation.\"\n\nhttp://www.emoderators.com/moderators/winograd.html"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Jul 04, 2009", "message": "On the Fourth of July you name a *foreigner* as a new moderator?  For shame!  ;)"}, {"author_name": "Stefan aka splattne", "gravatar_hash": "7847006dbf49f1722b07c8da396f1275", "author_url": null, "date": "Jul 04, 2009", "message": "@kip: In defense of Jeff - he set some terms which I'll have to fulfill:\n\n- every morning at 6am: sing the US national anthem while hoisting up the Stars and Stripes \n- memorize the Gettysburg Address\n- watch at least twenty different US tv shows during a season (already doing)\n- every reply to him must start with \"YES SIR, YES!\"\n\nFortunately I could talk this one out of him:\n- switch from Italian food to American \"nutrition\"\n\n;-)"}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jul 04, 2009", "message": "Congratulations, splattne! It's very tough to get 10k on SF and you've definitely earned it!\n\nFor those that were curious (as I was) about the geographic spread of the moderators, here's a map I made:\n\nhttp://www.google.com/maps/ms?msa=0&amp;msid=112809495357897188939.00046d992b2ab4a0b5c81"}, {"author_name": "saua", "gravatar_hash": "a648ccb47bbbe9497c073315aac4d33e", "author_url": null, "date": "Jul 04, 2009", "message": "@kip: did you know that everyone (including you) is a foreigner almost everywhere in the world? ;-)"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Jul 04, 2009", "message": "Congrats :)"}, {"author_name": "Stefan aka splattne", "gravatar_hash": "7847006dbf49f1722b07c8da396f1275", "author_url": null, "date": "Jul 04, 2009", "message": "Nice map Kyle! We could play Risk using that map. Team SF against Team SO. :-)\n\nP.S.: Just one detail: you put my pin in Austria, probably because you searched for \"Tyrol\". I'm from South Tyrol - that's part of Italy (since 1919), although the majority here speaks German. You could put the pin near \"Bressanone\" (55 mi south of the current point) - that's where I live."}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jul 04, 2009", "message": "@Stefan/splattne:\n\nOK, I moved your pin to Bressanone. I've also opened it up so that anyone should be able to edit the map, in case anyone wants to update (or remove) their location. For privacy, I'd suggest, at the most pointing to the city you live in - personally, I just dropped the pin where Google said Maine was for my location (I don't actually live in North Guilford)."}, {"author_name": "Kara Marfia", "gravatar_hash": "c3d6aaa8d2108ec029763b7f8fc617c0", "author_url": null, "date": "Jul 07, 2009", "message": "I'll leave my pin up near Ludington as a goal.  ;)  \n\nStefan was already a mod in everything but name, and I think we're all happy to see it made official.\n\nWe're lucky to have you!"}]}