{"response": [{"author_name": "David", "gravatar_hash": "323b4cf7a4bc57da978df02e433ec91a", "author_url": null, "date": "Jul 26, 2009", "message": "First."}, {"author_name": "vmarquez", "gravatar_hash": "98732b3a10b3bf2c5d28977676774e61", "author_url": null, "date": "Jul 26, 2009", "message": "Absolutly great analogy!"}, {"author_name": "SuperGeek", "gravatar_hash": "28265b42e313208cf050c72f473f2fae", "author_url": null, "date": "Jul 26, 2009", "message": "Second.\n\nTwo's a higher number than one.\n\nI think I like the idea of the League of Justice.  I'm not sure why but my instinct was to react positively.  And I most certainly agree with the separation of special talents to highlight each."}, {"author_name": "Brian", "gravatar_hash": "cbb0e0ff08928a30201fdd390e9d384c", "author_url": null, "date": "Jul 26, 2009", "message": "People just get upset when they are afraid that \"their\" wensure is the lame, Aquaman one."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jul 26, 2009", "message": "Wow, there are indeed people who want only one big site instead of several specialized ones? That would be indeed unusable and a mess. I mean, on a developer centric site like Stack Overflow there are questions that do not interest me directly - i.e. anything related to Ruby, R or COBOL - but it's still possible to \"get something out of them\". Browsing the StackOverflow mainpage is a bit like browsing Wikipedia: Jumping from Topic to topic, but always staying within one topic of interest.\n\nBut if you then mix HTPC Stuff from SuperUser and Exchange Server Administration from ServerFault, it becomes an unbrowsable mess IMHO.\n\nPS: In your SuperHero analogy, which site has to be Aquaman? :)"}, {"author_name": "Jason", "gravatar_hash": "da7e30e378ca3c7f18894e555e6b9378", "author_url": "http://jasoncartwright.com", "date": "Jul 26, 2009", "message": "Is it not for advertisers?"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jul 26, 2009", "message": "The irony here is that one of the joys for me is that SO is relatively *broad* compared with the usual technology-specific forums.\n\nI'm absolutely behind the current setup. I suspect it could become tricky with other categories. For instance, would \"all games\" work, or is that just too broad? Hard to tell, IMO. I don't know exactly how to find or even recognise the sweet spot between being overly specific and overly broad... but I'm sure it's there.\n\nJon"}, {"author_name": "Stewart Robinson", "gravatar_hash": "5cf02781a271470da9a3627d43bffb59", "author_url": "http://stewsnooze.com/", "date": "Jul 26, 2009", "message": "I like how it (we?) are following the Hitchhiker's guide to the galaxy in that we have a trilogy but it's already four sites.\n\nFrom http://en.wikipedia.org/wiki/The_Hitchhiker%27s_Guide_to_the_Galaxy\n\nThe novels are described as \"a trilogy in five parts\""}, {"author_name": "Peter Boughton", "gravatar_hash": "e915239e11bb00291ce4e4b17b83bc66", "author_url": "http://www.sorcerers-isle.net", "date": "Jul 26, 2009", "message": "O_o\n\nDid you just use comic book characters to justify being deliberately unhelpful?\n\n\nEvery time I visit, I have to:\n1. Ctrl-click the Envelope to check for responses.\n2. Ctrl-click my name, then click Recent to check for replies to comments I've made.\n3. Ctrl-click each of my \"Interested\" tags, to check for new questions.\n\nAnd I have to do that *four times*, for each of the sites.\n\nNot to mention coming to check what's happening on the blog.\n\nThat's a lot of tabs just to get a status update.\n\n\nWhy do I have to go through it all? It's pointless!\n\nJust create a dashboard that condenses all that into a single page.\n\nIt doesn't need to be a whole new site!\n\nSimply a way to review all the information in one place, before going through to the individual sites is enough."}, {"author_name": "Cameron", "gravatar_hash": "ed0349d11442687099bc7267f32e9a3d", "author_url": "http://www.cameronhinkle.com", "date": "Jul 26, 2009", "message": "I think the concept is great, it's just a matter of getting the granularity right.  For me, I love being able to exist in the Programming community and not the Sysadmin community. For some people (those much more 1337 than me) that won't be the case."}, {"author_name": "Tony", "gravatar_hash": "58ef1d5589ae9e97b96ef294700bee5b", "author_url": null, "date": "Jul 26, 2009", "message": "I think the problem isn't that their are 4 sites, it is that they are 4 sperate sites. I have 4 accounts, 1 for each site. I am ok with keeping the questions and topics split up but why must I have 4 different accounts? For each site, I had to create the account, edit the details, and link to my other accounts. No it is not a big deal but it feels cumbersome. It feels like the user experence could be more fulid between the sites.\n\nTo sum it up, I understand the needs for the sectioning off for questions/answers but do we really need to do that for accounts?"}, {"author_name": "Jason Creighton", "gravatar_hash": "2fa8f68c776ff3f222803894a32eab69", "author_url": "http://jcreigh.blogspot.com/", "date": "Jul 26, 2009", "message": "If anybody thinks have one giant site is a good idea, I encourage you to go browse around Yahoo answers for a bit, and then come back and tell me that. :-)\n\nBut in seriousness, something to mitigate the issue that Peter Boughton brings up wouldn't be too bad...even if it was just a personalized RSS feed that showed all your activity that you're interested in (responses to you, questions with interesting tags, etc.) on a given site. You'd have to subscribe to four different feeds if you were on all the sites, but that's a on-off cost."}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Jul 26, 2009", "message": "I'm with Peter Boughton on the dashboard idea.\n\nGuesses for the upcoming announcement(s):\n\n  a site for gamerz\n\n  a site for web developers/designers"}, {"author_name": "Remus Rusanu", "gravatar_hash": "414213a8181616151fe73334532746ab", "author_url": "http://rusanu.com", "date": "Jul 26, 2009", "message": "Separating the roles is fine, but I have to pick on the idea of moving posts to superuser.com *while is in beta*. User asks on serverfault, the post is moved, link takes you to a welcome-to-beta-enter-the-code page. Not cool."}, {"author_name": "Wil", "gravatar_hash": "8e40b955ba72299d98374726cdc1573d", "author_url": null, "date": "Jul 26, 2009", "message": "It is good to have separate sites, I agree with boundaries, but it would be nice to share one account between all of them and not just the association thing you can do now.\n\nFor example, forums! Have multiple sites with separate sections!"}, {"author_name": "kastermester", "gravatar_hash": "1abe8fd3a3b219b0ac8e8d9fd2271ca7", "author_url": "http://kaareskovgaard.net", "date": "Jul 26, 2009", "message": "I completely agree with the post - however I think that what has been posted here has said enough - what is really needed is an easier way to catch up on what has happened since last time you visited - ie. the dashboard that was suggested - probably as part of the profile when associated with one's other accounts or idk, you guys are smart, come up with something neat ;)"}, {"author_name": "Tarmo Aidantausta", "gravatar_hash": "f1fbb0d1ebc43244a90fcac1448f43e0", "author_url": null, "date": "Jul 26, 2009", "message": "Having different sites is good but the integration and the collaboration should be whole lot better. I've been digging into taxonomies lately and they sure are hard.\n\nThe example from the taxonomies pretty straightforward:\tyou have your fish and birds - everything is fine. Then somebody finds the bloody fish that has wings and can fly. What the duck do you then?\n\nI think this issue is quite applicable to serverfault and superuser, becaus there's always going to be overlap. I suggest that you make it possible for a question to be shared between sites because that would avoid (and possibly create) confusion (if done wrong).\n\nAnother feature which came to my mind is having cross-site search on currently existing question suggest list when creating a new question. This is another feature which would point the users in the right direction."}, {"author_name": "BenRifkah", "gravatar_hash": "b4aacb6b73ab7fb4bcfd1772745475d3", "author_url": null, "date": "Jul 26, 2009", "message": "Meta is Aquaman.  An interesting idea but only useful in specific circumstances.  A lot of people think of Aquaman as unnecessary or lame, but consider this: If Aquaman wasn't around the other heroes would have to spend considerable time and effort getting tooled up and fighting the rare underwater crime.  This would distract them from the \"real\" work they're trying to get done.  As with underwater crime fighting Meta is a niche that needs to be filled and if you don't have a specialized forum for it you distract from the primary focus of each site."}, {"author_name": "Chris", "gravatar_hash": "e400600450847a664b70eabedb920d2e", "author_url": null, "date": "Jul 26, 2009", "message": "*cough* subdomains, they were invented for a reason."}, {"author_name": "Chris", "gravatar_hash": "e400600450847a664b70eabedb920d2e", "author_url": null, "date": "Jul 26, 2009", "message": "I'm not saying \"Why can’t there just be one giant superhero, SuperBatGreenMartianFlashHawkManWoman??\".\nI'm saying \"Why do they have to live in separate cities?  Why can't they all live at the same address?\""}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Jul 26, 2009", "message": "\"...tend to form in real world communities — Chinatown, Little Italy, garment districts, Wall Street, ....\"\n\nWhy is taken for granted we all know what \"Chinatown and Little Italy\" are? \n\nThis examples have been given by Jeff a couple of times before, but I really didn't knew what was he talking about. I thought it was some kind of sarcasm saying \"China is a town\" and \"Italy is little\" or something like that.\n\n\nFinally, now I know those are United States neighborhoods  ( and I knew it because \"WallStreet\" was mentioned too and that one IS global recognized indeed ) \n\nWhile most of the things in US culture are global, some others are not.\n\n\nOn the topic, I like the way S[OFU] is right now. I don't think they're going to launch a new site any soon. \n\n\n\nI think they'll talk with other existing portals to share the S[OFU] profile and earn some extra rep points. \n\n\n\nIt is good to have the platform extended all over the internet, but I agree, each site should keep focused in very specific topics."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Jul 26, 2009", "message": "*puts on joke hat*\n\n\"I’m saying “Why do they have to live in separate cities? Why can’t they all live at the same address?\" - Chris\n\nBatman = Gotham\nSuperman = Metropolis\nWonder Woman = Washington D.C (and roams)\nFlash = Central City\nGreen Lantern = Coast City\nAquaman = Atlantis"}, {"author_name": "Marc Gravell", "gravatar_hash": "b4ae7f8b50a2c32287e456394570679e", "author_url": "http://marcgravell.blogspot.com/", "date": "Jul 27, 2009", "message": "&gt; In fact, we have plans to expand our own League of Justice even further in the next few weeks. \n\nYou've finally bought up the much-needed ponyoverflow.com?"}, {"author_name": "Jonathan Webb", "gravatar_hash": "b666b4fbfebf0d79f017af3153bc8e52", "author_url": null, "date": "Jul 27, 2009", "message": "\"Is it really so hard to figure out which community you belong to, and thus, where your question belongs?\"\n\nThis from someone who recommends Steve Krug's book \"Don't Make Me Think!\"\n\nThe communities overlap and it will not always be clear-cut where questions belong. There needs to be a portal that helps users target their questions and inform them of updates."}, {"author_name": "Martin Marconcini", "gravatar_hash": "81605bd0acefe569da6f9d93a684b156", "author_url": "http://gryzor.wordpress.com", "date": "Jul 27, 2009", "message": "I like the 4 sites, but I think that the Stack family needs The Mother Of All Stacks. One centric place where we can access each individual question feed (from SO, SMeta, SU and SFault), having one unique \"mailbox\", etc.\n\nIt is time to bring: \"One Stack to rule them all, and in the darkness, bind them\"…\n\nMy 2c."}, {"author_name": "Boldewyn", "gravatar_hash": "4257476fe3d948aaf89658db890d0236", "author_url": null, "date": "Jul 27, 2009", "message": "I was about to mention Wikipedia as a counterexample, but then I realized that Wikimedia does exactly the same: Wikipedia for people wanting to create an encyclopedia, Wikibooks for people interested in creating books, Commons for people interested in media.\n\nIn this light: Go on! I like all 4 sites!"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Jul 27, 2009", "message": "Marc Gravell: \n\n\"You’ve finally bought up the much-needed ponyoverflow.com?\"\n\nI have not heard anything like this, but you'll have to talk to my web hosting agent, Olafur.\n\nBoldewyn:\n\nYour gravatar has an unsettling resemblance to mine. I demand you cease and desist from using it."}, {"author_name": "Mr. Shiny &amp; New", "gravatar_hash": "d78a43ac94c1c0d6cf5740efd7574928", "author_url": "http://eternalephemeron.blogspot.com", "date": "Jul 27, 2009", "message": "I agree with the one-site folks.  Separating the questions by role is simply a tag issue.  However, it's fine that they are on different sites, whatever, it's easy to click a hyperlink to get there.  The problem is that there are separate user accounts for each site and you have to track all your responses and questions and answers in four separate places. Four is manageable, it's like the trilogy plus the deleted scenes, but if more sites are ever created it will be annoying to maintain."}, {"author_name": "yesraaj", "gravatar_hash": "f764e60e95b149fd9fbfc6ddf241d872", "author_url": null, "date": "Jul 27, 2009", "message": "not able to visit Stackoverflow.com appears blank in my company ip."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Jul 27, 2009", "message": "Rather than having everybody clamoring for some type of control panel or better method of integrating all their accounts together, I think you would be able to kill that bird (and several others along the way) with the development of a publicly accessible API, which would then be able to be used by other sites which go out and develop this type of integration and offer a lot more in the way of customization options than whatever solution (if any) gets developed in-house. It would also have the added benefit of allowing sites to develop other valuable information like better reputation tracking, maybe some social networking aspects, and other things which may not be suitable for the core Stack network.\n\nPersonally, I like the fact that the sites are separate and allows for a separation of knowledge (I don't want to see ServerFault stuff in StackOverflow because it means nothing to me as a programmer). If there was some sort of control panel/dashboard/integration of some kind, that would be nice, but I wouldn't be bothered if it didn't show up. I am managing just fine on the sites as it is."}, {"author_name": "Practicality", "gravatar_hash": "6d81d6dc131240aff73b92c2777f1737", "author_url": null, "date": "Jul 27, 2009", "message": "It seems to be a good balance between segregation and integration. If things were too segregated (IE, C++ site here, PHP site here, Ruby site here) there would not be enough quality information to dig into. If it were too integrated there would be too much noise.\n\nI really think the difference between different sites and having subsites is a preference. There are usability pros and cons either way."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Jul 27, 2009", "message": "ponyoverflow.com is for sale at reasonable price. http://www.youtube.com/watch?v=jTmXHvGZiSY"}, {"author_name": "Nosredna", "gravatar_hash": "4d5cf9b8d40af8083b1797aa7c5f3de9", "author_url": "http://dreaminginjavascript.wordpress.com", "date": "Jul 27, 2009", "message": "Is it hard to figure out which community I belong to?\n\nIt apparently is, because if I ask a question on the wrong site, it gets forcibly shuffled off to a sister site. Then how do I check on the answers? I have to go there.\n\nA lot of the hassle of having four sites would go away if each site told me when I have responses on other sites.\n\nI think the problem will go away with a good API and apps that let me know when I have responses on any of the sites."}, {"author_name": "Josh", "gravatar_hash": "3020b35c4f9ec8eec59d060626ebf5d2", "author_url": "http://www.methuseus.net", "date": "Jul 27, 2009", "message": "I feel left out. He mentioned skiers and snowboarders. What about us sledders?"}, {"author_name": "Kevin", "gravatar_hash": "fefa1c248fa131e349cf32a59cf10d5a", "author_url": null, "date": "Jul 27, 2009", "message": "How many users have accounts on all 3 main sites? That should be pretty good indicator of whether you separated the communities correctly. \n\nIf most users have accounts on all three sites then maybe the community did not want to be divided like that."}, {"author_name": "Cade Roux", "gravatar_hash": "d45ef03e9450599588bf733662f792e5", "author_url": "http://www.semicolon.net/", "date": "Jul 27, 2009", "message": "You can combine the RSS feeds from the different sites using Yahoo! Pipes.\n\nI already do this to correct the relative URL issue when feeding twitterfeed from an SO rss feed.\n\nI also take this feed into Google Reader to monitor it.\n\nMy main problem with separate sites is that there are system design/architecture issues where serverfault expertise would be useful, but the questions are generally raised by programmers/architects.  The cross-fertilization between implementation and development is vital to developing great systems and not just throwing things over the wall and expecting sysadmins to get them working.  (Same issue I have with the TechEd split).  Compartmentalization goes hand in hand with the IT shops with the poorest responsiveness and customer service."}, {"author_name": "csmba", "gravatar_hash": "e8ec9371b0173179ee41dd68e0e80ddd", "author_url": "http://knol.google.com/k/csmba/free-tools-and-websites/2p76v0g9rhval/4", "date": "Jul 27, 2009", "message": "you are confusing user experience, design and implementation (classic problem when engineer does all).\n\nI agree that just \"tag\" it is incorrect. You need as you say a more explicit \"silo\" between the applications (sites). But what you got wrong is the implementation:\nIt should be one ENGINE! one application.\nI should login using one account, not have 4 accounts that I (or you) break your teeth in order to port and sync. \n\nI am one person, I should have one account (you got the open Id part, but then you in a funny way broke it!).\n\nAfter I have one SO account, I can decide which \"silo\" I want to go to today. Example?:\nI have one Google account, but can use Gmail, Calendar, search... if you would design Google aps, I would have 10 accounts which you would be wasting time \"syncing\" and porting...\n\nsorry, you got this totally wrong. One App for One user. Use better design to get the \"silo\" work flow you are correctly targeting."}, {"author_name": "Brian Duffy", "gravatar_hash": "974938b8250a08cf9e22714aff1f9fcc", "author_url": null, "date": "Jul 27, 2009", "message": "At first, I thought the idea of separate sites was a good idea. Then two things changed my mind:\n\n1. The \"not a ____ question, move to ___\" bs, which reminds me of the worst aspects of Usenet.\n2. It's too complicated to tell a colleague about this. \"Hey, that scripting question would be perfect for SO, but it's more of an SA thing, so go to SF\". Sounds like a DMV procedure.\n\nSF doesn't pop up in Google when you search for topics like RAID 5 vs. RAID 1 (which get beat to death), so you need word of mouth for the Super User and Server Fault to grow. That's not going to happen if its complicated."}, {"author_name": "Kieran", "gravatar_hash": "c9585750ee6da26be98b47aeea025e2b", "author_url": null, "date": "Jul 28, 2009", "message": "When can we have an Ubuntu or a least a Linux site?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 28, 2009", "message": "> I am one person, I should have one account (you got the open Id part, but then you in a funny way broke it!).\n\nYou do -- visit the \"accounts\" tab on your user page. One person, one login. Click \"copy\", bam, done."}, {"author_name": "Aaron Seet", "gravatar_hash": "3c4fe77ab5bf8851c0dd7da1b3d3960c", "author_url": "http://icelava.net", "date": "Jul 28, 2009", "message": "you have something against skiboarders, Jeff? ;-)"}, {"author_name": "Treb", "gravatar_hash": "99d0f53250cb1c2e289a6751274af9e3", "author_url": null, "date": "Jul 28, 2009", "message": "So now that we have the trilogy, you are thinking about a couple of prequels, right? (Meta is more like a 'making of'). Sounds ok to me (although I didn't like the prequels very much). By the way, I'm still waiting for Leia in a bikini..."}, {"author_name": "Jack M.", "gravatar_hash": "9ecd2f59de5e03ba481723637fc74fad", "author_url": "http://stackoverflow.com/users/3421/jack-m", "date": "Jul 28, 2009", "message": "I have a bit of an odd position on this subject, that doesn't seem to have been shared so far.  It comes in two parts:\n  1.  I have to agree with TheTXI in regards to a public API.  I would love to be able to make the \"mashup\" portal for all the sites.  But right now, HTML parsing?  ew.\n  2.  I feel that the inability to search all of the sites in a targeted search is a limitation.  For example, go to all three of main sites, and search for [vim].\n      - Stack Overflow has 666 questions (good timing!).\n      - Super User has 11 questions.\n      - Server Fault has 17 questions.\n  How can I search all of these sites?  Google will work, but I cannot say \"only show me SO/SU/SF questions\".  Something as simple as a \"Search The Stack Exchange Network\".  If it worked with tag searches and keyword searches, I'd be more than satisfied."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Jul 28, 2009", "message": "Jack M:\n\n\"How can I search all of these sites? Google will work, but I cannot say “only show me SO/SU/SF questions”. Something as simple as a “Search The Stack Exchange Network”. If it worked with tag searches and keyword searches, I’d be more than satisfied.\"\n\nSure you can. http://www.google.com/cse and set yourself up a custom search engine which you can then define exactly what sites to search for whatever you want."}, {"author_name": "Dillie-O", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://dillieodigital.net", "date": "Jul 28, 2009", "message": "Okay, +10 to The TXI on custom google searching.\n\nIf anybody doesn't want to bother with the time, I went ahead and made one public. I'll see if I can pretty up the  URL and such, but you can currently find it here:\n\nhttp://www.google.com/coop/cse?cx=004055899985439311584:twnxsyrgj4a"}, {"author_name": "Peter Boughton", "gravatar_hash": "e915239e11bb00291ce4e4b17b83bc66", "author_url": "http://www.sorcerers-isle.net", "date": "Jul 28, 2009", "message": "&gt; You do — visit the “accounts” tab on your user page.\n&gt; One person, one login. Click “copy”, bam, done.\n\nThat's not one account.\n\nIt's a single-event copy of details that needs to be repeated for all sites when profile is changed."}, {"author_name": "Brooks Moses", "gravatar_hash": "361baa67583dc1033f2f3b3c97761c2c", "author_url": "http://notes.dpdx.net", "date": "Jul 28, 2009", "message": "\"Is it really so hard to figure out which community you belong to, and thus, where your question belongs? Ask yourself this: what is your job title?...\"\n\nSo, let's collide that with my use-case last week.  My job title is, effectively, \"programmer\".  I am paid to write programs.  I'd consider myself part of the StackOverflow community if I'd actually gotten around to being part of it at all.\n\nThe Windows machine I'm using crashed with a disk error; non-bootable disk, but I could pull files off it.  I wanted to figure out how to pull some settings entries out of the registry to recreate them on the new install on the new disk.\n\nI think it's pretty clear that the question of how to do that belongs on ServerFault (or maybe SuperUser), and that's where I found appropriate answers already written, regardless of the fact that I'm a programmer."}, {"author_name": "Chris", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.shrinkrays.net", "date": "Jul 29, 2009", "message": "Can somebody photoshop the top 7 SO users by reputation (Jon Skeet's face onto Superman) onto that comic, just to make me chuckle!"}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Jul 30, 2009", "message": "The most relevant reason, for me, is that on the busy sites a question only stays on the front page for 10-15 minutes.  If they were all combined then a question would stay there for fewer than 3 minutes.\n\nMany question answerers hang out ont he front page, so less face time means fewer (and possibly poorer quality) answers...\n\n-Adam"}, {"author_name": "james", "gravatar_hash": "d641bb93da41dd75b5c863217e3601f2", "author_url": null, "date": "Jul 31, 2009", "message": "I guess I don't really have a problem with multiple sites as long as it is clear where each question goes, but what is not cool is pushing question on the non-beta sites to beta-only, invite-only sites, the same point remus mentioned, which bit me today."}, {"author_name": "Peter Boughton", "gravatar_hash": "e915239e11bb00291ce4e4b17b83bc66", "author_url": "http://www.sorcerers-isle.net", "date": "Aug 01, 2009", "message": "Chris - done!\n\nHad to use non-SO images for Joel and Greg, but everyone else's fit well enough.\n\nhttp://www.100-geek.net/article/the_stack_overflow_league_of_justice.html"}, {"author_name": "P Daddy", "gravatar_hash": "13d0dfe5c8b53a2e617af0725fb83d0b", "author_url": null, "date": "Sep 03, 2009", "message": "Jeff, you seem a bit grumpy about this.  It seems *ridiculous* to you that someone with an interest in one arena of computing would have an interest in others.\n\nSurely, one who uses StackOverflow would *never* be interested in meta.stackoverflow.com.\n\nAnd just whom do you suppose the \"super heroes\" on SuperUser will be?  Surely the intelligent, helpful folks on SO who spend their time giving advice to developers (for free) wouldn't be interested in spending their time giving advise to users on SU, would they?  Perhaps only users should give advise to users.  Blind leading the blind, and all that.\n\nLike it or not, your family of sites *with a relatively common interest* has an overlapping set of communities.\n\ncaptcha: \"Leslie moodier\".  Now, if only it had said \"Jeff moodier\"."}, {"author_name": "Wayne Bloss", "gravatar_hash": "770a1f4797cc0879dd9e4954104767b1", "author_url": null, "date": "Jan 04, 2010", "message": "Dear Jeff and Joel,\n\nThis is brilliant! Since people can't decide what \"category\" to post a question to, let's make one site per category.\n\nThat way, we solve the problem of choosing a category! Now, what about this new problem: Which site do I post this question to?\n\nLoL"}, {"author_name": "Nicholas Paldino [.NET/C# MVP]", "gravatar_hash": "1b2b5d5007262ea3f9e21ab5b15f8b75", "author_url": "http://www.caspershouse.com", "date": "Mar 01, 2010", "message": "Actually, <a href=\"http://en.wikipedia.org/wiki/Amazo\" rel=\"nofollow\">Amazo</a> has the powers of the entire Justice League, but he always gets beat, so it's a bad example."}, {"author_name": "Naveen Garg", "gravatar_hash": "f9c8dda1cc37ce718e355ef148d287aa", "author_url": null, "date": "May 08, 2010", "message": "Now that SE2.0 aims to grow, its time to revisit the question of how to have more communities, but be able to use them more efficiently: http://meta.stackexchange.com/questions/6068/how-about-tag-specific-reputations-and-tag-specific-communities"}, {"author_name": "Andy Ortlieb", "gravatar_hash": "c0e20a575a8aa323cf62c319ffd8fba0", "author_url": null, "date": "Jul 14, 2010", "message": "I have to say, I'm still not convinced.  I think that you could divide one website into sections for programming, operating systems, etc... and REQUIRE such sections upon submission of a question.  It would be easy for a user to stay within the confines of whichever section is most true to their culture. And users who prefer multiple sections should have to select those sections just as they select their interesting tags. I really enjoy both serverfault and stackoverflow, so I would select both sections, and start browsing questions instead of aggregating somehow as an afterthought."}, {"author_name": "Bob", "gravatar_hash": "d3dd7663ccd7713f12912cba76bb857f", "author_url": null, "date": "Nov 10, 2011", "message": "The problem with analogies is that they are like apples and oranges; you can almost always make them sound good, but frankly the conversation is full of logical fallacies unless you're talking about fruit.\n\nThe \"precedent\" here seems... Bland, to me. If someone were to say \"Look at all these generic sites that died!\" against \"Now look at all these specific sites that survived!\" I would agree (and maybe that's the case, I didn't gather much from a bunch of images of site names); however saying specific sites exist could easily be countered by saying generic sites exist. \n\nIf the community truly has shown pragmatically that specificity is the best way, then sure why not? However this particular argument/appeal just seems watered down. \n\nanswers.yahoo.com is arguably more popular than StackExchange is; now let me find a picture of a pig in boots :)."}, {"author_name": "Bob Bobson", "gravatar_hash": "820d0e4ee14e986a44d33782ca852f51", "author_url": "http://www.org/", "date": "Jun 16, 2012", "message": "&gt; Which one has which power, and should be used to fight which enemy?\n\nThe point about the superheroes is *not* ridiculous. Obviously subdividing is good, but it has it’s downside too. Just look at all the migrations. Some are silly, but many are due to it not being obvious which site a question belongs on. Take mod-rewrite-rule question for example. Jeff himself used it as an example of a type of question that can fluctuate depending *on the asker*!\n\nPlus, it’s annoying to have to create a new account on a site just to ask one question and probably never use that site again. Google lets you create a central account and use that on all of its sites."}]}