{"response": [{"author_name": "Andrew", "gravatar_hash": "980fe8340a6d455c77c13ed357851476", "author_url": "http://www.andrew-g-johnson.com", "date": "Jan 06, 2009", "message": "So no rep (obviously) and no top of the list status (WTF?!)\n\nSo basically this just turns the background green?"}, {"author_name": "Sander Versluys", "gravatar_hash": "6a2edc913e801a2e6579d7a9a0356b4d", "author_url": null, "date": "Jan 06, 2009", "message": "I can understand that no reputation is earned but why shouldn't you show the answer to your question on top of the list. If that is the answer then people would want to see it below the question, don't they?\n\nI see, you want to prevent abuse, but implemted this way it's pretty useless."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 06, 2009", "message": "You're joking, right?\n\nSeriously, we went into all this in the previous comments. Please read 'em!\n\nhttp://blog.stackoverflow.com/2008/11/why-cant-i-accept-my-own-answer/"}, {"author_name": "friol", "gravatar_hash": "6b1453411bcd242378a7e7cc392cb40e", "author_url": "http://datunnel.blogspot.com", "date": "Jan 06, 2009", "message": "FINALLY! \nThanks, and now how about fixing the \"did you consider making an accepted answer\" thingie? :) An \"x\" (dismiss) on the right would be great."}, {"author_name": "Gavin", "gravatar_hash": "9a382f89bcb948a8318c3edeeada7449", "author_url": null, "date": "Jan 06, 2009", "message": "Thanks! And extra kudos to Jarrod. I know you were dead set against this one Jeff so good on you for listening and changing your mind."}, {"author_name": "Bruce Atkinson", "gravatar_hash": "0c241cebbad2e93625acc181329223cc", "author_url": null, "date": "Jan 06, 2009", "message": "The answer should end up at the top.  Sometimes the highest voted answer is just plain wrong.  A lot of people can agree on an answer that is wrong.  For example maybe the highest voted answer uses an undocumented function/feature.  The correct answer may not be as popular but allows you to solve the problem without using an undocumented function.  I like to see the accepted answers under the question and I don't care who answered it.  I believe you actually talked about this on your podcast a long time ago and the discussion went along the line that it wouldn't be a problem because the highest voted community answer would be right below it."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Jan 06, 2009", "message": "Can anyone accept their own answer, or is there some amount of rep that is required?  I think a somewhat high rep limit (say, 500?) would prevent gaming as well."}, {"author_name": "Andrew", "gravatar_hash": "980fe8340a6d455c77c13ed357851476", "author_url": "http://www.andrew-g-johnson.com", "date": "Jan 06, 2009", "message": "@Jeff Atwood, I don't want to read 53 old comments :( I just don't understand what happens when you accept your own answer other than the background changing colors and there being one less \"suggestion\" to accept an answer on your ptofile"}, {"author_name": "Tim", "gravatar_hash": "39a69312c168c765823ad02d46341de9", "author_url": "http://blog.stackoverthrow.com/", "date": "Jan 06, 2009", "message": "Thanks for adding this."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 06, 2009", "message": "Apparently you can still get badges from accepting your own answers. I just got an Enlightened badge and the only thing it could be is my recent acceptance of one of my answers to my own question."}, {"author_name": "Rob", "gravatar_hash": "29d4625b3e15ecef1ff05565fbfacd58", "author_url": null, "date": "Jan 06, 2009", "message": "I have a question in regards to accepting your own answers - awhile back you stated in one of the podcasts that you envisioned StackOverflow also acting as a bit of a programmers notebook. In the spirit of that I entered <a href=\"http://stackoverflow.com/questions/73971/using-javascript-how-do-i-make-sure-a-date-range-is-valid\" title=\"Using Javascript, how do I make sure a date range is valid?\" rel=\"nofollow\">this question and answer</a>. \n\nSo here's my question (or rambling thought), when entering a notebook style question/answer, shouldn't the solution that you came up with be docked to the top of the question? Or, perhaps in the same vein as what people have been saying in regards to some of the community answers not being the answer that is implemented, perhaps a second type of answer acceptance is needed; namely, an implemented answer. This means you could have an accepted answer (the best one, worth 15 points) and a possible second implemented answer (the one that is actually used, worth 5 points). This way people could give credit to the answers that get the \"that's neat\" response, but also give credit to the ones that they actually use."}, {"author_name": "Shog9", "gravatar_hash": "28530499e58e634ac9f004d389463e23", "author_url": "http://www.shog9.com/", "date": "Jan 06, 2009", "message": "Great. More temptation. Just what i needed..."}, {"author_name": "Joe", "gravatar_hash": "1110c2bdb3b7be8380de211e85fefdb3", "author_url": "http://nofouls.com", "date": "Jan 06, 2009", "message": "Thanks Jeff I like it!"}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Jan 06, 2009", "message": "Accepting one's answer should have been done long time ago. I post a question. I get replies which didn't solve my problem. I spend hours trying to solve my problem. I find the answer. I post the answer. I can't accept my answer!? I wanted this to be at the top list of replies. \n\nAt least it has a different green background. So from now on, to save time, I can look for the green box to ge the right answer, regardless where it is in the list. Finally somehing that works better."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 06, 2009", "message": "> Finally somehing that works better.\n\nAfter months of making things worse, we've finally succeeded! Thank you Abdu!\n\n> I just got an Enlightened badge and the only thing it could be is my recent acceptance of one of my answers to my own question.\n\nYep, this is fixed now. Note that since the badge count is now greater than it's supposed to be, you *won't* get your next enlightened badge, as it'll just increment the count -- you effectively got the badge in advance."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 06, 2009", "message": "Not exactly related to the topic at hand, but are you playing around with the recycling of old questions? (making them appear on the front page without activity)\n\nI ask because I saw this on the front page:\nhttp://stackoverflow.com/questions/5649/x86-assembly-on-a-mac\n\nBut when I went into the question I didn't see any recent activity. It's possible someone posted an answer and deleted it, but that seems a bit unlikely.\n\n(when to visit the topic now, you'll find some recent activity, but that happened after I noticed it on the front page)"}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 06, 2009", "message": "(that's \"when you visit\", not \"when to visit\", sorry)"}, {"author_name": "Jeremy Young", "gravatar_hash": "2e1cad7b366c0fe9450e54f7099acb5a", "author_url": "http://wirelesscranium.blogspot.com", "date": "Jan 06, 2009", "message": "How about the following compromise?\n\nWhen you accept your own answer:\n- The answer is marked as accepted in green\n- You get no rep\n- The answer floats to the top\n- Any future upvotes for that answer AFTER YOU HAVE MARKED IT ACCEPTED don't affect your reputation.\n- Future downvotes could still count to prevent gaming.\n\nThis seems like a balanced solution.  I agree with others that leaving the accepted answer amongst all the noise of the other answers is pretty useless.  At a minimum you need a link to the accepted answer at the top."}, {"author_name": "Code Slave", "gravatar_hash": "9b5b69a29967dc41d5ddfdee09b27b73", "author_url": null, "date": "Jan 06, 2009", "message": "Finally!!! Now ALL my questions have and accepted answer.\n\nI can totally accept it not being pegged to the top. It gives others the option of trying to change your mind. Although, maybe you could peg it into the top two."}, {"author_name": "jjnguy", "gravatar_hash": "ddf71a8fc52a01e1ad726ee70b6e2a03", "author_url": null, "date": "Jan 06, 2009", "message": "Yay!!!  Now all of the sofaq-official questions I asked can have real answers.\n\nThanks!"}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": "http://www.titlech.net", "date": "Jan 06, 2009", "message": "Thanks Jeff for listening to us and having an open mind.  I think this gives a tangible benefit."}, {"author_name": "namedun", "gravatar_hash": "deb7438ddf88c2a61ff3114a9db803f6", "author_url": null, "date": "Jan 07, 2009", "message": "Because going green is all the rage right? This feature request was about the color of the post you wrote right?\n++Jeremy Young's idea\nIn the meantime, I want you to imagine the funoverflow fork that would be around if you were actually a fan of open source having yet another bunch of satisfied customers."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Jan 10, 2009", "message": "Ok Jeff.. I didn't mean everything on SO is wrong! SO is a great site.\nIt was about the accepted answer issue.\n\nI had suggested on UserVoice that the answer which I accept, whether my own or another person's, should be at the top of the answer list instead of the one which got the most votes. It's the one that worked.  It should top the answer which got the most votes and which didn't help any.\n\nYou declined it.\n\nWith the green box, now my accepted answer has more visibility. That's what I meant by something that finally works better.\nSo now if a user has no time to read all the answers, they can go directly to the green box.\n\nThere's a chance that an answer which got a lot of votes could be wrong. Just because it's the most obvious generic answer like suggesting to reboot the computer, people voted it up. Rebooting didn't help. Someone suggested modifying some odd registry key which solved the problem and it got 0 votes. Because no one thought about it or no one came across this particular issue.\n\nDon't you think the 0 vote answer is the one that matters to the poster the most and which could have saved his day and not the one that got the most votes?"}, {"author_name": "[ICR]", "gravatar_hash": "48a02e16370caadaedff78e2a94656ce", "author_url": "http://www.morethannothing.co.uk", "date": "Jan 12, 2009", "message": "Great, now all we need is to be able to downvote our own responses ;)"}, {"author_name": "Joel Bushart", "gravatar_hash": "14a02d67d56f1209fcfb364fccff1949", "author_url": null, "date": "Jan 12, 2009", "message": "I Think you should get a badge for answering your own question.\n\nOne of the following:\n\nBoneHead moment (I just wasn't paying attention to my code due to stress, exhaustion, or imbibing to many substances)\nLMGTFY [Let Me Google That For You](I asked this before I looked anywhere for an answer)\nBadHack (I have no idea why I was trying this overly complicated way of doing it)"}]}