{"response": [{"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Jan 24, 2009", "message": "Jeff I think you should just call yourself a realist, it is not possible for the health/sanity/disk of site for us to keep everything that is submitted, however to just delete everything that doesn't fit inside x,y parameters would remove the community element from the site and, at least for me, make it a hell of a lot less interesting.  Personally I think the community, not nesicarily the Questions is the reason SO works, I like to try to get my answers up-voted higher then Jon Skeet."}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309", "date": "Jan 24, 2009", "message": "Jeff, does that mean that you will finally close http://stackoverflow.uservoice.com/pages/general/suggestions/40744-please-restore-question-210155 (which was in essence similar to Nunciato's mail, albeit 3 months earlier) ?\n\nI do not mind the delete/undelete debate, but it might be better to add a little more \"closationism\" to the uservoice part of SO too ;)\n\nI also like to point out close (and then potentially delete) a question (like this fun one: http://stackoverflow.com/questions/471929), is not the only alternative. \nI did put an entry in uservoice for that: \"wiki/un-wiki\" http://stackoverflow.uservoice.com/pages/general/suggestions/108477-add-wiki-link-to-vote-for-a-question-to-be-wiki"}, {"author_name": "Paul Dixon", "gravatar_hash": "8842c3a6f5890f029928ad60602e79f5", "author_url": "http://blog.dixo.net", "date": "Jan 24, 2009", "message": "Another option which you really should offer is the ability to \"disown\" rather than delete a question, perhaps making it owned by the \"Community User\"\n\nThis is something that a user could request, given that we appear to be granting a cc-by-sa licence on our submissions (see http://stackoverflow.com/questions/403236/does-stackoverflow-own-the-content-i-post#403260)"}, {"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Jan 24, 2009", "message": "@Paul Dixon, thats what the wiki box is for, when in wiki it is \"owned\" by the Community User and can be freely edited by anyone without any rep (gain or loss) to the OP or any editors."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Jan 24, 2009", "message": "Hm, I think I'm more of a delusionist... :D"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Jan 24, 2009", "message": "@Arron, it's still possible to see who originally posted wiki questions &amp; answers, and the OP would have them listed on their user page. A way to disown a post you no longer wanted to be associated with would be useful. \n\nWe've already had requests by users to be disassociated with content they have posted: http://stackoverflow.com/questions/468303/are-taglines-signatures-disallowed-on-stackoverflow"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Jan 24, 2009", "message": "Hmmm... When do we get a big ol' \"Master List of Deleted and Closed Questions\" so that a serious house-cleaning can begin..."}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jan 24, 2009", "message": "Nice CSS error in your example image. ;P"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Jan 26, 2009", "message": "&gt; Let me be clear: deletion isn’t something we seek out, but we believe it’s necessary.\n\nI think this is something we should all take away from this post.  There are a few users who seem to be roving the site looking for things to close and delete.  You don't have to reach your quota every day.  You can simply ignore things that are only tangentially programming related or subjective, but leave them there for the rest of the community."}, {"author_name": "David HAust", "gravatar_hash": "42c6731377cc670ecc89cbf64e0a780c", "author_url": null, "date": "Jan 26, 2009", "message": "+1 for Paul idea of OPs being able to 'disown' a question.  But instead of just switching the question to 'wiki' mode, you could enable a user to completely remove their name from the questions history.    So if another user expanded the edit history, it would just show the OP as ‘anonymous’.  This means we don’t lose valuable info and the OP gets to not be associated in any way with the question."}]}