{"response": [{"author_name": "Steve", "gravatar_hash": "876a361a89a1cbd25917245398c9ab79", "author_url": "http://SteveSmithBlog/", "date": "Jan 25, 2009", "message": "Congrats!  I know you're happy to be done with the technical issues and eager to see these things in action!"}, {"author_name": "Nidonocu", "gravatar_hash": "b98d59fb348768a39eeff3b45e7fcbc5", "author_url": "http://www.codeplex.com/amuse", "date": "Jan 25, 2009", "message": "Here's to many more!\n\nDo we throw the bottle of champaign against them before or after they are in the rack?"}, {"author_name": "Rob Burke", "gravatar_hash": "429329df3c7c21e2a9f156a808c1fab0", "author_url": "http://robburke.ie", "date": "Jan 25, 2009", "message": "Fair play Jeff, I would've thrown them against a wall weeks ago in despair! Love the quote as well, have you decided on a switchover strategy since the brief discussion of it on the podcast?"}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Jan 25, 2009", "message": "Can't wait to experience these server when using SO and so I guess these server are for the community...\n\nThank you Jeff :)"}, {"author_name": "Ralph Whitbeck", "gravatar_hash": "93533aa927a1c348f12903b5ba65aa80", "author_url": "http://damnralph.com", "date": "Jan 25, 2009", "message": "Aren't servers fun? We launched a new site for a major university on 3 servers running vmware with 10 virtual servers and a SAN for storage.  There was redundant everything.  Even though I was the lead programmer and was responsible for the code I learned more about servers and SQL server then I ever had in helping set up the servers with a person that was qualified to set up servers at the enterprise level."}, {"author_name": "Aidan", "gravatar_hash": "f01d06e6dcd2be5ea4519f97703797d8", "author_url": "http://ajryan.blogspot.com", "date": "Jan 25, 2009", "message": "This tip is probably too late to be of use to you, but maybe it will help out someone else who happens along:\n\nMost servers with 6 drive bays will have a split backplane with each half serving 3 bays. I *highly* recommend splitting the members of each array across the two halves of the backplane. If you have half a backplane fail and you've got your two RAID 1 drives on it, you're hosed. We had almost your exact configuration and this exact thing happened to our VMware ESX server. The ESX kernel miraculously continued performing in memory when its disks disappeared from under it and we were able to shut down the VMs, kernel, and replace the backplane.  I assume your OS will be Server 2008 which I doubt would be as forgiving about losing the ability to read/write to/from the system de"}, {"author_name": "Toni", "gravatar_hash": "e5b919fc4ff042a89c9376dbe4c53c27", "author_url": null, "date": "Jan 25, 2009", "message": "Jeff, you really enjoyed building these :))), BUT what's your (hardware) disaster recovery strategy?"}, {"author_name": "Jarrod Dixon", "gravatar_hash": "2dfa19bf5dc5826c1fe54c2c049a1ff1", "author_url": "http://stackoverflow.com/users/3", "date": "Jan 25, 2009", "message": "I can't wait to crash them!"}, {"author_name": "Sam", "gravatar_hash": "fdf8c5d204252b480b3c6548f50c95b7", "author_url": "http://sam.xnet.tk", "date": "Jan 25, 2009", "message": "When will they go live?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 25, 2009", "message": "> When will they go live?\n\nsometime in Feb, most likely"}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 25, 2009", "message": "Have you determined where the servers will be colocated yet?"}, {"author_name": "cowgod", "gravatar_hash": "b64f6d5b6e0dc9880c030ab90c0fde85", "author_url": null, "date": "Jan 25, 2009", "message": "those are some amazing servers you have there.  thank you for pouring your heart and soul into them--the community thanks you for that.\n\ni'm curious why you didn't go with fun names for the servers though.  i always name my servers after star wars characters.  \"leia didn't back up last night.  i need to go investigate.\""}, {"author_name": "PhantomTypist", "gravatar_hash": "6a7379425ec4e4151f30bc5e086464aa", "author_url": null, "date": "Jan 25, 2009", "message": "Just curious, but how much are you going to be paying for bandwidth with the colocation? (e.g. $/GB)"}, {"author_name": "Kibbee", "gravatar_hash": "2b568071163c0d009635cfa63cf6e6ac", "author_url": "http://www.kibbee.ca", "date": "Jan 26, 2009", "message": "I'd give 1000 of my StackOverflow rep points for a picture of you riding the server, Dr. Strangelove style."}, {"author_name": "Guy Ellis", "gravatar_hash": "d9f2c02c23a3013166710a1d24bca056", "author_url": "http://guyellisrocks.com", "date": "Jan 26, 2009", "message": "What's the monthly cost of hosting them in the rack?"}, {"author_name": "PWills", "gravatar_hash": "57dcebe24f9d0359c214d21c8844c849", "author_url": "http://www.gratisinternet.com/careers/", "date": "Jan 26, 2009", "message": "&gt;&gt;but we felt that the OS needed to be on a separate set of spindles.\n\nActually, and I'm sure Brent would agree, the real perf advantage comes from having the *SQL Logs* on separate spindles."}, {"author_name": "Marshall", "gravatar_hash": "31794e668233b230d25e13687925045c", "author_url": "http://www.cannla.com", "date": "Jan 26, 2009", "message": "Agree with PWills. You will get a lot of mileage having your logs on separate disks from the DB itself. \n\nI'd suggest re-running the sqliosim with the logs on the Windows drives to see if you can get a easy perf gain."}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Jan 27, 2009", "message": "&gt; When will they go live?\n\n6 to 8 weeks - duh. :p\n\nThat's my new answer every time someone asks me when I'll be done."}, {"author_name": "Aaron", "gravatar_hash": "efc7a06f93b76251d63dba00ca33debb", "author_url": null, "date": "Jan 27, 2009", "message": "Good call on running SQLIOSim, I'm glad to see the 7200 SATA drives are working so well. I'm impressed, I wasn't expecting to see that."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 30, 2009", "message": "> 6 to 8 weeks - duh. :p\n\nlol"}, {"author_name": "friism", "gravatar_hash": "7fac8898f9d4ef5afebc4eded763a6b8", "author_url": "http://friism.com/", "date": "Jan 31, 2009", "message": "We were faced with the prospect of building af setup for a .Net site a few months ago and ended up going for EC2 and EBS. I've put together a few reasons as to why that may be an attractive option:\nhttp://friism.com/rent-vs-buy-or-ec2-vs-building-your-own-iron"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 13, 2009", "message": "This is for my own notes, mostly..\n\nIf we enable write-back cache (it's battery-backed) on the ServeRAID 8k controller, we get I/O blocking under heavy write activity. This is totally repeatable when restoring or taking database backups, which write gigs of data to the disk very rapidly.\n\nSwitching to write-through fixed this completely, at the cost of some performance.\n\nHowever, we were still seeing some rare I/O timeouts, about two per day. They weren't horrible, but they did block queries on the site for up to 30-60 seconds. I did some research and found this IBM service note:\n\n--\nhttp://www-947.ibm.com/systems/support/supportsite.wss/docdisplay?lndocid=MIGR-5071075&brandind=5000008\n\nAs an interim solution, the \"PHY Rate\" can be changed from 3.0 GB to 1.5 GB within the Adaptec Configuration Utility (ACU) of the ServeRAID-8k.\n--\n\nI saw that our backplane firmware (backplanes have firmware??!) is 1.06. So this fix is not in effect for us. I verified in the ServeRAID manager that the drives were indeed operating at 3.0 GB/s (SATA II) rates.\n\nGeoff went down to the data center and, via the RAID BIOS switched every drive to 1.5 GB/s (SATA I) rates. We've gone one full day now without a single I/O error, so I think this worked!\n\nAny performance impact should be minimal, on the order of 1% or so, since a) RAID controllers typically disable hard drive cache, and b) there's no way any individual drive can read or write data to its magnetic platters at 1.5 GB/sec much less 3.0 GB/sec."}, {"author_name": "Duff", "gravatar_hash": "974938b8250a08cf9e22714aff1f9fcc", "author_url": "http://www.dufftech.net", "date": "Feb 17, 2009", "message": "Just out of curiosity... was there any particular reason that you were drawn to Lenovo servers? \n\nI actually wasn't aware that Lenovo was licensing IBM servers in the first place. We're dissatisfied with our current server vendor and are getting ready to test the waters with some others. \n\nIBM has a huge local field presence around here, since several big government agencies have standardized on xSeries hardware. I've found that IBM is difficult for and SMB to deal with, however... is Lenovo any better?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 19, 2009", "message": "Still having some I/O issues under very heavy load.. smells like driver issue to me.\n\nWe just \n\n- updated the backplane firmware to 1.07. This is theoretically exactly the same as manually changing the SATA data rate from 3.0 to 1.5 GB/sec, but we figured we might as well update to latest and greatest.\n\n- got a new driver dated 3/3/09 from Adaptec, via the standard Windows \"update driver\" dialog. This is much much newer (at least 1 full year) than the driver that was on the ServeRaid 9.0 CD..\n\nHopefully this knocks out the intermittent I/O timeout problems, because it's really starting to piss me off."}, {"author_name": "Roger", "gravatar_hash": "91d44924a8c169c7205d6e7d52bddd2c", "author_url": null, "date": "Mar 19, 2012", "message": "Why not use Azure instead of the head ache of running your own machines ?"}, {"author_name": "Gratis internet", "gravatar_hash": "fbbaefb643694a33aeb31e9a5e5f7ad4", "author_url": "http://www.gratisinternet.org", "date": "Apr 11, 2012", "message": "Great info here... keep up the good work... will be back again <a href=\"http://www.gratisinternet.org\" rel=\"nofollow\">gratisinternet</a>"}]}