{"response": [{"author_name": "Sam", "gravatar_hash": "fe24cd0eaa2ff78a42b265fafec55565", "author_url": null, "date": "Jan 29, 2009", "message": "Awesome! Thanks guys. Keep it up."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Jan 29, 2009", "message": "Excellent stuff Jeff, there are exactly the kinds of widgets that are really going to make SO stand apart from all the other Q&amp;A sites!!\n\nHowever you should go take a look at this issue with the new activity tracker:\n\nhttp://uservoice.stackoverflow.com/pages/general/suggestions/111952-new-recent-feature-crashes-ie-on-64-bit-ws08\n\nIt's a bit of a showstopper for those of us who still like to snuggle up to IE7 :)\n\nAll the best\nKev"}, {"author_name": "Andrew", "gravatar_hash": "b873b1a5199eeefff7a7c1531f02324a", "author_url": "http://www.fatlemon.co.uk", "date": "Jan 29, 2009", "message": "Can I just say...   SWEET  :o)"}, {"author_name": "Guy Incognito", "gravatar_hash": "d1ae244b87537bd28a75540ebb7a1270", "author_url": null, "date": "Jan 29, 2009", "message": "Impressive stuff - thanks!"}, {"author_name": "Motti", "gravatar_hash": "6183c6f9d621a125cd3aa0f7ae324285", "author_url": null, "date": "Jan 29, 2009", "message": "Sadly this breaks the Yahoo! pipes that people created in order to be create RSS feeds for responses(*) and since this page is private no such pipe can be created (could this be on purpose...).\n\nJust a matter of interest, if this page is private why does the URL specify the user-id? (http://stackoverflow.com/users/recent/XXX)\n\n(*) http://stackoverflow.com/questions/404882"}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Jan 29, 2009", "message": "If I click on it, ie7 crashes :S\n\nAm I the only one?"}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Jan 29, 2009", "message": "Oops, hadn't seen Kev's comment, sorry"}, {"author_name": "DrJokepu", "gravatar_hash": "973c6e2cf1ae9f6615dd883eb14597b1", "author_url": null, "date": "Jan 29, 2009", "message": "Great stuff, well done!"}, {"author_name": "gamecat", "gravatar_hash": "0b4b433679e1fb52f7e2ef4ea492496d", "author_url": null, "date": "Jan 29, 2009", "message": "A verry big WOW!\n\nThe entire team just earned 10.000 Geek points.\n\nI'm no fan of the bounty system but this was what I always wanted but where to afraid to ask."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Jan 29, 2009", "message": "It works pretty well for me, but it still misses one important case:\n\nLet's say I comment on someone else's question or answer, possible asking for additional information.  They'll see that in their responses and most likely eventually reply.  But I'll never get any notification about when they replied.  If I don't go back and keep checking the conversation died there, and the question likely remained unanswered."}, {"author_name": "Alex Angas", "gravatar_hash": "150413748d6f503b2109cca74746f129", "author_url": "http://alexangas.wordpress.com", "date": "Jan 29, 2009", "message": "Juan: I have the same problem with clicking the envelope crashing IE7, for me under WinXP 32-bit. The 'More Information' link on the crash dialog redirects to a page stating \"This problem was caused by Windows, which was created by Microsoft Corporation. There is no solution for this problem at this time.\" :-(\n\nThe one time I did see the page when it first went live, the layout looked a pretty screwy with text cut off in several places. In face I'm noticing this with a few SO pages now under IE7. If this isn't happening already, can the SO team please check that the new features work under all of the common browsers before putting them live? Thanks."}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://pro.robspages.net", "date": "Jan 29, 2009", "message": "Works just fine in IE8 on Win7. Thanks for the great feature guys."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Jan 29, 2009", "message": "Did you change how interesting/ignored tags are being highlighted?  It now appears that if a question is tagged with a word that contains as a substring a tag that I want to ignore or that I find interesting, the question is highlighted.\n\nFor example, if I have \"java\" flagged as interesting, any question tagged \"javascript\" is now also showing up highlighted yellow (orange?).  This isn't too big a deal until you take into account that someone might have \"c\" flagged as either interesting (as I do) or to ignore.  Almost every question now shows up highlighted for me.\n\nI added this to uservoice if anyone has anything to add.\nhttp://uservoice.stackoverflow.com/pages/general/suggestions/112038-tag-java-flagged-as-interesting-also-flags-javascript-"}, {"author_name": "Craig", "gravatar_hash": "e78bca1e19270e988366b8dc13e7fdb4", "author_url": null, "date": "Jan 29, 2009", "message": "Clicking the mail icon in IE7 causes crash with error:\n\n\"SysFader: iexplorer.exe - Application Error\"\n\n\"The exception unknown software exception (0xc0000005) occurred in the application at location (0x4340d214)\""}, {"author_name": "Sean Ennis", "gravatar_hash": "9b5b69a29967dc41d5ddfdee09b27b73", "author_url": null, "date": "Jan 29, 2009", "message": "*egads!!!*\n\nTo be positive, I'll start of with what I like.\n* I like the ability to filter on time ranges.\n* I like the summary of activity at the top\n\nI dislike:\n* The 14 day limit on the range. How much of a performance hit is 6 months or a year of activity (for everyone but Jon Skeet)\n* The the one day default for the range; give me a couple of days of history at least - I haven't done anything yet today to report on.\n* The size of the times on the left (even in that soft grey it is a little in your face)."}, {"author_name": "Jason Baker", "gravatar_hash": "9778f2a6432262a59c6f7a2f96b33f90", "author_url": "http://jasonmbaker.wordpress.com", "date": "Jan 29, 2009", "message": "Pedantic question time:  Where is that screenshot from?  It shows Jeff has ~8k reputation when you have ~11k rep."}, {"author_name": "Andy V", "gravatar_hash": "d6901d5b97675e18641b19a4347b1383", "author_url": null, "date": "Jan 29, 2009", "message": "Is this why stackoverflow pegs the cpu on my browser when looking at a question?  This is on an old mozilla, but it still does it to a lesser degree on a recent firefox.  The page appears static, but the browser is definitely working on something..."}, {"author_name": "Cade Roux", "gravatar_hash": "d45ef03e9450599588bf733662f792e5", "author_url": "http://www.semicolon.net", "date": "Jan 29, 2009", "message": "Crashes on IE6 too (work restriction)."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Jan 29, 2009", "message": "SO Build 2334 - codename: \"Vista\" ? ;-)"}, {"author_name": "Lance Roberts", "gravatar_hash": "576cdd58ab7df19c6715121c7806bbf6", "author_url": null, "date": "Jan 29, 2009", "message": "It crashes my IE6 with the following message:  \"An unhandled Win32 exception occured in iexplore.exe[2260].\""}, {"author_name": "Jon B", "gravatar_hash": "c60d994d29c63ea5d83702924b935461", "author_url": null, "date": "Jan 29, 2009", "message": "Crashes IE7 on Vista."}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Jan 29, 2009", "message": "This is a useful feature, thanks.  However, the changes to the user recent activity page don't display properly in Opera (I've raised this at User Voice)."}, {"author_name": "Brian Kim", "gravatar_hash": "ad6affab83aa54172fd6ee17ab5da287", "author_url": "http://devbk.com", "date": "Jan 29, 2009", "message": "To solve the problem Joel Coehoorn points out, we would need \"reply\" feature to comments creating threaded comments. Twitter-like reply would work I think."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Jan 29, 2009", "message": "@Sean: The default time period is annoying for me too, but in the other direction. I typically only want to see *today's* activity, not today + yesterday.\n\nI don't know whether the best fix for this would be a user option, or just remembering the last period you looked at."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Jan 29, 2009", "message": "I'd also argue that this ought page ought to contain *everything* I want to see about myself: both the existing stuff and everything that's currently on the user profile page.\n\nIn particular I don't like having to switch between the two to see what I've recently done (answers and comments I've recently posted). It's a UI inconsistency. Basically I think there ought to be a single user profile UI, where some tabs are removed when you're looking at a different user.\n\nHaving said that, this is the first version of this UI and it's already incredibly useful, so good job :)"}, {"author_name": "Jason M Baker", "gravatar_hash": "b8e26b9942e7193a4fe32c407aacfef5", "author_url": "http://jasonmbaker.wordpress.com", "date": "Jan 29, 2009", "message": "&gt; I’d also argue that this ought page ought to contain *everything* I want to see about myself\n\nMore along those lines, it seems as though most of the newer features we're seeing are more focused on showing us what's happened *recently*.  What about the posts I made in the past?  There are times when I want to find that one post I made that one time whose name I can't remember.\n\nBefore, I'd wade through all the answers on my profile, but now I can't do that as that's limited to 100 posts.  Some kind of archive type feature that lets me go back through older posts would be nice."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Jan 29, 2009", "message": "I like this feature.  Good work."}, {"author_name": "Morten Christiansen", "gravatar_hash": "ea47536e95c0a6fff1affa1584b61722", "author_url": null, "date": "Jan 29, 2009", "message": "Am I the only one where the mail icon keeps being reactivated by the same stuff?"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Jan 29, 2009", "message": "What's the difference between answers and answer responses, and comments and comment responses?"}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Jan 29, 2009", "message": "@Jason M - agreed. I have old answers on the site which I've now started to refer to in new answers that are now hard to get at because of some of the decisions taken recently. I can use the rep history page with the graph and set a large date range, but the presentation is somewhat wanting with having all your posts crammed into that tiny scrolling div/panel. Also who knows when that gets clobbered by a 14 or 30 max day range limit?\n\nJeff....why do you make this so hard? Why can't you just give us a paged list of all our past posts (and comments maybe), say 20 per page? The usability score of SO in this respect has taken a bit of a dip. Yes all the fancy MVC/Ajaxy UI toys are very nice and cool, but you're making it harder for us to perform certain tasks such as mine my/other users old content in a systematic way.\n\nKev"}, {"author_name": "ray", "gravatar_hash": "16c337ddb689492848e26040b90bd69b", "author_url": null, "date": "Jan 29, 2009", "message": "So what's going on with the podcast?  Could you please tell us in advance if it won't be posted as normal?"}, {"author_name": "Mark Biek", "gravatar_hash": "040ffc7f3327b05f01c54a8bef3ba60a", "author_url": null, "date": "Jan 29, 2009", "message": "I think this feature is a great idea but I've been getting a lot of false-positives.\n\nI'll come back to the site, the envelope icon will be lit up but my recent page hasn't changed at all."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 29, 2009", "message": "@ray\n\nThe podcast is delayed because Joel was in Germany. This possible delay was mentioned by Joel in the last podcast (#38 at 1:06:40) and confirmed by Jeff on Twitter:\nhttps://twitter.com/codinghorror/status/1158038686"}, {"author_name": "Duncan Godwin", "gravatar_hash": "40c5fca082da05cc17de12ee91be3363", "author_url": null, "date": "Jan 29, 2009", "message": "@ray.  Last week Joel said the podcast may be a little late because he is/was away in Germany."}, {"author_name": "Gishu", "gravatar_hash": "69772f0246d5013d72703967b8761e89", "author_url": "http://madcoderspeak.blogspot.com", "date": "Jan 29, 2009", "message": "Nicely done. Kudos!"}, {"author_name": "Frank", "gravatar_hash": "3eef89c1710742937cc74bf88da9dff8", "author_url": null, "date": "Jan 29, 2009", "message": "Am I the only one who thinks this is the most confusing looking page ever? I mean, big fonts are cool, but using big fonts to display numbers in a million formats that make no sense to me? It's like getting slapped after first being kicked hard in the groin.\n\nSeriously, did we do any reality checks on this page? I do not understand it. I was really looking forward to this feature but all I can do now is shake my head.\n\nNice try. Start over please."}, {"author_name": "David Arno", "gravatar_hash": "31fdbe39c7657652fb5f34cdef2c78c9", "author_url": "http://davidarno.org", "date": "Jan 30, 2009", "message": "My guess is That Jeff and co must really really really hate RSS feeds. I can think of no other reason to waste time producing such a page, whilst continuing to refuse to provide simple RSS solutions to keeping track of comments and answers.\n\nOf course it does occur to me that the problem in delivering RSS feeds to SO users might be because of the decision to use open id, rather than allowing local accounts, making authentication difficult."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Jan 30, 2009", "message": "@David Arno: RSS feeds may well work for responses and badges, but I don't think they'd work for reputation. Personally I really like the information on the new set of pages. I would perhaps like it organised slightly differently, and certainly integrated with the main user profile page, but I definitely like having it there rather than as an RSS feed."}, {"author_name": "Tomalak", "gravatar_hash": "e8a42bc3ef517000a1d4f0f5c94cb0f7", "author_url": null, "date": "Jan 30, 2009", "message": "Getting false positives here all the time. The envelope is highlighted, but no new comments have arrived. In it's current shape, this feature creates more problems than it solves. :-)\n\nI also second Joel's thought (http://blog.stackoverflow.com/2009/01/new-replies-notification/#comment-13421) about a comment reply feature. \n\nOften it comes to the point where one discussion spans two separate answers, because you and the other guy keep copying replies to each others answer to get each others attention. This is unnecessarily wasteful and confusing for third parties. A twitter style reply function could solve this."}, {"author_name": "Tomalak", "gravatar_hash": "e8a42bc3ef517000a1d4f0f5c94cb0f7", "author_url": null, "date": "Jan 31, 2009", "message": "False positives seem to occur less often now (if at all - not sure though)."}, {"author_name": "Tomalak", "gravatar_hash": "e8a42bc3ef517000a1d4f0f5c94cb0f7", "author_url": null, "date": "Jan 31, 2009", "message": "Nah, false alarm. It's still not working at all."}, {"author_name": "Jonik", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Feb 01, 2009", "message": "I also get 'false positives' all the time. And when something does happen e.g. my rep goes up (I see the number has changed) the envelope can be slow to catch up (it still shows \"no replies\").\n\nI too like Joel Coehoorn's idea. It might be also nice to be able to track new activity in any of my favourite questions (where I may not have participated myself), all on the same page. But like others said, thanks for the first version which is already very useful!"}, {"author_name": "Rex", "gravatar_hash": "3e9f1629fd4cb4a5ce9fbd27b13e862d", "author_url": "http://www.rexmorgan.net", "date": "Feb 03, 2009", "message": "I am also getting false positives every few hours or so. No new replies, no rep change, etc. But the little envelope turns orange and I get all excited. Such a letdown :("}]}