{"response": [{"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Jan 12, 2009", "message": "Looks fun, when I had my computer repair shop, a few years ago now, I loved spending entire weeks building workstations and servers."}, {"author_name": "bobby borszich", "gravatar_hash": "8df133fdb1e33c3ea184c7b4fa4b0dfa", "author_url": "http://evilbobby.com", "date": "Jan 12, 2009", "message": "Looks awesome, how long do you anticipate your downtime when switching over? if you are switching the DNS entries don't forget to scale back your TTL times prior to the cut over so it propagates faster once you make the switch."}, {"author_name": "Erik", "gravatar_hash": "d319e446e1cb94d05409a273878e0674", "author_url": "http://erik.labianca.org/blog/", "date": "Jan 12, 2009", "message": "Congrats, I hope they work out for you. Given you've gone the non-HCL route for RAM and drives I would do a TON of testing before shipping them off. \n\nDo the systems have remote-access cards?"}, {"author_name": "matías nino", "gravatar_hash": "7a53888c3d36599e2d8d823269126957", "author_url": null, "date": "Jan 12, 2009", "message": "Looks absolutely delish! It's so nice to actually see some of the server side of the hardware enthusiast world. Can't wait to heard about how these babies perform!"}, {"author_name": "Daryl", "gravatar_hash": "7d799b2ab676fb1549af56a16a47c581", "author_url": null, "date": "Jan 12, 2009", "message": "OK, but what about software costs? SQL Server gets real pricey..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 12, 2009", "message": "http://www.microsoft.com/BizSpark/\n\n\"BizSpark is uniquely designed to accelerate your success by providing fast, affordable access to current, full-featured Microsoft tools and technologies, plus production licensing for hosted solutions.\""}, {"author_name": "Luke", "gravatar_hash": "4d69df831be32d2e5eddbd7afe1d671c", "author_url": null, "date": "Jan 12, 2009", "message": "Just out of curiosity. How much did you need to spend on software licenses on top of all the server hardware?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 12, 2009", "message": "$300 for BizSpark. See above."}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Jan 13, 2009", "message": "Also, how much are you paying for the co-location and how many U's do you get for that?"}, {"author_name": "David Sykes", "gravatar_hash": "0c95a3798d9a008b6c29605b8f15b47a", "author_url": null, "date": "Jan 13, 2009", "message": "How long will the servers last before they are out of date? Hopefully more than two years, or you'll struggle to make the money back.\n\nThen again, add in the fun factor and it's a no brainer"}, {"author_name": "ServerNut", "gravatar_hash": "57f370a7bcbcb6b39f0827353cd5b9e0", "author_url": null, "date": "Jan 13, 2009", "message": "You mentioned that the drives on the web server were mirrored and the db server was raid 10 but I don't see the cost for the raid adapter itemized.  Did you leave that out?"}, {"author_name": "Denis Hennessy", "gravatar_hash": "7f3b24caf0ff6b7ec320c7d125de8059", "author_url": "http://hennessynet.com", "date": "Jan 13, 2009", "message": "Thanks for sharing - very interesting.\n\nDid software licensing represent a big part of the cost or influence the hardware decisions (like, number of CPUs)?\n\nI thought I remember reading that you're running on Windows and SQL Server. Understanding the software costs would also be interesting."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 13, 2009", "message": "> I don’t see the cost for the raid adapter itemized\n\nincluded in both servers as part of the base config.\n\nThe Lenovo RS110 1U's embedded RAID is pretty basic, though (LSI MegaRAID?). I think it only supports cold-swapping. I can eject a drive from the mirror no problem while the system is running, but reinserting it.. results in a bluescreen.\n\nTo recreate the mirror, I have to reboot, go into the RAID BIOS and select \"resync array\" which took 4+ hours in my testing."}, {"author_name": "Stephen Taylor", "gravatar_hash": "3454ee98fcec27e45888f291d90539da", "author_url": null, "date": "Jan 13, 2009", "message": "So, uh what are the hosting costs?"}, {"author_name": "Michael", "gravatar_hash": "f4f4b5a6f27f72b32d42463b1a25e0df", "author_url": "http://stackoverflow.com/users/29/michael-haren", "date": "Jan 13, 2009", "message": "Are all those orange trimmed boxes cooling fans? Holy bejesus that's a lot of fans."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://www.johntopley.com/", "date": "Jan 13, 2009", "message": "Out of interest, who has responsibility for fixing things if it all goes wrong at three a.m?"}, {"author_name": "Eric Z. Beard", "gravatar_hash": "62cc585b9fd3ee7182dadbd09a7f4b47", "author_url": null, "date": "Jan 13, 2009", "message": "Wow, that licensing is an absolute steal!  I've been paying $5k per socket for Sql Server.  Too big to qualify for BizSpark at this point, but it would have come in handy a few years ago.\n\nI'll be interested to see how long this solution lasts.  It's tough to scale a big database on local drives.  Maybe we'll see the DAS/SAN blog entry in about 6 months."}, {"author_name": "Luke", "gravatar_hash": "4d69df831be32d2e5eddbd7afe1d671c", "author_url": null, "date": "Jan 13, 2009", "message": "Hi Jeff, please forgive my stupidity but:\n\n&gt;&gt; $300 for BizSpark. See above.\n\nDon't you need a bit more than BizSpark? Like an OS and a database server or did you already have licenses for that?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 13, 2009", "message": "> who has responsibility for fixing things if it all goes wrong at three a.m?\n\nUs, of course.. me or Jarrod!\n\nWe can call the data center if we need \"remote hands\"."}, {"author_name": "Alistair", "gravatar_hash": "438c91736f20d0821c7a358ee8b00790", "author_url": "http://stackoverflow.com/users/379/geocoin", "date": "Jan 14, 2009", "message": "@stephen Hill\nI presume the Co-Lo costs are the $800 cut in half Jeff mentions in the post, so $4800 per year saving"}, {"author_name": "Jack M.", "gravatar_hash": "9ecd2f59de5e03ba481723637fc74fad", "author_url": null, "date": "Jan 14, 2009", "message": "Do you have the rest of the hardware planned out?  Firewall, switches, etc?  Or is the hosting providing those?"}, {"author_name": "Aaron", "gravatar_hash": "efc7a06f93b76251d63dba00ca33debb", "author_url": null, "date": "Jan 14, 2009", "message": "Jeff,\n\nI've used 7200 SATA before on exchange servers and the Disk I/O killed the server performance.\n\nAre you sure your current production servers are 7200 SATA and not SAS?  I can't image a SQL server running stack overflow can run with 7200 SATA drives.\n\nAaron Wetherhold"}, {"author_name": "Eric Z. Beard", "gravatar_hash": "62cc585b9fd3ee7182dadbd09a7f4b47", "author_url": null, "date": "Jan 15, 2009", "message": "Jeff, I have the same concern as @Aaron above.  It sounds to me like your current hosting provider isn't actually hosting your data on the box that you rent.  It's probably a volume on a high-performance SAN with 10k or 15k SAS drives.  I have been very impressed with the performance of stackoverflow so far (and therefore your ability to tune it), but I have my doubts about your new server.  \n\nYou should gather these performance counters from your production machine (Physical Disk _Total):\n\nDisk Reads/sec \nDisk Writes/sec \n\nGenerally what a storage professional will ask you to do is gather these stats for 24 hours and then dump the counter log to CSV (relog.exe logfile.blg –f CSV –o logfile.csv).  Import that into Excel and look at your totals (Avg, Max and 95th percentile).  Add up reads and writes, which gives you IOPS (I/O per second).  That's the magic number that really matters for storage performance.  I think you might expect to get in the neighborhood of 500 IOPS from your 6 disk array.\n\nYou should know *for sure* before you deploy that a local 7200k RPM SATA array can handle your volume.  I don't think it can, unless I'm drastically underestimating things.  Especially since you're planning the new stackoverflow for sysadmins, which will attract a lot of new attention.\n\nI'm also very curious to know how you will be handling your backups (including off-site copies) now that you will be managing things yourself."}, {"author_name": "Eric Z. Beard", "gravatar_hash": "62cc585b9fd3ee7182dadbd09a7f4b47", "author_url": null, "date": "Jan 15, 2009", "message": "(Just to clarify my estimate above... some people would estimate you as low as 200 IOPS sustained, but there are too many factors involved to know for sure.  I don't think anybody would put you as high as 1000.)"}, {"author_name": "Aaron", "gravatar_hash": "efc7a06f93b76251d63dba00ca33debb", "author_url": null, "date": "Jan 16, 2009", "message": "Eric,\n\nThat is great stuff, thanks for expanding.  I'm in the process of running the calculations on a couple of our servers.  Do have any suggestions to find the IOPS of a raid array.  I know the RPM of the drives, Raid hardware, and the Raid type all combine so there is no easy answer, but is there a rule of thumb or calculation that can be done.\n\nThanks\n\nAaron (looking forward to the hardware side of SO)"}, {"author_name": "Eric Z. Beard", "gravatar_hash": "62cc585b9fd3ee7182dadbd09a7f4b47", "author_url": null, "date": "Jan 16, 2009", "message": "@Aaron,\n\nFor a single disk, take 1/2 spin time + avg. seek time for the IOPS a single drive will give you.  So, fo example, if you fork out $1200 for a new 15k 450Gb SAS drive, an average IO operation will take 5.4ms (wow!).  Divide that into 1000 and you get 185 IOPS.  Multiply that by the number of drives in your array, and you get the theoretical max.\n\nBut then you have to account for RAID levels, and the quality of the machine has a lot to do with the multiplier.  I have seen rough figures of:\n\nRAID 10: 50%\nRAID 5:  30%\n\nBut I have seen SAN vendors claim close to (or even higher than) 100%.\n\nAnd the IOPS are always compared to the 95th percentile of your usage, since your average is too low due to lulls in activity, and max is ridiculously high."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 17, 2009", "message": "> You should know *for sure* before you deploy that a local 7200k RPM SATA array can handle your volume\n\nEr, with 24 GB of memory, I expect disk performance to be largely irrelevant. Our DB isn't that large anyway; it'd probably fit in 4GB of RAM with room left over.\n\nStill, a RAID 10 array of 7,200 RPM drives is not exactly chopped liver. The idea that you need 15,000 RPM drives to have good storage performance is a little ridiculous to me."}, {"author_name": "Eric Z. Beard", "gravatar_hash": "62cc585b9fd3ee7182dadbd09a7f4b47", "author_url": null, "date": "Jan 17, 2009", "message": "Wait a minute, Jeff.  I thought you were adamant about measuring everything?  Just run the perfmon counters and see what you get.  If it's something like 250 IOPS for the 95th percentile, then great, no worries (for now).  But if it's something like 1500, then you're going to have issues.\n\nI was estimating a larger database, so with that much RAM you should do Ok, but there's no harm in tracking IOPS as you grow."}, {"author_name": "tomjedrz", "gravatar_hash": "2bd698effae7c91dc93711e1568a2c72", "author_url": null, "date": "Jan 21, 2009", "message": "Out esteemed host wrote ... \n&gt;&gt; Er, with 24 GB of memory, I expect disk performance\n&gt;&gt; to be largely irrelevant. Our DB isn’t that large\n&gt;&gt; anyway; it’d probably fit in 4GB of RAM with room\n&gt;&gt; left over.\n\nJeff ... this is short term thinking; be careful.\n\nThe database is going to grow exponentially, because the user base will be growing *and* the current users will keep asking and answering questions.  \n\nPlus you will continue to add features which will increase database size or require more CPU to handle.  \n\nI would not be surprised if the user base increases by 50% in the next 6 months, and the database triples.  Does your analysis hold up under those conditions?"}, {"author_name": "Jim Anderson", "gravatar_hash": "1bd6173e0acb78f9769dfff32bbecd5a", "author_url": null, "date": "Jan 28, 2009", "message": "&gt;&gt; As far as I’m concerned performance is a core \n&gt;&gt; feature; we can never be fast enough, and I’m \n&gt;&gt; constantly on the lookout for ways to make pages \n&gt;&gt; load faster.\n\nSpeaking of performance, SO seems to have slowed down considerable the last couple of days. I have tried both from work &amp; home using IE6, IE7, &amp; FF3, but pages are loading much slower than normal for me - navigation is no longer fairly instantaneous - there is a wait every time I click on a link."}, {"author_name": "Chance", "gravatar_hash": "270984ba396d4bd793181115b87dc790", "author_url": "http://www.mortalcreations.com", "date": "Jun 08, 2009", "message": "Jeff - who are you renting rackspace from? I am looking into co-location but all of the hosts I've found won't offer hardware replacement.\n\nThe fact that hosts charge $15 - $40 per gb per month of 2 year old ram is insane to me and I'm kind of tired of dealing with it. I'd much rather drop $3.5k into my own box and just pay for the bandwidth and hardware replacement if it should happen."}, {"author_name": "Dennis", "gravatar_hash": "cb36ce8e7b5ef3a4872bcfc3ac9802fd", "author_url": null, "date": "Jan 02, 2010", "message": "@Jeff\n\n“BizSpark is uniquely designed to accelerate your success by providing fast, affordable access to current, full-featured Microsoft tools and technologies, plus production licensing for hosted solutions.”\n\nThat is only for the period you are not public. You cannot use free licenses for business.\n\n\"Generally, a Startup's participation in BizSpark will end after 3 years or earlier if it terminates its membership or if they're no longer eligible (e.g., go public or are acquired).\n\nAt the end of their program participation:\n• Startups will continue to enjoy the use rights of the BizSpark Program technology offer to develop, test and demonstrate as long as all members of the Startup comply with the End User License Agreement.\n• Startups will no longer have use rights to the BizSpark Program technology offer for production and hosting.\""}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 03, 2010", "message": "\"Go public\" means sell stock and shares, Dennis."}, {"author_name": "Dennis", "gravatar_hash": "cb36ce8e7b5ef3a4872bcfc3ac9802fd", "author_url": null, "date": "Jan 03, 2010", "message": "Thanks for the explanation Jeff. I didn't put it that way; thought that with \"go public\" was meant \"put it live and operational on the internet for the general public\". But your explanation I like more because it does fit much better in what I am heading to. The BizSpark program in this way is much better than our MS Gold partnership where it concerns exploitation of your business."}, {"author_name": "Houda Tahbaz", "gravatar_hash": "34ad728ffad92fbd7ff327ddc6956f26", "author_url": null, "date": "Jul 22, 2010", "message": "May I ask where did you buy Lenovo ThinkServer barebone from? And also CPUs?"}, {"author_name": "jonny rocket", "gravatar_hash": "e7110dd588a418111cd237883b5ba033", "author_url": "http://ms1.gotdns.com", "date": "Jun 26, 2012", "message": "wipe 'em all.  go linux.  all free."}]}