{"response": [{"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 14, 2009", "message": "Joel and I apparently think alike. This suggestion for the IT Stack Overflow name was made before the latest podcast was published:\n\nhttp://blog.stackoverflow.com/2009/01/coming-in-march-it-stack-overflow/#comment-12412"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 14, 2009", "message": "yeah, but \"printer\" in the title is IMMEDIATELY going to cause problems. Mark my words."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 14, 2009", "message": "Yeah, I just thought that it was cool that Joel and I each thought of the same obscure UNIX error message as a possible name for the site. I also suggested \"serveronfire.com\" which, in my opinion, is a good metaphor for an IT emergency. In any case, I look forward to the final selections!\n\nNow for something completely unrelated - would you be up for extending the length of the podcasts? Every time I hear Joel say \"we're almost out of time\" my heart sinks a little."}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Jan 15, 2009", "message": "Jeff,\n\nOne solution to the cold-swap of the web server is to let windows manage the mirroring of the drives.\n\nYou should then be able to do hot-swaps and online rebuilds of the array.\n\nhttp://www.techotopia.com/index.php/Creating_and_Managing_Windows_Server_2008_Mirrored_(RAID_1)_Volumes\n\nCheers\nStephen"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 15, 2009", "message": "Stephen: good idea, but you can't mirror the boot drive last time I checked.."}, {"author_name": "akshat choudhary", "gravatar_hash": "ea32e1d33d0ed1299628c2e49e9c3fc9", "author_url": "http://www.inactiv.com", "date": "Jan 15, 2009", "message": "I believe Alan Kay definitely deserves a special badge and the current scoring system does not do any justice to his presence on StackOverflow."}, {"author_name": "PWills", "gravatar_hash": "57dcebe24f9d0359c214d21c8844c849", "author_url": "http://www.gratisinternet.com/careers", "date": "Jan 15, 2009", "message": "&gt;&gt;Stephen: good idea, but you can’t mirror the boot drive last time I checked..\n\nCheck again?"}, {"author_name": "jason", "gravatar_hash": "64046677f02ebd6fcb9ce23bc7dc74a0", "author_url": null, "date": "Jan 15, 2009", "message": "try this\njavascript:alert(\"Hello World\")\n\ninstead of \nprint \"Hello World\""}, {"author_name": "Jim McKeeth", "gravatar_hash": "e5ca3abec062f8174570a4b1d1c840d8", "author_url": "http://delphi.org/", "date": "Jan 15, 2009", "message": "You need to invite Alan Kay to be a guest next week and then create a \"podcast guest\" badge.  Or maybe just a guru badge.  I bet he would totally be on the podcast though, and you should have his contact information now."}, {"author_name": "Tim Visher", "gravatar_hash": "912d825f5a4a26bb5ab7a9e7ec1d5fe7", "author_url": "http://burningones.com/", "date": "Jan 15, 2009", "message": "Since it's my first time... This has easily become one of my favorite tech podcasts. Yay!\n\nOK, that's out of the way.\n\nI just wanted to point out that the services GitHub provides are not quite the same as the services of a Bittorrent tracker (although functionally it's pretty similar).  There's nothing stopping developers from being purely peer to peer without any central, canonical  repo.  Of course, if you have a product that you want to foster participation on, it raises the barrier to entry because it's not clear what the best source is.  Nonetheless, it's completely possible.\n\nGitHub provides you with an easy centralized public face to the decentralized ecosystem.  Anything that's ready to be truly published can be pushed there by whoever has  permissions to do so.  If you reference the [IntegrationManager or DictatorLieutenant](http://whygitisbetterthanx.com/#any-workflow), the 'Blessed Repository' in either of those flows would be GitHub.\n\nAnyway, just wanted to clarify that point.  For a really quick summary, check out [this](http://whygitisbetterthanx.com/#github).\n\nP.S. Why is the blog not OpenID enabled? ;)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jan 15, 2009", "message": "+1 for Tim Visher's comment. For me, GitHub is just somewhere which takes the hassle out of hosting a git repository myself."}, {"author_name": "Alex McBride", "gravatar_hash": "8a5f65062b9908152a7b00fab3df6c58", "author_url": null, "date": "Jan 15, 2009", "message": "Heya,\n\nI just wanted to say that I really enjoy listening to these podcasts each week (or however often you release them), they are a lot of fun to listen to, and both Jeff and Joel come across as very likeable and informed guys. I just wanted to let you know that I enjoy them a lot and look forward to many more in the future.\n\nThanks,\n\nAlex."}, {"author_name": "Brooks Moses", "gravatar_hash": "361baa67583dc1033f2f3b3c97761c2c", "author_url": "http://notes.dpdx.net", "date": "Jan 15, 2009", "message": "My last Windows server had a Windows-mirrored boot partition, so that is in fact demonstrably possible.\n\nUnfortunately, this doesn't actually solve the whole problem, as that server demonstrated when the IDE-0 controller died.  Although the partition is mirrored and so my data is safe, the actual boot sector is not mirrored in such a way as to leave the computer bootable with those drives missing.  (Also, since it's the controller and not the drive that died, I can't swap the second disk into the first disk's slot to see if it will boot, but I'd be highly surprised if it did.  Similarly, if you have hardware that lets you hot-swap in a replacement for the boot drive, I see no evidence that Windows would rebuild a boot sector on it.)\n\nOr, in short -- sure, you can mirror the boot partition, but if you want to boot with a dead drive, you need to actually mirror the boot _drive_, and Windows doesn't mirror drives.\n\nOn the other hand, the computer continued running quite happily with the IDE controller down, until I tried to reboot it.  I was quite impressed."}, {"author_name": "Shawn", "gravatar_hash": "f878a55e08bacee0af48852c29a02dc7", "author_url": null, "date": "Jan 15, 2009", "message": "Still waiting on that pizza answer... :&lt;"}, {"author_name": "Lucas", "gravatar_hash": "390d09024311c91b5a3dba021cca86c5", "author_url": null, "date": "Jan 15, 2009", "message": "Hey, great show. About the last part, I think there's a nice app by _why the lucky stiff called Shoes that I think aims to fill exactly that role, it' a network and socially enabled ruby IDE, hare's a link:\n\nhttp://shoooes.net/"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 15, 2009", "message": "> Still waiting on that pizza answer\n\nWe're still waiting for an actual question..\n\nI have no idea why Joel chose to read your \"question\", by the way. I guess because you invoked the Florida conference, Future of Web Apps, where he'll be speaking at?"}, {"author_name": "Demian Garcia", "gravatar_hash": "604189cf7ba5ff68da2fce4187994738", "author_url": null, "date": "Jan 15, 2009", "message": "&gt;Or maybe just a guru badge.\n\nOr maybe a \"Turing Award Winner\" badge."}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Jan 15, 2009", "message": "\"Turing Award Winner\" badge! Do it! \n\n Plus, people can't complain that it is unobtainable"}, {"author_name": "Mike Jackson", "gravatar_hash": "2cbd933d39e91a8f7f5994d57c582675", "author_url": null, "date": "Jan 16, 2009", "message": "I think that RSTS/E is OS that Joel was trying to think of. I too remember interactive BASIC sessions on teletypes!\nAs for Shawn's problem, if he's *really* hungry he could try faxing an order to the pizza company with a hidden exploit that coerces the company to send him some cookies :)"}, {"author_name": "BlaM", "gravatar_hash": "a9ff706566705fb0a0882915bcabb790", "author_url": "http://blogs.interdose.com/dominik/", "date": "Jan 16, 2009", "message": "If you decide to go with a \"box\" solution for loadbalancing, I can recommend <a href=\"http://www.packetpro.de/\" rel=\"nofollow\">PacketPro</a> which is simple to use, very powerful and reasonable prices compared to similar products from - for example - Cisco. We use it for our own webpages and have several customers who use it, too and are happy with it."}, {"author_name": "Kristian J.", "gravatar_hash": "758b3dcfda4196cba0fd48c45bfb6df3", "author_url": null, "date": "Jan 16, 2009", "message": "I hadn't heard the term \"devigner\", but I've heard of \"deselopers\". A google search reveals that \"devigner\" seems to be more popular, and that this term is (not surprisingly) used about people who works with flash."}, {"author_name": "Wayne Koorts", "gravatar_hash": "ae020e99cc0f4e8a49961da01f07aafe", "author_url": "http://www.wkoorts.com", "date": "Jan 16, 2009", "message": "I have a suggestion for a name for the IT-but-not-programming branch of Stack Overflow.  Simply:\n\nit.stackoverflow.com\n\nI think the name Stack Overflow is just too cool to not re-use again and the whole sub-domain thing is both seperate enough and the same that it just works as well I think.  Also of course this will make future branching easier."}, {"author_name": "Jonathan Sampson", "gravatar_hash": "3eada417ab749e3a7a5d51d451b2cc3a", "author_url": "http://www.sampsonresume.com", "date": "Jan 16, 2009", "message": "Suggestions: techcircuit, techoverflow, thehelpdesk, techsupport, techsport, deskoverflow, level1, techlevel.\n\nBest of luck with this - looking forward to March!"}, {"author_name": "Alex Andronov", "gravatar_hash": "542f45519ec27c8147da98b9226f331c", "author_url": "http://www.gamboling.co.uk", "date": "Jan 16, 2009", "message": "On the subject of the downturn and open source software... There is a chance that the downturn will cause IT departments in affected industries to turn to using more open source software."}, {"author_name": "Danilo Celic", "gravatar_hash": "2792ae37d899ea5517ba0a5a034dc82d", "author_url": "http://blog.extensioneering.com", "date": "Jan 16, 2009", "message": "A suggestion for the site, I've seen a number of IT folks use \"PEBKAC\" as in:\nProblem\nExists\nBetween\nKeyboard\nAnd\nChair\n\nThe .com is already taken, but it is something along the insider line that StackOverflow has with programmers."}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Jan 16, 2009", "message": "Joel said:\n<em>Ruby and Python still don't have type inference, do they? This is a technology from the 90's which would make those languages much, much faster.</em>\n\nActually, and this just proves Joel's point all the more, <a href=\"http://en.wikipedia.org/wiki/Hindley-Milner_type_inference\" rel=\"nofollow\">Hindley-Milner type inference</a> goes back to 1978. (In math, it goes back to 50s, but it reached CS in 1978.)"}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Jan 16, 2009", "message": "Now that I think about it, Joel probably meant \"concrete type inference\", which was invented in the 90s and which can speed up OOP programs by proving that polymorphic calls can only go to one implementation, and thus enabling static binding. I was a little puzzled at how Hindley-Milner type inference would make Ruby and Python \"much, much faster\"..."}, {"author_name": "Soviut", "gravatar_hash": "2af9d5a7fd65f16aabb9216e414a3611", "author_url": null, "date": "Jan 17, 2009", "message": "Some ideas for IT-centric Stack Overflow; Swap Overflow, because of all the RAID-related talk."}, {"author_name": "Vaibhav", "gravatar_hash": "30530af24108b3f6020d613cc6d40df7", "author_url": "http://blog.gadodia.net", "date": "Jan 17, 2009", "message": "According to this (http://www.itjungle.com/two/two052307-story09.html)\n\nthere were over 13 million programmers in 2006. There's got to be more than 4 million now.\n\nCheers."}, {"author_name": "Jörg W Mittag", "gravatar_hash": "1f1d81bc927dd67f05ea41f4c8a61e9f", "author_url": "http://StackOverflow.Com/users/2988/", "date": "Jan 18, 2009", "message": "Here are my 3 ideas for the StackOverflow IT clone:\n\n\"SwapSpace\", as in \"a place to exchange ideas\".\n\n\"NVRAM\" (Non-Volatile Random-Access Memory), as in \"a Q&amp;A database (memory) of knowledge that doesn't require registration, login or jumping through hoops (accessible), has a good search engine (random-access) and neither goes stale nor goes away (non-volatile).\n\nAnd last but not least, a tip of the hat to ExpertSexChange: \"AdminShell\" ... or is it \"AdminsHell\"?"}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Jan 19, 2009", "message": "For branding reasons, you probably want one of \"stack\", \"overflow\", or at least \"flow\" in the new name. The simplest, most obvious, and least clever would be \"IT Overflow\" or \"Admin Overflow\" (which is a real IT term, the definition of which I do not know, the domain of which seems to be parked). The latter also hints at the desired audience of the site."}, {"author_name": "Josh KOdroff", "gravatar_hash": "9e7ef08258f04dab37b43842d261aea8", "author_url": null, "date": "Jan 21, 2009", "message": "Because both Shawn and I are from Philadelphia, I was trying to find his username by user number.  \n\nI couldn't find my user number nor a way to search for users by user number.\n\nAm I missing something, or was Shawn just able to find his user number because he's obtained access to your DB and is querying your tables directly?"}, {"author_name": "Eduardo Molteni", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": "http://divisionsoftware.com", "date": "Jan 21, 2009", "message": "Maybe you can appoint Richard Campbell, from .net rocks and RunAs radio (great name BTW).\n\nI'm not from IT, but I guess he is well known from the podcasts, etc."}, {"author_name": "Eduardo Molteni", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": "http://divisionsoftware.com", "date": "Jan 21, 2009", "message": "And naming .Net Rocks, in a recent podcast they said that there 6 millon copies of Visual Studio in use, so I guess that 4 million developers are too little."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 21, 2009", "message": "Josh,\n\nYou can find your user ID by looking at the URL for your profile page. For example, yours is:\n\nhttp://stackoverflow.com/users/549/josh-kodroff\n\nwhich means that your user ID is 549. Shawn's username is/was Update and his user id is/was 26. (for some reason the profile page kicks back a 404 for his account - it could be deleted)."}, {"author_name": "Mark Roddy", "gravatar_hash": "ac25b3f7bf1399399a6ad4cefea84bc6", "author_url": null, "date": "Feb 03, 2009", "message": "@Shawn: The answer is Lazaro's on 18th and South for a good slice of pizza, or Omega on 22nd and South if you want beer and bad slice of pizza."}, {"author_name": "Gratis internet", "gravatar_hash": "fbbaefb643694a33aeb31e9a5e5f7ad4", "author_url": "http://www.gratisinternet.org", "date": "Apr 11, 2012", "message": "And naming .Net Rocks, in a recent podcast they said that there 6 millon copies of Visual Studio in use <a href=\"http://www.gratisinternet.org\" rel=\"nofollow\">gratisinternet</a>"}]}