{"response": [{"author_name": "Vijay Santhanam", "gravatar_hash": "640b48a0bf5e3cc984bcef7b8db9a0dd", "author_url": "http://vijay.screamingpens.com", "date": "Jan 30, 2009", "message": "interfaces buy you mockability in .NET..very useful if you need to careful unit test the interaction between components."}, {"author_name": "Chris Boe", "gravatar_hash": "5eb94371298a7247d55d8296d861d8cf", "author_url": null, "date": "Jan 30, 2009", "message": "Here is the panel Joel was talking about at the beginning: http://video.dld-conference.com/watch/Q1G0GQR"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 30, 2009", "message": "Thanks for the link, Chris! I'll update the post as well!"}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Jan 30, 2009", "message": "If you want to read the best document on the current state of why the way we teach math is horrible is, \"The Mathematicians Lament\".\n\nwww.maa.org/devlin/LockhartsLament.pdf\n\nSeriously, take the 30 minutes of your time and read it, he keeps it very entertaining."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jan 30, 2009", "message": "You are worry about someone holding your business Hostage and then decide to use Intuit software? Good One :D"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 30, 2009", "message": "> You are worry about someone holding your business Hostage and then decide to use Intuit software?\n\nJoel made me do this. I BLAME JOEL"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Jan 30, 2009", "message": "Hey, leave me out of this!  ;)\n\nI'm with Michael Stum here.\n\nBut seriously, I understand what Joel (ahem, Mr. Spolsky) is saying, because every accountant really does understand QuickBooks, and that is important.  Also, there is a LOT (and I mean lot) of software out there that will pull in quickbooks data, so it's not as much of a lock-in as it used to be."}, {"author_name": "Alan Szlosek", "gravatar_hash": "791e9e81087c817296fd3b98e4159af0", "author_url": "http://greaterscope.net", "date": "Jan 30, 2009", "message": "Your Quickbooks conversation was interesting at least 1 person: me! I've wanted to ditch Quickbooks ever since I started using it 9 months ago for my company (Greaterscope, LLC). Joel's input that there's really nothing better makes me calm down a bit, but I'm still on the lookout. I bet my accountant would freak out.\n\nJoel recommended Essentials of Accounting in a previous podcast ... I need to get that book."}, {"author_name": "Brian", "gravatar_hash": "ac59f99e5f6958e4df7466134a70c085", "author_url": null, "date": "Jan 30, 2009", "message": "Yale and Harvard for Engineering/Computer Science?\nI don't know about you, but I don't necessarily consider these top\nschool for the field we are in. Don't try to group\nBusiness/Law/Medical reputation with CompSci/Engineering schools.\n\nI think the top schools in CS and/or Engineering are:\n\nUniversity of Waterloo, MIT, Stanford, Berkeley, Carnegie, CalTech,\nUniv of Toronto, Cornell, UIUC, to name a few."}, {"author_name": "John", "gravatar_hash": "a7f4f9dcbbf1d46d660b0a6c98435751", "author_url": "http://www.johndcook.com/blog", "date": "Jan 30, 2009", "message": "Here is a blog post that goes into some detail regarding Joel's comment about what happens when server utilization exceeds 80%.  It plots wait time as a function of utilization and shows that it indeed gets steeper around 80%.\n\nhttp://www.johndcook.com/blog/2009/01/30/server-utilization-joel-on-queuing/"}, {"author_name": "Erin Lawlor", "gravatar_hash": "d4b590f51d3197f6b49165ff59de8836", "author_url": "http://www.accountingunplugged.com", "date": "Jan 30, 2009", "message": "re QuickBooks, Joel was right on the mark when he suggested having an accountant set your books up for you from the beginning.  If you do that, and ask questions, you will find QB to be a lot less painful and a lot more useful.\n\nI have done a little work in trying to explain some basic accounting concepts on my website and I only mention it here to be of help.  I haven't updated the site for quite awhile because I am busy working on an alternative accounting system but people might find it useful."}, {"author_name": "Steve Sheldon", "gravatar_hash": "23a28f6ede358f8ac229a652b0b13d51", "author_url": null, "date": "Jan 30, 2009", "message": "Jeff, you should follow the http://highscalability.com/ blog.  One thing you're going to want to keep in mind long term is you can't keep scaling your database server.  It becomes exponentially expensive.\n\nSo you might want to think about archiving, and/or sharding."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Jan 30, 2009", "message": "I don't know if they have to really think about that sort of scaling right now.  It sounds like the DB server has plenty of headroom right now, and it's going to be having an even easier time once they switch over to the new servers.  Refactoring the DB design to use fewer joins will probably take their load down even more.  Adding the IT version of the site might change that, but it also opens up an easy and obvious upgrade path: split the DB servers for the two sites."}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Jan 30, 2009", "message": "Joel: I believe the college in New Mexico with the Great Books curriculum is <a href=\"http://www.sjca.edu/\" rel=\"nofollow\">St. John's</a>."}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Jan 31, 2009", "message": "Jeff: To prevent regressions, while avoiding the \"you won't need it\" trap, you might try a sort of inside-out Test Driven Development. Whenever you are fixing a bug, first write a test that captures the bug, then write write the code that passes the test. Instead of having a unit test for every individual feature of the system (many of them trivially correct), you have a unit test for every observed defect in the system. I image the unit test for parsing the C++ tag correctly would be pretty easy to write...\n\nThis workflow is widespread, so I'm sure it has a fancy name, but I don't know it."}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Jan 31, 2009", "message": "Jeff seems to fall into the exact trap that Joel worries about, in considering \"math\" to a sequence of subjects culminating in calculus. At several points, he contrasts \"math\" with \"logic\" as an example of the questionable relevance of \"math\" to programming... but logic <em>is</em> math! (If you were to ask Bertrand Russel, he would tell you that math is logic!)\n\nThere is an enormous amount of <em>discrete</em> math that is highly relevant to programming: formal logic, combinatorics, probability, graph theory, information theory, set theory, partial orderings, etc. I think graph theory alone is probably the single least appreciated subject amongst programmers (programmers manipulate graphs all day long---objects with references are a kind of graph)."}, {"author_name": "Fuzzbone", "gravatar_hash": "b61de49f9137040bbde3687a42a42091", "author_url": "http://blog.magenic.com/blogs/daniels", "date": "Jan 31, 2009", "message": "Jeff and Espcially Joel - I follow Uncle Bob on Twitter - where he said he called your hotline to ask for \"Rebuttal Time\" on your show for Joel's comments on the \"Solid Principals\"\n\nI've heard Bob speak at a conference; and on several other podcasts - and he's an excellent speaker.  I'd like to encourage you guys to have him on the show and have an open discussion on your views of software development.\n\nI think it would be a very interesting show."}, {"author_name": "Nathan Fellman", "gravatar_hash": "898c2217a5457bdef0a0ed58283010dc", "author_url": null, "date": "Feb 01, 2009", "message": "Joel mentions that calculus is unnecessary for programmers after having talked about how queuing theory is worth understanding.  Queuing theory and many other fields of engineering require probability theory, which itself requires a certain understanding of calculus if you want to understand <i>how it works</i>, and not only how to use it.\n\nHe also mentions that Google is the only case where linear algebra made people billionaires.  However, you can't understand computer graphics without linear algebra, and I imagine quite a few people got rich doing some form of computer graphics.\n\nOne final example (only because I don't want this to be so long that it's ignored) is anything related to DSP (digital signal processing).  DSP is all about linear algebra, Fourier Transforms (which require integrals) and such.  \n\nI don't think it makes sense to say you don't need calculus or linear algebra to be a programmer."}, {"author_name": "Nick Pellow", "gravatar_hash": "7520a559b67195a9bbf2c8062e79ed4f", "author_url": "http://clover.atlassian.com", "date": "Feb 01, 2009", "message": "I'm not a TDD zealot, but... ;)\n\nThe description and example of unit testing in this episode is somewhat misleading. It is important to distinguish between unit and functional (or acceptance) tests. What Joel described sounded like a functional test - testing the new functionality from end-to-end.\nA unit test, which only tested that the value from the UI was correctly passed to the 3rd party jpg compression library, could have been quicker to write.\n\nA recent example of where a unit test would have saved some software is the case of the ZUNE Y2K9 bug: http://tr.im/e353\n\nAs discussed however - a balance and a brain is the best policy."}, {"author_name": "Michael", "gravatar_hash": "6379f08b10ce091d27f31743e01220d7", "author_url": null, "date": "Feb 02, 2009", "message": "From this <a href=\"http://abcnews.go.com/Business/IndustryInfo/story?id=4626882&amp;page=1\" rel=\"nofollow\">ABC News article</a> last year, Yale has legacy admissions of 13-16% of incoming classes over the previous decade.  Other Ivy League's have even higher legacy admission rates.  So Joel may think he's saving time by interviewing an Ivy League graduate first.  But does that really make sense if there's a good chance the Ivy League graduate has not passed any greater selection process than a graduate of a less prestigious college?  That's not to mention that many smart kids do not go to Ivy schools for financial reasons.\n\nIf the goal is to hire the best programmers, isn't it worth the time to evaluate applicants on some real qualifications rather than stereotypes?"}, {"author_name": "Tom", "gravatar_hash": "1f0b00b8853cf0311888bb3ed2a77ebc", "author_url": "http://tommcfarlin.com", "date": "Feb 02, 2009", "message": "Hey guys,\n\nUncle Bob has responded to some of the claims in the most recent podcasts on his blog: http://blog.objectmentor.com/articles/2009/01/31/quality-doesnt-matter-that-much-jeff-and-joel \n\nI second an opinion mentioned earlier: I'd love for you guys to have him on the show - it'd be great to hear you guys discussing these ideas."}, {"author_name": "tracy", "gravatar_hash": "c598b3a8cc812857f660fb4e6a82f793", "author_url": null, "date": "Feb 02, 2009", "message": "Joel, here I was, afraid the Yalies would be the ones mugging me.  I went to school in New Hampshire.  We have a joke that I think you might appreciate.  How do you know a person went to Yale?  Don't worry, they'll tell you :-)\n\nOverall, I agree with your feelings on brand name schools.  The best part of my four years was the people I met.  I've met a lot of people who are smart from a wide range of schools, but I think people who can get into a more selective school do have a leg up.  But this comes from a programmer who has an A.B. degree in Government."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Feb 02, 2009", "message": "I really have to disagree with the discussion of mathematics in this podcast. First of all, calculus is not useless. That's pretty silly. Actually, that is just the most inane thing I have ever heard. Newton was not investigating the calculus for the sake of pure mathematics. He was interested in physical phenomena. I suppose it depends on what one means by practical. If by practical you mean \"Will I need to know this for my job as a Burger Flipper\" then, all right, it probably isn't. It's a good thing those people who build those fancy blinky light boxes known as \"computers\" know something about calculus. But I suppose \"practical\" people aren't interested in such devices!\n\nI don't really understand that mindset, especially among programmers. But, to be honest, there are far too many generalizations particularly with respect to the discussion of \"programmers.\" I always hear people talk about how math is impractical for programmers, learning C is impractical, learning anything about how computers *actually* work in any depth is \"impractical.\" It's very strange and counter-intuitive. Sure, the average boiler plate CRUDer may only need to know how to use fancy empty phrases like \"business process analysis\" and be just competent enough with various frameworks; however, that doesn't sound like the \"craftsmanship\" mantra I see on Codinghorror or on this podcast. It just sounds lazy and like \"it's hard, wah wah wah.\"\n\nAs far as the business about the way \"we teach math\" being so bad and, again, how calculus is useless and we need to teach the interesting things like Linear Algebra, Abstract Algebra, Set Theory, Topology, Graph Theory, etc, give me a break. Sure, there are issues with math education but it's not that simple. What Joel is advocating was already tried. It's commonly referred to as \"New Math\" and it was essentially a failure.\n\nThese higher level mathematics are not \"easier\" than the basic Calculus I - IV series. They are different sorts of things. Joel is trying to argue that they are \"more interesting, so we should teach those instead.\" However, these topics are *very* rigorous. There is a difference between learning what some of the terms mean or having rousing vacuous discussions of them in coffee shops and actually understanding the concepts. For instance, it's one thing to say \"Oh, did you know there are different kinds of infinities\" and quite another to be able to prove that the set of Recursive languages are countable but that the set of Recursively Enumerable languages are more than countable.\n\nApparently, one professor said of New Math:\n\"the New Math produced students who had \"heard of the commutative law, but did not know the multiplication table.\"\n\nHonestly, as other have mentioned (the \"Google is the only company to make money with Linear Algebra) there are some very gross and sort of obnoxiously misinformed views about mathematics and Computer Science on this episode."}, {"author_name": "Tim", "gravatar_hash": "2961f41c150bd1723ae28c892e27b0d3", "author_url": null, "date": "Feb 02, 2009", "message": "On SOLID\n\nIf you use interfaces across sub-system boundaries,\nyou can MOCK them. \n\nOf course, that is related to doing unit testing.\nAnd Web guys like Joel and Jeff don't do that..."}, {"author_name": "Matt B.", "gravatar_hash": "cc9db9b7d250cf7502819e6bba5b71fc", "author_url": null, "date": "Feb 03, 2009", "message": "Netledger &amp; Netsuite are one in the same.  Netsuite started out as Netledger and later changed their name to Netsuite.  \n\nKind of useless knowledge, but I used to work there.\n\nOne argument for something like Netsuite is that they have a nice web services API.  I'm not sure about QuickBooks, but for our business, being able to integrate our own applications to Netsuite is a big help (saves a ton of manual data entry)."}, {"author_name": "Bartosz", "gravatar_hash": "49cb47842fdbd426134581fa77830688", "author_url": "http://bradaczynski.wordpress.com", "date": "Feb 03, 2009", "message": "Jeff, how on earth could you ever think that joins are free? The design you presented (post revisions stored as a separate table) is ridiculous, especially in terms of the lists that you show to the users. It might be okay for showing just one post (as this is the usual on wikipedia) but not for multiple posts (which I guess from what you've said is the case when you view a question with all the answers, every answer being a separate post and requiring a join) to the revisions table). You say that you've worked with databases for a long time - hasn't this sort of denormalization come to you as the obvious thing to do?"}, {"author_name": "erickson", "gravatar_hash": "ffbf4e85b8ffbae4e9039b9c0cf07bc8", "author_url": null, "date": "Feb 03, 2009", "message": "It's \"peh chalk chaw,\" not \"peh chach ka.\""}, {"author_name": "trevorpower", "gravatar_hash": "8401ce7758b1b2040536bcb8e9575d58", "author_url": "http://blog.trevorpower.com", "date": "Feb 05, 2009", "message": "When Joel talks about TDD he uses an example of where his application needs to change the compression of a Jpeg file. He says that to test this he would need to write/find another algorithm to do the compression in order test the output of the function.\n\nSurely Joel is not writing his own Jpeg processing code. The test he describes is testing the Jpeg stuff and not his own application.\n\nI wish he make up examples about something he doesn't understand."}, {"author_name": "Stefano F. (tacone)", "gravatar_hash": "43b7f7dfbf6174406b79e262d4be79f6", "author_url": "http://www.stefanoforenza.com", "date": "Feb 05, 2009", "message": "As I understand it, test driven development should be viewed as the practice of minimalism.\nSince you have to write tests, you also want to write less operative code as you can.\nYou first write the test, then find whatever hacky solution make it work, since you have tests to verify everything is working.\n\nAlso, I'd suggest to test only public functions.\nNote: I am still not able to program that (minimalistic) way."}, {"author_name": "Cees Meijer", "gravatar_hash": "eb94d6c5458eedeb554d70e7081a007c", "author_url": "http://c-scope.blogspot.com/", "date": "Feb 11, 2009", "message": "Dear Joel, \n\nMaybe you should listen to the 'Uncle Bob' podcast a bit more carefully. On several occasions he says his 'SOLID' are 'engineering principles', not commandments. So a lot of what he says makes sense in a general way, but you should not cast S.O.L.I.D. in stone and put it up the wall of your cubicle."}, {"author_name": "Johannes Link", "gravatar_hash": "12d4632653ffc3222131cea6b18fbdf2", "author_url": "http://blog.johanneslink.net", "date": "Feb 11, 2009", "message": "The sad thing about Joel being very dismissive about TDD and its proponents is not that he might be wrong, we all are from time to time - and, frankly, who knows. It's the arrogance with which he claims that a method he never tried himself is the wrong thing to do. The example he gives (about doing excessive UI testing for adding a configuration option) clearly shows that he has not grasped the ideas behind TDD, probably for lack of doing his homework, eg. reading one of the good books about it and experimenting with the ideas.\nMy personal conclusion is that Joel is probably as clueless about other things as well, and not holding back his strong opinion about those either. Sorry for saying that, but you lost me as a listener. It mostly was very entertaining to listen to you."}, {"author_name": "accounting outsourcing services", "gravatar_hash": "29240f0168a5b841e101fc817536ae46", "author_url": "http://www.saibposervices.com/e-accounting-finance-and-book-keeping.aspxAnthimosspinier", "date": "Jul 15, 2009", "message": "Its presentation differ from other posts...\nRegards,\n<a href=\"http://www.saibposervices.com/e-accounting-finance-and-book-keeping.aspx\" rel=\"nofollow\"> accounting services</a>"}]}