{"response": [{"author_name": "Konrad", "gravatar_hash": "f9401202ab73e624cc82800b0fff1489", "author_url": "http://madrat.net/", "date": "Jan 27, 2009", "message": "Very nice! I can't wait to use this feature (even though I don't know yet when I'll need it). However, I obviously like to complain (hey, I'm German. We're compelled by law to complain about at least five things a day).\n\nIn particular, about point 2. What if you don't accept an answer because they're all ultimately useless? What if the current best answer is the best only by a very small margin and/or has only a small number of complete upvotes (say, 1 compared to 0 for all other answers)? Why award half the bounty to that potentially useless answer?"}, {"author_name": "Matt Hamilton", "gravatar_hash": "2bd5f782c135ff7ed12a95bf209eb973", "author_url": "http://www.madprops.org", "date": "Jan 27, 2009", "message": "Excellent stuff, Jeff.\n\nWill there be UI around the bounty feature in terms of a dedicated tab under \"Unanswered\"? Or some indication in the list of questions as to which ones have a bounty attached?"}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "Jan 27, 2009", "message": "The FAQ says \"If you do not accept an answer in seven days, the top voted answer will automatically become the accepted answer, and half your bounty will be awarded to that answer. The other half will be deducted from your reputation.\"\n\nI'm a bit confused about the \"other half\" statement. Does this mean that if you don't accept an answer on a bounty question, you still lose the full amount of what you offered for the bounty? Or do you only lose half? If the latter, what's the motivation for people to accept an answer at all?"}, {"author_name": "John", "gravatar_hash": "a36dcc68d3616c2b4a95fca721d3c948", "author_url": null, "date": "Jan 27, 2009", "message": "Great idea, although one thing that seems odd to me is that the answer is fixed? I can understand fixing it for the week of the bounty but what happens when it is a question which has an answer that may change over time?\n\nFor example people use to do all sorts of hacks to get around IE6 bugs in the CSS but now they often use conditional stylesheets to target the browser. So the method in which you get around a problem has changed over time. So if someone had posted this on Stackoverflow (say 3 years ago) and then came to look at the answer again now it would still say to use a hack, where by the better answer now would be to use the conditional IE statements to target the correct browser.\n\nAny thoughts on that Jeff?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 27, 2009", "message": "> Does this mean that if you don’t accept an answer on a bounty question, you still lose the full amount of what you offered for the bounty? Or do you only lose half? If the latter, what’s the motivation for people to accept an answer at all?\n\n1) You offer 500 bounty\n2) System adds 50\n3) You do not accept an answer in 7 days\n4) Highest voted answer is auto-accepted\n5) Answerer gains 275 rep (one half of 550)\n6) You lose 500 rep\n\nEDIT: clarified and amended comment and post. Sorry, it's late and I am tired."}, {"author_name": "Steve S.", "gravatar_hash": "16e27d828f6f5de9bc6bc7b6516de531", "author_url": null, "date": "Jan 27, 2009", "message": "Will there be a RSS feed of questions with bounties?"}, {"author_name": "Chris", "gravatar_hash": "f89b5f030e5a8a254249d477f88b24f4", "author_url": null, "date": "Jan 27, 2009", "message": "There should be $ bounties too!"}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "Jan 27, 2009", "message": "Thanks Jeff, that clarifies the bounty question. Get some sleep, you deserve it!"}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309", "date": "Jan 27, 2009", "message": "I am confused: \"“If you do not accept an answer in seven days, the top voted answer will automatically become the accepted answer\"...\n\nI have a question with a crappy (but upvoted) answer. I set up a bounty.\n\nNOBODY post any new answer: my crappy upvoted answer is still number one.\n\nAnd... at the end of the week, I am still at square one, but with lot less rep ?\n\nShould the criteria \"top voted answer\" only apply for *new* answers since the bounty started ? *\n(may be it is already the case and I did not read thoroughly enough the FAQ ;) )"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 27, 2009", "message": "VonC, that's the gamble. There is a special tab for these on the homepage as well as a special visual style, so.. it should get some attention in 7 full days!\n\nThere may also be tweaks to this formula depending on what happens. Real world data always trumps our predictions anyway :)"}, {"author_name": "David Schmitt", "gravatar_hash": "f41b1342c973956dba590327908cb349", "author_url": "http://stackoverflow.com/users/4918/david-schmitt", "date": "Jan 27, 2009", "message": "Can one offer a second bounty after the first one has expired? e.g. because the auto-accepted answer wasn't really good. What'll happen then?"}, {"author_name": "SCdF", "gravatar_hash": "eb2c9961d9729359e086e9dcf6312ff9", "author_url": null, "date": "Jan 27, 2009", "message": "&gt; I have a question with a crappy (but upvoted) answer. I set up a bounty.\n&gt; NOBODY post any new answer: my crappy upvoted answer is still number one.\n&gt; And… at the end of the week, I am still at square one, but with lot less rep?\n\nYeah, it's tough. On one hand, you don't want to punish the asker if they put up a bounty and it's fruitless, and on the other you don't want people to be able to post 'fake' bounties and then withdraw once someone goes out of their way to answer it.\n\nPersonally I'm a bit worried about Jeff's approach, but it's a really hard decision to make. I think if it were me I would probably have the asker lose half or less of the bounty if he doesn't mark one as answered instead of his full rep."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 27, 2009", "message": "> Can one offer a second bounty after the first one has expired?\n\nno, because bounty accepts are permanent.\n\nOf course the question is still open, and a community voted answer could later exceed its vote count. We've talked about this before; there are two answers, the one the asker liked, and the one the community likes. They can be different things.\n\n> I think if it were me I would probably have the asker lose half or less of the bounty if he doesn’t mark one as answered\n\nAs serhat points out, why accept if you can halve your rep loss by NOT accepting? Unworkable."}, {"author_name": "Aaron Powell", "gravatar_hash": "5d608d8fe9156b0e01b3f224e28409b0", "author_url": "http://www.aaron-powell.com", "date": "Jan 27, 2009", "message": "What if I offer a bounty but don't get any answers which are correct or actually useful? I have a few questions open which aren't answered and I'd be unsure if they can be answered (very unique problems).\n\nSay I opened a bounty but didn't get any new answers or the new answers weren't right. The bounty expires, my problem still isn't solved and someone ends up with an accepted answer which isn't really the answer."}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "Jan 27, 2009", "message": "I've got an alternate idea for distributing bounty points for unaccepted bounty questions: http://stackoverflow.uservoice.com/pages/general/suggestions/110446-distribute-unaccepted-bounty-among-all-answers"}, {"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Jan 27, 2009", "message": "I'm not sure I like situation #2 just because an answer has been voted up does not mean that it is a good answer, the highest voted answer may have a negative score, because it was bad, something different needs to be done in situation #2, I have a few questions that I was going to go offer a bounty on now, but I don't want to risk the rep since I'm not sure they will even get an answer better then what is there now, which obviously is not a good answer as I haven't already accepted it."}, {"author_name": "David Schmitt", "gravatar_hash": "f41b1342c973956dba590327908cb349", "author_url": "http://stackoverflow.com/users/4918/david-schmitt", "date": "Jan 27, 2009", "message": "@Jeff: Oh, slight misunderstanding there. I was asking about the \"auto-accepted\" answer. i.e. after the \"time-out\", if the top-voted answer gets accepted at half the reward.\n\nAnd the answer is maybe that the auto-accept moves with the votes, since this time-out-accept _isn't_ \"the one the asker liked\", as you assert."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 27, 2009", "message": "> maybe that the auto-accept moves with the votes\n\nit does not."}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309", "date": "Jan 27, 2009", "message": "&gt;&gt;NOBODY post any new answer: my crappy upvoted answer is still number one.\n\n&gt;&gt;And… at the end of the week, I am still at square one, but with lot less rep ?\n\n&gt; Jeff: VonC, that’s the gamble. There is a special tab for these on the homepage as well as a special visual style, so.. it should get some attention in 7 full days!\n\n\"That's the gamble\".\n...\n\"THAT'S THE GAMBLE\" ??? \n(me, spilling coffee all over my keyboard, you happy now ? ;) )\n\nWith all due respect, Jeff, that is a gamble I have 0 interest in. If I am prepare to invest some of my \"reputation\" points (which are no more \"reputation\" from now on, just a currency), I want result.\n\nNo result ? No point.\n\nI would consider an upvoted, still crappy, *NEW* answer (new since my bounty), but I will certainly not give anything to OLD answers (answers so crappy I decide to set up a bounty in the first place).\n\nSo a gamble I would consider (If I do not see an answer I can accept) would be to reward automatically NEW upvoted answers, but I fail to see the point to reward old ones... \n\nIf no new answer comes up, nobody should gain anything.\n\nIf new answers come up, the most upvoted one (or all the new ones as suggested by Greg) could receive points if I do not choose any of them."}, {"author_name": "Binary Worrier", "gravatar_hash": "46769b2f2b853cad9b21b11bffa3346b", "author_url": null, "date": "Jan 27, 2009", "message": "I don't like that a crappy answer can be auto selected.\nI reckon that if the bounty period expires with no selected answer, that the user looses the full rep (it goes no where), but that NO ANSWER is auto selected."}, {"author_name": "serhat", "gravatar_hash": "5201af5d797f49f55d59a0485fd8023b", "author_url": null, "date": "Jan 27, 2009", "message": "Why cannot I increase the bounty of my question?\n\nIt would also be nice to add some bounty to a question asked by an other person since answer of that question might be crucial for me and I do not want to duplicate it or I think that question might get even more interest if bounties of asker and me add up."}, {"author_name": "serhat", "gravatar_hash": "5201af5d797f49f55d59a0485fd8023b", "author_url": null, "date": "Jan 27, 2009", "message": "Does not marking the top voted answer as accepted answer  encourage crappy answers? Because even if my answer does not solve the asker's problem, I will get the bounty if somehow I can get my answer to top (and solving the asker's problem is generally not the easiest way to do that)."}, {"author_name": "Binary Worrier", "gravatar_hash": "46769b2f2b853cad9b21b11bffa3346b", "author_url": null, "date": "Jan 27, 2009", "message": "Also, people can trade in rep. Lets pretend I have 25k rep (unlikely I know, currently just +2k). I post on my site that I'll sell 1k rep for $100. I enter into an agreement with another user. I ask a dumb question offering 950 rep for an amswer. The other guy/gal posts a dumb answer with I select and they get 950 of my rep, +50 from SO.\nI do this a couple of times, I loose 5k of rep (which I can afford to in my fantasies) and make a quick 500 bucks.\n\nIs this fair? \nShould it be allowed?\nIf not, how would we stop it?"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Jan 27, 2009", "message": "Jeff,\n\nWhy not limit the auto-accept after seven days to answers that were posted since the bounty was offered?  If the asker offers a bounty, clearly they don't regard any of the existing answers as useful."}, {"author_name": "Daniel", "gravatar_hash": "6d43da5df0e52fc31c55e6a227bb23f4", "author_url": null, "date": "Jan 27, 2009", "message": "I think there ought to be at least a MINIMUM vote count for an answer to be auto-accepted. After all, what if I offer a bounty, and after a week no one produced any worthwhile answer whatsoever -- not only in my own view, but in the community's own view."}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309", "date": "Jan 27, 2009", "message": "@Binary Worrier: That is why the all notion of using \"reputation\" as \"currency\" is not, IMHO, a good idea to begin with.\n\n\"Just do whatever you can to keep the answer-ers motivated\": it means \"LONG-TERM status management of a question\".\n\nVarious solutions have been discussed in http://stackoverflow.com/questions/172184 (scroll to the paragraph \"How does that help solving the \"Fastest Gun in the West\" Problem ?\").\nIt involved a *win-win* system (badges/small points for the one modifying the status, rewarding his/her persistent attention to the question, extra-points/badges for the one answering a now old question)\n\nBut the only implemented system managing the long-term status of a question is... a bounty, where:\n\na/ only the asker can initiate the process (if the question is interesting, but the asker is gone, one should duplicate/rephrase into a new question to hope fresh answers)\n\nb/ the asker must LOOSE something, which is (again IMHO) completely at the opposite of what that kind of community was about: generous, selfless, altruistic answers, through a participation only acknowledged by the \"reputation points\" system.\n\nThis introduce an \"interest\" game, like a bad seed in what was a \"pure\" process...\n\n-----\n\nThere, I said my piece. That said, I shamelessly already answered one of those bounty question ;)"}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jan 27, 2009", "message": "I think that there needs to be a mechanism that definitely makes you lose your bounty after a week. The System itself cannot know if the answers are good or not, so I could just gamble by adding 500 Bounty and never accepting any answer, that's why Situation #2 needs to be in.\n\nBut that being said, I don't like #2 just for the reason that if the answers are crap, it's not helpful.\n\nYou post a bounty because you are not statisfied with any of the answers, so I think that #2 should only count for answers posted after the Bounty was opened and the answer with the most Upvotes should win, provided it has a positive up/downvote ratio (So if an answer has 1 Up and 2 Downvotes it should not win).\n\nif there is no new answer or if all new answers have a negative/neutral Up/Down Ratio, the bounty should just expire. Or, if you want to add a risk, substract 50 Rep as a \"handling fee\"."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 27, 2009", "message": "@Binary Worrier\n\nI worry more about people using the +50 bonus to conjure rep out of thin air - imagine using two user accounts, one with high rep posting high bounties, which the new account receives. Then the reverse happens - the shell account posts high bounties that the original account is given. From what I can tell, there's no mechanism that will prevent this from happening.\n\nWhat I suggest is that the +50 bonus be eliminated - that way all the rep that someone receives in a bounty is matched by an equal loss by the asker.\n\n@Michael Stum\n\nI definitely agree, the system should not be accepting an answer. What should happen is the user should immediately lose whatever amount they bounty, but if no answer is accepted the rep is simply gone. By basing it on voting, a situation is created where downvoting other answers might cost 2 rep, but at the potential gain of hundreds. If Jeff thinks he saw cheating before, he hasn't seen anything yet. I'm betting there are people out there that would maintain puppet accounts that they would use to downvote competing answers multiple times to ensure that, if the asker does not select an answer, that theirs is automatically selected."}, {"author_name": "Binary Worrier", "gravatar_hash": "46769b2f2b853cad9b21b11bffa3346b", "author_url": null, "date": "Jan 27, 2009", "message": "@nobody\nWell spotted, I hadn't seen that rather direct and quite fundamental flaw"}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Jan 27, 2009", "message": "@nobody: I came here to post the same thing.  The ability to give to the user of your choice free rep that isn't subject to the daily cap?  This is going to get gamed so hard."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Jan 27, 2009", "message": "Jeff,\nI like the 7-day timeout period.  It shows that you put some thought into people trying to game the system by offering a bounty, but then never accepting a winner.\n\nWhat I don't like is \"a bounty accepted answer is permanent and cannot be undone.\"  This prevents me from offering another bounty if I don't get a good answer the first time.  I think there is a clear and necessary reason for closing the bounty and transferring points after 7 days, but I don't see the purpose behind potentially making a bad answer the *permanently* accepted answer, and possibly preventing me from ever getting a good answer."}, {"author_name": "Micah", "gravatar_hash": "c23b963563e43954c912c41335411916", "author_url": "http://codingcontext.wordpress.com", "date": "Jan 27, 2009", "message": "Now you need to have a \"Sort by Bounty\" view for all of us bounty hunters =)"}, {"author_name": "zurvan2", "gravatar_hash": "fdd2cee0ff73e9805b94654e4d7418d3", "author_url": null, "date": "Jan 27, 2009", "message": "Tags? Can we see featured questions with a specific tag? That doesn't seem to work, at the moment. :("}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jan 27, 2009", "message": "Some parts of the rules are definitely brain-dead.  The reason (presumably) that we offer a bounty is because time has passed and there are no good answers.  There is a good possibility that there are no good answers/answers that are useful within the next 7 days.  I can live with giving up/gambling away my bounty, but not being able to deny an answer is ridiculous.  \n\nI propose that if you do not accept an answer you lose half the hitpoints, and you have the option of unchecking the answer that was magically chosen by giving up the other half as well.  The asker should definitely be able to control this issue better than your proposal.  It is definitely not a good way to do things.  \n\nOf course, in the case of a good answer, this works great."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Jan 27, 2009", "message": "The whole bounty idea seems pretty rotten to me.  Reputation is now a currency as VonC explained.  With REAL WORLD value: I can use it to BUY answers in a very real way.\n\nI've heard Joel explain several times on your podcast the problem with paying for answers.  It devalues the altruism and sense of community and makes answering questions a job with a paycheck.  This is exactly what you're doing now.\n\nYou are creating a market.\n\nI think it's no different now that the currency is Stack Overflow reputation points rather than US dollars.  And Binary Worrier even presented the mechanism for a reputation to dollar exchange rate to develop."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 27, 2009", "message": "I, too, am somewhat concerned with using reputation as currency, but I definitely don't think that it's the same as paying money for answers. First, the only way to offer a rep bounty is to have rep yourself, and the only way to get rep is to ask good questions and write great answers.\n\nWhat I am concerned about is the bounty becoming so common that it's impossible to get a question answered without a prize attached. This is offset somewhat by the 48 hour restriction, but this could potentially cut down on new users being able to get their questions answered quickly. I guess we'll just have to see how it plays out.\n\nP.S. - Are there any questions with accepted bounties yet? I went looking for the one in the blog post, but I guess it was only accepted for display purposes:\nhttp://stackoverflow.com/questions/17/binary-data-in-mysql#26"}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jan 27, 2009", "message": "What about badges? Will there be a \"Bounty Hunter\" badge?"}, {"author_name": "EvilTeach", "gravatar_hash": "0bd5c1d9900046057ef1a31a12734a3a", "author_url": null, "date": "Jan 27, 2009", "message": "Humm\n\nHow about everyone answering a bounty question automatically adds 50 points of their rep to the pot to be distributed."}, {"author_name": "Sean Patterson", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Jan 27, 2009", "message": "Silly question, but curious as to the bug check factor.\n\n1. I put a question up for bounty.\n2. A couple of people answer, but all answers are voted down because they don't apply or are just wrong.\n3. Bounty period expires.\n\nIs the highest negative vote going to get marked as the answer, even though it was not appropriate/accurate (in theory) due to the down vote?\n\nI know it sounds far fetched, but we've seen stranger things happen over here in the life of SOFlow...\n\nKeep up the awesome work!"}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 27, 2009", "message": "@Sean Patterson\n\nGood point. I also wonder about the situation where two answers are tied - which one gets accepted and the rep bonus? Do they both get it, or split it, or does the system just pick one randomly?"}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jan 27, 2009", "message": "I'm just wondering: How are newbies (as in: new to the site) are getting their really tricky questions answered?"}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Jan 27, 2009", "message": "In my opinion the system as it is now it's flawed. \n\nFirst of all because it can give rep to answers that are inappropriate automatically and the user still didn't got it's answer. \n\nI have and idea of a bounty system that's slightly different and might work better for the user asking the question:\n\n1. When a bounty is raised remove from the user reputation immediately (bounty amount+ 50 rep), so the user placing the bounty already looses rep.\n\n2. When an answer is accepted give the answerer the bounty reputation and give back the asking user 50 rep for accepting the answer.\n\nExample:\n\nUser Joe - 1000 Rep.\n\n1. User Joe asks a question he wants answered badly but gets no suitable answer in two days.\n\n2. User Joe puts a bounty of 500 rep on the question. \n\n3. Some time passes, but one day (hopefully rather soon) user Bob gives an acceptable answer.\n\n4. User Joe marks the answer accepted and gets 50 rep back for accepting the answer. User Bob get's his bounty rep of 500 points."}, {"author_name": "matt b", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Jan 27, 2009", "message": "Can readers offer to add some of their repuation onto an existing bounty?\n\nFor example, let's say I come across a question that someone else posted, but I'd really love to see answered - maybe I'm having the same exact problem. As an interested reader of the question, I'd like to add on to the incentive to get it answered (assuming no one has provided a good answer yet, which led to the owner putting up a bounty)."}, {"author_name": "Craig", "gravatar_hash": "e78bca1e19270e988366b8dc13e7fdb4", "author_url": null, "date": "Jan 27, 2009", "message": "So how soon before \"Purchase SO rep here\" websites start popping up?"}, {"author_name": "Guy Ellis", "gravatar_hash": "d9f2c02c23a3013166710a1d24bca056", "author_url": "http://guyellisrocks.com", "date": "Jan 27, 2009", "message": "I notice that the bounty link is there even though you can't use it until 48 hours have past. In your post it says:\n\nIf:\n- you have at least 100 reputation\n- your question is at least two days old\n- your question does not yet have an accepted answer.\nYou’ll see the “start a bounty” link at the bottom of the question.\n\nHowever the link appears before the question is two days old. At least it does in my case."}, {"author_name": "Gregory Harris", "gravatar_hash": "3092d05eda20f974250420e039d63c05", "author_url": "http://www.codesweep.com", "date": "Jan 27, 2009", "message": "I'm not a fan of this right now as I have a question I'd like to have answered, yet have little reputation to spare.  Perhaps it's time to think of a cash bounty option as well?  Instead of reputation I could offer a few bucks perhaps?  Don't know if that's ever been thought of..."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Jan 27, 2009", "message": "Be aware that, as others have mentioned, you have just created a system which will enable reputation \"laundering\". This may make it exponentially more difficult to police Stack Overflow and prevent fraud. This is especially important since permissions on the site are tied to reputation score.\n\nI'm somewhat skeptical of this system but it's worth waiting to see how it works out in practice."}, {"author_name": "Ray Vega", "gravatar_hash": "8ab1e7a181808b0e35932f06a8aff8c9", "author_url": "http://lexicalclosures.blogspot.com/", "date": "Jan 27, 2009", "message": "How do bounties work with questions/answers that have been converted into community wiki mode? Normally, you don't earn rep on those. Is that not the case with bounties?"}, {"author_name": "Ray Vega", "gravatar_hash": "8ab1e7a181808b0e35932f06a8aff8c9", "author_url": "http://lexicalclosures.blogspot.com/", "date": "Jan 27, 2009", "message": "Never mind. Just read the bounty FAQ.\n\nhttp://stackoverflow.com/faq#bounty\n\n&gt;&gt; \"Of course, bounty awards, like all accepted answers, are immune to the daily reputation cap and community wiki mode.\""}, {"author_name": "Schnapple", "gravatar_hash": "a3faf60be05339f66f1279507faaa155", "author_url": null, "date": "Jan 27, 2009", "message": "What if, at the end of the bounty period, you do not accept any answers but none of the answers posted have any votes (i.e., they're all at zero)\n\nWhat if there are two answers and one sits at zero votes whereas the second one sits at -1 votes, is the zero vote question now the one that wins?"}, {"author_name": "Tulle", "gravatar_hash": "b639f3f2a9b22966d9509b0296d91c26", "author_url": null, "date": "Jan 27, 2009", "message": "Fantastic work Jeff. You guys have an excellent vision for the site, and it's great to see you implementing so many of your ideas - and quickly at that!"}, {"author_name": "Motti (3848)", "gravatar_hash": "6183c6f9d621a125cd3aa0f7ae324285", "author_url": null, "date": "Jan 27, 2009", "message": "&gt; that’s the gamble\n\nI'd like to chime in with the people here that the auto-accept feature be abolished. I don't care gambling away my reputation, but lets not loose focus on what the whole point of the exercise is, getting answers to questions. I'm fine with having reputation deducted after a week (although I don't see why) but accepting a random answer means that the quality of answers will decrease rather than increase.\n\nSay I post a question \"Does P equal NP?\" why not let me maintain a bounty so that 500 stackoverflow rep are added to the motivation of solving this problem (above and beyond the Turing award)? This is a problem that may take longer than a week to solve does the fact that I want the answer enough to sacrifice my rep mean that I can *never* accept any answers that come along later than next week."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Jan 27, 2009", "message": "I've got a couple of questions I'd love to get answered, but there's no way I'd use the current bounty system.  The problem is these questions are waiting for the right person to come across them and there is no way to know if that person has joined Stack Overflow or cares enough about reputation to find it in the \"Featured\" question tab.  The odds that they are available to answer the question in the next 7 days seem remarkably low.  More like 7 months (or perhaps 7 years).  I don't need a bunch of answers that flood into a \"Featured\" question which simply rehash the unhelpful advice I already have.\n\nI love the idea of a bounty, but this isn't really a bounty in the strict sense.  A bounty would offer a prize for getting the correct answer.  For instance, mathematician Paul Erdös offered prizes for a variety of unanswered mathematical questions.  But the prize money would only go to those who provided correct answers.  For that to work, someone (Erdös himself in this case) evaluate the answer to see if it was correct.  And there was no particular time limit imposed.  \n\nThe current system is closer to turning the doubling cube in backgammon.  If you feel the answer you are looking for is very likely to be provided with a small incentive, you turn the cube.  This raises the ante of the game and increases the odds it will end right then and there.  But it also has the potential to make losing much more painful if the game turns against you.  Once you make that decision, it is irrevocable and out of your hands.\n\nI'd suggest a simple criterion for judging the success of this bounty system.  If more than about 50% of bounties end in a questioner accepted answer, the system is probably working.  If more than 50% end in an automatically selected answer, it has failed.  We'll start getting that question answered in a week or so."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Jan 27, 2009", "message": "Obligatory Star Wars reference (And I can't believe I'm the first to post this)\n\n\"Bounty Hunters. We don't need that scum!\""}, {"author_name": "Gregory Harris", "gravatar_hash": "3092d05eda20f974250420e039d63c05", "author_url": "http://www.codesweep.com", "date": "Jan 27, 2009", "message": "Another question, what happense when:\n\n1) I post a bounty\n2) I do something to soil my reputation below the bounty\n\nWill the bounty still be payable?  Will I now have a deficit in my reputation if that's the case?  Just curious..."}, {"author_name": "Grom", "gravatar_hash": "a14537020ec5b11fea3b956353724860", "author_url": "http://grom.zeminvaders.net", "date": "Jan 27, 2009", "message": "&gt; You do not accept an answer. The answer with the most votes is automatically accepted after 7 days. The bounty is subtracted from your reputation. The answerer is awarded half the bounty amount (unless it’s your own answer, see #3 below).\n\nPlease change to:\n\nYou do not accept an answer. After 7 days the bounty is subtracted from your reputation."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jan 27, 2009", "message": "How can you barter reputation? This seems to undermine the system quite a bit for several reasons, including those mentioned with regards to Joel's discussions on devaluation.\n\nActually, this is essentially the same thing as Experts Exchange. In EE you can either pay for points or answer questions, gain points, and use that as your bargaining chip to get questions answered. At this point, you might as well just offer people 500 packs of reputation for $20 or what have you.\n\nThis definitely severely undermines the whole \"the system learns to trust you\" mantra expressed regularly on show."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 27, 2009", "message": "> I also wonder about the situation where two answers are tied - which one gets accepted and the rep bonus?\n\nFirst one (chronologically) wins.\n\n> Can readers offer to add some of their repuation onto an existing bounty?\n\nVote up the question.\n\n> I’ve got a couple of questions I’d love to get answered, but there’s no way I’d use the current bounty system.\n\nUse of the bounty is completely optional, obviously.\n\n> Reputation is now a currency as VonC explained. With REAL WORLD value: I can use it to BUY answers in a very real way.\n\nI'd argue it's a lot more like gambling; you can add incentive, but you don't actually know if you'll get the answer you want. Hey, just like real life! :) I don't think the analog with money really holds in this case, though."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 27, 2009", "message": "> accepting a random answer means that the quality of answers will decrease rather than increase\n\nIt is not a \"random\" answer, it's the answer with the most votes.\n\nI agree we shouldn't auto-accept answers with 0 or negative votes, however, and we'll make sure we don't. So in the case where all the answers are at 0 or below, no auto-accept will occur after 7 days."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jan 27, 2009", "message": "&gt;I agree we shouldn’t auto-accept answers with 0 or negative votes, however, and we’ll make sure we don’t. So in the case where all the answers are at 0 or below, no auto-accept will occur after 7 days.\n\n\nThat's very time dependent though. Any answer can be voted down to 0 at any time. It's sort of arbitrary to just pick that particular moment when an answers score &gt; 0. I suppose if you are going to implement it, you have to make some decision and let the \"voting\" abstraction leak but just pointing out."}, {"author_name": "Sean Ennis", "gravatar_hash": "9b5b69a29967dc41d5ddfdee09b27b73", "author_url": null, "date": "Jan 27, 2009", "message": "Now all we need is the ability to filter/sort by questions with a bounty."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Jan 27, 2009", "message": "&gt; Reputation is now a currency as VonC explained. With REAL WORLD value: I can use it to BUY answers in a very real way.\n\nI would argue that good questions and good answers are the real currency on Stack Overflow."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Jan 27, 2009", "message": "&gt; So in the case where all the answers are at 0 or below, no auto-accept will occur after 7 days.\n\nWhat happens then? does the user keep their rep? can they start another bounty?"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Jan 27, 2009", "message": "Along a similar line to Gregory Harris' question above.\n\nIf I only have 500 reputation, can I start two separate 500 rep bounties, on two different questions? (since the rep isn't removed for 7 days) or is the rep for the bounty somehow reserved?\n\nIf I can start two 500 rep bounties with just 500 rep, what happens when the second bounty is due and I have 0 rep?"}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309", "date": "Jan 27, 2009", "message": "@Jeff: you still do not have offered one single reason for the auto-accept feature of bounty.\n\nNot only do you have introduced a \"win-loose\" component in what was once an altruistic \"win-win\" community, but with that \"gamble\" of yours, you have managed to put a \"win-screwed\" element...\n\nThat may be \"just like real life\", but what makes SO so sticky and popular is its low-friction, low-level and generous question/answer where you do not have to *pay* any fees (like experts-exchange), and when question, answer AND participation are rewarded\n\nWell..., now if your question is not answered in two days, you have to pay, and not even for result, but for a \"gamble\".... that is sad.\n\nIf you want to think \"just like real life\" and maintain what makes SO such a nice place, you need to come up with long-term question status management mechanisms which are WIN-WIN.\n\nIf you introduce any kind of new feature which does not respect that basic principle, you are on the wrong track."}, {"author_name": "RoBorg", "gravatar_hash": "8438e7bf53378150813b3dfec7f22232", "author_url": "http://www.roborg.co.uk", "date": "Jan 28, 2009", "message": "The Featured tab seems to be missing some questions... mine for example!  I've submitted a bug report here: http://uservoice.stackoverflow.com/pages/general/suggestions/111158-bounty-question-not-on-featured-tab"}, {"author_name": "m3rLinEz", "gravatar_hash": "e5043778a4a08fcac716018fe8767c4d", "author_url": "http://m3rlinez.blogspot.com/2009/01/netbeans-and-nimbus-theme-on-windows.html", "date": "Jan 28, 2009", "message": "Wow! Time for Jon Skeet's reputation graph to go non-linear!"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Jan 28, 2009", "message": "@m3rLinEz: Quite the opposite, in fact.\n\nI expect to get *very* little rep from bounties. I skim through pretty much all of the questions as they get asked. Few enough come in when I'm asleep that I usually skim through the couple of pages when I wake up.\n\nIf I can answer a question well, and there isn't already a good answer, I usually do so.\n\nThese two facts combined mean that there aren't many questions which are two days old with no good answer which I'm capable of answering. Ironically, bounty favours answerers who only look at Stack Overflow occasionally.\n\nThat doesn't mean there'll be *no* questions which slip through my initial scan, but I'm not expecting to do particularly well out of it."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Jan 28, 2009", "message": "A question regarding automatic accept of answer:\n\n - What happens if after 7 days, there are more answers having the same number of votes but are very different in nature (2, 3 ... n answers having 5 votes) ?"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Jan 28, 2009", "message": "&gt; I would argue that good questions and good answers are the real currency on Stack Overflow.\n\nThey *should* be.\n\n&gt; you have introduced a \"win-loose\" component in what was once an altruistic \"win-win\" community\n\nI agree.\n\n&gt; what makes SO so sticky and popular is its low-friction\n\nUsers with no reputation to spare will be prevented from asking bounty questions... and therefore we expect their questions will get less attention and care than other, \"more valuable\" competing questions.\n\nI don't mean to be too negative, but there is a risk these bounties are counter to the overarching goals of the site as you've explained them.  Still, I agree with what Joel Spolsky said in podcast 25:\n\n\"Okay, here's the thing. For a startup to work, it has to be an idea that is not very convincing. It has to be a completely terrible idea.\"\n\n\"If you explain it, and everyone says 'Oh yeah, that would work, I'm surprised that's not being done' - then it is being done. However, if you explain it and they say 'That wouldn't work, because of blah'. ... whatever the idea is, it has to have a fatal flaw at first glance and it has to sound like a terrible idea and you have to believe in it for some reason which you just have trouble explaining to anyone ... the idea has to be not obvious and it has to sound bad - otherwise it's getting done.\""}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Jan 28, 2009", "message": "This new feature is under documented (or the ergonomic of the website if not very intuitive to find how it really work under the hood). \n\nFew questions:\nDoes it affect the count of reputation you can have per day? If I reach the 200 limits, can you accept a bounty question and get back to 0 for this day and keep trying to get 200 or it's independent? Can someone be penalized if he accepts question from the same people at a high person? Can a person be penalized if he got accepted by the same people a lot of time (fans...).\n\nMore, I see some way to trick the system to start to trade reputation between account now... As you can see in your database, I am not active and I do not plan to be but, what are you doing with all your open windows...? \n\nLet me show you one scenario that I the more obvious one. You only need you and 1 friend. If you start giving 500 reps. People will rush on your question. But at the end you accept only your friend. The same thing for him. So it's a win-win situation to get all your question to the top. This is more than win-win because since your question as more focus you have more probability to get vote for your question AND for your friend answer.\n\nFor other scenario I'll wait, but this system is now open to trading. Welcome trouble."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Jan 28, 2009", "message": "Since bounty questions are likely to be much more visible they may also function as a way to trade rep for badges.\n\n---\n\nI've submitted a suggestion for \"Multiple Bounties - changing accepted answer leaves bounty\"\n\nPlease show your support or poke holes in my suggested implementation: http://uservoice.stackoverflow.com/pages/general/suggestions/111472-multiple-bounties-changing-accepted-answer-leaves-bounty"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Jan 28, 2009", "message": "I meant to say in my last post, after:\n\n&gt; Since bounty questions are likely to be much more visible they may also function as a way to trade rep for badges.\n\nMaybe it would be a good idea not to award badges for questions that have had a bounty posted."}, {"author_name": "David Frohnat", "gravatar_hash": "b0db7d00a345234fefd117a45f90aa04", "author_url": null, "date": "Jan 29, 2009", "message": "Still curious about\n&gt;Gregory Harris says:\n&gt;January 27th, 2009 at 4:41 pm\n&gt;Another question, what happense when:\n&gt;\n&gt;1) I post a bounty\n&gt;2) I do something to soil my reputation below\n&gt;the bounty\n\n&gt;Will the bounty still be payable? Will I\n&gt; now have a deficit in my reputation if that’s\n&gt; the case? Just curious…"}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Jan 29, 2009", "message": "How's about this for a triple-whammy exploit:\n\n1).  Add a bounty to a question (say 300 points).\n2).  Take advantage of all of the great answers you get from the bounty-hunters.\n3).  Seven days is nearly up and you don't want to pay out so you create another account and post an answer similar to one of those posted by someone else.\n4).  Accept the answer from your alter-ego.\n5).  Post some other question from the alter-ego account and attach the full bounty (the original 300 points + the 50 point bonus from the generous people at StackOverflow).\n6).  Post an answer from your primary account.\n7).  Accept the primary account answer to receive back your original bounty, the 50 point bonus and a further 50 point bonus for a total profit of 100 points."}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309", "date": "Jan 29, 2009", "message": "@Dan and other, let's recap:\n\nYou take a community-based good: the reputation, and you try to transform that into a market-based good: a currency for bounty.\n\nThe major difference between those goods is their respective management: \n\n- one is attributed by the community (and in a very small way by the asker: +2 when he accepts). It is win-win in the sense of everybody is showing appreciation (+10) or small critique (-2) to everybody.\n\n- The other (\"currency for bounty\") is managed by the asker: +huge chunk of \"rep\" to someone when the asker accepts an answer, -huge chunk of \"rep\" from the asker: win-loose (loose for the asker, loose for the community which has no more say in this rep increase)\nAnd this later good (this \"currency for bounty\") is even managed by no one(!?), or rather by the \"system\", when the asker choose not to choose any answer. It is the \"gamble\" mentioned by Jeff earlier, \"just like in real life\" he says... (that is the part I call \"win-screwed\" ;))\nWell, the cynical part of real life may be, but what makes SO so nice is that it was based on a noble bet: that it could function based on the generous altruistic selfless behavior also present in the real life.\nNot any more.\n\nIn short, \"reputation\" has never been made to and can never be used to a market \"one-to-one\" usage. \nTo think otherwise leads to greediness, greediness leads to selfishness, then misery, then... the DARK side!\n(Or it means I read one too many time Timothy Zahn Star Wars novels)\n\nAgain, there are other solutions to long term management of question status. Bounty is not one of them."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Jan 29, 2009", "message": "jeff - yea this is cool and all, but wheres the podcast?!?!!!!1  I count on listening to that every Thursday morning!! &gt;3"}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 29, 2009", "message": "@theman\n\nThe podcast is delayed because Joel was in Europe\nhttps://twitter.com/codinghorror/status/1158038686"}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Jan 30, 2009", "message": "well... thanks to nobody...\nsorry i couldnt resist ^.\n\n\nIm not big into the whole twitter thing. sorry for misunderstanding"}, {"author_name": "Nescio", "gravatar_hash": "b2a1175bd176dc1b1abe3da055eccb10", "author_url": null, "date": "Jan 30, 2009", "message": "1 \n \n I am not sure how other people feel about this, but I would like to offer a bounty on questions that interest me, not just the ones I ask myself. This does not seem possible with the current bounty system as only the original poster can choose to create a bounty question. It seems a system could be set up to allow up voted questions to automatically gain bounty status after x days of unaccepted answer, or an answer without a minimal amount of up-votes. This way the community can decide the worth of a question without the need for punitive consequences, or cheating the system (sacrificing rep, answer sniping, etc...)"}, {"author_name": "krosenvold", "gravatar_hash": "48ad44fb319fc06a737a082820bff3ea", "author_url": null, "date": "Feb 03, 2009", "message": "There is still a total rep cap of 200 for each day, even including the bounty? I thought it was supposed to be ex. bountu points.... ?"}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309", "date": "Feb 04, 2009", "message": "@krosenvold: I confirm the total rep cap does include bounty points: if you won 200 bounty points, you will not get a single point for other subsequent upvotes.\n\nRight now, if you were close to 200 points, the bounty points will still be added in full, but again, you will not gain any more points for other upvotes, since you are now above the 200 rep threshold.\n\nI do not know if it is a bug or a feature. Obviously, bounty points should be part of the 200 rep cap at all. \n\n@SO team: you do realize that by introducing a \"7 day\" limit, you add an \"ebay\" component which is not there in the  about page (http://stackoverflow.com/about).\n\nThat means you *demand* that your users alter drastically their behavior and monitor their question in a very different way.\n\nAnd of course, that fails: See http://stackoverflow.uservoice.com/pages/general/suggestions/115548-bug-bounty-points-incorrectly-attributed-to-my-answer"}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309", "date": "Feb 04, 2009", "message": "Unbelievable...\n\nThe bounty system has one serious flaw (this auto-accept system which makes no sense whatsoever).\n\nOf course, it is not long before it starts to go wrong.\n\nI try to make things right (http://stackoverflow.uservoice.com/pages/general/suggestions/115548-bug-bounty-points-incorrectly-attributed-to-my-answer)\n\nAnd all I receive is the middle f... : declined as \"working as designed\" ?!\n\nInstead of assuming the defaults of an \"ebay\" feature which has no place in the original design of SO (See about page http://stackoverflow.com/about), the SO team simply ask us to get lost.\n\nNice.\n\nAgain, for the earing-impaired, trying to put the role of currency to the reputation points is ridiculous: those are two very different items, managed in a very different way. They are by nature **incoherent** (i.e \"without logical or meaningful connection\", \"different or incompatible by nature, as things\")\n\nNot all need to be scratched: the \"Featured\" panel is a good idea (as the number of \"Necromancer\" badges can attest for).\n\nThe rest needs to go, and the concept of long term question status management need to be seriously re-designed, and addressed in a way which respects the original intent of the SO site."}, {"author_name": "dacracot", "gravatar_hash": "f410fbf6f72198a97b0a08489c4aeaaa", "author_url": "http://tox.sourceforge.net/", "date": "Feb 04, 2009", "message": "So my 500 point bounty question currently has one answer which is incorrect and has -1 votes.  At the end of 7 days (2 days from the time of this post) if this is the only answer, it gets half of the bounty.  Wow.  This is beyond words."}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309", "date": "Feb 04, 2009", "message": "@dacracot: No: an \"automatically\" answer needs 2 votes at least to be chosen by the system.\n\n(see the answer to my declined uservoice case: working as designed; post with most upvotes (minimum of 2 required) is accepted at end of bounty period)\n\nHowever for you it means the same thing. You took a \"gamble\" and you may lost.\n\n\"Gamble\" has always been part of SO. Before bounty, you gambled on the generous, disinterested and altruistic behavior of your peers.\n\nNow you have to forfeit the very acknowledgment your peers has given you (rep points) in order to gamble and loose reps, or even get screwed by the SO system itself (if a crappy answer gets selected).\n\nThe fact that you may get a good answer in the process is moot: the end should not justify the mean.\nI.e: the mean (bounty) is inconsistent with the end (get an answer for an old question), because rep points and currency are not the same thing (hence the inconsistency).\n\nBy introducing a bounty system, SO team forces an \"ebay\" system where users need to respect a dead-line, notion unknown until now.\nNaturally, most of them forget the dead-line, which results in an automatic choice of the most upvoted answer (even though it may have been written *before* the bounty, which makes no sense whatsoever).\n\nTo pretend that rep points are not currency is just willfully turning a blind eye to the reality of the situation: look at ebay: it does need 2 separate ingredients to function properly: currency and reputation. And it is widely complex to manage.\n\nAgain, bounty has nothing to do with SO original vision."}]}