{"response": [{"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Jan 30, 2009", "message": "Congrats! Hopefully this will reduce/remove the problem I occasionally see of all the icons being missing for WMD... if it only has to make 1 request I suspect it's more likely to work :)\n\n(It's possible this happens more often when I'm surfing over 3G... not sure.)\n\nLooking forward to any further improvements... although I already find myself writing `stuff` when blogging with Windows Live Writer and then getting annoyed when it doesn't work..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 30, 2009", "message": "> this will reduce/remove the problem I occasionally see of all the icons being missing for WMD\n\nThis version was deployed for about an hour. gravatar is having perf problems and WMD had its own (crappy) event management system, that blocked until the entire page was fully downloaded. We switched it to the JQuery DOM Ready event and redeployed."}, {"author_name": "jake", "gravatar_hash": "87ea936495cdab72ce5965f2dbc7e601", "author_url": null, "date": "Jan 30, 2009", "message": "Jeff, the css sprite thing was Joel's idea from podcast number 38 i think. taking credit for the one picture idea is a tad uncool methinks"}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Jan 30, 2009", "message": "I have actually noticed the question pages loading faster, good work."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Jan 30, 2009", "message": "@Jake: Where did Jeff particularly take credit for it himself? He's just applied the idea. (It's not like Joel invented the idea either of course...)"}, {"author_name": "Sam", "gravatar_hash": "fe24cd0eaa2ff78a42b265fafec55565", "author_url": null, "date": "Jan 30, 2009", "message": "Jeff didn't take credit for it; when Joel brought it up Jeff said that they were already working on it."}, {"author_name": "Michael", "gravatar_hash": "f4f4b5a6f27f72b32d42463b1a25e0df", "author_url": "http://stackoverflow.com/users/29/michael-haren", "date": "Jan 30, 2009", "message": "Did that reduce it from 14 or 14*3? Nice work. I really appreciate you keeping us so in the loop on development, struggles, improvements, etc--thanks!"}, {"author_name": "Matt", "gravatar_hash": "6e9fc2629967a6893a162ed52c9e2fa2", "author_url": "http://kriegster.com", "date": "Jan 30, 2009", "message": "Hi Jeff - I know you and Joel were debating this too, and I'm also curious.  I assume that doing this would provide some performance improvement, but it is material, e.g. will a user actually detect it, or is it just \"faster\" but not noticable?\n\nthanks"}, {"author_name": "Dana", "gravatar_hash": "48b293567484edc02cd70efa8bf3f9cc", "author_url": null, "date": "Jan 30, 2009", "message": "@Michael - Not 14 * 3, just 14.  The old buttons did highlight and inactivation using CSS.  IE makes doing this with image sprites nigh impossible due to the lack of positioning in the IE image filters so I just added the extra rows to pre-generate the highlight and inactive effects."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Jan 30, 2009", "message": "Are you planning to release it? Not that I need it. You might get more contributors and they might enhance it even more."}, {"author_name": "Dana", "gravatar_hash": "48b293567484edc02cd70efa8bf3f9cc", "author_url": null, "date": "Jan 30, 2009", "message": "@Abdu - WMD is on github.  Anyone can grab the code and contribute."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://stackoverflow.com/users/1438/jon-ericson", "date": "Jan 30, 2009", "message": "I actually have noticed the site has gotten a lot slower this afternoon.  Presumably this change is *not* the problem.  But the timing seemed suspicious to me."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 30, 2009", "message": "> I actually have noticed the site has gotten a lot slower this afternoon. \n\nYeah, we DDOS'ed ourselves a little bit... long story. The surprising thing is that the server actually survived and was reasonably responsive."}, {"author_name": "Andrea", "gravatar_hash": "d442474b9c83d51a32049cd3f61cb44f", "author_url": null, "date": "Jan 30, 2009", "message": "after the latest update (some minutes ago) I am unable to use the editor and when I click on \"comments\" it doesn't show up in FF3 - Ubuntu. It works using epiphany."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Jan 30, 2009", "message": "@jake relisten to podcast #38. Joel talks about CSS spriting but it's obvious that Jeff is already aware of it and was already planning to implement this feature. In fact, Jeff is the one who mentions the name of the technique.\n\nThe relevant section starts 19 minutes in, pay attention at 20:30."}, {"author_name": "Peter LaComb", "gravatar_hash": "fcffc30cefd7a6870fb97c4ddee01227", "author_url": null, "date": "Jan 30, 2009", "message": "Still can't help but think that this editor is a http://en.wikipedia.org/wiki/Weapons_of_mass_destruction"}, {"author_name": "J. Philip", "gravatar_hash": "f1942d6c5827db0ebc6940821d3d14f1", "author_url": null, "date": "Feb 01, 2009", "message": "I wrote a Symfony plugin (http://www.symfony-project.org/plugins/sfWmdPLugin) and I had made a slight change to the obfuscated code to add a Browse Server button in the Add Image dialog.\nIf this button is activated, it calls a callback function to pop up an image browser defined by the application.\nIs there any chance you could include that in your version?\n\nOne problem I have with the editor is quite a bit of flicker when one is typing an there is an image loaded in the preview.\nAnother problem was when I had several editors on the same page and when IE did the dynamic loading of JS files asynchronously, some code was executing before the editor files were completely loaded, causing an error. I fixed that by forcing the static loading of all the files.\n\nOn JQuery, I hope you keep a version that is JS framework independent because there are lots of people that use other ones and compatibility could be a problem."}, {"author_name": "Will", "gravatar_hash": "7a0492b3fd266c7ebd65f3cfce437ebc", "author_url": null, "date": "Feb 01, 2009", "message": "I don't doubt that this is a great improvement, but I still don't understand why browsers would be making the same 14 requests for these static images over and over again.  Why are they not being cached locally?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 01, 2009", "message": "Will, see this:\n\nhttp://yuiblog.com/blog/2007/01/04/performance-research-part-2/\n\n\"40-60% of Yahoo!'s users have an empty cache experience and ~20% of all page views are done with an empty cache.\""}, {"author_name": "J. Philip", "gravatar_hash": "f1942d6c5827db0ebc6940821d3d14f1", "author_url": null, "date": "Feb 01, 2009", "message": "Do you have any example on how to instantiate several editors on the same page.\nI had it working with the examples provided by John Frazer, setting autostart to false but it does not work anymore with this version."}, {"author_name": "Dana", "gravatar_hash": "48b293567484edc02cd70efa8bf3f9cc", "author_url": null, "date": "Feb 02, 2009", "message": "@J. Philip - Yes, this is a SO version so I yanked out a bunch of the startup code which set options.  I was implementing some changes and bugfixes for SO specifically and didn't want to have to worry about other users.  For example, how do optional buttons work with button sprites?  I didn't care about the answer so I yanked all that stuff.\n\nNow that I'm getting a pile of requests from the Google Code crowd I'll probably fold that stuff back into a v2.1 and push it to git.  Stay tuned over the next month.\n\nv3.0 will use jQuery and probably a couple of plugins.  I'll leave the v2.x branch jQuery-free."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://cznp.com/", "date": "Feb 04, 2009", "message": "A small hint for people who are spriteing. If you are saving the files as a PNG and its fairly large then have it as small in height as possible. Make the repeating elements go on the width axis and the file size will be smaller and loading will be quicker.\n\nThis is due to how PNG stores images."}, {"author_name": "Greg Gurevich", "gravatar_hash": "67adf64432ec423d510aa36bed658180", "author_url": "http://quantpapers.com", "date": "Feb 09, 2009", "message": "Great Job guys, keep up the good work!"}, {"author_name": "Per Wiklander", "gravatar_hash": "0c088574a5e14c9e4b3fc91870a0477d", "author_url": null, "date": "Feb 11, 2009", "message": "About the spriting bussiness:\n\nHave you looked into the whole data URI thing? Sprites are so last year ;-) Now you can combine all CSS and [background] images into ONE file. So you should be able to get down to 3 http requests\n\n1. HTML\n2. CSS (minimized + gzipped) + images\n3. JavaScript (combined into one file and minimized + gzipped)\n\nThis does of course not count any extra content on the page like photos.\n\nWith the right tools you can totally ignore all performance issues of having X different CSS and JS files and not doing any CSS sprites. It will all be taken care of for you by the tools, like it should be. Well organized and readable code with an optimized output.\n\nTheory on data URIs:\nhttp://en.wikipedia.org/wiki/Data_Uri\nhttp://www.sitepoint.com/blogs/2008/11/21/why-the-data-uri-scheme-could-help-save-your-slow-site/\n\nAn all in one tool (soon to be released as open source Java lib) that also solves the \"no Data URIs in IE\" problem\nhttp://duris.ru/\n\nPHP implementation of dynamic output filter (should be rather easy to port)\nhttp://aciddrop.com/php-speedy/\n\nA commercial alternative\nhttp://www.getrpo.com/Product/"}, {"author_name": "Dana", "gravatar_hash": "48b293567484edc02cd70efa8bf3f9cc", "author_url": null, "date": "Feb 17, 2009", "message": "The data URI thing is pretty cool but I also think that spriting is a better alternative right now, especially given IEs lousy support for data URIs.\n\nSure you could use that duris tool to get around that but I'd like to have a clean version of WMD that doesn't require any outside libraries or tools (besides showdown.js, that is)."}, {"author_name": "Per Wiklander", "gravatar_hash": "0c088574a5e14c9e4b3fc91870a0477d", "author_url": null, "date": "Feb 18, 2009", "message": "Yeah, I'm not saying you should use it in WMD if it is already working the way you want it, but it is really worth investigating for coming projects. You can't really create the sprites without any sort of tools anyway, right? At least not if they tend to change during development."}, {"author_name": "TomA", "gravatar_hash": "d6fb3e436ce94206550908d76931e121", "author_url": "http://www.catnapgames.com", "date": "Feb 19, 2009", "message": "Partly as an exercise and partly because I wanted to use CSS sprites on a site I was working on, I wrote a little utility that generates a CSS sprite sheet from a number of images fed into it.\n\nhttp://www.catnapgames.com/blog/202"}, {"author_name": "sunnybear", "gravatar_hash": "bdb8c8817a1fbdb510e009befebc89cd", "author_url": "http:///webo.name/", "date": "Apr 28, 2009", "message": "From authors of duris.ru:\nwe have significantly improved PHP Speedy algorythm also with auto CSS Sprites (sprites.in), .htaccess support and auto-change of most of modern CMSs. Now it available as Web Optimizer\nhttp://code.google.com/p/web-optimizator/downloads/list\nTwitter: https://twitter.com/dreamwind"}]}