{"response": [{"author_name": "Matt", "gravatar_hash": "03cd042b82ac85b2c5fe0757a94e0413", "author_url": null, "date": "Jan 03, 2009", "message": "Jeff and co:  you guys have done a fantastic job with StackOverflow, and now have improved the OpenID stuff.  I understand why you went with OpenID, but, really, OpenID is so kludgy.  I can barely get my head around most of the ramifications of using OpenID, and yet I'm supposed to get non-technical users to do this (on other sites, I mean)?  \n\nOpenID is a valiant attempt at a solution to the extremely annoying and insecure multiple usernames/passwords problem, but it falls so completely short of being a workable solution it is almost unusable.\n\nBut, like I said, you guys are doing the best with what is out there."}, {"author_name": "JazzHands", "gravatar_hash": "c705c1d246a9887cbe656dd870a9537a", "author_url": null, "date": "Jan 03, 2009", "message": "Matt - Please explain why it is almost unusable. I find OpenID very pleasant to use."}, {"author_name": "Chaz", "gravatar_hash": "c125870a852b79389553c983657b1331", "author_url": "http://www.chazmeyers.com/", "date": "Jan 03, 2009", "message": "Heh. I thought the whole point of OpenID is you point it at your pretty homepage URL which you control and never ever changes, and through magical  tags you swap your provider as needed.\n\nI guess things aren't always used as they were originally intended."}, {"author_name": "phenry", "gravatar_hash": "e689f710ca901a0665a5e0f459d28a42", "author_url": null, "date": "Jan 03, 2009", "message": "&gt; Please explain why it is almost unusable. I find OpenID very pleasant to use.\n\nMy process for signing in, before today:\n\n1. Visit http://www.stackoverflow.com, click Login\n2. Type in the longish URL for the semi-obscure OpenID provider I made the serious mistake of selecting when I established my account, which isn't even listed in the dropdown anymore\n3. Be confronted with a page telling me I need to sign in to the semi-obscure provider, but which doesn't give me a link to do so to prevent phishing\n4. Type in the URL of the provider, enter what I believe to be my credentials, click Login\n5. Be told that my password is incorrect\n6. Try an alternate version of my usual password, click Login\n7. Be told that my password is incorrect\n8. Remote Desktop to my home computer, launch Firefox, click Tools, click Options, click Security, click Saved Passwords, scroll to the URL for the provider, click Show Password to find out what password I used for this stupid site\n9. Close Remote Desktop, return to provider's site, enter newly remembered password, click Login\n10. Return to Stack Overflow, attempt to log in again, finally succeed\n11. Forget why I needed to come to Stack Overflow in the first place\n12. Seriously reconsider whether any of this is worth it\n\nOpenID is still kind of a mess, in my opinion, but at least now I can log in with my freakin' Google account. Thanks, Jeff."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 04, 2009", "message": "I will point out, again, that OpenID is not required to ask questions or answer questions on Stack Overflow.\n\nDon't like OpenID? Ignore it. Type values into the form and click Submit. Pretty easy!\n\n> This was the #1 item\n\nThis is a bit of a misleading statement; it was only #1 because we systematically closed all the higher items above it first. Top 10 or 20 (depending) is more accurate.\n\nOne final note: as a community of programmers our needs are a bit different than, say, MySpace or CNN."}, {"author_name": "Andres", "gravatar_hash": "96febf6628319ea71712b719462d8927", "author_url": null, "date": "Jan 04, 2009", "message": "@phenry: To be fair, most of your trouble is because of forgetting your password, and that is exactly the problem that OpenId wan't to solve. One login for every site, hence only one password to remember.\nI you can't remember the password you used, I recomend you change it."}, {"author_name": "Mike", "gravatar_hash": "c98e188ba63a7875d61a77d7aaa3f5c7", "author_url": "http://blog.codingfresh.com", "date": "Jan 04, 2009", "message": "During my time away from Stack Overflow with OpenID errors I was probably the harshest critic of the whole process. In reality, however, OpenID is still a very good system and I'm glad to see a site that has the balls to fully implement it as the way of registering an account. The upsides of OpenID often outweigh the downsides."}, {"author_name": "Paul Manzotti", "gravatar_hash": "ec6774536565b24b8750e9b3e1ae58f1", "author_url": null, "date": "Jan 06, 2009", "message": "Given that the point of OpenID is to have a single login for everything, isn't having multiple IDs an indicator of failure?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 06, 2009", "message": "> Given that the point of OpenID is to have a single login for everything\n\nI don't think this is an accurate characterization of what OpenID is for.\n\nHow many forms of identification do you have in your wallet (or purse, or whatever) right now? Probably more than one, right? And each one is useful for different things?\n\nSame principle.\n\nWe're just reducing our wallet from THOUSANDS of identity cards (one per website) to a few dozen."}, {"author_name": "Paul Manzotti", "gravatar_hash": "ec6774536565b24b8750e9b3e1ae58f1", "author_url": null, "date": "Jan 06, 2009", "message": "That's not the impression I get from the three pictures at the top of this page:\n\nhttp://openid.net/\n\nThey even highlight the phrase \"single digital identity\".\n\nAnd technically, I don't have any forms of ID in my wallet (no purse, I'm afraid ;-) ), just a license to drive, and some nice plastic things that I can buy cool stuff with. That they also act as forms of ID is secondary to their function. Kinda like my email address does for quite a few sites I use ;-)\n\nIt's alright, I don't expect to convince you otherwise, but I think that whilst OpenID is an OK idea in theory, in practice it's a mess, especially now that the big boys have implemented their half-arsed, bordering on proprietary, versions. But I do enjoy a good argument though - is this the £5 one? ;-)"}, {"author_name": "Steve Schnepp", "gravatar_hash": "693f9a2f0eea07660d81e9690b6afd96", "author_url": "http://www.pwkf.org/", "date": "Apr 16, 2009", "message": "Why do we need to email you ?\nThe process seems quite time-consuming on your side, since our is much cheaper (quite well distributed). \n\nA little coding time would be a quick-winner, if you just add a \"merge accounts\" button. Doable since the newly accounts would have a very low reputation (mostly 1).\n\nI sent my email BTW. :-) \n\nAnyway, good job thx !"}, {"author_name": "Steve Schnepp", "gravatar_hash": "693f9a2f0eea07660d81e9690b6afd96", "author_url": "http://www.pwkf.org/", "date": "Apr 16, 2009", "message": "Wow... Not even a minute later I got my accounts merged :-)\n\nThat replies to my question... no need to fix something that isn't broken...\n\nThx !"}]}