{"response": [{"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jan 09, 2009", "message": "Is Shawn the Modesty of the, shall we say, \"Modesty Incident\"?\n\nBy the way, congrats on the reverse engineering."}, {"author_name": "Dana", "gravatar_hash": "48b293567484edc02cd70efa8bf3f9cc", "author_url": null, "date": "Jan 10, 2009", "message": "I've already fixed the arrow key, ctrl-delete and non-US keyboard bugs so don't waste any time on those.  I'll work with Jeff to get those patches applied to the site ASAP."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Jan 10, 2009", "message": "Sorry to say this, but I'm still not convinced it's legal for you to do this:\n\nhttp://code.google.com/p/wmd/ states:\n\n\"I'm refactoring the code, and will be releasing WMD under the MIT license soon. For now you can download the most recent release (wmd-1.0.1.zip) and use it freely.\"\n\nNote \"will be\" and \"soon\" future tense, and \"For now\" present tense and the download that links to wmd-editor.com not anything hosted on code.google.com.\n\nAlso note that http://wmd-editor.com/download states:\n\n\"Please visit wmd.googlecode.com for information on the next release, which will be open source.\"\n\nI take this to mean that although John Fraser intended to release unobfuscated code under the MIT licence he hasn't yet and the current obfuscated code WAS NOT released under the MIT licence."}, {"author_name": "cowgod", "gravatar_hash": "b64f6d5b6e0dc9880c030ab90c0fde85", "author_url": null, "date": "Jan 10, 2009", "message": "i have a javascript class that can do css sprites from any image size and generate a full style sheet on the fly.  i wrote it for the company i work for so i can try to see if they'll let me open source it."}, {"author_name": "concerned", "gravatar_hash": "53f7a524cbd754b799a271637e84e5ea", "author_url": null, "date": "Jan 10, 2009", "message": "Is that actually legal? What is the WMD license?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 10, 2009", "message": "concerned, see here:\n\nhttp://code.google.com/p/wmd/\n\nwhere it clearly says \n\nCODE LICENSE\nMIT License\nhttp://www.opensource.org/licenses/mit-license.php\n\nand \n\n\"will be releasing [unobfuscated/minimized code] WMD under the MIT license soon\""}, {"author_name": "Ryan", "gravatar_hash": "5877d375dc4cf7762e49979c306c7f95", "author_url": "http://www.ryandoherty.net", "date": "Jan 10, 2009", "message": "I have a patch that should fix the performance issues, I was able to remove all the polling code that would run in 'idle' mode. Hundreds of function calls every 100ms down to none :)\n\nI've messaged Dana via GitHub to get it reviewed, then I will push it upstream."}, {"author_name": "Tim", "gravatar_hash": "93ad15f9e3fdd8365cdcc48badda8cdc", "author_url": null, "date": "Jan 10, 2009", "message": "“will be releasing [unobfuscated/minimized code] WMD under the MIT license soon”\n\nIt's clearly not released under the MIT license yet Jeff!!!!\n\nThe code you have \"forked\" is not licensed under the MIT license as you keep claiming. There is no code on the Google Code page. All it says is the NEXT relese will be under the MIT license. \n\nhttp://wmd-editor.com/terms\n\nThis page on the guy's website clearly states this:\n\n\"The JavaScript files provided through this service are copyright © 2007 AttackLab. You are not permitted to modify, redistribute, or reverse-engineer these JavaScript files.\"\n\nIt is blatantly clear this code that you have started modifying and distributing under a different license is not under any open source license.\n\nStop hiding behind the information on the Google Code page Jeff, it is not valid for the code on the wmd-editor.com page.\n\nUnless you can get the copyright holder's express permission to modify the code and distribute it under a new license you must STOP or you risk ending up in court spending your life savings defending yourself."}, {"author_name": "concerned", "gravatar_hash": "53f7a524cbd754b799a271637e84e5ea", "author_url": null, "date": "Jan 10, 2009", "message": "Well, it is a bit confusing but it does look like the \"obfuscated\" code might be under MIT license if downloaded from google. But the wmd page doesn't mention the current but only the \"next\" release to be under MIT. \n\nHave you considered that the confusion might be deliberate? It's been done before and various organizations or individuals allowed everybody to use their software until it became widely used by naive people who didn't do enought research beforehand and then attempt to reclaim the money is being made.\nPersonally I would steer clear off the software until the licensing is made perfectly clear. \n\nIt's better to be safe than sorry. \n\nIt would be a shame if Stackoverflow suffered from careless use of unlicensed software. I suggest to scrutinize every line of code used to make sure bad things won't happen down the road."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 10, 2009", "message": "I've had several very friendly email exchanges with John Fraser before he dropped off the face of the planet. I even wrote a blog entry based on one of his email responses, with his permission:\n\nhttp://blog.stackoverflow.com/2008/06/three-markdown-gotcha/\n\nThe current obfuscated code is present on the Google Code page *with an MIT license*. That's what we're using, and what we have always used. There is no other version:\n\nhttp://code.google.com/p/wmd/\n\nwhere it clearly says\n\nCODE LICENSE\nMIT License\nhttp://www.opensource.org/licenses/mit-license.php\n\nThe only mystery here isn't licensing. It's where John disappeared to. He is literally unreachable, at least through the internet."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Jan 10, 2009", "message": "So why is it obfuscated? I mean is it for anti reverse-engineering or for compressing JS? If the author doesn't mind users looking at or modifying his code, why didn't he release an unofuscated version as well?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 10, 2009", "message": "> If the author doesn’t mind users looking at or modifying his code, why didn’t he release an unofuscated version as well?\n\nHe was sort of ashamed of the current code, and had a newer, fancier version he was going to release.\n\nObviously, he didn't, because nobody knows where he is, or what happened to him."}, {"author_name": "Ray Vega", "gravatar_hash": "8ab1e7a181808b0e35932f06a8aff8c9", "author_url": "http://lexicalclosures.blogspot.com/", "date": "Jan 11, 2009", "message": "&gt;&gt; Obviously, he didn’t, because nobody knows where he is, or what happened to him.\n\nBest reason why code that others depend on should be open sourced (i.e. not obfuscated.) This is similar to the question from a previous post: Server Hosting — Rent vs. Buy (http://blog.stackoverflow.com/2008/12/server-hosting-rent-vs-buy/)\n\nIf something unfortunate were to happen to any dependencies that are out of your control (such as a 3rd party propriety software/tool/framework) and you don't know how it works or how to maintain it then YOUR business is in big trouble."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Jan 11, 2009", "message": "I learn good coding by looking at other people's code. I would learn even more when people improve my own code, specially when it becomes popular and widely used.\n\nLet's hope he's OK and will make an appearance soon."}, {"author_name": "Grom", "gravatar_hash": "a14537020ec5b11fea3b956353724860", "author_url": "http://grom.zeminvaders.net", "date": "Jan 11, 2009", "message": "Jeff I think you are on dangerous waters here. The wmd-1.0.1.zip on the google code website includes no license file. Nor does it say anywhere in the zip file that it is under MIT license. And on the site it says:\n\n\"I'm refactoring the code, and will be releasing WMD under the MIT license soon. For now you can download the most recent release (wmd-1.0.1.zip) and use it freely.\"\n\nImplying it is not yet under MIT but will be soon."}, {"author_name": "Shawn", "gravatar_hash": "f878a55e08bacee0af48852c29a02dc7", "author_url": null, "date": "Jan 11, 2009", "message": "Man, I feel so bad and wish you didn't give me credit for this. I really didn't do anything at all, Dana did literally everything."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 11, 2009", "message": "> I think you are on dangerous waters here\n\nI wish you guys could hear how hysterical you sound on this topic. I've told you time and time again, 1) the current code is up on Google code under the MIT license by definition, 2) John Fraser has a good friendly relationship with us, and 3) he intended to release the \"new version\" as MIT as well.\n\nI guess it's *theoretically* possible, in some bizarro world, that John Fraser could hire a lawyer and sue us.\n\nWell, that is, if anyone could ever FIND him."}, {"author_name": "Tim", "gravatar_hash": "93ad15f9e3fdd8365cdcc48badda8cdc", "author_url": null, "date": "Jan 12, 2009", "message": "JEFF, THERE IS NO CODE HOSTED ON GOOGLE CODE. There is nothing in the repository there AT ALL. \n\nAll the download links on the Google Code page link DIRECTCLY to http://wmd-editor.com/downloads/wmd-1.0.1.zip\n\nTHERE IS NO CODE LICENSED UNDER THE MIT LICENSE ON THAT PAGE. It says the NEXT version will be under the MIT License and will be in the repo there. \n\nWhat you are doing is not legal. You are setting a really bad example for other developers to do similar things. You are being really nieve about this Jeff. The author might be friendly with you but you are breaking his copyright by altering the code, changing the license and distributing it. That is explicity against what he has said you could do on his OWN WEBSITE. http://wmd-editor.com/terms\n\nHis intent to release a version under the MIT License does not make this OK. THIS version is not under the MIT license. It is downright rude not to ask the copyrights holders permission to do this even if you are sure he would be ok with it. I know I would be very upset if someone did the same to me. I dont care if you can't get hold of him, either get his permission or do without. \n\n&gt;\"I guess it’s *theoretically* possible, in some bizarro world, that John Fraser could hire a lawyer and sue us.\"\n\nYou live in the USA Jeff, people sue close relatives for petty things every day. You would probably not win such an action against you so I hope you have good legal insurance."}, {"author_name": "BradC", "gravatar_hash": "c5c2165949f71bcd1fafbd8e694ab5f2", "author_url": null, "date": "Jan 12, 2009", "message": "YES!! Ctrl-Delete was a daily annoyance!"}, {"author_name": "Will Dean", "gravatar_hash": "0384512b283b54a1f6f44b7737a1fa5b", "author_url": null, "date": "Jan 13, 2009", "message": "Do you have any profiling information to suggest that this 'image sprite' stuff is an improvement in real life?\n\nIf you've got the caching set sensibly, then surely the 6-8 HTTP requests only happen the first time someone visits that page?"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Jan 13, 2009", "message": "@Will Dean, over 80% of Stack Overflow's traffic is from Google search results, so for a large percentage of visitors it will be the first time they've visited the site.\n\nI think it also pays to make sure the first time visit is as quick and responsive as possible as that will be their first impression of the site."}, {"author_name": "Ryan", "gravatar_hash": "5877d375dc4cf7762e49979c306c7f95", "author_url": "http://www.ryandoherty.net", "date": "Jan 13, 2009", "message": "@Will Dean, check out http://developer.yahoo.com/performance/\n\nAlso, I've worked on performance for http://messenger.yahoo.com and http://addons.mozilla.org and I can say spriting is one of the best things you can do to improve performance. I've seen load times decrease considerably after doing this."}, {"author_name": "Will Dean", "gravatar_hash": "0384512b283b54a1f6f44b7737a1fa5b", "author_url": null, "date": "Jan 14, 2009", "message": "@Sam Hasler - I'm not sure 80% Google tells you quite that much about first-time-visitor numbers - I'm a frequent SO visitor, and as often as not I arrive via a Google search.  I agree that the ratio of repeat to first-time users the edit-control is a vital statistic here, but I don't think we have it.\n\nBut what's actually more interesting about this mini-subthread is that if you posted a question on SO saying 'I'm thinking of unrolling all my C++ loops because I've read this article which says it's a good idea, what do you all think?', 95% of your answers would say 'profile first you numskull'.  Whereas if ask a similar question about a potential web optimisation, people cite articles and stats in support..."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Jan 15, 2009", "message": "Congrats, Dana, for a job well done! I look forward to syncing off your branch the next chance I get to work on the code. :-)\n\n(Which is, unfortunately, not any time soon---we're moving to the US in less than a month!)"}, {"author_name": "Scott", "gravatar_hash": "e794476eb6126446084152086a1f1e5c", "author_url": "http://www.spoiledtechie.com", "date": "Jan 15, 2009", "message": "Why use Git and not use an SVN repos?"}, {"author_name": "Carl Meyer", "gravatar_hash": "568e3833dc58aa9163aabf5a2b86c923", "author_url": null, "date": "Jan 21, 2009", "message": "&gt; I wish you guys could hear how hysterical you sound on this topic.\n\nJeff, you're coming across as rather in denial here.  Several things are pretty obvious to the most cursory examination:\n\n1. There is NO CODE in the googlecode repo.\n\n2. Thus there is no code released under an MIT license.\n\n3. The code hosted at wmd-editor.com is very clearly released under terms prohibiting reverse-engineering it.\n\n4. Thus you're very clearly violating the terms of use, and it's a bit confusing why you think that an exchange of friendly-but-vague emails with the author changes this."}, {"author_name": "Carl Meyer", "gravatar_hash": "568e3833dc58aa9163aabf5a2b86c923", "author_url": null, "date": "Jan 24, 2009", "message": "@chapado: \"Have you read all the emails that were exchanged?\"\n\nIf John explicitly gave Stack Overflow permission to reverse engineer the code, Jeff would have produced (ot at least mentioned) that by now, and this entire discussion would go away.\n\n@chapado: \"disappearing from the internet for 4-6 months probably means that somebody reverse engineering code he was going to release anyway is the least of his problems/focuses.\"\n\nThat's an interesting and unconvential interpretation of contract law.  I didn't realize that \"disappearing from the internet for 4-6 months\" apparently waives one's right to have the license terms on one's software respected."}, {"author_name": "chapado", "gravatar_hash": "337d039bc14a5f312bcfbc12a66f0141", "author_url": null, "date": "Feb 07, 2009", "message": "It's not an interpetation of contract law, it's being in touch with reality."}, {"author_name": "Jonathan Dickinson", "gravatar_hash": "d98d1b1af054339535845a725fc42aa0", "author_url": "http://geekswithblogs.net/jcdickinson/", "date": "May 12, 2009", "message": "@Tim he followed a link from the Google Code page (on which it was stipulated the code as MIT licensed). It doesn't matter what was on the original WMD page - 'he might never have seen it.'"}]}