{"response": [{"author_name": "zzzzBov", "gravatar_hash": "248d820c4cc1b6eb7924c658c45443b5", "author_url": null, "date": "Nov 20, 2012", "message": "Thanks for making me check why my right channel wasn't working on my headset -_-"}, {"author_name": "HaskellElephant", "gravatar_hash": "8eb2178645e26d829aaa67925c41b4cc", "author_url": null, "date": "Nov 20, 2012", "message": "Loving it, although needs more carrying of fuel..."}, {"author_name": "Terkel Sorensen", "gravatar_hash": "c831eb682e203d11ae2168b2c8dc75b2", "author_url": null, "date": "Nov 20, 2012", "message": "Thanks for an god podcast :)"}, {"author_name": "Dylan Roy", "gravatar_hash": "418a4a4cbf939a09bb3a533c1671f38d", "author_url": "http://www.dylanroy.com", "date": "Nov 20, 2012", "message": "Well time for a mass exodus to Quora, maybe then we will have as good of questions as Judaism. I usually head over to onstartups to read the blog and the questions, but I understand what you were getting at."}, {"author_name": "JYelton", "gravatar_hash": "cc043bd3e7305db7daebedf511206fc8", "author_url": null, "date": "Nov 21, 2012", "message": "Just some constructive criticism: there's a lot of talking over each other, interruptions and the like. Sometimes it's warranted, but more often it just makes it difficult to listen."}, {"author_name": "Christopher Galpin", "gravatar_hash": "030d305207a41c1452a05bb6b36e8a6e", "author_url": "http://codeoptimism.com", "date": "Nov 21, 2012", "message": "That was rather a shock listening to the podcast like I always have from before StackOverflow existed and hearing my question mentioned! Hah!\n\nJust FYI the SE answer was actually significantly more valuable than Google's search results, I think you're neglecting the \"from nothing\" part. Establishing credit from nothing is a little bit of a catch-22 and while other sites may mention ways to do it (secured card, piggybacking), they don't mention the best, or the specifics. Granted neither did those answers but they at least answered it to a *further* degree than everyone else.\n\nAlso the answer made some interesting points about it being used as a method of identification in the U.S. which I thought was quite to the heart of the issue and educational.\n\nSo Joel's interpretation is a little bit misguided. ;) Now had the question been \"What's the fastest way to raise my credit score?\" I would have agreed with his points. I think he generalized to this, but my question was actually a counter-example. I believe the general question has already been (somewhat) answered on Money.SE."}, {"author_name": "Raphael", "gravatar_hash": "6a4d2d42ded7e86ca65f2d45b6cad765", "author_url": "http://lmazy.verrech.net", "date": "Nov 22, 2012", "message": "We have had the new community evaluation queue on cs.SE -- I like it!\n\nBut whatever have you done to my poor native language? O.o"}, {"author_name": "Guy Schwartzberg", "gravatar_hash": "29d188eb6f3462468151e36988b45049", "author_url": "http://directvvsdish.net/", "date": "Nov 25, 2012", "message": "I love it! and I'm curious with this \"you’ll hear about hats\" or has this been broadcast?"}]}