{"response": [{"author_name": "Iszi", "gravatar_hash": "8f8571493d71202986f2a6ab0dbd7c23", "author_url": "http://security.stackexchange.com", "date": "Nov 09, 2012", "message": "I spotted a StackOverflow shirt in a post-Sandy blog on ComputerWorld. Did you guys have anything to do with this?\n\nhttp://blogs.computerworld.com/disaster-recovery/21271/was-saving-data-center-worth-risk"}, {"author_name": "dmi3y", "gravatar_hash": "0188f1d4ce09f74e37c74da2f1230db2", "author_url": null, "date": "Nov 09, 2012", "message": "Hey, I could not see full g+ popup on Chrome on share because it cut down by iframe widget!"}, {"author_name": "Ivan T.", "gravatar_hash": "6680674eac3a35e2ab2a11a4626de9e9", "author_url": "http://about.me/tci", "date": "Nov 09, 2012", "message": "I know what is a hurricane (indeed, 3 of them), and heard a lot of personal stories from friends and co-workers about how to protect and recover IT resources (even waterproof packaging the HDD into the bathroom on a 3rd floor). We learn that the most useful practice is having servers outside the state/country or inland. With global warming you should expect a big one hit there one of these years (I hope not but no one knows).\n\nA picture speaks more than words: http://bayimg.com/EaFhKaaem"}, {"author_name": "AlwaysFixing", "gravatar_hash": "a1a67f11c5e05a0c4ac1df5da68d829d", "author_url": null, "date": "Nov 09, 2012", "message": "This was a fascinating podcast!   This is a near worst case scenario for us syadmins, and your team kept it going.    \n\nThis is proof of the value of onsite sysadmins."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Nov 11, 2012", "message": "Does this make you question if Manhattan is a good place to have a data center?\n\nIf you are a high speed trading outfit, or Akamai, then being microseconds from  your customers matters. But SO only has a small fraction of it's users in New York and even the fastest first answer can survive a 20ms coast-coast ping.\n\nIs a city subject to regular hurricanes, as well as winter storms baking summers (and occasional attacks by giant apes) the place to put your infrastructure?\n\nPresumably part of the logic is that if there is a problem in NY - compared to some mountain hideaway in Colorado - there is more local support to fix the problem. But any major event hitting NY is going to require a lot more of the emergency support before they get around to keepign a website up and running."}, {"author_name": "Kelly Perugini", "gravatar_hash": "128e82827353eceb621f0dfd79e6117a", "author_url": "http://iphone5vsgalaxys3.org/", "date": "Nov 11, 2012", "message": "wow, very nice podcast. Still going strong after the hurricane. More power to you guys!"}, {"author_name": "Beth Worthy", "gravatar_hash": "2c9e217824b5dde9f279d9bf63ea62ff", "author_url": null, "date": "Nov 11, 2012", "message": "Hi, \n\nHuricane Sandy has recenlty hit New York and the place has suffered a huge economic loss due to this.Since our office is located there also, we have also suffered due to this as the office as the office was closed.I came across several information that has been provided in this blog.Team members have done a great and an appreciable work by shrig this information with the readers of the StackExchange blogs section.Ver fascinating post. \nKeep on sharing some more."}, {"author_name": "Michael", "gravatar_hash": "cd0165a88a06fc92a36f222606f17a11", "author_url": null, "date": "Nov 12, 2012", "message": "Wow, what an epic tale.  And if your goal was to make me feel super-guilty for being mildly annoyed at a half-hour of Stack Overflow read-only mode during the failover to Oregon, congratulations to you, sirs, you have succeeded.  :)"}, {"author_name": "Brandon Zylstra", "gravatar_hash": "91dcba2b1dfefadb9c62f757d100cfef", "author_url": null, "date": "Nov 12, 2012", "message": "I wouldn't laugh at you for having data centers in Manhattan, but I'm very surprised that you would *exclusively* have data centers in Manhattan.  I would *never* run a sizable operation with all data centers in the same place, and I'm pretty sure all the SE sites together *more* than qualify as a sizable operation.  Is there any rationale for that decision, or was it an oversight?"}, {"author_name": "Geoff Dalgas", "gravatar_hash": "b437f461b3fd27387c5d8ab47a293d35", "author_url": "http://stackoverflow.com/users/2/geoff-dalgas", "date": "Nov 12, 2012", "message": "@Brandon you must have missed the fact that Stack Exchange does have two datacenters (NY and OR).  Check your traceroute and you'll notice that you're hitting OR at the moment.  We will continue to run from OR for a few weeks while we are moving equipment to a new datacenter in NY."}, {"author_name": "Dylan Roy", "gravatar_hash": "418a4a4cbf939a09bb3a533c1671f38d", "author_url": "http://www.dylanroy.com", "date": "Nov 12, 2012", "message": "You guys have me laughing like an crazy person at work. Probably one of the most funny SE Podcast I have listened to yet."}, {"author_name": "Matthias", "gravatar_hash": "88a611ccd40b259f2bacba860a759645", "author_url": null, "date": "Nov 13, 2012", "message": "Was there never a point where you were wondering \"Is this worth it? Shouldn't I be home with my family to take care of them?\". I understand it's important for you guys to keep the servers running but I don't think the world would have collapsed without your services for a week or so ..."}, {"author_name": "Andrew Bailey", "gravatar_hash": "9ebec172e390886892c81c90b3d23058", "author_url": "http://theandrewbailey.com/", "date": "Nov 13, 2012", "message": "When Armageddon hits and everyone else is running around with their heads cut off, we tech people will band together make sure things get done. The world isn't over yet.\n\nThank you for the hard work and the epic inspirational story."}, {"author_name": "Will", "gravatar_hash": "6ae413ac6c23c6e9d9d3e0ae2e291748", "author_url": null, "date": "Nov 14, 2012", "message": "This podcast tells me that the key to an effective disaster recovery plan is to hire the right people in the first place.  None if this would have been possible without the dedicated, creative team these companies had in place.  Congrats."}, {"author_name": "Casey Wise", "gravatar_hash": "faf403177d1b24a74d02b4f7706246e5", "author_url": "http://caseywise.com", "date": "Nov 16, 2012", "message": "Wow guys, amazing recount.  Because hind sight possibly missed this huge improbability in light of a natural disaster, have you considered.... just kidding!!\n\nNeat story, thanks for sharing."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Nov 16, 2012", "message": "Sorry originally missed the bit of the podcast where Joel justifies Manhattan as having better infrastructure - even in an emergency\n\nOne issue with big cities we found in London is that in the event of \"an incident\" the police typically don't let you anywhere near the building. So you can have alternate hot-live trading floors with all the power backup and mirroring but if the police don't let your people within a mile of them you are still stuffed."}, {"author_name": "Chris Jenkins", "gravatar_hash": "f2095982dbc8eea05059c2d2aea28133", "author_url": "http://chrisjenx.co.uk", "date": "Nov 19, 2012", "message": "My god guys you have some serious commitment! Well done! I didn't even notice the down time, I can thank you all for that! Really appreciate anyone that helped serious respect from the UK!"}]}