{"response": [{"author_name": "Eagle", "gravatar_hash": "6812a144f6365adaf41972ebe63d4646", "author_url": "http://stackoverflow.com", "date": "Jan 29, 2014", "message": "Obrigado...."}, {"author_name": "Jenson M John", "gravatar_hash": "72d6fc90342960a23b646ab894f91621", "author_url": "http://jenson.in/", "date": "Jan 29, 2014", "message": "Isso é ótimo. Eu sou da Índia e Aprendizagem português .. Cheers..:)"}, {"author_name": "Guilherme Oderdenge", "gravatar_hash": "2095d45e982b57afa220ed5417defaab", "author_url": null, "date": "Jan 29, 2014", "message": "Massa!"}, {"author_name": "bigown", "gravatar_hash": "976163c09407366a12badacca85e754a", "author_url": null, "date": "Jan 29, 2014", "message": "tank iu ;)"}, {"author_name": "Digo Freitas", "gravatar_hash": "ea2a599d8c48e74bb4bd6990759a729a", "author_url": "http://digofreitas.com/hq/", "date": "Jan 29, 2014", "message": "Ótima notícia!\nRegistrando agora =D"}, {"author_name": "Stéphane Bruckert", "gravatar_hash": "aa56a00a9f9ee1f6a72376071da280f0", "author_url": "http://stephanebruckert.com", "date": "Jan 29, 2014", "message": "This must have already been discussed, but I am not sure this is a good idea. Since every programming language is based on English, any programmer already \"speaks\" English in a certain way...\n\nIt will lead in duplicates between both languages. To answer questions on pt.stackoverflow.com will simply be a matter of translation instead of research.\n\nThat may never end if this principle is applied to all languages."}, {"author_name": "Gustavo De Mari", "gravatar_hash": "16ad232553a1f239af289b7c97276427", "author_url": "http://gustavodemari.com.br", "date": "Jan 29, 2014", "message": "Excelente, parabéns a equipe StackOveflow!"}, {"author_name": "José A. Millares", "gravatar_hash": "88ab09736e5a2853721816151810e9e7", "author_url": "http://millares.eu", "date": "Jan 29, 2014", "message": "É unha boísima nova tamén para os programadores galegos! Obrigado."}, {"author_name": "Philippe Gioseffi", "gravatar_hash": "843e0c533ea08bcbfda82d1bfa2d113b", "author_url": null, "date": "Jan 29, 2014", "message": "Awesome! I just hope the brazilians are proactive as the americans."}, {"author_name": "Paulo", "gravatar_hash": "bb5f4a8ce309c54a0e3d0ba19abdde10", "author_url": null, "date": "Jan 29, 2014", "message": "I'm brazilian and think this is a terrible idea."}, {"author_name": "Roberto Teixeira", "gravatar_hash": "93e87f045769bd2c864e5fd7600eb08c", "author_url": null, "date": "Jan 29, 2014", "message": "I guess Yahoo Answers needed some competition :P\n\nTerrible idea, Stack Overflow. Just terrible :)"}, {"author_name": "Daniel", "gravatar_hash": "9ebc00eeb8f3faa5e1f80b02d02ce62f", "author_url": null, "date": "Jan 29, 2014", "message": "@Stéphane Bruckert\nIf I think about a world where StackOverflow is available in every major language I guess I'll not be able to find solutions to my problems just because it has been discussed in spanish :(\n\nThat was really the cool thing about SO: One place where all people ask their questions and everyone one the world can find, understand and profit from the solution.\n\nI guess that could be the worst thing happening to StackOverflow. Think about it ..."}, {"author_name": "Flimm", "gravatar_hash": "936383b387d6cc6d51279e429e5d7cd9", "author_url": "http://askubuntu.com/users/2355/flimm", "date": "Jan 29, 2014", "message": "This is great! I hope to see Ask Ubuntu in other languages soon. Even though it's clearly an English language site, we get quite a few questions in other languages, and many questions that are obviously written by non-native speakers. I would love to redirect them instead of just shooing them away."}, {"author_name": "R. Martinho Fernandes", "gravatar_hash": "f64914b68ff9076e46156c07c96e890f", "author_url": "http://flamingdangerzone.com", "date": "Jan 29, 2014", "message": "Why is the very first Portuguese word on this page misspelled?"}, {"author_name": "Alex", "gravatar_hash": "ec825d0d67c156a2e46533a4baa8057c", "author_url": null, "date": "Jan 29, 2014", "message": "@Daniel\n\n&gt; If I think about a world where StackOverflow is available in every major language I guess I’ll not be able to find solutions to my problems just because it has been discussed in spanish :(\n\nNow you know how non-English speakers feel."}, {"author_name": "VonC", "gravatar_hash": "4fc12eea3fb81ede59d064d0fdbb84ab", "author_url": "http://stackoverflow.com/users/6309/vonc", "date": "Jan 29, 2014", "message": "This simply doesn't make any sense for Stack Overflow. It would make sense for almost any other Stack Exchange site though.\n\nBut for *programming* questions, you won't have enough *contributors* (specialists answering those technical questions).\n\nBecause if you actually are a specialist, you are already answering those *same* questions on Stack Overflow for *years*. In English.\nI know I do.\n\nAnd the idea to duplicate/replicate those answers in another language is not an appealing one, to say the least.\n\nWill there be people asking questions? Yes.\nWill there be enough people *answering* questions? I guess we will find out."}, {"author_name": "Benjol", "gravatar_hash": "501465a53bf1042de206d7d79cc68942", "author_url": null, "date": "Jan 29, 2014", "message": "@Stéphane Bruckert\n\nI suspect that in this case 'never ending' is a feature as far as Stack Exchange is concerned ;)\n\nI'm having difficulty working out why it didn't go through beta like everyone else (or did it?)"}, {"author_name": "Laurent", "gravatar_hash": "53d1c809216013db7948f932c0e24324", "author_url": null, "date": "Jan 29, 2014", "message": "Any reason why Portuguese was chosen for the first international SO? I guess there are more Spanish and possibly Chinese speakers on SO?"}, {"author_name": "Juquinha", "gravatar_hash": "40cdc8c32069ac441ff7f5c9bfe0f9ef", "author_url": null, "date": "Jan 29, 2014", "message": "Parabéns ao amigos do StackOverflow!\nE meu muito obrigado! ;)"}, {"author_name": "Tiago Fernandez", "gravatar_hash": "ae8b94930264c191266ef3a6d94b8ca4", "author_url": "http://tiagofernandez.com", "date": "Jan 29, 2014", "message": "People should stop being lazy and learn English instead, as it's the de facto language for programming anyway."}, {"author_name": "Brent Longborough", "gravatar_hash": "a6a970a3c0b0ab91e0d49f10a6c8307c", "author_url": null, "date": "Jan 29, 2014", "message": "Parabéns e felicitações para todos meus amigos Brasileiros e Lusófonos, bem com para a grande equipe do StackExchange.\n\nCongratulations and Yay! to all my Brazilian and other Portuguese-speaking friends, and, of course, to the great team at StackEchange."}, {"author_name": "Luís Gabriel Nascimento Simas", "gravatar_hash": "7f9629cfe5377704954d9764aff890ba", "author_url": "http://www.devmedia.com.br/autor/luis-gabriel-nascimento-simas/290950", "date": "Jan 29, 2014", "message": "Achei excelente a idéia do Stack Overflow. Pena que alguns imbecis com mente do tamanho de uma Uva Passa não entenderam muito bem o motivo disto. Bando de idiotas.\nParabens ao Stack, vai aumentar bastante o seu gama de auxílio."}, {"author_name": "Ricardo Ferreira", "gravatar_hash": "681dbe3064edb8867999c7a0a919d2fc", "author_url": null, "date": "Jan 29, 2014", "message": "Como português, custa-me sempre ver a minha língua associada primeiro ao Brasil e só depois ao país originário (Portugal)."}, {"author_name": "Andre", "gravatar_hash": "7cd90e158d34b6aa690429a5fd8ba8bf", "author_url": null, "date": "Jan 29, 2014", "message": "For those who think all programmers should learn English, that's a lot easier said than done. You say that because you know English already. Maybe some people don't have time to learn it; maybe some don't want to learn it. Still, they can be great coders and have valuable input to give. I think it's a smart move by stackoverflow.\n\nOn the other hand, I do agree that this will lead to a lot of duplicated questions and translating work (instead of researching and finding answers). Maybe a good idea would be to award points to users willing to translate answers from the english version into portuguese; a translator badge could be created even.\n\nMy one bit of criticism is that my reputation from stackoverflow didn't move over to the portuguese version. I kinda expected that."}, {"author_name": "Guilherme Santos", "gravatar_hash": "9432a17db943fc494e13e996ffe4941e", "author_url": null, "date": "Jan 29, 2014", "message": "I'm brazilian and I'm developing for a while. \nHere in Brazil (Brasil) there is a lot of new developers who don't speak english, and there's a lot of communities for discussing program languages. \n\nWe have strong PHP, Java, HTML + CSS, .NET and etc communities. Also a lot of blogs talking about development. \n\nSo I think this is a great idea to have a stackoverflow for portuguese-speakers.\n\nAlso, there are some regional questions that all developers here would have, like \"Nota Fiscal Eletrônica\" or \"Certificação Digital no padrão ICP-Brasil\", for these questions I won't find solutions in StackOverflow, but now I'll find it in pt.stackoverflow.com.\n\nParabéns!"}, {"author_name": "GeekOnJava", "gravatar_hash": "57eaac2150b635bc796a5453a75d7a87", "author_url": "http://geekonjava.blogspot.com", "date": "Jan 29, 2014", "message": "Thank my partner of http://geekonjava.blogspot.com"}, {"author_name": "Alex", "gravatar_hash": "ec825d0d67c156a2e46533a4baa8057c", "author_url": null, "date": "Jan 29, 2014", "message": "People who indignantly say that \"everyone should just learn English\" are completely out of touch with reality.\n\n1. Just because you grew up in a privileged position to learn it, doesn't mean everyone in the world did.\n2. It's a LOT of effort to learn to communicate in English fluently. Time and effort that could be spent programming. Non-speakers who did not must wear the huge opportunity cost. Why do you think they should put themselves at a disadvantage because of your anglo-centric view of programming?\n3. There is also an issue of neuroplasticity. It's easy to learn languages when you are young. It's much more work when you are an adult.\n\nPlease get off your high horse."}, {"author_name": "Antonio", "gravatar_hash": "b3081804b92cc64990fb4f4f980e35d4", "author_url": null, "date": "Jan 29, 2014", "message": "Stackoverflow debería estar en esperanto\nStackoverflow should be in esperanto\nStackoverflow sollte auf Esperanto sein\n....\nStackoverflowo :-)\n\nYou can learn esperanto in a couple of months. Forget about big effort or years or exception to rules. Think about it ;)"}, {"author_name": "Nuno", "gravatar_hash": "9594c7dabf0cd487b2f0c60a783e8fc2", "author_url": "http://www.portal-gestao.com", "date": "Jan 29, 2014", "message": "Fantástico, parabéns!"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jan 29, 2014", "message": "I love this. There are plenty of untapped markets with people who don't speak English just well enough to confidently participate on a site like Stack Overflow. So more power to internationalization.\n\nThe way it looks right now, there will be no interlinking between SO.pt and SO.en - each site simply has its own repository of knowledge that grows over time. Much of SO.pt's activity, initially, will be about echoing content that already exists on Stack Overflow, but that's not a bad thing (although I hope you will be frowning upon right-out plagiarism, including \"translated\" plagiarism.)  \n\nThis separation is probably for the best, and for most types of questions it is going to provide quality answers on the pt site as well (if the overall community is healthy). \n\nBut sometimes, an answer is a rare gem, a stroke of genius or deep insight by someone especially competent. Do you have any plans to make such content (of which there is plenty on SO.en) somehow available to the .pt community? Or will they simply have to grow gems of their own over time?"}, {"author_name": "Nelson", "gravatar_hash": "777e4d639738d2f1f877c45dac95c143", "author_url": null, "date": "Jan 29, 2014", "message": "How can programmers do their job without ever touching English in their lives?\n\nIf you have the brains and time to learn how to program don't come saying that's too hard or that it's too time consuming, that's bullshit!\n\nEnglish it's in everything you do as programmer, so go learn some english.\n\nNow, about this community, I applaud the effort but I think it's a bad idea and I'll say why.\n\nBy creating this community, you're isolating yourselves by using a different language and restricting the access to a pool of knowledge otherwise available if we all spoke a common language.\n\nThat's my 2 cents.\n\nPs: I speak portuguese"}, {"author_name": "Igor", "gravatar_hash": "89e98eb9b6846e79580e61cbbffe6e07", "author_url": null, "date": "Jan 29, 2014", "message": "Muito bom!!!\nVai ajudar muito. Obrigado por escolher o Brasil em primeiro lugar.\n\nThanks for choosing Portuguese and Brazil."}, {"author_name": "Maurício", "gravatar_hash": "e12998f1714f72a1a9456bd9e7333ccc", "author_url": null, "date": "Jan 29, 2014", "message": "Fantástico, enfim uma comunidade noooosssa.."}, {"author_name": "Guilherme Oderdenge", "gravatar_hash": "2095d45e982b57afa220ed5417defaab", "author_url": null, "date": "Jan 29, 2014", "message": "Nelson, I agree with you. I liked the community, but I'll still using Stack Overflow in English for two reasons: the community is faster, more mature and as you said, I practice my English."}, {"author_name": "Rogério Senna", "gravatar_hash": "228cca6b779d754607ebdd4171edb0e8", "author_url": "http://stackoverflow.com/users/158074/rsenna", "date": "Jan 29, 2014", "message": "Ótima ideia.\n\nPara quem está preocupado com repetição de conteúdo: é uma experiência, um projeto em desenvolvimento, e como todo projeto em desenvolvimento, pode ser modificado no futuro (ou até cancelado, caso **de fato** seja uma má-ideia). Uma possibilidade que imagino ser possível no futuro: fazer um \"cross-reference\" de perguntas semelhantes, em outras línguas.\n\nPara quem acha que todo programador \"deve\" saber Inglês: o fato é que nem todo programador sabe, e isso não impede que sejam bons programadores. Por exemplo, eu conseguiria citar pelo menos 2 ótimos programadores japoneses que simplesmente não conseguem se expressar adequadamente em Inglês (só não vou fazer isso para não constrangê-los, ainda que duvide que eles entendam Português). Ter conteúdo na língua nativa permite que vários programadores possam também fazer parte de uma comunidade, e trocar experiências.\n\n(Eu mesmo, apesar conseguir, mal e porcamente, me expressar em Inglês, me sinto bem mais a vontade em escrever na minha língua nativa.)\n\nPara quem estranhou a escolha da língua Portuguesa: acho que é uma boa língua \"cobaia\" :). Poucos países, muitos programadores. Espanhol me parece uma língua mais arriscada, justamente por ser mais falada. Mas isso é só a minha opinião..."}, {"author_name": "Takeshi", "gravatar_hash": "8f54a63a31b5323d67b68957758e86f7", "author_url": null, "date": "Jan 29, 2014", "message": "Adorei! *(^o^)*"}, {"author_name": "não quero spam", "gravatar_hash": "3c90377199790d4e2d9bdf94a1760008", "author_url": null, "date": "Jan 29, 2014", "message": "um texto cheio de erros ortográficos. uma vergonha.\nisto mais parece um stackoverflow brasileiro. podem mudar o nome para orkutoverflow."}, {"author_name": "Gabriel", "gravatar_hash": "5c8aff9a7209c40a50716c3444665bba", "author_url": "http://www.andar7.com", "date": "Jan 29, 2014", "message": "For those who are complaining about this:\n\nProgramming terms and sintax are simple because are mathematically logic.\n\nComments and opinions, not.\n\nMany times some of us have to deal with english slang and internal references... and here's a surprise: many programmers don't speak english.\n\nThings like \"Now my hoarse\" will not be understood. This has nothing to do with programming and to learn any language is allways good, but it doesn't mean anyone must be forced to...\n\nBesides this, it's interesting for Stack to open it's things to more than 300 million portuguese speakers. The same goes to others languages like spanish, and any of them.\n\nE só pra fechar, torcendo pra que ninguém fique puto, isto me lembrou de uma piada que vou pôr em espanhol, a minha primeira lingua:\n\n¿Cómo se llama a una persona que habla dos lenguas?\n\nBilingüe.\n\n¿Y a una persona que habla más de dos lenguas?\n\nPolíglota.\n\n¿Y a una persona que habla una sola lengua?\n\n....\n....\n....\n....\n....\n....\n....\n....\n....\n....\n....\n....\n....\n....\n....\n....\n\nEstadounidense. \n \nDon't get pissed! it's only a joke!\ncheers!"}, {"author_name": "Seth", "gravatar_hash": "cd9370b91f1da1bd4b29327a4ccbc50c", "author_url": "http://www.sjkstudios.com", "date": "Jan 29, 2014", "message": "Muito obrigado. Um característica espetacular."}, {"author_name": "John", "gravatar_hash": "d492ee1e13f44857d3aa72e11ea49443", "author_url": null, "date": "Jan 29, 2014", "message": "Just terrible idea!\n\nEnglish is the \"de facto\" official language of the world, especially in programming. Most of the books you can find about programming, computing or math are in English. This only leads to fragmentation on Stack Overflow..."}, {"author_name": "higuita", "gravatar_hash": "331fdfccb47a5ba4536fd27c9c531c57", "author_url": null, "date": "Jan 29, 2014", "message": "For those complaining about this, just think what you would think if that all pages in stackoverflow were in Portuguese and that most people speak it (or any other language that you didn't speak/read well).\n\nThen create a SO site for your language and see your opinion change :)"}, {"author_name": "Amro", "gravatar_hash": "4b8ce2e5dff7e913642c84213353f6a3", "author_url": null, "date": "Jan 29, 2014", "message": "A terrible idea!\n\nNext we'll be having Chinese, French, Spanish, Indian, insert-your-favorite-language versions which will only lead to community fragmentation! This decision doesn't make any sense for a programming site like Stack Overflow, perhaps it would have been better for another SE sites..."}, {"author_name": "Telmo", "gravatar_hash": "08e9220c8a14670e90ad07b058209f2d", "author_url": null, "date": "Jan 29, 2014", "message": "Excelente."}, {"author_name": "Acaz", "gravatar_hash": "2bd48ba52943d88eb065c698c1ba807e", "author_url": null, "date": "Jan 29, 2014", "message": "I'm a brazilian and I think this is not a good idea because of the fragmentation of the community, english is essential for every programmer in this world."}, {"author_name": "Rafael Barros", "gravatar_hash": "d45fbc52cc36b80c48b916379cd8aacb", "author_url": "http://mitidev.net", "date": "Jan 29, 2014", "message": "Thanks SE for the effort, but:\n\n1- Big part of the reputation of new SO's sites will be for english knowledge (for translation job), not programming knowledge. Will that person's own questions be reliable even with the big rep?\n\n2- Today, a person don't need to know english well to understand english text, just need the \"translate.google.com\". Someone can think: \"But a portuguese search brings portuguese results!\" The programming languages are in english, so, generally the results are too; the majority of my \"portuguese\" searchs gave me en.SO first results; and we can always translate the search text to english before doing it;\n\n3- Big part of my english reading/writing time is on en.SO, what makes my english every day a little better. \"Rome wasn't built in a day\". With the everyday effort the world moves toward a common language. We don't need walls.\n\nI'm brazilian."}, {"author_name": "Rafael Barros", "gravatar_hash": "d45fbc52cc36b80c48b916379cd8aacb", "author_url": "http://mitidev.net", "date": "Jan 29, 2014", "message": "\"Will that person’s own ANSWERS be reliable even with the big rep?\""}, {"author_name": "John", "gravatar_hash": "78531f3ba19f41e187c867365b199948", "author_url": null, "date": "Jan 29, 2014", "message": "@Stéphane Bruckert\n\nI think the philosophy of SE is that if a site can support itself and there is demand for it, then it has every right to exist."}, {"author_name": "Chris", "gravatar_hash": "3038142cea42b76065fd0e9462d6e210", "author_url": null, "date": "Jan 29, 2014", "message": "It's a great idea to help non-english speaking developers, but I would've wished a better solution.\n\nRequirements:\n- It's possible to ask questions and get answers without knowing any english.\n- It rewards english postings or discourages non-english postings.\n- It connects duplicated questions in different languages.\n\nFor example:\nThere is only one StackOverflow. A question is marked with the original language by a dropdown box. If someone is arriving through the portuguese URL, then portuguese is selected as default.\nFor reading questions it's possible to select a default language, but if it isn't available, english answers will still be visible. Answeres in other languages are only shown as \"needs-translation\" flags. The questions overview might be filtered by language.\nAdd a translate section similar to the review section, where people may get rewards for translating question and answers.\nUsing other languages than english is discouraged by the fact that one won't get as much answers as in english. This won't work if it's a completely separated page, because users won't noticed that there actually is a chance to get a faster/better answer.\nAnd very important: Introduce languages carefully. Use betas to check if there are enough native speakers who can't speak english and check if there are enough translators.\n\nViele Grüße,\nChristian"}, {"author_name": "lm", "gravatar_hash": "5d6e5796dc5dca4bba4cb5a194151630", "author_url": null, "date": "Jan 29, 2014", "message": "Besides being a native speaker, i must say it IS a terrible idea...\n\n\"StackOverflow\" name is in ENGLISH and if you brazillians desire a community just do it, but do NOT \"borrow\" the stackoverflow name.\nSeems to me some \"brilliant\" minds decided they could leverage the name and concept of the comunity as a publicity stunt. \n\nIt's not going to work. \n\nAnd DO NOT EVER geolocate and redirect me, it would be such a PITA!\n\nWhat's next? A programming language with translations? \n\nGet real!\n\nIf you can learn a programming language you can learn english."}, {"author_name": "Amal Murali", "gravatar_hash": "b541b9aab077d68de0548204258e712c", "author_url": "http://stackoverflow.com/users/1438393/amal-murali", "date": "Jan 29, 2014", "message": "Most if not all programming languages are English-based, so why not just use English after all? \n\nHow do you expect non-Portugese people to search for the questions? What about content duplication? The posts that already exist on the main site could get re-asked in Portugese - how do you plan to manage those?\n\nA terrible idea, IMHO."}, {"author_name": "Robson", "gravatar_hash": "aedc60042bc6cee8e5019df9a6860292", "author_url": null, "date": "Jan 29, 2014", "message": "HUEHUEHUEHUE BRBRBR"}, {"author_name": "Miki", "gravatar_hash": "b4d02dc91d4623865c3f2994f52006b8", "author_url": null, "date": "Jan 29, 2014", "message": "Responding to Alex's post, particularly the following gem:\n\n\"People who indignantly say that “everyone should just learn English” are completely out of touch with reality.\n\n1. Just because you grew up in a privileged position to learn it, doesn’t mean everyone in the world did.\"\n\nIf that's \"being out of touch with reality\", riddle me this: what do you call people who indignantly assume that having the opportunity to start learning programming through the Internet is not \"a privileged position\" to a considerably higher degree than being able to learn basic English? \n\nKeep in mind that, for the latter, you neither need Internet access, nor even a computer.\n\nAnd, principally, the argument is not the straw-man \"everyone should just learn English\", but \"people who want to learn programming should also eventually learn its current lingua franca\".\n\nHaving a common, dominant spoken language prevents fragmentation and promotes knowledge exchange. And it's not like you *absolutely* require it - I suspect there's a dearth of programming tutorials in Portuguese, or any other major language, on the web.\n\nI know that's the situation in the case of my mother tongue, which is barely in the top 30."}, {"author_name": "Everton", "gravatar_hash": "f4f4375b61e700a895dd160df97e213e", "author_url": null, "date": "Jan 29, 2014", "message": "Será que o top user será o João Mosquito?"}, {"author_name": "Chris", "gravatar_hash": "3038142cea42b76065fd0e9462d6e210", "author_url": null, "date": "Jan 29, 2014", "message": "@Im: Actually ALGOL86 was translated to several languages. http://en.wikipedia.org/wiki/Non-English-based_programming_languages#International_programming_languages"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jan 29, 2014", "message": "@Miki - \"Having a common, dominant spoken language prevents fragmentation and promotes knowledge exchange. \". I agree it would be nice if things worked that way, but it doesn't match up with reality. There are huge countries out there where the rate of developers versus developers who actiely partake in Stack Overflow is pitiable. \n\nWhile I agree you need to speak English to some degree if you want to be a programmer, there are many people who will never learn the language so well that they feel confident participating in an English-language community - at least not one that by nature will be dominated by native speakers."}, {"author_name": "Andrew Lazarus", "gravatar_hash": "fca765c2ca8ea02f1897879ec60c4ab0", "author_url": null, "date": "Jan 29, 2014", "message": "And when I search for help with my English search terms, will I get hits from the Portuguese version? At least if I do, I can probably read the answers (I can read Spanish fluently), but when the Chinese SO comes around, I will be pretty much up a tree.\n\nTranslating that last idiom into Portuguese is left as an exercise to the reader."}, {"author_name": "Lucas Pottersky", "gravatar_hash": "a645867072faac356a611963c7b1b2f7", "author_url": null, "date": "Jan 29, 2014", "message": "well... too bad that we still don't have a killer automatic translation machine... until then it looks like we will have to fragment our communities by language"}, {"author_name": "Miki", "gravatar_hash": "b4d02dc91d4623865c3f2994f52006b8", "author_url": null, "date": "Jan 29, 2014", "message": "@Pekka: but Stack Overflow is not the only programming-oriented community with a major presence. For example, the vast majority of the most popular open source projects use English for inter-participant communication.\n\nSure, it sucks that some people won't be able to learn even basic English for legitimate reasons and hence will be locked out of mainstream participation. Don't get me wrong, I recognize the situation as being far from ideal, and I would love for those persons to obtain an unhindered, equal learning opportunity.\n\nWhat I argue, 'though, is that one shouldn't compromise a functioning compromise (heh) in the name of the IMHO unattainable goal of 100% \"inclusivity\".\n \nI'm simply afraid that creating language-localized SO sites will eventually lead to a situation where, while the *basic* QAs will be \"solved\" in most major languages, the solutions to esoteric problems will be spread out across many subsites, and thus very hard to find. On top of that, common misconceptions will be less likely to be challenged, increasing the incidence risk of highly-voted, but ultimately factually incorrect answers.\n\nWhat I wish for is that eventually translation technology becomes good enough to render the issue moot. However, I thinks it's still to early for that. Let's hope I'm wrong ;)."}, {"author_name": "qgustavor", "gravatar_hash": "53db4851097baf004d62b1ca2258fdf0", "author_url": null, "date": "Jan 29, 2014", "message": "Argumentos e argumentos. Não importa se der certo ou não, vamos colaborar: quero meus pontos imaginários que não valem nada.\n<i>Falando sério, acho que vai dar errado: brasileiro não vota positivo resposta certa, vota resposta bonita e engraçada.</i>\n<b>BTW</b> someone can fix tabindex on the commenting form?"}, {"author_name": "Ling", "gravatar_hash": "a726de03bed3104ddaecca3fdcf59e19", "author_url": "http://wangling.me", "date": "Jan 29, 2014", "message": "Supporting more languages is good. But one site per language is bad. It is much better to use:\nOne single site + meta language tag on question + user language settings"}, {"author_name": "Eduardo Russo", "gravatar_hash": "e886030108e8a73b1330db08811f3b15", "author_url": "http://faviconit.com", "date": "Jan 29, 2014", "message": "Sinceramente, não gosto da ideia de diluir o conhecimento. Agora pra pesquisar algo tenho que entrar em dois lugares, escrever minha dúvida em duas línguas..."}, {"author_name": "slchck", "gravatar_hash": "94b1872d8b32212d849f9e257af3a9b8", "author_url": null, "date": "Jan 29, 2014", "message": "I think this is a bad idea, mainly because:\n\n1. It will fragment the community.\n2. The reasons why Portuguese was selected don't make sense: SO already has lots of visitors from Lusophonic countries which means that, at least to certain degree, people understand what is written here.\n3. It will inflate ratings for people who are quick enough to look up an answer in English and translate Them. SO is supposed to be programming Q&amp;A site, not a translation service.\n4. Really programmers should know some English. Maybe instead of making a site, you should encourage people who translate questions on the original site.\n\nI really hope you can help more people with the new site, but I'm not overly optimistic."}, {"author_name": "SoboLAN", "gravatar_hash": "8feac14b86e6408e19694122993e7935", "author_url": null, "date": "Jan 29, 2014", "message": "Are you serious ?? StackOverflow in Spanish ??\n\nLike everyone before me said: if you don't know english, there's no way to write any piece of code. All blogs, programming sites, API docs, library docs, absolutely everything is in English. If you really really REALLY need another language... just use Google Translate for Pete's sake...\n\nGo home StackOverflow, you're drunk !"}, {"author_name": "dmvianna", "gravatar_hash": "c8d6345c6e01f0f4ce8acf0792d7769c", "author_url": "http://stackoverflow.com/users/1479269/dmvianna", "date": "Jan 29, 2014", "message": "I understand the utility of having two communities based on language. It is obvious that a programmer needs to know __some__ English. But often a programmer's fluency in English is not enough to participate actively in a debate. English speakers often don't understand that, due to them not needing fluency in a foreign language to communicate to almost everyone.\n\nIt is true that the best content will always be in the English language site, but the Portuguese site can be a stepping stone to build the Portuguese speaker's confidence. These users will eventually migrate to the English site in search for better / more complete answers.\n\nSome people have a bad habit of assuming their community is composed only of experienced/mature programmers, and whoever is not at their level of expertise should either grow up or leave. That is wrong. There is no harm in lending a helping hand to people who are on their way towards improving their skills, both in English and programming."}, {"author_name": "roger", "gravatar_hash": "9887130ab70f6e66b50f2c5e19272c67", "author_url": "http://betterlogic.com/roger", "date": "Jan 29, 2014", "message": "please provide an english translation of this page, otherwise non native speakers won't understand the motive behind the pt site..."}, {"author_name": "AlbeyAmakiir", "gravatar_hash": "fa1512d38160d0546361d2723d0949e4", "author_url": null, "date": "Jan 29, 2014", "message": "The English found in programming, itself, is nowhere near enough to form any kind of coherent human sentences, let alone enable someone to contribute on SO. They may as well be nonsense words.\n\nSaying that everything in programming is already in English, therefore we should keep it that way, is a tradition fallacy.\n\nEnglish is pretty terrible. It's really hard to learn, moreso than other European languages.\n\nSaying it's bad because \"fragmentation\" without explaining why is like saying it's bad because \"magic\"."}, {"author_name": "Patrick", "gravatar_hash": "fd0e53937bb21b530e58148354866fa1", "author_url": null, "date": "Jan 29, 2014", "message": "*Excellent* idea, guys. Now you could provide a site in Spanish too (I'm sure there are more Spanish-speaking visitors than Portuguese ones, right?).\n\nAs for everyone who disagrees with this - there is a difference between being able to understand what a few select words mean (i.e., as a programmer) and being proficient enough in a language to read and write it."}, {"author_name": "fernando", "gravatar_hash": "e5e4173b673238af6bf64bfaf7f2358c", "author_url": "http://www.bitsrandomicos.blogspot.com.br", "date": "Jan 29, 2014", "message": "This is not about 'English is the standard in programming blablabla'...\n\nComments, detailed answers and experiences are not programming languages, so this may help programmers who are not fluent in English.\n\nPeace"}, {"author_name": "Mason Wheeler", "gravatar_hash": "50facfccdffe2e9cabaa589205959d30", "author_url": "http://tech.turbu-rpg.com", "date": "Jan 29, 2014", "message": "<blockquote>When I turned 11 we had to leave East Germany overnight because of the political orientation of my father. Now I was going to school in West Germany, which was American-occupied at that time. There in school all children were required to learn English and not Russian. To learn Russian had been difficult, but English was impossible for me. I thought my mouth was not made for speaking English! My teachers struggled. My parents suffered. And I knew English was definitely not my language.\n\nBut then something changed in my young life. Almost daily I rode my bicycle to the airport and watched airplanes take off and land. I read, studied, and learned everything I could find about aviation. It was my greatest desire to become a pilot. I could already picture myself in the cockpit of an airliner or in a military fighter plane. I felt deep in my heart this was my thing!\n\nThen I learned that to become a pilot I needed to speak English. Overnight, to the total surprise of everybody, it appeared as if my mouth had changed. I was able to learn English. It still took a lot of work, persistence, and patience, but I was able to learn English!\n\nWhy? Because of ... a strong motive!</blockquote>\n-- Dieter Uchtdorf, former German air force pilot and later Senior Vice President of Flight Operations with Lufthansa."}, {"author_name": "Angel", "gravatar_hash": "5de8cf93621a27fa672efb5ceb79d574", "author_url": null, "date": "Jan 29, 2014", "message": "Now in spanish please...\n\nOff Topic: It's offensive just suggest that everyone should learn english because yada, yada, yada... When it comes to numbers, there are MORE spanish speakers than english speakers."}, {"author_name": "Victor", "gravatar_hash": "526d2a72f963ccc832e565e7e1043e9b", "author_url": null, "date": "Jan 29, 2014", "message": "For all those people who thinks that it will go wrong. I am sorry to disappoint you: It is going really very well. Who particpate on private beta really knows what I am talking about. The questions and answers quality are pretty high and the community is already very successful.\n\nPeople asks questions and post answers much better in their mother tongue than in a different answers, and that is the reason why I got much better answers for my questions in portuguese StackOverflow and also could post much better answers. I am sure that current proposals of spanish, turkish, russian, arabic, german and french StackOverflow will be very successful.\n\nFurther, we have some localized programming questions that does not makes sense in english StackOverflow, like thinks about \"Nota Fiscal Eletrônica\" and \"Correios\"."}, {"author_name": "Spacewalker", "gravatar_hash": "6e13c3654c780709f3caec8b32359eca", "author_url": null, "date": "Jan 29, 2014", "message": "Elitism in these comments is unbearable. Those claiming people should stop being \"lazy\" and \"just learn English\" should get over themselves."}, {"author_name": "mehow", "gravatar_hash": "1100758a0c4987aac1f3604c8147e2c4", "author_url": "http://vba4all.wordpress.com", "date": "Jan 30, 2014", "message": "English is the programming language. \n\nNot being racist or anything but this Portuguese site was created simply to drive more traffic to this site...\n\nI can already see professionals leave and look for an alternative to Stack Exchange model as it becomes worse and worse day by day"}, {"author_name": "Henrique", "gravatar_hash": "c26319cc49b566ed006187b63384d95e", "author_url": null, "date": "Jan 30, 2014", "message": "Excelent idea, but Portugal-Portuguese is a bit different from Brazil-portuguese.\n\nI would like to see a S.O. in Portugal Portuguese."}, {"author_name": "Rickard", "gravatar_hash": "7ca3cdf733e5ad7ca41c58ba43d06dcd", "author_url": null, "date": "Jan 30, 2014", "message": "This is a terrible idea. There will always be one \"global language\" at a time, and right now that language is English. It has been German, and it has been French, and it used to be Latin, but right now it is English. One day it may be something else.\n\nBy fragmenting the community based on native language, everyone will lose. One of the things I appreciate with engineering is its universality. As long as you speak the same language, you can communicate and appreciate ideas with everyone in the whole world (unlike, say, law or history). We should all embrace this and promote communication with everyone in the world. For that, we all need to have at least one language in common.\n\nI hope this is a one time mistake."}, {"author_name": "this", "gravatar_hash": "54d4829f573c8f6f02d5f486ad37789c", "author_url": null, "date": "Jan 30, 2014", "message": "@Andre\n\nEnglish is one of the easiest active languages. If you devote your career to programing then not learning English is a very poor decision, that will do more harm in the long run.\n\n\n\n@Alex \n\n1. \nIf you have access to a computer and internet, then you are one of the \"privileged\" to learn English.\n\n2.\nEnglish is easy, in the long turn, the time spent learning it, will soon be offset by the benefits.\n\n3. \nThat sound like a myth. Even if it were true, then how can such person learn a programming language."}, {"author_name": "Fabio", "gravatar_hash": "0934c8a7bb35cbfc8119e9e0b6530a71", "author_url": null, "date": "Jan 30, 2014", "message": "Not a good idea."}, {"author_name": "Jneto", "gravatar_hash": "74fb8731c4b361930c5e64148b30cf9b", "author_url": "http://nine", "date": "Jan 30, 2014", "message": "Sonho de Consumo ter um 'blog' decente de programação em Português... além da Língua Pátria presente, poderemos fazer networking também!"}, {"author_name": "asdf", "gravatar_hash": "c979bd881b6755f84947a5a8ecc7c6f7", "author_url": null, "date": "Jan 30, 2014", "message": "Learn English.\n\nStop answering the same questions which already have great answers in SO over and over again.\n\nUnite the world."}, {"author_name": "Himanshu", "gravatar_hash": "5978416cb3b23211ced48786376131f8", "author_url": null, "date": "Jan 30, 2014", "message": "Fantástico, obrigado!"}, {"author_name": "Emerson", "gravatar_hash": "abd01cd6f4204e472d5817eff5af0e48", "author_url": null, "date": "Jan 30, 2014", "message": "Excelente trabalho. E quem diz isso é um Brasileiro que vive no Reino Unido."}, {"author_name": "phresnel", "gravatar_hash": "4baed26d9b00bbc7c0c706515aeb596e", "author_url": null, "date": "Jan 30, 2014", "message": "@Alex: I am not an english speaker either.\n\nPersonally, I currently cannot decide on an opinion. On the one hand, different languages are good, as shown by wikipedia.\n\nOn the other hand, having the same quality on all language-incarnations requires a inhumanly sized userbase, as shown by wikipedia.\n\n\nThen, on the gripping hand, this is StackOverflow, a site for programmers, and if all programmers on earth have a lingua franca, then it's English. It is not the most beautiful language, in fact I think that portuguese has a nicer sound, as does french, and german is fantastic for literature, and italian has temperament as hell, but it works and is quite easy to learn; it's the Python of spoken languages. And as a programmer, I think you are expected to be able to learn english.\n\nOver the years, I improved my own English specifically to be able to grok the biggest chunk of the internet. There are many german programming sites and communities, but I stopped using them many years ago, because (on average!) I get far better stuff (in quality AND quantity) in the english internet."}, {"author_name": "phresnel", "gravatar_hash": "4baed26d9b00bbc7c0c706515aeb596e", "author_url": null, "date": "Jan 30, 2014", "message": "What I wanted to add to my previous post:\n\nWhen I started buying english literature on software development, at that time with only some basic school english, there were many paragraphs I did not get a clue about. What I did is that I looked up dictionaries and wikipedia. \n\nDoing so practiced myself enough that nowadays I only barely have to look up translations; I can grab almost any book, and after reading I often don't remember whether the book was english or german, because I don't even recognize the English anymore.\n\nI admit this may take years, no, it *will* take years. But becoming a good developer defnitely takes more years.\n\nFor me, the figure is roughly this:\n\n* School english: 5 years, at about 135 minutes per week, which in germany is just 78 hours per year, or 13 minutes per day\n\n* Programming english: A handful of books\n\n* Programming: 15 years and still learning at a way bigger pace than I learned english\n\n\n@SoboLAN\n\n&gt; Are you serious ?? StackOverflow in Spanish ??\n\nErr, Spanish and Portuguese are not the same ..."}, {"author_name": "higuita", "gravatar_hash": "331fdfccb47a5ba4536fd27c9c531c57", "author_url": null, "date": "Jan 30, 2014", "message": "@asdf : sure, lets unite the world, everyone should learn Esperanto and use it to communicate with others. When ones uses a native language, it's always easier for then and harder for others. If everyone speak a non-native (and easier) language, everyone would be in the same level.\n\nwhat? is hard to learn a new language, specially for technical questions and anwsers?!? sorry, but quoting you: \"Learn Esperanto!\"\n\nOf course a better solution would be a good translate system, but they need to get a lot better, as many times you get totally weird translations."}, {"author_name": "Daniel", "gravatar_hash": "5f1f3abae9b100c78d374d01898f4fe3", "author_url": null, "date": "Jan 30, 2014", "message": "&gt; \"Como português, custa-me sempre ver a minha língua associada primeiro ao Brasil e só depois ao país originário (Portugal).\"\n\nJá começou a demência retrógrada dos portugueses que se apegam às glórias de um passado distante.\nÉ triste, eles vão infestar mais este website..\n\nAlguém já viu um britânico vir ao EN.stackoverflow e escrever \"custa-me ver minha língua associada primeiro aos EUA e só depois ao país originário (Inglaterra)\".\nO povo português tem sérios problemas em aceitar a sua atual INSIGNIFICÂNCIA, hoje país mais pobre de sua região..\n\nPortugal não tem mérito NENHUM na decisão da criação deste pt.stackoverflow. O foco é claramente no Brasil e seus milhões de programadores.\nPonha-se no teu lugar, Manuel!\n\nE para os que dizem que esta iniciativa é inútil: saber programar usando linguagens com símbolos em inglês não tem NADA A VER com conseguir explicar uma idéia complexa ou uma opinião em Inglês. Acho esta versão brasileira totalmente válida."}, {"author_name": "Andrew Grimm", "gravatar_hash": "01bbb59a1c3ef9960f25a97afe7e920f", "author_url": "http://lang-8.com/424295", "date": "Jan 30, 2014", "message": "I think it'd be great if everybody just spoke English, and spoke it well.\n\nHowever, the language barrier exists, and I suspect it means not as many people are using Stack Exchange as they would otherwise. http://meta.stackoverflow.com/questions/167498/how-well-known-is-stack-overflow-with-japanese-people\n\nMaybe some people will try Stack Exchange in their native language, find that they like it, and join the English-language site!"}, {"author_name": "higuita", "gravatar_hash": "331fdfccb47a5ba4536fd27c9c531c57", "author_url": null, "date": "Jan 30, 2014", "message": "@Daniel: concordo que é ridículo alguém se incomodar por o Português ser associado principalmente ao Brasil , afinal as diferenças de população são muito consideráveis e na realidade, o que importa é a língua, não nacionalismos inúteis.\n\nAgora chamar insignificantes ao Portugueses também é ridículo, isso é a ideia retrograda que muitos Brasileiros têm de Portugal, da imagem que existe de Portugal de 1950, com carros de bois pela ruas e afins. Isso já acabou à muitos anos e hoje em dia é um País moderno, tal como todos os outros. Pobre? não... mais pobre que os países do norte da Europa sim, mas todos os países do sul da Europa estão com problemas e perderam poder devido à crise económica e maus políticos.  Não te enganes, a crise afetou toda a Europa, a produção Chinesa barata matou muitas empresas... só não afetou tanto o Brasil, porque este tem regras protecionistas para as importações (e muito bem, a globalização sem os seus riscos, como se vê)\n\nEnfim, queixas-te de \"mentalidades retrógradas\", mas acabas por ter a mesma mentalidade com esses comentários."}, {"author_name": "Bruno", "gravatar_hash": "d42bc6fde0a56c55b6c92c2919eeea78", "author_url": null, "date": "Jan 30, 2014", "message": "Concordo com o Ricardo Ferreira. Português é a língua oficial de Portugal não do Brasil, existe uma variante da língua portuguesa utilizada no Brasil, chamada de Português Brasileiro.\n\nI agree with Ricardo Ferreira. Portugues is the official language for Portugal not Brazil, there's a variant of the portuguese language used in Brazil called Portuguese from Brazil or Brazilian Portuguese.\n\nPara quem questiona a utilização do Português fiquem a saber que existem no total 240 milhões de pessoas que falam Português em todas as suas variantes.\n\nFor those who question the use of Portuguse let there be knowned that there are in total 240 million pepople that speak Portuguese in all it's variants.\n\nPortuguês é a 7a mais falada língua do mundo, a 3a mais falada na Europa e a mais falada no Hemisfério Sul.\n\nPortuguese is the 7th most spoken language in the world, 3rd most spoken in Europe and the most spoken in the Southern Hemisphere.\n\nSource: http://en.wikipedia.org/wiki/Portuguese_language"}, {"author_name": "ikaros45", "gravatar_hash": "ad082445476242a52f7b0dd087e9a8fd", "author_url": null, "date": "Jan 30, 2014", "message": "This makes no sense whatsoever, and I am not an English native speaker. I use SO to look for answers to my questions, and I know I will most of times find it because most of people look for answers to their questions on SO... i.e.: THIS is the place to sit down and share. \n\nArguably, if there is a portuguese SO, there should be a spanish one, and more for any language that enough speakers. Which means that your question could have been answered somewhere else... or somewhere else there is a question that you know best but you'll never get to know about it.\n\nAs someone commented, the it would be a better approach to have a \"official\" translation of questions to different languages.\n\nThis idea probably will be abandoned in time."}, {"author_name": "KAS", "gravatar_hash": "2f280708e0f8a18e61cb202c318ea80b", "author_url": null, "date": "Jan 30, 2014", "message": "As a portuguese-speaking (brazilian) programmer, I think this is a bad idea. Offering translations of the discussions on SO would still be a better idea, in my opinion.\n\nI think this is somewhat related to the \"standards issue\": http://xkcd.com/927/"}, {"author_name": "Pedro Martins", "gravatar_hash": "0cda43746b0f34c5409cbab06dc36b3b", "author_url": null, "date": "Jan 30, 2014", "message": "Espetáculo!\n\nObrigado!\n\nAbraços de Portugal"}, {"author_name": "KAS", "gravatar_hash": "2f280708e0f8a18e61cb202c318ea80b", "author_url": null, "date": "Jan 30, 2014", "message": "Oops, the \"standards\" part of my comment was supposed to be related to the esperanto thing."}, {"author_name": "Bruno", "gravatar_hash": "d42bc6fde0a56c55b6c92c2919eeea78", "author_url": null, "date": "Jan 30, 2014", "message": "@ikaros45 I believe other sites like spanish SO will follow. This was just the first, more will be avaiable."}, {"author_name": "Jose", "gravatar_hash": "9eceec798d6d77c03c3b2246c7bc9941", "author_url": "http://www.jose.com", "date": "Jan 30, 2014", "message": "\"Nota do tradutor: Porque português é a melhor língua, o Brasil é o melhor país e o Jay não consegue ler o que a gente escreve ;)]\"\n\nSerei o único a achar isto ofensivo? Porque é que Brasil é o melhor país? Aceitem as vossas origens e respeitem o próximo, este comentário é completamente inapropriado e dispensável ao que de outro modo seria uma boa notícia."}, {"author_name": "Regi", "gravatar_hash": "206341964a00419e0b477ddb93a21beb", "author_url": null, "date": "Jan 30, 2014", "message": "It's a good initiative, but...\n\nI'm a portuguese developer and I have to say that I don't know or heard of any developer here that doesn't speak or understand english. For the developer community in Portugal I think that this won't be very useful. \n\nDaniel:\nAnd it's good to know that about a 10% of our population is a developer according to that data on the image."}, {"author_name": "gby", "gravatar_hash": "2e41d52b2986c0c63a2f464e34b7b3f3", "author_url": "http://fake.com", "date": "Jan 30, 2014", "message": "Pretty bad idea."}, {"author_name": "Guilherme Oderdenge", "gravatar_hash": "2095d45e982b57afa220ed5417defaab", "author_url": null, "date": "Jan 30, 2014", "message": "Jose\n\nCara, não viaja."}, {"author_name": "Felipe Miosso", "gravatar_hash": "8cc508f39d780c7b253201a0c9e0c011", "author_url": null, "date": "Jan 30, 2014", "message": "For those who are speaking about community fragmentation ... It's time to learn a new language, just like everyone else do. \n\nEvery  \"non-native-culture-english-based\" person did that in some time of his/her life when information was short and poor.\n\nThe thing is ... English will not always be the \"number one\". So, get used to it."}, {"author_name": "Asdrúbal Suárez", "gravatar_hash": "cfbda958d6dd124c2c9c0ad255bc8089", "author_url": "https://twitter.com/asdrubalivan", "date": "Jan 30, 2014", "message": "Excellent! I really hope there will be a Stack Overflow in Spanish soon. I would love to contribute to it =)"}, {"author_name": "Zé", "gravatar_hash": "579a4b0b6afef63b4b01eb9b4d75ea3b", "author_url": null, "date": "Jan 30, 2014", "message": "Se \"vai ao ar\", é mau sinal :)\nSe \"vai para o ar\", aí, é ótimo."}, {"author_name": "slchck", "gravatar_hash": "94b1872d8b32212d849f9e257af3a9b8", "author_url": null, "date": "Jan 30, 2014", "message": "@Bruno\n\n`3rd most spoken in Europe`\n\nThis is an unsupported statistic, the link on the wiki leads nowhere, and I would be inclined to believe this table more: \n\nhttp://en.wikipedia.org/wiki/Languages_of_the_European_Union#Knowledge  \n\ncause somehow I doubt that non-EU part of Europe has a significant Lusophonic population.\n\nThat being said, Portuguese is a beautiful language, definitely worth learning."}, {"author_name": "Richardson", "gravatar_hash": "04ea9767b5efd2b97a0b48eec1549bd1", "author_url": null, "date": "Jan 30, 2014", "message": "Opa, gostei.\n\nEsse texto foi revisado por um português (de Portugal), ou da Academia Brasileira de Letras?\n\n\"Se você é jovem ainda, amanhã velho será\", em português normal \"..., amanhã você será velho\"."}, {"author_name": "Natan", "gravatar_hash": "a4b457587f67c326bf3df103b7f092b4", "author_url": null, "date": "Jan 30, 2014", "message": "@Richardson, acredito que isto tenha sido uma referência à música do Chaves, cujo título é: \"Se você é jovem ainda\"."}, {"author_name": "Miki", "gravatar_hash": "b4d02dc91d4623865c3f2994f52006b8", "author_url": null, "date": "Jan 30, 2014", "message": "@Felipe Miosso  : here's something for context. I, personally, speak:\n\n - 3 languages fluently, \n - 1 to a quasi-communicative level, and \n - comprehend basic text (+speech on a good day) in several more. \n\nMost of these, including the 2 \"fluent ones\", are in a different family than my native language.\n\nPortuguese falls into the \"basic information comprehension\" category, unfortunately. So, I take it you suggest it's not a concern, and I should learn it *and any other language* SO gets localized to? Oh, don't get me wrong, I wouldn't mind. Just hand me a working time machine and an immortality elixir ;)."}, {"author_name": "phresnel", "gravatar_hash": "4baed26d9b00bbc7c0c706515aeb596e", "author_url": null, "date": "Jan 30, 2014", "message": "For my part: If everyone would agree on switching to Esperanto, germans, chinese, portuguese, netherlands, indian, I'd head over learning it immediately and eagerly.\n\nAt the moment, it appears that the bigger programming world speaks english, though."}, {"author_name": "Victor", "gravatar_hash": "10e3ef8ec01b92c3b54bc97fd5a0eb0c", "author_url": null, "date": "Jan 30, 2014", "message": "Alvíssaras!!! Notícia mais do que bem-vinda. \n\nE para eventuais lusófonos do Brasil, como eu, mas que torceram o nariz para essa iniciativa, eu cito uma frase, essa em inglês, por falta de equiparada tradução: \"HATERS GONNA HATE\""}, {"author_name": "Johnny", "gravatar_hash": "798ff5f4d89f2ea9115e48408fccaee4", "author_url": null, "date": "Jan 30, 2014", "message": "Not sure how this exercise will work out but if SO ever opens in my native language I will not use it because I only have so much time in my life so I will continue to use the variant that gives me the best chances to get answers - the English SO. I will also contribute to the variant that reaches the most users - also the English SO. And I say English but it is de facto global site, minus Portugal and Brazil now, that is ;-)"}, {"author_name": "RMS", "gravatar_hash": "02a243c4202b23e8ec78620f1ff48aa6", "author_url": null, "date": "Jan 30, 2014", "message": "Lol a primiera coisa que eu estava a espera era algem dizer alguma coisa entre portugues do brasil e portugues de portugal. Como outro \"poster\" tinha dito nao se ve qualquer britanico a queixar-se que nao ha um S.O. em ingles britanico (que tambem ha diferencas com ingles dos eua). Eu nasci em portugal mas imigrei para os EUA quando era pequeno, a todos que se quiexam aqui da differencia entre portugues PT e portuges BR tejam filezes que a sua lingua esta com destaque neste site. se nao fosse o brasil a lingua portuguesa nao era tao popular no mundo"}, {"author_name": "André Souza Lemos", "gravatar_hash": "57e438484a47e90b474bbdf1b55152f8", "author_url": "http://www.obsidiana.com.br/blog", "date": "Jan 30, 2014", "message": "O Stack Exchange é um agenciador de oferta de conhecimento, não só de demanda. Temos que nos colocar mais nesse papel, de ofertadores de conhecimento, não só de demandantes. Muita gente não entende isso, sua maior ambição é ser apenas um bom aprendiz do que é criado lá fora, ou simplesmente ir embora de vez e não olhar para trás."}, {"author_name": "Jorgesys", "gravatar_hash": "d889a8936a9da0353ee855f578e46ca5", "author_url": "http://cplusplus.com", "date": "Jan 30, 2014", "message": "Why not in spanish language? I´m pretty sure there are more users that speak spanish.  Asi que si se creo una comunidad en Portugues, porque no crear una en Español. So let's go \"Hola Mundo!\""}, {"author_name": "Jorgesys", "gravatar_hash": "d889a8936a9da0353ee855f578e46ca5", "author_url": "http://cplusplus.com", "date": "Jan 30, 2014", "message": "I´d like to be the Stack OverFlow Spanish Community Manager! :)"}, {"author_name": "Victor", "gravatar_hash": "526d2a72f963ccc832e565e7e1043e9b", "author_url": null, "date": "Jan 30, 2014", "message": "@Jorgesys - Spanish, Turkish and Russian are probably coming soon, they reached the 100% commitment threshold in area51 just like Portuguese did and will be launched soon. After that, Arabic SO will probably be the next one, followed by German and French.\n\nThe only bad thing is the enourmous number of absolute morons posting comments here just to say \"It is a bad idea, +1 Me-too\". I doubt that any of them cared to visit the SOPT community and see with their own eyes that we got a lot of good questions with a lot of good answers and we are getting this very quickly, and we are moderating and administring the community very well. But the morons don't care to look there or even to read previous comments, they just want to post their stupid opinions. Well, the time will just show them how wrong and stupid they are."}, {"author_name": "Marcelo Gibson", "gravatar_hash": "414aae1257ee9e58014bd81bf438a662", "author_url": "https://marcelogibson.com/", "date": "Jan 30, 2014", "message": "Well, I guess haters will hate, no matter what is done...\n\nPersonally, I will keep doing my best to make knowledge more **accessible** to my fellow countrymen. I will put my priviledge [of being a bilingual speaker who has access to technology, among other things] to good use: helping less priviledged people than me, towards a world where priviledge does not exist or at least does not matter.\n\nP.S. English or Portuguese doesn't matter: what we should all be doing is programing only in C."}, {"author_name": "Andrea Griffini", "gravatar_hash": "02041b18199678d1f02e6d5040dbb907", "author_url": "http://stackoverflow.com/users/320726/6502", "date": "Jan 31, 2014", "message": "If a brasilian programmer doesn't know english it would be better for him/her to learn english instead of learning new things in brasilero. I'd say that 90% of IT knowledge is stored in english, and 99% of good and relevant parts.\n\nWhy concentrating and wasting energy on irrelevant things that divide (like local idioms) instead of on things that unite?"}, {"author_name": "Rene Vajkay", "gravatar_hash": "a69e34d6be7edd7216753bf5ab7a05ac", "author_url": null, "date": "Jan 31, 2014", "message": "Pretty bad idea I think. Don't take me wrong I speak three different languages and I am not a native english speaker. But fragmentation will lead to problems finding the right answers that best fits to your problems. Look at it from other side, you are now discriminating all the non-portuguese speaking programmers and later when more and more languages will be added to the site the portuguese will be discriminated hugely too.\n\nAnyway, I'm looking forward to the hungarian version of the site :)."}, {"author_name": "Barbio", "gravatar_hash": "bf49910ce270b4da169b96cb4abd4e19", "author_url": "http://www.barbio.es", "date": "Jan 31, 2014", "message": "Boas noticias..."}, {"author_name": "Pedro", "gravatar_hash": "2f7fdcd8c61fa0aa0f6e5a6f218f8f49", "author_url": null, "date": "Jan 31, 2014", "message": "Well done!\n\nOther languages cannot be ignored, so this is a step ahead.\n\nStop thinking that English is the only language in the world, and that IT world is only English....\n\nGood to see that Portuguese (From Portugal, Brasil, Angola, Moçambique, Guiné-Bissau, Cabo Verde, Timor-Leste, São Tomé e Principe, e tantas outras comunidades espalhadas pelo mundo fora) is the first one to be chosen."}, {"author_name": "Bruno", "gravatar_hash": "cb1b89fceff20c576c96c56c64f3485f", "author_url": null, "date": "Jan 31, 2014", "message": "\"e isso sem contar Portugal, Moçambique, Angola e outros países menores\".\nOutros países menores como os acima?\nSe considerarmos que Portugal tem 20 vezes menos populacao que o brazil...mas que a sua contribuicao nesta comunidade é apenas 3.4 vezes menor que a do brazil, sera que podemos carimbar de \"países menores\"?\n\nJa agora...contabilizaram quem esta em Londres, Berlim, Nova York que é na realidade Portugues?\n\nJa contabilizaram a quantidade de consultoras Portugueses a funcionar em Sao Paulo e Rio? Sera que esses nao contribuem apenas para os paises meiores?"}, {"author_name": "user012313213", "gravatar_hash": "8f80eb688e9d73a0768d43194f516e78", "author_url": null, "date": "Jan 31, 2014", "message": "I don't like the community split and it looks like a gamification decision, just add an extension to the game.\n\nFrom a young portuguese programmer (27) perspective using the portuguese language for code doesn't make much sense because I never met anyone that isn't fluent enough in English to use the StackOverflow and the best sources and QA are in english.\nFor a Brazilian IT guys it may have some value because Brazil is big enough for that.\nNo idea on other countries.\n\nPS: The StackExchange account is not integrated which is really bad."}, {"author_name": "chris", "gravatar_hash": "88fb7570d4f38fcb691d8b8212ab818c", "author_url": null, "date": "Jan 31, 2014", "message": "My gut feeling tells me that I have to go with the \"this is a bad idea\" crowd. I suppose that more major languages, such as Spanish, German, French etc. (maybe even Chinese, who knows) will eventually follow. This will inevitably lead to fragmentation of the SO community. In my opinion, any engineer worth his salt should learn decent English, since it is today's lingua franca of science and engineering. Without meaning offense to the Portuguese speaking community, I think not trying to learn English as an engineer is laziness, and should not be encouraged. And no, English is not my native language. And I wouldn't think any differently about this matter if my native language German were the first to get a localized SO version."}, {"author_name": "o2genum", "gravatar_hash": "94a7619908457a5c86af3bcbaba66f23", "author_url": null, "date": "Jan 31, 2014", "message": "Don't forget that the requirement of understandable English limits your audience for better. Engineers without knowledge of the most basic English. Lol what."}, {"author_name": "Braian", "gravatar_hash": "349d51b43c79cea0902761458de904f0", "author_url": null, "date": "Jan 31, 2014", "message": "Que bom!! hehe\nRegistrando..."}, {"author_name": "Carlos Ferreira", "gravatar_hash": "240a938a7b5125cc037da326c008f392", "author_url": null, "date": "Jan 31, 2014", "message": "Isto vai levar a muitos maus hábitos... Inglês é fundamental para qualquer programador/arquitecto de software. A grande parte da boa documentação está escrita em Inglês. Estar a duplicar coisas para Português só porque existem pessoas que se recusam a aprender Inglês é uma má desculpa... Todos os Programadores/Engenheiros devem saber Inglês. É fundamental!"}, {"author_name": "chris", "gravatar_hash": "88fb7570d4f38fcb691d8b8212ab818c", "author_url": null, "date": "Jan 31, 2014", "message": "@Victor: Calling everyone who doesn't share your opinions \"absolute morons\" doesn't really help with making your point. I respect your opinion, certainly not your style."}, {"author_name": "antonio", "gravatar_hash": "b3081804b92cc64990fb4f4f980e35d4", "author_url": null, "date": "Jan 31, 2014", "message": "Try to learn esperanto, its soo eaasy..! Only 16 rules, there are no exceptions to rules. The rest is only vocabulary:\nhttp://en.wikiversity.org/wiki/Rules_of_Esperanto_grammar\n\nAlso in portuguese and spanish:\nhttp://pt.wikipedia.org/wiki/16_regras_do_esperanto\nhttp://es.wikipedia.org/wiki/16_reglas_del_esperanto"}, {"author_name": "Flávio Grassi", "gravatar_hash": "2aaf1433bf889b78037e59a66de524e2", "author_url": null, "date": "Jan 31, 2014", "message": "Parabéns à todos os envolvidos pela iniciativa!"}, {"author_name": "Eduardo", "gravatar_hash": "023977a6b6a64457009988c42da0c08b", "author_url": null, "date": "Jan 31, 2014", "message": "Ótima iniciativa!\n\nE para alguns:\nNão é porque foi criada um SO em português que vamos deixar de aprender inglês.\n\nAgora imaginem um novato que possui poucas noções de inglês, o SO em PT será uma referência."}, {"author_name": "Leandro", "gravatar_hash": "fe46e24547c5ef5b65ed7a3e4b5e02b8", "author_url": null, "date": "Jan 31, 2014", "message": "Parabéns.\n\nQuanto aos que são contra,o SOen não vai deixar de existir, que tal nunca entrar no SOpt, dessa maneira você não ficará chateado de ter que ler e responder em pt. \n\nEu não entendo como tem gente que prefere restringir a expandir. Que se crie SO em todas as línguas, nem por isso o SOen vai deixar de existir."}, {"author_name": "Leandro", "gravatar_hash": "fe46e24547c5ef5b65ed7a3e4b5e02b8", "author_url": "http://equationspecidg", "date": "Jan 31, 2014", "message": "@CarlosFerreira Então quem não sabe inglês está fadado a não consegui ajuda a seus problemas de programação? É isso mesmo? Acho que conhecimento deve ser disseminado nem que seja por sinal de fumaça que se faça entender. Colocar barreiras para que se obtenha ajuda é em minha humilde opinião não colaborar para o desenvolvimento da humanidade :)"}, {"author_name": "wils", "gravatar_hash": "0097c840141d77ee5cea662697198c09", "author_url": "http://www.wilsolutions.com.br", "date": "Jan 31, 2014", "message": "Excelente iniciativa! =D"}, {"author_name": "Martin", "gravatar_hash": "4ca36f30d08f1d2708c7a0a8646f87e8", "author_url": null, "date": "Jan 31, 2014", "message": "Since when is Equatorial Guinea part of the Lusosphere? Its main language is Spanish, its only other official language is French, and the major minority languages are Hindi and Arabic!"}, {"author_name": "Breno Costa Inojosa", "gravatar_hash": "0ac3df3f559ac84ecbd773ecf7cd6843", "author_url": null, "date": "Jan 31, 2014", "message": "I'm Brazilian and I can say that I was fine with the \"US\" StackOverflow.com.\n\nBut I can't lie and say that this won't help thousands of BR programmers because not every tech guy knows english. This will indeed be of so much help : )\n\nCongratulations on this initiative, StackOverflow!\nGood to see that people recognize Brazil and other PT countries as important in software these days :D"}, {"author_name": "Offirmo", "gravatar_hash": "34c9b2871a5c18c38cc226759e17c538", "author_url": null, "date": "Jan 31, 2014", "message": "Excellent idea. A community must not be locked in a single language. \n\nLanguages are coming and leaving. English is dominant now but may no longer be dominant in some years.\n\nA few centuries ago, we would have heard \"writing science in something else as latin ? Without latin you can't do science !\"\n\nGood luck ! I look forward to new Stack Overflow in major languages !"}, {"author_name": "Chris", "gravatar_hash": "3038142cea42b76065fd0e9462d6e210", "author_url": null, "date": "Feb 03, 2014", "message": "Look at Pawan,\nthat happens when you don't speak english properly. You might think he's spamming about a flower delivery service, but actually he is discussing advantages and disadvantages of a portuguese SO version."}, {"author_name": "higuita", "gravatar_hash": "331fdfccb47a5ba4536fd27c9c531c57", "author_url": null, "date": "Feb 03, 2014", "message": "@Martin: Since they where colonized by the Portuguese, Portuguese slaves where places or run to there and, finally, because its the third official country language (mostly to help commerce with Lusosphere countries): https://en.wikipedia.org/wiki/Equatorial_Guinea#Languages"}, {"author_name": "corey", "gravatar_hash": "e8eaf7b97cbe0c9d0f705d6b7be4494a", "author_url": "http://www.logodivine.com/", "date": "Feb 12, 2014", "message": "great post and i've used google translator to convert brazil into english. know i'm no more curious :)"}, {"author_name": "Newton Oliveira", "gravatar_hash": "28c5eedc7967eb4b8b5a7e760f8cdeda", "author_url": null, "date": "Feb 16, 2014", "message": "Muito boa a noticia!!!"}, {"author_name": "Fatima", "gravatar_hash": "755533aab23be9fd874984216f141ec3", "author_url": null, "date": "Feb 18, 2014", "message": "I agree with Richardson, \n\n Ta tudo traduzido errado. Porqué guando troca os  idioma de inglês para português, temos qué confirma sé esta tudo correto. que todos poden entente o asuntó. Therefore, In My opinion it doesn't make any sence....\n\nI'm also from Rio de Janeiro.."}]}