{"response": [{"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": null, "date": "Jan 23, 2014", "message": "I still think the nofollow rule is sad given that stackexchange itself nofollow's nearly everything."}, {"author_name": "David Fullerton", "gravatar_hash": "0fda7d8abd0542ef6194287ea39d8a8b", "author_url": null, "date": "Jan 23, 2014", "message": "@Adam We actually started removing nofollow from links above certain thresholds. We don't publish the thresholds because we don't want people to game it, but this meta post announces it without any details: http://meta.stackoverflow.com/questions/111279/remove-nofollow-on-links-deemed-reputable and if you go down a list of upvoted older questions like http://stackoverflow.com/questions?page=500&sort=votes you can find a lot of links that are not nofollowed."}, {"author_name": "Dusty Wilson", "gravatar_hash": "81e5f295ff0d6533cc4e0a6a4f608c81", "author_url": null, "date": "Jan 23, 2014", "message": "\"No additional restrictions — You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits.\"  The \"nofollow\" is not part of CC-BY-SA 3.0 and you can't add restrictions while still calling it CC-BY-SA 3.0.  The same might be said about the other restrictions you outline in the document above."}, {"author_name": "Doorknob", "gravatar_hash": "efce35ec8c4107fb9215f12b39466ecb", "author_url": "http://stackoverflow.com/users/1223693/", "date": "Jan 23, 2014", "message": "Yay, the data dump is back :D"}, {"author_name": "sevensideddie", "gravatar_hash": "306f5f9b584249a7ee798302e83aecac", "author_url": null, "date": "Jan 24, 2014", "message": "(IANAL, etc...)\n\n@Dusty I believe it's actually the other way around: if you license it CC-BY-SA 3.0 you can (try to) add any restrictions you want and call it CC-BY-SA 3.0, but the restrictions have no force. So trying to add restrictions doesn't make it stop being CC-BY-SA 3.0, it just makes the added restrictions void.\n\n(Here I'm assuming you haven't drafted your own actual license just based on the CC licenses. Then I don't know what happens... I suspect that there is a misrepresentation of license or trademark abuse thing involved if you claim your homebrewed license is Creative Commons.)\n\nThat said, the bit in the post about \"nofollow\" &amp;c seems to be a request phrased as a \"should\" (not a \"must\"), which I believe has the force of \"playing nice\" rather than law, and that's OK."}, {"author_name": "Franck Dernoncourt", "gravatar_hash": "5a151713b9eae8dc566f5957acee3475", "author_url": "http://francky.me", "date": "Jan 24, 2014", "message": "Great to have the dumps, but some comments: in addition to the unrealistic, ironic and maybe unlawful nofollow rule, linking back to the original source question or answer is pretty difficult when the latter has been deleted, which happens quite frequently. Also, having 2 links for one quote is very inconvenient. Lastly, how about citing comments?\n\nIt would be great to extend the 'cite' button, which is enabled only on cstheory and math at the moment, to all stack exchange websites, so that users don't have to be manually all the attribution requirements."}, {"author_name": "Ben", "gravatar_hash": "b949cb93e1c1ee9cbd8a13d02093a7be", "author_url": "http://www.benswayne.com/", "date": "Jan 24, 2014", "message": "Agreed with others. I'm not a lawyer and don't know how you finagle it, but to require nofollow links to StackExchange when StackExchange arbitrarily adds nofollow on most legitimate links which are citations/references to other content which may itself have equal attribution requirements is not reasonable. StackExchange does not it self \"keep with the spirit of sharing and proper attribution\" and therefore sets a poor example for the community regarding proper attribution. You should use the same standards you ask of those linking back to you. A great deal of the content referenced in SE posts may well have only been made available under identical licensing/attribution conditions."}, {"author_name": "who", "gravatar_hash": "5f533b551196ee3636013ed40e8634b8", "author_url": null, "date": "Jan 24, 2014", "message": "yay!!"}, {"author_name": "Sumurai8", "gravatar_hash": "191dbc0ae8b2e1192d867f5e806bbf71", "author_url": null, "date": "Jan 24, 2014", "message": "@Ben: It would be idiotic to *not* use nofollow on links in user-generated content, unless you trust said user enough to not spam certain links. Not doing so will encourage people to push their link(s) everywhere they see fit, even if said links add hardly anything to the post. Another major example of a site that uses cc-by-sa, Wikipedia, simply adds nofollow to any external website that is not an so-called 'interwiki-link'.\n\nAlso remember that you may copy entire pages from SE, edit them if you like and publish them as your own, as long as you properly attribute it, while for other sites that are under regular copyright, you are only allowed to cite part of a page. If you copy an entire page and call that 'a citation', you risk a lawsuit... You are not allowed to rewrite portions of such citations to make the text to fit your purposes better.\n\nOr to put it in other words: Citation is something different than what license content is under. You are allowed to cite both copyrighted and partly/non-copyrighted content. You are however allowed to do much more with partly/non-copyrighted content."}, {"author_name": "Luke Stanley", "gravatar_hash": "7ba33fdcf3b9f2658839421ea0d1d67f", "author_url": null, "date": "Jan 25, 2014", "message": "Congrats on making this happen, when the content viewers can read the dumps it should be a boon to people with flakey and slow internet everywhere! :)"}, {"author_name": "Three", "gravatar_hash": "ed13a852b6cb6330eae5d068b1737044", "author_url": null, "date": "Jan 25, 2014", "message": "@Dusty Wilson\nCC-BY-SA allows you to specify your own attribution requirements. A link that does not \"nofollow\" could be one such requirement."}, {"author_name": "Ben", "gravatar_hash": "dde3a5048e456c451b7c518857e1818c", "author_url": null, "date": "Jan 25, 2014", "message": "@Three: What clause exactly allows that?  When I read it, the attribution requirement is the original author, not the site that originally distributed it, and not any URI except for one referring to the license/copyright."}, {"author_name": "Ahmad Yassin", "gravatar_hash": "ed5048882e35c5d30c8cacc9f9cdf283", "author_url": "http://amyassin.wordpress.com", "date": "Jan 27, 2014", "message": "Also, Brent Ozar did a blog post about querying Stack Exchange...\nhttp://www.brentozar.com/archive/2014/01/how-to-query-the-stackexchange-databases/"}, {"author_name": "Dexter", "gravatar_hash": "799d3aabb1d28acdff60ab3aa9b68d2e", "author_url": null, "date": "Jan 27, 2014", "message": "The Internet Archive gives access to the latest dump. Is there any way to get access to the previous dumps?"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Jan 27, 2014", "message": "@Dexter: I was still able to download 19 of them using bittorrent - you can find the links on cached ClearBits pages on The Internet Archive."}, {"author_name": "dorian", "gravatar_hash": "5138f85f89806b87fa31531aa218574b", "author_url": null, "date": "Jan 31, 2014", "message": "Hi,there is any posibility to take an update of the sites or i have to download the entire file again?\nsorry my english\nthx"}, {"author_name": "akestner", "gravatar_hash": "5103332a2a6312fe933812d75d25c0f6", "author_url": "http://-", "date": "Feb 02, 2014", "message": "Any chance you guys would sponsor a (kaggle)[https://www.kaggle.com/] competition with this data?"}, {"author_name": "Greg Hamerly", "gravatar_hash": "385ffe7c092e881a4140d93a2fca14e9", "author_url": null, "date": "Feb 08, 2014", "message": "Hi, the January 2014 data dump does not include some information that should be in the archive. \n\nIn particular, according to the readme.txt (https://ia700603.us.archive.org/34/items/stackexchange/readme.txt) the Users.xml files should contain the field \"EmailHash\", but it does not (for the 10 or so archives I've checked). \n\nThis field was in all the previous data dumps that I've looked at (the previous 3 or so). Can this please be fixed?"}, {"author_name": "MusiMovi", "gravatar_hash": "cdacd309518ca614b15966ed0502958d", "author_url": "http://musimovi.blogspot.com/", "date": "Feb 09, 2014", "message": "wah, artikel yang sangat bermanfaat nih.. semoga pengunjungnya puas dengan apa yang diberikan. :) mau download lagu dan anime? klik saya ya"}, {"author_name": "Peter Burkimsher", "gravatar_hash": "6be83093cd6618f05e18c3aa185fb471", "author_url": "http://peterburk.tumblr.com", "date": "Feb 10, 2014", "message": "I wrote a local web app to host the data dump, and query it quickly!\nhttps://github.com/peterburk/stackoverflowlocal\n\nIt can search the 4.6GB StackOverflow data dump while compressed, and compress it further down to only 2.32GB. Alternatives require decompressing it to 30GB, but I don't have the disk space for that. \n\nFor those looking for an iPhone version, try a competitor's app, StackStash. But that takes up 3.6GB, and doesn't work on my laptop. \nhttps://itunes.apple.com/us/app/stackstash-stackoverflow-offline/id602112351?mt=8\n\nPeter"}, {"author_name": "SEO", "gravatar_hash": "d76400e4263c47ee6460d6ad711a724d", "author_url": "http://www.linkedin.com/in/muzammilsem", "date": "Feb 12, 2014", "message": "it is really a good news that Stack Exchange Creative Commons are hosted by waybackmachine or internet archieve.."}]}