{"response": [{"author_name": "Dave Ward", "gravatar_hash": "755e1277329df9e6b7e6685b21108ee6", "author_url": "http://encosia.com", "date": "Nov 06, 2008", "message": "Joel shouldn't be indicting the SQL team for a missing feature in LINQ to SQL.  They aren't the same people."}, {"author_name": "Nick", "gravatar_hash": "fc8d4185fa3b625094482ef462159f57", "author_url": null, "date": "Nov 06, 2008", "message": "I might actually start looking forward to listening again! Why? Well, judging by the show notes, we're not going to have yet another discussion on or around the whole reputation thing. Perhaps I'm on my own here but it's largely inconsequential for those people who appreciate what StackOverflow.com is trying to do but don't necessarily have the time to care too much about their own reputation, in terms of the system, let alone that of anyone else.\n\n\n[Written with the greatest of respect, btw!]"}, {"author_name": "Colonel Sponsz", "gravatar_hash": "cae93d12a6a39d5dc68eadf4cf45e526", "author_url": null, "date": "Nov 06, 2008", "message": "Great rant about project managers!  That deserves to be formalised into a Joel on Software post.\n\nI like the format of using a few SO questions to drive discussion and agree with Nick on the reputation issue - I think SO users have a pretty good idea of how the site works these days."}, {"author_name": "Rick", "gravatar_hash": "cd92c3bd6852f23b5f8dfaf3ec9d6ab5", "author_url": null, "date": "Nov 06, 2008", "message": "Maybe the guy keeps deleting it because his managers told him to or he realises that for the next 40 years any project manager that does a google search on his name is going to see that post.\n\nWith respect to Nick, for all the difficulties of getting 'fake' reputation right, the discussion of _real_ _world_ reputation issues is potentially just as meaty.\n\nDisclaimer: I'm not the guy deleting that post, if it was up to me rather than undeleting it, I'd move it into the 'community owned' category and remove his name from it."}, {"author_name": "James", "gravatar_hash": "8506dbc45ead60f0c17800d9e6a0e831", "author_url": null, "date": "Nov 06, 2008", "message": "After hearing you guys talking about Google's spell check, I remembered that on the Google Blog they posted a dumbed-down description on how they accomplish this, thought it might be interesting.\n\nhttp://googleblog.blogspot.com/2008/07/our-googley-advice-to-students-major-in.html"}, {"author_name": "Pierre De Pascale", "gravatar_hash": "c7e1061bd0a7d7313567cdf2324799de", "author_url": "http://www.prefics.ch", "date": "Nov 06, 2008", "message": "A less dumbed-down description of how Google does spellchecking is at http://norvig.com/spell-correct.html\n\nIt also includes actual Python code of the machine learning algorithm described."}, {"author_name": "Marc Reside", "gravatar_hash": "b7e546676228f3dc9caee37c8fa24908", "author_url": "http://www.tech-hobbyist.com", "date": "Nov 06, 2008", "message": "I remember Giraffe and Graffiti on the Palm III. Once you got used to it, it rarely misread what you wrote.\n\nYou'd find a similar issue when playing \"Brain Age\" on the Nintendo DS. When writing numbers, it will often get what you write wrong."}, {"author_name": "Chris", "gravatar_hash": "3951e23f46cd0e25e1a7a16035d70785", "author_url": null, "date": "Nov 06, 2008", "message": "Someone has probably already mentioned this, regarding the person that deleted their question, you could change the policy so that deleting is not possible, the options a normal user has are:\na) Flag for deletion, perhaps with a reason, then a moderator comes along and either deletes it or ...\nb) ... Anonymize post.  The name attached is removed but the post remains for future reference by others.\nThe idea is that you don't want to actually delete anything unless it is spam, really badly phrased (Irreparably so), off topic or a duplicate."}, {"author_name": "Chris", "gravatar_hash": "3951e23f46cd0e25e1a7a16035d70785", "author_url": null, "date": "Nov 06, 2008", "message": "Also regarding using Google as a spell checker, sounds good, but you do have to use some sort of a filter to avoid:\nasd\nDid you mean?\nasdf\nasdfasdf\nasdfasdfasdf\n\nAssuming you would go purely by number of search results, what would the cut off point be, 100, 1000, 1 million?  \nThe other problem is commonly miss spelled words:\n52,900,000 for graffiti\n4,070,000 for grafiti\n3,360,000 for grafitti\n2,270,000 for graffitti\n\nIn this case we can assume that 52 million is the correct one (Isn't it?) but 4,3 and 2 million are quite reasonable scores, it is only in comparison that they fail."}, {"author_name": "Chris Leary", "gravatar_hash": "8a402d20d15c0443ea4fe3207bf308a9", "author_url": "http://blog.cdleary.com", "date": "Nov 06, 2008", "message": "Re: the search algorithm: The \"traditional\" full text search methodology is tf/idf -- term frequency over inverse document frequency. Roughly, the document with the most occurrences of a token in the search text will be inversely weighted by the number of documents in the corpus which contain that token. There are lots of tweaks you can perform on top of that basic heuristic. If I remember my information retrieval lectures correctly, most of the original web search engines were variations on tf/idf."}, {"author_name": "Ambrose", "gravatar_hash": "2fe96fe4513932ff30af562241c9db28", "author_url": null, "date": "Nov 06, 2008", "message": "I have to point out, again, that when the player plays the audio, it says \"undefined\". You'd think you would want to fix something like that..."}, {"author_name": "wds", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Nov 07, 2008", "message": "The what do project managers do all day question has been deleted again. :("}, {"author_name": "dwj", "gravatar_hash": "1cf91fad2e22363378b849e5796f6ed7", "author_url": null, "date": "Nov 07, 2008", "message": "I think one thing that is apparent is that both Joel and Jeff are doing other things while trying to hold a conversation -- searching for blog posts, checking on the status of the website, etc. You cannot listen and understand a conversation while doing something else."}, {"author_name": "ejunker", "gravatar_hash": "5aaf05ebaccc935b15ce7c6b51876b4e", "author_url": null, "date": "Nov 08, 2008", "message": "There is an American and a British pronunciation of azure. See http://www.thefreedictionary.com/azure to hear the pronunciations of azure"}, {"author_name": "jmarlowe", "gravatar_hash": "79329faab1f3f09468dbf1660a268ad4", "author_url": null, "date": "Nov 08, 2008", "message": "Wow, Joel's rant about Project Management (TM) was epic!  \n\nYou can tell he's given that rant dozens of times before, the arguments were honed down to the essence, and the delivery was perfect.\n\nRequired listening for all developers who happen to be working on a project with a budget."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Nov 09, 2008", "message": "This is the internet, and it's impossible to delete stuff on the Internet, you can only make it harder to find, but someone somewhere will always have a cached copy of it.\n\nFor this question, I'd recommend editing it though and removing the part that could actually cause serious work-related issues to the poster."}, {"author_name": "Joe Crawford", "gravatar_hash": "5d3c808b7f3776de188ecaf412aebf4b", "author_url": "http://artlung.com/", "date": "Nov 10, 2008", "message": "About the \"how does Google decide that Jeff Atzwood really should be Jeff Atwood\" question. In 2005 Adam Bosworth mentioned this in his speech at the MySQL developer's conference. It's available on IT Conversations at <a href=\"http://itc.conversationsnetwork.org/shows/detail571.html\" rel=\"nofollow\">http://itc.conversationsnetwork.org/shows/detail571.html</a>. He actually talks a bit about web scale search. He mentions the problem you discussed quite specifically. I remember because his talk is funny and thoughtful and made me think and I've listened to it several times over the years. It's at about 12 minutes in, here's a rough transcription:\n\n<q>\"How many people here have built a system that takes a billion requests a day? Well you could. And actually that's the point of this conversation--what I want to talk about. It's the same thing that's made Google possible I mean think about what Google does, we take hundreds of millions of fairly hard queries a day; the queries tend to say things like \"searching for camels in Tanzania\" and we sort of shake our head and try and figure out what that means and we go over petabytes of content, not terabytes but petabytes of content. And we have a couple hundred milliseconds in which we're allowed to search the entire petabytes and return back to you what we found in rank order. So not only are we trying to search really, really large amounts of data we're trying to search it extraordinarily quickly and we're trying to do this hundreds of millions of times a day. And we do it. And we do it without a helluva lot of sweat. The way I think about Google is that's it's lots of PHDs driving tanks. It's all about brute force. Everyone's sort of General Patton--they don't drive around the wall they drive through the wall. It's really dumb techniques, used in large scale: I mean for example, the spellchecking. Every so often when you type a Google query and it will say \"did you mean,\" and it's usually because you put in a typo. This is not because we have some incredible dictionary or some brilliant thesaurus that tells us what you meant. It's because we're tracking what people type _after_ they type the query that didn't return anything -- and it turned out that that was a very efficient way to figure out what you probably meant to type, in fact it works much better than any spellchecker. But notice the stupidity of the approach: \"people who typed this usually wanted to do this\"--works great.\"</q>"}, {"author_name": "Jon skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Nov 10, 2008", "message": "Regarding the pronunciation of \"azure\" and the UK vs US versions of it: Apparently Jeff and Joel have been using the UK pronunciation, whereas I have been using the US version, despite being English.\n\nMy source of pronunciation for this has always been a fairly silly one: Joseph and his Technicoloured Dreamcoat. (Azure and lemon and russet and grey...) That just doesn't work with the stress on the second syllable."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Nov 10, 2008", "message": "I would pronounce it with a hard z (\"Atsuur\"), but then again, I'm German and that's how we pronounce \"Azur\" in German."}, {"author_name": "Hast", "gravatar_hash": "8157ee7a8b1f3acb5d0995fa3c8f9aed", "author_url": null, "date": "Nov 10, 2008", "message": "Considering that you both work with computers I'd expect that you know that development in this world is pretty quick. So referring to an 8 year old test is not really relevant. Particularly since the software used then most likely did not use the then best known algorithms.\n\nJust put \"skin detection algorithm\" into Google and you'll find quite a lot. If you start going over ACM or IEEE papers it seems that not much has been added the last few years, most likely because it's pretty much considered a \"solved\" problem.\n\nImplementing an algorithm that actually does this reliably is going to be hard. I'd suggest attempting to calculate a ratio of face and skin in the image. (Many face detection algorithms use skin detection as a first step.) That way it will, hopefully, not flag head shots as \"porn\". Naturally it will classify images incorrectly, and it's not going to be trivial to implement. But it is something I'd expect a CS major or equivalent to be able to do as a project.\n\nRegarding your discussion on handwriting recognition you should go down to a shop and try a tablet pc. (With Windows XP Tablet Edition.) That should be able to detect your handwriting without too much problem. (It works for most people right away at any rate.)\n\nRegarding voice recognition you should give Dragon Naturally Speaking a try. (See review on Ars Technica: http://arstechnica.com/reviews/apps/dragon-naturally-speaking-10-review.ars.) Version 9 should work pretty much the same, because although they have lowered the error rate in the new version the old version was also pretty much \"good enough\". At least if you wanted something to dictate your book to."}, {"author_name": "Ken Penn", "gravatar_hash": "6cc255b82af772cf9c1c6436f76a49cb", "author_url": null, "date": "Nov 11, 2008", "message": "Jeff &amp; Joel - I agree with both of your comments regarding project managers. I was first a carpenter, then a building inspector, then a programmer. In all three, the difference between a project's success or failure - be it a house, a tract of of homes, or software - was the same. It's when the supervisor is told by a subordinate 'my job is done, and done correctly', the supervisor had the knowledge to independently determine whether that was true or not. \nThanks for a great set of podcasts, both your blogs, and a very useful website, \n\nKen"}, {"author_name": "Iain Cheyne", "gravatar_hash": "bd5f7d64bffa42d5bc87d8aa2e6d5098", "author_url": "http://iain.cheyne.net", "date": "Nov 13, 2008", "message": "As a business systems analyst, I'd like to hear Joel's thoughts on what I do. It might be painful, but I'd like to hear the feedback."}, {"author_name": "Satish", "gravatar_hash": "6f08c1532c3f3f099e940d6d3866cb5b", "author_url": null, "date": "Nov 21, 2008", "message": "Joel\nIt seems you have a hard time pronoucing my name. It is pronouced as Sa-tish"}, {"author_name": "MichalT", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Feb 02, 2009", "message": "I think the very obvious solution to porn recognition is crowdsourcing. I, for one. will be happy to help ^^"}, {"author_name": "David Friedland", "gravatar_hash": "b64d136a3822a2e8194a583bb597ed99", "author_url": null, "date": "Apr 24, 2009", "message": "'Azure' is pronounced AZH-er, both in British and American English (of course the British generally pronounce 'er' like 'uh'). No dictionary I have found countenances any pronunciations with the stress on the second syllable. (http://www.merriam-webster.com/dictionary/azure http://dictionary.reference.com/browse/azure) http://dictionary.oed.com/cgi/entry/50016043 The (British) Oxford English Dictionary does also offer AZH-oor, but the stress is still initial."}]}