{"response": [{"author_name": "Chris Bartow", "gravatar_hash": "97f8dbd7b1804150965ab30ae6fb0f0d", "author_url": "http://www.chrisbartow.com/", "date": "Nov 12, 2008", "message": "John Carmack says that they try to use zombies and monsters and what not in games, because they look more real in games because we have nothing compare to.  Where as photo realistic humans don't look right.  \n\n\"Story in a game is like a story in a porn movie. It's expected to be there, but it's not that important.\" - Carmack\n\nJoel, right again!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 12, 2008", "message": "That's true, but Bioshock and Fallout 3 manage to have pretty compelling stories to go along with the excellent gameplay!"}, {"author_name": "lubos", "gravatar_hash": "c4924ce2b51b9a550e3baafce3af25b9", "author_url": null, "date": "Nov 12, 2008", "message": "Jeff: What did you pick?\nJoel: I was good person\nJeff: Really? I was not and then I felt really really bad, I felt like evil\nJoel: You are evil if you did it, are you kidding?? What's wrong with you!?\n\n:-DDDDDDDDDDDDDDDDDDDDDDd ROFL, no comment"}, {"author_name": "Rob Burke", "gravatar_hash": "429329df3c7c21e2a9f156a808c1fab0", "author_url": "http://robburke.ie", "date": "Nov 13, 2008", "message": "Is Stack Overflow down for everyone at the moment or just me?"}, {"author_name": "edddy", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": "http://divisionsoftware.com", "date": "Nov 13, 2008", "message": "@rob: me too. Smells bad..."}, {"author_name": "Sean", "gravatar_hash": "d21e4f986f5b05d89b0070b37e296a87", "author_url": null, "date": "Nov 13, 2008", "message": "Yeah Rob, down for me too. Is it just us Irish I wonder?"}, {"author_name": "Alastair Smith", "gravatar_hash": "c684bbb6d1be7348dc71c38d72c1289b", "author_url": "http://www.alastairsmith.me.uk/", "date": "Nov 13, 2008", "message": "I disagree with Mr Carmack.  I don't game much, but I find the games I most enjoy are the ones with a really good story.  My favourite game is HL2, which had a fantastic story.  I played Doom 3 for a bit, but quickly gave it up because there wasn't much in the way of story (I was just killing lots of zombie alien monster things), and it scared me s***less.  It looked fantastic - awesome graphics and lighting effects (particularly with the torch), but I didn't find it very playable.  \n\nHaving said that, I really enjoyed Portal which didn't have a lot in the way of story, but kept my interest very cleverly with the puzzles, the amusingly quirky voice-over, and the hook of always progressing to another level.  Until...  :-)  [And that's when it got *really* good!]"}, {"author_name": "Preprocessor abuser", "gravatar_hash": "9b51918e28b908216e3eba8d185e9ecb", "author_url": null, "date": "Nov 13, 2008", "message": "If you want tags in the URL for searching purposes, couldn't you just use something similar to the way tags are already managed?\n\nBesides, there are languages that support multiple languages, even though you happen not to use them, Jeff :p\n\n#include \"fr.h\"\nnombre principal(){\n  pout(nombre i=un;i0&amp;&amp;i%5&gt;0) copiec(\"%i\", i);\n    copiec(\"\\n\");\n  }\n}\n\nAll it takes is a little, well, see my name. Also, don't trust the translation, it may be well literally correct but actually wrong."}, {"author_name": "Preprocessor abuser", "gravatar_hash": "9b51918e28b908216e3eba8d185e9ecb", "author_url": null, "date": "Nov 13, 2008", "message": "Ooops, accidentally cut off a few lines.\n\n#include \"fr.h\"\nnombre principal(){\n  pout(nombre i=un;i0&amp;&amp;i%5&gt;0) copiec(\"%i\", i);\n    copiec(\"\\n\");\n  }\n}"}, {"author_name": "Arend", "gravatar_hash": "9d730dbe2e46eb4913c4e5228a8053e6", "author_url": null, "date": "Nov 13, 2008", "message": "An idea for a quick and dirty way to use Google search for tags or users:\n\nCreate a unique string for each tag, put this string on the tagged page and search for that.\n\nFor example, for the tag \"Java\" a unique string could be \"pageHasTheTagJava\". Now if a users searches for \"[Java] beans\" (search for \"beans\" in tag \"Java\"), change the search string to \"pageHasTheTagJava beans\" and hand it to Google.\n\nNot pretty, because you don't want the user to be confused by strange strings, but you still want Google to find them. But it should work."}, {"author_name": "Jim McKeeth", "gravatar_hash": "e5ca3abec062f8174570a4b1d1c840d8", "author_url": "http://www.delphi.org/", "date": "Nov 13, 2008", "message": "It is interesting the Joel made the statement that if a game gives you a choice then it isn't going to make you loose if you make the wrong one.  I remember back in the early 90's when I was playing \"Return to Zork\" which I believe was the first non-text based version of the game. \n\nIn one of the very early scenes there was a vine you could interact with.  You had two options: Dig it up, or cut it off.  Unfortunately cut it off was the more obvious option.  Shortly after that you went over a waterfall so you couldn't come back.  Over time the vine died because you cut it.\n\nThen toward the end of the game you needed it alive, of course at this point it was completely dead and you couldn't go back, so you had to start all the way over again.  \n\nIf was very frustrating that you didn't know if the results of a choice at the beginning of the game were right until you made it to the end of the game.  And there were a lot of hours of game play in there."}, {"author_name": "Andy", "gravatar_hash": "21599de27f8bc6cc7e9b3d002addbca8", "author_url": null, "date": "Nov 13, 2008", "message": "No discussion of crates can be complete without mentioning Serious Sam.\n\nAs I recall, the game originally got noticed by Old Man Murray, and they jokingly told the developers (who are from Croatia) that there weren't any crates in the game. So, near the end of the 2nd secret level, there is a pyramid of crates as a joke."}, {"author_name": "Bernard Dy", "gravatar_hash": "f3ac9b6f28ad2e46e86ddb85b217c6fd", "author_url": "http://www.burningends.blogspot.com/", "date": "Nov 13, 2008", "message": "So Jeff is a Fallout fan...that would explain the \"site is down\" graphic that went up on StackOverflow a month or two back. I knew that looked familiar!"}, {"author_name": "Jeff Johnson", "gravatar_hash": "a252eecd500b0ba734ea17f9ae1fb2da", "author_url": null, "date": "Nov 13, 2008", "message": "I haven't been able to access http://www.stackoverflow.com for several days now, I get an http 403 forbidden."}, {"author_name": "Jon Kragh", "gravatar_hash": "3e9cbdc67744f960325f486d782c9b29", "author_url": "http://www.vastrank.com", "date": "Nov 14, 2008", "message": "Duplicating content sounds like a bad idea if you are doing it for Google Search specifically.  Google CSE sounds like a good idea though (or more specifically adsense for search which does not cost you anything and pays you).\n\nAs for dup content, at a very minimum people will end up linking to different urls for the same content, which will end up lowering your page rank for that content compared to having a single copy.\n\nAlso, google's webmaster guidelines recommend against it: http://www.google.com/support/webmasters/bin/answer.py?answer=66359\n\nI use Google Custom Search as the only search on <a href=\"http://www.vastrank.com\" rel=\"nofollow\">Vast Rank</a> a college ranking site I created in my spare time, and it works well.  I imagine it would work very well on SO as the primary search.  I assume your tagging would help with weight of pages towards the tags.\n\nI am working on making my sitemap lastupdate times accurate for my own content.  Are you guys using lastupdate time?  I believe this will result in a fairly quick way to get your newest content indexed asap.\n\nLove the show!  Plus, Joel I liked when you were animated last week! Gloomy Joel is not as cool as animated Joel!\n\nCheers,\nJon"}, {"author_name": "Juan", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Nov 14, 2008", "message": "I'm playing Fallout 3 right now and it's more addicting than a buffout-jet-psycho-mentat coctel...\n\nThe first two games were awesome also, this one really lives up to them..."}, {"author_name": "Guy", "gravatar_hash": "d9f2c02c23a3013166710a1d24bca056", "author_url": "http://wildfiction.blogspot.com", "date": "Nov 14, 2008", "message": "\"Joel has literally written the book on hiring great programmers\"\n\nI think we've stumbled on how to boost productivity: http://wildfiction.blogspot.com/2008/11/new-hire-boosts-productivity.html\n\n(Please don't send me hate mail - this is a joke!)"}, {"author_name": "Isaac Lin", "gravatar_hash": "408975adb6e2f531f290e7fe0209a3a9", "author_url": null, "date": "Nov 16, 2008", "message": "Programming languages can be localized only if keywords are distinct from identifiers in the language, otherwise there can be a clash between the localized keyword and identifier names used by the programmer. Languages like Perl have distinct sigils for variable names, but they are optional for function names, and so conflicts can still arise."}, {"author_name": "Yuval", "gravatar_hash": "16f92030c77f97528ba957faa8a6dc53", "author_url": "http://mishory.blogspot.com", "date": "Nov 18, 2008", "message": "Regarding the localization of programming languages, it reminded me that a professor at my university, who taught the compilers course traditionally (I think he still does) decided one semester to have the students rewrite C so that it would be *entirely* in Hebrew. keywords, variables, everyhting. Same syntax, only right-to-left. \nLucky for me, the students in that particular semester raised hell so badly that the professor decided to scrap the idea, and by the time I took the course, the exercises were back to normal... \n\nYuval =8-)"}, {"author_name": "Angel García Cuartero", "gravatar_hash": "f7de72ac1b3e6b8e7597dee46bbcfa1a", "author_url": "http://bricklay.wordpress.com", "date": "Nov 18, 2008", "message": "I am a Spanish developer and I think that translating programming languages can be a real PITA. I even wrote a short entry in my blog about it (of course useless for you unless you can read Spanish). Example: I wasted a lot of time looking for the right word use for the arithmetic mean, which is usually \"media\". No way, I had to go throught all the statistic functions just to find somebody translated to \"promedio\" which is valid, but not commonly used. I would have preferred to learn the English words instead an unexpected translation.\n\nGreetings!"}, {"author_name": "Assaf", "gravatar_hash": "edd04181a3fa46cad69d2146129815cf", "author_url": "http://onsoftwaredev.blogspot.com/", "date": "Nov 18, 2008", "message": "In the early days of java , the day-to-day work of a programmer was to develop.\n\nIn today world , in the enterprise realm (J2ee), most of what could have been developed had already been developed. You know the saying \"don`t reinvent the wheel\" - in java it has become \"don`t reinvent the car\".\n\nThe world of java programming is now reduced to \"painting and customizing the car\" which is already completely built for you.\nThis situation has two sides for the programmer: The good side is that you can create great enterprise-grade applications in a month. The bad side is that most of the month is used to learn xml and APIs and the small minority of the month is used for actual \"old-fashioned\" coding.\nFor the manager/company is has only one side: create good applications in no time by programmers which cost no money.\n\n\nI don`t know dot-net , but my guess is the the enterprise part of it , including ASP.Net and the enterprise server-side will sure follow this path."}, {"author_name": "Ross", "gravatar_hash": "7b264437c3c5a8621765158cf4ef6b88", "author_url": "http://rgoddard.blogspot.com", "date": "Nov 20, 2008", "message": "I totally beat you with the video games and wedding thing. Our place cards and each table identifier, was a video game. We sat at the original Legend of Zelda table, we had a Final Fantasy 7 table, a Tetris table ect. And this was totally my wife's idea."}, {"author_name": "Daniel", "gravatar_hash": "867d273117f85687ebe25eb04779aafd", "author_url": null, "date": "Nov 21, 2008", "message": "I totally agree with Angel here.\nAs a native-Spanish-speaker-highly-fluent-in-English, Excel is a nightmare for me, not only for macro programming, but mostly for normal \"cell functions\".\n\nI use excel to \"do stuff\" to tabular data (normally massage it before putting it back into a DB), and I've lost countless minutes in my life looking at the very creative translation that the localizers used for the english function that I knew was there...\n\nAdd to that the fact that it's virtually impossible to get an English version of Office in here...\nI'm truly impressed by the idea of storing the functions tokenized, so that if you open the same spreadsheet in another office language, it looks good.\nBut there should be an option to disable this and stick to English (you can disable it for the French if they'll get offended by it, though)"}, {"author_name": "Erlend", "gravatar_hash": "cf4621433dfa81bba4712eed74acbebb", "author_url": null, "date": "Nov 26, 2008", "message": "I think Joel's idea of duplicating questions in a \\folder\\ for every tag would be bad for SEO, as each page on SO would have multiple urls, and thus the Page Rank would be spread over more pages as opposed to having just one canonical url for each question.. I guess what you could do is let that canonical url contain all the tags: http://.../questions/hibernate/java/ORM/1234566/How-do-I-..."}, {"author_name": "Grzegorz Gierlik", "gravatar_hash": "4864c8ccf59b38d1a965909094d5eba6", "author_url": "http://ggierlik.wordpress.com/", "date": "Dec 11, 2008", "message": "I saw many years ago (10-15) a few localized (Polish) version of LOGO.\n\nSo, instead FORWARD there was NAPRZÓD, instead of REPEAT there was POWTÓRZ.\n\nAS you can see, it even used Polish characters in commands.\n\nMoreover, it makes sense because all of these implementations were used at schools to teach kids programming."}, {"author_name": "Richard", "gravatar_hash": "1e26a22dd12a9503eeab5398664b77ec", "author_url": "http://owlsayswoot.com", "date": "Dec 13, 2008", "message": "With regard to the Beautiful Soup reference. Have you ever used the Html Agility Pack (http://www.codeplex.com/htmlagilitypack)?"}]}