{"response": [{"author_name": "Jörg W Mittag", "gravatar_hash": "1f1d81bc927dd67f05ea41f4c8a61e9f", "author_url": null, "date": "Nov 20, 2008", "message": "I agree with Jeff: there's practically no difference between a feature request and a bug. If I want to do X and I can't do X because X isn't implemented or if I want to do X and I can't do X because the app crashes ... that's the same, isn't it?"}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Nov 20, 2008", "message": "“Self-reflexive”? Isn’t the “self” redundant?"}, {"author_name": "Edddy", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": "http://divisionsoftware.com", "date": "Nov 20, 2008", "message": "\nWe do plan to talk a bit less about building Stack Overflow and a bit more about our favorite questions on Stack Overflow\n\n\nWhy is that? I love hear about the making of a real world website, and the solutions to real problems."}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Nov 20, 2008", "message": "\"There are some thematic similarities between Dell’s IdeaStorm and My Starbucks Idea and UserVoice — to some degree, UserVoice is users voting on the direction your software should take. Does software democracy work?\"\n\nBoth IdeaStorm and MyStarbucks are both run of SalesForces software platform.  That is why there are similarities."}, {"author_name": "Drew Gibson", "gravatar_hash": "dc5e4e4387374e20efffa31eb7608ef9", "author_url": null, "date": "Nov 20, 2008", "message": "Hey Jeff, your 'rebuild the party' link is broken."}, {"author_name": "Prakash", "gravatar_hash": "2ff2c9a836c2d4fead5f9913aeb9e088", "author_url": "http://www.dearprakash.com", "date": "Nov 20, 2008", "message": "http://rebuildtheparty.uservoice.com/"}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Nov 20, 2008", "message": "First of all, it's Conway, not Connelly. You've got to <em>listen</em>, Atwood. Also, to Joel: you shut up! ;-)\n\nSecondly, I can't believe you waded back into the NP-completeness issue only to demonstrate that you <em>still don't know what you're talking about</em>. (Joel wasn't faring much better, either.)\n\nThere's a difference between the complexity classes NP and NP-complete. A decision problem is in NP if it can be solved in nondeterministic polynomial time or, equivalently, if a solution to the problem can be checked in polynomial time. \n\nA problem is NP-hard if any problem in NP can be reduced to it in polynomial time (i.e., the problem is \"as hard as (and maybe harder than)\" any problem in NP). An NP-hard problem is not necessarily in NP (e.g., a problem might take exponential time and also be NP-hard).\n\nIf a problem is <em>both</em> in NP and NP-hard, then it is NP-complete.\n\nA <em>defensible</em> interpretation of you statement (\"Nobody can define what makes a problem NP-complete, exactly\")&mdash;one provided by commenters on your blog&mdash;is: though we can precisely define <em>that</em> a problem is NP-complete, we can't nail down what property of the problem <em>makes</em> it NP-complete. For example: Why is 2-SAT in P, but 3-SAT is NP-complete? Why is the fractional knapsack problem solvable in O(n log n) time, when 0-1 knapsack is NP-complete?"}, {"author_name": "Paul", "gravatar_hash": "0e89e85f7684c5aac4f1c96149f8de93", "author_url": null, "date": "Nov 20, 2008", "message": "This is my first time listening to your show and had to shut it off after the first 4 minutes. The audio quality is horrible. I am sure the content may be interesting but I just could not take it anymore. That is one important attribute that distinguishes good podcasts from the bad ones."}, {"author_name": "Ian Patrick Hughes", "gravatar_hash": "78897c96c45c02fa88b191c854fa83a8", "author_url": null, "date": "Nov 20, 2008", "message": "Wow. 4 minutes in and you bailed? I have listened to all of them. My ears must have horrible taste. \n\nUsing a mobile phone must make your ears bleed."}, {"author_name": "lubos", "gravatar_hash": "c4924ce2b51b9a550e3baafce3af25b9", "author_url": null, "date": "Nov 20, 2008", "message": "I agree, buy better mics for your guests, it was too distracting to listen.\n\nAlso very smart of you Jeff to invite into podcast technically one of the potential competitors of Joel. \n\nMy favorite part this week was when Joel has asked how many unit tests are in stackoverflow.com codebase, that I found quite funny.\n\nDoes anybody feel that Jeff &amp; Joel are loosing more credibility than gaining by making these podcasts? But still, I really enjoy them and hopefully they'll keep making them."}, {"author_name": "phil jones", "gravatar_hash": "248a3c4ba8f2972427222d46954f9c1c", "author_url": "http://www.synaesmedia.net", "date": "Nov 20, 2008", "message": "Wait. Does this mean that StackOverflow actually *is* UserVoice behind the scenes? (I mean the software, functionality?)"}, {"author_name": "Richard White", "gravatar_hash": "2b8c78a329733d8b8c9ac7636a9534a8", "author_url": "http://uservoice.com", "date": "Nov 20, 2008", "message": "@phil Haha no though I desperately want SO's reputation system for UserVoice :)"}, {"author_name": "easyAl", "gravatar_hash": "f0928e423b27f75d0f310c80ae5d390d", "author_url": null, "date": "Nov 20, 2008", "message": "This is my twelfth time listening to your show and had to shut it off in the middle of the part about NP Completeness and the Halting problem. \n\nJoel was trying to inject some actual CS understanding into the podcast and Jeff kept responding with \"yeah\" and a procession down some less interesting, less relevant tangent. Not much of a conversation. \n\nHearing Jeff ignore Joel's explanations and comments over and over again is like presenting your beloved but starving Labrador Retriever with a platter of fresh meat, only to watch as Fido decides he's too lazy to lift his head and examine the life saving meal. So frustrating. Why won't Jeff tear in to what Joel's offering and get a clue?"}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Nov 20, 2008", "message": "I believe the static analysis tool Joel referred to is <a href=\"http://research.microsoft.com/chess/\" rel=\"nofollow\">CHESS</a> (which came up on <a href=\"http://stackoverflow.com/questions/9926/analyzing-multithreaded-programs\" rel=\"nofollow\">this StackOverflow question</a>). It uses \"bounded context switching\" to limit the search space for potential concurrency errors.\n\nP.S. Jeff are you refusing to fix my name to punish me for being dickish about NP-completeness. :-)"}, {"author_name": "Brian Egge", "gravatar_hash": "72b7de3d6804d6cd6fa573e6af244b64", "author_url": "http://www.theeggeadventure.com/wiki", "date": "Nov 21, 2008", "message": "Jeff said they're nothing in Excel which gives him something that's kind of right.  I'm surprised that Joel didn't say anything, but maybe in Excel 1.0, there wasn't the equation solver.\n\nYep, the equation solver is build into Excel specifically to solve problems which are hard or impossible to solve otherwise."}, {"author_name": "Dag", "gravatar_hash": "4fa9a5f4e42f94e2028fe3e83b1625dd", "author_url": null, "date": "Nov 21, 2008", "message": "Glad to see I'm not the only person who had to turn off the podcast in the middle of the NP discussion.  That was just painful.  Jeff, I'm sure you're a great programmer, but you're apparantly no computer scientist and certainly no mathematician.  You’re not doing the programming community any favours by spreading such disinfomation.  In the future please stick what you know."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 21, 2008", "message": "> [you are] certainly no mathematician\n\nThat is most definitely true. See item #3 at the bottom of this post, here:\n\nhttp://www.codinghorror.com/blog/archives/000770.html\n\nHonestly, I have yet to read an explanation of NP-complete that really works for me. The wikipedia entries are nigh useless."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://www.johntopley.com/", "date": "Nov 21, 2008", "message": "Jeff mentions that there are still pagination bugs in Stack Overflow and that people occasionally log defects for this on UserVoice. As one of those anal people I just can't understand why it's so hard to fix. In Ruby on Rails you just use a plugin and that's it, job done. Is it really so hard to do in the .NET world?"}, {"author_name": "Bill", "gravatar_hash": "d73fdee763defa016213ff95437c427d", "author_url": null, "date": "Nov 21, 2008", "message": "Learning about NP-Completeness from Jeff is like learning about irony from Alanis Morissette."}, {"author_name": "Joel Spolsky", "gravatar_hash": "d77663c217e9d27b725338c06674c94b", "author_url": null, "date": "Nov 21, 2008", "message": "Bill: I suppose you've seen this:\n\nhttp://www.youtube.com/watch?v=nT1TVSTkAXg"}, {"author_name": "Steve Steiner", "gravatar_hash": "b4e4d3247073b2656ab082e160c4e471", "author_url": null, "date": "Nov 22, 2008", "message": "Today's podcast made me laugh, then ask another question on stack overflow."}, {"author_name": "smok", "gravatar_hash": "0fa894bec1fbba0f907a75567fdb7926", "author_url": null, "date": "Nov 22, 2008", "message": "Why do I have to spend a minute listening advertising bullshit?"}, {"author_name": "Tim", "gravatar_hash": "93ad15f9e3fdd8365cdcc48badda8cdc", "author_url": null, "date": "Nov 23, 2008", "message": "&gt;Honestly, I have yet to read an explanation of NP-complete that really works for me. The wikipedia entries are nigh useless.\n\nJeff, as a CS student I would recommend you read some real books instead of googling the web for this. Wikipedia articles on CS and Math are not really very good for the simplest introductory explanations that you appear to want to find. In fact in this area you might need to read quite a bit before you really understand the problem.\n\nI realise that your original reason for stackoverflow.com was that people never read books and just want quick answers to (hard) problems, but sometimes if there is a greater depth of understanding needed then books are really useful. I know you still read book as you have talked about many on your blog. If you feel passionately enough about these CS problems then maybe you should go read some introductory CS degree text books and report back with some blog entries on what you have found.\n\nTim"}, {"author_name": "Grom", "gravatar_hash": "a14537020ec5b11fea3b956353724860", "author_url": "http://grom.zeminvaders.net", "date": "Nov 23, 2008", "message": "&gt;Honestly, I have yet to read an explanation of NP-complete that really works for me. The wikipedia entries are nigh useless.\n\nReally? What about the stackoverflow answers then?\n\nIn wikipedia it says \"A problem p in NP is also in NPC if and only if every other problem in NP can be quickly transformed into p.\" where quickly refers to polynomial time.\n\nNP-Complete is important because if you solve any of the NP-Complete quickly then every problem in NP can also be quickly solved."}, {"author_name": "Grom", "gravatar_hash": "b3aad0ee8408f55f8d2462a9dea4a8a8", "author_url": "http://grom.zeminvaders.net", "date": "Nov 24, 2008", "message": "Also Jeff, n^3 is still polynomial. Joel was trying to tell you but you just ignored him. k^n on the other hand is exponential time (super-polynomial). And NP-Complete is not a recursive definition please read it carefully."}, {"author_name": "Gregg", "gravatar_hash": "3840921efab68a0792b395ab22257f3b", "author_url": "http://www.equivalence.co.uk/", "date": "Nov 24, 2008", "message": "Just listened to this podcast at the weekend and I have to admit the NP-completeness/hardness discussion was pretty painful to listen to.  Don't get me wrong I've been listening to the podcast since day one and will continue to listen because it's fun, informative and entertaining. The others here who are also making a similar comment about the NP-completeness stuff are probably in the same situation as myself, in that we have a detailed understanding of NP-completeness. The problem with this is that, like the area of Algorithms and Complexity in general, it is very nit-picky about being extremely accurate and precise with the details - and correctly so.  However, if all you need to take from the NP-completeness topic is that there is a set of problems that are (currently) hard to solve quickly using a computer then that's fine.  The problem with a more detailed discussion about these things is that unless you have a pretty concrete understanding of these things the lack of accuracy can appear painful to a listener who is in the know.  For example, things like \"NP\" meaning \"non-polynomial\", which I'm sure I heard Joel say - I could be wrong though.  My fear is that someone listening then thinks this IS what it means so the (mis)information spreads.  So why is this little inaccuracy so important?  Well someone might think that each problem that is NP-complete cannot be solved in polynomial-time, but the truth is we don't know if the problem can or can't be solved in polynomial-time. This is, literally, the million dollar question. I'm not trying to be fussy here as I thought that Jeff's original discussion on his blog was great from a point of view of educating people that such problems exist.\n\nAlso, I posted a link to a blog post (http://www.equivalence.co.uk/) that I made about NP-completeness (titled NP-completemess) over at Coding Horror when Jeff first had this discussion.  I tried to make it a less formal discussion on NP-completeness that I hoped someone could take something from - maybe I failed but a few friends have said that it helped them, so if you are struggling with the wiki articles then maybe it will help.\n\nSorry or going on for so long, but hey, you have got to be passionate about something. Right?"}, {"author_name": "Lamah", "gravatar_hash": "d118957f1291460729b9b8696ed2430b", "author_url": null, "date": "Nov 26, 2008", "message": "Re: The NP complete problem. How many of the people on the podcast even have a CS degree?"}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Nov 26, 2008", "message": "Great podcasts overall, I really enjoyed them all.  Jeff may find this link useful: http://simple.wikipedia.org/wiki/Polynomial"}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Nov 26, 2008", "message": "Difference between a feature and a bug:\n\nA pending feature is functionality you want to add.\n\nA bug is a problem in a feature that you claim to have and that you claim [implicitly] works.\n\nA missing feature is perceived to mean that you did not work on the task yet.  A bug is perceived to be a problem in your product and attacks your products credibility."}, {"author_name": "Steve", "gravatar_hash": "5f32763a004d8782bfd754e75ffeee77", "author_url": null, "date": "Nov 27, 2008", "message": "In response to \"smok\":\n&gt; Why do I have to spend a minute listening advertising bullshit?\n\n3 alternatives\n\n1. Pay to become a 'paid-member' and get access to the promotion free version.\n\n2. Start the podcast then fast forward it to around 1:15  each week.\n\n3. My favourite alternative is (This will actually require 4 minutes of your time but worth it for you ;) http://www.kungfugrippe.com/post/60308741/louis-ck-everythings-amazing-nobodys"}, {"author_name": "Wolf", "gravatar_hash": "696cd76792b2e538ace337e945844823", "author_url": null, "date": "Dec 05, 2008", "message": "Thanks for the 'left turn'. I had put this podcast away for about a month because of just this issue. I'm glad to be back to hear this is a new focus. If the upcomwing podcasts follow this lead, I'm back for good.\n\nThanks."}, {"author_name": "Liron", "gravatar_hash": "4ac04689ead45d6c87d9f2c2c7d3e07f", "author_url": null, "date": "Dec 06, 2008", "message": "lol Steve, thanks for posting that link in option #3, gave me a few laughs.\n\nAnd to answer smok, it's because IT conversations is non-profit and they need some way to cover their expenses. But you should really just use Steve's option #2."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Dec 10, 2008", "message": "Please, please find a Computer Scientist in your area to have teach you about NP completeness and computability ..."}, {"author_name": "John", "gravatar_hash": "54ac7d28bed43312bf7d9145d200c875", "author_url": null, "date": "Apr 21, 2009", "message": "The knapsack problem is the same problem as the traveling salesman problem?  I don't think so."}]}