{"response": [{"author_name": "Steve Burman", "gravatar_hash": "ce585b37a98ee36ed66593f7d3f21b56", "author_url": "http://www.mostlyclean.com", "date": "Nov 27, 2008", "message": "Best. Standup. Ever.\n\nhttp://youtube.com/watch?v=SUcmpZ8hzKA"}, {"author_name": "Gregg", "gravatar_hash": "3840921efab68a0792b395ab22257f3b", "author_url": "http://www.equivalence.co.uk/", "date": "Nov 27, 2008", "message": "A follow-up to your NP-completeness post Jeff! Colossal! I have to applaud you for having some amount of guts ;-) You're the man!"}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": "http://stackoverflow.com/questions/324554", "date": "Nov 27, 2008", "message": "First of all two things:\n\n1.\tThank you for such a wonderful site.\n2.\tSorry for not sending an audio question. I don’t have international access at office I hope it gets visible here. \n\nMy question is, how do you feel about a proliferation of questions that are not programming related being so popular while other that are truly about programming languages being closed or donwvoted furiously.\n\nThis happen to me today:\nhttp://stackoverflow.com/questions/324554\n\n                I think it has to do with the human nature. We want to be praised and have fun.  I can’t understand why some people gets offended when they’re asked to code.\n\nThanks in advance."}, {"author_name": "Mike Woodhouse", "gravatar_hash": "5978e2ed3a31f1bd2361dbb919d92012", "author_url": "http://grumpyop.wordpress.com", "date": "Nov 28, 2008", "message": "While the 'cast downloads I browse the show notes to get an early peep (listen?) behind the curtain of what I'll be listening to during the homeward leg of my commute.\n\nSo without actually having heard this week's discussion yet, I thought I'd mention that next Thursday is the 30th anniversary of my starting work in the information technology business. And I'm still programming, with no immediate plans to stop. Fairly grumpy these days, mind, what with all these young whippersnappers who think relational databases are old hat (they weren't any kind of hat at all when I started).\n\nDownload done, back to Ruby on Rails..."}, {"author_name": "Maciej Rutkowski", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Nov 28, 2008", "message": "Joel is right - If the USB device has a unique identifier, Windows doesn't rediscover it when plugged into a different socket."}, {"author_name": "John Sibly", "gravatar_hash": "dbd5895d0bebc3e5980ee6e0d001848c", "author_url": "http://www.sibly.co.uk", "date": "Nov 28, 2008", "message": "Great explanation of why the add new hardware wizard appears when you switch usb devices to different ports:\nhttp://blogs.msdn.com/oldnewthing/archive/2004/11/10/255047.aspx"}, {"author_name": "Stuart Ward", "gravatar_hash": "d40310d44e67dc3c140248d9b334efb2", "author_url": "http://stuartward.wordpress.com/", "date": "Nov 28, 2008", "message": "Math in computer programming. Well we have the whole area of crypto. For example the RSA algorithm. and then there are all the math involved in trying to find flaws in these. \nhttp://en.wikipedia.org/wiki/RSA\nOr there is the current competition to find a new hash algorithm.\nhttp://www.csrc.nist.gov/groups/ST/hash/sha-3/index.html"}, {"author_name": "James Sapara", "gravatar_hash": "076e5c059f577cd3af451f3887d72cb1", "author_url": null, "date": "Nov 28, 2008", "message": "Your discussion about burn out really hit home. It also opened my eyes to the root of the problem and how to fix it. Thanks for the great pod cast!"}, {"author_name": "Johannes", "gravatar_hash": "debc1608fc160fb51ed0b07c9ad7739c", "author_url": null, "date": "Nov 28, 2008", "message": "Regarding Jeff's question about when you need math in programming: I was on a team with a reasonably skilled developer who had no math education. I didn't notice until one day when he wrote some very simple vector transformations. He obviously didn't realize that was what he was doing, so his code turned out horribly unreadable and wrong in a lot of cases. Still, after hammering on it for long enough it worked.\n\nMy point is that you can always get around a problem without math education, but you will probably not realize it when you are taking a huge detour to get to a suboptimal solution."}, {"author_name": "seanyboy", "gravatar_hash": "a6290b5e35e53243e42655c62b2f3705", "author_url": null, "date": "Nov 28, 2008", "message": "Like Jeff, I've never been very good at maths, but my verbal skills are off the wall. Again like Jeff, I'm a really good programmer, but not a really great programmer. \n\nI wonder if there's a lot more of us out there. I've always gone a little bit quiet when people say \"you need solid maths abilities to be a programmer\" because I've never had them. I've always been able to \"translate\" customer requirements to the required programming language. \n\nAnyway - I think it's all quite interesting. We need some evidential proof that good verbal skills equate to good programming skills."}, {"author_name": "Steen", "gravatar_hash": "c77e00209cd87ff20cfe06a0c5434788", "author_url": null, "date": "Nov 28, 2008", "message": "Did your interview with Yegge inspire the math-deprecation of the current programmer-pool? \n\nhttp://steve-yegge.blogspot.com/2006/03/math-for-programmers.html\n\n;)"}, {"author_name": "Donny V.", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Nov 28, 2008", "message": "Now I don't feel as bad. I suck at math and I feel I'm a good programmer, but never felt great because of my lack of math skills. I'm a musician, so I believe its my creative side that helps me make up for my math deficiency. I think unless your doing some type of analytical or statistical programming, you don't really use traditional math in programming. I guess what your really using in programming are the concepts of math like Polynomials and functions. Your using abstraction a lot which is I guess the fundamentals of algebra."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 29, 2008", "message": "Thanks for the links, guys!\n\nSpeaking of links, I forgot to link the deconstruction of Alanis Morrissette's \"Isn't It Ironic\"\n\n\"The now infamous slating of Alanis Morissette's 'Ironic' by Irish comedian Ed Byrne perfomed on The Standup Show some years back... \"\n\nhttp://www.youtube.com/watch?v=nT1TVSTkAXg"}, {"author_name": "Josh", "gravatar_hash": "4a3644f49db41a7d7f42b4c679e7864c", "author_url": "http://insidethemachine.wordpress.com/", "date": "Nov 29, 2008", "message": "I think Alanis Morisette was a genius.  She wrote a song called \"Ironic\" without any examples of irony.  Isn't that ironic?"}, {"author_name": "lubos", "gravatar_hash": "c4924ce2b51b9a550e3baafce3af25b9", "author_url": null, "date": "Nov 29, 2008", "message": "Joel was kind of rude around 20:40. good luck with getting more questions from listeners."}, {"author_name": "lubos", "gravatar_hash": "c4924ce2b51b9a550e3baafce3af25b9", "author_url": null, "date": "Nov 29, 2008", "message": "Josh, according to wikipedia http://en.wikipedia.org/wiki/Ironic_(song), at the time she was writing the song, she thought examples she had given in the song were ironic although she wasn't really making sure everything's 100% correct."}, {"author_name": "Marc", "gravatar_hash": "7297c7484eb236c1b961b788f7a37112", "author_url": "http://www.marc-seeger.de", "date": "Nov 29, 2008", "message": "As for the USB stuff in the first seconds:\nIt's only windows specific that simply changing the USB port will result in the whole \"Oh, a new device\" situation"}, {"author_name": "PeggySu", "gravatar_hash": "8930f9c88f201735d8d676184f5d9ca2", "author_url": null, "date": "Nov 30, 2008", "message": "Your discussion about its being possible to be a useful programmer without knowing (much) math shows how much computing has changed since the first computers.  Much of the original motivation for hardware development was to do math faster than humans can. Early programming was to a large extent what we now call computational science (as opposed to computer science).  \n\nOf course, even now, the unique function of many (if not most) important applications is mathematical in nature.  Weather prediction, climate modeling, structural design, pharmaceutical development, statistical analysis, virtual reality, ....  The list goes on and on.\n\nTo me the fun part of programming is the interplay between the design and implementation of algorithms."}, {"author_name": "Mike Akers", "gravatar_hash": "2336ace23e546b29059a149fac15a8c8", "author_url": "http://www.michaelakers.net", "date": "Nov 30, 2008", "message": "@lubos: Actually, as I was pressing the send button for that question, I was thinking to myself \"I bed they're going to rip my question apart and say something like 'what are we supposed to be here, mind readers?'\" I figured no matter what happened, my question would lead to some interesting discussion, which it did.\n\nAlso, Joel was right, I was working in a dysfunctional workplace at the time, and I'm happy to have moved on to a new job that's dysfunctional in other ways ;)"}, {"author_name": "Henrik Warne", "gravatar_hash": "d3b30f2f5d21408908a2b546daa2ef0f", "author_url": null, "date": "Dec 01, 2008", "message": "There is an interesting article here http://www.maa.org/devlin/devlin_10_00.html about why math is good for programmers. The argument is basically that doing math teaches you to work with abstractions, something that is also needed when programming.\n\n“But software engineering is all about abstraction. Every single concept, construct, and method is entirely abstract. Of course, it doesn't feel that way to most software engineers. But that's my point. The main benefit they got from the mathematics they learned in school and at university was the experience of rigorous reasoning with purely abstract objects and structures.”"}, {"author_name": "Brian Sullivan", "gravatar_hash": "a21cd584ff01df83adbf6b3d03d6ecdb", "author_url": "http://www.sullivansoftdev.com/blog", "date": "Dec 01, 2008", "message": "Re: Joel never having met anyone who hasn't made an 800 on the SAT math section... Really?  Even in programming circles, that's some pretty rare air.  While exposure to collegiate-level math may have some benefits to programmers working on certain problems, I certainly don't think flawless execution of math skills is a requirement to be a good programmer.  I think the majority of developers wouldn't come anywhere close to that level.  I, like Jeff, had decent math scores and very high verbal scores, and I think I at least have the potential to be a very good programmer."}, {"author_name": "Robert C. Barth", "gravatar_hash": "c23ef823ae0ba03daf7675991deb3083", "author_url": "http://www.norimek.com/blog/", "date": "Dec 03, 2008", "message": "Regarding what Joel mentioned not being able to dynamically sort SQL... he's not quite correct. See my article on this topic to implement it in SQL 2005 and up. (http://www.norimek.com/blog/post/2008/04/Dynamic-Sort-Parameters-in-MS-SQL-Server-2005.aspx)"}, {"author_name": "Adam", "gravatar_hash": "a9aaf351adda1e39bbe64b7ba38b55f0", "author_url": null, "date": "Dec 04, 2008", "message": "From http://www.ntk.net/2003/07/18/\n\nThe web is packed with critics devising coincidences that are more \"ironic\" than Alanis' examples (\"It's like rain, on your wedding day - if you're marrying a weatherman! And he predicted that it wasn't going to rain!\"), but the song actually seems to deal in minor everyday instances of *situational* irony, [defined] as \"a state of affairs or an event that seems deliberately contrary to what one expects and is often amusing as a result\". It's \"often\" amusing, but doesn't have to be: a \"black fly in your Chardonnay\" therefore runs contrary to the wine's la-di-dah connotations; \"rain on your wedding day\" flies in the face of Western associations between happiness and sunny weather. There's no doubt that Alanis could have come up with more \"ironic\" examples if she'd studied genre classics like Oedipus Rex - \"It's like killing your father/ when you're trying not to/ It's like marrying your mother/ when that's socially taboo\" - but her original scenarios were probably more recognisable to the CD-buying public."}, {"author_name": "Mark Drayton", "gravatar_hash": "ff4602ff49ddafe339c70b582f5e325d", "author_url": null, "date": "Dec 05, 2008", "message": "Yammer (https://www.yammer.com/) is basically Twitter for organisations. Unlike Twitter it has rudimentary threading and no 140-char tweet (yam?) limit."}, {"author_name": "skolima", "gravatar_hash": "b6f2f9275a3eb6c38433419311d723a2", "author_url": "http://skolima.jogger.pl", "date": "Dec 31, 2008", "message": "Per the Windows-specific behaviour of reinstalling USB devices each time you change the port: it sucks especially badly if you don't have admin rights. Changed the mouse port? Sorry, won't work, you're not root.\n\nNo other OS does this.\n\nAny why the f**k did this peculiarity get carried over to Bluetooth devices as well?"}]}