{"response": [{"author_name": "Mike Powell", "gravatar_hash": "8fe93eb95735751f12c09f2107cbbf92", "author_url": null, "date": "Nov 25, 2008", "message": "Nice post, Jeff.  It looks like your vision for the site is coming to fruition.  Congratulations!"}, {"author_name": "Calvin Spealman", "gravatar_hash": "1fe2208d54af9ce3d73949de1b8b9640", "author_url": "http://techblog.ironfroggy.com/", "date": "Nov 25, 2008", "message": "This \"questions\" grows into such a mammoth and someone closes my question about transferring a domain between IP addresses, because it isn't directly about programming. I reopened it, but I was a little peeved. I am no longer peeved, because it was just someone with rep expressing their opinion.\n\nI'm sure the guy hates Jon Skeet."}, {"author_name": "dbr", "gravatar_hash": "edf857d71f672d8f411ef6b8376316b8", "author_url": "http://neverfear.org", "date": "Nov 25, 2008", "message": "This question highlights a problem: \"edit wars\"\n\nThe aforementioned question has been edited over 30 times, and has been closed/reopened countless times.. There seems to be nothing in place to deter this..?"}, {"author_name": "Tom", "gravatar_hash": "1f0b00b8853cf0311888bb3ed2a77ebc", "author_url": "http://www.tommcfarlin.com", "date": "Nov 25, 2008", "message": "One of the things that I really like about the whole Jon Skeet Facts 'question' is that it shows that a true community is actually evolving.\n\nIn my mind, just because you have a group of people asking a questions and/or giving answers doesn't really denote a community; however, now that we're seeing people actively recognize one another on the site and participate in questions that are off-topic but still based on peers is pretty awesome."}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Nov 25, 2008", "message": "@dbr: The Edit Wars are not as bad as the Close Wars. Why have down-voting if a handful of self-appointed arbiters can decide what should be discuss-able on SO, and then shut down any questions that don't meet their approval?\n\nAnd then you get open/close fights which most of the community can't participate in because fewer than 1% of us have more than 3,000 points. And here I was thinking that my up- and down-voting (along with everyone else's) was going to decide what we would see on SO.\n\nWhy have voting if a self-selected cabal can just negate the community's vote whenever they get their panties in a twist?"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Nov 25, 2008", "message": "Thanks for weighing in on this, Jeff.  I was extremely surprised to see how controversial the \"question\" turned out to be.  I posted it with all due respect to Jon Skeet, and he showed what a class act he is by joining in the fun.\n\nI would also argue that the question is, at least peripherally, programming related.  Jon Skeet is a programmer, he's an author who has written a book about C# (see his profile), and he's an active member of the Stack Overflow community.  Questions about the breadth and depth of his knowledge, even if tongue-in-cheek, are just as programming related as questions about programming cartoons and t-shirts.\n\nI'd like to thank you and the Stack Overflow team for giving us the forum in which to explore these, and so many other, important issues.  :)"}, {"author_name": "Keng", "gravatar_hash": "15769bbea999aee421458f52e7c9d011", "author_url": "http://www.TheMacroHook.blogspot.com", "date": "Nov 25, 2008", "message": "Yeah Me!"}, {"author_name": "Rik", "gravatar_hash": "18a86c02ff06b2af506f1e842745d62f", "author_url": null, "date": "Nov 25, 2008", "message": "I would've prefered this post be called \"Stack Overflow is People\""}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Nov 25, 2008", "message": "\"Stack Overflow is you.\"\n\nI knew that already :)\n\nWhat, you're saying it's other people too? Hmm... ;)"}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Nov 25, 2008", "message": "The problem I have with this particular question is that it keeps popping back up to the site's front page.\n\nIt was funny when it first came up, but LET IT DIE ALREADY.\n\n(P.S. I won't see it any more thanks to the introduction of ignored tags, to which I promptly added jon-skeet)"}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Nov 25, 2008", "message": "And when I said \"I won't see it any more\" apparently I really meant \"I see it, but it's grayed out.\"\n\nWhere do I suggest changes to the system again?  Uservoice?"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Nov 25, 2008", "message": "There's an option hidden away on your user page to completely hide ignored tags.  However, if you have both an ignored tag and an interesting tag on the user page it will still (correctly) be visible."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://ManBitesBlog.quiblit.com", "date": "Nov 25, 2008", "message": "I'm a little concerned that a question like this would open the door to some privacy violations."}, {"author_name": "MusiGenesis", "gravatar_hash": "fc4497e046f55473ab50b141d8b5ca42", "author_url": null, "date": "Nov 25, 2008", "message": "@Rik: that was an under-appreciated gem right there."}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Nov 25, 2008", "message": "i don't mind a bit of humor now and then, if it's actually funny, but this is going to cause a deluge of copy cat questions for sure!"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Nov 25, 2008", "message": "@Darren: I don't think it *will* spawn copycat questions, to be honest - because the question isn't really about me at all. At least, most of the answers aren't really related to me - they're just generic geek humour.\n\nA similar question would basically get similar answers with different wording. Maybe there'd be a bias towards different languages etc, but I suspect there wouldn't be much that was genuinely new.\n\nThat's what saddens me a little bit about this whole thing - I feel oddly privileged to be the one person who's likely to get this treatment, but for no really good reason. Hopefully it's clear to all/most people that I'm not really a superstar developer by any stretch of the imagination - just someone who likes answering questions and can occasionally turn a phrase. I'm no Jeff Dean.\n\nI've had a lot of fun with it all, but I do hope it doesn't make people feel jealous or give anyone the wrong idea about me."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Nov 25, 2008", "message": "@Joel: Thanks for pointing out that option.  I've turned it on now."}, {"author_name": "Russ", "gravatar_hash": "ab6b3583495802f93d94a69100023137", "author_url": null, "date": "Nov 25, 2008", "message": "How does the idea of a future podcast involving guests with high rep, such as Jon, sound?"}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Nov 25, 2008", "message": "\"Stack Overflow is you.\"\nNot to be confused with Soylent Overflow, which has a similar catchphrase:\n\n\"Soylent Overview is people.\"\n\nBut that question is an interesting look at the \"What belongs on SO\" and \"What is programming related\", because giving the power to close a question to the people also means that the people have to figure out how to use them, and in that case: Figure out what should be on SO or not.\n\nSo far, i have to say that I am surprised how well this works, I originally expected SO to be a Flame/Editwar Trollfest, but it worked out to be an overwhelming open and productive community. Maybe because while it is anonymous, most people actually prefer not to be.\n\nIf I look at the first page of the users, I see that most have their real name, or a link to their blog. That means that often, we are able to associate faces or at least deeds with them. And when anonymity is (mostly) taken out of the community, all of a sudden, there is space for something else. Like mutual respect.\n\nWhen I look at many \"communities\" I (sometimes have to) participate in, I often see communities ridden with the type of people that Penny Arcade perfectly described in http://www.penny-arcade.com/comic/2004/03/19/ ,but when I look at Stack Overflow I mostly see people who are trying to have a good time, respecting each other (yes, even Visual Basic users are respected!) and discuss programming related matters.\n\nTLDR Version: &lt;3 Stack Overflow and it's userbase"}, {"author_name": "Russ", "gravatar_hash": "ab6b3583495802f93d94a69100023137", "author_url": null, "date": "Nov 25, 2008", "message": "\"All your site are belong to us\""}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Nov 25, 2008", "message": "Took the liberty to write down some thoughts: http://www.stum.de/2008/11/25/stack-overflow-the-close-wars/"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 25, 2008", "message": "Yes, in retrospect, \"move to close this question\" probably should be a vote rather than an arbitrary boolean switch."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 25, 2008", "message": "> I won’t see it any more thanks to the introduction of ignored tags, to which I promptly added jon-skeet\n\nOh, the humanity! :)"}, {"author_name": "Gishu", "gravatar_hash": "69772f0246d5013d72703967b8761e89", "author_url": "http://madcoderspeak.blogspot.com", "date": "Nov 25, 2008", "message": "reminds me of an ancient jungle saying...\n\"If you can see Chuck Norris, he can see you. If you can't see Chuck Norris you may be only seconds away from death.\" :D"}, {"author_name": "Gishu", "gravatar_hash": "69772f0246d5013d72703967b8761e89", "author_url": "http://madcoderspeak.blogspot.com", "date": "Nov 25, 2008", "message": "Sorry couldn't help myself \nDid you feel 'the coldness of the grave' when you clicked Add to Ignored tags? http://dilbert.com/strips/comic/2008-11-25/"}, {"author_name": "Grom", "gravatar_hash": "a14537020ec5b11fea3b956353724860", "author_url": "http://grom.zeminvaders.net", "date": "Nov 25, 2008", "message": "I have nothing against this question. But as long as some of these questions are allowed and others not you gonna see close/open wars (see the comments to http://stackoverflow.com/questions/120324/who-are-some-well-known-female-programmers as an example)."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Nov 26, 2008", "message": "&gt; Yes, in retrospect, “move to close this question” probably should be a vote rather than an arbitrary boolean switch.\n\n\nWell, the future is always in motion, you can still change the mechanism, even though there are a few open questions (i.e. how many votes to close? Can people vote for leaving it open, thus negating the close-votes?)"}, {"author_name": "Mark Harrison", "gravatar_hash": "f79b395a801bf291b74e8bccea8e03f8", "author_url": null, "date": "Nov 26, 2008", "message": "\"One of the major reasons we created Stack Overflow to give every programmer a chance to be recognized by their peers.\"\n\nThat's what I liked about Stack Overflow, until I saw my posts turn into Community Wiki posts. :-(\n\nThey're good answers, and I was pretty unhappy that my chance for recognition vanished!"}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": "http://stackoverflow.com/questions/324554", "date": "Nov 27, 2008", "message": "Well I think it has to do with the human nature. We want to be happy. \n\nA considerably big number  of SO questions are not programming questions at all. These kind of questions are closed immediately most of the times, but a percent of those questions remain open and became very popular. \n\nThose that remain open are jokes, or questions that allow the audience feel praised.\n\nThe sad side of this is questions that ARE programming related are closed too, if the users feel menaced some how. I really don't understand the reason, but it happened to me today.\n\nI open a question to know how a very simple app could be developed in other Programming languages ( C++, C#, Python, Ruby ) and suddenly it was downvoted furiously ( about -22 votes ) \n\nIs strange the way the crows behaves sometimes.\n\nHere's the question \nhttp://stackoverflow.com/questions/324554"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 01, 2008", "message": "> They’re good answers, and I was pretty unhappy that my chance for recognition vanished!\n\nYou'll continue to accrue rep until a post hits the wiki community threshold of 30 answers, of course.\n\nThis was mostly necessary because a disproportionate amount of rep was generated by generic discussion / humor type questions, and all of those questions had one thing in common: WAY more than 30 answers."}, {"author_name": "Adam", "gravatar_hash": "207958aa5ac1c42448070dbab3f2dd87", "author_url": "http://stackoverflow.com/users/284685/adam", "date": "Nov 08, 2010", "message": "Great post. Kind of Like PBS's \"Viewers Like You\" (http://en.wikipedia.org/wiki/Viewers_like_you#.22Viewers_Like_You.22) StackOverflow is brought to us by Programmers Like You"}]}