{"response": [{"author_name": "Vijay Santhanam", "gravatar_hash": "640b48a0bf5e3cc984bcef7b8db9a0dd", "author_url": "http://vijay.screamingpens.com", "date": "Dec 01, 2008", "message": "\"We view accepting an answer as a simple social convention\"\n\nWhat about accepting answers because it's the right answer?\n\nIf I accept my own answer (because i did more work to find it than other people), then it won't appear on the unanswered list, and provide a convenient indicator to searchers than an answer was found.\n\nIf I answer my own question, I don't deserve any reputation. But - for the community at large - I feel a duty to submit the complete correct answer for others benefit."}, {"author_name": "Thomas Owens", "gravatar_hash": "8579087f6aad114044755cd7d64a36c9", "author_url": null, "date": "Dec 01, 2008", "message": "I agree with Vijay. I accept an answer that works for me. Other people might have had the same problem and used a different solution. So if, after asking the question, I find a solution and post it on SO (even if it's worse than one already posted or one that will be posted in the future), I should accept that because I'm telling the community \"this is what I did to solve this problem that I had\".\n\nHowever, that said, if I accept my own answer, I should not get either the +2 or the +15 rep because it is my answer."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 01, 2008", "message": "> then it won’t appear on the unanswered list\n\nA single upvote on an answer is all it takes to move a question off the unanswered list.\n\n> I should accept that because I’m telling the community “this is what I did to solve this problem that I had”.\n\nThe text of your answer should be convincing enough, no?"}, {"author_name": "Brian Boatright", "gravatar_hash": "3e1f0ea43c0a4cb33eb65ec349901feb", "author_url": "http://www.developerbuzz.com", "date": "Dec 01, 2008", "message": "&gt; The text of your answer should be convincing enough, no?\n\nNo. If that's the case why have an icon that tells people \"HEY! THIS IS THE ANSWER\".\n\nI thought the purpose of StackOverflow was to help developers find answers to questions. What does it matter if you found the answer on your own? I think in this case the stated purpose of SO trumps any perceived pat on the back issues. The only way it's a pat on the back is if you give the question owner rep for answering, which could be disabled. Otherwise it's just person continuing to work on the problem until it is resolved. Like any good little developer solider should be doing anyway."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": "http://softhardsoft.com", "date": "Dec 01, 2008", "message": "&gt;&gt; You, sir (or madam), are biased.\nI'm biased when I accept and answer too. I'm not sure what this has to do with anything."}, {"author_name": "Guy", "gravatar_hash": "aa81a6370a42b90429370bcf2dfad2e8", "author_url": null, "date": "Dec 01, 2008", "message": "I agree with Brian.  Sometimes you will continue to research your problem and be the only person will realistically come up with the \"right answer\".\n\nI'm not expecting the rep, but not being able to choose your own answer does leave the question hanging.\n\nIf the answers is so blatently biased to the questioner, then the moderators can correct this action."}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Dec 01, 2008", "message": "This is a tough one. Only because most of the time this process will work and the best answer will be chosen or the users will vote for the best one. But this only works when there is a decent amount of attention for the question. \n\nExample: I was looking for a way to animate background colors using jQuery. I found a question someone had already asked and accepted an answer too. Well it turned out to be wrong causing me to burn a lot of time. So I went back to the question to complain about it when I noticed at the very bottom the correct answer had been given. But because the popularity of the question had gone down or just off the first page no one saw it. So the correct answer never floated to the top. \n\nI know this is an edge case, but its still a crack in the system."}, {"author_name": "Robert Hudson", "gravatar_hash": "69d8bdf34490d6f6dedccbc50e54eff7", "author_url": "http://www.iteachwriting.com", "date": "Dec 01, 2008", "message": "Jeff Sez:\n\"But I’d also encourage you to go out of your way to find the greatness in another programmer’s answer to your question — even if you think you’ve already found the right one.\"\n\nMost of the time I've found the \"right one\" after reading someone else's answers anyway. My \"right one\" is better - a refined or modified version of another programmer's answer. For example, I am trying to sort a list of items in a widget. Another programmer suggests iterating through the widget. I discover that the widget has an internal \"sorted\" property that is much more efficient.\n\nI post my answer \"set the sorted property.\" Clearly the best answer. Clearly the optimal answer. Clearly better than the other programmer's answer.\n\nAt this point, it's much more efficient for me to mark MY answer as the best rather than to wait for a mob of programmers to find the time to descend on my question among the multitudes of others and vote my answer properly.\n\nBecause most of the time, by the time I've figured out the answer, the other answers have already been voted up, and nobody is going to return."}, {"author_name": "Robert Hudson", "gravatar_hash": "69d8bdf34490d6f6dedccbc50e54eff7", "author_url": "http://www.iteachwriting.com", "date": "Dec 01, 2008", "message": "\"The Collective Warrant\"\n\nJeff Sez:\n\"Allowing question owners to accept their own answers would be a violation of the spirit of Stack Overflow, akin to giving yourself a self-congratulatory pat on your own back. \"\n\nI thought the spirit of Stack Overflow was to let people help people find the answer to a problem, and to provide a system of collective credibility that helped that answer-seeking process along.\n\nI have yet to see these \"pat back mongers.\" Everyone I see posting is okay with NOT receiving credit for self-posted answers, understanding that even though they may have solved the problem and *deserve* the credit, they accept the checkmark to further the community's knowledge rather than to demand credit in a process that could encourage gaming and cheating.\n\nSo - we're okay that you don't give us credit. We accept that to give us credit encourages a system where some might cheat. We just want the best answer to be juxtaposed with the community-voted best. Which, as I've mentioned in a previous post, might be wrong, less-accurate, or stale."}, {"author_name": "Robert Hudson", "gravatar_hash": "69d8bdf34490d6f6dedccbc50e54eff7", "author_url": "http://www.iteachwriting.com", "date": "Dec 01, 2008", "message": "\"I love my peers. Sometimes, they're wrong. But they help me think.\"\n\nJeff Sez:\n\"We’re here to acknowledge the skill of the collective community, and our own humility in not knowing the answer to everything. It’d be downright rude to deny your peers the opportunity to weigh in on your question, for good or bad.\"\n\nI'm not sure where you're getting the idea that anyone wants to \"deny\" our peers the \"opportunity to weigh in.\" What we want is the ability to signify what we find to be the best answer, which may not be that determined by the community.\n\nWhen I ask a question on Stack Overflow, I want, in order of importance (low to high):\n\n* multiple opinions on the best solution,\n* answers that meet my context and situation,\n* a \"best answer\" that I can implement.\n\nBy instituting a rigid structure that forces community primacy over getting the \"best answer,\" you create a system that:\n\n* loses valuable information provided by conscientious question-askers who see no point in seeing their \"final answer\" muted and devalued,\n\n* fails to acknowledge that community influence exists outside the \"votable\" range of experience. For example:\n\n- By posting a question on a community site, I force myself to clearly examine and state my problem for members of the community. This adds clarity to my situation and may help me solve it.\n- By reading the answers posted by the community, I may be inspired or encouraged to look at things differently, or to refine my approach, or to decide that the foundation of my question may require tweaking. Thus the \"best answer\" may not be any of those posted by community members. And that's okay.\n\nNeither of these examples show a benefit from community voting, because the community contributed to the refinement of a problem, or to the solution to the emergent \"real problem,\" but DID NOT SOLVE THE PROBLEM."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 01, 2008", "message": "How would you guys feel about a -10 rep cost to accepting your own answer? Just floating this."}, {"author_name": "Brian Boatright", "gravatar_hash": "3e1f0ea43c0a4cb33eb65ec349901feb", "author_url": "http://www.developerbuzz.com", "date": "Dec 01, 2008", "message": "&gt; How would you guys feel about a -10 rep cost to accepting your own answer? Just floating this.\n\nI think that it is ridiculous. \n\nEverything you say regarding this particular issue is contrary to the supposed \"spirit\" of StackOverflow.\n\nWhy are you being so stubborn on this? Clearly the community doesn't agree with you but you persist. And now your best compromise is to offer to punish people who bother trying to make your site more valuable. And having a question ticked with an \"answer\" is more valuable than simply having one or more with up votes."}, {"author_name": "Robert Hudson", "gravatar_hash": "69d8bdf34490d6f6dedccbc50e54eff7", "author_url": "http://www.iteachwriting.com", "date": "Dec 01, 2008", "message": "That seems like a punishment. UNLESS your purpose is to have the community answer questions and not necessarily to have the \"best answer.\"\n\nIn which case, it's better just to keep the system intact. Don't let people accept their own answers. Don't punish them for trying to help.\n\nMy confession: I'm a buttheaded efficiency wonk who sees any site like this as a better, more refined, more reputable way to get the best solution. Best, to me, means best from any source.\n\nFraternal programming smooches to Atwood."}, {"author_name": "Ken", "gravatar_hash": "38c3c4eda8719d48b4b568c474830a87", "author_url": null, "date": "Dec 01, 2008", "message": "Since the \"Why Can’t I Accept My Own Answer?\" has come up a lot, it seems like a natural thing for people to be able to do on Stack Overflow -- although I would guess people answering their own questions is a small percentage of all the answered questions.\n\nI would suggest letting people select their own answer as the accepted one but don't change their reputation (up or down)."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 01, 2008", "message": "> And having a question ticked with an “answer” is more valuable than simply having one or more with up votes.\n\nYou understand that self-selecting your own content is contrary to how PageRank -- and thus basically the entire Internet -- works? Are you really, honestly disagreeing with PageRank and Google here?\n\nI also dispute the ultimate value of \"ticked with answer\"; consider this question. I could have marked my own answer as the accepted one. Do you agree with that?\n\nhttp://stackoverflow.com/questions/9/how-do-i-calculate-someones-age-in-c"}, {"author_name": "Joe", "gravatar_hash": "3d1504872c5439632396d6df42b6e007", "author_url": "http://nofouls.com", "date": "Dec 01, 2008", "message": "Jeff, you are being stubborn."}, {"author_name": "Joe", "gravatar_hash": "3d1504872c5439632396d6df42b6e007", "author_url": "http://nofouls.com", "date": "Dec 01, 2008", "message": "The nofollow attribute on a link in PageRank could be compared to the no rep for selecting your own answer.  It follows the same model."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 01, 2008", "message": "> By instituting a rigid structure that forces community primacy over getting the “best answer,” you create a system that:\n\nThe very concept of \"best answer\" is so flawed I'm not sure where to begin. Best? By whose metric? \n\n- In the case of \"accept someone else's answer\", two people agree\n- In the case of \"community accepted answer\", many people agree (every up voter)\n- In the case of \"accept own answer\", *one* person agrees\n\nI think there's general disagreement around contorting what was always intended as a simple social convention into an absolute and unwavering statement of fact."}, {"author_name": "Sean Patterson", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Dec 01, 2008", "message": "I think the -10 rep is pretty harsh as well. Why not just a 0 rep. Is it more important to have the rep or have the question answered?\n\nI've had a couple questions (see http://stackoverflow.com/questions/109/decoding-t-sql-cast-in-cvbnet as an example) where I've gotten some feedback that didn't work, and eventually solved the problem. However. If you look at the question up front, it looks like a \"move along, nothing to see here question\"\n\nSince there does seem to be a level of redundancy in the questions asked out there, even having that green flag there will help in finding the answer to an issue at hand."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 01, 2008", "message": "> However. If you look at the question up front, it looks like a “move along, nothing to see here question”\n\nInteresting -- I always read all the owner responses because they're highlighted, and they tell the rest of the story (if I'm interested in the underlying question). Usually there aren't more than 1 or 2, and it's easy to see if one of them has the \"Eureka!\" in it.\n\nThis works on the same principle as the comments on Coding Horror; people often tell me that \"I only read the orange highlighted comments\".\n\nMy comments here are highlighted under the very same principle."}, {"author_name": "chakrit", "gravatar_hash": "104c34a4803355ade79413372205138a", "author_url": null, "date": "Dec 01, 2008", "message": "A -10 is *NOT* harsh at all considering your answer will go up and stick to the top.\n\nA single up-vote from ONE passer-by will remedies the -10 if your answer is actually worth it.\n\nAnd why would you not think people will vote if you accept your own answer?\n\n-10 is normal I'd say, because if you *did* accept your own answer by the \"spirit\" you so call then it should be vote-worthy enough that the -10 wouldn't mean anything.\n\nI think it is a nice gesture of good will."}, {"author_name": "tpower", "gravatar_hash": "8401ce7758b1b2040536bcb8e9575d58", "author_url": "http://blog.trevorpower.com", "date": "Dec 01, 2008", "message": "I actually asked a question like this and one of the answers was to mark the question/answer as community editable and then accept the answer. This didn't work but I thought it was a good idea.\n\nOnce the question is a wiki I would not get the rep for up votes."}, {"author_name": "Mike Stone", "gravatar_hash": "c8ba7ccacc70a7b826184e8d717bfcd7", "author_url": "http://smellsblue.blogspot.com/", "date": "Dec 01, 2008", "message": "I haven't been using the site in quite a while, but I still enjoy reading up on the blogs, and on this one I think I have a suggestion that may address both sides of the issue (the need for an accepted answer when the asker has the best answer, and the need to avoid gaming).\n\nI strongly agree that an asker should be able to answer and accept their own question.  So, what if the asker first got absolutely no rep for the acceptance (neither the +2, nor the +15 of course), and on top of that, the sort order is unaffected by being the \"accepted answer\".\n\nThis way, if there is a community answer that is better, the asker doesn't get inflated upvotes by being on top (because the better answer will be on top by having more upvotes).  It may be a bit confusing at first, but I think it may successfully avoid gaming, while also allowing the asker to close the loop on the question (which I think is far more important than the so-called spirit of Stack Overflow).\n\nTo avoid confusion, it might make sense to have a small link above the highest voted answer directing the user to the self-accepted answer, with a comment of why it isn't on top (only when the self-accepted answer isn't the highest voted, of course)."}, {"author_name": "Pat", "gravatar_hash": "304b987f18525a0a2ed2366d3a79b1f6", "author_url": null, "date": "Dec 01, 2008", "message": "I too feel that users should have a choice in accepting their own answers and I think a negative 10 rep to accept one's own answers is a great compromise ! \n\nFor some reason seeing green in the question \"icon\" gives me a sense of closure and paying 10 points reputation for it is definitely worth it :-)"}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Dec 01, 2008", "message": "How about having the owner of the question post there answer, they get 0 rep, it appears 2nd under the highest voted question and its clearly labeled \"owners answer\", maybe even a different color. If it gets more votes than the highest voted answer than the check appears and the owner can say thats the answer. If you want, that is when the owner can get some rep points.\n\nThis still follows the crowd knows better rule, but keeps the answer high so that it doesn't get lost at the bottom."}, {"author_name": "[ICR]", "gravatar_hash": "48a02e16370caadaedff78e2a94656ce", "author_url": "http://www.morethannothing.co.uk", "date": "Dec 01, 2008", "message": "Now onto the next question: Why can't I downvote my own responses?"}, {"author_name": "John", "gravatar_hash": "b492f9ec896a9a961bc0474fa6df3de5", "author_url": null, "date": "Dec 01, 2008", "message": "As I suggested on UserVoice a while ago, there should  at least be some way for someone ELSE to select my answer to my own question as \"the\" answer.  Voting is not enough.  That little bit of \"officially accepted answer\" metadata and its associated visual representation is important enough that I don't think any answer should be stranded in \"votes only\" land simply because it was written by the same person who asked the question.\n\nAs for your (Jeff's) arguments, consider that the question asker already has the power to select any answer as \"the\" answer, regardless of whether it's right or not.  Votes and answer acceptance have always been two very different things.\n\nThis extra restriction when it comes to accepting one's own answer is all about reputation, not answer quality.  Obviously, you should get zero credit for accepting your own answer.  If you want to make it -10 for some reason, fine.  But I don't see why that's necessary.  If there's no reputation benefit to accepting my own answer, why would I be motivated to do so?\n\nOn the flip side, allowing me (or someone else, or me plus someone else) to accept my own answers to my own questions encourages the wiki-like population of newly discovered information.  Say I trip over some idiosyncrasy of Product X and figure out the solution.  I'd like to go to SO and immediately enter both the Q and the A for all to see, and I want to immediately accept the A so it shows up as \"the\" answer.  That kind of activity is discouraged if I know that my Q will forever be stuck in \"A-less\" limbo--especially grating when I know my A is the correct one because I just freaking did it and it worked.\n\nNow you probably think it's dumb that people would be discouraged from doing this kind of \"just learned\" information storage on SO by the mere absence of that big checkmark.  But let me tell you, it is a discouragement.  A dumb one maybe, but it's real.  I wanna put in the Q, put in my A, and click that damned checkmark.  It's the completion of the process, the closing of the circle.  Programmers in particular are susceptible to this kind of OCD desire, many literally feeling anxious if they can never \"close\" their question with an accepted answer.  It's like a bug that you can never mark as closed."}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Dec 01, 2008", "message": "For technical questions and answers (the type that SO is designed for), the \"community\" is not as reliable as the question asker. Of the tens of thousands of votes that have been cast on answers, how many of them are upvoted because they were tested and worked vs they just *look* like the right answer. The only person who's actually going to take the time to VALIDATE anything is the person who asks the question and -- maybe -- the person who answers it.\n\nThe wisdom of the community is nice, but crowd-think is not a guarantee of accuracy. The person who asked the question is by far best positioned to know what the right answer is, even if they came up with the answer themselves.\n\nAnd if this is a community how come the community's overwhelming opinion on this issue is being ignored?"}, {"author_name": "Rik", "gravatar_hash": "6ad776df21fe5cee8d4e4c09838cedf9", "author_url": null, "date": "Dec 01, 2008", "message": "I would say, either allow any user to mark their own answer, but don't give any extra rep for it, OR, allow only user with a certain amount of rep to mark thier own answers.\n\nMy preference goes to the first one."}, {"author_name": "David HAust", "gravatar_hash": "dab8cbf9615baf353220db4aea3b9a9f", "author_url": null, "date": "Dec 01, 2008", "message": "+1 for NOT being able to accept your own answer.\n\nThe wisdom of the community is usually greater than that of the individual (uh, hence all this voting).\nSo if your answer is the best, as judged by you AND the community, it will be the *top answer*, assuming you didn't accept another answer.\n\nBut if being the top answer is still not enough of an ego boost for you, then perhaps Jeff could implement some kind of indicator (colour/icon/etc) that the top answer belongs to the question owner"}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 01, 2008", "message": "John, your suggestion sounds a lot like a suggestion I floated on Uservoice a while ago about having community selected answers:\n\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/21704"}, {"author_name": "Rob", "gravatar_hash": "69d8bdf34490d6f6dedccbc50e54eff7", "author_url": null, "date": "Dec 01, 2008", "message": "Jeff. \"best\" meaning the solution that comes closest to meeting the criteria established in the question. Steering the conversation into relativism doesn't make better answers less valid. Bubble sort may not be the most optimal solution to a problem suited to a shell sort. Clearly some questions have simple metrics and better answers. And the metric is often implied or stated in the question or a follow up. We aren't all solving fuzzy genius logic philosophy problems with open parameters."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 02, 2008", "message": "> If there’s no reputation benefit to accepting my own answer, why would I be motivated to do so?\n\nAh, but there is direct reputation benefit -- accepted answers are much more likely to be voted up, because they have a special visual style, and are \"docked\" directly under the answer.\n\nMike Stone's idea is probably the most supportable. I still think there should be a slight negative cost to this, just like downvoting, to discourage it unless you REALLY must choose your own answer as the accepted answer.\n\n> And if this is a community how come the community’s overwhelming opinion on this issue is being ignored?\n\nI think a few people have strong opinions about this, and that's fine.\n\nIn the broad sense, demanding that you should be able to accept your own answer is like going to Google and demanding that we should be able to increase our own PageRank by linking to ourselves, and not requiring all those other people to link to us to increase it instead. It's not exactly a balanced position.\n\nSure, if you find a solution, post it. But that's a pretty rare case, and (to me at least) it's quite obvious through the highlighted comments of the owner if that is what happened -- and the solution will get upvoted like any other."}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Dec 02, 2008", "message": "OK, not to beat this to death, but...\n\nWhat I've done in the past is sent private emails to a person who's answer was close (assuming they have a link on their user page with an email address), and asked them to answer my question with MY answer so that I could accept it. This system actually works pretty well, but it's inefficient. The person who helps me out gets rep points for it, and I get to accept what I determine to be the RIGHT answer. The only (very, very minor) issue is that somebody gets gifted with reputation for something they didn't think of themselves.\n\nWhich also reinforces the point that it's totally not about reputation. It's about making it easy for the next guy to see what the questioner thought was the right answer. For example:\n\nhttp://stackoverflow.com/questions/11574/how-can-i-improve-performance-when-adding-indesign-xmlelements-via-applescript\n\nThe only upvoted answer (not upvoted by me) was not helpful. I finally figured out the right answer myself, rephrased the question to make it more pointed (my original question was \"How can I make my script faster?\"), and posted my correct answer. And it sat there UNDERNEATH the Mr. Clown's answer even though it was correct. So I posted a request on uservoice asking for somebody to repost my correct answer so I could accept it. (Thanks PJ8.) I needed to do this because by that point the question was dead--nobody was reading it among 40,000 other questions.\n\nNow if anybody Googles for \"slow applescript xml\", they will see my question and a good, detailed answer. I've made the Internet (a little) better. Thanks to everybody who tried to help, but to be honest my question didn't have enough detail to allow people to answer it properly. (I couldn't add the detail until I understood what I was doing wrong in the first place!) But at the end of the day the SO repository wins.\n\nThe goal of SO (I think) is to build a repository of information that helps people now and in the future. Anything that supports that goal is Good. Not doing something good because of fears of reputation-gaming might just be an indictment of the reputation implementation rather than of the original idea. \n\nWhy not allow the questioner to accept his own answer, and automatically make that answer AND the question community-wiki? I wouldn't worry about people trying to earn reputation because--to the man--every single person has said \"allow me to do it in such a way that I gain no reputation.\" I would even accept a penalty (5 points?) if that means I can improve the repository.\n\n(Which brings up a related point that improving the repository is nearly thankless as far as rep is concerned. It would make an interesting blog post, I think.)"}, {"author_name": "Matthew Rathbone", "gravatar_hash": "d7d1ac2de76fe378ce8d6553d63ad063", "author_url": "http://matthewrathbone.com", "date": "Dec 02, 2008", "message": "Jeff,\n\nI understand that this may be a (strong) minority requesting this feature, but my question is:\n\nHow would it hurt stack overflow if you enabled the ability to answer your own question?\n\nIs this such a polarized issue? There's not an overwhelming reason to not enable it, so why not just enable it?\n\nIt's not going to hurt the repository, the pagerank, the community, and it's another stat to amuse us.\n\n(I don't think your analogy to linking to yourself for pagerank is justified, you can link to yourself and you don't get pagerank for it, you can answer your own question and not get rep...)\n\nOr why not compromise and add another 'status' showing the author has answered his own question?"}, {"author_name": "John", "gravatar_hash": "b492f9ec896a9a961bc0474fa6df3de5", "author_url": null, "date": "Dec 02, 2008", "message": "\"Ah, but there is direct reputation benefit — accepted answers are much more likely to be voted up, because they have a special visual style, and are “docked” directly under the answer.\"\n\nIt's not as if people can't see who both the Q and A are from.  If you trust the community above the individual so much, why do you not also trust them to use their votes in a constructive way in this particular case?\n\nIf someone is self-answering and self-accepting his own answers in such a way that the community keeps voting his answers up, that's an indication that the community finds his questions and answers useful.  Very few people are going around SO blindly voting up accepted answers.  People vote up answers if they found them useful.\n\nMoreover, of all the reputation gaining schemes available, self-answering and accepting would be perhaps the least efficient and effective.  Anyone who cares enough to game the system would be much better served by your garden variety sock puppetry and collusion.\n\nWith a zero-rep-gain rule on this action, the only way to actually gain any significant reputation from votes on self-accepted self-answers is to convinces the community to consistently vote you up.  And guess what you have to do to get that to happen: provide quality content!\n\n(As for your -10 rep idea, if the blind voting attractiveness of accepted answers is so great (again, I don't think it is), it will swamp a mere -10 penalty.)\n\nBut this all misses the point. Bottom line: do you care more about closing every possible theoretical(!) loophole for ill-gotten reputation, or about the the satisfaction and happiness of the legitimate users of the site, and the quality and volume of the content?  I think you're missing the forest for the trees here.\n\nInstitute zero-rep-gain self-answer-acceptance for one month and track how many instances of it appear to have resulted in \"illegitimate\" rep gain that *outweighs* the benefit of the content provided.  When it's over, post links to all occurrences (or provide a search for self-accepted self-answered questions) so we can all see how it went."}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Dec 02, 2008", "message": "@John\n\nGood point.\n\nReputation points are an indication of how much SO \"trusts\" you to make changes to the content. The more reputation you have the more content changes you can make. The system learns to trust you when other SO users vote for the content you contribute.\n\nIf reputation is an indication of how much you *know*, then asking a question shouldn't result in any rep gain. That only makes sense if it measures the quality of the content you've contributed to the site.\n\nIf reputation measures the quality of the content you've contributed, then there should be no difference/penalty for answering your own questions as long as the community considers your answers to be \"good\".\n\nAs far as accepted answers being more likely to get votes, that's just a bug in the system. Answers near the top *will* get more votes. The best way to get votes is to (correctly) answer a question early (while it's still \"hot\"). An answer that's accepted after the question cools down isn't going to get many votes, despite being at the top of the list. The Fastest Gun in the West problem is baked into the core of SO.\n\n(Hell, a lot of times the person who accepts the answer doesn't/can't even vote for it!)\n\nAnd anyway, it makes sense that the accepted answer will attract votes: in theory, it's the best answer to the question.\n\nAnd why is there so much angst about gaming the rep system, anyway? Reputation is just a measure of how much you've contributed and a proxy for how much you can be trusted not to break things. Mere technical knowledge is NOT the sole criteria I would use when deciding if someone can be trusted. Contributing content, participating in the community, policing, editing, or helping newbies would ideally all be factors. Reputation should probably be tied to badges instead of/in addition to votes."}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": null, "date": "Dec 02, 2008", "message": "\"In the broad sense, demanding that you should be able to accept your own answer is like going to Google and demanding that we should be able to increase our own PageRank by linking to ourselves, and not requiring all those other people to link to us to increase it instead. It’s not exactly a balanced position.\"\n\nGoogle does not make it impossible to link to yourself, and it does not increase your page rank by linking to yourself.\n\nYou make it impossible to 'link to yourself' in the form of accepting an answer, and you control the 'page rank' or rep gain from this, so you can't apply the increasing page rank demand to us.\n\nYou are also sending us mixed messages about who Jeff Atwood trusts.  On one side you promote the community as the best group to listen to: \"- In the case of “community accepted answer”, many people agree (every up voter)\", but then you turn around and say you can't trust them either: \"accepted answers are much more likely to be voted up, because they have a special visual style, and are “docked” directly under the answer.\"\n\nOn the left hand you say let the community decide and on the right you say the community will blindly vote.\n\nYou know what I would do if I saw a self-answered &amp; accepted question that was wrong?  Downvote the answer, comment on it, and post the right answer.\n\nIf it was apparent to me that this person was trying to exploit accepting his own answer I'd downvote the question AND answer.  What would a negative accepted answer tell the community?  This is bad. ignore it.\n\nJeff, you've created two separate features.  Voting &amp; accepting.  They have distinct meanings in your mind, which I think differs from how the community sees it.  \n\nUnlike Google, the ultimate authority on whether a question is answered is the *asker*.  They may not be able to explain everything when they ask, but they sure as heck know when they have solved the issue they ask about.\n\nIf they post a question, get many answers, and post a different answer that works and accept their own answer, the page will look like this:\n\n*QUESTION*\n*ANSWER THAT WORKS*\n*ANSWER THAT WORKS AND MIGHT BE BETTER*(Voted up)\n\nIs this bad?  There could even be learning to be done by people searching and comparing what actually worked for the person, and the different approaches that got the most voted up.\n\nYou've mentioned Google's Page Rank repeatedly, and it works great most of the time. However, its not a one to one mapping with stack overflow.  Make sure you know when the metaphor falls apart.\n\nOne more recommendation.  Step away from hypotheticals and make use-cases.  Come up with 10 or so scenarios that involve a user accepting their own answer( self-answer is the only answer, self answer is poor solution among many answers, self answer is ok solution among answers) and find out if the effects this has on a Q &amp; A are more inline with your vision of SO or against it.\n\nThanks for reading :)\nTilendor"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 03, 2008", "message": "Maybe I've missed a post somewhere that's already suggested this, but it feels like there's an obvious-ish answer, which keeps the wisdom of the community *and* allows the most appropriate answer to be ticked:\n\nAllow someone to accept their own answer *if* it has more votes than any other answer. For example: http://stackoverflow.com/questions/247621\n\nI wrote both the question and the answer at the same time. I'm absolutely sure that the answer is correct - and the community clearly agrees, with 31 upvotes. There's no sensible reason for that not to be the accepted answer. I don't want to get any rep for it being accepted, but it's silly not to be able to accept it.\n\nSo, my proposal:\n\n- Allow users to accept their own answers if they are the highest voted (perhaps with a minimum of 3 votes?)\n\n- Don't give any rep (either the +2 or the +15) for accepting your own answer."}, {"author_name": "dbr", "gravatar_hash": "edf857d71f672d8f411ef6b8376316b8", "author_url": "http://neverfear.org", "date": "Dec 03, 2008", "message": "The answer \"accepted\" should be the one that answers the original question.\n\nIf I happened to have posted that answer, why can I not accept it?\n\nIt seems there is more reason to allow accepting-your-own-answers (with no rep-change) than there are drawbacks to this.. no?"}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Dec 03, 2008", "message": "@(H.R.H.)Jon Skeet  ;-)\n\nThe problem with that (in my experience) is that a self-answer is typically posted several days after the other answers, and so doesn't get any votes. The two times I've been in this situation the questions themselves were ice cold by the time I figured out the answers. (The .NET world might be a little different.)\n\nIn my experience, voting is influenced more by the hotness and popularity of the question than by any intrinsic qualities of the answer itself. (Which is unfortunate, but unavoidable.) A thorough, accurate, and usable answer posted two weeks late is a great help for the community, but the votes won't reflect that."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Dec 03, 2008", "message": "@JPLemme: I take your point, and that would mean that my suggestion wouldn't cover *every* eventuality - but I think it would still cover many. I'm not sure that I'd go with the idea that a self-answer is typically posted \"several days\" after the other answers - several hours to a day is more common in my experience. Basically after verifying that the answer actually works :)\n\nI *would* suggest some intermediate state of \"suggested accepted answer\" which the community could then use - still docked to the top of the question, but not actually ticked. I don't like introducing more complexity than is necessary though."}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Dec 03, 2008", "message": "@Jon Skeet\n\n&gt;I don’t like introducing more complexity than is necessary though.\n\nYou're obviously a computer programmer and not a Software Engineer.\n\n(I 100% agree with you though. A solution built with the site's existing features is better than solving the problem with new functionality. And that attitude is why the other software engineers won't eat lunch with me.)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 03, 2008", "message": "> So I posted a request on uservoice asking for somebody to repost my correct answer so I could accept it. (Thanks PJ8.)\n\nI actually like this dynamic and I think that's the way it should be. I had to nag Joel to add his answer here:\n\nhttp://stackoverflow.com/questions/337704/parameterizing-a-sql-in-clause\n\nso I could accept it.\n\n> do you care more about closing every possible theoretical(!) loophole for ill-gotten reputation, or about the the satisfaction and happiness of the legitimate users of the site, and the quality and volume of the content?\n\nIt's the same way it always is in the rest of the world: a few bad apples spoil it for everyone. Do you lock your car? Do you lock the front door to your house?\n\nAsk yourself this: why can't you undo a vote after more than 8 hours on Stack Overflow. It's not because we want it that way. See if you can figure out what (serious) exploit that enables. We couldn't.. until users figured it out for us, and forced us to change it.\n\nI am leaning towards Mike Stone's solution -- no change in sort order, with +0 +0 gain."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 03, 2008", "message": "also, a time limit -- you can't accept your own answer for 24 hours."}, {"author_name": "Ross", "gravatar_hash": "7b264437c3c5a8621765158cf4ef6b88", "author_url": "http://rgoddard.blogspot.com", "date": "Dec 03, 2008", "message": "Jeff's argument is based on the assumption that the community is always smarter then the individual, so the best answer will naturally float to the top.\n\nThis will only hold true if the community, or a large enough subset of it continues to pay attention to a question.\n\nBut SO is a place to come and ask questions about narrow topics, so the chance that a question will be asked and not attract enough attention to pull in a large enough portion of the community to meet the above assumption is relatively high. Combine that with the fact that for many questions, interest in them will decline sharply over time. This means that there will be a number of questions where the only person who cares enough about having the correct answer is the person who asked it. If that person has had to spend a day or two to finally come up with a solution, then I would argue that in this case the individual is much smarter then the community currently participating in the question.\n\nThat person is better able to judge the answers, and indicate which is the best. At this point the community is not big enough, nor focused enough to select the best answer.\n\nIf you are worried about people gaming the system, then simply don't give them reputation points for accepting their own answer, nor for any additional upvotes that answer subsequently receives."}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Dec 03, 2008", "message": "@Jeff\n\nThanks for being open-minded about this."}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": null, "date": "Dec 03, 2008", "message": "\"I am leaning towards Mike Stone’s solution — no change in sort order, with +0 +0 gain.\"\n\n\"also, a time limit — you can’t accept your own answer for 24 hours.\"\n\nI think this would be fair.\n\nThe thing I dislike about asking others to post a solution and then accept it is the introduction of friction.  Not everyone likes to bug others.  Like me."}, {"author_name": "John", "gravatar_hash": "b492f9ec896a9a961bc0474fa6df3de5", "author_url": null, "date": "Dec 03, 2008", "message": "&gt;&gt; do you care more about closing every possible theoretical(!) loophole for ill-gotten reputation, or about the the satisfaction and happiness of the legitimate users of the site, and the quality and volume of the content?\n\n&gt; It’s the same way it always is in the rest of the world: a few bad apples spoil it for everyone. Do you lock your car? Do you lock the front door to your house?\n\nMy question was one of balance.  The choice is not binary.  Do you wear full body armor when crossing the street or do you just look both ways?  Zero rep benefit is an appropriate balance (looking both ways), IMO.\n\n&gt; Ask yourself this: why can’t you undo a vote after more than 8 hours on Stack Overflow. It’s not because we want it that way. See if you can figure out what (serious) exploit that enables. We couldn’t.. until users figured it out for us, and forced us to change it.\n\nThat's a better method than speculation for determining the effect of policy changes.  You think this proposed feature will be a big problem.  Many others strongly disagree.  Let's stop arguing and just try it: zero-rep-benefit self-accepted self-answers for a month, and we can see what disasters befall us.  Hypothesis, observation, analysis.  It works, bitches!\n\nhttp://store.xkcd.com/#Science"}, {"author_name": "Aaron Seet", "gravatar_hash": "3c4fe77ab5bf8851c0dd7da1b3d3960c", "author_url": "http://icelava.net", "date": "Dec 13, 2008", "message": "Disagree with your perspective, Jeff. Marking my own answer is to _inform_ the community I found a workable solution to my own problem. There is no real self-congratulatory benefit to be had out of this.\n\nIt is no bias. It is raw _fact_ that it solved the problem."}, {"author_name": "Logan Murray", "gravatar_hash": "434e37f74ce9a41c3f18b8d80a1ab88f", "author_url": "http://pihole.org/", "date": "Dec 21, 2008", "message": "This is total bullocks. So the only reason we aren't allowed to mark our own answer as the solution is because you think we'll just say we're always right instead of what others post.\n\nThis very assumption goes against the nature of the COMMUNITY, which is fairness and respect. If I ask a difficult question I am having trouble with, then happen to stumble upon the answer myself, I want to let OTHERS know that I've found the answer, and not rely on them happening to stumble upon it by reading the responses. The fact of the matter is the question will appear unanswered from the outside when in fact it DOES have a solution--just because I happen to be the one who comes up with it doesn't mean that it's a less valid solution to the problem. If someone else comes up with a better solution I'd be happy to pass the trophy to them, but we're talking the sake of others here, not the glory of answering one's own questions.\n\nObviously answering your own question should not affect your reputation at all--it's just a way of helping others who may have the same problem, and frankly I thought that was the whole point of StackOverflow, but perhaps I got the wrong impression about it."}, {"author_name": "Tim", "gravatar_hash": "655be2100f2922f30dff0a73d53917c8", "author_url": "http://blog.stackoverthrow.com/", "date": "Dec 27, 2008", "message": "Not being able to select your own answer is a BIG mistake.  There are a couple questions I wrote that were outstanding for a long time with no good answers from others.  I researched and finally found acceptable/correct answers myself and now the questions will always remain as unanswered.  SO also now puts a silly \"did you consider accepting an answer...?\" - funny that you ask.  I did? but SO won't allow it.\n\nI think it is time you allow self-accepted answers after some period of time AND no points for choosing your own answer obviously.  This is a BIG shortcoming for SO.  Really big."}, {"author_name": "Pat", "gravatar_hash": "304b987f18525a0a2ed2366d3a79b1f6", "author_url": null, "date": "Jan 06, 2009", "message": "@jeff\n\n&gt; Ask yourself this: why can’t you undo a vote after more than 8 hours on Stack Overflow. \n&gt; It’s not because we want it that way. See if you can figure out what (serious) exploit that enables. We couldn’t.. \n&gt; until users figured it out for us, and forced us to change it.\n\nWow! Doesn't that user deserve the hacker badge! For figuring out the (serious) exploit and emailing you about it ?\n\n;-)"}, {"author_name": "Ceb", "gravatar_hash": "259814d4507d09b600fc132e352fbcc2", "author_url": null, "date": "Jan 08, 2009", "message": "Idea for the exploit from undoing votes:\nUpvoting a bunch of some other user's answers until they exceeded the daily rep limit (so couldn't receive further rep that day), then undoing the votes later, and stealing the rep back, so they didn't get any benefit from the rep they would have received from the other, legitimate, upvotes."}, {"author_name": "Dan M.", "gravatar_hash": "ec326c009186734854c600265b69a6ce", "author_url": null, "date": "Jul 20, 2009", "message": "The accepted answer should always be on top, period. Yes, there may be situations where the questioner \"accepts\" his own answer and is actually wrong, but the point shouldn't be to build a full-proof system, it should be to build a *good* system. Bottom line is that, if my code is broken, and I figure out what was wrong and post about it, people should not have to read through everyone else's answer to get to the correct one. So, yes, when it's *my* code, there's a very good chance I do know more than the tiny portion of the community that answered my question unsuccessfully."}, {"author_name": "Miff", "gravatar_hash": "19da349ae3a7835f7bef46906f7f4cb1", "author_url": "http://miff.furopolis.org/", "date": "Sep 18, 2009", "message": "The way I see it, each questing is a problem that needs to be solving, and each answer is a solution.  When you accept an answer, you're basically saying \"this is the solution I am using, it may not be the best one, but it's the one I'm going with\"."}, {"author_name": "Miff", "gravatar_hash": "19da349ae3a7835f7bef46906f7f4cb1", "author_url": "http://miff.furopolis.org/", "date": "Sep 18, 2009", "message": "Oh, I forgot to add this part:  When you accept your own answer, you're basically saying \"I ended up using a solution that was not listed here\"."}]}