{"response": [{"author_name": "Isaac", "gravatar_hash": "2bb572e05887045b95d99d8a5819eb14", "author_url": "http://judaism.stackexchange.com", "date": "Jan 05, 2012", "message": "Have you found that offering an extrinsic motivation to ask questions caused some people to ask more low-quality questions to get more entries?"}, {"author_name": "Powerlord", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Jan 05, 2012", "message": "To add to what Isaac said, if you make the system a game, people are going to game the system."}, {"author_name": "Isaac", "gravatar_hash": "2bb572e05887045b95d99d8a5819eb14", "author_url": "http://judaism.stackexchange.com", "date": "Jan 05, 2012", "message": "Following up on my previous query, my first thought when reading this was that you must be taking voting into account somehow to ensure that you're including only quality questions. I understand the desire to avoid incentive for sock-puppet voting, but wouldn't an increase in low-quality questions be a greater danger? After all, the former requires people to be greedy and dishonest, while the latter only requires them to have some greed and some laziness."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jan 05, 2012", "message": "This is a contest to increase activity on a site, not necessarily the pound-per-pound quality. \n\nStack Overflow doesn't need any contests ever, but many of our smaller communities get a rather low question volume. \n\nIf a site is already getting more questions than they can reasonably moderate they obviously won't start any contests for more questions."}, {"author_name": "Lauren Gundrum", "gravatar_hash": "5114f4806122259270d5da20a3039960", "author_url": null, "date": "Jan 05, 2012", "message": "@Isaac @Powerlord like Ben says, the contest is meant to increase activity on the site. We haven't found that it results in very many poor quality questions, and the number of questions the contest inspires are generally reasonable for the community and moderators to handle. People are still active about down voting contest questions, and we don't count questions with a negative score as entries.\n\nThat being said, if your community actively participates in weekly topic challenges without a prize, the prize may not be needed."}, {"author_name": "Lauren Gundrum", "gravatar_hash": "5114f4806122259270d5da20a3039960", "author_url": null, "date": "Jan 05, 2012", "message": "Also @Isaac - you're right that increasing bad questions is a danger, but it's generally harder to ask a question (even a bad one) than it is to cast senseless votes. Also, the prizes we offer aren't very expensive, so there's not a terribly large incentive to flood the site with bad questions."}, {"author_name": "Laura", "gravatar_hash": "5028fddccddf5610dac7383b00da7619", "author_url": "http://stackexchange.com/users/463263", "date": "Jan 05, 2012", "message": "@Isaac There is probably always some dedicated troll who will try to game the system; that's the nature of online communities. We try to design contests that don't encourage that type of behavior, though. Here, we're keeping prizes at a pretty low monetary value so it's not something super rare and wondrous that people would only ever be able to get by winning this contest; at the same time, we want the prizes to be worthwhile to people putting some serious effort into their site activity. No system is perfect, but we haven't noticed any big influx of lower-than-usual quality questions on any sites where we've run these contests."}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://www.pauldwaite.co.uk/", "date": "Jan 05, 2012", "message": "To counter Issac’s question, do you think that the regular mechanism of down-voting bad questions helped prevent low-quality questions being asked in an attempt to win?"}, {"author_name": "Nathan Greenstein", "gravatar_hash": "d137f0688480f16238308ad0f9b234ff", "author_url": null, "date": "Jan 05, 2012", "message": "This was tried on Ask Different.\n\nUnfortunately, the first session fell during Christmas and New Year's, when our traffic was lower.\nI'd like to see how this works during a busier time.\n\nThe other comment I have:\nThe winner was a one-rep user asking a boring question. The question wasn't *low quality*, but it wasn't very interesting.\n\nI'd like to see some way of keeping the random element, but restricting it to questions with at least a few upvotes.\n\nIMO, that would encourage people to ask good questions, as well as prevent people from getting discouraged when a random user with a 0-score question wins."}, {"author_name": "ripper234", "gravatar_hash": "40656706454dcbdbcec125b85b01f1e4", "author_url": "http://ripper234.com/", "date": "Jan 05, 2012", "message": "The Bitcoin site should definitely reward a small amount of BTC then."}, {"author_name": "Ian", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Jan 06, 2012", "message": "Maybe only questions that get at least one answer with more than one up vote should be included in the draw, as I can ask valueless questions on any topic just as quickly as anyone else."}, {"author_name": "Erik", "gravatar_hash": "55a92efbe90a6ca3ad1c4fd5bbcd9b6a", "author_url": "http://fluke179hq.org", "date": "Jan 22, 2012", "message": "I agree with Ian. There must be factor, which will show that the question has any value, in other case the whole contest is useless"}]}