{"response": [{"author_name": "Shog9", "gravatar_hash": "4f0af2dc52e6ff228e4d69f7e1e8aa5a", "author_url": null, "date": "Jan 31, 2012", "message": "If only Reddit had realized this before it was too late."}, {"author_name": "WTP'--", "gravatar_hash": "422f97c9314c229da1679313db506a1e", "author_url": null, "date": "Jan 31, 2012", "message": "Fortunately I've got &gt;10.000 rep so I can still view the deleted fun posts. :P"}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Jan 31, 2012", "message": "I take issue with the \"opportunity cost.\"  It assumes a domain expert has two choices:\n\n1. Participate in a fun thread on a SO site.\n2. Participate in a technical thread on a SO site.\n\nSo, if we remove option #1, the contributors will have to pursue option #2, and the sites will have more valuable content.\n\nOf course, everybody also has this option:\n\n3. Do something completely unrelated to SO.\n\nAnd I suspect that by treating people like babies, Option #3 becomes more attractive.\n\nIt may still be the right choice -- it may indeed be the case that an audience on the scale that SO has or wants can't handle fun posts.  I have also seen previously thriving online communities get overgrown with weeds. But it is a trade-off.\n\nI'm beginning to think that quality online communities are in some sense ephermal -- that even the most careful stewardship cannot prevent them from deveolving.\n\nI know that, for me, SO is a lot less attractive than it was two years ago.  But I don't know if there's anything anyone could have done about it."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jan 31, 2012", "message": "Bah. Noobs. The solution, of course, is using ASCII art in a way that answers the question! http://stackoverflow.com/questions/3970093/include-after-php-404-header-returning-oops-this-link-appears-to-be-broken/3970126#3970126"}, {"author_name": "Jason", "gravatar_hash": "9904b127bff836c939152dcd300ea9ea", "author_url": null, "date": "Jan 31, 2012", "message": "The problems inherent to Stack Overflow due to volume don't apply to all the rest of the Stack Exchange sites. These rules are not global problems at all times for any site operator. They are problems relevant to communities bursting at the seams with busy-ness.\n\nCan sites that allow these \"fun\" things more leniently grow to the point of them become problematic? Absolutely, and that's when action is taken to aid in evolving the site. You lose some visitors, and you gain others.\n\nOne size does not fit all."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Jan 31, 2012", "message": "@Jason sure, it took us at least a year maybe two to figure this out on SO. And some of our sites.. I don't know, they have no approximation of science behind answers, so they can only be \"fun\" or trivia contests. Don't want to call out any by name, but you can probably tell which sites these are. :)\n\n@JohnMcG Programmers.se has a more open topic area to support some of the \"whiteboardy\" conceptual questions that are closer to discussions, e.g. http://blog.stackoverflow.com/2010/12/introducing-programmers-stackexchange-com/"}, {"author_name": "deadprogrammer", "gravatar_hash": "007904773146ef695bb6e20a4f4cc135", "author_url": "http://www.deadprogrammer.com", "date": "Jan 31, 2012", "message": "I an not buying your whole slippery slope argument. Usenet and other dead forums fell victim to spam, not to offtopics and and lulz.  I feel that glorification of overzealous moderation attracts humorless, pedantic and trigger-happy moderators. The quest for total \"objectivity\" is even more harmful, in my opinion.\n\nI certainly find myself using SO sites less these days, and when I do, I'm frequently frustrated by closed and moved discussions.  On the other hand, it's not a big deal - rules are rules, holes are holes: SO is doing great, it's extremely valuable, it grows like crazy, and everyone is free to create new Q&amp;A sites with blackjack and hookers."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Jan 31, 2012", "message": "> Usenet and other dead forums fell victim to spam, not to offtopics and and lulz\n\nGo look at Reddit, right now, today. At least some of their subreddits are smart enough to intervene with moderation, as you can see in the above quotes. But in general Reddit is a poster child for the fun kudzu problem you get with lack of moderation.\n\n> I feel that glorification of overzealous moderation attracts humorless, pedantic and trigger-happy moderators\n\nI can't even think of any communities that have been ruined by too much moderation. But I can think of hundreds that have been ruined by too <i>little</i> moderation. That said, if you have an issue with the style of moderation on a given SE site, <b>this is what metas are for!</b> Bring it up there and discuss it in the community.\n\n> I certainly find myself using SO sites less these days, and when I do, I’m frequently frustrated by closed and moved discussions.\n\nYet again, see http://blog.stackoverflow.com/2010/12/introducing-programmers-stackexchange-com/ which is designed to accommodate the more conceptual and discussiony, but *practical*, programming questions.\n\nIf anything the SO community itself got strict far before we, as a company did. I'm just riding the wave, and in this case, I think the community is absolutely right to become more strict in what they will accept. Though Jason brings up a good point that you don't have to be *as* strict in the beginning, this is more about evolving some basic community college standards over time, not requiring Harvard or Stanford admission standards overnight."}, {"author_name": "Chris Marisic", "gravatar_hash": "f0e7c2d0d5d83c928cfcfce66928160e", "author_url": "http://www.marisic.net", "date": "Jan 31, 2012", "message": "I would say the moderator community of StackOverflow and other SE sites are way too eager to close posts.\n\nThis is especially prevalent for users who are clearly English as second language users. Instead of moderators helping bridge the language barrier they immediately jump for the nuclear option of \"not a question\".\n\nI've also had posts that are directly on topic be closed for no reason. Posts that I wouldn't even know where to start finding community feedback other than the appropriate stack exchange.\n\nCensorship doesn't improve the internet."}, {"author_name": "Allen Conway", "gravatar_hash": "2311a032d27f8278b61dac7574a00931", "author_url": "http://allen-conway-dotnet.blogspot.com/", "date": "Jan 31, 2012", "message": "Funny I just tweeted in complaint about this topic yesterday. My feeling is that moderators work so hard to be elected, and once in position feel an obligation to do 'something' to live up to their election. This leads to over moderation in order to make the moderators feel like they are doing something important.\n\nI get it - spam, profanity, jokes, pictures, *completely* off topic posts (like asking questions about a car on a programming forum) are all problems that need to be dealt with. But closing **great** conversations specifically on programming because it doesn't follow the 1000 SE Commandments set out in the infamous 'FAQ' is garbage. Oddly enough I came across one of Jon Skeet’s most popular questions, scrolled to the bottom, and it said: \"Closed because it was off topic\". What?!?! I think the moderatos can’t see the forest through the trees sometimes.\n\nFor example, I got kicked off of Meta SE because I asked a question for an enhancement that everyone thought was trash. OK, you don't have to agree with me, but bombard me with downvotes for a *suggestion* which ultimately had me kicked out is totally off base. After groveling in an email, the moderators were kind enough to allow me back.\n\nYesterday I *genuinely* was trying to help some posts I came across with blog articles I had written. Within a few hours I was warned that self-promotion was not tolerated. Seriously? I am trying to help my fellow programmers. Do all moderators have a cynical view of the intent of posters?\n\nBottom line - I like to help others, and on SE I get in trouble for it. Is it because I don't follow the 1000 Commandments (it’s probably 1005 by the end here), or that accepting a little constructive criticism about over moderation is due? My guess is it will be the former because my reputation is only 934 so that means I am a nobody.\n\nYou have a decent thing going here SE. Just be careful that you don't become a cult of moderators choking out the very people you originally intended the suite of sites to be used by."}, {"author_name": "Marijane White", "gravatar_hash": "60e382afb6a0b6885188517993faddc3", "author_url": null, "date": "Jan 31, 2012", "message": "I spent several years co-administrating a UBB-style message board with a few thousand regular posters mostly oriented around answering questions, and what I learned there was that if you create a specific place for fun/fluff/popular content to get posted, it keeps the rest of the forums clean with less active moderation.  It was named the social forum at our board but privately I called it the sewer, and while I didn't like having it or participating in the threads that occurred there, I believed it was absolutely necessary infrastructure."}, {"author_name": "tim", "gravatar_hash": "94a0e83767dbc71db135454693540015", "author_url": null, "date": "Jan 31, 2012", "message": "I'm still mourning the loss of the boat programming tag."}, {"author_name": "deadprogrammer", "gravatar_hash": "007904773146ef695bb6e20a4f4cc135", "author_url": "http://www.deadprogrammer.com", "date": "Jan 31, 2012", "message": "Jeff, if I understand this correctly, Reddit is doing very well right now. I don't normally use it, but a graph on compete.com looks like a hockey stick. I might be wrong about this. \n\nMy point is not that too much moderation is bad. There's no such thing as too much modration. It's the quality of moderation on your network that rubs me the wrong way. There are still plenty of dupes, for example, that need to be merged - and there always will be. But moderation should be - padum pum - used in moderation. Slack is important, some humor also. You can go hardline and still do well though.\n\nI wanted to say - look at what happened with Slashdot and Digg - their moderators steered the sites in the wrong direction, but honestly, I don't know what happened there. I certainly feel that Slashdot became too boring, while Digg was all lulz. There's a middle ground there somewhere.\n\nI also wanted to make two analogies - one to the Soviet authorities banning rock and roll to prevent spread of capitalism, and one with a joke about puritans frowning on sex not because it's evil, but because it might lead to dancing."}, {"author_name": "Eduardo", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": null, "date": "Jan 31, 2012", "message": "I thinks that the trouble with the SO popularity is not the fun or trivia post, the problem is that the general quality has gone totally down. \n\nThe over abundance of dummy question answered by people that never return to make a comment at least have killed the site.\n\nOther problem is that you can't ask a good question anymore, because the visibility to experts or good programmers is tiny and you have to deal with stupid answers and comments, like \"why don't you try c# instead of vb\", \"Linux is free and never have a problem\", etc.\n\nI miss the beta and early days so much ... Can you create a VIP club or something?"}, {"author_name": "Borror0", "gravatar_hash": "7d2cf5a9c2b110205d2bfab54dbc8b3c", "author_url": null, "date": "Jan 31, 2012", "message": "&gt; Jeff, if I understand this correctly, Reddit is doing very well right now. I don’t normally use it, but a graph on compete.com looks like a hockey stick. I might be wrong about this. \n\nIt depends on which metric of \"doing well\" you're using. If by \"doing well\" you mean popularity, then you are correct. If you mean \"provide insightful and informative content\" then you're most absolutely wrong - at least, not as far as the default subreddits are concerned.\n\nCurrently, on Reddit, most popular subreddits have devolved to a pathetic of memes. The ones that haven't have usually banned memes. As Jeff explained above, memes and other forms of humor are easy to process and highly popular, pushing the informative content down the list. If your goal is to generate informative content, as is Stack Exchange's mission, that's a significant problem."}, {"author_name": "deadprogrammer", "gravatar_hash": "007904773146ef695bb6e20a4f4cc135", "author_url": "http://www.deadprogrammer.com", "date": "Jan 31, 2012", "message": "@Borror0 - you are right, it's kinda flooded with memes. My usage of reddit is limited to searching through it for stuff - and I usually find things of interest there. I always found their front page to be a firehose. \n\nI don't have a problem filtering out the irrelevant stuff, but a true failure is when there's not enough data to filter out from. Neither Reddit not SO are close to that, but SO is definitely moving in that direction. Again, I believe some slack is important in moderation."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.gaecupboard.com", "date": "Jan 31, 2012", "message": "I see your point Jeff and, after an initial strong disagreement, I'm with this line.\nThe only big complaint I have is the absence of a proper place for all these fabulous deleted questions that are part of the history of this community and a remarkable pieces of culture on the Internet; in my humble romantic opinion, they deserve something better than a deleted flag in your beefy database (Pls,do not start with the datadump yadda yadda ^__^)."}, {"author_name": "finnw", "gravatar_hash": "1d329f562180503bd1e91997f57fcaff", "author_url": "http://stackoverflow.com/users/12048/finnw", "date": "Jan 31, 2012", "message": "It is possible to partially automate this - When a post is removed due to flagging, give a karma penalty to everyone who upvoted it.\n\nI've upvoted meme posts on SO myself, but I wouldn't have done it if it would have cost me reputation."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Jan 31, 2012", "message": "@system I agree with you, and I think these \"classic\" deleted posts need a place to live -- either on a site specific blog or something else.\n\n(and data dumps don't include deleted content anyway..)"}, {"author_name": "Dusty", "gravatar_hash": "f6748e7fc8264c0d98bbf37541138f01", "author_url": null, "date": "Jan 31, 2012", "message": "Dude, for a post about how memes aren't good for the community, you sure include a bunch of them in your post.  Seriously, how many links to meme like stuff do you have in there?  That stuff's not good for the community. Fine.  So, why are you linking to the deleted stuff in this post?"}, {"author_name": "Wolfgang Keller", "gravatar_hash": "baa9e81ff13b6d0a38e15f088e04154f", "author_url": null, "date": "Jan 31, 2012", "message": "The fight over those kind of questions shows that there is a demand for them.\n\nI agree that they shouldn't belong to Stack Overflow forums - but why don't you create a new Stack Exchange site like programmingfun.stackexchange.com that is exactly about that?\n\nSo there is a place where such questions/answers can be moved to and can hang on if you want to waste time."}, {"author_name": "Spencer Uresk", "gravatar_hash": "24ccd7334bb4f2386242b4820bf6713c", "author_url": "http://www.spenceruresk.com/", "date": "Jan 31, 2012", "message": "As the answerer of one of the \"fun\" questions you linked, I can agree that it is kinda cheesy that I got way more rep from that answer than some far more useful (in my opinion) and technical answers I've given.\n\nThat said, I hope you are really careful going down the road of more moderation. I've seen too many good communities die because of moderation that seems entirely reasonable to those inside the very core of the community, but slowly chokes off new and casual members of the community by making them afraid of being slapped on the wrist for trying to contribute.\n\nTake my answer - someone asked about a slightly offbeat, but arguably relevant question about a creative illustration of the new decimal literal syntax in Java 7. I happened to remember seeing it at a conference somewhere, and found it for them. While not 100% technical in nature, I think there is a pretty big difference between that and a bunch of random meme pictures, and yet I was called out (albeit indirectly and gently) for contributing to an \"insidious\" problem on SO. Am I going to be more careful to stick to strictly technical questions and answers in the future? Yes. Is that really good for the long-term health of the community? Maybe.\n\nI've heard you talk a number of times on the podcast about wishing some people would spend more time thinking before asking a question, and I generally agree. But, I think there is danger in a moderated environment where there are too many rules and norms, such that someone is so hesitant to contribute that they don't bother."}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309/vonc", "date": "Feb 01, 2012", "message": "It would be great news that the idea of migrating those harmful (for Stack Overflow) questions \"elsewhere\" gained some traction.  \n(That is what I understand when Reading Jeff's comment above: \"@system I agree with you, and I think these “classic” deleted posts need a place to live — either on a site specific blog or something else.\")\n\nI did propose that idea at the time of the initial deletions (http://meta.stackoverflow.com/questions/83825/great-question-got-deleted/83844#comment205570_83844), but it wasn't well received then.\n\nNote also that deleting those questions doesn't address the issue of badges gained by answering them: http://meta.stackoverflow.com/questions/73507/will-the-gold-great-answers-badges-be-removed-after-the-deletion-of-popular-qu.\nI have 2 gold badges that I would be more than happy to let go."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Feb 01, 2012", "message": "Didn't we have a simple way of dealing with fun questions? Simply mark them community wiki, nobody gets rep and nobody has an incentive to game the system.\n\nYes they don't contribute to thew technical answers, but neither does Apple having a fancy campus on 1 Infinite Loop, or Sun having a Lamborghini in a lake outside it's office. I don't see Apple moving to a warehouse space in Idaho so it can concentrate on technology.\n\nModerators means that a committee has to decide whats acceptable for the site, is SQL a 'real' programming language for SO? What about DOS batch?\n\nThen on the smaller sites you are totally under the thumb of a single moderator. One person doesn't like questions on British spelling on english.so or string theory on physics.so and gradually those sites die."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Feb 01, 2012", "message": "Ya what did happen to community wiki - why don't you guys just get rid of that bit field - no one uses it anyways.\nI agree 100% with mgb."}, {"author_name": "Michael Mrozek", "gravatar_hash": "dd7e03fbbfcabd4675844173ec5390d2", "author_url": "http://mrozekma.com", "date": "Feb 01, 2012", "message": "I thought people had given up on the \"just make it community wiki and it's all ok!\" argument a while ago, but I guess not. The problem is everyone still sees the post. Reddit has a way to post things such that you don't get karma from them too, but that doesn't make slogging through the swamp of memes trying to find interesting content any less tiresome. The more SO is flooded with crappy content, the less likely it is intelligent people are going to put up with it, and when those people leave all the good questions are going to go unanswered. The goal is to make sure useful questions get answered and people are helped, not to discuss \"What's the funniest comment you've ever seen?!\" or \"What's the best color for programmers?\""}, {"author_name": "Philipp Lenssen", "gravatar_hash": "7ac8015431b5c990787d62a2163edbde", "author_url": "http://outer-court.com", "date": "Feb 01, 2012", "message": "Would it make sense for Reddit to measure the time it takes for a particular upvote to come in (counted from the time the reader had the Reddit page open)? In other words: upvotes that are given after ~5 seconds are valued less than upvotes given after 1 minute, as for the latter case apparently someone had to read through a more thoughtful article (on average, not every time, of course; exceptions like grabbing a coffee before giving the upvote aren't relevant on average)."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Feb 01, 2012", "message": "@philipp that's a really interesting idea, actually. Of course it could be that the person is just a slow reader, or had the page loading in the background or whatever, but statistically I would expect slower votes to be more considered votes.\n\n> Then on the smaller sites you are totally under the thumb of a single moderator\n\nNever -- we always appoint 3 moderators at a *minimum*, and you can escalate to the community team at Stack Exchange if absolutely necessary as a last possible resort.\n\n> Ya what did happen to community wiki \n\nhttp://blog.stackoverflow.com/2011/08/the-future-of-community-wiki/"}, {"author_name": "Jason", "gravatar_hash": "9904b127bff836c939152dcd300ea9ea", "author_url": null, "date": "Feb 01, 2012", "message": "Jeff, call the sites out.\n\nI'm 100% serious. Call the site out and list your reasons beyond the \"lack of moderation\" claim you make in this post."}, {"author_name": "Billy", "gravatar_hash": "c08efd52cb38482a37124bb9ba558ae7", "author_url": null, "date": "Feb 01, 2012", "message": "Many times I've found the answers I was looking for in questions that were closed after one or two responses. \n\n I always appreciate that there were some people who were quick enough to get their answer in."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Feb 01, 2012", "message": "@Jeff I read that entire blog and it still seems to lack what the heck the community wiki is for.  Please delete it ASAP."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Feb 01, 2012", "message": "From another commenter on that blog post:\n\n\"So what is an example of a question that is, and should be, CW? Why don’t you simply remove CW outright?\n\nYou spend a lot of text talking about all the ways in which CW is harmful (which I’ve been saying for at least the past 18 months), and then end with a two-liner about how CW should be used, but without providing a single example of such. If an example exists, let us see it. If it doesn’t, it rather undermines the case that CW deserves to exist *at all*. \""}, {"author_name": "Tom Anderson", "gravatar_hash": "30700279c97553494d9479ec7d667483", "author_url": "http://stackoverflow.com/users/116639/tom-anderson", "date": "Feb 01, 2012", "message": "I'm one of those SO users who feel the moderation is more heavy-handed than it needs to be. Still, it could be worse. It could be Programmers.SE.\n\nI appreciate that you don't agree with me. So i'll ask: how would you be able to tell if the moderation was excessive? What criteria do you apply, and how does StackOverflow currently stand against those criteria?\n\nIt strikes me that something Reddit could do, is to introduce multiple dimensions of voting. You click the +1 button if it's an interesting or valuable post, and the :) button if it's just lulzy. You can then run two rankings on the home page, in separate tabs or what have you, of good stuff and funny stuff. The current system forces users to compress different kinds of value into a single metric, which loses information. Somewhere out there, there is a network of photoblog sites which actually does this, with an array of buttons like 'gross', 'funny', 'interesting', 'sexy', and so on, but i can't remember which one. I can't see how you'd apply this to StackOverflow, sadly."}, {"author_name": "Zac", "gravatar_hash": "5f0c9eb91a4bb231b517bd936967c86e", "author_url": null, "date": "Feb 01, 2012", "message": "You're missing the whole point of Reddit here, Jeff. If people get fed up with what's in a subreddit, they can simply un-subscribe from that subreddit. I've done this countless times and found myself at subs like r/truereddit and r/trueaskreddit. People who like the repetitiveness will stay, and those who don't should leave."}, {"author_name": "Shog9", "gravatar_hash": "4f0af2dc52e6ff228e4d69f7e1e8aa5a", "author_url": null, "date": "Feb 01, 2012", "message": "Zac wrote:\n\n&gt; If people get fed up with what’s in a subreddit, they can simply un-subscribe from that subreddit. I’ve done this countless times\n\nAnyone who spends even a few minutes on Reddit has probably figured out this useage pattern. And yeah, it's probably a very effective way to use the site: just keep surfing from one new subreddit to the next, enjoying the early adopter effect while it lasts, and skipping out once eternal sept. starts to set in... It's really quite a brilliant way to stay engaged socially!\n\nIt's a lousy way to produce anything of lasting value though. Subreddits become fairy rings, quick-growing but ephemeral and vacuous. Why bother trying to build a community when you know it's going to die from the inside out within a short time anyway?"}, {"author_name": "Shog9", "gravatar_hash": "4f0af2dc52e6ff228e4d69f7e1e8aa5a", "author_url": null, "date": "Feb 01, 2012", "message": "Tom Anderson wrote:\n&gt; You click the +1 button if it’s an interesting or valuable post, and the :) button if it’s just lulzy.\n\n...and then break out that +1 a bit further to differentiate Insightful, Informative, etc. and rename it Slashdot!"}, {"author_name": "AlexK", "gravatar_hash": "c99c18f20bd45cd77c7e7560e488757c", "author_url": null, "date": "Feb 01, 2012", "message": "Regarding the dilemma \"I can’t even think of any communities that have been ruined by too much moderation. But I can think of hundreds that have been ruined by too little moderation.\" \n\nThis seems to be a false dilemma: most posters in this thread complain of wrong/low quality/defying common sense moderation, not of too much of it. Devil is in the details, and when too many interesting questions are dismissed as \"not a real question\", what is the point of participating? It certainly was real enough for the poster who took precious time to ask a quality question, it was real for those who took precious time to come up with a detailed answer and such.\n\nAlso deleting the content that was legit at the time of its writing erodes confidence. How do we know that our answers are there to stay? What if you guys change your mind one more time and delete my post that took me some time and effort to come up with?"}, {"author_name": "Camilo Martin", "gravatar_hash": "14570e9514625800a440f40fec36ed6e", "author_url": null, "date": "Feb 02, 2012", "message": "SO wouldn't have attracted me if it wasn't because it seemed like a benevolent, community-created site. There were few funny posts, and all were good. Sure, it wasted my time, <b><i>my time</i></b>.\n\nTo be honest, SO sucks with so many closed, but good, questions. I don't care for the site as I did before, I do not recommend it, and all of that becase it censors content I like. You can't say SO was to become like reddit, it had good rules, but now the rules are way too strict.\n\nI'll keep using SO, just as I'll keep using the toilet. Much crap to deal with, in the most terse and functional way."}, {"author_name": "Camilo Martin", "gravatar_hash": "14570e9514625800a440f40fec36ed6e", "author_url": null, "date": "Feb 02, 2012", "message": "...Or at least give us an offtopic.stackexchange.com (that was once proposed, and rejected by moderation)."}, {"author_name": "Tom Anderson", "gravatar_hash": "30700279c97553494d9479ec7d667483", "author_url": "http://stackoverflow.com/users/116639/tom-anderson", "date": "Feb 02, 2012", "message": "Shog9 - except Slashdot aggregates all the adjectives into a single-dimensional score, doesn't it?\n\nThe site i was thinking of was BuzzFeed - see http://www.buzzfeed.com/lol , http://www.buzzfeed.com/geeky , and the row of \"Your Reaction?\" buttons under each post. I have no idea how successful this actually is; the vote totals seem too low to be useful."}, {"author_name": "Shog9", "gravatar_hash": "4f0af2dc52e6ff228e4d69f7e1e8aa5a", "author_url": null, "date": "Feb 03, 2012", "message": "Tom Anderson wrote:\n&gt; I have no idea how successful this actually is; the vote totals seem too low to be useful.\n\nThis doesn't surprise me. The more choices you put in front of someone, the bigger the chance they'll just skip it entirely. \n\nThat's the beauty of SO's voting system, really - two choices: useful / not-useful. Useful gets more visible, not-useful gets less. Simple, easy to understand, easy to use. \n\nOf course, if you want to *moderate*, there's an entirely separate \"close vote\" system, with many more choices and consequences. You really *should* put a bit more thought into that one, and if a wall of radio buttons scares you off, that's just as well. \n\nBut the end result is a two-dimensional voting system: one tells us whether folks liked a post, another tells us whether it's original, constructive, and appropriate for the site. \n\nYou can vote in one dimension or both, and indeed I've more than once up-voted a post that was an amusing diversion, and then voted to close it - IMHO, there's little harm in having a bit of fun now and then, as long as the mess gets cleaned up once you're through."}, {"author_name": "tim", "gravatar_hash": "94a0e83767dbc71db135454693540015", "author_url": null, "date": "Feb 05, 2012", "message": "I used to use SO a lot.  I used to be on it daily.  I was once on the second page of users.  Now I only get to it via google search.  It has hit a significant scaling problem.  I have no idea how to solve it.  I don't think the problem is the humor posts.  It's a great resource but I sure don't spend my time on it like I used to."}, {"author_name": "wortwechsel", "gravatar_hash": "556ef9b62a5085ad331838b84e926cad", "author_url": null, "date": "Feb 06, 2012", "message": "Jeff, I share your sentiment. On Reddit, i mostly visit my specialty subreddits (machinelearning, neuro, cogsci, etc) and then there is TrueReddit, which i enjoy immensely.\n\nBut there is another side to this story. The superficial and popular subreddits draw the crowd, which in turn brings the diversity and also some talent to the subreddits.\n\nI reckon the key is a good separation of entertainment and discussion. Which means you create spaces of freedom and those of moderation. Be sure to advertise the moderated spaces in the popular ones, as to encourage migration.\n\nTwo good examples on Reddit would be TrueReddit and r/science. You'll find a lot of good content on there, and some interesting discussions. Bad examples would be r/neuro and r/biology - the former clearly needs a sibling called r/askneuro and the second needs more force in moderating related, but stupid content.\n\nSo, my recommendation would be to allow people to be stupid, but give them their own playground and give serious users a tool to ignore them.\n\nMaybe it's just a subproblem of the information retrieval problems that every \"user-generated content\"-site has. In addition to semantic attributes, also provide facettes on quality markers.\n\nJust thinking aloud. Cheers."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Feb 06, 2012", "message": "There's a nice array of opinions here, which leads to a problem that I don't think is unique to SO/SE, and I'm not sure how to address it.\n\nWhich opinions do you think correlate with someone putting in the work to become a moderator?  I am inclined to think its' the \"this stuff is garbage; it doesn't contribute; it's making the Internet worse!\" opinion.\n\nBut, as this comment thread indicates, there is a diversity of opinions on this from people whom I think have a legitimate claim to being part of the \"community\" that is probably either not represented or overwhelmed in the group of moderators.\n\nAgain, this isn't unique to SE/SO or online communities.  It's why we have things like corn subsidies.  Those who get them are much more motivated and passionate in lobbying for them than those opposed are in lobbying against them.  And we haven't figured out how to fix that either.  It's why things like SOPA get as afar as they do.\n\nOne can fault those those of us who don't get involved -- we've left the field open for the deletionists.  Still, I think the notion that things like the favorite programming cartoon are a scourge on SO is the opinion of a passionate minority, and I'm not certain it's wise to follow it."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Feb 06, 2012", "message": "And, BTW, I will echo the comment that the moderation on programmers.se seems to be even more, er, immoderate than the moderation on SO.  Perhaps because it resides on the edge of discussion-type questions, it has been deemed necessary to draw a firm line about what is allowed and what isn't.  But if the intent was for that to be a release valve for higher level questions not appropriate for SO, that has not been realized.\n\nTo put it another way\n\n| (Questions allowed today in SO) UNION (questions allowed today in progremmers.SE) | &lt; | (questions allowed in the early days of SO) |"}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Feb 06, 2012", "message": "Since I've already started to monopolize this thread, I'll add this to thank Jeff for setting this up, that I think it has been a boon to programmers and others, and that, like Jeff, I'm only hard on it because I know how great it is and want it to be the best it can be, and true to what it started as."}, {"author_name": "pogo", "gravatar_hash": "40cb5cb9d20b5ec2493993efc4c85261", "author_url": "http://www.pogo4.com", "date": "Mar 17, 2012", "message": "thanks admin cool article"}, {"author_name": "TankorSmash", "gravatar_hash": "2dfc2e563d2150994a6e06ef37f9e7be", "author_url": "http://tankorsmash.com", "date": "Jul 21, 2012", "message": "I was just thinking quickly, and maybe you could have a sub forum where all the new folks put their questions, where they wait until someone passes their question into the larger, main pile of questions.\n\n Almost like putting a question into moderation immediately, except that it can still be seen by everyone, but it is in a special place for the users with sub 200 rep or something, so you know that they probably don't understand all the rules just yet.\n\nBasically, place all questions from new users into a seperate pile, where they are labelled as new users and are vetted before getting passed into the main set of questions."}, {"author_name": "Ron", "gravatar_hash": "4ad245dadd35fe130b6e98da8e2f66f0", "author_url": null, "date": "Jul 25, 2012", "message": "On my Reddit board of choice (r/trees), the redditors themselves are combating the rage comic epidemic by having a \"Self-Post Friday\", in which users opt to submit thoughtful self-posts to encourage discussion and bonding in the community. Seems like it really works, but maybe that's just the culture of that particular board... :D\n\nAt any rate, I'm not sure the solution lies in moderators, but by changing the mindsets of the participants in the forum. People must WANT to post quality material, or else they will likely fall back to their lazy posting ways."}, {"author_name": "Rob Nicholson", "gravatar_hash": "cd8944d16cfdcac799583dfc94eaa7b7", "author_url": null, "date": "Nov 14, 2012", "message": "I completely *hate* the various Stack sites because the posts are closed without any consultation. I asked a very specific question on SharePoint with a clear YES/NO answer and it was closed off. It just puts you right off been treated like a child."}]}