{"response": [{"author_name": "M", "gravatar_hash": "cd0165a88a06fc92a36f222606f17a11", "author_url": null, "date": "May 29, 2014", "message": "The new gold tag badge binding closevote is the greatest thing ever. Ever."}, {"author_name": "Diego", "gravatar_hash": "9b6f3c1496691c7065e4c1a4d8dd4e9a", "author_url": "http://godiego.org", "date": "May 29, 2014", "message": "is nutella actually sponsoring this podcast?"}, {"author_name": "AsheeshR", "gravatar_hash": "909aa23f4e7adfa2519ac2697fda6f30", "author_url": null, "date": "May 29, 2014", "message": "One of the reasons SE has succeeded as a Q&amp;A platform compared to others' is the very fact that users do not command views; content does. This minimizes both, the social aspect and the effect of popularity. \n\nIf we move away from that to individual votes giving n+ views, you are directly indicating that knowing and interacting with specific people is worth more to the network than the quality of the post itself or in other words, being in the contact (or in the friends circle) of some specific individuals will get you more attention.\n\nThis will be an interesting experiment, but then, does it mean that the SE content based model is not scalable? Eventually, will it be about being in the know of specific people, similar to other social Q&amp;A sites?"}, {"author_name": "Rachel", "gravatar_hash": "01b235a8024b2dd10f427c301c876a0b", "author_url": "http://rachel53461@wordpress.com", "date": "May 29, 2014", "message": "Is the Community Bulletin on Stack Overflow new as a result of splitting MSE and Meta.SO? <blockquote>It is. --Ed.</blockquote>\n\nI think it is since I've never noticed it before, and think it's a big step in the right direction towards getting more regular users to interact with Meta.SO.\n\nI have been concerned in the past that Meta.SO is largely full of people who have been around the sites for a long time, and have always thought that many of the answers/votes there do not accurately represent the majority of Stack Overflow users, especially with how different votes are on meta from the main site.\n\nAnd as I posted <a href=\"http://meta.stackoverflow.com/a/253376/302677\" rel=\"nofollow\">here</a>, it's hard for someone to keep the same level of involvement in any online community for any extended period of time. Its only natural that people eventually reach the point where they start spending less time on the site as their lives change, or they change, and I think its important that we keep encouraging newcomers to pick up the slack and grow into the next set of \"high reputation users\". It's the only way to keep a site of this size and nature sustainable.\n\n<blockquote>You might find <a href=\"http://blogs.hbr.org/2013/10/what-to-do-when-an-online-community-starts-to-fail/\" rel=\"nofollow\">this essay</a> interesting then. --Ed.</blockquote>"}, {"author_name": "DroidDev", "gravatar_hash": "eb6f443c31bb9e52cdca323c3c9ebdec", "author_url": null, "date": "May 29, 2014", "message": "One issue that came to my mind after reading Joel's proposals is: Consider a question from a new user, with not so popular tag or a tag with not so much followers or activity. Other questions at the same time will get upvoted or downvoted and will catch more eyeballs while that particular question in \"not so much activity area\", even while being a good question, might won't get that much eyeballs."}, {"author_name": "Reader", "gravatar_hash": "15ba47ec7e57d6a0ba526bf328a756e0", "author_url": null, "date": "May 29, 2014", "message": "How about a feature where high rep users can be more selective regarding the question they see (e.g. don't show any question with no up-votes)?"}, {"author_name": "vak", "gravatar_hash": "e29e5aeacbdde559cf1d0be6c7aed84f", "author_url": null, "date": "May 30, 2014", "message": "I so disagree with some of the things said on this podcast.\n\n1) someone said something to the effect: 'some of these [bad] questions are asked by people who are not programmers and who maybe shouldn't be but have been asked to do something they can't and they try to unload it on the S.O.'\n\nDude: I'm doing I'm asking these types of question on S.O., so let me enlighten you. It's not just programming. I'm active on the stats.stackoverflow site and we get questions like that *all the time* (peoples who aren't statisticians and have to do some statistics). And you know what? It's OK. That's what all these sites are about: sometimes, in the course of your job, prototyping with ideas forces you to use skills you don't master. Often, if the prototype works, you'll get more resources. But as a first step you are trying to patch different parts and need good quality (expert level) knowledge you don't have time to acquire right now. This site gives you that independence and makes the world a better place for it. For the rest, people have conscience and everybody is good at *something*. I'm trying to manage my karma by helping peoples in when I can, but I ain't gonna answer/ask many HQ programming questions. \n\nBtw,  listening to your comments about the results of these basic stats ('A/B testing') you mention in the podcast, I suggest you ask about *that* on the stat stack-exchange once. I can already see some dragon lurking. It's okay if your question is not very deep, statistically. We're still a very tolerant community on cross validated. \n\n2) I'm very happy with my user name on this site. It starts with u and finishes with a number. \n\nBest regards,"}, {"author_name": "Amal Murali", "gravatar_hash": "b541b9aab077d68de0548204258e712c", "author_url": "http://stackoverflow.com/users/1438393/amal-murali", "date": "May 30, 2014", "message": "The most important change that occured recently is the introduction of dupehammer. It is simply awesome and allows much faster closing of duplicates."}, {"author_name": "Warren Dew", "gravatar_hash": "3e83e511e401770207ffbb0d31b8ffb4", "author_url": "http://psychohist.livejournla.com", "date": "May 30, 2014", "message": "I think you should be careful about taking the population that posts on meta as representative of the Stack Overflow population as a whole.  People who spend their time posting on meta are people who aren't posting on Stack Overflow; the people you really want to know about are the people who continue to post on Stack Overflow, which is arguably a different population."}, {"author_name": "Dukeling", "gravatar_hash": "16c10b1521aaa22f41f21b55dfddea43", "author_url": "http://stackoverflow.com/users/1711796/dukeling", "date": "May 30, 2014", "message": "Do we know that \"some of our best users\" use the front page enough so that either of those proposals will have much value?\n\nUsually questions that make it to the front page has received quite a bit of attention / a few answers already, so they aren't (often) of a lot of interest to a lot of the best answerers (in terms of answering them, that is)."}, {"author_name": "Matt", "gravatar_hash": "fbb4d027695dfdf76bf448b15d7e306a", "author_url": null, "date": "May 30, 2014", "message": "\"People who spend their time posting on meta are people who aren’t posting on Stack Overflow\" Not so. I'm very active on Stack Overflow; I've been driven to Meta because I'm seeing things turn sour right before my eyes. - I haven't listened to the podcast, but Joel's suggestions listed in the blurb above seem sensible to me, since some of this is certainly about the problem of the messy front page (the front page, as filtered, is how I look for questions to answer). So I would say, Yes, let's try that. But I also think it's nowhere near enough; the front page needs a major revamp. A question that has entered the \"close vote\" queue, or a question that's old and has merely been recently edited or commented on, should not share the limelight with serious people who need useful assistance now."}, {"author_name": "oldprogrammer", "gravatar_hash": "95147ad678056a94a58ec52faa1b096a", "author_url": null, "date": "May 30, 2014", "message": "I am a new SO user with 37 years of computer programming experience.  The door has been slammed in my face several times because I did not ask the question \"properly.\"  Its beyond frustrating to hear a variation of \"I know something you don't know!\" It reminds me of the holier-than-thou wars on Wikipedia.\n   I won't go on venting here, but you can just imagine how enthused I am about contributing.  I have to just hope that someone eventually answers a similar question so I can get a clue."}, {"author_name": "Vlad", "gravatar_hash": "64233179059df37d653061e2bcee9ff8", "author_url": null, "date": "May 30, 2014", "message": "To be honest, during years of observation, users with highest rating are usually the ones with worst attitude. I know, they heard the same question kazillion times, but if you don't have something nice or useful to say, wouldn't it be better if you remain quiet? \n\nRatings are a problem. I remember a forum waaay back, where people would post drivel just to up their score, which boosted their egos and gave them incentive to post more drivel. It is getting same here, without drivel ofc."}, {"author_name": "oufalk", "gravatar_hash": "380bf7e0e66a0c863ac54bed39d5886d", "author_url": null, "date": "May 30, 2014", "message": "I still think we have a major problem with downvotes, especially with new users, and how that affects their motivation to continue on with this site. The policy of commentless downvotes needs a long hard look at."}, {"author_name": "Jayanth", "gravatar_hash": "685c7291c36b2895bfa08cc1334e05c7", "author_url": null, "date": "May 30, 2014", "message": "Now only if there were a \"up vote\" botton for the comments, and the suggestions / proposals..."}, {"author_name": "mol", "gravatar_hash": "ab3590ac2e303b1f1da694f028c66e6a", "author_url": null, "date": "May 30, 2014", "message": "Sell it quick."}, {"author_name": "Mark", "gravatar_hash": "9898aa6edd32823049629e43cdd854a3", "author_url": null, "date": "May 30, 2014", "message": "The problem is, many questions are asked over and over again. Some questions while very similar may not answer someone else's question. Could be something as simple as they are using a different Linux distro so the commands are slightly different.\n\nYou almost have to review and edit each question and tag it heavily so that search results pull better results. Lots of times when I search, I get the same question another person asked but no answers. Sometimes its related to Windows but not Linux. Google seems to do a better job of providing more relevant results. \n\nAt one forum I help manage, we actually merge questions together. We then post the answer(s) right below the question. The rest of the response thread stays with it and is merged as well to read prior conversations if any.\n\nUsers find this to be very useful and we've seen a 40% drop in duplicate questions being asked. However, it can be time consuming to go through the existing questions and merge them - as well as merge new ones being asked or removing them."}, {"author_name": "Mark", "gravatar_hash": "9898aa6edd32823049629e43cdd854a3", "author_url": null, "date": "May 30, 2014", "message": "Forgot to mention, questions that we feel are answered in full receive a special status flag that makes them a priority in results that match a search query."}, {"author_name": "Vonada", "gravatar_hash": "0fbe5a3be83a314d8070b0fcf718589e", "author_url": null, "date": "May 30, 2014", "message": "I'm new to Stack Exchange and I am spending time researching what SE is all about, because I am interested in both helping and being helped with answering programming questions. I have been a member of other blogs, so I am aware that its very important to 'understand' the rules and culture of the community, before jumping into the mix as a 'newbie' and risk making a bunch of 'noob' mistakes.   \nAfter listening to the complete podcast, I am pleased to know that there  are a core group of members that are truly serious about creating and maintaining a worthwhile community and weed out the inevitable problem people (trolls, vampires, etc)."}, {"author_name": "recurvata", "gravatar_hash": "0c4c16cf8f6c18cfb816d962959c1c35", "author_url": null, "date": "May 30, 2014", "message": "I agree that many commenters on some forums (looking at you, GIS) are unduly harsh and negative towards minor or just perceived flaws in question formatting. If you don't measure up to their standards, you either get no help or downvoted. \n\nThis site is, presumably, one where you can ask for help when you have a problem. The haughty, condescending attitude of some commenters (not all or most, but prolific) is very discouraging. I've gotten some good help, but have also been downvoted for minor stylistic differences.\n\nMaybe downvoting should be eliminated. Vote up good answers, point out errors in incorrect ones but otherwise ignore them."}, {"author_name": "Rocky", "gravatar_hash": "4d265479ab4ea381148f90618e211aa3", "author_url": null, "date": "May 30, 2014", "message": "My comments are in sync with OldProgrammer above. I think there is some bullying going on SO and sometimes people are ruthless in dealing with new SO members jus because their score/reputation is not high."}, {"author_name": "Cameron", "gravatar_hash": "cbe623408c24e48ea1ac0e086ec08b6b", "author_url": null, "date": "May 30, 2014", "message": "Run a Netflix Prize for a machine learning algorithm for determining question quality (from question content alone, I don't agree that question quality should be judged by rep, etc)."}, {"author_name": "Matt S", "gravatar_hash": "ded0348a1239d82971c6c561d28e0116", "author_url": "http://artsho.ws", "date": "May 30, 2014", "message": "I remember when answers were hidden on this site, was it behind a paywall? I forget. But the day answers became visible, amazing! I do see a lot of incredibly simple questions being asked on here, and it almost embarasses me. The saying of RTFM echos in my brain, but honestly I haven't fully read the manual, nor do I remember every rule. Sometimes I get things switched about. So, I'm torn. I would love every question I could ever have show up as an answer here, but I also don't want to reference this is THE site to ask any little question. It's incredibly helpful that the stack design of the sites is visually calm, and well organized, and has a great backend. Rant rant... trail off."}, {"author_name": "Tim", "gravatar_hash": "251f2449ffba9fbcc3491db6564ff4a2", "author_url": null, "date": "May 30, 2014", "message": "It seems to me that talking about how to identify and then hide low-quality questions, either directly or indirectly by boosting higher-quality question at their expense, ignores one crucial problem: The horse is already out of the barn when those actions start.\n\nLet's not forget to think about ways to improve question quality in the first place, e. g. using means like http://meta.stackoverflow.com/a/253317/20670 - it doesn't have to be exactly that approach, but there are some good ideas there."}, {"author_name": "Hrusikesh Panda", "gravatar_hash": "3ec4378e62a1eb052941217776ea0f2d", "author_url": null, "date": "May 31, 2014", "message": "So the rich will get richer and poor poorer? This \"fix\", while easy to implement seems like a band-aid rather than a proper stitch. \n\nLike @Rocky says, bullying is the bigger reason why people turn away from SO and other SE sites."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.billthelizard.com", "date": "May 31, 2014", "message": "If there's bullying going on, it's not because of low reputation. Nobody is going around looking for 1-rep users to bully. People are going around looking for questions to answer, and when all they find is crap, they downvote, vote to close, and leave comments for the people asking low-quality questions. Downvoting and close voting is not bullying. Some comments do cross the line, but that's what flagging is for."}, {"author_name": "James Mortensen", "gravatar_hash": "af668818d6cfecc1a1b008cf599562cd", "author_url": "http://stackoverflow.com/users/552792/jmort253", "date": "May 31, 2014", "message": "@Matt S.  Are you sure you're not thinking of Experts Exchange?"}, {"author_name": "Anthony E. Rutledge", "gravatar_hash": "82cd05ed7ff041cad7e0ef7090a07563", "author_url": "http://www.anthonyerutledge.info", "date": "May 31, 2014", "message": "Consider changing, or enhancing, the focus of Stack Overflow.\n-------------------------------------------------------------\n\nSome thoughts and ideas.\n\nFacts:\n******\n\nAnyone can have a good question or a bad question.\nAnyone can ask an easy question or a hard question.\nEveryone has different knowledge and training.\nEveryone has different levels of education and experience.\nEveryone brings different motivations and expectations to the site.\nEveryone is unique in some way.\n\nSolution:\n********* \n\nMake the site more user centric. Enrich the user profiles with more data (education, classes taken, books read, etc ...) and use that data to help shape question streams on each user's view of the homepage. Keep the vote/view/answer/bounty metrics and other algorithms I could not possibly know about, too. Make users rank their own questions in terms of relative complexity/hardness (1 to 10). Let users rank their ability on tag issues (1 to 10), then allow those who ask questions to target the ability group they would like to communicate with. Experts (10) on subjects should be able to filter self-rated complexity/hardness questions, therefore, they can expect to see less \"bad\" questions and more high quality questions.\nGive lower reputation users a currency they can spend to \"buy\" help from experts (level 9/10's). A list of profiles might come up on the screen somewhere so that a user could target their question to certain users. Furthermore, as with operating systems, users need to be able to establish their own \"groups\" so that groups can be targeted with questions.\n\nIf you focus on your customers more deeply, you will not have to worry as much about screwing new users or scaring experienced users. Will more questions get answered? Will those question be of higher quality? Maybe."}, {"author_name": "Anthony E. Rutledge", "gravatar_hash": "82cd05ed7ff041cad7e0ef7090a07563", "author_url": "http://www.anthonyerutledge.info", "date": "May 31, 2014", "message": "Oh, one last thing.\nKeep the high reputation people hungry by give them monthly incentives."}, {"author_name": "Qix", "gravatar_hash": "b7c510641e6526d19abc93e866e75ac8", "author_url": null, "date": "May 31, 2014", "message": "I propose every new user gets 50 rep from Jon Skeet."}, {"author_name": "recurvata", "gravatar_hash": "0c4c16cf8f6c18cfb816d962959c1c35", "author_url": null, "date": "May 31, 2014", "message": "What exactly is a 'low quality question'? One someone thinks is too simple or basic? Nothing wrong with those questions. If you feel they're beneath you or you're just not interested, you have the option of ignoring them. I don't see where SE's stated goal is limit questions and answers to mid and high level experts only. \n\nAnd question simplicity, which seems to be the criteria for quality, is not the only triggers for bullying behavior by some. Your python code isn't in strict PEP-8? Downvote! You used a term common in your field, such as plat or subdivision? People in other countries might not be familiar with that term, so downvote!\n\nEven this wouldn't be so bad, if the folks downvoting or leaving critical comments would post something helpful to steer people on the right track. And some do, but some just seem to get kicks out of bashing posters they don't feel measure up to their standards."}, {"author_name": "abhishek chattopadhyay", "gravatar_hash": "9a296a3cf34a99d23c6acf10be3a7b8a", "author_url": null, "date": "May 31, 2014", "message": "Ok I got the algorithm. It looks simple and effective.\nBut how does it solve my problem.\n\n(a) A new user, (so no trust points = less eyeballs) +\n(b) not such a great question ( no hi-fi question = less eyeballs)\nthen the probability to get the question answered is some function of score of (a) + score (b).\n\nWhich would be very very less eyeballs = no eyes at all.\n\nthe \"better question\"  votes would be soon treated as useless FB LIKES. And what else, the great place for programmers is all set to become a new networking site for geeks.\n\nA newbie would have a very thin chances to get his query answered. and the question itself might not be necessarily poor (with what ever standards you have), or might also have never been answered.\n\nI might be wrong. and if I am just trash the question.\nThat would be the most effort effective way of handling this if condition."}, {"author_name": "Anthony E. Rutledge", "gravatar_hash": "82cd05ed7ff041cad7e0ef7090a07563", "author_url": "http://www.anthonyerutledge.info", "date": "May 31, 2014", "message": "Hey, what about a \"transfer question\" feature. Now that would be super!"}, {"author_name": "Chloe", "gravatar_hash": "263aa1ae12d9757f78167b80e596c3df", "author_url": null, "date": "May 31, 2014", "message": "Consider quadratic vote buying \n\nhttp://blogs.law.harvard.edu/corpgov/2013/06/06/quadratic-vote-buying-square-root-voting-and-corporate-governance/"}, {"author_name": "justcool393", "gravatar_hash": "772bd016948cd42c81f6dd3567b345a7", "author_url": "http://justcool393.wordpress.com", "date": "May 31, 2014", "message": "@Bill The Lizard:\nIt does seem that so called low-quality questions or very subjective questions do get harped on if the poster if the poster is new (case-in-point: Some on Jon Skeet's questions (they are great reads though))."}, {"author_name": "Alex I", "gravatar_hash": "8877dd512c3d9b5063f270e2e75fd3d9", "author_url": "http://stackoverflow.com", "date": "Jun 01, 2014", "message": "On some of the other comments, good ideas, I want to make sure they are not missed.\n\n@Anthony E. Rutledge: \"Make the site more user centric\" - Yes!  But base it more on behavior (stuff asked/answered, stuff chosen to look at) than on other metrics (education).\n\n@Cameron: \"Run a Netflix Prize for a machine learning algorithm for determining question quality\" - Yes!  But just post it on Kaggle for free :)  I think it is better to make a \"which question should I answer\" algorithm than a question quality algorithm tho."}, {"author_name": "G", "gravatar_hash": "cfbdc159b93ec4f559f21dc97154d45b", "author_url": "http://the.inter.net", "date": "Jun 01, 2014", "message": "I will trade you A LOT of thoughts on this for just a LITTLE bit of non-obtuse baseball (or really just tee-ball) tips. So I can stop crying whenever I see a wiffleball. If you want.\n\nEven if you don't take me up on that, its _great_ to know this _is_ on your radar.\n\nG"}, {"author_name": "Anthony E. Rutledge", "gravatar_hash": "82cd05ed7ff041cad7e0ef7090a07563", "author_url": "http://www.anthonyerutledge.info", "date": "Jun 01, 2014", "message": "@Alex I: They guys on the pod cast are hilarious! My girl friend and I enjoyed listening to them, but in my light hearted opinion they collectively need to consult some psychology/sociology/education/anthropology/business/communication majors to get a broader sense of the relationships between motivation, power, status, altruism, empathy, group behavior, learning patterns, hierarchies, self-worth, judgment, decor, deviancy, penalties, bonding, and making the customer happy. :-)\n-----------------------------------------------------------------\n\nSeriously.\n\nLetting behavioral based site shaping dominate the customer's experience will (and is) implicitly draw out the basest of human behaviors, or leave some customers with a bad taste in their mouths. *The only metrics that should matter are the metrics that a user sets for his or herself.* Training, formal education, self-education, and experience are metrics that should be part of a profile because they sometimes have a bearing on the level of detail and time one is willing to put into an answer, or the sophistication of their questions. In other words, when hard questions are asked, those without adequate knowledge or ability will rarely be able to answer them. Hard questions can look like visual noise to some. Advanced customers looking for thoughtful questions need a way to shape their experience (to lessen their dumping on the casual customer).\n\n**But, as with behavioral metrics, education metrics should not dominate the user experience.** The profile metrics pie needs to be sliced up to reflect the traits of the customer: subject matter, ability on that subject, education/training, difficulty of questions desired to be seen ... all of it needs to be the customer's choice based on who they are personally. Yes, I understand their is a tagging system, but that is a passive way of streaming questions towards a customer (you have to wait until they do something). Letting a diverse, yet meaningful, profile help shape question streams before the customer does anything is an active way to shape question streams, give the customer more control, and make the customer happy. There needs to be slider bars to adjust levels! No slider bars, well it won't look as nice. :-) That way, the customer can choose if education matters of not to them.\n\n*Groups* help form bonds. If the owner of this site want to improve the tone they should allow grouping. Also, the notion of reputation needs to be expanded. If you are rude to someone, that person should be able to lower your reputation! Alternatively, create another status called altruism. This way, customer can filter people out who care more about rules and points than helping someone.\n\nBetter question naming may be necessary on Stack Overflow, too. Perhaps there should be a *mandatory order of elements* for each question: programming language(s), database (if any), and general subject. However, constrain the customer created part of the question so as to spark curiosity. Newspapers and news/gossip web-sites to it all the time! :-)"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jun 01, 2014", "message": "Color me a bit clueless, but didn't the quality problems begin ratcheting up when we decided to take away the community's ability to close _trivially basic questions?_\n\nClosing an ill-formed, hard to understand question is easy.  Closing a well-formed, easily-understood question that the user should have really done some basic troubleshooting or read the manual is much more difficult, and when it happens, the close reason makes no sense.\n\nYou don't necessarily need more machinery (although the quality filters seem to work very well, I think we've already exploited those as far as they can go).  What you need is more sensible community involvement without so much contention (wailing and gnashing of teeth on meta over closures is very demotivating), and more powerful tools for the veterans.\n\nWhat are the other choices?  Dropping views for negatively voted posts is a nice idea, but who is going to clean that up, if nobody sees it?  The automated processes?  I'm fine with that, if it happens in a timely manner (30 days is not timely, and low-rep users answer and upvote in the meantime).\n\nCreating canonical question/answer pairs to close all the trivial questions as duplicates of?  I'm OK with that, too, I guess, although it's going to take awhile for that to have any effect.\n\nDISCLAIMER: I haven't listened to the podcast (yet)."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jun 01, 2014", "message": "In other news, it would be nice if the markdown formatting worked consistenly **everywhere.**\n\n<blockquote>Learn2HTML, n00b! --Ed.</blockquote>"}, {"author_name": "pita piper", "gravatar_hash": "9234abd1323f6a286f37b7b55ca98968", "author_url": null, "date": "Jun 01, 2014", "message": "First - the recaptchas are completely past Ridiculous. I had to click 30 to 40 times to find one that looked even close to guessable. Then I had to do it another 20 times 'cause apparently my brain and eyes are not equal to ANY of the challenges. Really? I guess that's one way to stop spammers, but 99% false positives are a joke.\n\nand the Audio challenge... yeah, if I wanted to communicate with the dead via the interpretation of moans and sighs taken from a back masking playback of stoned 12 year olds, I'd be on it in a jiffy. But the audio challenges are just as messed up. \n\nSecondly - I want to say that I also despise the bullying from high status users. I see it over and over, especially in closing questions that are in fact VERY interesting and relevant to many people, or in aggressively down voting answers that suggest alternative methods for doing something. \n\nI'm not talking about stupid answers (\"use linux\" \"use active directory\" \"use silverlight\" \"switch to apple\" \"you don't know enough to ask the right question\" and the rest of the useless baiting that passes as intellect) but about people suggesting or asking about alternate tools or ways to get things done, be it an algorithm or an alternate view point.  \n\nThe proprietors of this site would do well to realize that they will face the exact same struggles that faced slashdot, digg, reddit and all the other techy social media sites. One of the biggest problems that repeatedly bites site owners in the ass is that the people who hang out here all day handing out up and down votes and dispensing advice are seldom representative of the remaining users.\n\nIt's always easier to pass off administration of a site to the people who hang around all day and work for free, but it also invariably gives those same people the impression that they're running a private club and can chase off anyone who isn't just like them.\n\nSame for the duplicates. Close them to your hearts content, but I often see people asking for information that is NOT the same as the questions they are being referred to as dupes. And yet, rather than taking advantage of this to work magic with bayesian indexing voodoo, SE is more interested in pruning their data set.\n\nStats are hard. Psychology is hard. Understanding your user base? \nIt never gets easier. Listen to the negative things the great unwashed masses are spouting, as it is the most valuable feedback you'll ever get. \n\nBut seriously - fix the captchas."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jun 01, 2014", "message": "If we listened to what the great unwashed masses wanted, we'd still be answering questions like \"Best programmer cartoon\" and \"What laptop should I buy for programming on a boat with my pet cat Schrödinger?  Does it need to be waterproof?\""}, {"author_name": "s1981", "gravatar_hash": "03d4d8569df759f4aefc22341498ccda", "author_url": null, "date": "Jun 01, 2014", "message": "I don't know how valuable my opinion is but as someone who doesn't post on this site often I find it incredibly frustrating when I do. \n\nEveryone seems to assume if you ask a question and you're new that you never googled, never read documentation, etc. I have a question marked as a duplicate currently that is in no way a duplicate and hasn't been answered by any thread here or that I've found on the internet and I searched for hours. On the face the question looks simple but the part of it not working for me seemed be overlooked. \n\nI can only assume the people marking it skimmed it, marked it and moved on. \n\nI hate coming to stack overflow because of this. I've found a lot of good in the site before but it seems that asking a question as a beginner is forbidden. Heck I couldn't even post a screenshot of the issue without having 10 karma."}, {"author_name": "zog", "gravatar_hash": "8c12c408509da322f25d7723d88e03ad", "author_url": "http://www.yam-zilum.co.il/he-il/services/services.asphttp://www.zog-design.com/?page_id=4043", "date": "Jun 02, 2014", "message": "i don't believe in stack overflow method and from my experience it not always works"}, {"author_name": "Steven T. Snyder", "gravatar_hash": "8885025e52e5cf5e0defea975aa8e727", "author_url": "http://www.steventsnyder.com", "date": "Jun 02, 2014", "message": "How about adding a little notice box at the top of the page for a question posted by a newbie like this:\n\n\"This question was posted by someone new to our site! Please consider helping them feel welcome with a comment, answer, or constructive criticism!\"\n\nSometimes we just need a little reminder to go easy on the new guy."}, {"author_name": "Sergi", "gravatar_hash": "e3fe25bb110fdcad980c16560b4a3853", "author_url": null, "date": "Jun 03, 2014", "message": "One of the problems with any forum is maintaining the 'culture' desired by the leaders and users.  It's similar to a corporate culture in a large corporation and this so-called culture is steered by upper management. For example, the employees quickly learn what is acceptable behavior and what is not.  Of course, they also learn what gets rewarded and what doesn't--sometimes creating an unwritten code of ethics.  \nWith recent reports that hiring managers are looking at Stack Overflow ratings as a judge of prior experience and proof of frequent involvement in the programming community and ongoing projects, I should be obvious that jobseekers are going to stop at nothing to get what they need to get hired.  This leads to what people complain about, which are tons of lousy and weak questions, simply designed for a friend or pal to answer and gain easy points, without regard to the culture of the forum or concern over it.  This problem tends to lower the grade of the site. There are over a million unanswered difficult questions that seem so complicated, one wonders who in their right mind is going to devote all that time (for free) answering them.  \nIt seems by the rumblings of the site's senior members, that they easily become annoyed by receiving notices of activity on their 6 year old posts (mentioned in podcast).  It sounds more than a bit jaded.  They undoubtedly feel that they have put in their time and we're not going to get much more out of them, unless the posting just happens to suit their ever-more stringent set of 'must haves' to qualify for a moment of their time.   Obviously, no site can continue without nurturing an incoming field of hungry inexperienced programmers, likely with more questions than answers. \n Facebook tried having a 'thumbs down' button,  but they quickly got rid of it because it created way too much ill will and negativity.   I think on SO, the same thing is happening--leading to a sense of being squashed by the powers on the top, who have thousands of down votes to burn, who have what feels like a heavy hand, quickly evaporating whatever hard work went into asking a question or answering. \nOne suggestion, surely to not be appreciated by the 20,000 + crowd, would be to require people over a certain threshold to be more involved helping the new programmers and being supportive, by contributing to a required amount of questions or lose points.  One could easily see that the site is being supported by the newer members and those still trying to reach their points goal by answering, so I see motivating the jaded 20K+ crowd to work a little harder at not bashing newbys with unwarranted down votes and belittling comments, for not having done enough 'research' ."}, {"author_name": "aaron burns", "gravatar_hash": "2e79089faf35c6ada7e35cffd3d45234", "author_url": null, "date": "Jun 20, 2014", "message": "Here just another voice saying that SO has to many high rep members acting like little napoleons. Quit letting those with so much time rule the site."}]}