{"response": [{"author_name": "Vijay Santhanam", "gravatar_hash": "640b48a0bf5e3cc984bcef7b8db9a0dd", "author_url": "http://vijay.screamingpens.com", "date": "Jul 21, 2008", "message": "Relative time is better. It's easier to read and the exact DateTime is not useful for anything."}, {"author_name": "Mark Ingram", "gravatar_hash": "f620f4647fb816073c9152a284245e64", "author_url": "http://www.mark-ingram.com", "date": "Jul 21, 2008", "message": "Relative time!\nI hate it when I go to sites and they show the time of the post but it's not in GMT (my timezone). It's more of a hinderance because I then have to find out what PST is in relation to GMT."}, {"author_name": "Peter H", "gravatar_hash": "468da151eecf975dd632fcc5446d374e", "author_url": null, "date": "Jul 21, 2008", "message": "I like relative time for shorter TimeSpans, like less than 24h or so. Otherwise I think the date information is good, so that I can see if a post was posted on a weekday or such, as well as what time it was (geeks posts at night or at job time? :)\n\nHowever you decide to put it, why not go for ISO-standards? At least, please don't use am/pm (I know Prf Tufte agrees with me!)"}, {"author_name": "paketep", "gravatar_hash": "822b3c3bb905022d6b8923ca377de55e", "author_url": null, "date": "Jul 21, 2008", "message": "How about both?. Relative just below the question (or after, between parenthesis) and absolute, in a smaller font, at the bottom of whatever box you are putting it in. I don't know, somewhere.\n\nBest of both worlds.\n\nPS.- That recaptcha thing is real slow :("}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 21, 2008", "message": "I apologize for the CAPTCHA, but the comment spam problem was getting really bad, 50+ per day. And Akismet would regularly mark user comments as \"spam\".."}, {"author_name": "Jeff B", "gravatar_hash": "292deef03a563a812c2a4711988a1065", "author_url": "http://www.tvvoting.com", "date": "Jul 21, 2008", "message": "Relative is better, but if you do use absolute, please use JavaScript to convert it to the viewer's local time zone.  Something like Mike West's PerfectTime - fails gracefully as well."}, {"author_name": "Mike Tomasello", "gravatar_hash": "295bccb34897e178de5c5c90442baaeb", "author_url": null, "date": "Jul 21, 2008", "message": "Relative with absolute in a tool-tip (title=\"\" attribute?)."}, {"author_name": "Konrad", "gravatar_hash": "f9401202ab73e624cc82800b0fff1489", "author_url": "http://madrat.net/", "date": "Jul 21, 2008", "message": "I'd opt for relative, too. But perhaps we are missing something; *is* there any advantage in displaying absolute dates/times?"}, {"author_name": "Cyrik", "gravatar_hash": "06a7a04988d35a276d7bb0d1e5b20d02", "author_url": null, "date": "Jul 21, 2008", "message": "i agree with mike. use both and put one in the tooltip"}, {"author_name": "Alejo", "gravatar_hash": "441612fa22bd5381ab3fcb8b3d696d52", "author_url": null, "date": "Jul 21, 2008", "message": "&gt; Relative with absolute in a tool-tip (title=”\" attribute?).\n\nI second!"}, {"author_name": "Matt", "gravatar_hash": "0d6043840ea98542a9c9331c7e7940b1", "author_url": null, "date": "Jul 21, 2008", "message": "Absolute for &lt; 1 week, relative for older."}, {"author_name": "Bernard", "gravatar_hash": "af29baa43e6e6f77180e631cea686847", "author_url": null, "date": "Jul 21, 2008", "message": "I think sounds good, so long as there is a way to get the absolute date."}, {"author_name": "Dave", "gravatar_hash": "15aef67943fcc80ff9cce03c47f597b2", "author_url": null, "date": "Jul 21, 2008", "message": "If you include non-relative time at all, and do not allow for users to enter their timezone/GMT offset, you will alienate a lot of people. Its not \"a slim chance\" that dates are off either. For example, until 4pm (ie, most of the working day) Melbourne is a day ahead of Denver."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": "http://blog.zygonia.net", "date": "Jul 21, 2008", "message": "I'd tend towards relative as well, unless you can show the time in my local time zone (and explain that it's in GMT+1 for example).\n\nNothing worse than hitting a site and there's no info as to what timezone is being used.\n\nIn fact....why not do both? May offer as options:\n\n  Show times in my timezone  [x]\n  Show times as relative too [x]\n\nMeans I have to think even less :)"}, {"author_name": "Brent Longborough", "gravatar_hash": "8d02b32645c7f2e9f5d250bda3e4fe71", "author_url": "http://None", "date": "Jul 21, 2008", "message": "Both; relative in the text, absolute in a tooltip.\n\nKUTGW"}, {"author_name": "John", "gravatar_hash": "d0b76ae7bf261316683cad31ba0bad91", "author_url": null, "date": "Jul 21, 2008", "message": "I am in the UK and when I post on a forum I always have to think is this GMT or not? \n\nThe first time I posted a response on this blog I thought the time I posted was not the time shown until I realized (It is now 12:10pm in GMT).\n\nSo I like relative time."}, {"author_name": "Lea", "gravatar_hash": "905613f686cb68a977cca9cd9fcf3fed", "author_url": "http://c3.ort.org.il/leketshibolim", "date": "Jul 21, 2008", "message": "I prefer absolute. I like to see exact dates. I feel a little out of control if someone is \"editing\" times for me... And I'm so used to absolute times that the “how old is this” math is automatic for me. \nBut I see that most of the people here prefer relative. I can probably get used to relative too, but maybe the tool-tip option would be a logical compromise."}, {"author_name": "Yoav", "gravatar_hash": "0ead30746ec2f1ea79cc733bb3782afd", "author_url": "http://www.onoff.co.il", "date": "Jul 21, 2008", "message": "Relative time is better. You can also add a \"title\" element to display the real/date time on hover.\n\n(Ahh, Brent already said that :-)"}, {"author_name": "Ryan O.", "gravatar_hash": "af0546272aeda330007d397b569a23c7", "author_url": "http://gimpson.multiply.com", "date": "Jul 21, 2008", "message": "Though I can't come up with a concrete example right now, I know I've been frustrated in the past by the lack of precision in relative time.  Usually it's if I need to know for some reason which of two pieces of old content was posted first.   \n\nProbably not a compelling enough reason to go with the ugly absolute times, but I definitely like the tool-tip option because at least you have access to all the precision."}, {"author_name": "Chris Johnson", "gravatar_hash": "64963f8edb22a0c35b5f3f4fdba80b67", "author_url": "http://www.chris-j.co.uk", "date": "Jul 21, 2008", "message": "Relative in the text, absolute in a tooltip is the way forward"}, {"author_name": "Sam", "gravatar_hash": "fdf8c5d204252b480b3c6548f50c95b7", "author_url": "http://sam.xnet.tk", "date": "Jul 21, 2008", "message": "+1 for the relative time + absolute as tooltip"}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Jul 21, 2008", "message": "&gt; In fact….why not do both? May offer as options... Means I have to think even less :)\n\nNo it doesn’t. It means you have to make a choice. You have to think more. Don‘t make me set an option for something as trivial as how the date of a post is displayed to me. Figure out something good, and stick with it.\n\nI like the relative-with-absolute-in-title-attribute. I think relative is nice, as the reason I look at the date on posts is to see how old they are. Thus relative makes me think less. Flickr does relative dates, and I like it there."}, {"author_name": "Rob", "gravatar_hash": "c290d3851c7837081d05b3491cbc331b", "author_url": "http://cantgrokwontgrok.blogspot.com", "date": "Jul 21, 2008", "message": "Another for relative with absolute in the tooltip! :D"}, {"author_name": "Daniel", "gravatar_hash": "37b021c09ebde73a4173d1a9528a6c1b", "author_url": "http://www.geekrant.org/", "date": "Jul 21, 2008", "message": "Recognising that I'm in the minority, but I dislike relative time. It causes problems when caching or quoting information elsewhere. Most of us are clever enough to mentally calculate if something is old or new based on absolute time."}, {"author_name": "Adam Haile", "gravatar_hash": "3a29aba7f7e68203d4265d5fcca46f53", "author_url": null, "date": "Jul 21, 2008", "message": "I vote for relative time.  Since you are obviously trying to make this site as \"low friction\" to use as possible, making people have to set up timezones, etc would counter that, as they would actually have to have an account...and most people forget to do it anyway."}, {"author_name": "fneep", "gravatar_hash": "706741398babfd77c96e124603cea239", "author_url": "http://fneep.fiffa.net/", "date": "Jul 21, 2008", "message": "Absolute is better but whatever you do, make it consistent. Don't use the 'yesterday' AND '21st July' like vBulletin does."}, {"author_name": "Glenn", "gravatar_hash": "99697456067f614849528136ec3639aa", "author_url": "http://blog.slaven.net.au", "date": "Jul 21, 2008", "message": "I've got to say both, I like the display relative with the precise date/time as a title.  Best of both worlds"}, {"author_name": "Uri", "gravatar_hash": "14713ee2777b96d3d35699874676e29f", "author_url": null, "date": "Jul 21, 2008", "message": "Relative time in the first few days (up to 3 days), and then switch to absolute date (date only, no time)."}, {"author_name": "Simon", "gravatar_hash": "b6b46de6460453b3cb6468af7e1ab58b", "author_url": null, "date": "Jul 21, 2008", "message": "I'll put a vote in for \"relative\"... seems to me to work better for everyone.  (tooltipped absolute could be useful, but might be worth highlighting which timezone the system thinks we're in!)"}, {"author_name": "Paul Annesley", "gravatar_hash": "f0b6cad84e199bbd863bf7459ff98870", "author_url": "http://paul.annesley.cc/", "date": "Jul 21, 2008", "message": "We had the same decision to make when building http://99designs.com/ and I wrote briefly about it here: http://www.sitepoint.com/blogs/2007/06/04/simple-date-and-time-localization-with-javascript/\n\nHere's the jist of what we decided:\n\n  * in markup, output dates in a GMT format readable by machines and humans.\n\n  * standardize on a \"microformat\" like &lt;span class=\"datetime\"&gt;...&lt;/span&gt;.\n\n  * allow additional classes to determine output format, e.g. class=\"datetime relative\" or class=\"datetime absolute\".\n\n  * use JavaScript to parse the timestamps into the browsers local time, and output them in the relevant format.\n\n  * When displaying relative timestamps (e.g. 1 hour ago), put the absolute timestamp in the title attribute for mouseover inspection.\n\nWe've found this has worked really well for us - has anybody else given it a shot?"}, {"author_name": "Saniul Ahmed", "gravatar_hash": "d070df533299d18926a873a7621d331a", "author_url": null, "date": "Jul 21, 2008", "message": "Use both.\nShow relative date, as it is easier to comprehend, but if the user wants more precision - show the absolute date in a tooltip when the user hovers the cursor over the date.\n\nTimezones - just allow the user to choose a specific one in the Settings/Options menu."}, {"author_name": "Pat Galea", "gravatar_hash": "2c82e601d6a0f9d57d53c450b398c826", "author_url": "http://dudegalea.co.uk", "date": "Jul 21, 2008", "message": "Relative is nice for a quick glance, but just occasionally absolute is genuinely useful.\n\nSometimes it is nice to know if there is a 'news' context for the comment. For example, the context of a post written on 9/10/01 is clearly very different from a post written on 9/12/01. You wouldn't be able to tell the difference if it just says \"seven years ago\".\n\nAdmittedly that's an extreme example. But it can happen with other things too, e.g. company takeovers, software releases etc.\n\nAs others have suggested, there's no reason to make the absolute date particularly prominent."}, {"author_name": "Chris Carruthers", "gravatar_hash": "1f67fa0a1d4f015ac9390727e81190fb", "author_url": null, "date": "Jul 21, 2008", "message": "What about displaying the relative date/time, but having the actual date/time as a mouse-over tooltip, in the user's local time zone? Obviously requires a bit more data, and probably time zone conversion on the client, but it's all I could want as a user."}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jul 21, 2008", "message": "I'm going to vote for absolute.\n\nFirst of all, you're going to get cached by Google, and other services. If, for whatever reason, the cache is old, then the relative dates are all completely useless.\n\nSecond, if I wanted to use an article as a cited source for something else, having the exact date that it was published would help the credibility of the citation. Also, if Stack Overflow ever decided to shut down, the exact date would allow my reader to try to find a cached version.\n\nThird, there's no real reason to throw away this data. You don't want to start with relative dates and then realize that you actually wanted absolute.\n\nI would just store everything in UTC time, and then offer to keep track of the users' timezones and adjust accordingly."}, {"author_name": "Chris Carruthers", "gravatar_hash": "1f67fa0a1d4f015ac9390727e81190fb", "author_url": null, "date": "Jul 21, 2008", "message": "Sorry for posting above what had already been said - I should have reloaded before posting! Anyway, consider it a seconding!\nTriggered by Pat Galea's comment - please PLEASE don't ever show dates in dd/mm/yy or mm/dd/yy format unless I've explicitly provided my preference, which I shouldn't have to bother to do - so don't ever show dates in that format! It's bloody frustrating for any non-US person, and is just plain ambiguous a lot of the time.\nAbsolute dates should also probably be shown with their time zone in GMT +/- notation, again to avoid ambiguity."}, {"author_name": "Sean", "gravatar_hash": "16db4bb794911afb2830e17e6c9d4702", "author_url": null, "date": "Jul 21, 2008", "message": "YES!  Please, by all means use relative times.  If you do go with absolute, it really only is useful to the user if you convert everything to the users time zone, which is absolutely unnecessary."}, {"author_name": "Dennis Kehrig", "gravatar_hash": "8836517222d65e4df1299d386f280bc7", "author_url": null, "date": "Jul 21, 2008", "message": "I'd put the absolute time into the HTML code and then switch this to a relative display with JavaScript, updating it at least every minute (otherwise \"1 minute ago\" kind of loses its meaning rather quickly, which is also the case if it's in the Google Cache) and keeping the absolute time in the title tag (as proposed by others) for reference.\n\nYou could also add a click handler to switch between relative and absolute display (like switching between passed and remaining time in Winamp), should someone want to copy the absolute time (which is not easily possible for tooltips).\n\nAn alternative to the title attribute approach would be to switch the display on mouseover.\nIf the default display is the relative time, this would make copy &amp; paste of the absolute time even easier than with the click handler (but of course you have to know this feature to even try).\nIf the default display is the absolute time, calculating the relative time would only occure on mouseover, thus removing the need to update frequently.\n\nIn any case, the absolute time should contain the seconds. Imagine somebody thanks for \"the quick answer\". When I read something like this, I always want to know what the author considered quick, so I need the exact time down to the seconds.\n\nWhile you're at it, you could adjust all time stamps to local time, which is much easier with JavaScript on the client than on the server."}, {"author_name": "Pat Galea", "gravatar_hash": "2c82e601d6a0f9d57d53c450b398c826", "author_url": "http://dudegalea.co.uk", "date": "Jul 21, 2008", "message": "@Chris\n\"Triggered by Pat Galea’s comment - please PLEASE don’t ever show dates in dd/mm/yy or mm/dd/yy format unless I’ve explicitly provided my preference, which I shouldn’t have to bother to do - so don’t ever show dates in that format! It’s bloody frustrating for any non-US person, and is just plain ambiguous a lot of the time.\"\n\nFunnily enough I'm a Brit myself, so I was just writing the date in mm/dd/yy for the benefit of our American friends. :-)\n\nNevertheless, you raise a good point. I use the ISO standard YYYY-MM-DD wherever I can because it's generally unambiguous. But something like \"12 Jun 2008\" would be fine too.\n\nmm/dd/yy dates on sites are confusing, not because they're different to my home usage, but because if it's an ambiguous date I'm often not sure whether the site has taken my regional preference into account or not."}, {"author_name": "Jivlain", "gravatar_hash": "cc4b382c9cf5750773e569859a0c205b", "author_url": "http://jivlain.wordpress.com", "date": "Jul 21, 2008", "message": "Personally, I'd prefer relative time and don't care whether the absolute time is included or not."}, {"author_name": "Peter Meyer", "gravatar_hash": "6785eaee66887fc14c8530a385bbf5c3", "author_url": null, "date": "Jul 21, 2008", "message": "Relative."}, {"author_name": "watt", "gravatar_hash": "42ad44db8efe1a2b5e5e9214b444c971", "author_url": null, "date": "Jul 21, 2008", "message": "Absolute time, please. I often look for precise year the comments were made - and it's annoying to have to compute it myself (is it 2005? is it 2006 now?). Also static date may be better for search engines (or caches) - I imagine it's weird to have date information change depending how many years later you revisit the question page."}, {"author_name": "Michał Minicki", "gravatar_hash": "8c2f61ef31acb821108dde64d672e39f", "author_url": "http://blog.aie.pl", "date": "Jul 21, 2008", "message": "Now, from a technical side. \n\nAbsolute dates are constant so you can easily cache them, as you don't need to regenerate a page very time user accesses it. \n\nThat's not the case with relative dates - you have to regenerate them every time relative time changes. And what's more important you have to regenerate in the periods (short times) which need caches the most. The most recent data gets hammered and the old articles get only occasional entries from search providers.\n\nAnd from usability side - if you need the date, then you probably need it to compare with some event. Did I work for my employer when the news hit the website? Did the patch emerged before or after the major release? Etc. You will never be sure with relative dates. But on the other had, they seem to be more \"eye\" friendly."}, {"author_name": "JPG", "gravatar_hash": "a58cf658f3479a68bc801348902f48bc", "author_url": null, "date": "Jul 21, 2008", "message": "I am in the UK and think that all time is my local time =&gt;.\n\nMay be there is an intresting happy point for the difference in time and the reading of post.\n\nUser Time/Server Time/Relative Time.\n\nUser Time and Server Time \n\nThis will help in getting across the delay factor in replies and answers.  I the customer want to know what timezone the best answer was in and if i have questions on the answer how long before likely reply.  \n\n\nRelative time is good for the feedback/badge system as this relating to how long the post/question/reply has been in existance.  \n\nSo if a question gets answered by a gold squidge with a TTL of question of necromancer then this is old news and I the questioner need to think about thinks - likely i solved it another way and need to look at the answer in relation to my solution set.\n\n.jpg \"i used to be an image,but i got refactored as XAML\""}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Jul 21, 2008", "message": "I'll vote for relative date if the post is recent (however you define recent--less than 1 month?).  For older posts show absolute date without the time.  And don't let people convince you to show the absolute date in an ugly, numbers-only ISO format!  Use the words, like \"Monday, July 21, 2008\" format.\n\nYou might also want to make relative date no more precise than the hour (for posts less than an hour, just put \"in the last hour\").  Showing the age in minutes seems kind of pointless because it gets old so fast.\n\nPS- Can you just use common English words in the captchas?  Also, a tactic I have found to be 100% effective in combatting spam on my own website is to create a comment submission form at the top of the page, which is hidden by CSS.  The spambots will try to submit the data using that form, but human users will never see it.  (My site gets pretty low traffic; maybe there are more sophisticated spambots out there that will avoid this tactic.)"}, {"author_name": "Graham Stewart", "gravatar_hash": "f61876d1f1d2de794259119cdd596316", "author_url": null, "date": "Jul 21, 2008", "message": "Relative is good for me.\n\nPlease also make the date (optionally) have an influence on the search results.\nEither as a factor of \"relevance\" or as an explicit search parameter.\n\nTypically when I search for something I am more interested in recent developments than a post from three years ago that I've probably already read.\n\nMSDN seem to suffer a lot from this (\"well here's how you would have done it in .NET 1.0, though that API is now obsolete\" - \"Gee thanks\")."}, {"author_name": "Doekman", "gravatar_hash": "b83de2466ffbd28e6493ee2fcd796978", "author_url": "http://zanstra.com/base/blog", "date": "Jul 21, 2008", "message": "@Jeff: I think you have a wrong perception of timezones. Ideally, timezone is presentation-data. Like you use a dot (10.5) as a decimal seperator, I use a comma (10,5). It's the same with timezones.\n\nSay, you post a message at 6:15am. I would like to see 2:15pm (or even better: 14:15). Because at 2:15pm in Amsterdam, in San Fransisco it's 6:15am).\n\nSo you probably need to include timezone information in the profile, whether you display time in relative/google-speak, or in absolute terms."}, {"author_name": "Joe", "gravatar_hash": "9f292b4d2ebd0b6ca38936fb5933d401", "author_url": null, "date": "Jul 21, 2008", "message": "I think relative works best. I also agree with kip in that older posts should show the date, seeing as how \"1 year ago\" on youtube is kind of ambiguous. who knows, maybe absolute dates could be helpful years down the road?"}, {"author_name": "chris", "gravatar_hash": "1ce04312daddc2060e9f6d87805cad2a", "author_url": "http://www.developingchris.com", "date": "Jul 21, 2008", "message": "Relative is good.\nMy convention is this, once it gets past a certain point, make a tooltip with the exact date, since time would be irrelevant at the 1 year mark, it can easily be omitted.\nFor me this is the best of both worlds in my apps, nice easy to read relative links, but precision for research with a simple hover."}, {"author_name": "dextar78", "gravatar_hash": "499656b6b5bbf03f6531120d29387826", "author_url": null, "date": "Jul 21, 2008", "message": "As some have said, I think overall relative looks better.\n\nI do see one problem using only relative: When viewing a thread that's say a month or a year old. The thread may have gone on for a day or so and contain quite a few comments/posts. The relative time display will always be the same and loose its context (ie: all comments will say '1 month' or '1 year' old).\n\nSo maybe in certain contexts, the time (or some other differentiator?) may be beneficial?"}, {"author_name": "Rex", "gravatar_hash": "3e9f1629fd4cb4a5ce9fbd27b13e862d", "author_url": "http://www.rexmorgan.net/", "date": "Jul 21, 2008", "message": "Definitely relative time. The precision of the date becomes less relevant as the distance from the date increases. It's probably several orders of magnitude less cognitive work to scan \"1 year ago\" than to parse a date, retrieve the current date from the brain and do some mental math on that data."}, {"author_name": "Martin Wallace", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Jul 21, 2008", "message": "I like relative when just browsing - as it gives a far better indication of age.\n\nHowever, if I am trying to work out the context of a post with reference to releases of patchs/software versions then absolute is a must.  '1 year ago' is not particularly helpfull if I am trying to work out if a particular post is referncing release 1.1 or 1.2 of the software it is talking about.\n\nNot too sure I have explained that too well, hopefully you get the drift."}, {"author_name": "Mike Firesheets", "gravatar_hash": "ccee5ebe78dcf7de6fe5ccde71344a46", "author_url": null, "date": "Jul 21, 2008", "message": "I'm putting in my vote for relative time as well. I once worked on a system that was required to show the full millisecond-resolution timestamp in the local time of the client, and it turned out to be a Javascript nightmare.\n\n@Martin Wallace - I totally get your drift, but I don't think that absolute time will solve all of the cases where a release/patch level is in question. There will be times where a poster hasn't upgraded a plugin weeks after a major bug release, etc. I think if the post doesn't give enough detail, most of the time other people are going to have to tease it out of the OP anyway."}, {"author_name": "Sean", "gravatar_hash": "caaaf05cd3770dd82548cf3ada462bf9", "author_url": null, "date": "Jul 21, 2008", "message": "I like the idea of relative time. However, it would be great if you could also see the exact time, somehow.\n\nPerhaps you could use a little javascript to allow the user to click on the time label \"5 months ago\" and it will add the exact date next to it. I only say this because it is VERY useful to have an exact date. If someone ever wants to reference your post on StackOverflow, then they simply MUST provide the exact date/time of that post. This is due to the focus on editing answers to fit the times.\n\nOr, it could be useful to have a user setting that defaults to relative time."}, {"author_name": "Eli Courtwright", "gravatar_hash": "bd42b746d79be5dd325a8e94bc00ac58", "author_url": null, "date": "Jul 21, 2008", "message": "Relative time is best, because the whole point of displaying a time is to tell the user how long ago something was posted.  So just tell them how long ago it was (in relative time) and don't worry about timezones and the like."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Jul 21, 2008", "message": "For things 3-6 days old, I really like relative dates like \"last Tuesday.\"  Just sayin."}, {"author_name": "Bart", "gravatar_hash": "328821a89e5d44278eed303575170cb8", "author_url": null, "date": "Jul 21, 2008", "message": "I think relative is just so much simpler in this case than trying to resolve all the timezone issues. And like you said, who cares the exact date a post was left? When I look at a post I want to know how current it is. So relative works best in this case."}, {"author_name": "Justin Bennett", "gravatar_hash": "421597da2c2a5f9cdaab8fa700435caf", "author_url": "http://jmbennett.org", "date": "Jul 21, 2008", "message": "I agree with most of the other commenters... use relative time but include the absolute time in a tooltip or something in case someone wants to know.\n\nI also think that just using GMT is sufficient (you'll have to convert dates and times from the server's timezone, but you won't have to do it differently for each user).  I think just about all of us know what our timezone's offset is from GMT."}, {"author_name": "Weeble", "gravatar_hash": "3ac5db3768c09788ed9fe03c5f4ff171", "author_url": null, "date": "Jul 21, 2008", "message": "Whatever you do, if you are displaying absolute times, always display them with a time zone. I hate it when sites tell me times and I don't know what time zone they're using. Even worse is when they say \"local time\" (Livejournal, I'm looking at you), and I'm left wondering: local time for the poster? for the server? for me? for where the server thinks I am?"}, {"author_name": "Justin Bennett", "gravatar_hash": "421597da2c2a5f9cdaab8fa700435caf", "author_url": "http://jmbennett.org", "date": "Jul 21, 2008", "message": "On second thought (as I read through more of the other comments), relative dates are sufficient for the first few weeks and then beyond that, have the relative time displayed but make the exact date available as a tooltip (or however you want to display it).  Exact time of day is not relevant after a few weeks have gone by, but certainly the exact date could be helpful in some cases.\n\nMy vote: relative dates with the exact date displayed in some fashion once the post has reached some predetermined age."}, {"author_name": "Bill", "gravatar_hash": "413ef976f0d2ca993005c9aee4769254", "author_url": "http://bhael.livejournal.com/", "date": "Jul 21, 2008", "message": "I agree with Mike Tomasello. Display the relative time in a span and put the GMT absolute time in the title attribute."}, {"author_name": "Mr. Shiny &amp; New", "gravatar_hash": "d78a43ac94c1c0d6cf5740efd7574928", "author_url": "http://eternalephemeron.blogspot.com", "date": "Jul 21, 2008", "message": "Absolute time is better.  Everyone can do date-math, especially everyone who is reading content on a software development website.  But knowing the exact date something happened is very useful: I can refer to that date (I.e. \"your comment posted July 20th\") and I can, later on, correlate that date with other events.  Anyway, for a site like this one, which will likely use Javascript a lot, it'd be easy enough to replace the date content with a user-specified format on the client side.  Heck, even if you don't provide that feature you can just give the dates valid HTML class names and then Greasemonkey can do the rest.\n\nJust remember to store all dates in UTC in the database.  I'm working with a database where the dates are stored in the local timezone, which is madness and causes problems when DST begins/ends, but that design decision was made years ago and it's too late to fix it.  Sigh."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": null, "date": "Jul 21, 2008", "message": "Show both relative and absolute.  Manipulate the absolute UT date with client-side javascript to convert to the visitor's time zone and format."}, {"author_name": "Terrapin", "gravatar_hash": "6b89ab6fe40aeae63df5509238078bcb", "author_url": "http://terrapinstation.wordpress.com", "date": "Jul 21, 2008", "message": "Relative with absolute tool tip.\n\n@Jeff B:\n&gt; \"...please use JavaScript to convert it to the viewer’s local time zone...\"\n\nWHY??"}, {"author_name": "Josh", "gravatar_hash": "4a3644f49db41a7d7f42b4c679e7864c", "author_url": "http://insidethemachine.wordpress.com/", "date": "Jul 21, 2008", "message": "I think absolute time is a necessity.  As watt said, \"static date may be better for search engines (or caches).\"\n\nI occasionally include a year or month in my searches so I know I'll get results from that particular year or month. So I might add \"July 2008\" to a search, but I'm not going to add \"17 days ago\".  Using absolute dates lets me add \"July 2008\" to a search - a constraint that's not too specific and would include everything from the month of July.  It's more likely that I'd remember something was written in July 2008 than that I'd remember it was written 17 days ago."}, {"author_name": "Mythokia", "gravatar_hash": "bb885d417951dd88f2dfb55f5cad17e1", "author_url": "http://blog.mythokia.net", "date": "Jul 21, 2008", "message": "I second relative with absolute in tooltips too. I doubt I'll need to know the exact time of posting for most of the articles. Also, I fall into the minority of people that's usually a day ahead, but I've been able to convert PST/EST/GMT to my local time mentally from the playing of MMOs."}, {"author_name": "Eldila", "gravatar_hash": "b38c03070e5322a669332fe98e608d52", "author_url": "http://jkwiens.com", "date": "Jul 21, 2008", "message": "I didn't get a chance to read all the comments, so this might have been said before. I would go with relative, but put the absolute date in the Title attribute. This would be an invasive way of showing the precise date if it is needed for some bizarre reason."}, {"author_name": "Eldila", "gravatar_hash": "b38c03070e5322a669332fe98e608d52", "author_url": "http://jkwiens.com", "date": "Jul 21, 2008", "message": "I guess I should have read the last comment at least :S"}, {"author_name": "paulo", "gravatar_hash": "3712cd4b895249e1fd22288c3a66fa62", "author_url": null, "date": "Jul 21, 2008", "message": "It would be cool if you could put it in light years ! \nThat would be universal enough... : )"}, {"author_name": "paulo", "gravatar_hash": "3712cd4b895249e1fd22288c3a66fa62", "author_url": null, "date": "Jul 21, 2008", "message": "yes i know... a light year is a unit of distance not time :S"}, {"author_name": "Howard", "gravatar_hash": "4fc0a58aebebcd75b8278f11fe42f5fc", "author_url": null, "date": "Jul 21, 2008", "message": "I tend to open lots of pages in the morning and get to reading them throughout the day. When I get to a page, it saying \"about an hour ago\" doesn't help me at all, unless you have javascript to update the relative date.  If if you do, I won't be able to tell if you update it for me or not and will have to refresh the page anyway. Absolute times don't need to change after a page has been loaded.\n\nAlso I've never seen a search with a date range feature that let me say \"about a year ago\". I agree I'm more likely to remember to search for something in July."}, {"author_name": "Adam", "gravatar_hash": "83d5fb4c3fe568ae6952e134ade54aef", "author_url": null, "date": "Jul 21, 2008", "message": "I would be fine with either, but it is possible to have it as an option?"}, {"author_name": "Matt Miller", "gravatar_hash": "d7ca2c0b4006b65ff1373c5729f1d9a0", "author_url": null, "date": "Jul 21, 2008", "message": "Relative is better. Absolutely ;)"}, {"author_name": "brad dunbar", "gravatar_hash": "0168f51cd822a820c606c259b80e253f", "author_url": null, "date": "Jul 21, 2008", "message": "I love relative dates, and since you guys are using JQuery I recommend you check out John Resig's prettydate at the following url for doing this on the client.  (That way the absolute date is in the markup and it degrades really nicely.)\n\nhttp://ejohn.org/blog/javascript-pretty-date/"}, {"author_name": "Sean Patterson", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Jul 21, 2008", "message": "Without sounding like I'm riding the fence, I think it is going to depend more if you're looking to keep these threads over the long haul or not.\n\nFor posts made within the current week, relative time is great because you get a better feel if the post is active or not (multiple posts with \"posted a few seconds ago\" always looks kind of nice).\n\nBut for long term archiving and viewing, the absolute date is much nicer.\n\nSo which way are you looking to focus things?"}, {"author_name": "Wade", "gravatar_hash": "f64455ffa7e514b5c838364f96844630", "author_url": null, "date": "Jul 21, 2008", "message": "Another vote for the relative + absolute in title.  Works well for me!"}, {"author_name": "McDowell", "gravatar_hash": "cf02ac6dae1a5494913e0c0c9d9956d7", "author_url": "http://illegalargumentexception.blogspot.com/", "date": "Jul 21, 2008", "message": "I prefer absolute dates. Precise information is just more useful.\n\nOne thing some sites neglect is in making clear what format the date is being displayed in and the timezone offset. Because practices vary, the format must be unambiguous. Otherwise, the user doesn't know if the site has formatted the date for their locale or whether the developer was just ignorant of the need to do so."}, {"author_name": "BCS", "gravatar_hash": "6757caf55de0413ae0994293e001d465", "author_url": null, "date": "Jul 21, 2008", "message": "Relative for anything under some limit (~30 days?) absolute after that. The thought being if it's more than X time old I'll care more about when it was relative to other events (the release of version N of the Baz library) than exactly how old it is.\n\nOTOH why not throw in both?"}, {"author_name": "Miguel Crispin", "gravatar_hash": "477eaf9bca1eaaa968504d34263ec986", "author_url": null, "date": "Jul 21, 2008", "message": "Default: Relative with absolute in a tool tip.\nAnd let the user decide in his/her profile which format prefer to see in tool tip."}, {"author_name": "Terrapin", "gravatar_hash": "6b89ab6fe40aeae63df5509238078bcb", "author_url": "http://terrapinstation.wordpress.com", "date": "Jul 21, 2008", "message": "I'm surprised that you're going to this level of design detail for the private beta.\n\nCome on, we're all itching to have a look. Isn't this a detail you can work out later?"}, {"author_name": "Mark Struzinski", "gravatar_hash": "ed7dec07c571e2c32e8aa536ad31dca3", "author_url": null, "date": "Jul 21, 2008", "message": "I say relative time. The exact Date/Time is not useful, as long as you have an approximate reference to how stale the question might be. I say this because if a question was a year old, there may be an easier way (now) to answer the question because of updates to the language, etc."}, {"author_name": "Rytmis", "gravatar_hash": "3606c9163c6842aff3827a609fa4e217", "author_url": "http://blog.rytmis.net", "date": "Jul 21, 2008", "message": "+1 Relative"}, {"author_name": "Justin Standard", "gravatar_hash": "c365ed343f89a04c216d6bb22043bc9c", "author_url": null, "date": "Jul 21, 2008", "message": "I think relative times are better for the readability reasons you cited in the post.\n\nMaybe you can include a way to get the original absolute time as well (though don't display it by default) like a javascript rollover or something.  That way if someone REALLY wants to see the actual absolute time (relative to the timezone of the server) then they can."}, {"author_name": "Jesse Dearing", "gravatar_hash": "ac32e9f15e9bc8f79a1ca4806b8cd760", "author_url": null, "date": "Jul 21, 2008", "message": "Whenever I look for dates in information I just care about knowing how \"stale\" the information is anyway, so my vote is for relative as well."}, {"author_name": "Eugene Katz", "gravatar_hash": "6b8e59e3f68ce65c940a9ad8816e52b8", "author_url": "http://komradekatz.com", "date": "Jul 21, 2008", "message": "If you make sure that print mode uses absolute, then relative is fine.  I don't want to make sure that the printout contains a timestamp and then do math."}, {"author_name": "Eugene Katz", "gravatar_hash": "6b8e59e3f68ce65c940a9ad8816e52b8", "author_url": "http://komradekatz.com", "date": "Jul 21, 2008", "message": "Also, in some cases \"Three years ago\" may not be accurate enough when trying to figure out which version of SharePoint or iPhone the post is talking about.\n\nRelative is good most of the time.  If there was an easy way to get the absolute (mouseover?), relative is file.  And I don't want to have to go to the individual pages from the search results to find out."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Jul 21, 2008", "message": "This is unrelated to this post, but I know you read all the comments.  Can you please make permalinks to comments on this blog work?\n\nWhen you print the timestamp for a comment, right now you do it like this:\n[a href=\"#comment-3370\" title=\"\"]timestamp[/a]\n\nAll you have to do to fix it is print it like this:\n[a href=\"#comment-3370\" title=\"\" name=\"comment-3370\"]timestamp[/a]\n\nJust add the name field to the link."}, {"author_name": "Daniel Pihlström", "gravatar_hash": "7ff41f7ec72bfd6b799b93d003648907", "author_url": "http://www.sciolist.se", "date": "Jul 21, 2008", "message": "Hmm while I can see to some degree why you'd want relative datetime (it looks prettier, i suppose).. I don't really see much purpose in it.\n\nI think I'd vote for absolute, in UTC time.\nI don't think it's orders of magnitude more difficult to parse \"3 years ago\" into being 3 years ago, than parsing \"2005\" into being 3 years ago.."}, {"author_name": "John Lawson", "gravatar_hash": "2d8ec7d21d76283c4de46d19adb9ecdd", "author_url": "http://erator.blogspot.com", "date": "Jul 21, 2008", "message": "I would have to say BOTH:\n\n6 minutes ago (07/21/08 10:30a)\n\nThe date in parenthesis could be dimmed (as in gray or silver on white background).\n\nMy 2 cents."}, {"author_name": "John Millikin", "gravatar_hash": "4acd21acc7b1f605466f2f48189a7177", "author_url": null, "date": "Jul 21, 2008", "message": "I prefer relative time for intervals less than a day (\"five hours ago\"), or perhaps less than a week (\"6:03 last Thursday\"), but as the delta increases so does the inaccuracy.\n\nAs for the UTC/local debate, most sites have an option for the user to enter their preferred timezone on registration. This isn't perfect -- for example, if a user travels across zones then the displayed time will no longer match local time -- but such issues I consider unimportant. Assuming the server stores timestamps in UTC, it's always possible to display something reasonable to a human."}, {"author_name": "Roland Tepp", "gravatar_hash": "0f83be58c6c968f558b2cfda93183f28", "author_url": null, "date": "Jul 21, 2008", "message": "Use relative dates in front page and listings or search results of questions with absolute date in tooltip. The information \"3 days ago\" is much more informative in this case than anything else.\n\nHowever, when displaying individual question/articles posts, use absolute dates.\n\nAlso - when article passes certain point in time, I'd prefer to see full date instead of \"2 years ago\". At about 1 year old, the exact dates start to gain meaning again.\n\nWith relation to the user timezones in absolute time I'd recommend a trick - in the raw HTML just spit out full date in the timezone it was stored (your server timezone, presumably) and replace it with user timezone value using javascript at client side."}, {"author_name": "Nick Ohrn", "gravatar_hash": "b7925f7e50bee39554315103a24892a9", "author_url": "http://nickohrn.com", "date": "Jul 21, 2008", "message": "I'd say relative times are better.  I don't really care exactly when something was posted as long as I can get a general idea of when it was posted."}, {"author_name": "Tomi", "gravatar_hash": "be51792eeb9c77fbe8fb3499ee4bfe1b", "author_url": null, "date": "Jul 21, 2008", "message": "I second Dennis Kehrig's proposal of having the absolute times in the HTML and converting them to relative using JavaScript on the client, as well as click-to-switch. I think this is the best of both worlds, and makes the relative times make sense (\"6 minutes ago but when was 0 minutes ago?\")."}, {"author_name": "Amr", "gravatar_hash": "bd05987c96cc061f538ee47374f2d705", "author_url": "http://www.amreldib.com", "date": "Jul 21, 2008", "message": "Jeff,\nI love your attention to details man, really looking forward for the public beta (there is a public beta, right?).\nAnyway, about your question, I like the way Gmail is handling the dates on the mail. It's like this\nJuly 19 (two day ago)\nThey provide the date and relative time and they drop the year because it's the same year. Another example\nJuly 6 (three weeks ago)\nThey drop the number of days from the relative time since it doesn't really matter. The purpose of the relative time is to provide a sense of how old is this post like when someone is saying \"I think they fix it in the last service pack\", so you run and get the latest service pack and install it and nothing happened because this post was in\nWednesday, March 22, 2001, 12:54:24 PM (EST)\nOf course, it's easier to try installing the service pack than to read this date. People don't need the exact nano-second the post was posted. They need a round figure of how old it is. Because in two seconds they're gonna forget that information anyway.\nSo I think you can do it like Gmail, that would be a popular choice. It's a little more coding to do because you have to figure out what unit to drop at each situation but it's totally worth it.\nAlso, you can always leave it to the user to choose which way to display the post time (for those users who are logged on)."}, {"author_name": "Ben Richardson", "gravatar_hash": "456c9cc0e9a40518bb0976b1bf161cd4", "author_url": "http://www.freshview.com", "date": "Jul 21, 2008", "message": "Relative for the first month and then absolute."}, {"author_name": "Martin Wallace", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Jul 21, 2008", "message": "Just to add to my last comments.\n\nI'm inclined to relative, but for older posts does it really matter about ensuring they are presented with time zone correction.\n\nIf I am viewing something that is a few months old I'm probably not interested in the time at all - just the date.\n\nSo I would say, relative for anythng under a week, absolute date, without time for anything older."}, {"author_name": "MR", "gravatar_hash": "609b8bc7701f27241451d315ca1c4597", "author_url": null, "date": "Jul 21, 2008", "message": "I would definitely prefer absolute, my forum lurking habits tend to use dates to determine new content. In this way i don't need to remember titles to posts I found useless, I just look at the date and it tells me if I read it or not. Where as with relative dates, it's harder to tell if I've read it considering the non-static...ness of the time."}, {"author_name": "Eric Haskins", "gravatar_hash": "d23fc7a4a2452a880efbf87061b0d678", "author_url": null, "date": "Jul 21, 2008", "message": "I prefer absolute. I would default to one, but have the other available as a setting in the user's profile."}, {"author_name": "Jim McKeeth", "gravatar_hash": "e5ca3abec062f8174570a4b1d1c840d8", "author_url": "http://www.davinciunltd.com/", "date": "Jul 21, 2008", "message": "I prefer relative for recent and then absolute for older.  Although a hybrid where they are both displayed would work for me too."}, {"author_name": "Paul Henry", "gravatar_hash": "e689f710ca901a0665a5e0f459d28a42", "author_url": null, "date": "Jul 21, 2008", "message": "I can think of quite a few reasons why absolute dates would be preferable to relative dates. To pick one rather vivid example, if I come across a post that seems rather... dubious, \"Posted April 1, 2005\" is illuminating in a way \"Posted three years ago\" would not be, I'm sure you'll agree.\n\nOn a more mundane level, if I encounter a post describing the features of AmazingProduct 1.0, it would be nice to know if it was posted after the product was released (in which case the poster might know what s/he's talking about) or before (in which case s/he's probably just cribbing from an article or a press release)."}, {"author_name": "Mário Marinato", "gravatar_hash": "218c63deafbad65752fb5ee4a3971dea", "author_url": "http://www.osarcofago.blogspot.com", "date": "Jul 21, 2008", "message": "Relative dates, please.\n\n-\nMário Marinato, from Brazil"}, {"author_name": "Arron", "gravatar_hash": "a31c67f29ac59ea5676387c81467c993", "author_url": "http://www.unkwndesgin.com", "date": "Jul 21, 2008", "message": "I'm going to cast another vote for using relative time with the absolute available via a tool tip.\n\nIf you don't go with this method at least make the option to see the absolute time available."}, {"author_name": "Ray", "gravatar_hash": "862ef90b81f9d7f365c85d8173d54beb", "author_url": null, "date": "Jul 21, 2008", "message": "Definitely relative.\n\n\"the odds of your time zone being in a completely different day from the server’s time zone is fairly slim.\"\n\nWell, for me they're pretty high, since I'm in New Zealand. And let me tell you, absolute dates that don't take into account the users timezone are really really annoying."}, {"author_name": "David H Aust", "gravatar_hash": "dab8cbf9615baf353220db4aea3b9a9f", "author_url": null, "date": "Jul 21, 2008", "message": "Go the relative dates.  We're all supposed to be smart people but any reduction to the cognitive load is a bonus.  But it will be interesting because, from what I understand, the posts will be in order of relevance/votes, not chronological.  Will it work well to have '3 months ago' listed above '12 minutes ago' listed above '3 days ago'?   And please don't make the same mistake as the asp.net forums where the users 'joined' date is almost more prominent that the date of the post."}, {"author_name": "Justin Yost", "gravatar_hash": "83149adc0e0366baebe19fcaed5f7996", "author_url": "http://www.yostivanich.com/", "date": "Jul 21, 2008", "message": "Repeating the theme and going to say relative."}, {"author_name": "Clay", "gravatar_hash": "7943b9a20a54f385cbd62736ab0e8659", "author_url": null, "date": "Jul 21, 2008", "message": "I say both, but perhaps with the absolute date (GMT) in smaller print.  Everyone should know how to translate GMT to local time."}, {"author_name": "lomaxx", "gravatar_hash": "a0074ad2db0d7f1e1acc58c7e2f789d9", "author_url": "http://blog.pnbconsulting.com.au", "date": "Jul 21, 2008", "message": "+1 for relative"}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://robspges.net", "date": "Jul 21, 2008", "message": "+1 for relative time reporting. When I hit a blog post, or any article online really, the first thing I want to see is how old the information is. Dates are nice, relative is better."}, {"author_name": "Bryan", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": "http://quux.tumblr.com", "date": "Jul 21, 2008", "message": "Absolute, for the many reasons already posted. Relative looks good for a short while and becomes more useless as time goes by.\n\nThe idea of 'relative with a hover-over showing absolute' kind of horrifies me. I imagine someone quoting 'the entry on April 12 at 3 PM' and me having to hover over 20 or 30 relative-time thingies to find that post ... and I become a sad panda. Or worse, someone quoting 'the entry that's 7 hours old' ... that way lies madness.\n\nBoth, or settable by user pref, would be better I think. It does appear there are a lot of people who like the relative time idea, though I cannot fathom it anymore. I did once think it was a good idea. Then I worked in a ticket system which used the 'relative with hover-over absolute' plan, and within a few weeks I realized the problems of that. For me anyway, it was a sounds great, works not-so-great kind of thing."}, {"author_name": "Ed M", "gravatar_hash": "e6fc03b5707ca3537be3cf6734d0fc06", "author_url": null, "date": "Jul 21, 2008", "message": "What you have is right on.  The variable precision relative dates are the way to go."}, {"author_name": "Omar Shahine", "gravatar_hash": "1ccc0cc0f53a2b505e37932c861246b9", "author_url": "http://www.shahine.com/omar", "date": "Jul 21, 2008", "message": "+1 for Relative. Dates in forum posts etc are generally useless."}, {"author_name": "brian", "gravatar_hash": "7eb788f6132eac5f7b8ca5b43924ad42", "author_url": null, "date": "Jul 21, 2008", "message": "Relative  only\n\nAbsolute dates are noise.  You will be saving a lot of brain power on the part of your users."}, {"author_name": "Pioneer", "gravatar_hash": "51aa209f8afe4bdead8c86868c447915", "author_url": null, "date": "Jul 21, 2008", "message": "Both, please."}, {"author_name": "Josh Parris", "gravatar_hash": "92f446269f65ef4213e94bd99aa3e475", "author_url": "http://parris.josh.com.au/", "date": "Jul 22, 2008", "message": "tl;dr \n\nI think phpBB gives users the option of what format to get an absolute date in, timezone, field order and everything.  When in doubt, make it configurable; or as a boss of mine used to answer when I'd give him two mutually exclusive implementation options: \"both.\"\n\nIt's just a matter of how to find a way of doing both.\n\nNow, if you're asking what the default ought to be, for non-logged in users, that's a different kettle of fish.  An absolute date format that's parsed and converted to local time using browser-side JavaScript manipulating the DOM seems pretty nifty to me: you get to provide something Google can read, plus you get to use information the browser has, such as local timezone.\n\nI re-iterate that as a logged in user, I care and want to be able to change my setting.  \n\nAs a not-logged in user, go with whatever you feel is best; if people don't like it then ought to be able to log in/manage their session and get the power to control that."}, {"author_name": "John", "gravatar_hash": "d0b76ae7bf261316683cad31ba0bad91", "author_url": null, "date": "Jul 22, 2008", "message": "I think a timezone option is important to allow the users to see the time that means something to them."}, {"author_name": "Mike Minutillo", "gravatar_hash": "1698b8b4000cf7209475320a5b73ef53", "author_url": "http://wolfbyte-net.blogspot.com", "date": "Jul 22, 2008", "message": "Maybe it's just me but I'd consider going for: \n\n* Question in Absolute Date\n* Answers in Question-Relative time\n\n\"Q: How do I kill the Wumpus? (August 2007)\n A: You can find it by it's smell (2 months later)\n A: Not sure but if you do kill it it'll scream (10 minutes later)\"\n\nActually looking at that written down it's confusing but I'm sure it can be imporved. Just an idea anyway. The \"relativeness\" is more important to the question than the current timeframe isn't it?"}, {"author_name": "Peter Orum", "gravatar_hash": "31706f10be1575981765a9a52e5daad2", "author_url": "http://www.peterorum.com", "date": "Jul 22, 2008", "message": "I think relative dates are a must. It's so annoying here in Sydney to see dates that are 15 hours behind - who knows when that is. Also, wherever absolute dates are displayed, use the format 12-jul-2008, not 7/12/2008. In Australia, and perhaps Europe &amp; Japan, 7/12/2008 reads as 7 december."}, {"author_name": "Bruce M. Axtens", "gravatar_hash": "36b1d9cba62a472800eda6d550485d4b", "author_url": "http://codeaholic.blogspot.com", "date": "Jul 22, 2008", "message": "I second Peter's comment re dates and times. I'm in Perth, Western Australia, and I often find the mm/dd/yyyy problematic. \n\nKeep overflowing the stack!"}, {"author_name": "Ceb", "gravatar_hash": "259814d4507d09b600fc132e352fbcc2", "author_url": null, "date": "Jul 22, 2008", "message": "Another one for relative with absolute in title text, and please go for unambiguous dates.\n\ndextar78 says:\n\"The relative time display will always be the same and loose its context (ie: all comments will say ‘1 month’ or ‘1 year’ old).\"\n\nOne way of handling this is have all of the comments display a relative time to the original post, such as:\n3 Days ago: [question]\n1 hour later: [answer]\n3 hours later: [another answer]\n\nI'm well aware that this is not entirely perfect either (3 hours later than the previous answer or the original question?), but it's a suggestion I'm sure someone can improve upon."}, {"author_name": "Ceb", "gravatar_hash": "259814d4507d09b600fc132e352fbcc2", "author_url": null, "date": "Jul 22, 2008", "message": "After a bit more thought I think it could probably be made clear by the design that the [time] later is in relation to the original post. I don't see any real benefit from having it relative to the previous comment."}, {"author_name": "Thomi", "gravatar_hash": "d07ab78a88fa4626baea08d39e5d5d2c", "author_url": "http://tech-foo.blogspot.com", "date": "Jul 22, 2008", "message": "How about both? \n\nFirst post with an absolute time, and subsequent replies with a relative time to the first post?\n\nOr, even better - why not let the user decide? Surely it can't be too hard to make this a configurable user option?"}, {"author_name": "Serhat", "gravatar_hash": "5201af5d797f49f55d59a0485fd8023b", "author_url": null, "date": "Jul 22, 2008", "message": "Relative is best. Better than the best, use absolute for posts further than a week."}, {"author_name": "John", "gravatar_hash": "30f6b34f9171edcaec2a4433968e8208", "author_url": null, "date": "Jul 22, 2008", "message": "I would have to agree that both relative and absolute dates should be available on the page.  Put the absolute date/time into a footer on each post, and the relative date/time more prominently above the post.  Perhaps place the absolute date in GMT into the HTML of the page for caching and future searching purposes.  You could then use JavaScript to convert that to the browsers local time for display, and use the same GMT date to update the relative date based on the date/time in the users browser...\nIn other words, if you place the absolute date in GMT into the page code, you can use some fairly simple JavaScript to change it to the users local time and a relative date."}, {"author_name": "mdy", "gravatar_hash": "82d287dc21555e439295cd924c9f3d3d", "author_url": "https://twitter.com/mdy", "date": "Jul 22, 2008", "message": "+1 more for displaying relative time and making absolute time available via tooltip. (Both Twitter and GetSatisfaction do this too, fwiw)."}, {"author_name": "Stephen", "gravatar_hash": "3454ee98fcec27e45888f291d90539da", "author_url": null, "date": "Jul 22, 2008", "message": "Rough relative time under the name, then maybe when you hover over the relative time, the exact time (including gmt offset) appears as a tip?\n\nThis way you get both details over the user, and also at least tell the user which timezone those times are regarding."}, {"author_name": "Eric Kibbee", "gravatar_hash": "2b568071163c0d009635cfa63cf6e6ac", "author_url": "http://www.kibbee.ca", "date": "Jul 22, 2008", "message": "I would have to say that it should be user selectable. It's not that hard to write code at the presentation layer that displays the date based on user preferences.  It's a lot like the pidgin debacle.  Should the message typing area be small, large, resize itself, or let the user resize it?  Just let the user configure it so that it's comfortable for them.  Otherwise half the users will end up being unhappy with the results."}, {"author_name": "jdecuyper", "gravatar_hash": "21ae3e5f2968bc957b7a6fa709bea2a0", "author_url": "http://www.jdecuyper.com", "date": "Jul 22, 2008", "message": "Relative in the text &amp; absolute in a tooltip."}, {"author_name": "Telcontar", "gravatar_hash": "2e4370b1aedee8c3fbaacfcb7519f16e", "author_url": null, "date": "Jul 22, 2008", "message": "Relative if the post date is &lt; than a week from now and all the visible post are ordered by date, absolute otherwise"}, {"author_name": "Ben", "gravatar_hash": "8fb95bde97cca5563771aafb7eeeab01", "author_url": null, "date": "Jul 22, 2008", "message": "Relative is better, but put a tooltip with the exact date for convenience."}, {"author_name": "Niloc", "gravatar_hash": "0b8725bdea9720ca6e93c2d61ebe2b6f", "author_url": null, "date": "Jul 22, 2008", "message": "What about having a preference so the users can choose either one?\n\nHowever, if you have to pick one, I would say relative would be my choice."}, {"author_name": "charles", "gravatar_hash": "9aff0ab28f208573faa80d2cbd19ccfd", "author_url": null, "date": "Jul 22, 2008", "message": "I hate the relative time stuff. Sure, you might have to do the really \"hard\" math of figuring out how long agao \"June 6th, 2001\" was (is this really hard?). But the more annoying math is \"Posted 986 days ago.\" \n\nUsually when I'm looking at those times I want to know year and whether it was fall, summer, november. That way I can quickly figure out what products were out that time, technologies, so on and so forth. \n\nWhy not use UTC? It would be fairly trivial to have a setting that allows users to have either relative or specific dates. I'd be fine with relative by default if I could change it."}, {"author_name": "Swinders", "gravatar_hash": "a86fdcf4ab3fbac57de10cb1014f6777", "author_url": null, "date": "Jul 22, 2008", "message": "Relative dates sound good but I've always seen absolute and not had problems with them. One thing I do find confusing is also having a 'member since' date which gives you two date to think about."}, {"author_name": "Chris O.", "gravatar_hash": "24c30bf2d9884846fdd5dcbd960051e6", "author_url": "http://seattlesoftware.wordpress.com", "date": "Jul 22, 2008", "message": "Store all dates as myDateTime.ToUniversalTime(), which is UTC. Forget the headache of using CultureInfo to customize dates for each website visitor based on geography."}, {"author_name": "LI", "gravatar_hash": "60cfec2810052072c0731a0e5bf12370", "author_url": null, "date": "Jul 22, 2008", "message": "Relative with increasing increments similar to Outlook.  For example:  5 minutes ago, 4 hours ago, 3 days ago, 2 months ago, 1 year ago."}, {"author_name": "isaac", "gravatar_hash": "d6bf7bcbf035deb752f73ebf62978585", "author_url": null, "date": "Jul 22, 2008", "message": "Include the timezone if using server absolute time. I live in New Zealand, so I'm almost always a day ahead of any website I visit. Also specify the timezone as -/+ UTC, as zones like 'EST' can also be Australian Eastern time."}, {"author_name": "Kyle", "gravatar_hash": "54b10a0a6ae3cd65201fc3bc3c4ed492", "author_url": null, "date": "Jul 22, 2008", "message": "Not to sound rude, but who cares? It's not like its that hard to do either one, and if you think people will really care one way or the other, make it an option. I am looking forward to stack overflow, but seriously, spending the time to look at a minor issue like this in depth and write up a blog post seems like a waste of effort that could have gone into something more important."}, {"author_name": "Frances", "gravatar_hash": "119a4a4d15bd6101c19fcd0cca47c667", "author_url": null, "date": "Jul 22, 2008", "message": "Either use relative time, or allow your users to set their time zone, and display the DateTime according to that."}, {"author_name": "aib", "gravatar_hash": "b0cd96e85f7e75a113e37f0fec7b39fb", "author_url": null, "date": "Jul 23, 2008", "message": "Relative time, absolutely!\n\nI've wasted too many precious brain cycles trying to calculate dates, and most of the time the result is incorrect anyway.\n\nThat being said, you can't exactly remove absolute date information. I'd like to see something along the lines of:\n\n2008/07/23 09:30 [GMT] (three minutes ago)\n\nWhy would having a timezone preference alienate users? Given it's not asked at signup time, I could do with a customizable timezone (or date format if the default is not ISO):\n\n2008/07/23 12:33 [GMT+2] (less than a minute ago)"}, {"author_name": "ninuhadida", "gravatar_hash": "f5fa73ad4f347c73145d5466332c7286", "author_url": "http://www.ninuhadida.com", "date": "Jul 23, 2008", "message": "Personally I prefer absolute dates. Although it's \"easier\" for humans to just read a relative date, I don't see the major advantage of displaying relative dates, especially when you want to compare two comments.. For example:\n\ncomment 1: \nRelative: Posted last year\nAbsolute: 1st Jan 2007\n\ncomment 2:\nRelative: Posted last year\nAbsolute: 2nd Feb 2007\n\nIf I need to make a reference to something, like an event that happened last year (let's say, 15th Jan 2007), I don't know if the comments 1 and 2 were posted before or after the event because all I know is that they were posted last year and I don't know the exact date so that I can figure out if the comment was posted before or after 15th Jan 2007. \n\nSounds a bit clunky, but after some time using relative dates, I started having problems with what I just mentioned.\n\nAlso, to display local time for a particular timezone, it's simple, really. You don't even need to store a timezone for each user in the database either.\n\nHere's how I worked it out, on my site. Create a cookie on the user's computer, storing the offset in minutes between the user's timezone and GMT 00:00. (I did this with javascript). Then, using a server-side language (PHP in my case), I found out the offset between the server and GMT 00:00 (using date('Z'); ) and then I worked out the difference between the two. Then when I want to display a date (absolute dates in this case), I just subtract the total offset (i.e. server-client) from the timestamp that I just retrieved from the database.\n\nAlso, you might ask, what if javascript is turned off? Well basically, time is display in GMT 00:00 then.. I personally prefer it that way (i.e. in the case when javascript is disabled) than displaying time in the server's timezone.. because if the server is in, let's say in the west coast of USA, users from europe/asia will be \"disadvantaged\" because there's a major shift in the timezone, but if it's displayed in GMT 00:00 it's \"even\" for every user.. And also, users will be able to work out the difference themselves if it's displayed in GMT 00:00, because if time is displayed in server timezone, it's probable I wont be able to figure out the GMT of the server's timezone."}, {"author_name": "Drthomas", "gravatar_hash": "d9b33be607733aa975386ac55adb6b5c", "author_url": null, "date": "Jul 23, 2008", "message": "How about publishing both, perhaps in, almsot as suggested by Paul Annesley, microformatted tags (/. Then, using cookies or JS, hide one or the other, or neither, based on the stored preferences of the user?\n\nIf it has to be strictly one or the other, then I think I'd prefer the absolute datetime, formatted in the YYYY-MM-DD, HH:MM:SS style. (I know, but I couldn't think of another abbreviation to describe 'minutes'... =( )"}, {"author_name": "Drthomas", "gravatar_hash": "d9b33be607733aa975386ac55adb6b5c", "author_url": null, "date": "Jul 23, 2008", "message": "Darn HTML escaping...\n\nafter the opening bracket it should've read:\n\n&lt;span class=\"datetime absolute\"&gt;&amp;lt/span&rt; / &amp;ltspan class=\"datetime relative\"&gt;&amp;lt/span&rt;)"}, {"author_name": "Brian", "gravatar_hash": "ced2eee4a395d17d28124d04fadf3ca8", "author_url": "http://www.adastrarocket.com", "date": "Jul 23, 2008", "message": "+1 for Relative time"}, {"author_name": "Wim", "gravatar_hash": "ba80fc40777c45452859e6e68a9dbbc9", "author_url": "http://fixnum.org", "date": "Jul 23, 2008", "message": "I'd use relative times as long as your within a year of the post, and dates (no times) if more than a year has passed. Then timezones are neglectable, but you don't get that incomplete feeling you get with '3 years ago', since that leaves a huge window."}, {"author_name": "john m", "gravatar_hash": "435a167186799889578bdf4b79bd1280", "author_url": null, "date": "Jul 23, 2008", "message": "- both, relative on left, absolute on right\n\n- use UTC times (no daylight savings) - everyone knows their zone relative to UTC, but not everyone knows where they are compared to PDT, PST etc\n\n- use day as the finest relative increment, i.e. today, not 7 hrs ago"}, {"author_name": "ray", "gravatar_hash": "16c337ddb689492848e26040b90bd69b", "author_url": null, "date": "Jul 23, 2008", "message": "Where's the podcast????"}, {"author_name": "AnSGri", "gravatar_hash": "06672cebde98a1829b16c7cad02c3c3b", "author_url": "http://ansgri.blogspot.com", "date": "Jul 23, 2008", "message": "Of course, both are must-have, maybe absolute in somewhat hidden form.\nTo the question of timezones and date/time formatting - why can't you just figure out in client-side code what format and time zone are used by my OS? Don't make me think!"}, {"author_name": "Akdom", "gravatar_hash": "a163787cb930fe641cc02d6981438938", "author_url": null, "date": "Jul 23, 2008", "message": "I love the idea of using relative times.  One thing that might be a nice preference though, would be the ability to choose how precise the displayed times are.  By this I mean: give the user the ability to set how finely grained this relative time is.  I can see a case (though it may be a bit too much toward an edge) of someone wanting to know exactly what [Month|Week|Day|Hour|Minute] someone posted something (in bucket value of course, e.g. 1 year, 2 months, 3 days) ... just a thought."}, {"author_name": "Mike", "gravatar_hash": "b66ae6b41c334b2e54a5ee7048892ff6", "author_url": "http://mrcaron.blogspot.com", "date": "Jul 24, 2008", "message": "I really enjoy the relative dates because they make more sense to me as a reader. But it'd be nice to be able to interact with the relative date to get the specific one. Maybe a hover-over, or a click, or something that keeps the specific hidden until someone really wants it."}, {"author_name": "Josh", "gravatar_hash": "05fc1aa82b7da22c15e4527f0ee67dac", "author_url": "http://jsandlin.org", "date": "Jul 25, 2008", "message": "I never really had thought about the topic of 'relative vs absolute' until i read this, then i realized that sites like RefactorMyCode.com that use this, in them it's so much easier to find up to date content."}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": null, "date": "Jul 25, 2008", "message": "A big YES for relative time. But, there *has* to be some way to know the absolute time if needed."}, {"author_name": "Ryan", "gravatar_hash": "ab7c8cd9bfc94ab2eae4a39e229a712e", "author_url": "http://www.ryantm.com", "date": "Jul 27, 2008", "message": "I think the best way to do it is use relative until 24 hrs have passed then switch to absolute. The timezone confusion only affects people for the first 24 hrs really."}, {"author_name": "chopeen", "gravatar_hash": "2c090dd87aaa362b1df5f39287cb2c18", "author_url": "http://chopeen.blogspot.com/", "date": "Jul 28, 2008", "message": "I prefer relative time."}, {"author_name": "Martin Marconcini", "gravatar_hash": "81605bd0acefe569da6f9d93a684b156", "author_url": "http://gryzor.wordpress.com", "date": "Jul 29, 2008", "message": "Go for relative. I hate when I don't know at first glance \"how old\" a post it."}, {"author_name": "Sander", "gravatar_hash": "cb44e0c2a60778ec71093b0772e4c510", "author_url": null, "date": "Jul 31, 2008", "message": "Ach! Never!\n\nLast year I developed a portal which used relative dates. Sure, they seem cool and flashy at first but after a short while, everyone started hating them!\n\nWhat is interesting about dates?\n\nDid he post it in the evening?\nDid these two people post their message at the same time?\nHow long did it take to reply?\nWere these people constantly replying and running a dialog in real time?\n\n\nOn the other hand, what is completely uninteresting about dates?\n\nHow long ago it was."}, {"author_name": "Michel Billard", "gravatar_hash": "7a72ffed0a1cd0141f4da8587624092c", "author_url": null, "date": "Jul 31, 2008", "message": "Relative is more informative, but it could be useful to have some of the absolute data.\n\nFor example, \"3 days ago on Monday\", \"5 weeks ago in June\", \"2 weeks ago on the 17th\", ...\n\nThis is just an idea, the complete absolute data in the tooltip is a very good idea too."}, {"author_name": "Martin Parry", "gravatar_hash": "157fe0cca5572441dd3de5c6f01a84c5", "author_url": "http://www.martinparry.com", "date": "Aug 04, 2008", "message": "I would have voted \"relative\" like most others, but reading Sander's comment made me reconsider, and I'm in (almost) full agreement with it.  It's still relative rather than absolute time, but the real question is \"relative to what?\".\n\nI like the idea of knowing whether posts were part of a heated debate or just accrued over a longer period of time.  The \"3 years ago\" form of relative time means you'd gradually lose information about the proximity of posts.\n\nThe idea of \"did he post in the evening\" is less interesting to me.  It might indicate how well the contributor was thinking at the time, but in a global community it'll always be evening somewhere."}, {"author_name": "Douglas Greenshields", "gravatar_hash": "94b6aa019bcd388899a6b40b611b4c81", "author_url": "http://www.bedroomation.com/", "date": "Aug 04, 2008", "message": "I know the discussion's already been and gone, but here's a strong piping in for absolute dates for anything more than two weeks ago.  If this site wants to be a repository for programming problems, then it's not about individual wittering of you or I - it's about those problems.  If someone comes up with a useful answer to a problem, the usefulness isn't going to recede proportionately away into the past.  It's not necessarily going to become out of date.  It's good to know it was posted at some time, and it would be good to know when it posted, but telling a bunch of technologists how long ago something was posted is just guaranteeing that it will slip backwards into oblivion.  One thing the web has absolutely not worked out yet is how to let its information self-archive gracefully.\n\nFor datetimes more recent than two weeks, I think I would favour the same absolute time format, but appended with, say, \"(3 days ago)\", as some have suggested."}, {"author_name": "Silverhalide", "gravatar_hash": "81d3e44a8512ef940fb2655444d19be6", "author_url": null, "date": "Aug 05, 2008", "message": "Following up on Douglas' comment, if you're going to allow any sort of threaded discussions, or similar where the order in which the comments are shown isn't necessarily the order of submission, you need the absolute times (or at least high precision relative times - 2 years, 4 months, 8 days, 14 hours and 12 minutes ago).\n\nThe timing between posts doesn't necessarily become less useful over time.  It may be interesting to see that someone's question went unanswered for two weeks until they posted the solution themself, compared to being unanswered for 5 minutes.  However, those would both show up as \"3 years\".\n\nSince I'm not a web developer, I have no idea about the additional runtime load that showing absolute times in the user's timezone would impose (especially compared to the workload of converting the stored times to relative time phrases), but I cannot imagine it to be high."}, {"author_name": "Andrew", "gravatar_hash": "b3fa5b1de0d30bd9ac00ca11308a4615", "author_url": null, "date": "Oct 17, 2008", "message": "Please just don't. Hiding the detail of the full timestamp is obnoxious, for the various reasons already mentioned."}, {"author_name": "Acai", "gravatar_hash": "6bc165ef70d5a0901c08c7b82754ea83", "author_url": "http://www.acaiberrystudy.net", "date": "Jul 30, 2009", "message": "I’ve never seen a search with a date range feature that let me say “about a year ago”. I agree I’m more likely to remember to search for something in July."}, {"author_name": "Resveratrol", "gravatar_hash": "12b7c469dbff87d127a29b1cf1961594", "author_url": "https://www.resveratrolsources.net", "date": "Jul 30, 2009", "message": "Well, It might indicate how well the contributor was thinking at the time, but in a global community it’ll always be evening somewhere."}, {"author_name": "Acai Berry", "gravatar_hash": "e4aeda6f43c4885ce77ff04b31ba6f9c", "author_url": "http://www.acaicheap.info", "date": "Sep 13, 2009", "message": "Hiding the detail of the full timestamp is obnoxious, for the various reasons already mentioned."}, {"author_name": "Teeth Whitening", "gravatar_hash": "e44e88a3f65dbfbd3489b8a07a08b701", "author_url": "http://www.teethwhiteningresult.com", "date": "Sep 13, 2009", "message": "I am looking forward to stack overflow, but seriously, spending the time to look at a minor issue like this in depth and write up a blog post seems like a waste of effort that could have gone into something more important."}, {"author_name": "Colon Cleanse", "gravatar_hash": "aa1a229ec86d12b5ea9ddec4550ae181", "author_url": "http://www.coloncleansebenefit.com", "date": "Sep 13, 2009", "message": "Then timezones are neglectable, but you don’t get that incomplete feeling you get with ‘3 years ago’, since that leaves a huge window."}, {"author_name": "Acai Berries", "gravatar_hash": "31c3c0480aac85dca34bbf041c9a190e", "author_url": "http://www.acaiberrysolution.com", "date": "Sep 13, 2009", "message": "Relative is nice for a quick glance, but just occasionally absolute is genuinely useful."}, {"author_name": "Best Teeth Whitening", "gravatar_hash": "b821257e3ed3bfacd8b156502cc50b77", "author_url": "http://www.teethwhiteninginstructions.com", "date": "Sep 26, 2009", "message": "Well even my vote goes in for relative as its really easier as compare to the absolute...Relative causes  PST and GMT confusion.."}, {"author_name": "Resveratrol", "gravatar_hash": "f4e87cee5fdc1ec98cb83af83b99cb12", "author_url": "http://ezinearticles.com/?Resveratrol-Tips---3-Tips-to-Remain-Young-Using-the-Resveratrol-Supplement&id=2649955", "date": "Sep 26, 2009", "message": "It’s more of a hinderance because I then have to find out what PST is in relation to GMT."}, {"author_name": "colon cleanse", "gravatar_hash": "bd41e6412282ee15b2bb0e8b2283a2c2", "author_url": "http://www.goarticles.com/cgi-bin/showa.cgi?C=1822997", "date": "Oct 19, 2009", "message": "I think absolute time is better...."}, {"author_name": "colon cleansing", "gravatar_hash": "bd41e6412282ee15b2bb0e8b2283a2c2", "author_url": "http://www.coloncleanseinformation.com", "date": "Oct 24, 2009", "message": "gmt is really confusing....someother method is needed to calculate"}, {"author_name": "Brute Force SEO EVO 2 Review", "gravatar_hash": "6838920d55e09127b63b80055061d5da", "author_url": "http://brute-force-seo-evo-2.blogspot.com/2010/02/brute-force-seo-evo-2-review-new.html", "date": "Feb 22, 2010", "message": "I agree i think absolute is best"}, {"author_name": "Rapid Mass Traffic Review", "gravatar_hash": "6838920d55e09127b63b80055061d5da", "author_url": "http://rapid-mass-traffic-review.blogspot.com", "date": "Mar 08, 2010", "message": "it's really a matter of opinion."}, {"author_name": "Stop Excessive Sweating", "gravatar_hash": "f423a1bed18ad09c4815e5122f0d2fb8", "author_url": "http://www.stopsweatinghelp.com", "date": "Mar 19, 2010", "message": "Relative time is definitely better than absolute time."}, {"author_name": "lose belly fat fast", "gravatar_hash": "ee292068cf02c075ffc976401750c34d", "author_url": "http://www.losethebellyfatfast.com", "date": "Apr 03, 2010", "message": "Hiding the detail of the full timestamp is low, for the various reasons already mentioned."}, {"author_name": "car tv screens", "gravatar_hash": "7e22b87527d4cfa140515250fadf14e2", "author_url": "http://cartvscreens.org", "date": "May 05, 2010", "message": "I wish there was a way to get rid of both meaning that when I make a post....I don't want the day or time to show up.  That way the visitor doesn't think that my information is dated.  Oh well...wishful thinking."}, {"author_name": "Panic Attacks", "gravatar_hash": "c68c1aa33b5d9549f9108c02f7a3d209", "author_url": "http://www.panicattackpedia.com", "date": "May 15, 2010", "message": "How about considering doing a test not displaying the time in your all questions and answers? Would that be better?"}, {"author_name": "Affiliate Residual Income", "gravatar_hash": "f6a58e55797ed86d3d1bd993a5279f34", "author_url": "http://affiliate-residual-income.blogspot.com", "date": "May 20, 2010", "message": "relative and absolute its a matter of opinion."}, {"author_name": "ways of making money online", "gravatar_hash": "df93e50f5b6bd16ed945434ce8ed654f", "author_url": "http://waysofmakingmoneyonline.net", "date": "Sep 17, 2010", "message": "When I look at the dates I am just interested in approximately how old the posts are.  Recent or 3 years ago?  Exact as in time zones usually don't matter too much."}, {"author_name": "quit smoking today", "gravatar_hash": "931c7a0b3b3bcc1336deb37bb465d53a", "author_url": "http://www.smoke-remedy.com/", "date": "Sep 28, 2010", "message": "This is among my favorite sites. I've really enjoyed reading your posts and thanks for keeping it interesting."}, {"author_name": "sony ex43b", "gravatar_hash": "e967afc62b8d457b3c5d9c11c4e86511", "author_url": "http://sony-ex43b.com", "date": "Oct 02, 2010", "message": "I agree with Justin..and with most of the other commenters… use relative time but include the absolute time in a tooltip or something in case someone wants to know."}, {"author_name": "Richie", "gravatar_hash": "3f86925d4cdd2de5f8b7e6b262a4bbd5", "author_url": "http://www.enervents.nl/golf", "date": "Oct 05, 2010", "message": "I really enjoy reading your posts .. keep up the good stuff!"}, {"author_name": "Starcraft guide", "gravatar_hash": "ce24630bd132b134cc74b360b20ad56e", "author_url": "http://www.youtube.com/watch?v=-e7Ib9ItVQk", "date": "Oct 06, 2010", "message": "I prefer to use absolute dates because it's more clearer. In relative dates, you have to think or count to get specific dates. Thanks for this information."}, {"author_name": "trains o scale", "gravatar_hash": "069fe69b341c2b2be655fe47bf7dd42a", "author_url": "http://www.trainsoscaleus.com", "date": "Nov 04, 2010", "message": "<a href=\"http://www.trainsoscaleus.com/uncategorized/how-to-make-trees-for-your-trains-o-scale-scenery\" rel=\"nofollow\">how to make trees</a>"}, {"author_name": "Barton Jin", "gravatar_hash": "e7acf319bbaf2a938b51d812efac79fe", "author_url": "http://www.motorbikehelmet.net", "date": "Jan 05, 2011", "message": "A very interesting read. I really wish I stumbled upon  this article before."}, {"author_name": "Notranja vrata", "gravatar_hash": "da3c676b1175641fac9617f51035bce5", "author_url": "http://notranjavratanovipla.com/", "date": "May 07, 2011", "message": "It rocks! :-)"}, {"author_name": "How to treat hemorrhoids at home", "gravatar_hash": "da3c676b1175641fac9617f51035bce5", "author_url": "http://www.squidoo.com/how-to-treat-hemorrhoids-at-home-secrets", "date": "May 07, 2011", "message": "Nice read. Go on..."}, {"author_name": "TC from cystic acne", "gravatar_hash": "1abf2f2bcd3e4bbc543bf8f2b43505d4", "author_url": "http://www.cysticacneguides.com", "date": "Jun 11, 2011", "message": "Relative is more useful for me."}, {"author_name": "Send Flowers to Noida", "gravatar_hash": "38c49c70a3ddaa8a2db554f076022346", "author_url": "http://pollenblossom.in/", "date": "Jun 20, 2011", "message": "I’m not a web developer, I have no idea about the additional run time load that showing absolute times in the user’s timezone would impose (especially compared to the workload of c"}]}