{"response": [{"author_name": "Bryce", "gravatar_hash": "7b34613454725e366208ab4e44f82c07", "author_url": null, "date": "Jul 02, 2008", "message": "It’s not quite version control, but why doesn’t our IDE automatically create lightweight versions every time we save?\n\nBecause you're not using the e text editor: http://www.e-texteditor.com/"}, {"author_name": "Ben", "gravatar_hash": "8fb95bde97cca5563771aafb7eeeab01", "author_url": null, "date": "Jul 02, 2008", "message": "Jeff,\n\nDon't you think that any person making their thoughts and opinions public, could be made to look like \"they don't know what there doing\".\n\nI think the uber-programmer/\"ultimate smart person\" is a myth."}, {"author_name": "Kurt from Florida", "gravatar_hash": "218dd8026929110aa3369d645b447884", "author_url": "http://www.leucht.com", "date": "Jul 02, 2008", "message": "Let the official record show that I emailed in my question about you guy's book lists at least an hour and a half prior to the posting of podcast #12.\n\nIs it really true that great minds think alike?  :-)\n\nKurt"}, {"author_name": "Gordon J Milne", "gravatar_hash": "35ba5c8e0c3c4a5ba0791a6f1d466ec7", "author_url": null, "date": "Jul 02, 2008", "message": "You get local file saving histories (if you enable it) with JetBrains IDEA IDE - a Java IDE. You get to pick how far back your local history goes. The default is 3 days. That should be enough for air travel, even to New Zealand!"}, {"author_name": "Jim McKeeth", "gravatar_hash": "e5ca3abec062f8174570a4b1d1c840d8", "author_url": "http://www.davinciunltd.com/", "date": "Jul 02, 2008", "message": "\"It’s not quite version control, but why doesn’t our IDE automatically create lightweight versions every time we save?\"\n\nCodeGear's RAD Studio (aka Delphi) has this functionality with a pretty good difference comparison.  There is an add-in to use Scooter Software's Beyond Compare with it, which is much better."}, {"author_name": "Gordon J Milne", "gravatar_hash": "35ba5c8e0c3c4a5ba0791a6f1d466ec7", "author_url": null, "date": "Jul 02, 2008", "message": "The Pragmatic Programmer\n\nI like this book because it uses a decent font, reads well and, more than any other book, made me realise that all my concerns about OO programming wasn't just me being an old fart. Those vague feelings of unease come from somewhere reasonable.\n\nPP isn't an anti-OO book. It is a book that talks about thinking before you program and about programming into a language.\n\nIt is also chock full of tips and advocates the learning of a new (ideally very different) language every year.\n\nA book to think with."}, {"author_name": "Brad Barker", "gravatar_hash": "f1bf5b6fbe43b29d5646f90b9eb06a0f", "author_url": "http://www.solutionsetsoftware.com", "date": "Jul 02, 2008", "message": "I wouldn't mind my IDE storing revisions when I save if I could be sure no one I ever worked with would get lazy with real source control."}, {"author_name": "Mr Fancypants", "gravatar_hash": "b14ece6d5a5c6645fba4110e111e32cf", "author_url": null, "date": "Jul 02, 2008", "message": "I wouldn't say Jeff doesn't know what he is doing, but I would say that there seems to be a huge gulf between the way he goes about development compared to how Joel does.  \n\nCould you imagine Joel writing an essay about how Fog Creek started doing all new development on the ASP.NET MVC framework... a technology not even out of the preview stage yet and one that pretty much throws out the vast majority of the old way of doing things with asp.net without providing a new set of controls and functionality to replace the old stuff?\n\nDon't get me wrong, I think ASP.NET MVC will be nice... someday, but it simply isn't ready to use, and that is coming from my POV and I'm way less conservative than Joel is."}, {"author_name": "Charles Conway", "gravatar_hash": "a3c1ebd2e3497fe62303608b65d670a7", "author_url": "http://www.cconway.com", "date": "Jul 02, 2008", "message": "Joel &amp; Jeff,\n\nGreat episode, the best yet!\n\nSharpening skill sets outside the programming world will always help you in all your endeavors whether it’s working at a company or starting your own.\n\n@Jeff \nThere was a comment made about “The Game” and I noticed it referenced in the above post.  Have you had a chance to read it? The author writes about his desire an ensuing journey to becoming successful with women. \n \nIf you can’t communicate well with women, I would bet you have a communication problem in all areas of your life.\n\n“The Game” is about a man realizing an accepting his ineptness in an area of his life and doing something about it. It’s no different than a software engineer realizing he needs to improve his social skills and reading “How to Win Friends and Influence People”.   \n\nAgain great show, I look forward to future episodes and your upcoming software release.\n\nKeep the peace,\n\nChuck"}, {"author_name": "Roland Tepp", "gravatar_hash": "0f83be58c6c968f558b2cfda93183f28", "author_url": null, "date": "Jul 02, 2008", "message": "- \"It’s not quite version control, but why doesn’t our IDE automatically create lightweight versions every time we save?\"\n\nWell Eclipse (and by extension, all of it's derivates, including CodeGear IDE tools) have it. Absolutely indispensable and I really love this feature..."}, {"author_name": "Aaron", "gravatar_hash": "396cd6ee9714c6543652a316ff233563", "author_url": null, "date": "Jul 03, 2008", "message": "Dot.con is a fantastic account of the internet bubble.  \n\nAlso, I just read Infinite Loop, which is about Apple, and I love it.\n\nJust a few more \"this is how it happened\" books for ya."}, {"author_name": "Kjetil Ødegaard", "gravatar_hash": "fd5a75c8dd3056bfba4484f1ae0b36e1", "author_url": "http://piffpaff.com", "date": "Jul 03, 2008", "message": "Actually, IntelliJ (the Java IDE from the creators of Resharper) has done this for years.  This also means you never have to Ctrl-S to save:\n\nhttp://www.codinghorror.com/blog/archives/000461.html"}, {"author_name": "Kjetil Ødegaard", "gravatar_hash": "fd5a75c8dd3056bfba4484f1ae0b36e1", "author_url": "http://piffpaff.com", "date": "Jul 03, 2008", "message": "Hm, did Joel just say \"factoring a prime number\" (at 34:10)?\n\n:-)"}, {"author_name": "Dave Smillie", "gravatar_hash": "9af66603dd2af3606750c08cde70d1d9", "author_url": null, "date": "Jul 03, 2008", "message": "Love the podcast, and enjoyed this weeks episode ...\n\nbut the cynic in me wonders if having an episode on books is just an excuse to get a load of those lucrative amazon affiliate links into the shownotes??\n\nI've no problem with affiliate links if they have contextual significance, but I hate the idea that they might be the driving force behind the content."}, {"author_name": "James", "gravatar_hash": "53581739a445ad78250a676dabddf55f", "author_url": "http://blog.jcoglan.com", "date": "Jul 03, 2008", "message": "Bryce beat me to it, but E is awesome -- it gives you cross-session branching undo/redo and remembers everything you ever do to a file. I was using E+SVN+Tortoise on Windows, can't wait for E to come to Linux."}, {"author_name": "bryan", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": "http://quux.tumblr.com", "date": "Jul 03, 2008", "message": "Great episode. \n\nI know it's a lot of work, but would love to have the whole list of books from this podcast as a printed list!\n\nJoel?"}, {"author_name": "Bernard", "gravatar_hash": "f3ac9b6f28ad2e46e86ddb85b217c6fd", "author_url": "http://www.burningends.blogspot.com/", "date": "Jul 03, 2008", "message": "It appears some children are StackOverflow fans. Some nameless cowardly tard at 24.94.6.152 mucked with the Wiki for this transcript. By chance I was still working with it at the time and was able to clean it up quickly, but it seems some people have too much time on their hands."}, {"author_name": "Greg", "gravatar_hash": "6ffe033e9c6b63e357c80c3133c847fc", "author_url": null, "date": "Jul 03, 2008", "message": "Re: “It’s not quite version control, but why doesn’t our IDE automatically create lightweight versions every time we save?”\n\nYou just need to switch hardware - get a VAX with VMS. File versioning is inbuilt to the O/S. You may need to build a new room to put it in though.\n\nOh, the good old days..."}, {"author_name": "Robert", "gravatar_hash": "111064192db67de60abbe1a093cce6bb", "author_url": null, "date": "Jul 03, 2008", "message": "The Eric Sink articles Jeff to which Jeff alluded:\n\nhttp://www.ericsink.com/scm/source_control.html"}, {"author_name": "dinah", "gravatar_hash": "d97c394b2cf92c49fca089d2484813f3", "author_url": "http://www.softhardsoft.com", "date": "Jul 03, 2008", "message": "By far your worst podcast. I've been following Stack Overflow all but religiously since the day each of you announced it in your respective blogs. This is the only one I've ever stopped listening to 1/2 way through. It started out strong but the half hour discussion of books was terrible. I read these books too and most are great but I don't listen to a programmer's podcast for book reports."}, {"author_name": "dinah", "gravatar_hash": "d97c394b2cf92c49fca089d2484813f3", "author_url": "http://www.softhardsoft.com", "date": "Jul 03, 2008", "message": "It may do you well to cache the gravatar icons. Today, gravatar is particularly non-responsive and as the comments increase, the page takes a long time to load."}, {"author_name": "KiwiBastard", "gravatar_hash": "8918922b70fe7aa6d2533d6bbb47ec76", "author_url": "http://www.retainrelease.com/blog", "date": "Jul 03, 2008", "message": "What's this about Joel being a Kiwi? More info please..."}, {"author_name": "pkn", "gravatar_hash": "8cff0e19c525c987e7fe10a3e3aef350", "author_url": null, "date": "Jul 03, 2008", "message": "Eclipse is yet another IDE that saves revisions of files every time you save.  You can configure size and time limits too.  It's very handy but it's also very different than real version control.\n\nYou should try something like \"git\" if you want to do real commits on an airplane...  Even if you use something other than \"git\" normally, you can use git on top of most other VCs (like CVS or SVN).  Checkout \"easygit\": http://www.gnome.org/~newren/eg/"}, {"author_name": "Martin Wallace", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Jul 03, 2008", "message": "This weeks podcast was not really my cup of tea - bit boring to listen to a list of Joels favourite reads. However, I understand their are others who would enjoy it, and that it would be unusual for me to expect every podcast to blow me away."}, {"author_name": "Greg", "gravatar_hash": "6ffe033e9c6b63e357c80c3133c847fc", "author_url": null, "date": "Jul 03, 2008", "message": "I figure I can't really criticise a podcast for lack of content if I did not submit any questions. It's  a bit rich saying it us crap when, every week, there is a request for them.\n\nNo questions = conversations about whatever pops into their heads. Personally I would prefer this than not having the podcast at all.\n\nI also have a hard time with people criticising something without positive suggestions on what to do instead. That's just whinging, and not really taking up the \"community\" part of stack overflow.\n\nPS: I had no problem with this week's content."}, {"author_name": "Matt", "gravatar_hash": "67da4fc845ee53a04bce4e7d2934055f", "author_url": null, "date": "Jul 03, 2008", "message": "Great podcast this week!  I think reading books, and not just programming books, is ESSENTIAL to becoming a great developer.  \n\nUnfortunately, most of the developers that I meet and/or interview can't even tell me the last book they read!  \n\nAnother two books that I would recommend are Obvious Adams and Acres of Diamonds."}, {"author_name": "Eric Kibbee", "gravatar_hash": "2b568071163c0d009635cfa63cf6e6ac", "author_url": "http://www.kibbee.ca", "date": "Jul 03, 2008", "message": "Speaking of version control, why did you choose to go with SVN for version control, and not go with the source control that's built into VS.Net Team System?  In previous podcasts, you mentioned that it was a lot better than the old Visual SourceSafe, and you seem to be pretty pro-MS going with SQL Server, and the built in data generation tools. It seems odd, that source control, being such an important part of the development system, that you wouldn't choose to go with something that's integrated so tightly into your development environment."}, {"author_name": "BCS", "gravatar_hash": "6757caf55de0413ae0994293e001d465", "author_url": null, "date": "Jul 03, 2008", "message": "regarding people trying to \"game the system\", Might it be possible to build a metric such that the easy way to improve you rating is to do something that is desirable?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 03, 2008", "message": "> ould love to have the whole list of books from this podcast as a printed list!\n\nIt is linked in the post:\n\n* Stack Overflow is meant to replace some books, but by no means all of them. We love books! We spend the rest of the episode discussing [Joel’s Fog Creek Software Management Training Program reading list][1]. It is a fantastic list, filled with excellent reads that will broaden and inspire you as a software developer — or software entrepreneur.\n\n[1]: http://www.joelonsoftware.com/articles/FogCreekMBACurriculum.html"}, {"author_name": "Spencer", "gravatar_hash": "948a175bf365f761e7112dc279b00910", "author_url": null, "date": "Jul 03, 2008", "message": "I was really entertained to hear you play Flight of the Conchords on this weeks show.\n\nI was one of the lucky few that got to see the San Francisco show while on vacation. \n\nI used Ashlee Vance's Geek Silicon Valley and visited the Computer History Museum, both of which I learned about from the podcast.\n\nThanks for the great recommendations!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 03, 2008", "message": "> I used Ashlee Vance’s Geek Silicon Valley and visited the Computer History Museum, both of which I learned about from the podcast.\n\nVery glad to hear that -- both are outstanding!\n\n> Unfortunately, most of the developers that I meet and/or interview can’t even tell me the last book they read! \n\nThat's truly sad, but it mirrors my experience as well. Online we get a skewed perspective -- how do you reach the unreachable?\n\nhttp://www.codinghorror.com/blog/archives/001004.html"}, {"author_name": "Dejan", "gravatar_hash": "1ef156e35f463fd4d1a7e00ca37815b5", "author_url": "http://blog.fajfar.com", "date": "Jul 03, 2008", "message": "I really love and respect your work. And I know that you want to ignore including a intro in your podcast. But I would really, really love to have some intro. Not a ringtone that will get on everybodys nerves after three podcasts. But lets say a simple introduction like:\nWelcome to Stackowerflow podcast #x with ... and ...\nIt would make listening to them so much easier. Because now all beginnings sound like the record button was pressed a few seconds to early.\nBut please keep up the work and keep people informed."}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.blogspot.com", "date": "Jul 03, 2008", "message": "Joel is right that there is more than one Robert Cringely, but he is wrong about which is which: one Robert X. Cringely (aka Mark Stephens) did Accidental Empires, Triumph of the Nerds, and everything else you've ever heard of. The name originated as the pseudonym for an Infoworld column (which is where Stephens picked it up). The other Cringely's have all been pseudonymous authors of that column. AFAIK, no other Cringely has ever used the name for anything else."}, {"author_name": "David", "gravatar_hash": "5dd5d79588bd40c60a1a11c4585d7d13", "author_url": "http://www.morethancurious.com", "date": "Jul 03, 2008", "message": "I for one appreciated this podcast despite the fact that it wasn't about \"programming\" per say as dinah said.  I have known about Joel's reading list for a while, and thus was glad to hear why some of those books were on there.  Joel, don't forget that you have some younger listeners who haven't found time amidst their studies to read all of these books.  I'm 21 and only caught the \"startup bug\" less than a year ago!  Still, you guys made me want to read most of the books on the list!"}, {"author_name": "pacifika", "gravatar_hash": "42786a4364f7fe5b27371e84f2bee8fa", "author_url": "http://amasan.co.uk", "date": "Jul 04, 2008", "message": "Try filehamster (http://www.mogware.com/FileHamster/) which creates backups from files on save, just what you're looking for."}, {"author_name": "Erlend Halvorsen", "gravatar_hash": "cf4621433dfa81bba4712eed74acbebb", "author_url": null, "date": "Jul 04, 2008", "message": "Dave, are you serious?? Joel and Jeff spending an our each of their time for a few bucks from Amazon? Come on..\n\nGreat podcast guys, as usual. Actually the only podcast I bother listen to these days :)"}, {"author_name": "Sean T. McBeth", "gravatar_hash": "2d598f70b2bd1d828a195ced8abd7e9e", "author_url": "http://www.seanmcbeth.com", "date": "Jul 04, 2008", "message": "\"Ben Says: Don’t you think that any person making their thoughts and opinions public, could be made to look like “they don’t know what there doing”.\"\n\n\"It is better to keep your mouth closed and let people think you are a fool than to open it and remove all doubt.\" —Mark Twain"}, {"author_name": "David Goodwin", "gravatar_hash": "7f8f886897caa69a4a9ec2dc29fbc0db", "author_url": "http://www.codepoets.co.uk", "date": "Jul 06, 2008", "message": "Hi,\n\nJust a quick note - thanks for recording the podcasts; they're interesting and enjoyable.\n\nDavid"}, {"author_name": "Rob Burke", "gravatar_hash": "429329df3c7c21e2a9f156a808c1fab0", "author_url": null, "date": "Jul 07, 2008", "message": "Any update on when the beta will begin guys?\n\nCheers,\nRob"}, {"author_name": "Dave Jacoby", "gravatar_hash": "db1c27523043366c2ba1c9be1fa3fa23", "author_url": "http://varlogrant.blogspot.com/", "date": "Jul 07, 2008", "message": "Chris is right. And the Book/Video/no-longer-Infoworld Cringley has a blog on PBS.\n\nhttp://www.pbs.org/cringely/"}, {"author_name": "DC", "gravatar_hash": "f6a437519f6681edd1dbc2c7bce00c00", "author_url": null, "date": "Jul 07, 2008", "message": "This is really off-topic guys (I managed not to close my winamp, but that was really hard).\n\nIt should be a podcast about stackoverflow.com and how you do things in order to develop it. For example it would be interesting to hear how Jeff deals with the func spec writing/updating cycle. I would love a rant on that rather than enumerating books."}, {"author_name": "hova", "gravatar_hash": "6b81f39b9693260d9fbc472f71f71c30", "author_url": "http://www.hova.org", "date": "Jul 07, 2008", "message": "\"It’s not quite version control, but why doesn’t our IDE automatically create lightweight versions every time we save?\"\n\nSince I primarily work in SQL, I actually wrote a program in c# that \"listens\" (using filesystemwatcher) to a directory and uses SVN to add/commit everytime something changes in the directory.  This allowed me to work in MS-SQL scripts, save often, and then have a history of changes to a script I was working on.  Very handy, for those one-off updates or scripts that need to be done to a database during development."}, {"author_name": "John Riston", "gravatar_hash": "706855975a872d306cbffac61f4e00a5", "author_url": null, "date": "Jul 07, 2008", "message": "Jeff,\n\nI really used to like listening to your podcast, until you revealed that you went to UVA! (Go Terps!)\n\nJust giving you a hard time.  I enjoyed the book list and have purchased many you recommend.  I look forward to using this site when it goes live."}, {"author_name": "Lasse V. Karlsen", "gravatar_hash": "1b11262da6d1cd26b1b0bc99a2620cee", "author_url": null, "date": "Jul 07, 2008", "message": "Joel, just for the record, dropping a baby is not funny in any context (@17:02)."}, {"author_name": "Ian Anderson", "gravatar_hash": "60b1c7dc18e08e1a16f313354814744f", "author_url": "http://thefirstpost.co.uk", "date": "Jul 07, 2008", "message": "@DC - \"It should be a podcast about stackoverflow.com and how you do things in order to develop it. For example it would be interesting to hear how Jeff deals with the func spec writing/updating cycle.\" Did you miss the bit where Jeff says he doesn't have a list of tasks? Looking forward to next week's punch up where Joel attempts to teach Jeff project planning using a baseball bat and a hosted copy of FogBugz.\n\nBut I have a question: why don't they use the questions from previous weeks, that they didn't have time to use in previous podcasts? People must have sent in many, many fine questions and they've answered about ten so far.\n\nBut it's all good crack - roll on next week!"}, {"author_name": "T. Morgan", "gravatar_hash": "85b4cdbef1ff706c74c548ab5ee5d914", "author_url": null, "date": "Jul 08, 2008", "message": "\"By far your worst podcast... This is the only one I’ve ever stopped listening to 1/2 way through. It started out strong but the half hour discussion of books was terrible. I read these books too and most are great but I don’t listen to a programmer’s podcast for book reports.\" \n\nToo strong by half, but I generally agree.  The podcast has been surprisingly good up to this point.  I listen to a fair amount of programming podcasts and for whatever reason you two huckleberries are able to do it well. Incidentally, Atwood sounds exactly like his photo and writing look. Joel sounds like a very nice person. Being opinionated and coming off as a kind, warm fellow is tricky. I'd work for him, but I don't get things done and I'm stupid. \n\nI listened to the whole thing, but I was kinda bored. I intend no insult - this is just my objective feedback.  Great idea.  Keep it up."}, {"author_name": "watt", "gravatar_hash": "42ad44db8efe1a2b5e5e9214b444c971", "author_url": null, "date": "Jul 09, 2008", "message": "can't wait until tomorrows podcast!"}, {"author_name": "Thomas Petersen", "gravatar_hash": "62c93894e552c6e20e2706235a8fd2ff", "author_url": "http://www.hellobrand.com", "date": "Jul 09, 2008", "message": "Good podcast but I disagree with your statements about Silicon Valley vs. other places and think you didn't really give good advice.\n\nFirst of all\n\nThere is plenty of companies making good money in Europe and Middle east. They might not be google but then again how many companies are.\n\nSkype was founded by a Danish and a Swedish guy they are not from the Netherlands.\n\nKazaa (also Janus and Niklas)\n\nLastFM is English\n\nZyb that got sold to Vodafone was Danish, Threadless is German as far as I remember.\n\nThere are many venture capital companies other places and American venture companies don't just invest in American companies.\n\nThe American market is good but the global market is better, mind you that American companies also try to get into other markets than their own.\n\nI could probably provide a longer list but you get the point.\n\nThe guys question was if I understand it correctly \"do you have any advice for people who wants do a startup that is not in Silicon Valley\"\n\nDoing a lot of work with startups around the world from one location but servicing the world my self and being well connected in the venture capital world my advice would be the following.\n\nFind as many good people locally no matter where you are. Use a good online project managenment tool, a good coding platform if you need to work with people other places. \n\nDepending on your skillset and what you are building make sure you have some good designers to help productify can simplify your ideas. It does not matter if they are local or somewhere else.\n\nYou don't need to be google to have a successful company there are many great local markets out there.\n\nAnd remember\n\nStart Simple\nBuild to Scale\nDon't do everything that is possible only what is nessecary.\n\nBest\n\nThomas"}, {"author_name": "NickL", "gravatar_hash": "744a84fb3ee798b707090ed4184ddfb4", "author_url": null, "date": "Jul 10, 2008", "message": "@Lasse\nI came here to say, yes, yes it is. Different strokes for different folks...\n\n\nAlso,\nI didn't like all the UI books you mentioned. I haven't read them so I hope my interpretation is accurate, correct me if I'm wrong, but skills in programming are what I've focused on --I am a new grad. I want to suggest, 'Purely Functional Data Structures'. It's my current read and gives a great insight on minimizing space/time in an immutable world. I'm currently working with a functional language (ocaml), and doing scientific software, so I might be a bit different then the norm (?)."}, {"author_name": "Chris Hudson", "gravatar_hash": "a4040b3cd8ee723e93f1c95ddeb0b5bc", "author_url": "http://www.xetius.com", "date": "Jul 11, 2008", "message": "Jeff, you mentioned in passing something about the undo functionality and going back to previous versions (in conjunction with the early talk about Subversion and offlinedness).  You may want to check out e-TextEditor.  This is now my editor of choice.  It also stored total undo functionality, even after you have closed the file and re-opened it.\n\nI liked it so much I paid for it."}, {"author_name": "David McGraw", "gravatar_hash": "840264c45b706fb829d406e9c61a1889", "author_url": "http://www.david-mcgraw.com", "date": "Jul 11, 2008", "message": "Hey all, great stuff!\n\nCould you possibly take that book list and categorize them somehow?  Maybe 'must reads,' 'must reads 2,' or by the type. 'Programming,' 'Programming management,' 'Code improvement'."}, {"author_name": "Stephen Rylander", "gravatar_hash": "9a68e84303aacfab85581936e9da64f2", "author_url": "http://ontheheap.com", "date": "Jul 15, 2008", "message": "I must have watched Startup.com a dozen times.  It's a great documentary."}, {"author_name": "Bremen", "gravatar_hash": "9a45de8df0c5c3f6e137c785e71557b8", "author_url": null, "date": "Jul 15, 2008", "message": "Regarding undervolting, the new Centrino 2 laptop platform lowers the Vcc[1] on the new 45nm Intel chips to achieve a lower TDP... time for a new laptop!\n\n[1] http://www.anandtech.com/cpuchipsets/intel/showdoc.aspx?i=3356&amp;p=3"}, {"author_name": "Seth Root", "gravatar_hash": "a77a73f7515a45017b9932b3dab4ed57", "author_url": "http://www.sethroot.com", "date": "Sep 19, 2008", "message": "I'm surprised Charles Petzold's <i>CODE:\nThe Hidden Language of Computer Hardware and Software</i> wasn't mentioned!"}, {"author_name": "Adam", "gravatar_hash": "a9aaf351adda1e39bbe64b7ba38b55f0", "author_url": null, "date": "Dec 04, 2008", "message": "This is the podcast where Joel mentions Hackers and Painters, isn't it? This is a fabulous response:\nhttp://www.idlewords.com/2005/04/dabblers_and_blowhards.htm"}]}