{"response": [{"author_name": "Stewart Johnson", "gravatar_hash": "9f367b07b33be399fc8c13226d54adc2", "author_url": "http://bolidian.com/", "date": "Jul 09, 2008", "message": "I think you meant \"Scriptaculous\" not \"Scriptalicious\"."}, {"author_name": "John", "gravatar_hash": "d0b76ae7bf261316683cad31ba0bad91", "author_url": null, "date": "Jul 10, 2008", "message": "With cruise control.net you can extract the incremental build number before it compiles and embed it in to the version number shown in your app. \n\nThis means that it is not every check in but every build which will increment the number."}, {"author_name": "KiwiBastard", "gravatar_hash": "8918922b70fe7aa6d2533d6bbb47ec76", "author_url": "http://www.retainrelease.com/blog", "date": "Jul 10, 2008", "message": "Joel: now you've admitted the Kiwi heritage, they'll be 20 Kiwi's on their OE rock up with back packs looking to crash on your couch. Or looking for work!"}, {"author_name": "Alistair", "gravatar_hash": "438c91736f20d0821c7a358ee8b00790", "author_url": null, "date": "Jul 10, 2008", "message": "I found Flight of the Conchords a great divider. I knew it was awesome in about ten seconds, and my fiancee secided it sucked ballz in about the same amount of time...."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 10, 2008", "message": "> my fiancee secided it sucked ballz \n\none word: divorce"}, {"author_name": "Chris Bartow", "gravatar_hash": "97f8dbd7b1804150965ab30ae6fb0f0d", "author_url": "http://www.chrisbartow.com/", "date": "Jul 10, 2008", "message": "Suggestion for Phone -&gt; MP3:\n\nYou can use GrandCentral.com as a way to have people call and record voice mails."}, {"author_name": "Evgeny", "gravatar_hash": "35d78874c6ba5c64db3256f6868515dc", "author_url": "http://blog.kesor.net", "date": "Jul 10, 2008", "message": "Other than having a Cruisecontrol.NET for builds, there is also benefit when each error on the production website sends an e-mail. Or even better yet, opens a ticket in your FogBugz (or whatever it is you are using)."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": null, "date": "Jul 10, 2008", "message": "If Joel's claim is true, then given the lack of any Spolskys in the White Pages here, did Joel Spolsky's father adopt a different name or something? :-P *plays conspiratorial music*\n\nSpeaking of conspiracy, one word for the Kiwis here: Waihopai. ;-)"}, {"author_name": "Jay Lynch", "gravatar_hash": "c6121240ced579760866d9d53d13b735", "author_url": null, "date": "Jul 10, 2008", "message": "\"# Stack Overflow will implement an Xbox 360 like Achievement system tied to your account. Our “Badges” system fulfills three roles: bronze badges encourage people to try all the different functions in the system, silver badges encourages continued participation, while completionists and hardcore users can strive to get the gold badges. All of this is completely optional, of course, but it is permanently visible on your Stack Overflow profile.\"\n\n\nI'm curious to hear more about this, whether here or in the podcast, do you think it'll really work for you?\n\nI agree it's a great idea and love it to bits (See Kongregate for a perfect example in Flash gaming), but it seems that it requires non-trivial \"achievements\" to make?\n\nYet with a site like this, it seems that you lack much more than 3 or 4 quite simple actions for users to perform... I really liked the concept but have struggled with finding a way that it really adds anything to a site with a similar level of user interaction, over say a basic karma/reputation type score.\n\nHow have you gotten around this, or feel it adds particular value?\n\nFWIW huge fan of the podcast and really looking forward to the site, I'm not slinging abuse here, really interested to see how you're approaching it, as I've always thought of it as a great idea but difficult to apply."}, {"author_name": "Darrel", "gravatar_hash": "322188b508f34b38ffede8856721295d", "author_url": null, "date": "Jul 10, 2008", "message": "I too really like the \"badges\" idea. But I think there are tons of things you could make them for. Plus 360 achievements aren't always for things that are \"good\" you could have one for having someone vote down one of your comments. Also you can have badges for different amounts one for answering your first question, then 10 then 100, etc.\n\nWhat do you think of these others off the top of my head.\nAsking a question that's answered by the first responder. \nAsking a question that hits the top ten most popular.\nAsking a question that is the most popular for an entire week.\nCode Snippet downloaded more than 1000, 10000 times\nQuestion that is searched 1000, 10000 times\nAsk/Answer a question in less that 10 words that actually gets votes.\nLogging in so many times total, so many days in a row, \nAnswering questions for 5, 10, 50 straight days\n\nHow about this one, although google or whoever you use for ads might not like it.\nClicking 100 ad links.\n\nThat's all for now"}, {"author_name": "Darrel", "gravatar_hash": "322188b508f34b38ffede8856721295d", "author_url": null, "date": "Jul 10, 2008", "message": "Don't most MP3 players available now allow you to record voice messages right to them? I know I've used mine to record meetings rather than taking minutes. \n\nWhy couldn't people just do that then email you the file?"}, {"author_name": "Steve", "gravatar_hash": "dfd66c0fea953eacfefed0bcc238fe28", "author_url": "http://randomoli.wordpress.com", "date": "Jul 10, 2008", "message": "Jeff, to go along with other comments, can you give concrete examples of achievements for the badge system?"}, {"author_name": "Rob", "gravatar_hash": "245cbb4a955146221b62d37879a3128e", "author_url": null, "date": "Jul 10, 2008", "message": "To tag along with what Darrel said - the badges sound like a great idea that you can have a lot of fun with. Some more ideas that popped into mind:\n\n- Number of accepted answers within a single language\n- Number of unique languages with accepted answers\n- Number of language tutorials written\n- Number of IDE tutorials written\n- Number of people watching your responses to questions\n\nNeedless to say, the list can go on.\n\nHowever, a question in regards to the badge system, are all of the badges going to be tired into a bronze, sliver, gold structure, or will there be \"one shot\" badges that you can get that fall outside of that structure?"}, {"author_name": "David K", "gravatar_hash": "5dd5d79588bd40c60a1a11c4585d7d13", "author_url": "http://www.morethancurious.com", "date": "Jul 10, 2008", "message": "Can we get a super sweet badge for being part of the stackoverflow beta?  If there's going to be badge I might get the gumption to do some transcription and get in on it ;-)"}, {"author_name": "Darrel", "gravatar_hash": "322188b508f34b38ffede8856721295d", "author_url": null, "date": "Jul 10, 2008", "message": "I thought of a possibility with the badges that the 360 doesn't offer. \n\nThat being badges that are gained through user nominations. So you could have badges that the users can give each other. But only after a certain number of people have nominated the person for the badge. I think some of the nomination totals should be pretty high to make it worth trying to get.\n\nThis is also an area for some pretty funny badges, like one for \"The most offtopic comment in a thread\" or \"Most 'WTF' Code snippet\" offering. That one's nice since another site i won't mention doesn't use that anymore :)\n\nWorst_use_of_overly_long_variable_names.\nCode that looks like fortran\nBest use of \"Go To\"\n\nPlus the boring ones:\nGreat Answer\nGreat Question\nWish I had thought of that\nGreat Idea"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": null, "date": "Jul 10, 2008", "message": "To add to what Darrel said, and what Jeff's been posting about lately: how about a badge for Most Spartan Refactoring? (Or one for Most N00bish R3f4x0r1ng Evar!!11eleventyone (wow, that was painful to type)?)"}, {"author_name": "Lorin", "gravatar_hash": "2f1b3d64794e94a75875fcfcba1a9000", "author_url": null, "date": "Jul 10, 2008", "message": "On versioning: while it's not a huge problem, using the subversion revision as the build number leads to a little confusion if you also decide to start tagging successful builds. Typically you don't want to tag broken builds, so you wait until the build succeeds, tag it as successful, and that tag is what you consider to be the 'known good version' that you can use to branch from later on.  \n\nIt is a little confusing that the subversion revision number of the tag, which is what you would likely be checking out to make a branch is always going to be at least one higher than the build number. \n\nIt's better to just separate the concept of build numbers from revision numbers, and let the build number increment sequentially every time a build succeeds. You can have a buildnumber file in subversion which cruisecontrol increments when it starts building, and then commits before it tags the build as successful."}, {"author_name": "Isaac Moses", "gravatar_hash": "2bb572e05887045b95d99d8a5819eb14", "author_url": null, "date": "Jul 10, 2008", "message": "For podcast-friendly voicemail, it seems that a lot of podcasts use a free service from http://www.k7.net/ . If you notice that many podcasts have voicemail in the 206 area code, it's apparently from this service"}, {"author_name": "Gareth", "gravatar_hash": "97814c12d93a5ff39baafacfb5dcaf1f", "author_url": null, "date": "Jul 10, 2008", "message": "The Turning bookshelves mentioned in the podcast are here: http://www.charlespetzold.com/blog/2008/03/060948.html"}, {"author_name": "Tony", "gravatar_hash": "2fff6d66995f85549f043248f2502a61", "author_url": null, "date": "Jul 11, 2008", "message": "Just realised you guys are the top result for searching \"stack overflow\" now. Nice one :D"}, {"author_name": "David B", "gravatar_hash": "581e7a29e18c2d66cc2b347423c62a8f", "author_url": null, "date": "Jul 11, 2008", "message": "Badges... cool idea.\n\nBe careful on default visibility though, some people will vote up an answer on the basis of badges alone, even if the answer is wrong."}, {"author_name": "Ian", "gravatar_hash": "db4342fae89286695afad4c08a272ac1", "author_url": null, "date": "Jul 11, 2008", "message": "I don't think it would be a good idea to give badges for things such as \"The most offtopic comment in a thread\" which Darrel recommended. This would just encourage people to post absurd comments which would lower the overall quality of the site, thus doing exactly the opposite of what the badges are meant for in the first place."}, {"author_name": "MattH", "gravatar_hash": "8364802a3e4700212ed0807fbe008cb8", "author_url": null, "date": "Jul 11, 2008", "message": "&gt; On Stack Overflow, an upmod will be worth twice as much as a downmod. \n\nIs there such a thing as too much transparency?\n\nCan one person downmod the same question/answer multiple times?"}, {"author_name": "David McGraw", "gravatar_hash": "840264c45b706fb829d406e9c61a1889", "author_url": "http://www.david-mcgraw.com", "date": "Jul 11, 2008", "message": "I have a cleaning degree from the military.  If that can break me into the industry, let me know. ;)"}, {"author_name": "Stephen Cox", "gravatar_hash": "4ec688bc969d57547ff77e873600d663", "author_url": "http://stephencox.org", "date": "Jul 12, 2008", "message": "\"I have a cleaning degree from the military...\"\n\nLOL.\n\nAfter 10 years, you know how many motor pools floors I cleaned/buffed? That skill served me well in private life. ;)"}, {"author_name": "Michael S. Scherotter", "gravatar_hash": "5bc16a644f52bd2c62283f1252ed1b41", "author_url": "http://blogs.msdn.com/synergist", "date": "Jul 13, 2008", "message": "As one of the people demonstrating Silverlight on a daily basis at Microsoft, the navigation issue comes up often where AJAX/Flash/Silverlight applications don't typically work well with the forward/back/history interface of web browsers and deep linking.  Take a look at this solution for Silverlight 1 (http://blogs.msdn.com/synergist/archive/2008/07/10/how-ie8-will-enables-silverlight-deep-linking-and-browser-back-forward-navigation.aspx) and Silverlight 2 (http://blogs.msdn.com/synergist/archive/2008/07/11/ie8-forward-back-in-a-silverlight-2-beta-2-application.aspx).  I'm still looking for a solution for FireFox and Safari."}, {"author_name": "Josh Parris", "gravatar_hash": "92f446269f65ef4213e94bd99aa3e475", "author_url": "http://parris.josh.com.au/", "date": "Jul 13, 2008", "message": "Well, that was transcribed in record time.  Who supplied the machine transcription?  It was awful, but it got about half the words right, so I think it was a minor net gain.\n\nFor some reason, the machine transcription got every place name absolutely right.\n\nWhat the hell is this CAPCHA?  You don't think that's going to work, do you?"}, {"author_name": "Nathan Fellman", "gravatar_hash": "898c2217a5457bdef0a0ed58283010dc", "author_url": null, "date": "Jul 14, 2008", "message": "I forget if it was on this podcast or a previous one that you asked for a good solution for recording phone calls to MP3.\nWhere I work we're in the process of upgrading to the latest Exchange server (2007?).  One of the advantages they're touting is that all our voice mail will be sent to our email inboxes, so we can check it off site.  That might be a good solution to the problem, assuming FogCreek uses Exchange server."}, {"author_name": "Jo", "gravatar_hash": "9d690d46a1dd4235cec2886d1dce5969", "author_url": null, "date": "Jul 14, 2008", "message": "@Michael - I think you're missing the point. \n\nEven if you do get the back button to work with some kind of browser hack, Silverlight/Flash will still not be web applications.\n\nThey will still be breaking the true beauty of the web."}, {"author_name": "Dan", "gravatar_hash": "6105f5790872b848e0d36ba4b3bc9419", "author_url": null, "date": "Jul 14, 2008", "message": "\"What the hell is this CAPCHA? You don’t think that’s going to work, do you?\"\n\nI don't think it's a CAPCHA more than an intelligence quiz.  With the number of pseudo intellectuals in the online IT community, I'm betting it's filtered out at least 200,000 posts by now."}, {"author_name": "Michael S. Scherotter", "gravatar_hash": "5bc16a644f52bd2c62283f1252ed1b41", "author_url": "http://blogs.msdn.com/synergist", "date": "Jul 15, 2008", "message": "Jo,\nI get the point.  I understand the technical beauty of a pure XHTML web but for some experiences a designer wants a better toolkit - that's where Silverlight/Flash/Flex/OpenLazlo come in.  Designers have much to learn about designing these experiences and working within the browser paradigm is one piece that most RIA &amp; AJAX developers miss.  Having a history, back/forth in the browser and updating page URLs makes that experience much more compelling and consistent.\nMichael"}, {"author_name": "Leon", "gravatar_hash": "7c38aea1e254c4bab69d8a001164132a", "author_url": null, "date": "Jul 15, 2008", "message": "Hey Joel\n\nTo have a phone number you can record audio you can use Skype In and Pamela - you'll have to leave a PC running and there may be issues with 2 people calling at once but I guess right now that's not likely to be a big issue is it?\n\nThanks for the great podcast by the way - always a great listen when I'm riding into work.\n\nAll the best\n\nL"}, {"author_name": "Don", "gravatar_hash": "d5f042c304716d3c3b43b0ae1b5e59f1", "author_url": null, "date": "Jul 15, 2008", "message": "Suggestion for callers to record MP3 files --- drop.io\n\nEach \"drop\" has a phone extension (off a number in the 646 area code, I think, so \"local\" to you Joel).  If someone calls and leaves a message, it shows up on the \"drop\" as an MP3.  The service also seems to be free for small accounts, as is typical for services getting hyped down here at SXSW.\n\nP.S. Thanks for the podcast.  I look forward to seeing if stackoverflow.com can help solve the problem of deprecated \"answers\" cluttering up the internet."}, {"author_name": "Sean", "gravatar_hash": "8922e4d5254d602ba3ed32dd073b5a4e", "author_url": "http://www.seans.com", "date": "Jul 20, 2008", "message": "The Marco stuff is irritating--despite what he thinks, both of his posts are examples of non-constructive criticism and posts that feel driven by animosity.  Basically, just childish.  Why do we run into so much of this in blog comments?  People are ultra aggressive, seems highly correlated to people who are ultra defensive.  (E.g. His misplaced animosity for OpenID, and Microsoft products).  For starters, he's wrong that Jeff is wrong.  Plain and simple.  If Microsoft was such a horrible platform for developing web content, what about MS' sites themselves?  '08 Olympics, etc. etc.  Just because a platform is the most common (e.g. PHP), doesn't make it the best.\n\nBut mostly--what's wrong with a class IMHO post where you share your differences of opinion in a kind way?  IMHO, I've found that the most talented people also tend to be the most humble--and the kindest to those that they disagree with."}, {"author_name": "romandas", "gravatar_hash": "812cac3d389b39d59bab4d75f02c73f0", "author_url": null, "date": "Oct 20, 2008", "message": "Jeff, I realize I'm responding well after the site was released, but I'm curious if you gained any inspiration from perlmonks.org, which IMHO is very similar to what you're trying to create with stackoverflow though obviously Perl-oriented."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 21, 2008", "message": "Hi Romandas,\n\nI haven't ever been to perlmongs.org , but I've heard good things!"}, {"author_name": "Yachtcharter Griechennland", "gravatar_hash": "4626647f05b35ea569823c26cedabfa0", "author_url": "http://www.poseidon-yacht-charter.com", "date": "Aug 24, 2009", "message": "Wow, I never knew that Podcast #13. That's pretty interesting..."}, {"author_name": "Yachtcharter Griechenland", "gravatar_hash": "4626647f05b35ea569823c26cedabfa0", "author_url": "http://yachtcharter-griechenland.de", "date": "Sep 19, 2009", "message": "Good post, but have you thought about Podcast before?"}, {"author_name": "Yachtcharter Griechenland", "gravatar_hash": "4626647f05b35ea569823c26cedabfa0", "author_url": "http://yachtcharter-griechenland.de", "date": "Sep 22, 2009", "message": "Good post, but have you thought about Podcast #13 before?"}, {"author_name": "Yachtcharter Griechenland", "gravatar_hash": "4626647f05b35ea569823c26cedabfa0", "author_url": "http://Pinkuin.com", "date": "Sep 25, 2009", "message": "Wow, I never knew that Podcast. That's pretty interesting..."}, {"author_name": "Jaagon", "gravatar_hash": "67847fe3e1cb5a25b2443e556575b2b7", "author_url": "http://annuairepagesblanches.org/", "date": "Sep 11, 2010", "message": "Good post, but have you thought about Podcast before?"}]}