{"response": [{"author_name": "Daniel", "gravatar_hash": "c084559c94d3bdcac637a6d85a577595", "author_url": "http://www.brilliantnotion.com", "date": "Jul 30, 2008", "message": "Can't wait to listen to the cast! BTW when is beta scheduled to be over?"}, {"author_name": "Dennis Kehrig", "gravatar_hash": "8836517222d65e4df1299d386f280bc7", "author_url": null, "date": "Jul 30, 2008", "message": "Concerning the cookie issue: how about also showing a link that contains the cookie ID which sets a new cookie with that ID when clicked. Then you could quickly bookmark the link to make your account survive deleting all the cookies. So instead of you making sure that my account is persistent, I take care of that myself.\nAt the same time it would be nice to (maybe optionally) disable this functionality for properly registered accounts (for those who want some additional security)."}, {"author_name": "Jared", "gravatar_hash": "278de5a72cfe229d3b7db0456db34e8c", "author_url": null, "date": "Jul 30, 2008", "message": "Re: no sign in\n\nI don't know too much about these sites [1][2] but came across them after Cringley pimped them[3].\n\n[1] http://www.mailinator.com/\n[2] http://www.talkinator.com/\n[3] http://www.pbs.org/cringely/pulpit/2008/pulpit_20080728_005308.html"}, {"author_name": "Eric G", "gravatar_hash": "2835e4d16269e541d2bef10b4b496528", "author_url": null, "date": "Jul 30, 2008", "message": "Don't make fun of coding on a crappy 27\" TV :)\n\nMy home is a no-work zone except for my laptop..but on occasion it's not handy and so I use the HTPC and the terrible IR keyboard for some quick work."}, {"author_name": "Sheldon McGee", "gravatar_hash": "994c22da11e6f0babd37f167b1a5fe32", "author_url": null, "date": "Jul 30, 2008", "message": "Hey, just wanted to let you know the link to \"the Chadwick chair\" has a couple of spaces that shouldn't be there: \"chadwick-chair-w--  tilt\".  Take out the spaces and the link works fine.\n\nSheldon"}, {"author_name": "Dinah", "gravatar_hash": "d97c394b2cf92c49fca089d2484813f3", "author_url": "http://softhardsoft.com", "date": "Jul 30, 2008", "message": "Regarding Joel's comment at the very end of the podcast regarding learning computer hardware vs learning C: agreed and I made the exact same point in the comments for that post on coding horror."}, {"author_name": "Ian Patrick Hughes", "gravatar_hash": "78897c96c45c02fa88b191c854fa83a8", "author_url": null, "date": "Jul 30, 2008", "message": "Is the user name \"Joel Spolsky\" available?\n\nAlso, I lost my cookie...."}, {"author_name": "Phil", "gravatar_hash": "a26a377646e76c1a6b9f1cc30c92f282", "author_url": null, "date": "Jul 31, 2008", "message": "Hey, regarding your discussion around using cookies to identify and track anonymous users - have you ever come across 'Tripcodes'. These are used on anonymous forums to people to identify themselves without cookies. See http://en.wikipedia.org/wiki/Tripcode."}, {"author_name": "McDowell", "gravatar_hash": "cf02ac6dae1a5494913e0c0c9d9956d7", "author_url": "http://illegalargumentexception.blogspot.com/", "date": "Jul 31, 2008", "message": "Dennis Kehrig's suggestion for an identity link is a good one. This could be tied in with an e-mail reminder too (you just store e-mail and cookie link, no passwords). This is similar to the sign-up mechanisms users are used to, so you benefit from the familiarity of it, and they can retrieve their identity by clicking on a link that sits in their inbox. The bookmark link alone may not be enough for everyone (I'm thinking of students on public terminals, etc). I like OpenID, but it is something you'll have to sell to your users."}, {"author_name": "watt", "gravatar_hash": "42ad44db8efe1a2b5e5e9214b444c971", "author_url": null, "date": "Jul 31, 2008", "message": "Jeff, I wish to suggest you should let beta testers run the site for few weeks (maybe with some invite system) - just to get good diverse community up, while not yet exposing the site to the masses from wider internets (note the folks who participate in beta period are more motivated and highly competent - I predict you will have vibrant, high signal community for the few weeks while folks play around in the \"closed club\" environment.) \n\nThat should allow more communities to form, not just .NET folks. I feel you are right about being concerned that if .NET folks flock to the site en masse, it will ruin the signal for others, and the site will become positioned in people's minds as \"just another .net forum\"."}, {"author_name": "Mat", "gravatar_hash": "c0389b4b6d15258ada2d27de1b0dc9b8", "author_url": null, "date": "Jul 31, 2008", "message": "I'm a PHP developer and have no real knowledge of the Microsoft stack.  I'm already on the beta list so there should be *something* non .NET on there even if I have to answer my own questions :)"}, {"author_name": "Matt", "gravatar_hash": "1c23587bf4956c04bb580a6d1310e678", "author_url": "http://assql.googlecode.com", "date": "Jul 31, 2008", "message": "Instead of regular cookies, why not use Flash \"Shared Objects\". They work the same as cookies, but are stored in a different location and are not cleared when you clear you browser cookies."}, {"author_name": "Brad Barker", "gravatar_hash": "f1bf5b6fbe43b29d5646f90b9eb06a0f", "author_url": "http://www.solutionsetsoftware.com", "date": "Jul 31, 2008", "message": "Jeff, being so obsessed with chairs is borderline unhealthy. I can't help but imagine the guy from \"Grandma's Boy\", laid back in his chair with 3 monitors, blasting techno.\n\nYes, actually I'm just jealous."}, {"author_name": "Scott Marlowe", "gravatar_hash": "fa5987941c18b93b6cc8af64c296477b", "author_url": "http://www.scottmarlowe.com", "date": "Jul 31, 2008", "message": "Enough w/the spoilers already! Jeff, your seemingly \"non-spoiler\", somewhat abstract reference to The Dark Knight revealed just enough to ruin that plot point for me. Please don't talk about movies anymore. Thanks."}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://robspages.net", "date": "Jul 31, 2008", "message": "I'm too new to .Net to contribute much to that channel. I do have experience to share in PHP, JavaScript, AJAX, XHTML and CSS. \n\nAny chance Joel and Jeff could leverage all of these great contacts they have to get some featured articles on the site and guest speakers in on the podcasts?"}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jul 31, 2008", "message": "@Matt:\nI don't think it makes sense to impose a dependency on Flash just so that someone's cookies aren't lost."}, {"author_name": "Jon", "gravatar_hash": "a71e275223c9e3b37c2b64b6e887a4a8", "author_url": null, "date": "Jul 31, 2008", "message": "There were about twenty to twenty-five comments on the preview post about the UI design all saying the same things... basically that the blatant Digg ripoff design  that you paid for doesn't fit the stackoverflow concept at all.  But all you got out of the responses was 'change a few colors' and you commented that it was all personal preference and a lot of noise?  It's a little early to be digging in your heels and ignoring feedback.  But listening to the podcast confirms that attitude.  Joel goes to great lengths to give you good advice and you basically say 'yeah you're right' and then completely ignore the advice."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": null, "date": "Jul 31, 2008", "message": "I think that the badge achievements and karma reputation scores might end up being unnecessary.\n\nHow many users do you expect to care about playing the game and accumulating points and trophies?  50%?  5%?\n\nAren't the questions/answers/discussions their own reward?"}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jul 31, 2008", "message": "People are collectors, especially IT Geeks apparantly. So an Achievement system is just a way to \"feel complete\" by collecting stuff. It worked on Pokemon, it works on the Xbox, why on on StackOverflow?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 31, 2008", "message": "> basically that the blatant Digg ripoff design that you paid for doesn’t fit the stackoverflow concept at all.\n\nHave you considered emailing the designer, Jeremy, directly with these concerns? He can be contacted through his website http://www.jeremykratz.com/"}, {"author_name": "Jon", "gravatar_hash": "a71e275223c9e3b37c2b64b6e887a4a8", "author_url": null, "date": "Jul 31, 2008", "message": "What an strange thing to say Jeff.  I'm not the one who paid for the design.  Sometimes I cant decide whether you are totally off your rocker or are just playing the net for more traffic to feed your pathological need for public attention.  Seriously."}, {"author_name": "Rushtik", "gravatar_hash": "f00c6a346db5a3c696a0cb33302f0cb5", "author_url": null, "date": "Aug 01, 2008", "message": "It was surprising to hear Jeff defending himself with going on vacation and the deadline not being important when the point was clearly about making poor estimates - not about him being late."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 01, 2008", "message": "Making *honest* estimates, you mean. :)\n\nIf I was being honest, I would have said \"it's done when it is done\" -- or at least been more clear about the first month being a period of only rudimentary work being done."}, {"author_name": "John Whitlock", "gravatar_hash": "f466cd52430bbd26978d5907bf8a08f1", "author_url": "http://john.myvidoop.com", "date": "Aug 01, 2008", "message": "Joel should check out http://emailtoid.net/.  It allows you to use an email address as an OpenID.  It significantly lowers the barrier for signing up for an OpenID."}, {"author_name": "charles", "gravatar_hash": "9aff0ab28f208573faa80d2cbd19ccfd", "author_url": null, "date": "Aug 04, 2008", "message": "The whole \"badge\" thing. I dunno, its cool, but its about as interesting as forum badges that are based on the number of posts. But not anything wrong with it either.\n\nHowever, I don't think it re-captures the \"Xbox 360\" badge system. Xbox 360 is about gaming, not answering programming questions. So you get to be \"spam cop\" if you mark 3 items as \"spam,\" I'm not sure people would go after that for the badges the same as they would go after the \"Eagle Eye\" (or whatever) badge in Tiger Woods 2008. And if they do, it seems like they would just mark random messages as spam to get the badge; or stick specific business logic for each particular badge.\n\nAnother thing, what is the big deal about anonymous posting? The whole cookie thing seems kind of clunky. Most programmers have more than one machine and will create a new account anyway. It seems like a lot of fuss for a \"friction free\" system. \n\nLook at the top forums on the Net; they have thousands of users contributing and they all had to sign up. Make the sign-up easy, don't bother with anonymous posting. And the idea that \"Well, we use Open ID and Open ID is a mammoth to sign up for, so we will have anonymous posting\" is not a great answer.\"\n\nNow, as far as the slippage of the deadline. Its no big deal, not talking about a lot of time here. Though, to be honest Jeff, whether you like or not, you, by virtue of having an ultra popular tech blog that you get paid to write, as well as your writing style (whether its some silly feigned \"Smackdown Learning\" thing or not) do act as some authority in software development circles. Therefore, your arguments to Joel about why you don't have a list are pretty silly! Something about \"Joel was a not taker in college and I'm not a note taker\" ... that's just totally ridiculous! Is the idea that \"Writing specs down while developing is for those note-taker people\" one of those Weak Ideas Weakly held? :)"}, {"author_name": "Grom", "gravatar_hash": "a14537020ec5b11fea3b956353724860", "author_url": "http://grom.zeminvaders.net", "date": "Aug 06, 2008", "message": "I am so hoping Joel talks about C in the next podcast. Its not a dead language and isn't going away anytime soon. Linux, GTK, GNOME are all written in C. Higher level languages like Python and Ruby use C for library bindings. The list goes on."}, {"author_name": "Alex Shnayder", "gravatar_hash": "548ec24fe45dc49ca5bc81ce6e7ba551", "author_url": null, "date": "Aug 16, 2008", "message": "On the subject of Open ID and stuff.\n\nEvery time some one posts, you can mail the verification link. If they click then you know they are the one that posted, if not then you can regard that particular post as an anonymous or unverified post which will have less weight in the badge system.\n\nThis way no one really has to verify or remember any links or stuff, just once in a while go over his email and click on a few links.\n\nYou can event send this verification email once a day or once what ever you prefer, to prevent email clutter."}, {"author_name": "Al Pex Tubing", "gravatar_hash": "246d55ae7c177e55e2066a24310e5f64", "author_url": "http://www.e-comfortusa.com/index.php?cPath=198_166_186", "date": "Aug 24, 2010", "message": "I am new to your blog, but I too could use a much better chair, though i think it get a nice expensive desk to go with it. I believe I was in the womb still when i first used Google."}]}