{"response": [{"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Jul 23, 2008", "message": "What is up with this constant changing of CAPTCHA.  There seems to be a new way to authenticate yourself with each podcast.  Why not just use OpenID, and block trackbacks and pingbacks by removing the PHP file that handles them."}, {"author_name": "Josh Parris", "gravatar_hash": "92f446269f65ef4213e94bd99aa3e475", "author_url": "http://parris.josh.com.au/", "date": "Jul 23, 2008", "message": "Because having an OpenID doesn't make you human.\n\nMy CAPTCHA: $2 management - now there's a comment on things...\n\nBTW: there's no noscript tag for if you've got JavaScript off.  Or at least, if you're blocking reCAPTCHA because you haven't un-NoScripted it"}, {"author_name": "John", "gravatar_hash": "a36dcc68d3616c2b4a95fca721d3c948", "author_url": null, "date": "Jul 24, 2008", "message": "Just to pick up Jeff's point on Code regions being an extra line of code and that partial classes can be used to help seperate your code more cleanly.\n\nEveryone can obviously code as they wish but I feel the points made don't really make that much sense?\n\nI don't see how creating a seperate file and using a partial class is \"cleaner\" than using regions? If you are seperating items into seperate files and someone comes into the project and doesn't know how you layout your websites/ applications they could have a harder time finding the code they wish than if it was all in one class but seperated by regions (not overly regioned).\n\nAnother point you made was that a region is an extra line of code, surely this is the same as having an extra set of using statements at the top of your second partial class file as well as the definition of the partial class itself?\n\nI agree with Joel that if you have got a lot of helper functions or something similar it is normally the case that they can be refactored into another class/ user control.\n\nOne thing I like to do is leave all of my main functions out of any regions, however I do region of the private/ helper functions as they are exactly that and don't need to be in the flow of the rest of the class."}, {"author_name": "Alistair", "gravatar_hash": "438c91736f20d0821c7a358ee8b00790", "author_url": null, "date": "Jul 24, 2008", "message": "speaking of Pixar, does the ITC theme tune at the end remind anyone else of the Monsters Inc. title music?\nanybody? no? Beuller?\n\nI'll get me coat...."}, {"author_name": "Steven", "gravatar_hash": "018f6a46d64db65d28b12dd1aa712489", "author_url": null, "date": "Jul 24, 2008", "message": "No!  I won't see WALL-E until it hits DVD later this year and you've already blown the ending. :-("}, {"author_name": "Mat", "gravatar_hash": "c0389b4b6d15258ada2d27de1b0dc9b8", "author_url": null, "date": "Jul 24, 2008", "message": "\"Most best\"? :)"}, {"author_name": "Magnar", "gravatar_hash": "7c4453ccef88852995d6b191307aab27", "author_url": null, "date": "Jul 24, 2008", "message": "Jeez, no spoilers please. We haven't all seen WALL-E, you know."}, {"author_name": "Søren Vrist", "gravatar_hash": "02855178b4bb98cb91f1a3b2b5c04e7a", "author_url": "http://svrist.wordpress.com", "date": "Jul 24, 2008", "message": "My stupid Windows Mediaplayer wont play this episode. It says that it might be the codex?!"}, {"author_name": "Thanks Guys", "gravatar_hash": "8ac1a0548e8b17625857c14d0e7fd563", "author_url": null, "date": "Jul 24, 2008", "message": "... so you opted to not cut the blatant spoiler off at the very start of the podcast? Thanks, I guess."}, {"author_name": "Arron", "gravatar_hash": "a31c67f29ac59ea5676387c81467c993", "author_url": "http://www.unkwndesgin.com", "date": "Jul 24, 2008", "message": "I love the reCaptcha audio captcha."}, {"author_name": "Joseph Pecoraro", "gravatar_hash": "b8745f0c7e7d1e31c3009bbf88159c58", "author_url": "http://blog.bogojoker.com", "date": "Jul 24, 2008", "message": "The Steve Yegge article is one of my absolute favorite articles:\nhttp://steve.yegge.googlepages.com/five-essential-phone-screen-questions"}, {"author_name": "WindyCityEagle", "gravatar_hash": "cee0f3218cec03aec856d7d295d162f3", "author_url": null, "date": "Jul 24, 2008", "message": "NadaSurf Popular-&gt;Weezer Undone -&gt; Weezer Pork and Beans\n\nBye bye 15 minutes and this hour's attempt at time management."}, {"author_name": "Scott Williams", "gravatar_hash": "3429df2e085587406780ca9e776f93b7", "author_url": "http://krazyyak.com", "date": "Jul 24, 2008", "message": "I love how http://fogbugz.com/heartbeat.asp is blocked by WebSense here. Apparently, it's a social networking site."}, {"author_name": "Terrapin", "gravatar_hash": "6b89ab6fe40aeae63df5509238078bcb", "author_url": "http://terrapinstation.wordpress.com", "date": "Jul 24, 2008", "message": "Jeff, be careful with the CacheItemRemovedCallback delegate. In theory, it should work fine the way you describe, but if you don't do it right, you could be looking and some large memory use issues over time, and possible a Stack Overflow exception (see http://blogs.msdn.com/tess/archive/2006/11/27/asp-net-crash-bad-cacheitemremovedcallback-part-ii.aspx)!\n\nThe System.Web.Caching class is versatile, but it wasn't really intended for use as a task scheduler.\n\nI like Joel's method with FogBugz. You don't even have to do at as a Windows service - just write a little console app that visits a little page on your site, and setup a scheduled task. If you're too busy to write it, I'll even do it for you. It just seems like a much cleaner solution, with minimal fuss."}, {"author_name": "Terrapin", "gravatar_hash": "6b89ab6fe40aeae63df5509238078bcb", "author_url": "http://terrapinstation.wordpress.com", "date": "Jul 24, 2008", "message": "One more thing - if you do end up using the Web cache class for the scheduled task stuff, make sure your CacheItemRemovedCallback delegate is static (see http://blogs.msdn.com/tess/archive/2006/08/11/695268.aspx)!"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": null, "date": "Jul 24, 2008", "message": "\"Windows Media Player cannot play the file.  The Player might not support the file type or might not support the codec that was used to compress the file.\""}, {"author_name": "Eric G", "gravatar_hash": "2835e4d16269e541d2bef10b4b496528", "author_url": null, "date": "Jul 24, 2008", "message": "I loved being able to listen in on the discussion about automatic scheduling; It reminded me of many conversations I have while working remotely.  Things that are so obvious at one end of the conversation can be completely lost in translation.\n\nPS:  The podcast hasn't played on wmp for windows mobile for weeks.  I've just been using an app called MortPlayer."}, {"author_name": "Dave Ward", "gravatar_hash": "755e1277329df9e6b7e6685b21108ee6", "author_url": "http://encosia.com", "date": "Jul 24, 2008", "message": "Adam should check into the strategy pattern instead of delegates."}, {"author_name": "Terrapin", "gravatar_hash": "6b89ab6fe40aeae63df5509238078bcb", "author_url": "http://terrapinstation.wordpress.com", "date": "Jul 24, 2008", "message": "Visual Studio 2005 does correctly locate Find keywords in regions."}, {"author_name": "David B", "gravatar_hash": "581e7a29e18c2d66cc2b347423c62a8f", "author_url": null, "date": "Jul 24, 2008", "message": "For method referencing, there is also Action, Func and Expression"}, {"author_name": "zainy", "gravatar_hash": "a302085e940e794455badfa5702fc91d", "author_url": "https://twitter.com/zainy", "date": "Jul 24, 2008", "message": "How does one get into the beta?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 24, 2008", "message": "> My stupid Windows Mediaplayer wont play this episode. It says that it might be the codex?!\n\nIf you had trouble playing back this episode (or the previous one), it may have been due to issues with the way the ID3 tags were stored on the file. The ITConversations folks are on it, and have re-rendered the episodes with a fix.\n\nSorry about that!"}, {"author_name": "Nick", "gravatar_hash": "fc8d4185fa3b625094482ef462159f57", "author_url": null, "date": "Jul 24, 2008", "message": "Thanks, Jeff. It works for me now."}, {"author_name": "Donal", "gravatar_hash": "09c81d75251a8ef5d797f293ea73df57", "author_url": null, "date": "Jul 24, 2008", "message": "On the subject of developers moving into management, it takes an effort to solve the people problem rather than the technical problem, and this unfortunately is  especially true for very good developers, for whom the quickest way of solving any problem is to crank up the IDE and fix all their subordinates' mistakes themselves. A friend of mine went cold turkey on coding when he was promoted, because he knew he'd never develop as a real manager otherwise. I'd recommend reading \"Soul of a New Machine\": it's a 1982 book about a team of hardware developers, but the geek types in it can be recognised by any contemporary software developer. There are a couple of engineers turned managers in it who struggle with suppressing and rechanneling their geekish tendencies, because it's not about how clever and producive they are as engineers any more, it's about their ability to get cleverness and productivity out of all the engineers working for them."}, {"author_name": "Andrew Herron", "gravatar_hash": "db28180c3d66f0eed1a0374bd42b5b39", "author_url": "http://spyder.wordpress.com", "date": "Jul 25, 2008", "message": "Regarding background tasks:\n\n\nDidn't you say you are using crystaltech for hosting?  In the web control center, under the site menu is \"scheduled tasks\".  Crystaltech will ping any URL on your site at schedules as small as every hour :)"}, {"author_name": "charles", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jul 27, 2008", "message": "Ya, the tickling method Joel described is far superior than trying to do some weird voodoo with the cache.\n\nOn another note, I don't want to be a jerk about this, I realy don't but ...\n\nI'm not trying to pick on Jeff but please stop abusing the word \"pathology.\"\n\nSimilar things could be said about all Web/Tech bloggers I guess. All their \"meta this and meta that\" gets a little silly. If I had to pic on Joel to be fair, although he isn't *that* bad about it, I would say: \n\n\"Joel, yes many of us have been to college and took Psychology 101 too.\"  =)"}, {"author_name": "Frank Carver", "gravatar_hash": "ea9e57e6b525bb5be217e9e547e2c7c4", "author_url": "http://blog.punchbarrel.com/", "date": "Jul 28, 2008", "message": "During a longer discussion about languages and blocks/functions, Joel opined that there may never be a reason to pass more than one function/block to a method. I'd like to offer a situation in which I felt strongly that I needed two function/block arguments.\n\nConsider a typical database query which selects some columns from some table or combination of tables resulting in an arbitrary number of rows. During such database access from an OO language, there are typically two code chunks which vary according to the purpose of the database access. \n\nThe first chunk is to convert the input values to the appropriate SQL (either by supplying parameters to a pre-compiled SQL statement with placeholders, or by building some literal SQL as a string.\n\nThe second chunk is to process each returned row of data. This may involve creating or populating some row object, directly calling out to some business logic  in a \"streaming\" manner, or whatever.\n\nIn the low-level database access tools I typically use from Java, each of these two steps can be provided as a \"functor\". This allows the basic database access code (connection opening, error handling, connection closing, etc.) to be completely generic.\n\nWhen I first experimented with Ruby I found the popular way of accessing databases (ActiveRecord) limiting in that it did not really support arbitrary queries or streamed result processing, so I considered porting the ideas from the Java implementation.\n\nI immediately bumped into the \"only one block\" limitation, as I needed tow bloks. For this and several other reasons, I am now spending most of my learn-a-new-language time on Python."}, {"author_name": "Yuval", "gravatar_hash": "16f92030c77f97528ba957faa8a6dc53", "author_url": null, "date": "Aug 13, 2008", "message": "Just a quick note about the Israeli IT market...\n\nI'm an Israeli Java programmer, and I can attest to the fact that there is in fact, as Joel said, a very dynamic spirit of entrepreneurship and the number of start-up companies in Israel is far from proportional to the number of IT working force here. These companies usually hire programmers directly, and because starting a new company is somewhat risky and demanding, programmers in start-up companies are usually highly compensated.\n\nThen again, most large IT companies (Amdocs, Comverse, Microsoft, Intel, HP...) have R&amp;D centers here, and they need masses of programmers. These are usually programmers with less experience or not enough technical background, and they work less hours for less money.\n\nThese programmers are sometimes hired directly, but the large companies usually prefer to take on armies of outsourcing workers, mostly for budget reasons, but also because it's convenient. Of course, off-shoring is also a popular option, but Israeli workers are still preferred.\n\nThe point is that while there is a strong initiative spirit in Israel, it isn't that different than the rest of the world in that a great deal of programmers still work through outsourcing companies.\n\nHaving said this, I'll say that outsourcing is not always that bad... when projects are short-term, one can meet a lot of interesting people, be exposed to a wide variety of technologies, and learn from the mistakes of many other programmers. It can serve as a good stepping stone in a programmer's career."}, {"author_name": "iHeartDucks", "gravatar_hash": "28772e8dc1742bbab62b7c36398cd369", "author_url": null, "date": "Oct 29, 2009", "message": "Disappointed with Wall-E!!!! I thought people who love Flight of the Concords can never disagree on something!!!!\nI have been listening to this podcast from Episode 1 but... Did you say Disappointed with Wall-E????"}]}