{"response": [{"author_name": "Rob", "gravatar_hash": "c290d3851c7837081d05b3491cbc331b", "author_url": "http://cantgrokwontgrok.blogspot.com", "date": "Jul 26, 2008", "message": "Hey Jeff,\n\nI like the look so far. Clean, simple, important content has the foreground.\n\nLooks like its coming on well. Can't wait to see the final product.\n\nKeep up the great work, I am enjoying watching the developments unfold as well as the podcast :)"}, {"author_name": "Mike Tomasello", "gravatar_hash": "295bccb34897e178de5c5c90442baaeb", "author_url": null, "date": "Jul 26, 2008", "message": "While it's by no means hideous, it isn't exactly pretty either. It's so plain that it looks like... an ASP site (no idea why, that's just what I associate with plain web-sites).\n\nThe only thing that concerns me is that the 'language' that the question applies too isn't really that prominent, particularly with multiple tags. I think the language tag on say, refactormycode.com, is much more obvious. Maybe there is considered to a problem with whether something might be marked as ASP.NET, C#, HTML, whatever, and so just listing all of them equally... I'm not so sure."}, {"author_name": "Mike Tomasello", "gravatar_hash": "295bccb34897e178de5c5c90442baaeb", "author_url": null, "date": "Jul 26, 2008", "message": "Rob said:\n\n&gt; I like the look so far. Clean, simple, important content has the foreground.\n\nAnd it occurred to me that nothing has the _background_. Everything seems to be emphasised equally, except perhaps the nav bar and the headings on the right (which are more important than those on the left???)"}, {"author_name": "Arron", "gravatar_hash": "a31c67f29ac59ea5676387c81467c993", "author_url": "http://www.unkwndesgin.com", "date": "Jul 26, 2008", "message": "Looks not-to-bad.\nI am picturing allmost every PHP question having at least 2 tags... \\\"PHP\\\" \\\"MySQL\\\""}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jul 26, 2008", "message": "Hmmm... I like the _layout_ i'm just not a fan of the color grey, and the buttons at the top (Questions, Tags, Users, Badges, Ask a Question) seem out of place and too big. How about creating buttons with rounded corners? I don't know if that works on every browser when using the CSS Tag, but that's what tables can be abused for.\nI'm not a designer so i do not know if that would solve it, but especially the \"Ask a question\" Button looks out of place. ESPECIALLY because on the right side it does not line up with the right side of the search bar and the \"What is SO?\" box below it.\n\nI see that grey is the color used in the logo but hmmm... no. It looks a bit bland.\n\nSorry that i'm just one of those people that say \"I don't like it\" without actually giving any helpful advice, but i'm no designer and have no idea what EXACTLY i don't like, except for the buttons on top."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 26, 2008", "message": "I agree that the right had too much emphasis. I already changed the nav elements on the right; they are solid light grey boxes with no headers now. I'll just update the screenshots.."}, {"author_name": "Alistair Parr", "gravatar_hash": "f372050aa6a28e8ce353401094ecf9b8", "author_url": "http://www.aliparr.net", "date": "Jul 26, 2008", "message": "Really beautiful design, simple and effective. I love that the mantra of low-friction that you've been talking about in the podcast has really translated to the design. It's difficult to comment on actual content because we don't know how the site will actually operate yet; but this looks really encouraging. My advice would simply be make it as easy as possible to get to 'the meat'."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jul 26, 2008", "message": "That new Design is a LOT better! The grey does not look as depressing anymore and it's easier to immediately see where the content is.\nOnly the Buttons on top are still not my taste but i don't have a good alternative suggestion."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 26, 2008", "message": "plus, this version has A MONKEY FLINGING MONEY as an ADVERTISEMENT! Who doesn't love that?\n\nSeriously, it's a rhetorical question."}, {"author_name": "Cristian", "gravatar_hash": "7faed2352a1c5e5b4295f4500711a3e0", "author_url": null, "date": "Jul 26, 2008", "message": "Looks nice. At first glance I thought Digg-clone, but that's not a bad design to steal. =)\n\nI think the site could use a \"Languages\" section. The first thing I wanted to do was look at the top questions for Python and there was no easy way of doing that. I'm sure I could search for it or look in Tags, but that's a lot of effort for something that I think will be pretty common. Maybe you could \"borrow\" a horizontal navbar like Digg?\n\nAnother thing that might be nice is a \"My Questions\" section. I always run into the problem of forgetting the answer someone gave me and having to refer back. That could be part of a user's portfolio but a quick, easy way of getting that info would be awesome."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jul 26, 2008", "message": "I thought it was some kind of evil wizard :-)\nBut if you have an advertising space, try to get Ads by BustedTees. Alex changed his advertising on TheDailyWTF to some cool companies, except that these Companies do NOT have Erica Sullivan :-(\nSo that's your chance to step in!\n\nhttp://2.media.bustedtees.com/bustedtees/mf/c/8/bustedtees.0715a0acc37c835cb0b1c21892c48202.jpg\n\nNot to mention the Foosball and Beanbag girls...\n\nYeah, you have to make your living with the site and therefore need advertising revenue more than Alex, but I hope that the Ads remain tasteful and IT-related, aka. no Pokemon Cursors or Scientology-Ads."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 26, 2008", "message": "> I always run into the problem of forgetting the answer someone gave me and having to refer back.\n\nYour user page (you will have this even if you never 'log in') should serve this function; it contains a list of all the questions/answers/tags you've participated in. As well as a list of all the badges you've earned, along with a summary of your reputation score and where it came from."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jul 26, 2008", "message": "A little semantic thing: Maybe change \"Ask a New Question\" simply to \"Ask a Questions\"? The New seems superflous as the verb \"Ask\" already implies that.\n\nI also think that the major languages should be more prominent, also that questions should be tagged for n languages. That is: If my question is about C#, I tick the C# box and enter any additional tags. But if it's a .net-Related question, i could also tick the VB.net Box.\nThis could become a little bit messy when you think of (Iron)Python, (Iron)Ruby and Delphi(.net), but depending on the amount of questions it may not matter wether we talk about the .net Version of the language or not.\n\nAnother Bold idea: Make one Web Part Page where Users can create their own Dashboard. For example, I would like to have one page where i can see: My recent questions, All the newest Questions, All the newest Questions with a specific Tag. Maybe something else. But with some Web Parts, that would be absolutely Kick-Ass."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jul 26, 2008", "message": "For the badges: Have you tried giving them a border? Just a little 1px border like the tags on the Articles. I found that adding a Border helps small elements to stand out a bit more.\n\nI'm not sure if the design of the badges is good. It looks like a Badge, but also like an arrow pointing down so for people who are not familiar with the concept it looks at first that it's something bad that downrates people.\n\nMaybe take a Badge Design where the shape points up or a completely symetric shape."}, {"author_name": "dbr", "gravatar_hash": "edf857d71f672d8f411ef6b8376316b8", "author_url": "http://neverfear.org", "date": "Jul 26, 2008", "message": "Looks good, but can I request that the HTML structure (well, specifically the CSS identifiers) change as little as possible..?\nSince not everyone will like any one design, leaving the CSS identifiers consistent will not break userStyles.css constantly. For example, I don't like bright/white-backgrounded sites, and any sites that I use regularly (For example, digg, reddit, google) I find/create a userstyle to darken everything (http://userstyles.org has a lot)"}, {"author_name": "Artur", "gravatar_hash": "a278b2dda325e512c1362e866e28f48c", "author_url": "http://www.arturcarvalho.com", "date": "Jul 26, 2008", "message": "I like it too. Could you show how a question page looks like?"}, {"author_name": "david", "gravatar_hash": "ef079515af1c9963c7cd33e0b4f00e88", "author_url": "http://dlinsin.blogspot.com", "date": "Jul 26, 2008", "message": "I like the design! It's very neat and clean. However, I'd suggest to put a tag-cloud on the right hand side. I always liked the idea of having the most famous topics highlighted."}, {"author_name": "McDowell", "gravatar_hash": "cf02ac6dae1a5494913e0c0c9d9956d7", "author_url": null, "date": "Jul 26, 2008", "message": "&gt;Trust me, you do not want to see the “programmer” design we had before this.\n\nI'm not so sure about that. Were there any important design changes beyond merely making it prettier? How did those changes improve usability?"}, {"author_name": "macbirdie", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Jul 26, 2008", "message": "Very neat design, I like it.\nYou should think about abbreviating questions in the headers without cutting the words in half though, like \"Quest\", \"obj\", for instance. Would be a nice addition at some point of site development."}, {"author_name": "Zizi", "gravatar_hash": "a2434ff7cd1dba4d58aadd4a5d8d5fee", "author_url": null, "date": "Jul 26, 2008", "message": "How will the site scale on wide monitors?\n\nOne of my worst reading nightmares is having a 800 pixel wide webpage on the left side (or in the middle) of a 1920 pixel wide screen.\n\nWhich part(s) are you going to scale? :-)"}, {"author_name": "Mike", "gravatar_hash": "4b048ac4d1f321791b4cadb767f74bf3", "author_url": null, "date": "Jul 26, 2008", "message": "Show us original version of design 8) I would really like to compare it to my crap I do sometimes..."}, {"author_name": "FalconNL", "gravatar_hash": "2e41d52b2986c0c63a2f464e34b7b3f3", "author_url": null, "date": "Jul 26, 2008", "message": "Posts currently take up quite a bit of vertical space. With widescreen monitors pretty much becoming the default this means only a few posts will be visible at a time, requiring a lot of scrolling. On my 1680x1050 monitor I can see about 5 posts (the tags of the last one are cut off). Compare this to reddit.com, where I can see about 16 posts at a time.\n\nAlso, the ask a new question button has the same visual style as the buttons that show different categories. I'm not sure, but I think making it a different color (a medium green or so) would help differentiate it from the other buttons and make it easier to find (I didn't spot it at first glance).\n\nAs for the style I have to say I prefer reddit's quieter aesthetic over the digg-like \"lots of colors\" approach, but that's a question of personal taste."}, {"author_name": "OmegaSupreme", "gravatar_hash": "eb3318422e8381f1fdfb845488d2ce1e", "author_url": null, "date": "Jul 26, 2008", "message": "I like it. Easy on the eye and shows the info clearly. I look forward to using it."}, {"author_name": "Scott Marlowe", "gravatar_hash": "fa5987941c18b93b6cc8af64c296477b", "author_url": "http://www.scottmarlowe.com", "date": "Jul 26, 2008", "message": "Looks good. Clean, straightforward, with a clear mission statement and access to the most important information. The thing that makes the page is the monkey throwing money, though. Just kidding.\n\nI agree with the poster above that maybe the \"Ask a New Question\" button is a little confusing. Maybe it should just be \"Ask a Question\", whereupon the search tries to find a match. Similar to when 'digging' a story. It tries to match it something that's already been dug first.\n\nLooking forward to getting some actual use of the site."}, {"author_name": "Shaun Austin", "gravatar_hash": "d6c392552f0147de5213e7689d3c68f2", "author_url": null, "date": "Jul 26, 2008", "message": "Jeff, liking the look of it so far. One thing that occured to me immediately is to ask if there is a way of filtering to find only the unanswered questions or even questions that haven't been answered satisfactorily yet?\n\nBasically I can see myself deciding to spend a free hour on the site seeing which questions I can answer, and a quick way of getting to the outstanding questions would be cool!"}, {"author_name": "Christian Zachariasen", "gravatar_hash": "d74bce85c2fe89352a153df6e34457ea", "author_url": "http://bocuma.net/uncanny", "date": "Jul 26, 2008", "message": "I really like the look of the site. I've been following your podcasts and they are fantastic. I can't wait to use the site!\n\nI think it would be an educating experience to see how the design has changed over time. It would be great if you would put up a couple of screen shots or something."}, {"author_name": "Tomas Pajonk", "gravatar_hash": "bbe97c3fa23d557d5cdaec1fef8e28db", "author_url": null, "date": "Jul 26, 2008", "message": "Hello,\n\nI rarely write posts anywhere. I just want to say this all looks great and like  many others I can't wait to start using this site. I do have loads of questions and I haven't really found any good place to post them. I am looking forward to use this site.\n\nThe design looks simple and elegant I'd say."}, {"author_name": "paul celi", "gravatar_hash": "8218051965d32ae09c6591948081c1ec", "author_url": null, "date": "Jul 26, 2008", "message": "Looks ok so far. I think it lacks a quick way to see everything the site is containing, some Digg like categories bar.\n\nAlso it's very classic. I wander if you couldn't come up with a whole different way of presenting things.\nEasy to say ;)..."}, {"author_name": "charles", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jul 26, 2008", "message": "I'd like the \"answers\" number to be more prominent, perhaps it could just be on top and the \"votes\" thing be on bottom. I find voting to be mostly worthless; i.e. digg."}, {"author_name": "chakrit", "gravatar_hash": "104c34a4803355ade79413372205138a", "author_url": null, "date": "Jul 26, 2008", "message": "First thought that comes to mind: Too many sharp edges! how about some rounded corner love\n\nAnd for usability, I think people should really be \"using\" it w/ the \"asking question\" mindset or whatnot before commenting about it."}, {"author_name": "Alvin Ashcraft", "gravatar_hash": "19ac6a9d902c1d6ae33f41405e47b385", "author_url": "http://www.alvinashcraft.com", "date": "Jul 26, 2008", "message": "I agree with Charles. I would like to see 'answers' be more prominent than 'votes'. Overall, I think the site design looks great... simple and clean. Can't wait to start using it.\n\nBTW, monkeys flinging money... always fantastic."}, {"author_name": "paul celi", "gravatar_hash": "8218051965d32ae09c6591948081c1ec", "author_url": null, "date": "Jul 26, 2008", "message": "charles: I think votes are interesting because as I understand it, they are related to a particular editing of the answer, not to the question.\n\nQuestion is: how votes are going to evolve as the answer gets edited."}, {"author_name": "Kyle", "gravatar_hash": "54b10a0a6ae3cd65201fc3bc3c4ed492", "author_url": null, "date": "Jul 26, 2008", "message": "I'd recommend trying to compress the links a bit. A little white space is good, but I'd try to cram as much above the fold as possible."}, {"author_name": "Shannon", "gravatar_hash": "1204456b59157047dc7cd9717a93e876", "author_url": null, "date": "Jul 26, 2008", "message": "Ok, critique time.  Jeff/Joel, I hope you read this and seriously consider this before you continue with your site design.  You don't have to agree with me, of course, but please think about the direction you are going here.\n\nThe site looks fine, in the sense of the blogosphere world and tracking blogs or other one-off posts.  But, who is your audience here?  It seems that you are aiming at the skilled developers who will be answering questions, but I thought the intention was exactly the opposite.  I thought the intended main audience was for people who needed to learn and didn't want to look it up in a book.\n\nHere's the crux of the issue.  You have x posts on the front page and a search box.  Now, I know that if I came looking to find out how to, say, use lambda expressions in C#, that the search is going to give me a bunch of garbage that may or may not be related to what I want.  Or maybe I'm just lazy and don't want to search... which will apply to a lot of people.\n\nThe easiest thing for me to do?  Hit 'Ask a Question' and say 'How do I use Lambda Expressions in C#?'.  Now that post is on the front page and every skilled developer is more than happy to answer it because you've set up a Points Reward Game.  It doesn't matter that there are now umpteen-billion Questions with the exact same subject and answers.  It doesn't even matter that the person who answered it answered the same question a hundred times already... because, yay, more points.  And now the Search function is even more useless because it will return all these one-off garbage Question and Answers.\n\nNow, you might think, we'll just punish the developers who contribute to that... But don't.  Don't ever punish or discourage in any way the people who are contributing their time and knowledge to others.  Your site will quickly become a ghost town if you do.\n\nNow, what's the net effect here?  If a Question that you are looking for isn't on the front page... it might as well not exist and you'll just Ask a New Question.  The site's usability degenerates into a Question of the Day site or, basically, you're just duplicating the function of a Forum.\n\nThe current design encourages this...  If this is going to be a reference site, wouldn't it be better to have sections and categories?  Then a newcomer would go to the C# section, scan the current non-archived Questions on Lambda Expressions and see if the answer they need is there.  If not, *then* they can Ask a Question.  I'd offer that they shouldn't even see the option to ask until they've looked at a certain section/subsection.\n\nAnd maybe not even have a 'Recent Questions' list prominently on the front page?  You could maybe move that to another page so that interested Question Answerers can scan it, but it shouldn't be the main focus of the site.\n\nMy two cents on the design.  I'd like to see this site succeed, because I think it could be a valuable resource for many people at all levels, but I think you might need to take a step back and reconsider your design approach."}, {"author_name": "Shannon", "gravatar_hash": "1204456b59157047dc7cd9717a93e876", "author_url": null, "date": "Jul 26, 2008", "message": "Just an additional thought:  If I'm new to a language and I'm trying to learn, the search is definitely useless when I don't even know what I'm trying to find.  On the last podcast, someone asked how to handle pointers to functions in .NET.  That person would never have typed Delegates into the search box.  They would probably type C# and Pointers and mabe he would have found Delegates, but probably not.\n\nAs I said, I would really like this to succeed, but I think this aspect needs to be thought out a little more before going forward with the design."}, {"author_name": "paul celi", "gravatar_hash": "8218051965d32ae09c6591948081c1ec", "author_url": null, "date": "Jul 26, 2008", "message": "Shannon: Very good points, though there are some counter badges, like for pointing out the question has already been asked.\nI think overall your right on the: rethink it all"}, {"author_name": "Nicolás Miyasato (miya)", "gravatar_hash": "313a517a47d3bcf4091e397204facec9", "author_url": "http://nmiyasato.blogspot.com", "date": "Jul 26, 2008", "message": "AS long as it's not tremendously ugly and quite usable I don't think that design is an issue.\nYou'll see that whatever design you choose, we'll get used to it. Just keep in mind not to change it every now and then. Because whenever you change it, people will have to re learn (regardless it's for their own good) where the buttons and all that stuff all over again."}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Jul 26, 2008", "message": "I dig it. Nice and simple. easy to use and navigate. just like wikipedia. send it to press."}, {"author_name": "monkey", "gravatar_hash": "a58cf658f3479a68bc801348902f48bc", "author_url": null, "date": "Jul 26, 2008", "message": "looks great clean and simple\n\nPlease don't put anything else on the page like tag clouds - they suck and the catergories will only show what is 'popular' when I might want to see unpopular stuff say.\n\nAre we going to be able to change background color and main text color?\n\nJust think of us dyslexics \n\n\nAlso are you using color to convey meaning (the badge system)  color blind people won't register that at all!"}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jul 26, 2008", "message": "I'm not sure why I would be interested in the top questions and the top users. I'd rather see new activity.\n\nIf something gets really popular, it's just going to get stuck at the top. That's not very useful."}, {"author_name": "DanaL", "gravatar_hash": "e901a2d717ddedce52fd6a1e010f2c86", "author_url": null, "date": "Jul 26, 2008", "message": "I've seen on some websites they also have places for people to submit articles on different subjects, will there be a similar feature available at some point? That may be useful for recurring questions and other things."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 26, 2008", "message": "> Question is: how votes are going to evolve as the answer gets edited.\n\nYes, I wish I knew the answer to this.. at the very least edit history will be shown, along with (eventually) the ability to diff changes. But there's only one post \"owner\" at any given time. It's tough.\n\n> I’d rather see new activity.\n\nAgree. Front page is actually about recent activity, so the \"top\" is a bit of a misnomer at the moment.\n\n> scan the current non-archived Questions on Lambda Expressions and see if the answer they need is there. If not, *then* they can Ask a Question\n\nI agree duplicates are a huge problem -- and you're right that any points system might accidentally encourage duplication, which is worse. The Ask page proactively searches and displays 5 likely matches on blur of the question title field. We'll see if this is enough or not."}, {"author_name": "Curtis", "gravatar_hash": "10e9b4d6de6a815d154856eca64ceaeb", "author_url": null, "date": "Jul 26, 2008", "message": "When I first saw the design, I thought, \"Well, it does look like digg, but it could be worse.\"  But after thinking about it a while, I really think this front page gives the wrong message, and will negatively affect the way people use it.\n\nStackoverflow, as you have said, is supposed to be a reference for programmers.  Instead, it looks like you are building a social networking site for programmers.  These are two completely different things.\n\nThe focus of the main page is \"Top Questions.\"  What does that even mean, in the context of a reference website?  A question may have an easy, one-line answer, or be a more complicated issue that provokes a real discussion and have various ways to answer it.  But a question should have a boolean value: answered or not answered.  I can see it now: \"Vote up if you want to know how pointers work!!\"\n\nSites like reddit and digg survive on \"churn\": the constant introduction of new links to bored users.  That's why you get so many complaints when there are repeat posts; only new content is worthwhile there.  But on a reference website, the old is not only useful, it is better than the new.  So the old, existing questions and answers should be promoted over the new.\n\nI suggest, first off all, that new questions not even be on the front page.  New questions should have a page, with a related RSS feed, that can be monitored by those who like to answer questions.  It should be easy to filter this page, to only show topics that the user is familiar with.  Why should a PHP programmer even see new questions about C#?\n\nThe front page should be like the front door of a building.  Instead of letting everyone congregate in the entranceway, people should be encouraged to explore the building, and find the room with people who share their interests.\n\nTherefore, the front page should 1) introduce new users to stackoverflow and its mission, 2) be a place where community news can be posted and discussed, and 3) act as a portal to the more interesting, topic-specific sections of the site.  Please see the Wikipedia main page for a look at a better, but not perfect, front page: http://en.wikipedia.org/wiki/Main_Page .\n\nI love the idea of stackoverflow and want it to succeed, but these issues need to be thought out more carefully."}, {"author_name": "csmba", "gravatar_hash": "e8ec9371b0173179ee41dd68e0e80ddd", "author_url": "http://someofmythoughts.blogspot.com/", "date": "Jul 26, 2008", "message": "1. the \"importance\" of an article I assume is some kind of magical formula. Some of the features to that formula are clear, like positive and negative votes. To some degree (not sure what the weight is) date should also be a factor. Older answers should get less importance, all else equal then new ones.\n\n2. The \"digg\" effect, of showing me the votes, is that really important? I could see a world in which this list is sorted by the magical formula, but I wouldn't see the left \"votes\" values. Right now (based on simple screen, not using) the idea of showing the information at all is in my opinion counter productive. Google doesn't show you WHY the first result is the first, you don't care what is the page rank score for each result, you just want to get relevant info. Same here."}, {"author_name": "Alasdair", "gravatar_hash": "9286ce2d2199426ac66007862bccd37f", "author_url": null, "date": "Jul 26, 2008", "message": "While I think the design is clean and simple, I wonder whether it will work as a question/answer site. It looks very much like a social news site. Such sites thrive on new content, and usually have very poor search features since most users simply couldn't care about what was posted a week ago. I could probably count on 1 hand the number of times I have wanted to find an old article on Reddit or HN. I don't object to you having the questions as the front page on your site, it's a question site - that's why we're going to go there. I don't want to have to click through a news front page or similar to get to the real content. However rather than following the stripped down model of social news sites, I think the search and tagging features need a much more prominent place on the front page. Remember most users will probably go to stack overflow to get answers, and that should be a key focus of the design. Search should be the focus of the page, along with your tagging system - they should not be relegated to a box in the corner and a tab at the top.\n\nIf the user can't find an answer, only then should they post a question. You don't really want users posting questions before searching so the 'ask' button shouldn't be as central as the search box (pointing out similar answers as the user enters their question is a brilliant idea btw). Of course once a user has searched, found nothing, and finally posted a new question that question should be easy to find. Now you can take some cues from the social news sites (but not that many). Why put answers with lots of votes on the front page? Those are the questions that have been answered, you don't need those ones on the front page. You are the opposite of a social news site in that you want the newly posted unanswered questions without many votes or answers on the front page. You might think that you want to showcase the really good answers on the front page, but they are going to fall off the front page soon enough anyway. When a user comes to your site they will notice those questions first, and if they know about the topic they might just answer it. Once it's gotten a decent answer or has been on the front page for a while it can be then be found via it's tags or through your awsome search system - no need to keep it on the front page any longer.\n\nWhat happens when a question isn't answered? Maybe you should split your search and tag results into two. One column for the best and most relevant results and another for recently posted unanswered or poorly answered questions. That way it's easy to get unanswered questions if I'm looking to help someone and it's just as easy to get results if I'm looking for help myself.\n\nAnd one last silly idea - if a user repeatedly answers haskell questions (for example) you should tailor the front page to show the type of questions they usually answer. However that's only going to work if they are logged in..."}, {"author_name": "paul celi", "gravatar_hash": "8218051965d32ae09c6591948081c1ec", "author_url": null, "date": "Jul 26, 2008", "message": "&gt; Yes, I wish I knew the answer to this.. at the very least edit history will be shown, along with (eventually) the ability to diff changes. But there’s only one post “owner” at any given time. It’s tough.\n\nBetter make it simple (IT people level simple) and transparant. If people don't get the rules, they won't play the game."}, {"author_name": "rob allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://robspages.net", "date": "Jul 26, 2008", "message": "I had a 3 paragraph post with my suggestions all ready and decided to scrap it and post a pic of them instead: \n\n<a href=\"http:\\\\robspages.net\\stackoverflow\\stackoverflow_changes.jpg\" title=\"changes\" rel=\"nofollow\">Here</a>"}, {"author_name": "rob allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://robspages.net", "date": "Jul 26, 2008", "message": "<a href=\"http://robspages.net/stackoverflow/stackoverflow_changes.jpg\" rel=\"nofollow\"> Try this instead</a>"}, {"author_name": "Andre Casteliano", "gravatar_hash": "91183569939ffc13908564521f460a5d", "author_url": null, "date": "Jul 26, 2008", "message": "Looks good, and I'll be using it from the day one, but I agree with other comments on the search issue. You realy need to make the search box more prominent, encouraging the use."}, {"author_name": "Patrik", "gravatar_hash": "9f27be6a30f5e2a0a1eb16c9321787e3", "author_url": "http://www.firstdrafthell.net", "date": "Jul 26, 2008", "message": "Looking good. Reminds me of Digg.com, which is something I think most people will feel comfortable with. Keep up the good work.\n\nP.S. I've totally missed out on the beta sign ups. Is there ANY way to be part of that list?"}, {"author_name": "Nick Retallack", "gravatar_hash": "44aed468fe438682bd13224ff4d28041", "author_url": "http://nickretallack.com", "date": "Jul 26, 2008", "message": "A bunch of people mentioned \"making languages more prominent\".  But for me, the line between talking about a \"language\" and an API, framework, library, etc is kind of gray.  These days you can get bindings for everything, so just because you're talking about using SDL in C++ doesn't mean it wont be helpful to someone binding to it with pygame or ruby-gosu!\n\nHowever, it is nice to be able to really quickly recognize the tags you do want to see.  What about giving each tag a custom color scheme based on a hash of its name?  There was a firefox extension once that did that based on site titles.\n\nAlso, yeah, make that big \"ask a question button\" the same width as the search bar above it and the column below it."}, {"author_name": "Woongbin", "gravatar_hash": "75634431b8b7bc8b37cc1673d7d789e9", "author_url": null, "date": "Jul 26, 2008", "message": "Is it just me?\nI'm kind of bothered with the fact that every other boxes are 'rectangular', with sharp edge but the tag boxes are not-they are round.\n\nHey I really like the design in overall, and umm I always have fun reading your posts. I am also very excited to see one of people that will be watching a birth of (my future favourite) website!\n\nKeep up the good work! Thanks"}, {"author_name": "James L", "gravatar_hash": "d99f577fbc627f640fe8b845e2911cc9", "author_url": null, "date": "Jul 27, 2008", "message": "Too many colors, and hard geometry.  Needs softening up a bit in my opinion."}, {"author_name": "John", "gravatar_hash": "d0b76ae7bf261316683cad31ba0bad91", "author_url": null, "date": "Jul 27, 2008", "message": "I like the overall design I feel though my eye is drawn to the tags too much may be not such a bright colour?"}, {"author_name": "John", "gravatar_hash": "d0b76ae7bf261316683cad31ba0bad91", "author_url": null, "date": "Jul 27, 2008", "message": "I also agree the search box needs to be more obvious as it is the first thing you are looking for and currently it is hidden in the top right corner."}, {"author_name": "Chris James", "gravatar_hash": "03ba53c50132509d417d62f3fc81592a", "author_url": "http://www.purplehaze.me.uk", "date": "Jul 27, 2008", "message": "When I first read this, I thought the first piture was the programmer design. It's alright, its clean, but not fantastic. \n\nStill as someone said, its similar to Digg, which is nice."}, {"author_name": "Roland Tepp", "gravatar_hash": "0f83be58c6c968f558b2cfda93183f28", "author_url": null, "date": "Jul 27, 2008", "message": "Looks a lot like a Digg clone to me...\n\nSome of the previous comments already pointed at few of the shortcomings of this design, so I will not go too deeply into these, just enough to say, I agree with Aldasair, csmba and Curtis...\n\nIn a way of constructive criticizm, I'd suggest to make the \"Ask a Question\" (drop the \"new\", it is superfluous) into something much more prominent on a home page. I'd use it as a primary search box - typing in my question and pressing \"Ask\" would show me a listing of most likely answers to my question and then, if none of the answers are \"good enough\", allow me to post my full question - goes with the \"least friction\" idea you've been advocating so much.\n\nOn the design side of things I'd avoid looking too much like a known site (like digg), as your site should have it's own identity ... borrowing good ideas from existing sites isn't a crime, but you've got to know what and how to use it.\n\nThe design should follow the intent of the site ... currently, I do not see the the software developers knowledge exchange, I see news and social networking - and although this is ultimately going to be a \"social software\", the emphasis should still be more on \"programmer to programmer\" rather than \"me and my buddies\""}, {"author_name": "Ryan", "gravatar_hash": "ab7c8cd9bfc94ab2eae4a39e229a712e", "author_url": "http://www.ryantm.com", "date": "Jul 27, 2008", "message": "I feel like the search box is too small. Check out how amazon.com makes a giant searchbox. It's nice."}, {"author_name": "Carsten", "gravatar_hash": "84acdbfd6fdb586c9f93c003393b60fc", "author_url": "http://www.kopis.de", "date": "Jul 27, 2008", "message": "Hm, didn't read all the comments, but for me the layout looks very digg'ish. Anyone? But I like it. Clean and simple, hope the final site won't get overloaded like all the other forums &amp; help pages for so-called developers."}, {"author_name": "Chris Johnson", "gravatar_hash": "64963f8edb22a0c35b5f3f4fdba80b67", "author_url": "http://www.chris-j.co.uk", "date": "Jul 27, 2008", "message": "I agree with what Shannon said (July 26th, 2008 at 9:27) - what will make this site work is a easy-to-use archive of old questions, which (given time) will cover the majority of questions.\n\nThe sample set of .NET question raises another concern for a C++ on UNIX programmer like me. If most of the new questions are not in areas that I know, I'm not going to be around to answer those that I can help with. Will there be a way of filtering by subject, so that only (for example) C++ and Algorithms questions appear on my frontpage?"}, {"author_name": "Robert Taylor", "gravatar_hash": "c8ec79b6a626ce9a847405f2ad1eb60f", "author_url": null, "date": "Jul 27, 2008", "message": "One way to encourage searching before asking a question is to make the search box more prominent on the homepage. Keep the \"Ask a Question\" button, but when the user clicks it, put focus into the search box and, at the same time, display a non-modal, fade-away  message to \"Please try searching first; type your question here\".  At the bottom of the search results page, have an \"Ask a Question\" area (similar to these blog comments) with the question text already set to the search terms.\n\nThat way you can easily combine the two biggest features of the site - find and ask questions."}, {"author_name": "Jeremy Privett", "gravatar_hash": "4e054c6536dea787c2a5fef25a2f868e", "author_url": "http://www.jeremyprivett.com", "date": "Jul 27, 2008", "message": "Other comments have touched upon my concerns, so I won't repeat them here. I will say that I'm looking forward to Stack Overflow, though. Is the upcoming Beta you mentioned a public or private one?"}, {"author_name": "lubos", "gravatar_hash": "fbe44f66ebaf6fde7bf976c0319f434f", "author_url": null, "date": "Jul 27, 2008", "message": "WOW! I actually like this design a lot and wouldn't change a bit."}, {"author_name": "Steve", "gravatar_hash": "7dbc53d4ccb31c1889b6f8f8e30ced74", "author_url": null, "date": "Jul 27, 2008", "message": "Is this the pre-populated stuff from Joelonsoftware's forums? It's looking very .NET-biased to me, which is a bit of a shame.\n\nI like the idea of creating a view (based on tags, and other search criteria) and setting it as your default view."}, {"author_name": "vishnu vyas", "gravatar_hash": "a7478c8203f42fed060b2f2de7935328", "author_url": "http://blog.vishnuvyas.com", "date": "Jul 28, 2008", "message": "Looks sleek and easy on the eys. But the tags and buttons seem big to me. \n\nWhat happens when there are more than 5 tags for a question?"}, {"author_name": "Rob", "gravatar_hash": "29d4625b3e15ecef1ff05565fbfacd58", "author_url": null, "date": "Jul 28, 2008", "message": "I like the design so far, but a couple of suggestions.\n\n- Even with filtering on the page I might want to monitor for a couple different language that I am familiar with, so having the language specific tags color coded and in a more prominent location would be nice. One good example of this is RefactorMyCode - http://refactormycode.com/\n\n- What type of ads are you going to be using? If the site is going to be mostly text based, then image based ads will likely be very distracting.\n\n- It's not shown in this example, but how is code going to be displayed and we will be able to do some light customization to the code so we can see it in our preferred format? For example, light on dark background, or dark on light background."}, {"author_name": "Sean", "gravatar_hash": "9b5b69a29967dc41d5ddfdee09b27b73", "author_url": null, "date": "Jul 28, 2008", "message": "I was also thrown by the badges. My first though was why is Jeff using hearts.\n\nWhat about and upside down chevron (point to the top)?"}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jul 28, 2008", "message": "@Patrick:\nIf you'd listened to the past 2 or 3 podcasts, you'd know how to get into the beta. ;)"}, {"author_name": "Sean Patterson", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Jul 28, 2008", "message": "Rob beat me to the punch above, but I definitely agree with a color coding, or even some cool icon style, scheme for the different languages involved. That way when I'm looking at top or recent questions, I can quickly tell that the question \"How do I get the username field?\" is applying to C# or SQL or PHP or whatever without necessarily clicking through. I've been on a couple of other coding answer sites and it always aggravated me to see the title of \"How do I...\" and then have to click in or find the tiny subtitle to see which language it applies to.\n\nI also am curious as to the approach with the same old question asked multiple times. What if there was a \"signpost\" or something clever that can tell the person submitting the question to look at this post for your answer. It doesn't have to be \"cute\" but \"clever\" enough that people can feel to redirect questioners to a previously answered question without making them feel offended about not fully searching first. 8^D"}, {"author_name": "Ian Anderson", "gravatar_hash": "60b1c7dc18e08e1a16f313354814744f", "author_url": "http://thefirstpost.co.uk", "date": "Jul 28, 2008", "message": "How about coloured language badges? Displayed alongside the questions in any list view\n\nI like the screen so far. I thought Shannon's points were excellent, and I'm glad you're aware of the problem, Jeff.\n\nDuplication is the great enemy of this project. For it to work there has to be one canonical \"what's the best email validation regex?\", not fricking hundreds."}, {"author_name": "John", "gravatar_hash": "294e456262367eda07133a51b96ff52b", "author_url": null, "date": "Jul 28, 2008", "message": "The box to the left of the question should read 75 votes 2 replies--not answers, unless somehow you can ensure that people are actually answering the question and not just replying with comments or followup questions."}, {"author_name": "Josh Stodola", "gravatar_hash": "ac11bb0472c37bf41ca166ec849d3a02", "author_url": "http://blog.josh420.com", "date": "Jul 28, 2008", "message": "Looks like a Goldman...\n\nGeeze, nice freakin CAPTCHA.  Only took my nine times.  If you have this bullshit on StackOverflow, you can count me out already."}, {"author_name": "Adam", "gravatar_hash": "22dbf9d42e043d7ef19f3f2bfdb3ede6", "author_url": "http://voltagex.org(currentlydown)", "date": "Jul 28, 2008", "message": "Hope it's not .NET only. Not all of us use those languages."}, {"author_name": "Victor Marquez", "gravatar_hash": "98732b3a10b3bf2c5d28977676774e61", "author_url": null, "date": "Jul 28, 2008", "message": "I think this design do not reflects the purpose of the site. Basically I agree with what Aldasair, csmba, Curtis and others have said. This design is ok for a social site, and not for a reference site.\n\nMain page should have other purpose; Language/Framework filters should be primary filters; Prominent search box; Prominent Ask a Question; Ability to get RSS filtered by tag(s); etc. \n\nVoting... mmm... voting. I am afraid the voting system will provoke easier issues/problems/questions to go to the top because more users are looking for those but then, how more seasoned programmers would find valuable content when they come to look for more difficult questions? Does less techical level questions and answers have more value than high level ones?"}, {"author_name": "pacifika", "gravatar_hash": "42786a4364f7fe5b27371e84f2bee8fa", "author_url": "http://amasan.co.uk", "date": "Jul 29, 2008", "message": "In my opinion the Ask a new question button is in an unexpected position, not somewhere where you would look when you want to ask a new question, I would try and see if you find the design more usable by moving it to the Top Questions position or to the left of it. At the moment it's too near the search box where you'd look when you can't find what you're looking for, unless that's the philosophy (making it harder to post questions as you want to make people search first)"}, {"author_name": "Thejesh GN", "gravatar_hash": "4545b2a84b0ae407abc97ad8f23cc28b", "author_url": "http://thejeshgn.com", "date": "Jul 29, 2008", "message": "The design looks good.\n\nWill it support OpenId for login?"}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://www.johntopley.com/", "date": "Jul 29, 2008", "message": "I like it."}, {"author_name": "Stephen cox", "gravatar_hash": "ce1e4968486487134806e8c091f043cc", "author_url": "http://www.stephencox.org", "date": "Jul 29, 2008", "message": "Please, please show some love to us geeks who have old eyes. Like, use a decent font size (not 10, try 12). And test to see if the browser increases the font size it doesn't break the site layout. Be nice if the site met a few of the accessibility guidelines. Since you using ASP.NET see http://msdn.microsoft.com/en-us/accessibility/default.aspx.\n\nI do like the general design. Thanks for the work."}, {"author_name": "Richard Reed", "gravatar_hash": "176d61ba20c6d0d79524f7e1d74be970", "author_url": null, "date": "Jul 29, 2008", "message": "The design looks nice, but I agree with those who were unsure about the site's purpose.  I had been under the impression that the site was going to be oriented more towards becoming a good programming reference (replacing those sorts of books, right), and I don't see how this design goes along with that.  Right now, it looks a lot like a social bookmarking site, which tend to encourage posting new content rather than building up the quality of existing answers.\n\nI suppose that I'll see for myself when the  beta launches, but until then this design causes a little concern."}, {"author_name": "Doug", "gravatar_hash": "f179061225f887523c5908c2d2cd1196", "author_url": null, "date": "Jul 29, 2008", "message": "Well, a lot of people so far have mentioned that the site looks like digg, because it does.  From a usability standpoint this is fine, I guess, because people understand how digg works.  \n\nBut if you actually paid people to design this, I would ask for your money back, because there was no 'design' involved, just a bit of 'me-too' tweaking.  Obviously I haven't used the new site yet, but just looking at this I would bet dollars to donuts that, in coming up with the design for stackoverflow, very little attention was paid by the designers to how you intend the site to actually work.  The flip side of having digg's look and feel is that people will use it exactly like they use digg, which I think is not your goal."}, {"author_name": "hhrvoje", "gravatar_hash": "8ff9c51aba1259ba4548e6718ffe3629", "author_url": null, "date": "Jul 29, 2008", "message": "I would LOVE to see developers version of design :)"}, {"author_name": "Martin Marconcini", "gravatar_hash": "81605bd0acefe569da6f9d93a684b156", "author_url": "http://gryzor.wordpress.com", "date": "Jul 29, 2008", "message": "I want to know how to get (and what does it mean) to be a Necromancer. :)\n\nLike the design. But I agree that it's too Dig like."}, {"author_name": "steveth45", "gravatar_hash": "06f4639cd80930603ddc21a248673c2e", "author_url": null, "date": "Jul 29, 2008", "message": "Programmer design is awesome. Just look at programmer designed games with programmer created art: http://en.wikipedia.org/wiki/Moraff's_World . OK, I'm guilty too: http://steveth45.net/blog/?p=39 ."}, {"author_name": "Nick Masao", "gravatar_hash": "eab0da6446dd9209a51ac590967af967", "author_url": null, "date": "Jul 29, 2008", "message": "Its a nice design.Simple, easy to use."}, {"author_name": "Tim Bartle", "gravatar_hash": "14a9caeeacfc0cd8cc99b6e5eae75428", "author_url": null, "date": "Jul 29, 2008", "message": "I agree with hhrvoje. PLEASE can we see the developer's version of the design ? I also agree with the people who say it is too derivative, I don't really digg it. Sorry ;-("}, {"author_name": "indivent", "gravatar_hash": "efd28623add25421afa2884b466163c4", "author_url": null, "date": "Jul 29, 2008", "message": "how about changing the moss green color? i'd suggest trying the orange color used for \"questions\" instead. also, can you align the \"ask a new question\" box to the right? to be honest though, i'd be happier if the site looked like this:\nhttp://web.archive.org/web/20041209040106/http://digg.com/"}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jul 29, 2008", "message": "INSERT INTO [dbo].[Users]([UserTypeId], [OpenId], [OpenIdCleaned], [CookieToken], [CookieVersion], [Reputation], [LastAccessDate], [CreationDate], [Email], [DisplayName], [DisplayNameCleaned], [WebsiteUrl], [RealName], [Location], [Birthday], [HasMessage], [BadgeSummary], [AboutMe])\nVALUES (@p0, @p1, @p2, @p3, @p4, @p5, @p6, @p7, @p8, @p9, @p10, @p11, @p12, @p13, @p14, @p15, @p16, @p17)\n\nDo we get birthday presents on our birthdays?\n\n@Martin Marconcini: As mentioned in the article about the badges, the Necromancer badge is for answering a question a year after it's been asked.\n(Personally, I think it's a bad idea to reward this...)"}, {"author_name": "mufaka", "gravatar_hash": "4cfa352afe2f4ece6abf85463b1483c3", "author_url": null, "date": "Jul 29, 2008", "message": "I like the look and feel being similar to Digg. Yes, this will be a reference site, but it's also a social site. I will definitely be interested in what others are asking even if it has no relevance to my current projects.\n\nAlso, a solution in one language doesn't mean it only pertains to that language if it is algorithmic or conceptual. Which is why categorizing isn't the  best way to present this.\n\nThis is a great idea and I hope it gains traction.\n\nP.S. Woah, the captcha does weird things on the iPhone. It bounces the page around on each key down."}, {"author_name": "Tim Yen", "gravatar_hash": "60b71121580d709f0d1376fb95a696c1", "author_url": "http://theoccasionalobservation.blogspot.com/", "date": "Jul 30, 2008", "message": "I would also put the search box front and centre, and maybe you need some kind of navigation section on the left like codeproject.\n\nWhy don't you get Joel to look at it, you have a UI expert there?"}, {"author_name": "elgrego", "gravatar_hash": "ab2a58e8da0c229fcff3f6face82ac17", "author_url": "http://www.elgrego.org", "date": "Jul 30, 2008", "message": "The boxes on the right draws to much attention for my taste. Is that really the most important thing in the page or can the constrast be reduced in order for more information relevant elements to have focus?"}, {"author_name": "giancarlo", "gravatar_hash": "01ae113e2590011db75bed7cc1301e10", "author_url": null, "date": "Jul 30, 2008", "message": "Why copy digg when reddit's design is so much better? Especially for programmers. It is also cleaner and faster to load. I'd say change the articles so you can see at least 15-20 questions without scrolling. and have categories at the right side instead of top users. Keep the rest. \n\nAlso please release now or it's going to get old."}, {"author_name": "Arron", "gravatar_hash": "a31c67f29ac59ea5676387c81467c993", "author_url": "http://www.unkwndesgin.com", "date": "Jul 30, 2008", "message": "I'm only posting because the captcha is a bad word.\n\ncaptcha: punta co"}, {"author_name": "Tom", "gravatar_hash": "82c92236fc17fe352015c6e56b16caf6", "author_url": null, "date": "Jul 30, 2008", "message": "I'm not a big of this layout.  It looks way too much like a link farm / social news site.  My first thought was \"hey, a picture of dzone.\"\n\nIf this is what it ends up looking like, I'll probably check it out, but I think it'll be of limited use to me as a C++ systems programmer.\n\nOnly five questions on a page?  Believe me, I don't want it to look like the Joel on Software forums but there has to be some middle ground.  No navigation, or categories at all, just tags?  If anyone asks a question that's even mildly obscure or untrendy (let's say JSF component design technicalities, or GWT questions, or SQL performance tuning), seems like it would fall off the front page pretty quick and it would force experts to take a long path to even find those questions, let alone answer them.\n\nI want this to succeed, but I don't think you've solved the UI yet.  My imagination was something like a streamlined wiki, where users could really dig into a particular topic by drilling into categories and following links between articles.  Questions would come in through the front page and get tagged, farmed out and categorized as users answered them.  Questions with no responses would get moved into a particular queue monitored by experts in that area.  I dunno."}, {"author_name": "reader 101", "gravatar_hash": "72ec9f9d06d51e5b10e2266dd813077d", "author_url": null, "date": "Jul 31, 2008", "message": "I think you should get rid of the top users and recent badges boxes. I'm probably wrong but it may encourage users to answer every and any question just to get the ranks and badges. \n\nInstead of top questions by votes or views how about hotly contested (ordered by amount of responses in the last few hours) and stumpers (questions that have been asked recently but not answered yet) ."}, {"author_name": "macbirdie", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Jul 31, 2008", "message": "There's one thing that would be nice to have in Stack Overflow. It's a feature I've seen in GMail - when you're writing a response, GMail notifies you in real time of any other responses appearing, because there's a chance your answer might be a duplicate as soon as you send it.\n\nAnother thing - there might be supporters who just post a link to a web page somewhere on the intertubes with an answer, not adding any insight to the subject. Sure, that might be helpful, but not really worth much credit for the \"redirector\" (that could make a badge ;) )."}, {"author_name": "Robert Myers", "gravatar_hash": "376c3b9c84ccf6efd80d05e07ac35e83", "author_url": null, "date": "Jul 31, 2008", "message": "You guys should set up a \"Get Satisfaction\" (getsatisfaction(dot)com) site for your beta."}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Jul 31, 2008", "message": "Stackoverflow, Digg edition.  I'm not sure if that's good or bad.  I would have preferred something a bit more original, personally, as I'm afraid the frontpage here is going to be fast moving, chaotic, and ultimately useless (just a hunch, though).  I'd rather it devote a lot more space to tag/categories rather than so much to whatever happens to be hot at the moment."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 31, 2008", "message": "If you're curious about the \"programmer\" design, Kevind Deloach was kind enough to send in this screenshot he captured\n\nhttp://blog.stackoverflow.com/wp-content/uploads/stackoverflow-alpha.png"}, {"author_name": "Mark Struzinski", "gravatar_hash": "ed7dec07c571e2c32e8aa536ad31dca3", "author_url": null, "date": "Aug 01, 2008", "message": "Jeff,\nI love the current design. It's clean and to the point. I actually think the digg-like UI will seem intuitive to the audience, since most of them have experienced Digg in the past."}, {"author_name": "Stephen Cox", "gravatar_hash": "4ec688bc969d57547ff77e873600d663", "author_url": "http://www.stephencox.org", "date": "Aug 01, 2008", "message": "Ok i like the \"developers design\". Simple, easy to see everything. Remember the purpose of the site."}, {"author_name": "Jay", "gravatar_hash": "5a691cfe6d9aa38afc89c28a65e1f21c", "author_url": "http://www.calistomind.com", "date": "Aug 03, 2008", "message": "While this design looks nice, its nothing new or original. It just looks like a Digg clone for programmers, something along the lines of DotNetKicks. I was expecting something that could take the concept of CodeProject and take it to another level."}, {"author_name": "Bob", "gravatar_hash": "dd889988746976d9a462fa4c9c20463f", "author_url": null, "date": "Aug 04, 2008", "message": "Interface looks just like Digg. Worth a different look, perhaps?"}, {"author_name": "MattH", "gravatar_hash": "8364802a3e4700212ed0807fbe008cb8", "author_url": null, "date": "Aug 05, 2008", "message": "As a beta tester, I think the site works functionally.  \n\nHowever, there are so many colors and so many boxes I find the site distracting.  Maybe I'll get used to it, but right now I find it too busy.  (My captcha is 'complain', the irony)"}, {"author_name": "Slavo", "gravatar_hash": "528f3acc8d119dcc6c7817deda454251", "author_url": "http://slavo24.wordpress.com", "date": "Aug 07, 2008", "message": "I like it a lot. I can't get a complete impression on how things would work just by seeing the homepage, but altogether it looks very nice and usable.\n\nP.S. How come Joel never posts here?"}, {"author_name": "theanti9", "gravatar_hash": "437cb559ec83e2ed8bcb198dcd91a1e5", "author_url": "http://www.slushnet.com", "date": "Aug 10, 2008", "message": "Looks good guys. cant wait to see the final design. Definitely looks better than a programmer site :P"}, {"author_name": "Adam", "gravatar_hash": "75d3124527041d29892cd1f3e829959e", "author_url": "http://www.namsisi.com", "date": "Aug 12, 2008", "message": "old design was so much better!!! please change back!1 the new design sucks!!"}, {"author_name": "Rohit Sharma", "gravatar_hash": "8e9026f0d59ecfd54f2940ce5b4d8dac", "author_url": null, "date": "Feb 17, 2011", "message": "Waiting for its arrival.."}]}