{"response": [{"author_name": "Matt Hamilton", "gravatar_hash": "2bd5f782c135ff7ed12a95bf209eb973", "author_url": "http://www.madprops.org", "date": "Jul 12, 2008", "message": "If you have a set of tags with which you'll be seeding the site, it might be possible to have some tag-specific badges. For example, \"Snake Charmer\" for someone who answers ten questions in the \"Python\" tag, or \"Precious Stone\" for the same thing under \"Ruby\".\n\nThis might encourage folks to diversify a bit and learn about other languages/domains in order to contribute and earn the badges.\n\nPerhaps answering question in every category other than \"C\" would earn the \"Atwood Wannabe\" badge! ;)"}, {"author_name": "sparkes", "gravatar_hash": "1808d03cbe52b51c32deb84098668cbd", "author_url": "http://zx-81.com", "date": "Jul 12, 2008", "message": "How about a neophyte award for people not too scared to ask really, really basic beginner questions in the company of hackers but who have asked them really well.  Reward newbie coders for asking the right questions for once.\n\nDark arts award for people answering questions about pretty obscure things from the dark ages.  The kind of person who can answer a question about device drivers authoring under VMS.  These guys taught us what we do now and we should respect that they still take the time to answer our questions all these years later.\n\n1up award for games specialists.\n\nIt's a potentially endless exercise and I'm looking forward to how this feature expands as much as I am getting answers to my own questions and helping others with their problems."}, {"author_name": "Arron", "gravatar_hash": "a31c67f29ac59ea5676387c81467c993", "author_url": "http://www.unkwndesgin.com", "date": "Jul 12, 2008", "message": "Jeff (and Joel), you guys have had me interested since the first post on Jeff's blog.  I looked over the list here and I cant wait to start collecting.\n\np.s. I love the captchas... should keep the mindless drones out..."}, {"author_name": "maeghith", "gravatar_hash": "88b9eb83c552686a5b21f09bc61197e8", "author_url": null, "date": "Jul 12, 2008", "message": "I've become instantly fascinated by the 'Necromancer' one, but I don't know if it's something good (on other forums I've been it it's not seen with good eyes to revive an old topic), and you can easily game the system by reviving any 1yo topic to get that badge.\n\nPropossal to make this not so bad:\n'Medium': revives 1yo topic (just renaming necromancer)\n'Necromancer': answer after reviving is voted down (bad medium)\n'Paladin': first who votes down a medium's answer thus converting the medium to a necromancer\n'Cleric': answer after reviving is voted up (good medium)\n'Acolyte': first who votes up a medium's answer thus converting the medium to cleric\n'Holy guacamole': answer after reviving gets more votes up than any previous answer\n'Robot Devil': answer after reviving gets more votes down than any previous answer\n\nI'll leave the metal selection to you :)\n\nAlso you can have combos, like 'generalist'+'good answer'='brainstorm trooper' or the first time an user gets all the badges of one kind he can get a '$metal colector' one, or something like that.\n\nUh, I'm not even thinking if those could be gamed, so I'll stop now."}, {"author_name": "Ian Sinke", "gravatar_hash": "907a3c1cbb3aca298193193ed5d3d4b9", "author_url": "http://iansinke.wordpress.com", "date": "Jul 12, 2008", "message": "That's fine, but they're ugly. Really ugly. Go see a designer."}, {"author_name": "Shaun Austin", "gravatar_hash": "d6c392552f0147de5213e7689d3c68f2", "author_url": null, "date": "Jul 12, 2008", "message": "I'm certainly finding the idea of the medals and the points system quite interesting but having been a follower of quite a few community sites (code project for example) I know that their scoring systems are several orders of magnitude more complex than what you're proposing and are always being tweaked to eliminate the gaming aspect. I wonder if the proposed scoring for stackoverflow is a bit too simplistic?\n\nSecondly, I notice the \"Founder\" badge, is this a badge that only yourself and Joel is eligible for or does it apply to a core of members beyond the beta signups. It would be cool to award the Founder badge to say the first 0.5% of members so as the membership grows then more of the early members fall into the Founder category.\n\nJust a thought!"}, {"author_name": "Hüsyin Tüfekçilerli", "gravatar_hash": "ea7063d6a51a923ca945008d137aaaa0", "author_url": "http://huseyint.com/", "date": "Jul 12, 2008", "message": "Something like \"The Troll Cap\" and \"The Crown of Royalty\" of 37signals' blog Signal vs. Noise seems more appealing in terms of graphic design, will the StackOverflow badges always be text-based?\n\nhttp://www.37signals.com/svn/archives2/introducing_the_troll_cap.php\n\nhttp://www.37signals.com/svn/archives2/the_crown_of_royalty.php"}, {"author_name": "Kristian Erbou", "gravatar_hash": "19f7f7e2cfed6ba29067f15b05405279", "author_url": "http://justanothersoftwareengineer.blogspot.com", "date": "Jul 12, 2008", "message": "There's a lot of smoke and you guys are definately talking the talk (have been around for over a year now) but I think that the first version of www.stackoverflow.com should be released shortly. You are keeping a fair amount of users who are motivated to use your system and provide feedback on hold for way too long I think... Please deliver something shortly because we're anxious to see what you have in mind with www.stackoverflow.com - and I am convinced by what I have read about the vision of the website that an implementation of token economy such as badges is not a must-have feature for this system to be shippable."}, {"author_name": "David McGraw", "gravatar_hash": "840264c45b706fb829d406e9c61a1889", "author_url": "http://www.david-mcgraw.com", "date": "Jul 12, 2008", "message": "I'm a huge fan of a rewarding system.  This sounds like a great start.\n\nSome ideas\n----------\n* Explorer Badge\n-- n topics/questions viewed\n-- monitored by page views\n-- Can't exceed 10 minutes on a page (preventing people trying to camp out)\n-- Awards those that lurk, reads a lot\n* The Padawan Badge\n-- Received n down ticks from site users\n-- Indication of one who is learning still\n* The Mentor/Jedi Badge\n-- Received n up ticks from site users\n-- Indication of a clear mentor\n* THE Stack Overflow Badge\n-- Badge should clearly indicate dedication given to the website and it's users. In addition, it should seek those that are knowledgeable, and should clearly select those that will go above and beyond to help those in need.\n-- Measured several ways of which you (Jeff) can decide\n* The Genus Badge\n-- Rare\n-- Given to those that have attained n number of best answers.  \n-- Will promote well thought out answers (hopefully)\n* The Sleeper Badge\n-- Given to those that forget about us. ;(\n-- On that note, being awarded a badge should fire off an e-mail. ;p Of course, you can select not to receive badge e-mails...\n* Marathon Badge\n-- Given to those that are extremely dedicated and who are passionate about trying to help.\n-- Answered several questions under many different tags/languages.\n-- Rating, editing, etc\n-- Time sensitive badge\n\nNote: Your beta badge uses a silver graphic, not gold."}, {"author_name": "Artur", "gravatar_hash": "a278b2dda325e512c1362e866e28f48c", "author_url": "http://www.arturcarvalho.com", "date": "Jul 12, 2008", "message": "I like badges too. I was first bitten by them in www.kongregate.com. \n\nThe badges should be attractive.\n\nAll the badges should be attainable. If the founders one is just for you and Joel I know I'll never had all the badges. That annoys me a bit."}, {"author_name": "Nicolás Miyasato (miya)", "gravatar_hash": "313a517a47d3bcf4091e397204facec9", "author_url": "http://nmiyasato.blogspot.com", "date": "Jul 12, 2008", "message": "Wouldn't it be nice and really fun to have the \"other\" kind of badges? Like, \"Do not pay attention to me\" badge, or \"Spammer\" badge or \"Flame generator\" badge?"}, {"author_name": "Syd", "gravatar_hash": "014c459819f16343df5da52a26fcabb6", "author_url": "http://www.fairgroundtown.co.uk/", "date": "Jul 12, 2008", "message": "How are these going to be displayed? If they are just in your profile \"detail\", then no one will see them, and you don't really get the kudos - there needs to be some indicator \"in\" your posts, next to your avatar or something.\n\n(Is the real site going to have math captchas? I hope they don't get too complicated - I've only got 10 fingers Jeff!)"}, {"author_name": "Steve", "gravatar_hash": "dfd66c0fea953eacfefed0bcc238fe28", "author_url": "http://randomoli.wordpress.com", "date": "Jul 12, 2008", "message": "As the first commenters mentioned, I think Badges based on specific (official?) tags like Python, Ruby, C#, Windows, Multi-platform, etc, etc is crucial."}, {"author_name": "ejunker", "gravatar_hash": "5aaf05ebaccc935b15ce7c6b51876b4e", "author_url": null, "date": "Jul 12, 2008", "message": "I'm not sure if some of the metrics for the badges will result in the overall benefit of the site. For example, it isn't good for managers to reward programmers based on number of lines of code because the programmers will just write really verbose bug ridden code when shorter more compact code would be better. I'm afraid some users will just create junk posts or collude with their friends to get the badges. Or do other bad things such as flag a post just so they can get the Citizen Patrol badge."}, {"author_name": "Joe Ludwig", "gravatar_hash": "1b7e29718274dea309d474bfc6f08d1c", "author_url": "http://programmerjoe.com", "date": "Jul 12, 2008", "message": "I fear that some of the bronze badges will cause some of your \"players\" to spam the site with stuff that's of no value.  If you put a reward up for something people will do absolutely the easiest thing they can do to get that reward.  For some of these badges that means posting \"asdf?\" in a question, \"asdf!\" in an answer (and again in a year old question), adding some random tag to some random post, etc. This is obviously not what you want to have happen, but you're actually encouraging it by giving badges for those things."}, {"author_name": "Dave", "gravatar_hash": "e74e7299da165db42a5a461e150b82ff", "author_url": null, "date": "Jul 12, 2008", "message": "You mention in your podcast that to get to test the beta site you should help transcribe the podcast.\n\nTo get the beta badge will there be multiple beta phases of the website so we can earn this later or should I start transcribing now?\n\nGetting hooked on the idea of the badges and as Artur [July 12th, 2008 at 7:00 am] points out \"All the badges should be attainable.\""}, {"author_name": "Rudd Zw", "gravatar_hash": "dca8abee1255f6425a4cebf403263c24", "author_url": null, "date": "Jul 12, 2008", "message": "The badges are a great idea, but I'd definitely prefer if they looked prettier.  Perhaps something more resembling a badge than a round color?  Shiny?  Anything, really.\n\nIs there any indicator of what badges someone has without viewing their profile?  For instance, it could be a set of three small colored buttons next to their name each with a number of that type of badge.\n\nAnother idea is to only give these badges out if the achievement is voted well enough.  If someone asks a question but people vote it down, there's no reason to give them the badge.\n\nAlso, I think I saw some suggestions for badges that have a negative connotation; I hope you ignore those.  If I make a mistake and do something bad, I don't want my profile to showcase my mistakes for the rest of eternity, even when I've improved in my contributions to the site."}, {"author_name": "Arron", "gravatar_hash": "a31c67f29ac59ea5676387c81467c993", "author_url": "http://www.unkwndesgin.com", "date": "Jul 12, 2008", "message": "\"There’s a lot of smoke and you guys are definately talking the talk (have been around for over a year now) but I think... \"\n\nI'm not sure where this is coming from I've been following this since the first rumors that 'something' was going on and it's been substantially less then a year."}, {"author_name": "David McGraw", "gravatar_hash": "840264c45b706fb829d406e9c61a1889", "author_url": "http://www.david-mcgraw.com", "date": "Jul 12, 2008", "message": "In response to people gaming the system.\n\nI'm sure there can be a way to implement it to where elders can flag a post good or bad.  If somebody is randomly posting junk posts, they're rated down.\n\nI think a user rating system is an essential way to mitigate the no valued addition.  Those people who are noted down enough, should knock them out of a running for a particular badge."}, {"author_name": "David McGraw", "gravatar_hash": "840264c45b706fb829d406e9c61a1889", "author_url": "http://www.david-mcgraw.com", "date": "Jul 12, 2008", "message": "\"... badge that have a negative connotation; I hope you ignore those. If I make a mistake and do something bad, I don’t want my profile to showcase my mistakes for the rest of eternity, even when I’ve improved in my contributions to the site.\"\n\nI would argue that it provides a user the satisfaction that they are learning.  For me, knowing that I'm improving is an achievement in and of itself.  If I can get somebody to recognize where I lack, that helps me.  You can have a badge that denotes that you need some work, so it motivates you to work on it.  When you do, that badge is supplemented with an achievement that denotes your progress. \n\nOn that note, I think users should be able to signal what badges they present on their profile.  Maybe somebody is really proud of a few of their badges, but don't really care about others."}, {"author_name": "Brian Brewder", "gravatar_hash": "a00ef268d501a11f698c8cc97156e489", "author_url": "http://www.redwerb.com", "date": "Jul 12, 2008", "message": "What about an award for somebody that has a \"Best Answer\" in 10 or more categories (or something that will be considered beyond typical). Perhaps it can be called the Genius award or something along those lines.\n\nPerhaps you can have an annual awards show called the Stackies :). There could be categories like Best Answer for 2008 and things like that."}, {"author_name": "Stephen Cox", "gravatar_hash": "4ec688bc969d57547ff77e873600d663", "author_url": "http://stephencox.org", "date": "Jul 12, 2008", "message": "\"All the badges should be attainable.\"\n\nDamn straight. No special badges for anyone. Ruin the system that way. Drop the founder and beta badges. If you want those folk to stand out them award a special icon  or something."}, {"author_name": "Mark Harrison", "gravatar_hash": "f79b395a801bf291b74e8bccea8e03f8", "author_url": null, "date": "Jul 12, 2008", "message": "I was a bit hesitant when you were describing it on the podcast, but then I've never played on Xbox 360.  But seeing it here, it sounds like fun!"}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jul 12, 2008", "message": "Perhaps you could have something that says \"So-and-so earned a badge for doing this!\" and then provide a means of contesting it. If enough people of a certain degree of karma (or were you calling it reputation?) contest it, then the badge is taken away.\n\nAlso, your colours for hacker and beta show silver instead of gold."}, {"author_name": "Salman", "gravatar_hash": "9af868b673e089e603b242c995e5593a", "author_url": null, "date": "Jul 12, 2008", "message": "Are these given on a per question/answer basis or are these badge levels an accumulation of the users participation?\n\n(BTW, if you don't enver your email you can an error, and the text you enter is erased!!  If it wasn't your website doing this you could have done a nice post bashing it!)\n\n(copy and pastes post before hitting 'submit comment')"}, {"author_name": "Nick", "gravatar_hash": "bad8e667832be107ae55637082678c64", "author_url": null, "date": "Jul 12, 2008", "message": "Why not put off designing this feature until it's needed to distinguish the awesome people.... for the new people\n\n[as in, the people that are new to the site will not know someone is awesome until you have awesome people, and until you can see what actions made the awesome people awesome, how can you give only the awesome people awesome indicators?]\n\n[though I guess one response is that the first version of a [required] feature shouldn't be put off, the feedback that gets you to the second revision is better sooner than later]"}, {"author_name": "Stephen Cox", "gravatar_hash": "4ec688bc969d57547ff77e873600d663", "author_url": "http://stephencox.org", "date": "Jul 12, 2008", "message": "\"Why not put off designing this feature until it’s needed to distinguish the awesome people…. for the new people\"\n\nI'm for \"just ship it!\" What MS has done over the years. Roll out the site already. You can add the badge scheme later."}, {"author_name": "Richard Reed", "gravatar_hash": "176d61ba20c6d0d79524f7e1d74be970", "author_url": null, "date": "Jul 12, 2008", "message": "I agree with the folks who say that all badges should be attainable.  One of the reasons that achievements are so powerful is that they appeal to people's sense of completionism, and the presence of badges that can never really be attained throws a wrench in that.  \n\nI agree with Shaun Austin's idea regarding the founder badge.  Giving it to everyone in the first x% has the same sense of \"these people have been here since nearly the beginning\" while still being conceivably attainable for someone who comes later."}, {"author_name": "Jay Lynch", "gravatar_hash": "c6121240ced579760866d9d53d13b735", "author_url": null, "date": "Jul 12, 2008", "message": "Still love the idea but as I mentioned on the previous post, still concerned that they're more of a \"Hey, badges are cool!\" followed by \"Now what could a badge be attached to?\" and sprinkling a few around. \n\nRather than thinking about what they're encouraging people to do and how. Seems a bit bass-ackwards and perhaps not a great thing for the overall health of the site, even if they might not have a huge negative effect.\n\nAlso you might want to think about keeping the exact conditions for the \"1 year later\" etc. that aren't going to come up for a while secret, to add a little intrigue.\n\n(Oh and +1 on the ugly, but these are only Alpha, right? Please?)"}, {"author_name": "Andre Bluehs", "gravatar_hash": "95fd55a5e382faea51e1643a4426058b", "author_url": "http://andrebluehs.net", "date": "Jul 12, 2008", "message": "I was excited at first about having founder and beta badges (as i would receive them). however, I now agree that simply being there first is not an acceptable accomplishment to reward. \n\nA new user might be mistaken to think that because I was there early, I would have more experience/expertise/better answers. This is not necessarily the case for me. While I do have some moderate experience, there are other people that will not be founders/beta testers that know much more than me. \n\nI think having badges for early adopters could mislead some to believe we know more. Than someone else who answered.\n\nMaybe something shiny on our profile or our avatar? A little star (or what have you) on the bottom of our avatar to say that we were founders?"}, {"author_name": "RodeoClown", "gravatar_hash": "d2ffa472b72f308b8b5b6cc8ea528e4a", "author_url": "http://www.the-rodeo.com", "date": "Jul 12, 2008", "message": "I'd keep the conditions for getting (at least some of) the awards secret - it's always nice to win something then try and figure out how you got it :)\n\nAlso ++ on the idea of making them all attainable."}, {"author_name": "Rex", "gravatar_hash": "3e9f1629fd4cb4a5ce9fbd27b13e862d", "author_url": "http://www.rexmorgan.net/", "date": "Jul 12, 2008", "message": "You've got an award for what I would call \"Best. Question. Ever.\", relative to all other questions. But nothing really for an answer. Answers are only compared to other answers _in the same question_. There's a ceiling on the thumbs-up... at some point a question/answer pair become semi-concrete because they are well-established and the answer has been voted extremely high, so I don't imagine people will keep voting it up for the hell of it. I would like to see a way to measure the quality of a given best answer against other best answers and have an award for those."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 12, 2008", "message": "> For some of these badges that means posting “asdf?” in a question, “asdf!” in an answer (and again in a year old question), adding some random tag to some random post, etc.\n\nThe current thinking is that first time questions and answers must get one upmod before you awarded the bronze badge.\n\n> I think having badges for early adopters could mislead some to believe we know more. Than someone else who answered.\n\nHmm. Maybe we need a different class for these arbitrarily awarded badges.. like merit badges, outside of gold/silver/bronze.\n\n> For instance, it could be a set of three small colored buttons next to their name each with a number of that type of badge.\n\nThat's right -- every post you make will be \"signed\" by:\n\n- your name\n- gravatar image\n- reputation score\n- badge count in gold, silver, and bronze categories"}, {"author_name": "RodeoClown", "gravatar_hash": "d2ffa472b72f308b8b5b6cc8ea528e4a", "author_url": "http://www.the-rodeo.com", "date": "Jul 12, 2008", "message": "Maybe you could put a frame around the gravatar instead of arbitrary badges, so you'd get a gold frame (maybe with 'founder' underneath), and if you had more than one fram eearned, you could choose which one you want to sport at a given time.\n\nBangHowdy has a badge system where you can display four badges, but you can have a hundred - then people choose what other people see about them.\n\nThat's also a nice way of going about it."}, {"author_name": "David McGraw", "gravatar_hash": "840264c45b706fb829d406e9c61a1889", "author_url": "http://www.david-mcgraw.com", "date": "Jul 12, 2008", "message": "Instead of clogging up space, maybe it should just be:\n\n[ Gravatar ]\nName : Score\n\nAnd hovering over the gravatar shows you a box the most recent rewards, with the little icons that show the gold/silver/bronze count."}, {"author_name": "kevin", "gravatar_hash": "ad6a3db918199fd3f5664951a69e98de", "author_url": null, "date": "Jul 12, 2008", "message": "I think its kind of unfair that there are some badges that some people will NEVER be able to get...such as beta tester.\n\nAlso, these badges will encourage people to do the wrong thing.  People will edit/rollback articles as soon as they can to get those badges, etc.  \n\n*It would have been better if nobody knew HOW to get the badges, then they wouldn't be able to FARM them.  Ah, well.*"}, {"author_name": "Eric", "gravatar_hash": "4cc6319b3a017074fdbb5067960841eb", "author_url": null, "date": "Jul 12, 2008", "message": "I think the idea of rating users is great.\n\nHowever you have 28 kinds of different awards with 19 of them that are not related in a level 1-2-3 fashion.\n\nMy opinion is that its getting border \"too complex\""}, {"author_name": "Scott Elkin", "gravatar_hash": "e5248bc28b17c988e92aee3eef37c1e8", "author_url": "http://scottelkin.com", "date": "Jul 12, 2008", "message": "Really good idea, I think some of the best ones will come in time by just keeping the thread open and listening to new ideas."}, {"author_name": "RodeoClown", "gravatar_hash": "d2ffa472b72f308b8b5b6cc8ea528e4a", "author_url": "http://www.the-rodeo.com", "date": "Jul 12, 2008", "message": "Thinking about it a bit more, I think I'd lose the Gold/Silver/Bronze, and just have them all the same level."}, {"author_name": "Nick Retallack", "gravatar_hash": "44aed468fe438682bd13224ff4d28041", "author_url": "http://nickretallack.com", "date": "Jul 12, 2008", "message": "I'm wary of the number-based badges.\nSilver | Librarian | Retagged 100 questions\nSilver | Strunk &amp; White | Edited 100 entries\nAny time there's repetition, a computer can do a better job than a person.  It wouldn't be hard to whip out www::mechanize, visit 100 threads, run a standard spellchecker to edit it, and choose a random long word from it to tag it with.  In fact, most people would do less work: try editing just the whitespace, or tagging with something totally generic like \"software\".  Also, you may have to maintain a lot of data to make sure someone doesn't just edit the same post 100 times.  Or view the same post 10,000 times.  Anonymous views count too, right?  And multiple views from the same IP in the same day don't, right?  Going to keep an IP list for every thread?\n\nIt some thought to keep people from gaming the system.  I like the bronze badges because they encourage people to learn how to use the site.  However, the better badges may be hard to get right.  It might be best to leave them out until the site has seen some use, and then figure out what behaviors you really want to encourage.  I'd hate to see someone get speedster for saying \"First post!\"\n\n&gt; The current thinking is that first time questions and answers must get one upmod before you awarded the bronze badge.\n\nI think you should involve upvotes somehow in every badge's requirements, and more than just one.  You could still game it if you had a friend (or fake second account) who you could ask to give you an upvote when you needed it."}, {"author_name": "Lea", "gravatar_hash": "905613f686cb68a977cca9cd9fcf3fed", "author_url": "http://c3.ort.org.il/leketshibolim", "date": "Jul 13, 2008", "message": "I like the idea of badges very much, and I also like the logic behind it: promoting sensible behavior in the site.\nI also like the list of badges you gave, and I assume that as the site grows, the kinds of badges will change slightly."}, {"author_name": "david", "gravatar_hash": "ef079515af1c9963c7cd33e0b4f00e88", "author_url": "http://dlinsin.blogspot.com", "date": "Jul 13, 2008", "message": "Hey Jeff,\n\ncheck out http://www.javablackbelt.com it has the notion of belts, which you can achieve by passing exams. I like this idea and I'd love to see something similar at stackoverflow.\n\nRegards, David"}, {"author_name": "wds", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Jul 13, 2008", "message": "Two problems:\n1) the badges themselves are pretty ugly.\n2) there's too many of them, at least IMHO.\n\nI'd start with a few and add more as the site unfolds."}, {"author_name": "David McGraw", "gravatar_hash": "840264c45b706fb829d406e9c61a1889", "author_url": "http://www.david-mcgraw.com", "date": "Jul 13, 2008", "message": "wow, never heard of javablackbelt.com.  I would love to see that implemented (at a later date)! Crap, just when I was getting started with python... Must.. resist.. urge to spend time on that site..\n\nwds: Can't have too many badges. Impossible.  It's a selective process. Dump a bag of 100 marbles, let me pick out the ones I really want."}, {"author_name": "Klaus Graefensteiner", "gravatar_hash": "b549ab38d4e3ae73d797858fcaabc49a", "author_url": "http://www.tellingmachine.com", "date": "Jul 13, 2008", "message": "This is joke, isn't it?"}, {"author_name": "Arron", "gravatar_hash": "a31c67f29ac59ea5676387c81467c993", "author_url": "http://www.unkwndesgin.com", "date": "Jul 13, 2008", "message": "'I’d hate to see someone get speedster for saying “First post!”'\n\nMy assumption was that the post would have to have a decent rating for the award to be given, and I would hope that and 'First Post!'s would be modded down."}, {"author_name": "John", "gravatar_hash": "d0b76ae7bf261316683cad31ba0bad91", "author_url": null, "date": "Jul 14, 2008", "message": "I like the badge system. I agree they could do with a design makeover maybe they should have a gold bronze and silver shields or medals (you could have a look at http://www.famfamfam.com/) for ideas.\n\nOn another note I guess you will have to be careful of abuse of the system such as people pairing up to ask and answer simple questions to get badges."}, {"author_name": "jason", "gravatar_hash": "a58cf658f3479a68bc801348902f48bc", "author_url": null, "date": "Jul 14, 2008", "message": "so how do we get to be beta testers?\n\nit seems to be taking ages... =&gt;"}, {"author_name": "robaker", "gravatar_hash": "d5d30c9e90324b7fb0d33ff969cbfdd0", "author_url": null, "date": "Jul 14, 2008", "message": "I was going to suggest having a badge for funny (as in ha ha) answers, but I guess there's nothing to stop people upmodding funny responses anyway thus contributing to Nice/Good/Great Answer badges."}, {"author_name": "osp70", "gravatar_hash": "46571eede5e164609d10ef3d04addba9", "author_url": null, "date": "Jul 14, 2008", "message": "Wouldn't the karma/reputation in itself be a badge system?  If I look at the response to a question and the person has huge karma then I'm a little more certain they are not just trolling and I can consider their answer as valid on the first read.  If you could break the karma down for the different sections this would identify area experts as well.  Something like\n\n[Gravatar]\nName: NNNN\nArea Karma: XXX\nOvarall Karma: XXX"}, {"author_name": "dan", "gravatar_hash": "48fd7c03aa90c23a2602ebc3837e0f31", "author_url": null, "date": "Jul 14, 2008", "message": "I don't have time at the moment to read through 50 responses, so if this was already addressed I apologize.  \n\n I understand what you are trying to accomplish with the badge system, it helps people who read posts to quickly ascertain if the person posting knows the difference between his arse and a method call, while at the same time sucks people into wanting to move up the food chain to earn their merit badges, which of course keeps people coming back to the site.\nThe downside is that it creates a set of classes among users, and it seems to me that this never works in the long run.   I am by no means an expert programmer and would probably almost never even answer someone’s question unless I was really really sure I knew what the hell I was talking about.  I have ideas, comments, and working knowledge but I’m probably less then a zinc badge and I’m cool with that. However, some people will have issues with this and it might cause you to play school house moderator to some non-sense down the road.  \nJust a thought.\n-dan"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": null, "date": "Jul 14, 2008", "message": "Jeff,\n\nSome inspiration for badge artwork--a Worth1000 merit badge Photoshop contest!\n\nhttp://www.worth1000.com/contest.asp?contest_id=10806"}, {"author_name": "Phuong Vo", "gravatar_hash": "47ca5549e0d86e22e86ac4803d3e5151", "author_url": "http://www.potatobytes.com", "date": "Jul 14, 2008", "message": "I think it's great that we get to be involved in the early stages of building the Badge system.\n\nI agree that there should be specific tag badges, like C# Guru, Java Apprentice... etc.\n\nCan't wait for beta.  Jeff A., are you going to have a faq up soon?"}, {"author_name": "Terrapin", "gravatar_hash": "6b89ab6fe40aeae63df5509238078bcb", "author_url": "http://terrapinstation.wordpress.com", "date": "Jul 14, 2008", "message": "I think it's a great idea to have an additional badge category like \"Merit\" for the Beta/Hacker/Founder/Yearling, etc. badges. \n\nJust because someone was a beta tester, or has been around for a year, doesn't mean that they contribute quality content to the community.\n\nThe bronze/silver/gold badges should all be attainable. You could have a special \"completionist\" badge for getting every one, but what would happen if you decide to add more badges later?"}, {"author_name": "Phuong Vo", "gravatar_hash": "47ca5549e0d86e22e86ac4803d3e5151", "author_url": "http://www.potatobytes.com", "date": "Jul 14, 2008", "message": "There could be predefined tags, that would keep the scope from getting too big.  But that might take the fun away."}, {"author_name": "Robin Goodfellow", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Jul 14, 2008", "message": "The badges are ok, but I think they could be better focused. A lot of them seem to focus on quantity and speed over quality. There's already far too much \"maek poast\" on message boards and comment sections today, codinghorror.com is an excellent example. No matter how little time has elapsed for the most recent blog entry there always seems to be on the order of a hundred comments by the time I read it. Tellingly, the number of comments jumps very high very quickly then tends to climb steadily for a while then tends to reach a plateau, even before the next blog entry is posted.\n\nIt sounds like you'll be able to change the system over time as it becomes more obvious which badges are worthwhile and which are not."}, {"author_name": "Erick", "gravatar_hash": "2b0cb15ad67d850974067e9a78473ead", "author_url": null, "date": "Jul 14, 2008", "message": "Category-specific badges can be great for both questions and answers. Since the categories can be dynamic, the badges for those categories can be equally dynamic.\n\nExamples:\n\n\"[Category] Expert\"\nReceived 25 Best Answers in [Category]\n\n\"[Category] Master\"\nReceived 50 Best Answers in [Category]\n\n\"[Category] Learner\"\nAsked 10 Questions about [Category]\n\n\"[Category] Researcher\"\nAsked 20 Questions about [Category]\n\nThe jack-of-all-trades types can have badges such as:\n\n\"Mr. Know-It-All\"\nReceived a Best Answer in at least 10 different categories.\n\n\"Diversified Student\"\nAsked a question in at least 10 different categories."}, {"author_name": "Pat H", "gravatar_hash": "fac325e3dba9f73408bad851012a2a67", "author_url": "http://patpack.blogspot.com/", "date": "Jul 14, 2008", "message": "Necromancer now that is a good badge idea, always loved the idea of some fun/reward system like this."}, {"author_name": "dkasper", "gravatar_hash": "5dd5d79588bd40c60a1a11c4585d7d13", "author_url": "http://www.morethancurious.com", "date": "Jul 14, 2008", "message": "I just heard the people in the office next to mine raving about the XBox 360 achievements system and thought of stackoverflow.  Badges is going to be a killer feature."}, {"author_name": "hova", "gravatar_hash": "6b81f39b9693260d9fbc472f71f71c30", "author_url": "http://www.hova.org", "date": "Jul 14, 2008", "message": "There needs to be a Godwins Law badge.   Just query for at least 3 attacks/rebuttables between 2 people and the word \"Hitler\".   Your choice of who to award it to, is yours of course."}, {"author_name": "Cyrik", "gravatar_hash": "06a7a04988d35a276d7bb0d1e5b20d02", "author_url": null, "date": "Jul 14, 2008", "message": "I´m not sure that badges are the best way to go here. When I ask a question and read through the answeres, I would like to know if the person knows what hes talking about, and not if he \"answered a question in 2 mins\".\nI guess you will have something like categories or tags. It would help alot more, if I could see how many points someone scored in \"my\" category/tags\nthere are some badges in here that just make you behave in a stupid way. who really answers questions in 2 minutes? the replay will either be to short or just not relevant...\nbadges are fine if you only display the profile, but i dont like most the bronze badges. everyone will have the \"first x\" badges, so they dont give you anything but noise."}, {"author_name": "Alistair", "gravatar_hash": "438c91736f20d0821c7a358ee8b00790", "author_url": null, "date": "Jul 15, 2008", "message": "+1 for agreeing that founder is not attainable (unless it somehow is) no matter how hard I try, I can never be Joel or Jeff... Even if surgery is involved.\n\nonly have achievement badges that people can attain otherwise you have gratutious badges of exactly the type your trying to avoid\n\nhow about 'Kingpin' based either on frequency of good (up voted) contribution, or just sheer volume spa.. uhh posts"}, {"author_name": "Ian Anderson", "gravatar_hash": "60b1c7dc18e08e1a16f313354814744f", "author_url": "http://thefirstpost.co.uk", "date": "Jul 15, 2008", "message": "+1 for not having \"founder\"... I agree that having a badge nobody else can have would suck and I think the mystical aura that surrounds the names \"Jeff\" and \"Joel\" should be quite sufficient on it's own...\n\nChurchill didn't feel the need to wear a lapel pin that read \"BOSS\", did he?"}, {"author_name": "Arron", "gravatar_hash": "a31c67f29ac59ea5676387c81467c993", "author_url": "http://www.unkwndesgin.com", "date": "Jul 15, 2008", "message": "+1 for the \"founder\" badge, unless I can get one... :)"}, {"author_name": "Grandy Peace", "gravatar_hash": "bbc69e8851ec256c9eeaa262cf0bb871", "author_url": "http://www.popehat.com/", "date": "Jul 15, 2008", "message": "Cyrik, that sounds more like an issue with particular badges, and I'd agree that perhaps some of the individual badges are a bad idea.\n\nBut overall I think it's a really good concept."}, {"author_name": "Justin Bennett", "gravatar_hash": "421597da2c2a5f9cdaab8fa700435caf", "author_url": "http://jmbennett.org", "date": "Jul 15, 2008", "message": "I really like the badges system you're developing and I think it will be a great way to encourage long term use of the site.  Perhaps they could use a little design work, but overall it's looking good.\n\nI did have one suggestion... I don't know if you've ever used a site (such as http://ubuntuforums.org) where they use a rating scale.  On the Ubuntu forums, the more involved you are, the more \"coffee beans\" you get until eventually you are a cup of coffee, or a pot of coffee, etc.  Something like that (perhaps with the ability to customize your title at the higher levels) would be pretty neat."}, {"author_name": "Chris Pietschmann", "gravatar_hash": "d565ce4d3fdf8007e1d707362cca9465", "author_url": "http://pietschsoft.com", "date": "Jul 15, 2008", "message": "This ideas for stackoverflow.com are cool, but will we ever see the actual website? Why not launch it with the most minimal features needed, and then add new stuff from there. Besides, no matter how much planning you do, you'll alway think of stuff to change/add later on after people are actually using the website."}, {"author_name": "Richard Reed", "gravatar_hash": "176d61ba20c6d0d79524f7e1d74be970", "author_url": null, "date": "Jul 15, 2008", "message": "I got the impression that the founder badge was more along the lines of \"everyone who signs up in the first week or so\" than \"special Jeff only badge\".  I still don't care for it, though, since either way it is not attainable to people who come after."}, {"author_name": "Sean Patterson", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Jul 15, 2008", "message": "Just tossing in my 10 bits to say the language specific badges are a great idea. And then having some kind of \"cross class\" or \"code ninja\" to demonstrate those that have answered upmodded questions or whatever in multiple languages.\n\nSeeing \"code ninjas\" might inspire me to drop a SQL question privately to somebody after they've answered my .NET question since I think they may be able to help there too."}, {"author_name": "Bill", "gravatar_hash": "3bd05c4b4940e76954729a41b9ddec4d", "author_url": null, "date": "Jul 15, 2008", "message": "I agree that all badges must be attainable, and beta/founder badges don't qualify.  I also agree that Speedy is a bad idea unless it comes with a really high up-mod requirement.  You don't want to emphasis speed over well thought-out, correct, useful answers."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 15, 2008", "message": "> all badges must be attainable, and beta/founder badges don’t qualify\n\nOK -- I will definitely be removing the Beta / Founder badges based on this feedback.\n\n> Category-specific badges can be great for both questions and answers. \n\nThis is probably something else we will do. It would be tag-based, not category based -- everything is categorized by users, via delicious-style tags."}, {"author_name": "longeasy", "gravatar_hash": "4d9501a62b7c3014c29935584cd96ab8", "author_url": null, "date": "Jul 16, 2008", "message": "Necromancer: How does it help the page if people revive year old topics? Whoever posted the questions is most likely not reading the answer anyway."}, {"author_name": "Justin Bennett", "gravatar_hash": "421597da2c2a5f9cdaab8fa700435caf", "author_url": "http://jmbennett.org", "date": "Jul 16, 2008", "message": "&gt;&gt; all badges must be attainable, and beta/founder badges don’t qualify\n\n&gt;OK — I will definitely be removing the Beta / Founder badges based on this feedback.\n\nI think that founders and beta testers should still be recognized in some other fashion.  These people (in many cases) have or will have put a lot of time into making the site what it is.  Perhaps some sort of emblem next to their name or Gravatar."}, {"author_name": "sparkes", "gravatar_hash": "1808d03cbe52b51c32deb84098668cbd", "author_url": "http://zx-81.com", "date": "Jul 16, 2008", "message": "Not too sure how you are going to get the category tags working in a folksomony Jeff.\n\nGood luck on ironing that feature out :)"}, {"author_name": "Craig", "gravatar_hash": "e78bca1e19270e988366b8dc13e7fdb4", "author_url": null, "date": "Jul 16, 2008", "message": "I think it's OK if certain badges are nearly unattainable. For instance, Guitar Hero 3 has the \"Meet Your Maker\" achievement in which you have to beat one of the GH3 developers in an online match. Like how many people out there seriously have that. Pretty much the only opportunity to get it was during the kick-off weekend for GH3."}, {"author_name": "SpoonMeiser", "gravatar_hash": "9a09b0df40ac0eb9bdebb8702e21eb7e", "author_url": null, "date": "Jul 17, 2008", "message": "&gt;&gt; Necromancer: How does it help the page if people revive year old topics? Whoever posted the questions is most likely not reading the answer anyway.\n\nHopefully it'll improve the signal to noise ratio.\n\nIt means that even though the answer might no longer be useful to the OP, it will be useful to people in the future who have the same issue, and will mean that there is no need to post a similar/duplicate question.\n\nThe idea is that the site isn't just a forum, but a repository of knowledge. When searching for solutions, I don't care about how long it was between a question being posted and an answer being posted, I only care that the answer is there."}, {"author_name": "SpoonMeiser", "gravatar_hash": "9a09b0df40ac0eb9bdebb8702e21eb7e", "author_url": null, "date": "Jul 17, 2008", "message": "Also, it's important that badges can be removed from users.\n\nIf a user gets, say, a necromancer badge, but the reply is down modded, the user should probably lose the badge as they may have just been trying to game the system."}, {"author_name": "Craig", "gravatar_hash": "e78bca1e19270e988366b8dc13e7fdb4", "author_url": null, "date": "Jul 17, 2008", "message": "Badges are cool and all, I just hope it doesn't lead to the typical immature \"elitism\" that's seen in a lot of online gaming and forums where a \"n00b\" is publicly ridiculed and told to \"USE THE SEARCH BUTTON\" for asking a question which *gasp* has already been asked."}, {"author_name": "Arron", "gravatar_hash": "a31c67f29ac59ea5676387c81467c993", "author_url": "http://www.unkwndesgin.com", "date": "Jul 17, 2008", "message": "&gt;&gt;&gt; all badges must be attainable, and beta/founder badges don’t qualify\n\n&gt;&gt;OK — I will definitely be removing the Beta / Founder badges based on this feedback.\n\n&gt;I think that founders and beta testers should still be recognized in some other fashion. These people (in many cases) have or will have put a lot of time into making the site what it is. Perhaps some sort of emblem next to their name or Gravatar.\n\nI'll second this.\np.s. these captchas are starting to get harder."}, {"author_name": "haig", "gravatar_hash": "3020fb359dfbedaf90f1611b036d3432", "author_url": null, "date": "Jul 19, 2008", "message": "There are several trust management schemes that have been implemented as I guess an automated badging system in several programmer communities.  The squeak group comes to mind, having recently read a description of how they manage their community of programmers and badge levels (apprentice, journeyer, master).\n\nHere's a nice write-up of their system:\nhttp://people.squeakfoundation.org/trust-metric.html"}, {"author_name": "Doug", "gravatar_hash": "cdb86cd36cb7c46185bfd3dfab320548", "author_url": null, "date": "Jul 21, 2008", "message": "I think a one-many badge system would be preferrable, or a badge, but 'awarded' badges separate, like medals. The badge could be compiled from the 'medals' awarded, like a military colour band? This way someone could be both 'enlightened' and an 'editor'.\nWas this what you meant anyway?"}, {"author_name": "HammerT", "gravatar_hash": "81a29c586e402d1e54dc578a77236047", "author_url": "http://www.hammert.nl", "date": "Jul 22, 2008", "message": "You should a add a \"knows C\" badge ;)"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Jul 23, 2008", "message": "If you want all badges to be attainable can you have specialist and generalist? Would specialist appear only when posting to questions with the tag you're a specialist in? Which raised another question:\n\nWill the badges displayed after posts reflect the users current status or their status at the time of making the post? I'm not sure which would better reflect the quality of the post, it may depend on the user.\n\nCould the badges link to a page listing the relevant questions/answers that gave the user the badge. e.g. the Interesting Question badge should link to the question the user asked that got 1,000 views.\n\nHere are my suggestions:\n\nGold \tODC Freak \t Retagged 1000 questions\n(or perhaps Head Librarian)\n\nThere should be a badge for someone that posts an answer which is awarded best answer after there was already a best answer to the question. Not sure what it should be called though, \"Perfecter\" perhaps? I think that's an important one as it's an activity you really want to encourage.\n\nIt would be nice if we could make queries ourselves to find who would qualify for unofficial badges. Then we could look for users who should have got negative badges like:\n\nProvocateur: Someone who asks a question that gets more down voted answers than up voted.\n\nAbsent Minded Professor: Someone who asks a lot of good questions that get good answers but doesn't mark any \"best answer\". Or perhaps it should be someone that answers their own question, provided they get sufficient up votes for the answer.\n\nBad Cop: Flagged a post that got best answer.\n\nPedant: Someone who makes lots of minor edits.\n\nAlthough any way for those users to keep score would only encourage them but you might want to track them yourselves."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Jul 29, 2008", "message": "That should have read \"OCD Freak\" as in Obsessive Compulsive Disorder."}, {"author_name": "andy", "gravatar_hash": "7aa39ab6bde9e088ccce00d09169631f", "author_url": null, "date": "Aug 01, 2008", "message": "Running Riot - has 10 answers in a row be rated best answer\n\nDouble Kill - answers two questions with one post\n\nBeatdown - er..."}, {"author_name": "friv", "gravatar_hash": "8b3c44ea4e14a17b9c15dd449d6050d5", "author_url": "http://www.frivtown.com", "date": "Jan 03, 2012", "message": "What do you mean Sam by \"Could the badges link to a page listing the relevant questions/answers that gave the user the badge. e.g. the Interesting Question badge should link to the question the user asked that got 1,000 views.\""}]}