{"response": [{"author_name": "Manish Goregaokar", "gravatar_hash": "0a3069491bfded90cdf623341cadc1d1", "author_url": "http://physics.stackexchange.com/users/7433/manishearth", "date": "Jun 25, 2013", "message": "Yay! What's the ETA for this being rolled out?"}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/johnmcg", "date": "Jun 25, 2013", "message": "I applaud these policies, but even more so that you guys have made an effort to improve things in spite of your success.  It could be tempting to say that the way you've done things has worked so far, and there's no need to change. This demonstrated a desire to make things as good as they can be, which I salute"}, {"author_name": "Jake", "gravatar_hash": "9b6b5a84bda5997b6db4924178cce6a0", "author_url": null, "date": "Jun 25, 2013", "message": "Very good!\n\nThe SE way of doing things can cause antagonism and raise the blood pressure of innocent contributors.\n\nPower tends to be abused, and I'll claim that it did many times in the SO community. \nIt's about time the moderators show the same level of clearness and respect they expect from the contributors."}, {"author_name": "Jesse Webb", "gravatar_hash": "62e7d47ca49b942923f36eb90c1a31bd", "author_url": null, "date": "Jun 25, 2013", "message": "These all sound like great improvements! I always hesitated to even vote-to-close questions which weren't obviously BAD, even if I thought they should be improved, especially from new users, because I didn't want to scare them away if they were legitimately trying to solve a problem. I believe these changes will make me more likely to use my close privileges because I assume the OPs won't feel personally attacked. Time to go try it out!"}, {"author_name": "AsheeshR", "gravatar_hash": "909aa23f4e7adfa2519ac2697fda6f30", "author_url": "http://thecodeofmylife.blogspot.in/", "date": "Jun 25, 2013", "message": "The writing style was really awesome here. I read through because of the sarcasm and imagery.\n\nNot that the announcement was any less important .."}, {"author_name": "Andre Calil", "gravatar_hash": "3ea3b82e836912041124db305e08ed31", "author_url": null, "date": "Jun 25, 2013", "message": "These are nice news! But, Jay, I have a question: pretend that I've asked \"what's the color of the sky?\" (yeah, the same example) and, after some comments and answers, the question is put on hold. I run to edit it before the deadline and change the question to \"what's the color of the sky at Saturn?\".\nIt's a completely different question, see? Don't you think it would be nice to warn those users that had already commented or answered my original question that \"a question you [commented|answered] has been re-opened. Please, review your [comment|answer]\".\n\nLet there be reviews, because the night is dark and full of terrors."}, {"author_name": "David", "gravatar_hash": "03577366338fc9091d5f115f7c7300dd", "author_url": "http://stackoverflow.com/users/701092/0x499602d2", "date": "Jun 25, 2013", "message": "This is a great improvement. I can't tell you how many times I was put off by the many close votes I had on my beginner questions. :)"}, {"author_name": "David Jashi", "gravatar_hash": "026e95ebddf45338c818052f16d684f1", "author_url": null, "date": "Jun 25, 2013", "message": "In my humble opinion, all the quality Q&amp;A or other user-filled sites I visited are heavily (and in some cases sadistically) moderated. I've seen some sites, where you could be banned for couple of month just for using slang or abusing grammar, left alone for low quality of the post.\nIf someone feel personally offended - OK, there are plenty of places to go on Internet, no one had imprisoned them here. But sacrificing quality for being afraid of hurting someones feelings is simply unacceptable. Consider hurting MY feelings when doing so."}, {"author_name": "bw", "gravatar_hash": "3056f1011deed57876c4a08713f0e1e7", "author_url": "http://stackoverflow.com/questions/17277399/how-to-modify-net-assembly-read-only-property", "date": "Jun 25, 2013", "message": "StackOverflow is not friendly at all, for example I wrote a question, real world problem and it got modified 3 times by the moderation and finally closed... jeeez and then people admitted it shouldn't be closed because it's a real world problem, so thanks a lot StackOverflow and good bye, your site is a joke"}, {"author_name": "Martin", "gravatar_hash": "0f57c52febf49c795a237fd6590f57b5", "author_url": null, "date": "Jun 25, 2013", "message": "Will this also apply for removing answers? As a new user, I tried answering some questions before I dared asking one, but my first answer got shot down hard. Very discouraging.and"}, {"author_name": "Victor Engmark", "gravatar_hash": "ec456274b57aeb413cfb6031f0320cdd", "author_url": "https://l0b0.wordpress.com/", "date": "Jun 25, 2013", "message": "The best Q&amp;A site ever, and one of the most successful usability experiments ever, just got better! If it wasn't for your work, I'd probably still be wondering what the difference between `:` and `true` is."}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Jun 25, 2013", "message": "Awesome.  Close votes were really getting out of hand, especially when applied to new voters."}, {"author_name": "Melchizedek Levi", "gravatar_hash": "5b08dbfed96671f76bebbec15c125aa7", "author_url": null, "date": "Jun 25, 2013", "message": "It's great to see that the people behind the curtain at stack exchange actually care about the  experiences of users as individuals seeking knowledge &amp; not just seeking rep points. It is  extremely important for individuals to be able to participate in a community, and feel that the community isn't excluding, attacking, or dismissing them out of hand. Something I have felt as user nearly every time I ask a question... \n\nTo offer a constructive suggestion I think that  'Reframe' &amp; 'Context?'  should be available as mechanisms for directing users to review their questions, in the instance when some user A sees a user B's question, that A may not understand or doubt the contextual validity of, they can vote for a Reframe by selecting a 'Context?' button that alerts user B that user A doesn't feel that the question fits. I feel that some similar mechanism where the User A in the above simple case is in practice a number of users greater than 5(for instance) so that in a given instance a user B  instead of finding their question closed arbitrarily, has instead some number of votes from interested users in his (or her) Inbox for them to reframe their question if in fact enough users have submitted votes on the matter. \n\nAssuming this comment and its suggestion go ignored its still great that you all care, because in my personal experience being dismissed for asking a question (or having your question essentially dismissed) necessarily creates resentment &amp; at least one asshole (either the asshole that saw fit to down-vote or close a question) or the asshole born of the resentment from having their question closed.\n\nAlso -last thing I hope you all will seriously rethink your up and down voting policies, I think it's BS that some one can down-vote you for not liking your question even if it isn't necessarily invalid or inappropriate.\n\nThanks for reading/listening"}, {"author_name": "BrunoLM", "gravatar_hash": "ef1a0f00d57917768acdc5b379ca1b28", "author_url": "http://manageraddons.com", "date": "Jun 25, 2013", "message": "That is exactly what I was feeling lately. I posted on meta without a good example... But that feeling is covered here, perfect! I really hope we can welcome new users, sometimes I am afraid to invite beginner friends because of reputation freaks and unfriendly people.\n\nI really hope we can change that and make it more welcoming.\n\nNice work! Really nice work!\n\nI love your work, you inspire me Stack Exchange :D"}, {"author_name": "Sam", "gravatar_hash": "339bcbe66f513cd15c244538c3cc75dd", "author_url": null, "date": "Jun 25, 2013", "message": "Yup, having my questions closed (and in one case, reopened and closed TWICE within 48 hours without my editing it [a math/programming question] has gotten me to leave S.O.\n\nAt the time I left, I was pretty high in JS and CSS, and I have enough points to suggest reopening, but never have. \n\nI get up-votes every few days on a answer for a question that was closed apparently because it is \"too local\" - ie. asks about a specific issue with a specific piece of software, but it's an issue that affects hundreds daily (according to the IRC channel of the software dev).  Basically, since the \"empowered\" contributors who feel in control don't have this problem, it's obviously not useful to the site.\n\nAnd all the humor related stuff, that some contributors actually worked on, or the useful lists of software or programs that actually took work for users to compile, they feel like ugh when it disappears.\n\nGood luck."}, {"author_name": "Sonstwer", "gravatar_hash": "c8053e7d7aac8830f25a47135ce07bec", "author_url": null, "date": "Jun 25, 2013", "message": "Duplicates should support more than one link."}, {"author_name": "Rhys", "gravatar_hash": "dd044f341340b36490c0c0c9a65f8524", "author_url": null, "date": "Jun 25, 2013", "message": "This is really timely.   I'm not a heavy SO user, but I have relied on it in search results for many years and do participate from time to time.\n\nIn all these years I have seen a questions closed, but not too often.  Every time I have seen it I have agreed.\n\nUp until recently.  The last couple of months about a third of the questions I land on are closed.  And I have not agreed with many cases.\n\nSo while I have posted in the past, I am suddenly wary of doing so. \n\nThe site seems suddenly full of people who close questions to which I was also looking for an answer (seems fairly constructive/real) or where I see that there is a nuance to the question that makes the answers to similar questions insufficient.\n\nI feel the culture of SO is changing in ways I do not think of as friendly or constructive."}, {"author_name": "Jacob", "gravatar_hash": "4d952ac42e1653fe3764f1c2834a802e", "author_url": null, "date": "Jun 25, 2013", "message": "I'm super happy that points of views like David Jashi's didn't win out on this. I don't know why some get actually *offended* by politeness. Bravo for these changes to make things a little more civil *without* hurting quality."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://hermeneutics.stackexchange.com/users/68/jon-ericson", "date": "Jun 25, 2013", "message": "Thank the Drowned God that I've finished <i>The Game of Thrones</i>.  'Cause I'm a pretty fast reader and it took me a couple of months.  \n\nMaybe we should have a migration path to Yahoo Answers.  Nah.  That's too cruel. ;-)"}, {"author_name": "OkumaFzx", "gravatar_hash": "c2895ca93be0965aa9d16b14320a8224", "author_url": null, "date": "Jun 25, 2013", "message": "Duplicate: Duplicates should support more than one link."}, {"author_name": "Rhys", "gravatar_hash": "dd044f341340b36490c0c0c9a65f8524", "author_url": null, "date": "Jun 25, 2013", "message": "Also, over the years I have seen a LOT of what can only be called localized questions.\n\nI never got the idea that they were unwelcome...and I don't think they SHOULD be unwelcome...not generally.  Otherwise, why else do you have a Q&amp;A site?  Where do you get those questions answered?\n\nDo you guys want to be Quora now or something?  I actually visit SO, and I've gone to Quora a whole, like, twice.  SO is useful, Quora is navel-gazing."}, {"author_name": "Manish Goregaokar", "gravatar_hash": "0a3069491bfded90cdf623341cadc1d1", "author_url": "http://physics.stackexchange.com/users/7433/manishearth", "date": "Jun 25, 2013", "message": "@Rhys the issue with Quora is different, not just that they allow localized stuff. They allow broad questions and useless speculation and opinion-baiting.   SE doesn't..\n\nMost of the localized stuff can still be closed as off topic."}, {"author_name": "anonymous", "gravatar_hash": "1a43cf90aa45b3385f193134aab4fea6", "author_url": null, "date": "Jun 25, 2013", "message": "Good work, and great writeup!\n\nbtw, http://stackoverflow.com/about still says \"Questions that need improvement may be closed until someone fixes them.\""}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Jun 25, 2013", "message": "&gt; I feel the culture of SO is changing in ways I do not think of as friendly or constructive.\n\nYup. It is. It's been under way for much longer than the last couple of months though. And you're not the first to rail against it. But the close-mania is something that's always creeping up on SO, and for fairly logical (and probably unavoidable) reasons:\n\nSO is successful, and when something is successful, people want in on it. That means people flock to Meta, apply to become moderators,  and spend more time discussing how SO should be governed, than actually answering questions. In short, people seek influence.\n\nAnd editing/closing is really the best route if you want to have an impact on the site. If you want to be able to say \"I contributed to making SO what it is today\", then closing questions that you perceive as \"noise\" offers much more bang for the buck than tediously writing elaborate answers to questions. SO lets everyone play moderators, and the result of that is that everyone plays moderators. And if you take that trend to the extreme, then SO becomes a site for moderating programming questions, rather than asking and answering them. Simply because it offers a more tangible reward for less effort.\n\nAnother factor, of course, is that programmers, almost by definition, suffer from some degree of OCD. We *want* to sort and organize and remove stuff which doesn't fit. We want structure and rules and order.\n\nAnd that means that our natural inclination is to close questions aggressively. A lot of SO users over time become curators or caretakers or janitors more than anything else, and start tasking themselves with satisfying their OCD and keeping everything tidy and organized and structured.\n\nThat's not to say it is inevitable that SO ends up being the \"closers haven\" that it sometimes seems to be. There's been a big pushback several times in the past, and many senior users still regularly lock horns with trigger-happy moderators over the issue. And as these changes show, many of the \"higher-ups\" are well aware that closing can be a destructive force if left unchecked.\n\nSo yes, the trend you're seeing is real, and there will probably always be a strong current dragging SO towards \"close-mania\" and \"deletionism\". But that there are also people pushing the other way, so the outcome is certainly not given. If you think questions are being wrongly or unjustly closed, then make yourself heard. Discuss it with Meta, with the involved moderators, send an email to the SE staff.\n\n\nOh, about these changes:\n\nSounds excellent. Yeah, I think that is all.\nI disagree that the current system \"worked\", and I disagree that closing questions is what ensured the site was one where \"experts want to be\" (on the contrary, the policy has scared away far too many extremely knowledgeable users). But the changes sound good."}, {"author_name": "Gus", "gravatar_hash": "5252de20e9461690ba78b00f1f3d3971", "author_url": null, "date": "Jun 25, 2013", "message": "I've always thought that any close for \"off topic\" should be required to specify where it IS on topic. The reviewer should have to provide constructive information in order to use that reason. Otherwise it's just a \"we don't serve your kind here\" sort of response."}, {"author_name": "Geppettvs D'Constanzo", "gravatar_hash": "4d2570453441053a1f6c5a51abc92a57", "author_url": "http://geppettvs.x10.mx", "date": "Jun 25, 2013", "message": "Now we can say this is a real improvement. Thank you for listening even to those who didn't dare to say it. It was needed.\n\nThe more we improve, the more the support sites will improve.\n\nThank you."}, {"author_name": "Jogging Bottoms", "gravatar_hash": "675dee07e9b447117dbda4c72465799b", "author_url": null, "date": "Jun 25, 2013", "message": "Hurray! One less opportunity for the Aspies to get trigger-happy with closing. About time someone put them in their place."}, {"author_name": "Landon Springer", "gravatar_hash": "99016c263157937d56669c8a94c9dad5", "author_url": null, "date": "Jun 25, 2013", "message": "I literally tried to close my account because of these issues, but a rep told me some changes were coming.  Very glad to see this is for real (and, to be honest, to have my frustrations validated :P)"}, {"author_name": "beerwin", "gravatar_hash": "a69e2c20ef104d5ad535dbf77d9f3eaf", "author_url": "http://nagyervin.eu", "date": "Jun 25, 2013", "message": "This was welcome and a long time coming.\n\nYet there is another nuisance, i'm still having problems with:\nThere are some people (by the way, great contributors and basically good people) who tend to \"have a problem\" with pretty much every new question in a given topic, sometimes on very minor, or not completely relevant things.\n\nOnce i asked a question, about a pretty trivial thing, yet didn't work for me. I didn't ask for \"the codez\", i wanted things like this: hey man, i had this problem before, and i have found this solution (link).\n\nI got an answer which nearly had what i wanted, so i upvoted it as being helpful (it really was, yet it still missed one thing, so i didn't accept it yet). I made a mistake to write in a comment that this is the kind of answer i wanted. Then i got attacked by one of these moderators or what, and got harrassed that this is not a real question and so on. I instantly got 5 downvotes without any explanation (comments), except for one.\n\nI agree, that quality should be kept on this site, but this is not the way of doing it (beating the dead horse). Make your point, and cast your vote, don't fight with the OP, making him/her feel like a complete idiot or Public Enemy Number One. He almost made me to leave.\n\nAs another suggestion (may be related to closing): No downvote should be considered without a comment. Or better said, casting a downvote should mandate a comment."}, {"author_name": "tobi", "gravatar_hash": "0e747083685b78a6fb3f264b48ab253d", "author_url": null, "date": "Jun 25, 2013", "message": "I think it is important to have much more closing than we have right now. Many questions are of such low quality that I do not even want to expend -2 rep to vote them down. I feel like even that expense would be too much attention for the question, and also a penalty for myself.\n\nSO is increasingly becoming a cesspool right now. Not fun anymore. Too much garbage."}, {"author_name": "AaronLS", "gravatar_hash": "144fd462785db33cf6665cafd54101c7", "author_url": null, "date": "Jun 25, 2013", "message": "\"No downvote should be considered without a comment. Or better said, casting a downvote should mandate a comment.\"\nABSOLUTELY!!!\n\nIf you care enough about the content of stackoverflow to vote to close, you should care enough to provide a meaningful comment.\n\nAlot of people who vote to close will continue to use \"unclear\" simply because they aren't making an effort to understand what is being asked, or sometimes it is clear they have no reading comprehension skills.  We do have non-native english speakers, and sometimes you have to read it a couple times to get the jist of what is being asked.\n\nJust as we need clarification on what is being asked, they need clarification on what is confusing.  Usually you have two types of people moderating, those that actually take the time to ask clarifying questions in the comments, and those that don't comment at all and vote to close.  I don't vote to close until I've given time for the asker to respond.  If they don't respond or don't make an effort to clarify, then I vote to close."}, {"author_name": "VeryVito", "gravatar_hash": "8943093e938245d55c8f1e970b6f7484", "author_url": "http://www.turdhead.com", "date": "Jun 25, 2013", "message": "Nicely done. I'll admit, I thought things were going swimmingly, but I can't see how these changes will do anything but improve the site."}, {"author_name": "Nate", "gravatar_hash": "9c6f3a2dbad70293230a030b4a791079", "author_url": null, "date": "Jun 25, 2013", "message": "The SO power user community (mods and non-mods) are so completely out of touch with the majority of users on this issue.\n\nSO is not successful because of some high <i>signal-to-noise</i> ratio.  It's just not.  The internet market rewards many things, but high <i>quality</i> simply isn't one of them, for better or worse.\n\nIf anything, it's successful because it has <i>so much</i> content.  I used to have to visit 5 different websites for all my mobile development, and now I use one site, with one user account, one rep, and it's great.  It's not because I'm happy that SO <b>prunes</b> so many of the questions.\n\nThis is like the gay marriage issue.  If you don't think gay people should be able to marry, <b>don't marry someone of the same sex!</b>.  Don't pretend that someone else doing something you disapprove of makes your marriage worse, or prevents you from getting married.\n\nTry to improve bad questions with editing, or comments, or downvotes if you must.  There should be a <b>really, really low bar</b> for what constitutes an acceptable question.\n\nI actually listened to the SO podcast a while back, and heard the guys talking about deleting something.  One of them said something like \"this doesn't need to be removed, it isn't actually making the internet worse by being there\".  I wish that person knew how SO users were actually implementing site policy.  Questions aren't closed, or answers deleted, only if they make the internet (or this site) worse.  They're deleted for the most nitpicky reasons.  \n\n<b>Too localized</b> - it's virtually impossible for one person to tell who a question will or won't be useful for in the future.\n\n<b>Subjective</b> - so what if there's subjectivity involved?  That's why we have votes for answers.  Let the community democratic process help identify the best answers.\n\n<b>Off-topic</b> - I constantly see questions about software development tools, or sites developers need to use (e.g. iTunes Connect) closed.  Where else is a better place to find objective experts on this stuff?  Software development isn't just about \"for\" loops and thread pools.  Next time your boss tasks you with some software logistics problem, try telling him/her that the request is \"off topic\".\n\n<b>Not showing what you're tried</b> - there's many questions that have very little documentation available, and until you ask it, you won't even know where to begin.  Not saying what you've tried doesn't necessarily mean you're lazy.\n\nThen, there's the fact that most of the questions I see closed are closed by one moderator, or 5 users, that have virtually no rep in the tag in which they're closing.  That's insane.\n\nA question can be viewed by 100 people, upvoted by many of them, and it only takes 5 OCD zealots to close it?  That makes no sense.\n\nThe <b>reopen</b> mechanism is totally broken.  Once a question gets closed by 5 busy bodies, it's really hard to overrule them.  The closed question just isn't going to get the views needed.\n\nSO is a great website, but I really, really, really <b>hate</b> all the censorship (yes, that's what closing is).  The day I get fed up with actively contributing on this site will almost certainly be for this reason, or because of being fed up with the overwhelmingly snobbish attitude of the clique that runs the site."}, {"author_name": "Pierre Lebeaupin", "gravatar_hash": "68795690302f37a7119d8e340c73e4c9", "author_url": null, "date": "Jun 25, 2013", "message": "Great! Now to improve the deletion experience (yes, it sometimes happens for questions that are not obvious spam and are asked in good faith)."}, {"author_name": "Mason Wheeler", "gravatar_hash": "50facfccdffe2e9cabaa589205959d30", "author_url": "http://tech.turbu-rpg.com", "date": "Jun 25, 2013", "message": "I'm glad to see \"Too Localized\" going away.  IMO it should never have been in there in the first place; it's always seemed like the height of arrogance to proclaim that \"because I don't see how this could be relevant to people beyond the original poster, it cannot be relevant to people beyond the original poster.\"  That's perilously close to declaring yourself omniscient. ;)\n\nMore than once, I've Googled for help on some obscure programming issue and ended up on a SO question that was perfect for what I was looking for... which was closed as Too Localized.  It drives me up the wall when that happens."}, {"author_name": "Nate", "gravatar_hash": "9c6f3a2dbad70293230a030b4a791079", "author_url": null, "date": "Jun 25, 2013", "message": "<i>Oh, closing.  You are the watcher on the walls. You are the shield that guards the realms of men. </i>\n\nI know there was an element of humor in this comment, but I also think it reveals a root cause for why the SO closing system is so bad, and will probably continue to be bad with these changes.\n\nPeople who close questions often either do so because of some kind of badge-hunting (a bad reason), or because they believe themselves to be defending the virtue of a website.  Both are silly.\n\nThis feeling is actually the root of most <i>bureaucracy</i>.  Bureaucrats generally believe that the hurdles they put up to people doing what they want to do are justified, because the bureaucrat is keeping everyone safe from the bad guys (the crummy question writer in this scenario).\n\nThat may be true for a cop patrolling a dangerous neighborhood, or a food safety inspector making a cook wash his hands.\n\nBut, sorry, stack overflow question closers do not fall into this category.  You're just stopping someone else from getting their work done."}, {"author_name": "Mason Wheeler", "gravatar_hash": "50facfccdffe2e9cabaa589205959d30", "author_url": "http://tech.turbu-rpg.com", "date": "Jun 25, 2013", "message": "@Nate:\n\n&gt;SO is not successful because of some high signal-to-noise ratio. It’s just not. The internet market rewards many things, but high quality simply isn’t one of them, for better or worse.\n&gt;\n&gt;If anything, it’s successful because it has so much content.\n\nThe problem with an assertion like that is the chicken-and-egg paradox.  If SO is successful because of its large amount of content and not its high quality, how did it gain that large amount of content in the first place?"}, {"author_name": "John", "gravatar_hash": "249410d3bbaf071580bd43c72148d48d", "author_url": null, "date": "Jun 25, 2013", "message": "Great post, but this:\n\n\"they were clarifying what a community, over time, had deemed to be off-topic for thier site\"\n\nbothers me because \"their\" is spelled incorrectly."}, {"author_name": "mcmonkey4eva", "gravatar_hash": "11efc3d1b11ff8d364d2303a42fbb33b", "author_url": "http://mcmonkey4eva.dyndns.org", "date": "Jun 25, 2013", "message": "\"they were clarifying what a community, over time, had deemed to be off-topic for thier site.\"\n\nTHIER.\n\nIs your spell-check broken, Jay?"}, {"author_name": "mcmonkey4eva", "gravatar_hash": "11efc3d1b11ff8d364d2303a42fbb33b", "author_url": "http://mcmonkey4eva.dyndns.org", "date": "Jun 25, 2013", "message": "Argh, ninja'd\n\n(Why does this blog not have an edit button?)"}, {"author_name": "Al", "gravatar_hash": "78eabf31eb20f8146f66df1dd2fa568c", "author_url": null, "date": "Jun 25, 2013", "message": "This is a big improvement, but like many commenters here, I'd like to know when the core underlying problem is going to be addressed.\n\nA lot of people - many moderators included - seem to think the Stackexchange sites are a network of moderation sites with the Q&amp;A element added as an afterthought to provide stuff to moderate.\n\nMany moderators abuse closing: they close questions  when they can't be bothered to read them closely, they close questions when they are embarrassed they don't know about the thing the asker is asking about... and there's no mechanism at all for holding OTT moderators to account. Some SE sites (Android, Webmasters...) are not worth even looking at for anyone except the moderators and people with their exact same narrow interests and background, because of out of control moderation.\n\nIf closing questions is supposed to be about quality control, when will we get some quality control of the quality control?"}, {"author_name": "Andrey Shchekin", "gravatar_hash": "ecc96b01307b339812f5d1b2936ac9bc", "author_url": null, "date": "Jun 25, 2013", "message": "If I could have changed one thing about closing on SO, I would have disallowed moderators to do it single-handedly without 4 other people. \n\nThis functionality does not make any sense as there are always enough people to participate in the decision, and even the best moderator can make mistakes -- which is very annoying when it happens."}, {"author_name": "OldCurmudgeon", "gravatar_hash": "39fe11ae90a34012916a52f38c348c62", "author_url": null, "date": "Jun 25, 2013", "message": "But why close at all? Why not just quietly mark it as \"probably delete from database after answer has been posted or 30 days has passed\"."}, {"author_name": "Eduardo Alcântara", "gravatar_hash": "91b38aff2da6a1f911bd70976c52f107", "author_url": "http://eduardoalcantara.com", "date": "Jun 25, 2013", "message": "I sometimes get so frustrated with closing and downvote my questions that I am starting my own Q&amp;A network in my country's language."}, {"author_name": "Athari", "gravatar_hash": "911580f86f620825b4ebaad5c68012a1", "author_url": "http://snowlands.ru/en/", "date": "Jun 25, 2013", "message": "I find it funny (not really) that there are a lot of closed/locked questions among most voted up. And I mean real programming questions, with many helpful answers, not some silly questions left for \"historical reasons\". It does more harm than good.\n\nStackOverflow is by far the most popular programming Q&amp;A site, and suggesting to go to Answers.Yahoo.Com if one needs opinions IS offensive.\n\nRenaming \"closed\" to \"on hold\" is a welcome change, but it's little helpful thingy for newbies, not something that actually improves the site on a large scale."}, {"author_name": "Steven Harris", "gravatar_hash": "3487ce6ed9ec277bac79a838537b46a8", "author_url": null, "date": "Jun 25, 2013", "message": "s/primarily opinion based/primarily opinion-based/\nThat is, there should be a hyphen between \"opinion\" and \"based.\""}, {"author_name": "Christos", "gravatar_hash": "4ff619357ceeb1c5f8e01f10cad363d6", "author_url": null, "date": "Jun 25, 2013", "message": "IMO Closing shouldn't exist at all. Closing a question is like closing doors on knowledge. There aren't bad questions there are only bad answers. But, like every non democratic point in history of this world those actions needed an excuse, here the excuse is the quality of the content, this is such a joke. Closing questions in SO isn't a mechanism for quality control is a mechanism for some people to feel that they have some kind of power over others and nothing more...\nBTW None of my questions have been closed so far this is just my opinion for the subject and nothing more. I will continue to be a member of SO and I will try to ask better questions and give better answers because I feel this way, I just wish \"Closing\" be closed some day..."}, {"author_name": "Ryan", "gravatar_hash": "5cab29afd486870dd52c4d70ce9aef25", "author_url": "http://ransomstudios.net", "date": "Jun 25, 2013", "message": "This article makes a lot of sense, and perhaps it's diminish the inherit case of \"butt-hurtitis\" people seem to get when someone tells them they need to have a more Socratic approach to asking questions."}, {"author_name": "threeFourOneSixOneThree", "gravatar_hash": "3dd05649c2669dd335950fa79cb6d7e7", "author_url": null, "date": "Jun 25, 2013", "message": "Some closed questions fall into the primarily opinion based category. And as Athari mentioned have lots of upvotes; so they are deemed very usefull (for example regarding speed of wpf) and if these questions were not closed they would be probably be updated. \n\nI really suggest that the moderators or stackoverflow reconsider the position of \"opinion based questions\" in favor of a more lenient way of handling them."}, {"author_name": "TOMATO", "gravatar_hash": "e2aa4cd8ca03c4b2f71c6443f6e437b1", "author_url": null, "date": "Jun 25, 2013", "message": "About time, considering it's just some verbiage.\n\nI think the reasons why this move has taken so long should be examined as I think it speaks to an SO basic disregard for the user experience.\n\nExample: why is the user forced to opt out of question topics/tags which they have no interest in? Why force the user to wade through screens of irrelevant questions or be a click monkey to opt out of the hundreds of tags when they may only be interested in iOS or Arduino topics?"}, {"author_name": "Dusk", "gravatar_hash": "d4ab75d77a9a82e179397fd7964dc36e", "author_url": null, "date": "Jun 25, 2013", "message": "As far as duplicates go: An exception should be made for closing a question as a duplicate of an open question *by the same user*. Users should be encouraged to improve their existing questions rather than repeating them."}, {"author_name": "rupps", "gravatar_hash": "e184cab2fdb0fd3ee544666b5ef17831", "author_url": null, "date": "Jun 25, 2013", "message": "I don't know why people get that offended. Lately there are a lot of newbies that ask rudely for help, even with exigences on the answer. Besides reputation points, etc... mind that people is actually investing valuable time of their lives in providing answers for free, sometimes stuff that costs a lot of time (and maybe money) to research.\n\nI tend to agree with most question closures.  Keep stackoverflow serious. Let's not convert this into an Apple support forum."}, {"author_name": "Safwan Erooth", "gravatar_hash": "f72e1c0e1e7be6b60e7cf159e0f613ce", "author_url": "http://safwan.in", "date": "Jun 25, 2013", "message": "Way to go. Connecting with newbies is very important. They shouldn't feel like that this place is ruled by some people who came here first. They should feel they too can be part of this. \n\nOverall, the news updates would definitely make them feel that people here are nice and patient :)"}, {"author_name": "Benjol", "gravatar_hash": "501465a53bf1042de206d7d79cc68942", "author_url": null, "date": "Jun 25, 2013", "message": "When I think how much we fought in the past against \"Close\", only to be told that it was clear and inoffensive, or that if it was offensive it was someone else's problem...\n\nCommon sense has struck. So much the better!"}, {"author_name": "Eddy", "gravatar_hash": "9202d7d88e01dcd23dc2f24e0013f212", "author_url": null, "date": "Jun 25, 2013", "message": "“No downvote should be considered without a comment. Or better said, casting a downvote should mandate a comment.”\nYes please. \n\nAlso, if a question has a lot of upvotes, don't let people close it. No idea why this goes on, but people close popular questions, questions that are loved by the users of the Q&amp;A site."}, {"author_name": "knyppel", "gravatar_hash": "4aae8345e3974dcf9a2a837057308b68", "author_url": null, "date": "Jun 25, 2013", "message": "Nazi Germany 1942 called. They want their mods back, Jay."}, {"author_name": "JasonM", "gravatar_hash": "652cc4410d04b690807fc39449837664", "author_url": null, "date": "Jun 26, 2013", "message": "Very welcome indeed, Close-abuse has been rampant a long time.  Nice to see it finally addressed."}, {"author_name": "Andre", "gravatar_hash": "2f6c28ab47c1b582b9df3c022dd2e632", "author_url": null, "date": "Jun 26, 2013", "message": "A move in the right direction. Now only if you could kill off the flamers. I can't ask anything without being attacked..."}, {"author_name": "John", "gravatar_hash": "d3520ad50fa42c9319830bd9f0900c5d", "author_url": null, "date": "Jun 26, 2013", "message": "I'm getting a little less patient with people. Quite a lot of the time I look at new questions and think oh no not this again. For example someone saying floating point is broken. Yes, it's a good question, yes it's on topic. But it still needs closing because it gets asked every single day"}, {"author_name": "Matt", "gravatar_hash": "73da09af73cfc28e948a1027f0bdacf6", "author_url": "http://stackexchange.com/users/150774/matthewd", "date": "Jun 26, 2013", "message": "THANK YOU! \n\nI now feel somewhat vindicated after the treatment I got after pointing out the very same flaws with the close system on meta.gaming.SE"}, {"author_name": "SimplySimon", "gravatar_hash": "f9662c9da5945029a7d432e60b999416", "author_url": "http://www.thomsonstravels.co.uk", "date": "Jun 26, 2013", "message": "Excellent, this makes far more sense to me. Thanks for the info."}, {"author_name": "xjshiya", "gravatar_hash": "734758dfbd0ebfd83ea4eae1b2a5fa43", "author_url": null, "date": "Jun 26, 2013", "message": "I think down voting as well lures users (especially new users) away. It's better to comment first on those questions that need modifications and to how to improve it before down voting or voting the question to close. That way, it'll be more user-friendly and won't be too harsh to the user."}, {"author_name": "Dinup Kandel", "gravatar_hash": "3b2a3cab415bab9dd10fb76ab3f24e9f", "author_url": null, "date": "Jun 26, 2013", "message": "This policy is really good to hear. keep improving......."}, {"author_name": "Horsed Mongrel", "gravatar_hash": "064a0a699e43e22ccd2f3201521a31ad", "author_url": null, "date": "Jun 26, 2013", "message": "@bw You were pretty stubborn and acted like you are privileged to get what you want, based on the comments I saw in your question."}, {"author_name": "Leif", "gravatar_hash": "9f9d281329fbfb329664ee30be73c1c4", "author_url": "http://irleif.com", "date": "Jun 26, 2013", "message": "Great changes! Love it. Oh, and this article was very well written. I read it all because it was fun to read and informative at the same time. Really good work on this article, Jay."}, {"author_name": "Jaideep", "gravatar_hash": "6a73624a1d0a838acb4c2430827e0db3", "author_url": null, "date": "Jun 26, 2013", "message": "Instead of doing it this way can't you just move the questions that are discussion based to new site meant for discussion related questions. Instead of closing any question just move them elsewhere. It becomes a lot easier to maintain and anyone asking doesn't have to feel offended. \n\nI never really understood the concept of closing the questions. How does it help the guy asking ? \n\nAnd the so called question of keeping the quality intact of the site is purely opinionated. Some will consider it quite helpful while many others will feel a group of jerks ruining this place. Change in a way so that the problem is solved once and for all."}, {"author_name": "Shady M. Najib", "gravatar_hash": "380959483d9165871c50d9fb17d7efba", "author_url": "http://shadym.blogspot.com/", "date": "Jun 26, 2013", "message": "And finally, I was heard :D I can rest in peace, now :D\nhttp://meta.stackoverflow.com/questions/69618/isnt-vote-to-close-being-used-too-much-on-stack-overflow"}, {"author_name": "Gerrit", "gravatar_hash": "953cf098dfb066db328c01a724256cde", "author_url": null, "date": "Jun 26, 2013", "message": "I second that deletion should be addressed, too.  I've had questions that were asked in good faith deleted so rapidly that I had no idea what was going on.  It's very discouraging!"}, {"author_name": "Alexander", "gravatar_hash": "77bd65107303db2f82225927de06cfd3", "author_url": null, "date": "Jun 26, 2013", "message": "The problem I have with SO is that most, if not all technical answers I find are closed questions.\n\nSimilarly, all the technical questions I have are being closed.\n\nThe only answers I find that are not closed are the mostly trivial ones.  I can also ask trivial questions and get them answered.  I love the fact that they are there, and I do lookup trivial stuff all the time, but it seems wrong to me that all the technical questions are closed.\n\nTo me it seems like some of the moderators don't necessarily know the field they are moderating somehow and thus closes probably because they don't understand, and thus feels that it is too localized?"}, {"author_name": "Maxim", "gravatar_hash": "566db0f33c2b6e2a4e69e53788601705", "author_url": null, "date": "Jun 26, 2013", "message": "Could we please have a facility to downvote the close / on hold decisions?\n\nFrequently a question with a lot of upvotes (and which is useful for me) is closed. I feel that something is wrong and would like to express my opinion."}, {"author_name": "NullPoiиteя", "gravatar_hash": "a1355335e15f9c1bc61b05df6a14ccad", "author_url": "http://Brightmeup.info", "date": "Jun 26, 2013", "message": "awesome design ...."}, {"author_name": "H2CO3", "gravatar_hash": "e5b8fa5e4f9e527ea335031bf2ec9a03", "author_url": "http://stackoverflow.com/users/529758/h2co3", "date": "Jun 26, 2013", "message": "I don't like these changes. More bad, low-quality questions are coming. Even more lazy non-programmers will feel encouraged to post their homework assignments \"because the policy has becoome less strict\". I think the staff should have tighten the constraints instead, we've already had more than enough of these *off-topic, non-constructive and too localized non-questions.*"}, {"author_name": "Steve", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": "http://softwaredesignblog.wordpress.com/", "date": "Jun 26, 2013", "message": "I think this is a good idea and I think you've put the right level of thought into it.\n\nIf a bad question comes in (and yes the will continue to) they are put on hold until revised.  This solves both issues at once... other users of the site are not forced to slog through unanswerable questions and the users that posted them have the opportunity to fix them.  If they were just drive-by questions shot in the dark... the user won't come back to fix it up and they just die-on-vine 5 days later of natural causes.\n\nI feel everyone posting a question on this site is either *really* trying to get an answer (even if asking badly) this is an ideal solution.  For the small percentage that are just trying to troll (e.g. \"Why are awesome languages like Python so much better than  stupid languages like *someLanguageIHate*?!\") they'll still be closed off."}, {"author_name": "Karoly Horvath", "gravatar_hash": "5cdee2abea51e91756076032f0053081", "author_url": null, "date": "Jun 26, 2013", "message": "I think the only right way to lower the close rate and make the site more user friendly is to make sure that the users ask proper questions.\n\nhttp://meta.stackoverflow.com/questions/105838/tips-hints-based-on-tags\n\nThis is the best I could come up some time ago, and I still think it's the way to go.\n\nI'm pretty sure all of you could come up with zillions of examples.. If there's a C/C++ question, chances are, you want to notify the OP to enable warnings (-Wall, -Wextra, -Whatever...). If the user is complaining that the code is not working, you probably going to suggest using a debugger or adding trace messages. If the posted code \"snippet\" is way too long, you'll ask him/her to come up with a short example which demonstrates the problem. etcetc... I'm pretty sure most of the conditions could be recognized by a dumb AI machine.\n\nTrust the users. Yes, some of them won't read the hints, but if only half of them read it, that could have a very good impact on the quality of questions, make the site seem more user friendly, and in the same time advertise some basic but very important best practices."}, {"author_name": "Guilherme Oderdenge", "gravatar_hash": "fb71d8e056eadfdc96077ff2b0ca2387", "author_url": "http://www.vincae.com", "date": "Jun 26, 2013", "message": "Oh yeah! Good improvement! Grats, Stack!\n\n(What a coincidence! After years without hearing this music, I found it on Grooveshark and exactly a week after meeting it here.)"}, {"author_name": "Laura", "gravatar_hash": "5028fddccddf5610dac7383b00da7619", "author_url": "http://stackexchange.com/users/463263/laura", "date": "Jun 26, 2013", "message": "@Tomato If you're only interested in one or two topics on SO, you should subscribe to the tags you're interested in. You can do an email subscription or RSS subscription by hovering over the tag and clicking on one of the links there. We definitely don't disregard user experience, but you have to remember we have tens of millions of regularly active users; there's no way we can make an experience that is ideal for each and every one of those."}, {"author_name": "Ionel Lescai", "gravatar_hash": "ec7d5cfd139673650fb4f7efa6ab52b8", "author_url": null, "date": "Jun 26, 2013", "message": "Very nice read :) ... just one thing, perhaps a bit off-topic : did you change the green color on the accepted answers check mark or am I going blind ? If yes, please change it back :)"}, {"author_name": "Denis", "gravatar_hash": "cbd7e425787691c8ec475b7eb3db470d", "author_url": null, "date": "Jun 26, 2013", "message": "As much as I commend you for trying to make it a newbie-friendly place, I think you're on the wrong track here.\n\nImo, several options are still missing. Specifically, some polite (or not) variations of:\n\n- Go read a tutorial, then read the manual, and then google it; then ask\n- This is not a crowd-sourcing venue; go post your specs on Amazon Turk\n\nOr then, create two new Stack Exchanges, called \"Learn to code the lazy way\" and \"Free code monkeys for hire\" respectively, where we can migrate the noise to.\n\nAs an example, here are the 10 newest mysql questions as I'm writing this comment:\n\n- 17322483/shared-html-page-that-updates-for-all-users\n- 17322453/why-duplicate-query-results-withouth-group-by\n- 17322446/is-it-bad-practise-to-use-a-general-function-to-query-a-database\n- 17322378/sql-error-1054-sqlstate-42s22\n- 17322313/you-have-an-error-in-your-sql-syntax-check-the-manual\n- 17322142/exception-while-calling-stored-procedure-from-jdbc\n- 17321934/getting-duplicates-after-using-distinct\n- 17321914/what-is-the-best-way-to-expand-existing-data-in-a-database-with-php\n- 17321876/wordpress-data-insert-showing-unknown-column\n- 17321821/trouble-creating-a-connection-in-mysql-workbench\n- 17321814/import-issue-with-mysql-workbench\n\nThe place is a sewers. In the above, I counted a single good question (the first one), and it's probably going to get closed as too broad for SO.\n\nIf most or all of these questions are acceptable for SO, my opinion is that questions shouldn't get closed at all. Since anything goes, including the noise and the trash, then good opinion-based and excellent broad questions ought to have their place too -- especially if someone is willing to answer.\n\nIf they're not, then there should be a clear \"Go read the tutorial, read the manual, google your problem, and then ask. Thank you.\"\n\nInstead, you took the middle option, which amounts to prompting newcomers to put lipstick on their sow of a question, and calling it beauty queen the moment there's enough of it. I mostly beg to differ: it's still a pig."}, {"author_name": "Howard Richards", "gravatar_hash": "e2470302be501fa5c51e0fcc699f348c", "author_url": "http://conficient.wordpress.com", "date": "Jun 26, 2013", "message": "Glad to hear you're responding to user feedback (I kind of expect this from SO). \n\nPerhaps you could also refactor the Deleted answer workflow as well?\n\nI got a bit annoyed a few weeks ago when my answer (which was helpful, on-topic and concise) was deleted. You don't get any reason provided with the delete, which makes the process seem like arbitrary censorship."}, {"author_name": "MMK", "gravatar_hash": "603f2761a3eddc4b5e0a54bf971d99f8", "author_url": null, "date": "Jun 26, 2013", "message": "Nice job on that!  I have always felt that the closing options were unclear and could be better described, and it's gratifying to see that the new options are very close to what I would have done myself."}, {"author_name": "Ohmi", "gravatar_hash": "3b3e443d940adc2002a9a33851b7390e", "author_url": null, "date": "Jun 26, 2013", "message": "I think these changes will be helpful and will improve the experience for all users."}, {"author_name": "Extra Credit", "gravatar_hash": "28310c4adab06413ef2656f165163abe", "author_url": null, "date": "Jun 26, 2013", "message": "As Dusk said:  \"An exception should be made for closing a question as a duplicate of an open question *by the same user*. Users should be encouraged to improve their existing questions rather than repeating them.\"\n\nIndeed."}, {"author_name": "harold", "gravatar_hash": "182d0ce855c8324a596648c04643e8f9", "author_url": null, "date": "Jun 26, 2013", "message": "Even with this change, it's much easier to answer a question than to ask one.\nIt seems like almost anything goes as an answer (as long as it isn't incorrect), whereas questions are carefully dissected and studied in an attempt to find flaw with them, as if they were a paper that you wanted to publish.\nA little ambiguous somewhere? ON HOLD\nForgot to formulate your question as a question even though it's clear what you want to know? ON HOLD\nDidn't preemptively defend your question against \"dupe\"-charges? ON HOLD"}, {"author_name": "John", "gravatar_hash": "0d4aefb427aa87a0a593f0655fb6f8ba", "author_url": null, "date": "Jun 26, 2013", "message": "I think this is a great move, though I may miss the angry nature of the old way."}, {"author_name": "Mr Lister", "gravatar_hash": "6caee048c059d29522426ad86324fa59", "author_url": null, "date": "Jun 26, 2013", "message": "But we will need to let go of the acronym VTC and remember to use the new one, VTPOH."}, {"author_name": "GrammarNazi", "gravatar_hash": "688c1b06b9d3948c5db7ba38f1a9fef2", "author_url": null, "date": "Jun 26, 2013", "message": "Would you please add space after the punctuations? The blog post is very annoying to read when the words stick together."}, {"author_name": "Peter Alfvin", "gravatar_hash": "ec173eb866e0d1d97bcd22cf6ad6550a", "author_url": null, "date": "Jun 26, 2013", "message": "Kudos for your work and kudos for an empathetic write up about it. I think acknowledging these issues publicly from the perspective of the users is as important as the changes.\n\nBy the way, if anyone is curious why \"being friendly\" is so important in terms of SE's success, check out http://www.davidrock.net/files/NLJ_SCARFUS.pdf"}, {"author_name": "Jim", "gravatar_hash": "1272fc8bb9da2d6c408e854a22d5dde6", "author_url": null, "date": "Jun 26, 2013", "message": "Good to see progress on this front but I think down voting also needs help. I've often seen a new user come on a site, ask what they think is a good question but get downvoted ruthlessly without any comments as to why the downvote. Requiring a downvote reason and/or a short comment would help keep new users from being discouraged and also forces those downvoting to be honest and constructive in their criticism."}, {"author_name": "David Rees", "gravatar_hash": "2fe66f2cf1fdfb03d6f33f42cb6087a4", "author_url": null, "date": "Jun 26, 2013", "message": "Nice changes and I agree with the sentiment as well.\n\nI do still think there is a real need for opinion based voting. And its a shame SO has decided not to fill that need (yet at least), because this is the community I trust the most to recommend the \"best\" framework/tool/etc. Perhaps in time SO could add a poll-type question in addition to Q&amp;A.\n\nd"}, {"author_name": "mxyzplk", "gravatar_hash": "daebc7539c68e9aa09d70c9826274f9a", "author_url": "http://rpg.stackexchange.com", "date": "Jun 26, 2013", "message": "So what's the appropriate close reason for a lot of the \"too localized\" things now?  Like \"Why is this web site down today,\" (actual question asked on RPG.SE today) or other too narrow stuff based on time? Or should those be legit?"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Jun 26, 2013", "message": "Dusk, Extra Credit:\n\nThat exception already exists."}, {"author_name": "sourcedelica", "gravatar_hash": "38f96f0ffe33e01a893bc84f02b50bf3", "author_url": "http://sourcedelica.com/blog", "date": "Jun 26, 2013", "message": "I think this is a step in the right direction and I'm cautiously optimistic but we'll see how it plays out.  \n\nYou didn't mention the bandwagon nature of the closings that happen.   Once one person votes to close a bunch of others will jump on.  There needs to be a limit on the number of close votes a person has per period of time.  And like downvoting their rep should take a hit every time a close vote is made.\n\nI have seen questions from one of the experts in my field closed. This is a person with 120k+ rep who has contributed hugely to the knowledge base on SO.  And his response is basically \"Forget this - I'm quitting SO\".   That would be a HUGE disservice to everyone.   Someone with that much rep should never get his questions closed.  It should be assumed that his questions are quality.\n\nGoogle has to index everything, including the crap, yet they still do a good job of getting the relevant stuff up to the top.  It seems like with the right algorithms we wouldn't need to depend on people that get corrupted by power."}, {"author_name": "JJ", "gravatar_hash": "dce40e9e07c571b928907e63ba36edfb", "author_url": null, "date": "Jun 26, 2013", "message": "It's about time! :-P\n\nI'd personally like people to be encouraged to leave POLITE AND HELPFUL explanations as to why something is closed. I always do this when I'm doing REVIEWS."}, {"author_name": "Alex Gray", "gravatar_hash": "50e7ed4eb2e7af000ea7d161748958f1", "author_url": "http://mralexgray.github.com", "date": "Jun 26, 2013", "message": "This is an important day.   The current closing \"experience\" is really so flawed - and the lack of any recognition of that fact - made the entire \"Stack Experience\" feel like some gloomy, futile exorcism to me, sometimes.  While at any present moment, it may have felt fun / rewarding to contribute.. a certain sadness pervaded my \"big picture\" view of the sites.  I somehow felt that the tests of time - would ultimately reject - the hard-handed, five-fingered, top-down approach to  \"relevance\" that we have today.  I could easily imagine - that some critical mass would be sufficiently disenchanted by \"the system\" ..  that the long-term scales of favor would marginalize these SE properties that I do so truly hope the best for.  \n\nToday's DOMA ruling is sort of a perfect example of what is wrong with the current system..  5 (7, not a lot, etc) people CANNOT decide - for an entire community - what is interesting, appropriate, or relevant...  And frankly, such a small consensus, on what MAY be a truly important matter to SOME, is a faux-democracy.  Checks and balances, people.  And empathy.  These are missing from the site in a pretty hard-to-swalllow way, now.  a walled-garden of hyper-critical experts is a truly unappealing and dangerous direction, and I applaud this step at alleviating one of the more glaring trouble-spots of this tendency.   \n\n¡Viva la Exchangé!\nAlex Gray"}, {"author_name": "Chetana", "gravatar_hash": "0a720088be49a337443180a8ce07d6cc", "author_url": null, "date": "Jun 26, 2013", "message": "Great post...! :)"}, {"author_name": "hek2mgl", "gravatar_hash": "2ea6b0398ae82d7e96aada90b8938734", "author_url": "http://www.metashock.net", "date": "Jun 27, 2013", "message": "If being a noob won't be hard, the life as a programmer will be even harder. Also in this - online - times noobs should learn how to use books and other resources suitable for beginners.\n\nAlso I think noob guys how ask questions like ... (I think you know) take themself and their problems too serious. Why should the whole programming world should help them with such a boring problem?\n\nMissing the 'close as to localized' button"}, {"author_name": "mplungjan", "gravatar_hash": "8604045dd2e004aeaa3c6599682497f3", "author_url": null, "date": "Jun 27, 2013", "message": "Wish list: Off topic/Please go elsewhere: Allow us to pick that elsewhere. Very pertinent example ELL at EL&amp;U"}, {"author_name": "Dietfrid Mali", "gravatar_hash": "70394fb7138ea1c34609b35522fd9610", "author_url": null, "date": "Jun 27, 2013", "message": "SO has become the playground of self-centered, power hungry, elitist, arrogant pricks that are only concerned about feeding their egos with as many reputation points as possible, mistaking a place that is meant to offer as much help to its users as possible as a source of entertainment and self-elevation. Actually this is the typical behavior of people having no life outside and enjoying no appreciation outside this place worth mentioning (or why should they spend all their available time on SO).\n\nBusiness as usual in every such place where community volunteers are empowered as mods. Seen it often enough before. For me this has been a reason to turning my back on SO long time ago. Just happened to stumle over an old link to this place and finding this blog article noteworthy enough to comment on it."}, {"author_name": "Jon", "gravatar_hash": "7122b4601349f1a28b4f61facf8e1720", "author_url": null, "date": "Jun 27, 2013", "message": "I think that 'This question is about ferret grooming' should become one of the actual reasons a question can get held/closed for."}, {"author_name": "TOMATO", "gravatar_hash": "e2aa4cd8ca03c4b2f71c6443f6e437b1", "author_url": null, "date": "Jun 27, 2013", "message": "@Laura: thanks for replying to my comment. \n\nI have posted on meta about the usability issues I described:\n\nhttp://meta.stackoverflow.com/a/139774/182042 (see the image of my SO page)\nhttp://meta.stackoverflow.com/questions/138972/wont-you-let-me-view-only-my-favorite-tags-please\n\nThe email and RSS subscription suggestions you mention are workarounds, as are suggestions to my meta question that I defensively script the interface with some sort of plugin. That is not a good user experience or user interface design. It is not a matter of making the experience \"ideal\" for every visitor (and to play the \"ideal\" card is just a tried and true way to excuse and ignore a problem). \n\nWhat is the explanation or justification for topics being opt-out rather than opt-in.  There clearly is no technical reason for this. Is there a considered policy or reason? If so, I wish SO would state it so it can be debated."}, {"author_name": "Joe Q", "gravatar_hash": "8f7e3114ec23c6857a68acb692345614", "author_url": null, "date": "Jun 27, 2013", "message": "Modest Mouse - Lounge(Closing Time)\n\nshould be appended to the bottom.\n\n\nCan you close a comment like this one? I hope not"}, {"author_name": "Robert", "gravatar_hash": "b292224996554f6c7e17e754fe8ad60e", "author_url": null, "date": "Jun 27, 2013", "message": "This is a move in the right direction. A lot of what keeps me from contributing are the many people who take the first opportunity to poke unnecessary holes in your answer or question. If I answered a simple question, some neckbeard will come along and downvote it over some obscure technicality then the flock of others will come in downvote you, then mock and antagonize you in comments. It's foolish. I've had to delete countless answers because of people downrating you over a function name, variable name or some silly law of demeter issue on a question from a guy who cant even write an if statement."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jun 27, 2013", "message": "Many of you here who are lamenting the closing of questions and calling it censorship were apparently not here when Stack Overflow was flooded with noisy, under-specified, half-assed questions that weren't worth the electrons they were printed on, before the quality filters were put into place.  It was a very unpleasant place to be, and all you have to do to see where that leads is to look at the comments posted below a typical Youtube video.\n\nThose of you who call us selfish, arrogant pricks because we closed your noisy, under-specified, ill-advised question are certainly entitled to your opinion, but that's all it is: an opinion.  If you don't like the fact that your question was closed, you have two choices: learn how to communicate more effectively, or find other places on the internet where your dicey communication skills are better tolerated.\n\nIt's so easy to criticize, and to throw about the word \"censorship\" as an excuse for justifying \"free speech\" (read: I want to do whatever I want, whenever I want to, and you don't have the right to stop me).  It's harder to make the effort to become a productive member of the community, attempt to understand how it works, gain the respect of others and then lobby for change from the inside out.  But that's exactly what we expect you to do.\n\nThe folks who dismiss SE as an experiment that doesn't work are simply wrong; it is because we ask for higher quality from people's contributions than other run-of-the-mill forums that makes SE attractive to professionals, and it's the professionals that are going to give you useful answers, not the rednecks on YouTube. I'll take a neckbeard over a redneck any day of the week."}, {"author_name": "swasheck", "gravatar_hash": "af267fac1addb7a4778e14b5c85ec5bf", "author_url": null, "date": "Jun 27, 2013", "message": "So are you hoping to change the culture by changing the semantics, or are you hoping that the culture remains the same, or similar, with a more \"friendly\" vocabulary?"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jun 27, 2013", "message": "@swashek: What's the difference?\n\nChanging the semantics changes the culture.  The close reasons are more specific, more understandable and more friendly.  They are easier to apply, and will attract less negative attention from people who want to put \"canihazcodes\" or \"what have you tried\" in comments."}, {"author_name": "Steve Wortham", "gravatar_hash": "74a172492a8f88e38e605628cf401afb", "author_url": "http://regexhero.net", "date": "Jun 27, 2013", "message": "It's very nice to see this happen.  I remember one of my questions being closed because it \"wasn't a real question.\"  And I thought that was a hilarious reason that didn't really explain anything at all.  So I posted a comment including the definition of the word \"question\", which admittedly was a snarky thing to do.\n\nBut making the close reasons more specific and helpful should go a long way towards making things more user friendly."}, {"author_name": "Joeri Sebrechts", "gravatar_hash": "14648400f902ed43fd7a15a4bce33d85", "author_url": null, "date": "Jun 28, 2013", "message": "@Robert Harvey: you have a point that the quality on the SE network is higher than other forums, but the strict rule interpretation has a perverse consequence of discouraging questions at the edge of knowledge.  So, while you can get good answers from professionals on things that are well understood, the rules themselves forbid discussion of topics that are very novel or not well understood. This means that the SE network is primarily a vehicle for syphoning knowledge from experts to beginners or intermediates, but is not a useful platform for knowledge exchange between experts. In my personal experience the questions that I am most interested in (because the answers are not clear-cut) end up being closed. \n\nAlso, the \"closed as duplicate\" reason is very frustrating to me. The interpretation of \"duplicate\" must become way more exact than it is right now, because I see it used inappropriately all the time for questions that are similar but not exactly the same."}, {"author_name": "happy", "gravatar_hash": "3caf451b1944b42d725a816ae1a9bdae", "author_url": null, "date": "Jun 28, 2013", "message": "Bravo. I am sure that there is some kind of phenomenon where a perfect society inevitably leads to corruption and power struggles, kind of like film 'The Beach'.\n\nI notice that people edit non-English speaking questions, why don't they do the same for badly written questions in general? Might solve some of the issue.\n\nConstructive guidance, not censorship, is the way IMHO"}, {"author_name": "Steve (Gadget) Barnes", "gravatar_hash": "8293c31724f4243643e058bd24202d45", "author_url": null, "date": "Jun 28, 2013", "message": "Darn, you mean that I am going to have to reply with \"too broad\" rather than RTFM(p 1 para 1) now!\n\nSeriously it does sound good - it is too easy to close someone down because \"it's obvious\" when it is after you have a few decades of very specific experience."}, {"author_name": "Andrew Thompson", "gravatar_hash": "a1ab0af4997654345d7a949877f8037e", "author_url": "http://pscode.org/", "date": "Jun 28, 2013", "message": "Re. close reasons as 'off-topic'.  I disagree with the wording of one possible suggestion.\n\n\"Questions concerning problems with code you've written must describe the specific problem and include valid code to reproduce it. See SSCCE.org for guidance.\"\n\nThis implies the person asking the question 'must' supply an SSCCE,  whereas the SSCCE document itself contradicts that. Vis.\n\n---\n Let us assume you are indeed genuine in your learning, you have a huge, complex system with an occasional, unpredictable bug, and you have searched the FAQ &amp; Group, studied the manual or documentation and not produced an answer.\n\nFeel free to describe the problem to the group; perhaps it is a basic misunderstanding on your part that can easily be cleared up.\n\nI am not proposing that every single problem needs a SSCCE in order to be solved. I am also not suggesting an example is, or should be, compulsory.\n\nIt will, however, make people much more likely to help, and will therefore increase the chance of finding a solution.\n---\n\nAs the author of the SSCCE document, I stick by that caveat.  There *are* people who are capable of narrowing a problem down to a few snippets of code, and other people who are willing to eye-ball that code, looking for errors.  I'm not one of them, but that is beside the point..\n\nIMO it would be better if that read..\n\n---\nQuestions concerning problems with code you've written must describe the specific problem and *should ideally* include valid code to reproduce it. See SSCCE.org for guidance *on the latter.*"}, {"author_name": "Cal Smith", "gravatar_hash": "e9557177a69c1920315420069328916f", "author_url": null, "date": "Jun 28, 2013", "message": "Well done! I believe this will help create a greater sense of community and a friendlier atmosphere for new users of SO Salesforce."}, {"author_name": "batpigandme", "gravatar_hash": "4bec4b3e1975a3317b58dcab10367d06", "author_url": null, "date": "Jun 28, 2013", "message": "Wow - I'm not sure if this says more about me as an SE nerd or a SOIAF nerd that I laughed so hard at this post..."}, {"author_name": "Dave Inman", "gravatar_hash": "a3f5597acbaf24ccc52503da710b9ac2", "author_url": null, "date": "Jun 28, 2013", "message": "What leads me here is an improperly closed issue.\n\nI just got a solution from a closed issue.  I wanted to correct some assertions made in other comments (prior comments said the problem I encountered was limited to certain ruby patch versions and I could show the problem in others.)  The problem was closed as 'too localized' and I could not clarify the extent of the problem with a comment.  Not sure was is meant by 'too localized' when the answer involves multiple patches of ruby, different versions of json, and even in its partially incorrect form has helped many developers.\n\nI didn't see a way to request a closed issue to be re-opened.\n\nThis close policy seems poor.  The closers come off appearing as weaklings suddenly given some power.  I'm not saying they are, but it sure looks bad."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://niumanengrand.", "date": "Jun 28, 2013", "message": "@Dave Inman: The way you request review of a closed question is to post a request on http://meta.stackoverflow.com.\n\n"}, {"author_name": "Make this retroactive?", "gravatar_hash": "b16025db46227559047af12e0bf2108b", "author_url": "http://superuser.com/questions/587852/adobe-flash-player-update-service-is-useless-it-doesnt-actually-auto-update", "date": "Jun 28, 2013", "message": "Can this policy be made retroactive? (for already closed questions)\n\nI was treated quite poorly here...\n\nAdobe Flash Player Update Service is useless — it doesn't actually Auto-Update Flash Player...until a month later [closed]\nhttp://superuser.com/questions/587852/adobe-flash-player-update-service-is-useless-it-doesnt-actually-auto-update\n\n...my 1st &amp; last post on superuser.com.\n\nNote: even tho I edited it, it was NEVER re-opened...&amp; as a lowly, useless, new user, I can't even appeal a close -- I can't even vote to re-open my own question -- I can't even re-open it to post my own answer. I can't do anything except edit the question, comment &amp; be called names by high-ranking users. You should make it so the original asker of the question can ALWAYS post an answer. You should also allow new questions to be open for at least 30 days BEFORE slamming the door on them. My question was open for less than 24 hours.\n\nStepping on new users is NOT a way to run a site. I don't care if the veterans think my question is the longest, dumbest, stupidest, most moronic question they've ever seen, don't attack me for asking it, simply tell me SPECIFICALLY what's wrong with it (or edit it yourself!)...&amp; how I can improve it, so it will be left open &amp; answered. Someone even voted to close my question WITHOUT READING IT. He said \"TL;DR;! Sorry!\". You should NOT be ALLOWED to vote to close if you didn't read it!\n\nThe ONLY thing that should be closed immediately is SPAM. Real questions, no matter how bad, long, vague or whatever, should be left open (for at least 30 days).\n\nRobert Harvey: I don't  think low-ranking users CAN post on meta!...(looks it up)...OK, you only need 5 points for meta, but still. If I wanna officially protest the closing of my question, I will take it to meta, thanks for that info (&amp; yes, I know, for my question, to take it to meta.superuser.com, since my question was on superuser.com).\n\nWow, my (closed) question was long &amp; so are my comments here, I really just can't post anything without it being a book!"}, {"author_name": "Zenith United", "gravatar_hash": "cf824ea04aded6f53e442f9013ee9e70", "author_url": "http://www.anaggh.org", "date": "Jun 29, 2013", "message": "This is just amazing. I like the way how it is going."}, {"author_name": "Shayne O", "gravatar_hash": "efb8f50e6ffe6cfbdc31f308a25606fc", "author_url": null, "date": "Jun 29, 2013", "message": "The current close system is insanity. Almost every god damn question I encounter is closed for increasingly absurd reasons, and to make it worse these then invite a stream of upset people asking why the hell it was closed. \n\nFrankly there needs to be a penalty for closing, not a serious one, but one that diminishes rep in such a way that its used as a weapon of last resort, not just a knee jerk reaction to anything the closer doesn't get.\n\nAnd yeah, tool questions need to be allowed. If the tool doesn't work we can't get our jobs done. Thats a bad thing.\n\nAnd while I'm at it, PLEASE can we get rid of the ability for others to edit our comments. I have a number of comments where people have edited them into utter nonsense. Those are my words damn it, don't put YOUR words into my mouth!\n\nSO has become a very frusturating site to read lately."}, {"author_name": "Pandu", "gravatar_hash": "dfe4c8b12c32d673f1db2d110b93c845", "author_url": null, "date": "Jun 30, 2013", "message": "This website is full of egoistic and rude people who think that they know everything. That's why everybody hate this site."}, {"author_name": "Paul", "gravatar_hash": "4a830efa184076ef7be805c261a23a1e", "author_url": null, "date": "Jul 01, 2013", "message": "You have a LONG way to go, especially over in physics.se where the site is run by a gang of undergrad and grad students who don't enforce existing policy except when it benefits them or members of their online clique. Students shouldn't be moderators. They basically chased me out for pointing out errors in answers, accusing me of introducing \"fringe science\" and straying from \"mainstream physics\" when most of what I pointed out was erroneous terminology. As a holder of a graduate degree in physics and twenty years of undergratuate teaching experience, I will NOT be preached to by snotty little students. While management claimed to look into my concerns, I was basically told that they saw nothing unusual. So be it. \n\nGet rid of the student moderators and I may come back, but otherwise I won't."}, {"author_name": "Paul", "gravatar_hash": "4a830efa184076ef7be805c261a23a1e", "author_url": null, "date": "Jul 01, 2013", "message": "I forgot to mention that after I left physics.se, the moderators made disparaging comments about me in the chat room, which I also reported to management but alas, nothing was done about that to my knowledge. If physics.se is intended to be a gang hangout for children then please advertise it as so. Otherwise, the moderators need to be relieved disciplined."}, {"author_name": "Anna Lear", "gravatar_hash": "8fac59804fcd73fcce38586ea20ef861", "author_url": "http://meta.stackoverflow.com/users/155160/anna-lear", "date": "Jul 01, 2013", "message": "@Paul If you have a grievance to file against a site's moderators, please drop us an email at team@stackexchange.com with all the relevant details. Thanks!"}, {"author_name": "Papa Bib", "gravatar_hash": "988ac96485ac577f0427429ea6d1eb81", "author_url": null, "date": "Jul 01, 2013", "message": "And why do you hate slightly detached guidance counselors? Is it because your father was a slightly detached guidance counselor?"}, {"author_name": "JJ", "gravatar_hash": "dce40e9e07c571b928907e63ba36edfb", "author_url": null, "date": "Jul 02, 2013", "message": "Robert Harvey: \"Those of you who call us selfish, arrogant pricks because we closed your noisy, under-specified, ill-advised question are certainly entitled to your opinion, but that’s all it is: an opinion.\"\n\nIf I never have to read another post with this aggressive, rude, self-pitying, obnoxious, self-important, and above all, hypocritical, tone again, it'll still be too soon."}, {"author_name": "Paul", "gravatar_hash": "4a830efa184076ef7be805c261a23a1e", "author_url": null, "date": "Jul 02, 2013", "message": "Yeah Anna, I went through that and was basically told that the moderators didn't do anything wrong. I won't be going through that farcical process again."}, {"author_name": "al", "gravatar_hash": "78eabf31eb20f8146f66df1dd2fa568c", "author_url": null, "date": "Jul 02, 2013", "message": "The problem is very simple - there are all these systems for quality control of questions, but nothing at all for quality control of moderation and moderators. \n\nExample: on http://apple.stackexchange.com I saw a question that had been closed by a moderator as \"Too localised\", even though it's about a common problem with popular, on-topic software. It had something like 6 upvotes, and 4 or 5 people getting involved in the comments, giving suggestions and talking about how they tried to deal with the same problem. Clearly not \"too localised\".\n\nSo I did the \"right thing\" and flagged the question for re-opening. \n\nEveryone makes mistakes (although most mistakes don't prevent someone getting a real problem solved and don't prevent someone else from sharing their knowledge...), and this allows them to undo the mistake and move on, before any other users are deterred from interacting with the site. Simple, right?\n\nExcept the moderator didn't re-open the question. The moderator saw my flag, saw that they were clearly in the wrong, and DELETED the question to cover up his/her mistake.\n\nShameful. Like a child trying to hide the toy they broke.\n\nWill anything happen to this moderator? No, nothing at all - because there is no system of quality control for moderators. They will carry on closing the wrong questions, and will carry on deleting them when challenged, and the community will suffer as a result."}, {"author_name": "al", "gravatar_hash": "78eabf31eb20f8146f66df1dd2fa568c", "author_url": null, "date": "Jul 02, 2013", "message": "Huh, actually false alarm - double checking on that specific example I talked about, it's currently not deleted (but still closed). Maybe it was deleted then undeleted (is that possible?) or maybe I just mucked up a URL or search term back when I thought it had been deleted. \n\nBut things like this do happen, and in my whole time on SE I think I've only once since a moderator admit they made a mistake and reopen a wrongly closed question."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jul 02, 2013", "message": "@JJ: I'm glad you agree."}, {"author_name": "Karoly Horvath", "gravatar_hash": "5cdee2abea51e91756076032f0053081", "author_url": null, "date": "Jul 05, 2013", "message": "Oh, one thing. I think changing the name of anything (in this case, calling it \"on hold\") won't change anything. Sure, it sounds nicer, but the effect is the same.\n\nI think at the very least the closers should be notified if the question was updated - perhaps 15 minutes after the last change to prevent \"spamming\"."}, {"author_name": "Alessandro Mattiuzzi", "gravatar_hash": "7a2702dd0ff3fa294328aa4d6cfecf77", "author_url": "http://www.econorma.com", "date": "Jul 07, 2013", "message": "You are right to keep the quality of your site high. But sometimes pleople have lost in translation problems just because the language is different"}, {"author_name": "Bob Bobson", "gravatar_hash": "820d0e4ee14e986a44d33782ca852f51", "author_url": "http://www.org/", "date": "Jul 12, 2013", "message": "I’m glad to see that the issue is finally being addressed. I love the graphic because it finally looks at things from the user’s point of view.\n\nReally the only close reason that was a problem was “Too Localized”.\n\n“Off Topic” is the easiest to understand (though even that can be difficult sometimes when you cannot determine whether the question belongs on this site or another one (e.g., SO/Programmers).\n\nEven “Not a Real Question” was pretty clear; it is not difficult to understand that the question/problem simply cannot be understood (especially if you have seen a few such questions).\n\n“Not Constructive” sounds kind of like a personal attack, but even that makes sense (especially if the explanation were worded a little better) once you see a few examples of bad questions like “what’s better/faster?” and the like (though even those are often legitimate when talking about performance optimization, simplicity, cost-effectiveness, etc.)\n\nOnly “Too Localized” is confusing, insulting, and frequently misused, even by experienced users and admins. Obviously something like “what’s the cheapest…” would fit, but almost every other kind of question could at least be *made* to fit (maybe some sort of auto-conversion-to-chat?)\n\nLike others have pointed out, when someone has a problem and reaches out for help, they don’t care whether it will or could help others (in the future no less), they are trying to get help for their immediate problem. There are plenty of places that people can get help, so turning customers away for such a foolish reason is, well, foolish.\n\nDon’t make Mr. T mad. Welcome users, don’t turn them away."}, {"author_name": "Brad", "gravatar_hash": "1f744618bae7f59c10ae01152c85d8f6", "author_url": null, "date": "Jul 15, 2013", "message": "Have any of the people bemoaning moderation visited any Q&amp;A sites that *aren't* moderated? How'd that go?\n\nWhy do you want to post your question on Stack Overflow so badly? Is it because Stack Overflow is the best site? Yes, and it's the best because of the very house cleaning you're complaining about.\n\nStack Overflow in particular gets WAY too many posts to just let people post anything they want. It would become just as bad as all those other Q&amp;A sites in a matter of *days*. It has to have a scope, and that scope has to be enforced, or the whole thing would collapse.\n\nIt's good that these improvements are being made so that users will understand why things are happening; we should help new users who are willing to learn to ask better questions so that they can in turn receive better answers.\n\nOn the other hand there are clearly a small percentage of people who are *not* willing to change in even the slightest way, will accept no quality standards or limitations on scope, and get outraged when told that these sites are different that forums where they can post whatever half-formed thought popped into their head. They will not be missed."}]}