{"response": [{"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 25, 2009", "message": "Also, it looks like Google has put some <i>serious</i> smack down on that programmingfaq site. They barely appear in the Google indexes at all from what I can see (via the site: operator).\n\nAnd if you aren't in Google's index, you cease to exist..\n\nhttp://www.codinghorror.com/blog/archives/000767.html"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 25, 2009", "message": "Jeff, how do you suggest attribution of the data as a whole? I have distributed SQLite versions of the data dump with the following under a \"copyright\" section in the README file:\n\n    copyright:\n    \tthe data in the dump, as well as all other files in this distribution, are distributed under the creative commons \"Attribution-Share Alike 2.5 Generic\" license (http://creativecommons.org/licenses/by-sa/2.5/). attribution should indicate the creator of the files is the StackOverflow user nobody_, and that the data is attributed to StackOverflow's users and owners in whatever form they wish to be attributed. \n    \t\n    \tin compliance with this license, the data contained in so-export-sqlite-2009-06.db.gz is hereby attributed to the users and owners of StackOverflow, but not in such a way as to suggest that they endorse me or my use of the data.\n\nIs this acceptable? (Apologies in advance if the blog messes up the formatting)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 25, 2009", "message": "nobody_ hmm, well, I think there are two cases there\n\n1) <b>publishing</b> the data\n\n2) <b>analysis</b> of the data in aggregate\n\nif #1, the blog post applies. if #2, then a single link to the site and a mention of where the data came from is probably all that is necessary.\n\nI think most of this is irrelevant until you begin publishing the underlying data."}, {"author_name": "alex", "gravatar_hash": "d0f517950e189ebe69c903a14cf36fab", "author_url": "http://www.alexanderdickson.com", "date": "Jun 25, 2009", "message": "Wow!\n\nThe 'latest post' on hiveminds.se is one of my questions!!!\n\nAnd apparently, the people who answered my question are 1 and 2."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 25, 2009", "message": "Exactly... I could complain about incorrect attribution at these sites, but I basically have to issue a DMCA takedown notice if I can't find an email address to complain to, or cannot get responses to my emails.\n\nUnpleasant all the way around."}, {"author_name": "kibbee", "gravatar_hash": "2b568071163c0d009635cfa63cf6e6ac", "author_url": "http://www.kibbee.ca", "date": "Jun 25, 2009", "message": "In the end, stopping this kind of thing is impossible.  Because you can't serve a DMCA notice outside the united states.  What do you do when the server is hosted on some server in China.  Nothing.  Not only that, but you've put the data up on bittorrent for everyone to download in a nice, easy (almost as easy as csv), file format for anybody to import into their own database and do as they please with.  It's a non winning battle. And I think the best we can hope for is that Google doesn't index those sites."}, {"author_name": "Dave", "gravatar_hash": "73c4f6cf1baa9ab44f7036010a960077", "author_url": null, "date": "Jun 25, 2009", "message": "&gt;&gt;must attribute the work in the manner specified \n&gt;&gt;by the author or licensor\n\nPlease post your 'manner specified by the author or licensor' somewhere.  You know either on the stackoverflow or with the dump or on the blog post where you announced the download.\n\nSince you have not specified the manner of attribution, any format of attribution, however slim, would suffice."}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Jun 25, 2009", "message": "What about adding the attribution in the content it self ( haven't seen the SO dump schema, but my guess is they are different fields )\n\n\nBy adding ( prepending or appending I don't know ) the attribution in the content most of the autopublished - content will have it already.\n\n:-/  \n\n======\n\nIn 100 yrs, people will ask: What was the most frequently asked programming question in 2008. And the answer will be \n\nhttp://stackoverflow.com/questions/84556/whats-your-favorite-programmer-cartoon\n\n:)"}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jun 26, 2009", "message": "Why not make it easier to include this? Make a button that will generate some code that people can paste into their site that includes all of the information that you'd like them to use."}, {"author_name": "Stu Thompson", "gravatar_hash": "428344688dc21d72a3723d94bed66680", "author_url": "http://www.dietpizza.ch/geekomatic", "date": "Jun 26, 2009", "message": "&gt;2) analysis of the data in aggregate\n&gt;\n&gt;...if #2, then a single link to the site and a mention of where the data came from is probably all that is necessary.\n\nWhew!  I was starting to feel horrible for a second there when I read this posts title, with all my analysis and graphs and such.  :P\n\nAnyway, can you divulge how you are finding out about these copy-and-no-attribute sites?"}, {"author_name": "Jeff", "gravatar_hash": "96b07d9524bf260d6b85900a50a032bf", "author_url": null, "date": "Jun 26, 2009", "message": "Jeff:\n\nI have to agree with Dave above.  The Attribution portion of the cc-wiki license is reasonably clear that the you needed to make the attribution style clear.  \n\nSince you did not do this up front, any style of attribution will be sufficient until it is made clear -- perhaps the next dump file should have a license.txt in it?"}, {"author_name": "Boofus McGoofus", "gravatar_hash": "4e9780a76d37ea5676f3f22eac74c81f", "author_url": null, "date": "Jun 26, 2009", "message": "If it were my site, I'd have the cc-wiki link take you to a page summarizing the cc-wiki rules (and linking to the cc site) along with your attribution requirements.  I usually want to find out how people want to be attributed around the same time that I'm trying to find out how the content is licensed."}, {"author_name": "Chas. Owens", "gravatar_hash": "844c572938eaad1e44eb084fb39416f9", "author_url": "http://wonkden.net", "date": "Jun 26, 2009", "message": "I have been thinking of posting some of my better answers in an edited form to a blog.  Since I am the author of the post I assume I don't have to worry about the license, but I am slightly worried since other users can edit my posts and have some claim to the edited content.  Would a link back to the question/answer be enough (I was planning on it anyway because I want more people to use the site)?"}, {"author_name": "Phil Bachmann", "gravatar_hash": "58162fe28bdfbd3bc885f1c3d4911b3f", "author_url": "http://www.sbutton.com", "date": "Jun 27, 2009", "message": "I agree with Dave et al, that you need to tell people clearly what copyright you're asserting before you expect them to comply.  It needs to be on every page of Stackoverflow, just as you currently have a link to the meaningless page at creativecommons.org/licenses/by-sa/2.5.\n\nAlso I think you should make it clear whether contributors have the right to republish material they have submitted.\n\nYou have built a reputation as a super nice guy who would not dream of using peoples' freely given contributions for personal profit.\n\nCan't wait to see what what you do next."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jun 28, 2009", "message": "I expected that to happen. I always wondered why being able to get a data dump of the questions was such a \"hot\" feature. I mean unless you are going to build one of these \"scammy\" sites, I don't see why you'd want it. Sure, there might be a couple people trying to do some sort of analysis but let's be honest, we know why most people would want it."}, {"author_name": "alex", "gravatar_hash": "d0f517950e189ebe69c903a14cf36fab", "author_url": "http://www.alexanderdickson.com", "date": "Jul 07, 2009", "message": "ha! the 'latest post' is still my question! I wonder if they'll merge the new data dump. And perhaps they might put correct attribution on it now."}, {"author_name": "nll", "gravatar_hash": "07118fb869f6b4bb140d3cc33e6ac4d1", "author_url": "http://stackoverflow.mobi", "date": "Jul 08, 2009", "message": "Hi, I am fan of stackoverflow and purchased stackoverflow.mobi in order to make your data dump available on mobile internet.\nI will be complying with your rules here and will make mobile site source code publicly available.\nI hope you'll be ok with my idea.\n\nPlease let me know your thoughts.\n\nThanks"}, {"author_name": "Sarah", "gravatar_hash": "d1eea20f76acaf5d5066dfdc3f3cdb78", "author_url": "http://www.3till7.net/", "date": "Sep 22, 2009", "message": "Is it all right if we import our own user RSS feed to Facebook?  Our answers and questions will get posted there with a link back to Stack Overflow, but I don't think \"Stack Overflow\" will be included anywhere, since it's not in each RSS entry."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackql.net", "date": "Oct 02, 2009", "message": "I'm gearing up for a new StackQL.net release in anticipation of the October data dump.  Coming back to and reading this again raised a question regarding StackQL.net (and by extension StatOverflow.com/sandbox as well). \n\nReading over this again, it looks like StackQL technically violates item #4 for your required attribution list.  We mention where the content comes from, try to link back to original questions by matching any column name in the result set that ends with PostID, QuestionID, or AnswerID, and make author names available in the results unless a user specifically excludes them from a result set by not selecting * or not selecting OwnerDisplayName.  \n\nBut it doesn't link those author names back to profiles, and that sounds like a violation.  StackQL does create a link for any item in query results where the column name ends with \"UserID\", so links are created; they're just not attached to the name.\n\nAside from this one (minor) point I think the site does everything reasonable to follow the attribution guidelines.  Even here I think I'm following the spirit of what you're asking for, but it does fail when held up to the letter of law, so to speak.  StatOverflow does even less, but I doubt you have any problems with it either.\n\nCould you clarify the public attribution requirements in a way that makes us less legally murky? I don't expect you'll sue myself or Ian over the issue, but I'd like things set up in a way that would enable others to do the same kind thing if they want."}, {"author_name": "Carol", "gravatar_hash": "8356471bf650b70847379a76adce9cc4", "author_url": null, "date": "Jul 14, 2010", "message": "I agree. If someone takes the time to write something, then it is only fair to use them as a source versus stealing their work."}, {"author_name": "Pratik Stephen", "gravatar_hash": "c565e2a75a6ec62667c437dca9e4a449", "author_url": "http://www.PratikStephen.com", "date": "Sep 15, 2010", "message": "Jeff, I don't see any positive examples of attributions mentioned in your post. This will be a good easy guide for users!\n\n(Stumbled upon this while being frustrated looking for guidelines on CC-BY attributions from flicker!)"}, {"author_name": "Anone Mouse", "gravatar_hash": "0ee7686a4c02c4fed7cdf43b82a15a00", "author_url": null, "date": "May 13, 2011", "message": "http://stackmobile.com/, both the current version and current beta, aren't following points #2 and #4 above."}, {"author_name": "Keith Nicholas", "gravatar_hash": "22aac6106c44ae4078bd4c0a564714e0", "author_url": null, "date": "Jun 09, 2011", "message": "So does this mean for every little code snippet you use off stackoverflow, you need to provide attribution?  because, if so, that sucks!"}, {"author_name": "Thom Priemon", "gravatar_hash": "442ab696fd61eabcc96efb02cc0f8098", "author_url": null, "date": "Oct 11, 2011", "message": "I was adding friends to my account i am a jazz photographer and i recieved a warning for adding people i know...how can this be possible these are people i speak to often and are friends and acssociates in the Jazz world ...mostly performers i have written books on. can you help me i received a 2 day band from sending request....how else do i add my friends and associates."}, {"author_name": "Arun", "gravatar_hash": "481a613a756274d12dfcf127bcddda6e", "author_url": null, "date": "Nov 14, 2011", "message": "So Can I sell a printed version of StackOverflow with all these attribution stuff you have mentioned here?! :)"}, {"author_name": "Hemorrhoid", "gravatar_hash": "e5071a70d2abf3c0fe1a89ec307b7b87", "author_url": "http://www.ridpiles.com", "date": "Dec 15, 2011", "message": "The blog post applies. if #2, then a single link to the site and a mention of where the data came from is probably all that is necessary.\n\nI think most of this is irrelevant until you begin publishing the underlying data."}, {"author_name": "ChrisLamont", "gravatar_hash": "9cc3e3bb2ff2ef30810be80ca741de70", "author_url": null, "date": "Jan 23, 2012", "message": "There are several great posts on SO that don't fit the Q&amp;A format and have been closed and deleted. I hear that these questions are available to users with 10K rep.\n\nHow do I remix (with attribution) these questions?"}, {"author_name": "Jim Michaels", "gravatar_hash": "1d5010f333d8504309c43e2e015768a9", "author_url": "http://JesusnJim.com", "date": "Feb 08, 2012", "message": "I If this is the license, I don't see where it says anything about usage in my code.  if I use this stuff in my code, will it conflict with the GPL3 License?"}, {"author_name": "João Seguro", "gravatar_hash": "b715877e7a991d04861b44b325fccb20", "author_url": "http://www.segurosautomovel.com.br", "date": "Mar 07, 2012", "message": "Great job detailing about the attribution. I always wonder how the attribution should be as most places don't add this information."}, {"author_name": "Roel", "gravatar_hash": "5e465869337e8036537778d0f817c11f", "author_url": null, "date": "Apr 18, 2012", "message": "Question: if I just use an idea seen on stackoverflow - like for instance I noticed that one solution for a given problem (how to prevent 'killed messages') was to use 'wait' in linux after sending a 'kill'. If I do not copy/paste the exact same solution, but instead simply use the wait command in my code (i.e the idea is used but not the exact content), then I assume no need for attribution is present - correct?"}, {"author_name": "Roel", "gravatar_hash": "96ca88ac0aa3ff7498bc09fc77e718db", "author_url": null, "date": "Jul 24, 2012", "message": "For people interested in this topic, please see\n\nhttp://meta.stackoverflow.com/questions/139698/re-using-ideas-or-small-pieces-of-code-from-stackoverflow-com/\n\nIn which I tried to further clarify some of these questions"}, {"author_name": "Jones Handy", "gravatar_hash": "257fd304328e1f57354ce86108e9d164", "author_url": "http://kostenloshandyorten.de", "date": "Aug 03, 2012", "message": "On the programmingfaq from w3ec i red that the data is pretty old. Is it still required to quote the author names? I quoted a few sentences but only linked back to stackoverflow. No clue where i find the author page..."}, {"author_name": "Martin Spamer", "gravatar_hash": "9b09f3f8d813d899d516943cd0220907", "author_url": "http://www.spamer.me.uk", "date": "Nov 09, 2012", "message": "Stackoverflow should also abide by the 'nofollowed' restriction."}, {"author_name": "forums", "gravatar_hash": "e4e84fadbbe5bcb3e634623f41aaa929", "author_url": "http://www.forums.mcrawy.com", "date": "Nov 12, 2012", "message": "Stackoverflow should also abide by the ‘nofollowed’ restriction"}, {"author_name": "spidaboy7", "gravatar_hash": "3d9ea259f0a22bebb52aba7b7af615c7", "author_url": "http://notyet", "date": "Nov 14, 2012", "message": "Hello Jeff,i am redesigning my website to include question , answers and to include some tutorials too,however i like SOF design,look and feel,i was wondering if i could borrow some design from and SOF and images like buttons,if probably yes,which licence should i use in this case.My apologies for typos,i am not a native english speaker"}]}