{"response": [{"author_name": "Igal Tabachnik", "gravatar_hash": "c12b67ddd060aa0abbb59da1b0da3530", "author_url": "http://www.hmemcpy.com", "date": "Jun 03, 2009", "message": "Here's how a programmer reads your CV versus how HR do it:\n\nhttp://imgur.com/uhudo.jpg"}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": "http://blog.tapuchim.com/", "date": "Jun 03, 2009", "message": "And I thought you were hiring..."}, {"author_name": "James McKay", "gravatar_hash": "c17cb25cd9793d3d972c5cc3b1ae6eee", "author_url": "http://jamesmckay.net/", "date": "Jun 03, 2009", "message": "Here's an interesting point that may be worth considering.\n\nOne of the advantages of the Joel on Software jobs board is that it is very targetted. Your typical JoS reader is the kind of person who reads programming blogs for fun, makes an effort to become a better developer, and (hopefully) knows how to handle recursion.\n\nThis means that by only advertising your job openings on JoS, you'll already be filtering out the recruiters' nightmare of opportunists who aren't qualified for the jobs you're advertising by a long shot. That's why it has so much more value than, say, monster.com.\n\nOn the other hand, Stack Overflow has a wider audience that includes people who have just arrived at the site through Google because they're trying to figure out the bare minimum that they need to know to get their job done.\n\nBy advertising on SO, you'll be widening your audience to include people like that, and therefore reducing its value somewhat.\n\nI'd be interested to know whether this becomes an issue in practice and how you plan to address it if so."}, {"author_name": "Eduardo", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": "http://divisionsoftware.com", "date": "Jun 03, 2009", "message": "I think that you can do better job targeting the ad according to the question, you know: if the question has the tag Java, show a Java offering, etc."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Jun 03, 2009", "message": "&gt; Since Joel and I are already in bed together\n\nrm -rf mental-picture.jpg"}, {"author_name": "Cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Jun 03, 2009", "message": "@James: you bring up some fair points.\n\nPersonally I think where there is potential for a StackOverflow value add is that here there are potentially thousands of answers on technical topics given by the prospective employee that the employer or recruiter can look at to learn more about the candidate and his or her knowledge, skills and abilities.\n\nIt's not a perfect measure mind you but it beats the hell out of the lies that are told on CVs."}, {"author_name": "Ray Vega", "gravatar_hash": "2da21199d56ce93c5092f1c386d5a577", "author_url": "http://lexicalclosures.blogspot.com/", "date": "Jun 03, 2009", "message": "I like how you require that the hiring company must identify themselves even if posted by headhunters.  I never understood why some companies mask themselves. A great company does not need to do this.\n\nWhat are they trying to hide? It can be a red flag; indicative of a company culture that might be problematic."}, {"author_name": "Mike Stone", "gravatar_hash": "c8ba7ccacc70a7b826184e8d717bfcd7", "author_url": "http://smellsblue.blogspot.com/", "date": "Jun 03, 2009", "message": "So happy to see this finally come out!  Thanks Jeff!  My company is no longer hiring programmers (right now), like when I wanted the feature, but I can't wait to use it when we do... and the Server Fault one is perfect timing, because I think we are looking for another sysadmin.\n\nI also like the targeted ads Eduardo mentions... that would be really cool, and ultimately you might even be able to build in a way to say whether or not you are looking for a job in your profile (privately, not advertised for companies to see) so you would get or not get job ads based on the setting... and maybe even mark what expertise you would like the jobs to focus on... possibly defaulted to the tags you have heavy answers in.\n\nYou could do a lot of cool stuff with jobs integrated into user profile information.\n\nI'll be recommending this to my boss ASAP!"}, {"author_name": "Andrea", "gravatar_hash": "d442474b9c83d51a32049cd3f61cb44f", "author_url": null, "date": "Jun 03, 2009", "message": "@configurator: and so did I :P"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jun 03, 2009", "message": "@Mike\nJoel's own ad for the fogcreek vacancy specifically says they don't care what language/technology you know because what they use might change - they just want great developers.\nHaving the board only show you jobs that match your 'interesting' tags is feeding the HR box-ticking that screws up the hiring process at the moment."}, {"author_name": "Stuart Cam", "gravatar_hash": "374b53ba9d83eab49f51eb66b830b020", "author_url": "http://blog.codebrain.co.uk", "date": "Jun 03, 2009", "message": "+1 @mgb.\n\nMy current nightmare - http://blog.codebrain.co.uk/post/2009/06/03/A-Day-In-The-Life-Of-A-Software-Recruiter.aspx"}, {"author_name": "Stuart Cam", "gravatar_hash": "374b53ba9d83eab49f51eb66b830b020", "author_url": "http://blog.codebrain.co.uk", "date": "Jun 03, 2009", "message": "Following from my previous comment...is there mileage in allowing candidates to broadcast their work availability on StackOverflow Jobs?"}, {"author_name": "Cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Jun 03, 2009", "message": "@Ray: there are cases when masking the company name is justified.\n\nThese include:\n\n- It's a small company: hiring somebody can indicate somebody is getting fired or has put in their notice;\n- An ad may give away what your company plans are. Certain Apple products, for example, have been outed by job ads;\n- Putting the company name may in some cases increase the noise factor as people apply just because of the company without being suitably qualified.\n\nAnd thats just a few.\n\nThat being said, hiding the company name is definitely overused in recruitment. It seems to be the standard position and that's wrong (imho). The default position should be to be open where you only hide it if you have a really really good reason.\n\nCAPTCHA: charmers dance"}, {"author_name": "Mike Stone", "gravatar_hash": "c8ba7ccacc70a7b826184e8d717bfcd7", "author_url": "http://smellsblue.blogspot.com/", "date": "Jun 05, 2009", "message": "@mgb\nI didn't mean to imply the board itself would only show certain language jobs, I'm speaking of the ads that are shown to me as a SO user.  If I always answer only Java and Ruby questions, it's fair to say that I would probably prefer a job in those technologies... so why even bother showing me an ad for a Pascal or Cobol development position?\n\nGranted, if I go to the jobs board, I should be able to browse whatever... but the targeted ads should be just that... targeted towards who might be interested in them (which is why I think a setting of whether or not you are looking would also be good)."}, {"author_name": "mary", "gravatar_hash": "ab23f1bf1b4ca1313623396ab94cfa99", "author_url": "http://www.ropaplaza.com", "date": "Dec 02, 2010", "message": "Hi,you have a different vews ,you blog is very beautiful and I agree with your some opinions.I fell happy when I see you blog .The winter is coming take care of youself ,as a friend ,please wear thick <a href=\"http://www.ropaplaza.com\" rel=\"nofollow\">winter coats</a> when you go outside if the weather is cold and you can buy<a href=\"http://www.ropaplaza.com\" rel=\"nofollow\"> winter jackets</a> for you friend."}, {"author_name": "good jewelry stores", "gravatar_hash": "2b569b340de381b1640eb092d239c6d4", "author_url": "http://good-jewelry.com", "date": "Jan 04, 2011", "message": "Your view is very different.<a href=\"http://good-jewelry.com/\" rel=\"nofollow\"> jewelry </a> are very important in our life,<a href=\"http://good-jewelry.com/\" rel=\"nofollow\">wholesale jewelry</a> are the same ,the women like to buy it in Jewelry stores .We are know this year is almost ended ,the new year is coming. We expect the New Year comes !"}, {"author_name": "Gizli", "gravatar_hash": "d80f1b318d997b83be503f0bc5421f67", "author_url": "http://www.gizliseks.com", "date": "Jan 14, 2011", "message": "Recently I have read an article from your web page. That article has been so benefitial for me. I am regularly followig your site by adding it into google reader."}, {"author_name": "rachna009", "gravatar_hash": "d742e338162fea6f597e0167d823b050", "author_url": "http://www.mastersingermany.in", "date": "Jan 31, 2012", "message": "hi"}]}