{"response": [{"author_name": "Oorang", "gravatar_hash": "74c236638d43b713794e529cd59e9aa1", "author_url": null, "date": "Jun 01, 2009", "message": "I like the woot! badge, is that one new?"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 01, 2009", "message": "Very cool. In terms of \"more statistics\" - it would be nice to know how many answers those votes were distributed over. So suppose I'd answered 3 questions and received 3, 4 and 5 votes for them, it could show\n\n15 (3) Jon Skeet\n\nThere may well be a clearer way of formatting it though - perhaps even with a line:\n\n15 Jon Skeet\n--\n3\n\nIt might also be fun to show a graph of the question frequency for a tag over time - an interesting way of seeing trends, particularly if you could overlay graphs for multiple tags.\n\nJon"}, {"author_name": "ShuggyCoUk", "gravatar_hash": "33ac6a3ce34a41c661fdea54feab66b4", "author_url": null, "date": "Jun 01, 2009", "message": "\"This is the same algorithm used to award the tag-based badges, so if you ever wondered how close you are to getting one of those badges, now you know!\"\n\nWell not if you're wanting to fnd out you c# one since all those visible already have Silver and the top 5 have gold.\n\nPerhaps including the current user in as well would be nice..."}, {"author_name": "Mike Woodhouse", "gravatar_hash": "5978e2ed3a31f1bd2361dbb919d92012", "author_url": "http://grumpyop.wordpress.com", "date": "Jun 01, 2009", "message": "Shiny!"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": null, "date": "Jun 01, 2009", "message": "+1 for always showing the current user."}, {"author_name": "ShuggyCoUk", "gravatar_hash": "33ac6a3ce34a41c661fdea54feab66b4", "author_url": null, "date": "Jun 01, 2009", "message": "@Jon - for you surely it already does ;)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 01, 2009", "message": "@Shuggy: I have to admit I was tempted to answer with \"Doesn't it already show the current user and everyone else after that?\" but I thought it *might* be misconstrued ;)"}, {"author_name": "Richie Hindle", "gravatar_hash": "38750c50c11e6054c2123073b17b18fc", "author_url": "http://entrian.com/blog/", "date": "Jun 01, 2009", "message": "+1 for always showing the current user (or making the page size tweakable, as it appears to be but isn't - what's that pagesize parameter for?)"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "Jun 01, 2009", "message": "Something's a little goofy: check the sqlserver2008 tag.  I'm leading this month with 18, but I don't show at all on the all-time side, which ranges from 39 to 14.  With 18 just this month I should show up there somewhere."}, {"author_name": "Brent Ozar", "gravatar_hash": "77f776c2eaf0cc691e8a0880bb8a191f", "author_url": "http://www.brentozar.com", "date": "Jun 01, 2009", "message": "Wow, this kicks butt.  The next thing we need is the Twitter handle for each person listed.  This is a great way to meet people who share the same interests."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Jun 01, 2009", "message": "Very nice!\n\nIt makes me realize just how far out in front Jon Skeet is. For instance, take 'java': http://stackoverflow.com/questions/tagged/java . I'm #2 (yay me!) -- a mere 2200 votes back.\n\nBut on the other hand, maybe he's slowing down; Marc Gravell is leading the c# standings this month (http://stackoverflow.com/questions/tagged/c%23 ).\n\nAnyway, I must go now. I have to go and find out how many tags I appear on the leaderboard of. :D"}, {"author_name": "A", "gravatar_hash": "cc01aef23f823bcb6d064c7fbc2b6bee", "author_url": null, "date": "Jun 01, 2009", "message": "Minor visual inconsistency - comma separator is missing from user-specific stats.\n\n23,229 All Time\n9016 Jon Skeet"}, {"author_name": "A", "gravatar_hash": "cc01aef23f823bcb6d064c7fbc2b6bee", "author_url": null, "date": "Jun 01, 2009", "message": "@mmyers would be neat if the tag rank were displayed for each tag displayed on your user page..."}, {"author_name": "Daniel", "gravatar_hash": "ef62e78fd520a622778e3c2d151cc64f", "author_url": null, "date": "Jun 01, 2009", "message": "How was this UV (http://stackoverflow.uservoice.com/pages/1722-general/suggestions/202137-add-my-rank-to-my-user-page-) rejected as being too \"explicitly game-like\" when you're releasing rankings of top taggers and thinking about a monthly reputation leage?"}, {"author_name": "Aaron", "gravatar_hash": "634329486bd326c395c8b3539c035139", "author_url": "http://crimzon.ath.cx/~aaron", "date": "Jun 01, 2009", "message": "Viewing a tag stats page breaks the remembered sort order for questions and shows you the votes sort order rather than what ever you normally look at (new, active, whatever).\n\nI created a uservoice item: http://stackoverflow.uservoice.com/pages/1722-general/suggestions/204237-tag-stats-tab-breaks-remembered-tab-"}, {"author_name": "John Sheehan", "gravatar_hash": "54b75f6fbf4434162bfcda6b0cb9b86b", "author_url": "https://twitter.com/johnsheehan", "date": "Jun 01, 2009", "message": "This would be a good place to include who created the tag, information which I believe is still not available anywhere else despite there being a badge for it."}, {"author_name": "Andrei", "gravatar_hash": "9ccba0981764e5b074e93dca3fed3bfc", "author_url": null, "date": "Jun 01, 2009", "message": "For every Nth metric, you have N new metrics to obtain from the new metric and old metrics combination :)"}, {"author_name": "Johannes Rössel", "gravatar_hash": "5e3ffdc4d2259dacc68d7c997c386663", "author_url": "http://hypftier.de", "date": "Jun 01, 2009", "message": "Is it intentional that the stats page title says »Hottest  questions«? Shouldn't it be something like »Statistics for  questions«?"}, {"author_name": "micky", "gravatar_hash": "9c44d512c30bd79bd0658a7d4e2a0b44", "author_url": null, "date": "Jun 01, 2009", "message": "cool feature would be the same thing with questions :D i bet that there are some people that asked 500 java questions to game the system. this could be funny to see, please implement it."}, {"author_name": "Cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Jun 01, 2009", "message": "I personally think this is way cooler and of way more value than any reputation league (overall, monthly or otherwise) so kudos for that.\n\nI think a user-centric view would be of value so someone could see where they are across all their tags."}, {"author_name": "gnovice", "gravatar_hash": "f10d46954aba4a7207ea3ba66d4e6f86", "author_url": null, "date": "Jun 01, 2009", "message": "Awesome new feature! I was actually thinking about this for the past week or two, and I would have put it up on UserVoice if I had any votes left.\n\nIt's also nice to know I finally broke the halfway mark to a MATLAB badge. =)"}, {"author_name": "gnovice", "gravatar_hash": "f10d46954aba4a7207ea3ba66d4e6f86", "author_url": null, "date": "Jun 01, 2009", "message": "@Jon: I see you're only one days worth of votes away from getting the illustrious first gold \"subjective\" badge. ;)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 01, 2009", "message": "@gnovice: Yes, I noticed that. Don't worry, I won't go *looking* for subjective questions to answer :)\n\nJon"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 01, 2009", "message": "ok, updated version is deployed :\n\n- current user (if logged in) will always appear in the topn list *IF* you have at least 1 score\n\n- number of answers is also displayed\n\nI need to also display top \"askers\" within a tag, I forgot to do that.. so expect that tonight or tomorrow."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 02, 2009", "message": "Fabulous :)\n\nThe number of answers doesn't quite tally with the number displayed on the user page though - for instance, currently my user page suggests my count for C# is 1821, but the C# tag shows 1759. I could understand if the discrepancy were to do with questions rather than answers, but I haven't asked that many questions :)\n\nIs one of them a count of \"the number of questions the user has answered\" and the other is \"the number of answers the user has provided\"? i.e. the difference is due to questions with more than one answer by the same user?\n\nNot a big problem obviously - I'm more curious than anything else. Great to see such a quick turnaround!\n\nJon"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 02, 2009", "message": "only non-community wiki data (questions/answers) is shown on that page -- is that what you're referring to?"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 02, 2009", "message": "Ah yes, that's probably it."}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "Jun 02, 2009", "message": "Very nice! I like the recent 30 days stats as well as all time, it allows everybody a chance to be top of their class in *some* topic.\n\nOne little bug: After viewing the stats for a tag, clicking on the Questions button at the top returns to the question page, but no tab is highlighted. I presume that is because there is no corresponding \"Stats\" tab for the Questions page, and the tab prefers to be sticky."}, {"author_name": "litb", "gravatar_hash": "31a1c40a45079decc7f5525d2a873481", "author_url": null, "date": "Jun 02, 2009", "message": "Great stuff, i really like this. \n\nKeep up the good works :)"}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Jun 02, 2009", "message": "It's not clear why there are 2 columns with numbers, I'd add some caption to specify which is as asker and which as answerer"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 02, 2009", "message": "@Juan: It's not \"asker\" and \"answerer\" - it's \"votes\" and \"answers\". But yes, a caption might help :)"}, {"author_name": "gnovice", "gravatar_hash": "f10d46954aba4a7207ea3ba66d4e6f86", "author_url": null, "date": "Jun 02, 2009", "message": "I think the \"answers\" column refers to the number of non-wiki answers that have at least 1 upvote. I don't think it tallies answers that are still at 0 upvotes."}, {"author_name": "Jonik", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Jun 02, 2009", "message": "&gt; what do you think makes sense to show? \n\nOne addition, that's not too far-fetched, I think, would be to (explicitly) show badge statistics for that speficic tag.\n\nLike how many silver/gold badges of that type have been awarded in all (also provide link to the related badge page, e.g. http://stackoverflow.com/badges/67/iphone). And highlight it somehow (colours, background, icons, whatever) in the user list if a user has a bagde for that particular tag. (Perhaps also if he exceeds 400 or 1000 upvotes for a *set of tags*, like 5 people now do on questions/tagged/c%23+.net)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 02, 2009", "message": "@Jonik: Isn't it pretty easy to tell the users with gold/silver badges for that tag? Just look at the numbers - if they're 1000+, that means a gold badge; if they're 400+, that means silver."}, {"author_name": "Jonik", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Jun 02, 2009", "message": "@Jon: Yes, it's pretty easy, but sometimes being explicit may be better than being implicit... Also, I bet many people who use SO less than you (or I) do not know of these magic numbers 400 and 1000. ;) \n\n(Regarding showing total numbers: that would be especially useful when there are more users with badges than fit in the top users list.)"}, {"author_name": "Paolo Bergantino", "gravatar_hash": "80ae8ec34e9e3e66c5be50733afaa44e", "author_url": null, "date": "Jun 02, 2009", "message": "I can honestly say this is hands down my favorite feature to come out of StackOverflow since I started using it. Very, very awesome. Thanks for doing this!"}, {"author_name": "Zifre", "gravatar_hash": "6937bb37adb0a16d8f3096f5366134c6", "author_url": null, "date": "Jun 02, 2009", "message": "I love this new feature. I'm on the list for at least 5 tags. :) It would be nice if in my profile it would list the tags that I am on the list for."}, {"author_name": "Paolo Bergantino", "gravatar_hash": "80ae8ec34e9e3e66c5be50733afaa44e", "author_url": null, "date": "Jun 02, 2009", "message": "Thinking about it some, I think there should be a Gold Badge for being the all-time leader of a popular tag. This would obviously be taken away if someone ever passes you. You can define popular however you want, but I think it is way more noteworthy to be all time leader in a tag than to have posted a xkcd comic this one time in a question."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 02, 2009", "message": "@Paolo: While I see your point, I'm not sure it's a really good idea - you're already likely to have a gold badge for that topic anyway. It would be the first badge (that I'm aware of) that could be removed, too. (Does Populist get taken away if the accepted answer changes?)\n\nI'd also add that it would be slightly silly in my case. Currently I have 11 gold badges... and this would add an extra 38 (if all the tags in the first page of the list on my user profile counted as \"popular\"). Does *anyone* really want that to happen? It feels like double-counting to me, particularly as a lot of the time there'd be similar tags which gained votes from the same question.\n\nJon"}, {"author_name": "Paolo Bergantino", "gravatar_hash": "80ae8ec34e9e3e66c5be50733afaa44e", "author_url": null, "date": "Jun 03, 2009", "message": "@Jon: Well by popular tag I meant something a little more exclusive - something like the top 25 tags in the site maybe or tags with 2500+ questions or something. So it'd only be introducing a new 25 gold badges or so, growing with the site. While it is true that most of the time the user will already have a gold badge for that tag, being the all time leader is a distinction that becomes more important the more the site grows. I mean, as it is right now, c# already has 5 gold badges and a whopping 30 silver badges. Being the leader of the pack screams a badge.\n\nFull disclosure: I am a little biased as I currently have no Gold badges and would gain 3, maybe 4 from this. I do think the double counting is a valid concern, but as far as badges go I think this would be about as deserved as it gets, especially considering that Gold badges are almost never awarded for actual programming knowledge (http://stackoverflow.uservoice.com/pages/1722-general/suggestions/165033-gold-badges-are-virtually-never-awarded-for-real-questions).\n\nAll that being said, I don't see Jeff doing this, but it'd be nice. Aside from that, I do think there needs to be a lot of new badges - not gold but silver and bronze badges for simple things like first accepted answer to things like X total accepted answers, etc. As silly as they are badges are a driving factor for a lot of people and there's a lot of wasted \"events\" without a badge right now."}, {"author_name": "Cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Jun 03, 2009", "message": "I like this feature but the placement is rather awkward and not terribly intuitive. There should at least be another path to get to it. Perhaps a stats page that lists tags and then you can click on them (or type to select as per the normal tags page)?\n\nThe reason I say this is my sort order of questions is always Newest. To go to, say, the java stats page I have to go:\n\n- Click on a java tag;\n- Click on the 'stats' tab;\n\nBut then if I click on Questions my list is now sorted by Votes for some reason so I have to click on Newest again. It's kind of irritating.\n\nAs an alternative, maybe the tags page should have two settings/views: questions and stats, rather than the stats being a tab on questions, which is more odd now that I think about it: the rest of the tabs affect sort order of questions. Stats is unrelated. It just seems to have been put there for lack of anywhere else to put it.\n\nLike I said: I like the feature and the changes coming but the UI (imho) needs tweaking and it should be easier to get to with less/no side effects."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 03, 2009", "message": "Cletus, good feedback. I agree.\n\nI added answer counts to the tag stats just now, as well as tooltips for the numbers.\n\nWe also cache the queries so subsequent runs should be faster.\n\nI plan to add the \"who created this tag and when\" too but that'll have to wait until tomorrow."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Jun 03, 2009", "message": "It looks like we lost the current user in the update to include the top askers."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Jun 03, 2009", "message": "Scratch that last comment.  I don't know what I was looking at."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 03, 2009", "message": "@Bill\n\nNo, you were right. I think it has something to do with the caching. For example, when I visit the stats for the \"php\" tag, I see at the bottom of \"Top php answerers\" the user Magic Hat, where instead I should see my own username and stats (as I know that I've answered a few PHP questions)."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 03, 2009", "message": "oh, yeah. bug. I forgot there was user-specific info in there :P I'll fix it, and add the tag metadata."}]}