{"response": [{"author_name": "Comment Guy", "gravatar_hash": "298eb8ee0303c3c30892b6595c9a5bc7", "author_url": null, "date": "Jun 10, 2009", "message": "Yes, \"speed\" is important, but what about \"Get Things Done\", Joel?  Personally I'm a little wary of hiring people with *TOO* high of a Stack Overflow score because that suggests they don't do crap but sit on SO all day answering people's questions for a virtual cookie when they should be working on the job they are being paid to do.   \n\nDon't get me wrong, I'm not one of those people who are against having employees use the net on the job, even recreationally, but there's a big difference between that and the sort of OCD behavior that would result in having a really, really high SO rep score.\n\nIMO"}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": null, "date": "Jun 10, 2009", "message": "Hey Jeff &amp; Joel, how 'bout a DevDays stop in the South? Y'all do know the we have programmers south of the Mason-Dixon Line, a'ight?\n\nHotlanta would be a prime candidate. [That's Atlanta, GA, y'all]\n\nI'd be happy to speak there (or anywhere you care to cover flight and expenses to) for as long as you like, on any topic you like, such as:\n- In the Shadow of the Skeet: You Can't Catch a Photon\n- Struggling to Stay on User Page One\n- How to Grow Old and Burn Out Quickly While Making No Money\n- 15 Pieces of Flair for Your Blog/Web Site\n- Leaf-Blower Collaboration: How to be a Good Consultant\n- An Introduction to Object Normalization\n- XP41: Extreme Programming for One - or 1000\n- Object Mechanics: How OOPLs Work\n- Guitar Riffs in the Key of E"}, {"author_name": "Bremen", "gravatar_hash": "9a45de8df0c5c3f6e137c785e71557b8", "author_url": null, "date": "Jun 10, 2009", "message": "Woot for the extra DevDays, already signed up and booked a flight to LA, figure it isn't going to get any closer to Phoenix.."}, {"author_name": "Tony", "gravatar_hash": "58ef1d5589ae9e97b96ef294700bee5b", "author_url": "http://www.geekswithopinions.com", "date": "Jun 11, 2009", "message": "I like the idea for DevDays but seriously can the Midwest get some loving? :)"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Jun 11, 2009", "message": "Where is the cooking stack overflow site :P"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Jun 11, 2009", "message": "And wow the TWiST startup music does NOT fit the show itself."}, {"author_name": "Jacobbus", "gravatar_hash": "bbcc31dc7e60ac49724219808c358022", "author_url": null, "date": "Jun 11, 2009", "message": "Hey, that music from the startups show is Kanye West - Good Life\nhttp://www.youtube.com/watch?v=su_zrW9WBVk\n\nAnd that is considered to be good music by non programmers\n\nThis song also includes the \"snakes\" line, probably the best poetry written in this century ;)"}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Jun 11, 2009", "message": "@Comment Guy\n\nYou miss the obvious.  It's my wife that has a problem with SO, not my boss.  :-P"}, {"author_name": "Jeremy P.", "gravatar_hash": "c9e4524b82dd3926b7082a1116321576", "author_url": null, "date": "Jun 11, 2009", "message": "The kids who could answer the math question coming back from vacation are the kids who did math over the summer, the kids most interested in math."}, {"author_name": "Jason Punyon", "gravatar_hash": "44302dd1c18f747ba4fff5f689c475ba", "author_url": "http://jasonium.com", "date": "Jun 11, 2009", "message": "I don't think I've ever heard the word impress so much in one sentence."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Jun 11, 2009", "message": "I would much rather work with an experienced, self-taught programmer, than someone with just a CS degree. I admit that I haven't met that many other developers in my career, but I have yet to meet a CS graduate who can really code."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Jun 11, 2009", "message": "(Which isn't so say CS students can't code, just that I haven't worked with any who could.)"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jun 11, 2009", "message": "Who hires CS grads?\nDev team at my last company was a Maths PhD, Astro-physics PhD, Chemistry PhD and a sysadmin who didn't finish highschool but had been hacking linux for 10years.\n\nDon't know about the US, but in Europe the smartest students generally don't head for the CS dept."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Jun 11, 2009", "message": "\"Either be the first and quickest, or be the best and most comprehensive!\"\n\nActually, from my experience, the best way to get upvotes on an answer is to find the best way to tell the asker that there is a huge performance problem or security hole in the question, even if this in no way answers the question.\n\nFor example, in any question about an SQL query, you should be the first to tell the asker he has a huge SQL injection vulnerability.  That is guaranteed to get upvotes.  Please note that this is true *even* if fixing the vulnerability in no way answers the question, and *even* if the asker explicitly states in the question that he knows what SQL injection is and that, in this particular case, it is not a problem because (let's say) he has already verified that the parameter only includes [a-zA-Z0-9 ]."}, {"author_name": "Gordo", "gravatar_hash": "e57752814d00a385fb54313ddd10ff4f", "author_url": "http://gordo.foofus.net/", "date": "Jun 11, 2009", "message": "While late to the party, the almighty Gordo has crafted more tom-foolery for your enjoyment.\n\nSee HTTP://GORDO.FOOFUS.NET/ or\nHTTP://WWW.FOOFUS.NET/~omi/gordo.foofus.net-attacks.mp3\n\nLove your show. Keep on truckin'\n\nGordo"}, {"author_name": "matt b", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Jun 11, 2009", "message": "Has Paul Graham been a guest on the podcasts yet? If not, he definitely should be!"}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Jun 11, 2009", "message": "Palm Pre rocks. While you may not think the Mojo development kit is very \"powerful\", it's actually ridiculously easy to code on. so you can get an app going extremely fast.\n\nAlso, palm pre has limited appeal right now somewhat due to being on sprint, which is much smaller than AT&amp;T and Verizon, but both of them very much want the palm pre."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": "http://softhardsoft.com", "date": "Jun 11, 2009", "message": "No link to the cooking SO clone?"}, {"author_name": "Stu Thompson", "gravatar_hash": "428344688dc21d72a3723d94bed66680", "author_url": "http://www.dietpizza.ch/geekomatic", "date": "Jun 11, 2009", "message": "Can I swap out my London tickets for Amsterdam tickets?"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 11, 2009", "message": "Great to hear about the new cities - I'll be going to the one in Boston, so I hope to see many (some?) of you there. I've also set up a phpBB board so each city's attendees can get acquainted:\n\nhttp://sof.modos.org/forum/\n\nThere are also a few other forums as well, in case anyone wants to get their meta-discussion on."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jun 11, 2009", "message": "Joel jokingly mentioned SO for tax advisors. \nDoes the online knowledge base format work for other professions? Is it just dominated by computer questions because programmers are more at home on line, or are they naturally more sharing, or simply like showing off more?"}, {"author_name": "Matt J", "gravatar_hash": "2c638d6bdc75ffd5dbf06a1053779104", "author_url": "http://users.crhc.illinois.edu/johnso87", "date": "Jun 11, 2009", "message": "@kip: Agreed, but I would say that \"premature optimization is the root of all evil\" and its variants easily eclipse security and performance issues in terms of pandering effectiveness :)"}, {"author_name": "Thomas Petersen", "gravatar_hash": "75c45652c9d90261b2fc9267097b374d", "author_url": null, "date": "Jun 11, 2009", "message": "it's not true that google is not using proprietary software. For the picture feature you need to use google gears."}, {"author_name": "Zack Peterson", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack-peterson", "date": "Jun 11, 2009", "message": "At 10:49 am on June 8, 2009 during the WWDC Keynote, Apple claimed 40 million iPhones and iPod touches had been sold.    http://gizmodo.com/5285110/wwdc-09-liveblog-archive"}, {"author_name": "Nicholas Bieber", "gravatar_hash": "cb9e249283eea099f5cc5a3e48fe04f4", "author_url": "http://assemblism.com", "date": "Jun 11, 2009", "message": "jason needs less red cordial as well as fixing that music... I didn't laugh... but I did cringe..."}, {"author_name": "Alex Andronov", "gravatar_hash": "542f45519ec27c8147da98b9226f331c", "author_url": "http://www.gamboling.co.uk", "date": "Jun 12, 2009", "message": "Interesting to see that Android didn't even get mentioned AT ALL! When discussing the mobile platform."}, {"author_name": "Alex Andronov", "gravatar_hash": "542f45519ec27c8147da98b9226f331c", "author_url": "http://www.gamboling.co.uk", "date": "Jun 12, 2009", "message": "@Thomas Petersen\n\nWhen they mentioned the gears thing the guy said that they were pushing for that to be added to the HTML 5 spec."}, {"author_name": "Michael Dorfman", "gravatar_hash": "1f268f9af274810b5dd495f70a1806f4", "author_url": null, "date": "Jun 12, 2009", "message": "With regard to “Either be the first and quickest, or be the best and most comprehensive!”, has any thought been given to ways to reward the latter, and remove the incentive for the former?  If the goal is to build a searchable repository of programming knowledge, there's little benefit to the community with a reply that comes an hour earlier than another, but the current \"fastest gun in the west\" system rewards the first response that is even somewhat correct."}, {"author_name": "Zifre", "gravatar_hash": "6937bb37adb0a16d8f3096f5366134c6", "author_url": null, "date": "Jun 12, 2009", "message": "A good solution to the \"fastest answer gets most votes\" problem would be to make the answers appear in random order by default."}, {"author_name": "this.mat", "gravatar_hash": "11615d3f6cd75d23b0760cebdf5cd5b8", "author_url": "http://tomuse.org", "date": "Jun 12, 2009", "message": "Hurrah! Thanks for saving me the flight to one of the other DevDays! I've just purchased my ticket to the Austin conference.\n\nAlthough it's a shame I won't get to see Hanselman and Attwood speak, I'm really stoked to see Joel.\n\nAlso, thanks for the answer on the second question asked Joel, this is exactly the kind of direction I needed."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Jun 12, 2009", "message": "Hah, got the last student pass for Amsterdam! (Cambridge was already sold out)\n\n@Zifre: Yes, that solves the problem, but also removes the point of having the rep score in the first place. the entire *point* in rep'ing answers is that it is used to sort them so that you see the best answer first.\n\nThrowing the baby out with the bath water, essentially."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Jun 12, 2009", "message": "@jalf: Why not just randomize the order of answers with equal numbers of votes, then? Seems like it would be the best of both worlds.\nThe first answer would still have a slight advantage in that it might get an upvote before the others come in, but then if another answer were upvoted, the advantage would be lost."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Jun 12, 2009", "message": "I have the very same opinion as the first comment. A very high SO score means someone who is spending way too much time on SO. If I were an employer and noticed that this is done on my company's time, I won't be happy. \n\nI am impressed by the speed some questions get answered but then I ask myself how do they do that. Keep refreshing the page? Some special sniping program ala eBay?\n\nPS: I love SO :)"}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Jun 12, 2009", "message": "I have to agree with Jacobbus. I don't see anything particularly embarrassing about using a Top 10 hit song by a multiplatinum hip-hop artist as your theme music. \"Can't Tell Me Nothing\" feels a little more Jason Calacanis to me, though."}, {"author_name": "Clint Davis", "gravatar_hash": "e72176a4d0a5454b329bc703c6fa8004", "author_url": "http://clintdavis.us", "date": "Jun 12, 2009", "message": "I would like to see a DevDay in the South as well."}, {"author_name": "Paolo Bergantino", "gravatar_hash": "80ae8ec34e9e3e66c5be50733afaa44e", "author_url": null, "date": "Jun 12, 2009", "message": "If you have a Dev Day in Atlanta or somewhere in the South I'd definitely go. As Mr. Lowe kindly pointed out, there are programmers down south, y'all. :)\n\nBy the way, Steven, \"In the Shadow of the Skeet: You Can’t Catch a Photon\" made me spit out my drink. Classic."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 12, 2009", "message": "@Steven Lowe, @Clint Davis, @Paolo Bergantino:\n\nIsn't Austin in The South? According to Wikipedia, Texas (and Austin) are \"usually\" considered part of the modern south. Granted, the area from Texas to Maryland is pretty big, so I can understand wanting an event in a closer city."}, {"author_name": "Paolo Bergantino", "gravatar_hash": "80ae8ec34e9e3e66c5be50733afaa44e", "author_url": null, "date": "Jun 12, 2009", "message": "@nobody_: Eeeh, I GUESS you could call it the South... Living in Florida in a town with no major airports (Tallahassee) Atlanta is particularly attractive because it's just a 4-5 hour drive. Austin would be a 15 hour drive."}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Jun 13, 2009", "message": "Indeed, as a NC resident the nearest is DC... not a fun drive. Doable, but not fun. Now I need to see if I can get my boss to pick up the tab."}, {"author_name": "Mike", "gravatar_hash": "c98e188ba63a7875d61a77d7aaa3f5c7", "author_url": null, "date": "Jun 13, 2009", "message": "I'm in the same position as Stu, although I'd like to swap my new Cambridge tickets for London tickets. Is there any opportunity for people to do this?"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 13, 2009", "message": "@Stu Thompson, @Mike:\n\nQuoting from http://joelonsoftware.com/items/2009/06/09.html:\n\n&gt; If you already booked but want to change cities, email devdays@stackoverflow.com."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": null, "date": "Jun 14, 2009", "message": "OK, technically Austin, TX is in the South, but it's hardly in a central location, while Atlanta, GA is in the middle of the South.\n\nAustin, TX, is an inconvenient 15 hours from Chattanooga, TN (where I live) while Boston, MA is 17 hours. Atlanta, GA is a 2-hour drive.\n\nA plane ticket to Austin runs about $300 and the flight takes almost 8 hours. A plane ticket to Amsterdam runs about $900 and the flight takes about 12 hours.\n\nIf I have to buy a plane ticket to go to DevDays, then I'd choose Amsterdam. Unfortunately, my wife has already declared there will be no trip to Amsterdam without her!\n\nNow, if it was a \"speaking engagement\" instead of just \"attending a conference\" then she couldn't object... ;-)"}, {"author_name": "Shog9", "gravatar_hash": "28530499e58e634ac9f004d389463e23", "author_url": "http://shog9.com/", "date": "Jun 14, 2009", "message": "Yeah... I'm curious about this \"cooking Stack Overflow\" site as well..."}, {"author_name": "Daniel", "gravatar_hash": "1c5255f8496fcade0244f12cb6ca6405", "author_url": null, "date": "Jun 14, 2009", "message": "I to would like to know why Jeff and Joel did not consider Android worth mentioning."}, {"author_name": "Adam", "gravatar_hash": "f982962696511d9e4d5be67193ade5da", "author_url": null, "date": "Jun 14, 2009", "message": "Come on people, I found the cooking StackerOverFault clone with fifteen seconds of Googling. It's called 'Our Naked Food' (no link for obvious reasons) and while they've certainly copied the mechanics of the site wholesale, it's worth noting that they acknowledge this at least twice (once on their 'About Us' page and once in the show notes for their first podcast)."}, {"author_name": "hhrvohe", "gravatar_hash": "8ff9c51aba1259ba4548e6718ffe3629", "author_url": "https://twitter.com/hhrvoje", "date": "Jun 17, 2009", "message": "Until this show, i was strong beliver in Silverlight for production of future web apps (biz apps), and planned to invest time on learning it well (i'm working with it for some time now). \nI thought that it is just the technology we need, of course for specific purpose, because there's a lot limitation of using HTML/JS/CSS for building smart UI (like gmail, hotmail, gdocs, sharepoint,...). And it's better than Flex/Flash or JavaFX stack IMHO (beside penetration level)\n\nBut now with joels pessimistic prediction about its future, i don't know anymore. I remembered ActiveX also...\n\nJeff, a blog post about this subject, maybe?"}, {"author_name": "Michael Easter", "gravatar_hash": "06c73e2393a863ea468d970038031c29", "author_url": "http://codetojoy.blogspot.com", "date": "Jun 18, 2009", "message": "I'm a fan of the site and podcast, but for some reason #57 had me yelling at the car stereo.\n\nFirst, I can't believe that Android wasn't mentioned in the mobile battles. One might believe that iPhone will destroy Android but those two _are certainly_ the headliner/marquee match-up, not Microsoft!\n\nSecond, Jeff talked about 'not getting' Google Wave. That is fine, but Joel had a long piece in a previous podcast where he said that the disruptive sites that don't make sense at first (e.g. eBay, Twitter, AND Stack Overflow (!)) are the ones whose ideas are weird: i.e. they strike people as strange. I don't want Jeff to agree with Joel; nor do I need podcasts to be entirely consistent in philosophy, but for some reason the fact that this cognitive gap wasn't even mentioned was a major irritant.\n\nI'll keep listening, but you are on notice! ;-) \n\nMichael Easter"}, {"author_name": "Michael Easter", "gravatar_hash": "06c73e2393a863ea468d970038031c29", "author_url": "http://codetojoy.blogspot.com", "date": "Jun 18, 2009", "message": "ps. Regarding #2, I just realized maybe I mis-interpreted Jeff's comments. He does mention a Dave Winer blogpost, which perhaps was indeed the original post about disruptive ideas. Maybe he even meant it in the sense that he didn't get Google Wave -- i.e. that phenomenon might be a good thing.\n\nMy apologies if this is true, as it would be a nice tie-in to the other podcast."}, {"author_name": "Jon Galloway", "gravatar_hash": "63c32b4489d13b17d23fd9db1505bdf9", "author_url": "http://weblogs.asp.net/jgalloway", "date": "Jun 18, 2009", "message": "Joel needs to do some studying on mobile development to back the certainty with which he speaks. Example: Saying that Microsoft should build their mobile platform on Flash. This would make little sense since Flash (still!) doesn't run on iPhone. \n\nHaving actually developed in Flash, Silverlight, and Windows Mobile, I think Silverlight would make for a great mobile platform. Silverlight is a much better platform than Flash (e.g. multithreading, which is important on mobile). The only strike against Silverlight on the web is adoption, which is a non-issue on mobile.\n\nPlease insert more weasel words when you speak about technologies you haven't actually used."}, {"author_name": "Scott Barnes", "gravatar_hash": "b83b28c4634aa8fbc1d269fa8fcd0188", "author_url": "http://blogs.msdn.com/msmossyblog", "date": "Jun 18, 2009", "message": "Don't forget Silverlight on the mobile is also the same API's as you get in the desktop. Flash at the moment is a subset of Flash 10, so you're essentially forking your development experience.\n\nAs for building our our Mobile story on Flash, see the reasons why we built Silverlight and start there and work your way back to this conversation :)\n\nWeb adoption is a challenging hurdle but one we've grown fast on. Did you know that if you combine Apple iPhones shipped since the start of its existence + twitter subscribers, Facebook and MySpace combined..you'd still not equal the number of installs Silverlight has made in the last 2 years.\n\n-\nScott Barnes\nRich Platforms Product Manager\nMicrosoft."}, {"author_name": "Adam", "gravatar_hash": "a9aaf351adda1e39bbe64b7ba38b55f0", "author_url": null, "date": "Jun 22, 2009", "message": "Having listened to podcast #58, I now hear I was wrong about 'Our Naked Food'..."}, {"author_name": "Jimmy Chandra", "gravatar_hash": "2b43bb94f52fda53de5a15a9be9c32f5", "author_url": "http://geeks.netindonesia.net/blogs/jimmy", "date": "Jun 29, 2009", "message": "Hi guys, just want to update your on the Windows Mobile front.  Joel mentioned about MS Windows Mobile development and standard, etc.  Well, MS is doing something on that front, probably similar to what Palm Tre is doing (haven't check them out yet), but it's HTML, CSS, JavaScript, Flash, etc. based light application framework that can run on the client side (no need for internet connection, but it can also take advantage of it if it is available).  The framework will also can access the mobile phone capability such as softbuttons, gps, camera, location, local storage, etc.  Check out this blog post: http://blogs.msdn.com/windowsmobile/archive/2009/03/18/windows-mobile-6-5-what-s-in-for-developers.aspx"}, {"author_name": "Kevin", "gravatar_hash": "63156ace4946509f7686251385d64a20", "author_url": null, "date": "Aug 13, 2009", "message": "If you want to see how cool HTML 5 is, goto the chrome experiment site. http://www.chromeexperiments.com/\nAll of the examples are built using HTML 5 and Javascript."}]}