{"response": [{"author_name": "Tim", "gravatar_hash": "93ad15f9e3fdd8365cdcc48badda8cdc", "author_url": null, "date": "Jun 03, 2009", "message": "Great Podcast\n\nBut...\n\nWhy is it that when you have a guest on Jeff says hardly anything for extended periods of time? \n\nI mean, I like listening to Joel chat to interesting people, but if Joel is just going to take over and not incorporate Jeff into the discussion much he might as well get his own podcast where he just chats with different guests each episode. \n\nMaybe you should have slightly less often Stack Overflow based podcasts (ie user questions, interesting stack overflow questions and news) with Jeff and Joel, mixed with special Joel and some guest podcasts, where Joel can bring back some of his blogging style insight and interest and enable Joel to branch out from trying to relate the discussion back to stack overflow. \n\nJust a few thoughts, hope you get guests on more often as it makes the podcast much more interesting.\n\nCheers\n\nTim."}, {"author_name": "William Brendel", "gravatar_hash": "18b6b068f92ee1b5408be98e7ecd4a9b", "author_url": null, "date": "Jun 03, 2009", "message": "@Tim: These are the two reasoned I came up with.\n\n1. Joel and Jason were in the same room. It's easier to talk to someone and read the body language of someone who is in the same room as you. Ever tried to attend a meeting where one group of people is in a conference room around a speakerphone and you're dialing in remotely? It's a totally different experience than when you're all in one room together, and you do end up feeling a little left out, making you less likely to chime in.\n\n2. Joel is more business-y than Jeff, and Jason is a businessman. That said, I think Jeff made some excellent business-related remarks.\n\nI wouldn't say this is a trend either (or at least not an obvious one). Jeff is quiet for long periods from time to time, but I don't think it correlates to having/not having guests.\n\nThis was my favorite episode yet, and I went into it expecting something totally different. The couple times Joel had knocked Mahalo Answers made me think there would be blood. In reality, it was just a really interesting conversation between people who love to make great websites."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Jun 03, 2009", "message": "@William: There's a third reason i've come up with: Joel is used to saying whatever's on his mind, no matter how much of it is utter BS. Jeff tries to think about his BS a bit before releasing it upon The World... ;-)\n\nSeriously though, I think a good many of us would be in Jeff's position - trying to get a word in edge-wise - simply because that's the role we're used to playing when sitting in meetings..."}, {"author_name": "Chris", "gravatar_hash": "f89b5f030e5a8a254249d477f88b24f4", "author_url": null, "date": "Jun 04, 2009", "message": "No Jeff says more BS!  Joel pride!  Woo!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 04, 2009", "message": ":("}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Jun 04, 2009", "message": "Suck it up. You'll get'em next time.\n\n*butt slap*"}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://www.ComicsInventory.com", "date": "Jun 04, 2009", "message": "Yes Jeff, we have picked up on your BS. ;-)"}, {"author_name": "Michael", "gravatar_hash": "34cf3ce19722d34802b17a4dfa2057d5", "author_url": "http://www.bacman.net", "date": "Jun 04, 2009", "message": "Regarding the discussion about what web sites had badges before StackOverflow - Bolt.com had badges back in 1999, perhaps earlier.  Some badges on Bolt were given out by moderators (e.g. featured member).  Other badges were given out automatically (e.g. anniversary badges).  Bolt's badge system was similar IMO to Stackoverflow and like your Woot badge, Bolt did have sponsored badges.  Regardless, while you are not the first website to use badges, your implementation is quite good.  In fact, I just recently added a similar badge system to my website (www.testdesigner.com) to encourage positive behavior."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Jun 04, 2009", "message": "Very good guest on this podcast.\n\nWhen you have such an interesting guest, you probably cant help to just sit and listen. Which is what Jeff probably did."}, {"author_name": "LKM", "gravatar_hash": "7bd3e3921826863ff689ff4d08d35fea", "author_url": "http://ignorethecode.net", "date": "Jun 04, 2009", "message": "I was afraid this would end up being really bad, but it was indeed one of the best episodes. Jason Calacanis is normally kind of weird, but Joel balanced him out nicely, which made for an interesting conversation.\n\nJust one point about Jason Calacanis' insinuation that Germans steal copyrighted stuff: Germany is not China. Germany has a \"normal\" copyright law similar to that of the US. So German \"site copies\" are usually re-implementations of a similar or the same idea. I believe there are a lot of \"site copies\" in Germany because Germans learn English somewhat late in School. For example, when Facebook was English-only, it made sense to create a \"German Facebook\" because a lot of people were not able to use the original version!\n\nAlso, I wish Jeff had pushed Jason harder on the whole sharecropping thing. I think Jeff's original point was that it was unfair to let users do the work and then \"steal\" their data. This point got lost when Jason started talking about money (as he is wont to do)."}, {"author_name": "Niall", "gravatar_hash": "35dee64cae8f37ded5923296625a16b9", "author_url": null, "date": "Jun 04, 2009", "message": "Jason Calacanis is funny as hell. I thought that was one of the most entertaining interviews you guys have done.  The man has sees dollar signs on everything."}, {"author_name": "Graeme Perrw", "gravatar_hash": "2fcdc79d20203f12b3bdd7723de5a6f1", "author_url": "http://cutthechatter.com", "date": "Jun 04, 2009", "message": "I'd heard Calicanis on TWiT a number of times, and came to the conclusion that he was an annoying and opinionated (though usually entertaining) windbag who assumes that everyone else is as money-obsessed as he is. But I really enjoyed this podcast - turns out Calicanis isn't always that irritating. Jeff's probably used to sitting quietly during the podcast since Joel likes to talk, so having a guest like Jason who also likes to talk leaves little time for him."}, {"author_name": "Nathan", "gravatar_hash": "ec2b04ac1bad14fea8244a78ef0f2133", "author_url": null, "date": "Jun 04, 2009", "message": "I, as I guess everyone else here, loved the podcast.\n\nI'm just jealous that I, unlike Jason Calacanis, do not have a guy walking beside me with a briefcase full of money. :-(\n\nI like the strategy that you guys have with this, please don't sell out."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Jun 04, 2009", "message": "I remember the forums at AlbinoBlackSheep.com had the Sheepie awards every year where people could be nominated and voted for a whole host of categories and got to display a badge on their profile for the rest of the year. \n\nSomehow I managed to win 2003's Biggest Snob award."}, {"author_name": "Esteban Araya", "gravatar_hash": "1a94125025af7fa5ab127175c2e6733d", "author_url": "http://adotnetdude.blogspot.com", "date": "Jun 04, 2009", "message": "Other than the first Yegge podcast, this one is the best podcast to date - I really enjoyed it.\n\nI specially enjoyed when Jason says: \"You guys could make a lot of money with this\"... classic! I'm glad the podcast finally focused on the business side of things.\n\nI'm gonna side with Jason and say that I wouldn't be offended if J&amp;J started making big bucks from the site."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jun 04, 2009", "message": "Germany has a lot of site copies for the same reasons it has a lot of German language programming books and software.\nThe developer community is large, probably 2nd in the EU after the UK, and want things in their own language. Smaller countries get used to writing everything in English, they know nobody is going to bother learning Norwegian for them.\nFrance is odd, there is a lot more government demand that everything is in French - but the techs in general prefer English, this might be due to some very poor French versions in the past."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jun 04, 2009", "message": "I wouldn't compare software to brain surgery, I would say it's much harder - like drug design.\nThe effort/cost/manpower etc to build a large system is like that to develop a new drug.\n\nBuilding something like the A380's avionics or the software that runs AT+T's phone network is rather more involved than chopping out an appendix."}, {"author_name": "finnw", "gravatar_hash": "1d329f562180503bd1e91997f57fcaff", "author_url": null, "date": "Jun 04, 2009", "message": "Another example of badges:\n\nwww.chessworld.net has a set of icons that appear next to your username on game screens and search results.  They are earned by winning tournaments, solving puzzles, introducing new members and being a subscriber (probably more but that's all I can remember right now)"}, {"author_name": "Esteban Araya", "gravatar_hash": "1a94125025af7fa5ab127175c2e6733d", "author_url": "http://adotnetdude.blogspot.com", "date": "Jun 05, 2009", "message": "So, I was thinking a little more about Jason's valuation of stackoverflow... Do you guys think Joel may be selling his part?"}, {"author_name": "Dean Nolan", "gravatar_hash": "268787c7ffe5c47829ff7d6866afe22b", "author_url": "http://www.deannolan.co.uk", "date": "Jun 05, 2009", "message": "This was a really good one. I've listened to the start and Jason and Steve Yegge are the best guests so far.\n\nYou should try and get both them in the same podcast for a future episode.\n\nJust off the top of my head for guests in the future.\n\nScott Hanselman and Scott Gu. :)"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jun 05, 2009", "message": "This was somewhat interesting. I will say though, other than hearing about Mahalo on the podcast and a few things here and there I never see that site come up in any of my Google searches for anything, whether it's programming, news related, or anything, and like I use google what seems like a hundred times a day. Of course, this is just my experience.\n\nAs far as the user question regarding \"Dreaming in Code\" and whether \"software development is really hard or not.\" I think that is sort of a silly question. I say \"silly\" because it seems disingneious. The idea that \"writing software is not really hard. I've been doing it since I was 4 years old\" or whatever is just ridiculous. When people like Brooks, and well, pretty much every other sane person in the world, talk about software being hard, we are talking about complex software systems. How many Linux kernel developers do you know that keep the whole kernel in their heads? Hint: not even Linus does. I just found that question self-serving or perhaps to be more charitable, naive.\n\nAs for the \"digital sharecropping\" stuff. I think we should get rid of that term. That's just ridiculous. I have to agree with Jason on this one. I think he was being kind by not laughing at that or perhaps was a little surprised to hear that. It's really handwavy and what is being described as \"digital sharecropping\" bears really no resemblence to sharecropping at all."}, {"author_name": "Adam in Korea", "gravatar_hash": "a9aaf351adda1e39bbe64b7ba38b55f0", "author_url": null, "date": "Jun 05, 2009", "message": "Agreed that this was a great episode. \n\nOne clarification about the web in Korea (which is absolutely fascinating in a Through the Look Glass sort of way). Naver and Daum don't just use nofollow to discourage Google, they use all sorts of other tricks too as they have no interest in being deep-linked. The Korean web business model is about walled-garden portals rather than an open linked web.\n\nAnd it's worth remembering that this isn't some unimportant backwater we're talking about here. Korea is a world leader in broadband penetration, both wired and wireless. Its websites are also profitable in a way that the west can only dream of. Cyworld, the major social networking site, makes loads of money from selling enhancements to users' profile pages. Also, Cyworld was, last time I looked, second behind the iTunes store in global ranking of online music sales."}, {"author_name": "abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Jun 07, 2009", "message": "I hope hyphenated domain names stop being the blacksheep of domain names. I am not sure how this all started. All the good names are taken and people are resorting to nonsense made-up names which I know unless I bookmark them, they will be long forgotten.\n\nI am OK with one or 2 hyphens in the name and I think the world should welcome them. No one says anything about long hyphenated urls which is actually a good SEO practice and SO uses them."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jun 07, 2009", "message": "Back in the days of old, when the web was dial-up and some of us had waistlines you had to explain to people what the @ symbol was.\nSince spaces weren't allowed in urls (neither were addresses beginning with a number) people had to work out how to spell them, a hyphen was natural. \nWithout it you get misunderstandings like the original name of 'the hyphen site' as well as powergenitalia, and molestationnursey"}, {"author_name": "Eric", "gravatar_hash": "ad00086684fbe3e0dca19a866408b84d", "author_url": "http://ericdotnet.wordpress.com", "date": "Jun 09, 2009", "message": "Very enjoyable episode, would be fun to broaden the scope of the podcast a bit with similar guests :)."}, {"author_name": "Jason Punyon", "gravatar_hash": "44302dd1c18f747ba4fff5f689c475ba", "author_url": "http://jasonium.com", "date": "Jun 10, 2009", "message": "Hey guys,\n\nGreat episode.  Great guest.  Looking forward to the next one.\n\n-J"}, {"author_name": "Jayson Smyth", "gravatar_hash": "294e6efed7ccbe11b26c856dce671f7e", "author_url": null, "date": "Jun 10, 2009", "message": "This episode sucked just like all the other ones.  Keep trying."}, {"author_name": "nuigurumi", "gravatar_hash": "76d109c7c8667ebfb1055e749aa1969f", "author_url": null, "date": "Jun 11, 2009", "message": "What was that thing he said about advertisements on the site, when you said \"we want control over the banners, we want no animation, no javascript jumping on you stuff etc.\" and he said, like, \"guys, why do you think you don't deserve to make money?\" Do those... things really bring you money? Instead of scaring away the audience?"}, {"author_name": "Tim", "gravatar_hash": "655be2100f2922f30dff0a73d53917c8", "author_url": "http://blog.stackoverthrow.com/", "date": "Jun 12, 2009", "message": "Nice - the guy admits to stealing software and pirating it and taking money for his piracy, but then he makes fun of Germans and Chinese?  Schmuck.  I never heard of this guy before but he sounds like a real tool.  Money or not, he's not someone I would associate with based on what I have heard from him so far."}, {"author_name": "Michael Kniskern", "gravatar_hash": "8bc8c43c5ccc7e045c7158cb303ff107", "author_url": null, "date": "Jun 15, 2009", "message": "I really enjoyed Jason Calacanis as a guest on the podcast.  I first heard him on the Adam Carolla podcast.  Adam was asking him questions about how to money with the podcast when his contract with CBS expired at the end of the year."}, {"author_name": "Pete Kirkham", "gravatar_hash": "2180b1a962bf46e58fa9746cb4ebfb91", "author_url": "http://tincancamera.com", "date": "Jun 19, 2009", "message": "Edison didn't invent /the/ light bulb, he invented /a/ light bulb. He lost the patent dispute for the carbon filament in vacuum bulb to Swan, and the design Edison did come up with didn't see widespread use. He owned an electric company which was responsible for distributing the technology widely. 99% perspiration, 1% buying up your competitors ideas."}, {"author_name": "Craig Tataryn", "gravatar_hash": "ceb09c840b0bb7c0a70d722d1c712e89", "author_url": "http://www.basementcoders.com", "date": "Jul 02, 2009", "message": "Hahaha, you realize why Experts Exchange has a hyphen in the domain name right?  Maybe if I add another hyphen you'll realize... www.expert-sex-change.com...\n\n:)"}]}