{"response": [{"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 17, 2009", "message": "Just my 2¢, but I don't think you want people to confuse Stack Overflow with Experts-Exchange, which is likely to happen with the name \"Stack Exchange\". My suggestion is to evoke the feeling of Stack Overflow, only smaller and more focused - how about \"Stack Frame\"?"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Jun 17, 2009", "message": "Yay. Managed to close the _only_ LOGO question on the site."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "61d2a0f034915fa9d2acd6f6b145bba8", "author_url": null, "date": "Jun 17, 2009", "message": "I'm with nobody_: Stack Exchange is just not good.  Style it like FogBugz, let users submit questions via e-mail, and call it something like FogBase or FogBrainz or FogAnswerz.\n\nHmm... FogBrainz isn't too bad."}, {"author_name": "Tim", "gravatar_hash": "d9775dd361e64f409076d756a32b981a", "author_url": null, "date": "Jun 17, 2009", "message": "FogAnswers\nFogAnswerz"}, {"author_name": "Mr. Podcast", "gravatar_hash": "5da7b7bcf18271e6fe1f3933c922f215", "author_url": null, "date": "Jun 17, 2009", "message": "I like StackFrame.  What about \"ThinkingCap\"?  But the more hyphens the better!"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 17, 2009", "message": "I've done some digging, and it looks like stackframe.com is owned by a company named StackFrame, LLC and probably won't be persuaded to sell it. However, stackframes.com simply redirects to tier-rack.com and expires on the 26th (8 days away), so it may be possible to pick it up when it lapses for free, or pay the company some nominal sum if they do renew it before the deadline. Besides, I've become partial to the plural form anyways. It really sounds like a host-y term, much in the same vein as SliceHost and how their products are called slices, the individual product of stackframes.com would be a frame. To me, it's quite catchy."}, {"author_name": "Scott Williams", "gravatar_hash": "3429df2e085587406780ca9e776f93b7", "author_url": "http://krazyyak.com", "date": "Jun 17, 2009", "message": "\"Stack Exchange\" is a bad name. You're following one hard 'ck' sound up with another 'ecks'. It'll trip people up when they speak it, and yeah, it also sounds like an intentional mixup of Experts Exchange.\n\nHow about something simple like Stack Overflow Anywhere?"}, {"author_name": "Nalandial", "gravatar_hash": "a5fabaf7306eddbf36045d727883a0c2", "author_url": null, "date": "Jun 17, 2009", "message": "Disclaimer:  I'm not a .NET person at all.\n\nWith regards to what Jeff was talking about with the HTML encoding issue, where if you forget to encode it in just one place you're totally owned:\n\nIsn't this something AOP (in .NET I think the framework for it is PostSharp) could solve?\n\nFor example, whenever you call getText on a post object (or however your stuff is set up), just automatically intercept the methhod call.  If you're calling it from a page then auto-encode it and return the encoded value?  That way you don't have to worry or care about the encoding.\n\nJust my 2 cents."}, {"author_name": "Rob Gomes", "gravatar_hash": "128fc4d868e3639a43b7973a6ef44778", "author_url": "http://www.lazysonofabitch.net", "date": "Jun 17, 2009", "message": "I definitely agree with putting your Visual Studio and your development environment in a VM.  Honestly I've been doing this since about 2003.\n\nSince really, lord knows when you're going to bork your day-to-day work environment when you install a new RTM, or a service pack, or a Beta.  Just snapshot your VM beforehand, and if farks up your dev environment, just rollback.  Get a new computer?  Easy as moving a file.\n\nSeriously, a day without VMWare is like a day without sunshine."}, {"author_name": "jerryjvl", "gravatar_hash": "320dc2b3b003612d9879e1563e7a41ca", "author_url": null, "date": "Jun 17, 2009", "message": "Also not a fan of the proposed name... although if anything, shouldn't it be \"Stacks Exchange\"? ;)"}, {"author_name": "Matt Hamilton", "gravatar_hash": "2bd5f782c135ff7ed12a95bf209eb973", "author_url": "http://www.madprops.org", "date": "Jun 18, 2009", "message": "How about \"popstack.com\"? The domain is currently parked. It has a reference to \"stack\", but it's about popping off the stack rather than pushing (too much) onto it.\n\nI think \"mydomain.popstack.com\" for hosting would work pretty well."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 18, 2009", "message": "About Joel's \"any question is valid\" discussion... I think I'm more with Jeff on this. In particular, I don't think we really need a copy of all the documentation for every method on the site. If someone asks a question which is explicitly answered in a well-written way in the docs (e.g. MSDN or JavaDocs) then I'm happy to point people to those docs, but I don't really think the question is adding anything to the site. If a web search finds that documentation, what are we really adding to the world by *also* having a link to those docs?\n\nOf course if the docs aren't clear enough, or don't explain a particular situation, or the questioner is interested in *why* it works in a particular way, that's a different matter."}, {"author_name": "macbirdie", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Jun 18, 2009", "message": "\"Overflow Engine\"\n\nNice mix at the end of the podcast. ;)"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jun 18, 2009", "message": "Of course storing just the HTML versions of data is a bad idea. Why would anyone think otherwise?\n\nAs far as the Html.Encode thing, you guys are over thinking this. Any static code analyzer or something like ReSharper could just inspect the code for missing Html.Encode calls and prompt you to correct the issues. It could assume all strings output should be enclosed in a Html.Encode call. Problem solved. Next issue. \n\n\n@Jon Skeet, your example really just reinforces Joel's point. When you are \"happy to point people to those docs\" the way in which you implement that \"pointing\" is through an Answer on SO. Therefore, an answer exists for that question on SO, it simply cites another source, which is perfectly acceptable. The other thing is for Joel it's about SO being where the search engine resuls point the user first. I think it also helps because even if there is a doc on MSDN that you, Jon Skeet, will point the user, at least your answer can be voted on and in the future the answer can be modified if something changes.\n\nIt's also nice having the answer on SO so you don't have to deal with MSDN (or whatever) saying \"This page has been moved, you will be sent into a vortex of circular redirection while we try to fruitlessly locate that document.\"\n\nCAPTHCA: you've dueled"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jun 18, 2009", "message": "Eh, one more thing. I like:\n\nKnowledgeOverflow\n\nJust me."}, {"author_name": "Jared", "gravatar_hash": "71911c9cfb9a0335619cdee26ff840b4", "author_url": null, "date": "Jun 18, 2009", "message": "I want to point out to everyone that, as a new programmer, sometimes things really ARE hard, and we really DO get stuck in the stupidest places.\n\nMy biggest problem is looking at the problem in the wrong way. Because I have limited knowledge, I'll do something crazy - not necessarily wrong - but something crazy enough that my brother, who has years more experience, will look at my code and ask me what in the world I was trying to accomplish. He just laughs and links me to the MSDN documentation for the built-in function in .Net that does it for me. I didn't use it because I didn't know about it.\n\nTake, for example, my latest question about a SQLite database (http://stackoverflow.com/questions/989821/) - not only did I learn that the possibility of my question occurring was rare (maybe Twitter will be the first to answer), but I was also shown a better was to do ID columns in databases.\n\nStackOverflow is a great resource for people with a completely obscure question that only 3 other people in the world could answer, and it's also a great resource just to read and learn. I browse the C# tag almost daily just to see other people's code and learn a few things."}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://pro.robspages.net", "date": "Jun 18, 2009", "message": "Naming is hard. The SO Engine project should have little to do with the original StackOverflow implimentation and be more in line with FogBugz, Copilot and Citydesk... \n\nSomething like Guru, KiwiQuestions or the previously mentioned FogEngine."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Jun 18, 2009", "message": "Underflow?"}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Jun 18, 2009", "message": "As for security, I once told my boss, that if our security and QA strategy is me not making any mistakes ever, we're screwed.\n\nSecurity integrated into system is the way to go. For example, even for very simple applications (like an API for a Flash game's highscores) I use a database class that provides simple interfaces for INSERT and UPDATE, that escape data before putting it into the SQL.\n\nI'm not sure if I want the security to be _too_ integrated into the system, since it can very quickly become a nuisance if not done _exactly_ right, but sure, automatic security sounds like a very nice idea."}, {"author_name": "Nathan", "gravatar_hash": "ec2b04ac1bad14fea8244a78ef0f2133", "author_url": null, "date": "Jun 18, 2009", "message": "@Jeff &amp; Joel, knowing the crowd here at StackOverflow, I think that the most voted up answer for the 1 + 1 question would be 10. It would be both correct &amp; computer related"}, {"author_name": "Andrew", "gravatar_hash": "cc01aef23f823bcb6d064c7fbc2b6bee", "author_url": null, "date": "Jun 18, 2009", "message": "A few suggestions...\n\nCreek Overflow\nStack Frame\nStack Pointer\nFogAnswerz\nFogAskz\nFogFlow"}, {"author_name": "McDowell", "gravatar_hash": "9061706d2661cf0fa9f2df0eee56cf9b", "author_url": "http://illegalargumentexception.blogspot.com/", "date": "Jun 18, 2009", "message": "On the naming - you could leverage the \"flow\" in the name to imply the flow of knowledge. E.g. stackloreflow.com or stackinfoflow.com"}, {"author_name": "Josh", "gravatar_hash": "3020b35c4f9ec8eec59d060626ebf5d2", "author_url": "http://www.methuseus.net", "date": "Jun 18, 2009", "message": "I have an issue with linking to an answer on another site. If all we do is answer questions with links, when that linked site goes down a year or two later, then the answer is gone, though it still looks like it was answered.\n\nThe difference in this is saying it's in the documentation. If an answer is in the application (or whatever's) documentation, that should be mentioned, but then the answer still added. I have links to MS or Adobe websites that last maybe a year because they change their web site structure.\n\nI think I went on too long, hope I didn't bore anyone."}, {"author_name": "Andrew", "gravatar_hash": "df95f54d4094bcf1bafed74b72e433ff", "author_url": null, "date": "Jun 18, 2009", "message": "How about 'Stack Pointerz'?"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 18, 2009", "message": "@Josh: On the other hand, if we just copy the documentation, then readers don't get the benefit when that documentation is updated etc.\n\nThe MSDN URLs for .NET non-generic stuff seem to be pretty stable.\n\n@BobbyShaftoe: If an answer is just going to point to the documentation, I'd rather the documentation itself ended up as the top search result. I believe in many cases like this, the questioner hasn't even done a basic search.\n\nIn terms of naming... how about AskTheCrowd? Or CrowdBrain? Or CrowdKnowledge?\n\nJon"}, {"author_name": "Alex Andronov", "gravatar_hash": "542f45519ec27c8147da98b9226f331c", "author_url": "http://www.gamboling.co.uk", "date": "Jun 18, 2009", "message": "For the name how about hostoverflow?"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Jun 18, 2009", "message": "Knowledge Overflow\nSO Knowledge Engine\nFog Knowledge Engine"}, {"author_name": "Dillie-O", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://dillieodigital.net", "date": "Jun 18, 2009", "message": "When I've been answering questions where a nice MSDN document is provided, I try at least to give some \"human readable prologue\" to the link I'm going to send them to. A lot of times the MSDN links are good, but rather dry, and giving them a brief explanation or summary I believe gives them a bit more of a assistance in the answer than just potentially googling, copying the first link without even reading it, and then posting \"See This\". \n\nIn addition, if the link in question does junk out down the road, at least a basic summary of the link is available to see and another user could edit the link with another appropriate option.\n\nKeep up the great work guys!"}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://www.johntopley.com/", "date": "Jun 18, 2009", "message": "Interesting discussion around HTML encoding. The forthcoming Rails 3  will have safe encoding by default, which is the opposite of what the current version of Rails does.\n\nIt's worth noting that the Java Standard Tag Library (JSTL) has been safe by default for years."}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Jun 18, 2009", "message": "i demand yahoooverflow.com, where you can ask yahoo answer type questions, but earn reputation for how awful it is. or maybe you start off with 1,000,000 points and you try to get down votes.\n\nthat would be awesome."}, {"author_name": "Richard Matthias", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": "https://twitter.com/richardmatthias", "date": "Jun 18, 2009", "message": "I enjoyed the argument between Joel and Jeff about \"what is a valid question?\"\n\nThe answer I think they danced around was: The question should be about a genuine problem the questioner has faced.\n\nThat should satisfy Joel's demand that people be able to ask the most newbie questions. And it should satisfy Jeff's concerns which I think result from a series of semi-abusive questions 'wise guys' posted after Joel last raised the subject a few podcasts back. \n\nThose questions, while satisfying Joel's criteria, weren't real questions because they weren't about a problem the user was actually facing. They are abusive because if it's not clear that they are jokes, they are to some extent, wasting the time of the people answering them. Sure, the information might be useful to someone in the future, but not yet. \n\nAnd so, this becomes the quality test for questions: If it's a genuine problem for one person, it's more likely to be a genuine problem for other people. Whereas if it's a synthetic question someone came up with just because they thought the information should be on StackOverflow (or for a joke, or to prove a point), it's rather less likely to be useful to others in the future."}, {"author_name": "Young B.", "gravatar_hash": "758911d833e5c8aff734fd850dddea14", "author_url": null, "date": "Jun 18, 2009", "message": "I wanted Do Ask Do Tell, which is reserved. What about Do Ask Will Tell?"}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": null, "date": "Jun 18, 2009", "message": "Naming the SO engine:\n\nContext Switch(er)?\nName's available, kind-of-sort-of ties Stack (Overflow) &amp; (Server) Fault together, still computer \"geeky\" enough imo, while suggesting its adaptable to different contexts."}, {"author_name": "Simon Cropp", "gravatar_hash": "b25a33ced3a0f1aef13b9ed7824787ef", "author_url": null, "date": "Jun 18, 2009", "message": "Re \"view engines that fail to HTML encode by default.\"\nwhy not change view engines?\n\nFor example in nhaml \n\n= person.Name\nwill result in the value of Name being written\n\n&amp;= person.Name\nwill result in the value of Name being HTML encoded and written"}, {"author_name": "Bibhas Acharya", "gravatar_hash": "7a946e87279099f34d9f0a254462d53b", "author_url": "http://go.owu.edu/~bbachary", "date": "Jun 18, 2009", "message": "-  Silverstack\n-  Stacktraffic\n-  Autostacker"}, {"author_name": "DrJokepu", "gravatar_hash": "973c6e2cf1ae9f6615dd883eb14597b1", "author_url": null, "date": "Jun 19, 2009", "message": "I know how to call it! Stack Overflow Infinity!"}, {"author_name": "Rik", "gravatar_hash": "18a86c02ff06b2af506f1e842745d62f", "author_url": null, "date": "Jun 19, 2009", "message": "I'd like to upvote DrJokepu's answer."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Jun 19, 2009", "message": "*puts on joke hat*\n\niStackOverflow\nStackOverflow 2009 Ultimate Edition\nStackOverflow Live!\nStjakk Åfferflöw (IKEA name generator)\nDigitalServer (ACME Namemaker)"}, {"author_name": "s", "gravatar_hash": "cf52a7f2abe5186d675c5aacd9f38f3d", "author_url": null, "date": "Jun 19, 2009", "message": "maybe naming is not hard. maybe you're just bad at it."}, {"author_name": "Mike Sickler", "gravatar_hash": "69739fc4bc58863ff835f4e929694342", "author_url": null, "date": "Jun 19, 2009", "message": "How about FaqOverflow?"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Jun 19, 2009", "message": "Top of the Muffin to You!\n\nhttp://3.bp.blogspot.com/_mUpj-hkwNFU/STdVeqOD31I/AAAAAAAAAZo/xV_wcFL8J5I/s400/muffin+top+2.jpg"}, {"author_name": "Nathan", "gravatar_hash": "ec2b04ac1bad14fea8244a78ef0f2133", "author_url": null, "date": "Jun 19, 2009", "message": "Remember in this naming that we don't need to use either Stack or Overflow in it.\n\nIt could be as simple as KnowlegeBase.com or MyKnowledge.com"}, {"author_name": "Luke", "gravatar_hash": "1b0884daefe88e0518f36f37ecf614ac", "author_url": null, "date": "Jun 19, 2009", "message": "Info Overflow?\nKnowledge Overflow?"}, {"author_name": "Young B.", "gravatar_hash": "758911d833e5c8aff734fd850dddea14", "author_url": null, "date": "Jun 19, 2009", "message": "Bug's Grave\nBugs to Men\nBugs to Fixes"}, {"author_name": "Christopher Edwards", "gravatar_hash": "bc67260ca057ddf28c3a3c5135b05879", "author_url": null, "date": "Jun 19, 2009", "message": "This blog entry (not mine) deals with changing the default  encoding behaviour in ASP.NET MVC that Jeff was referring to (it's not a perfect solution, but worth a look) - http://blog.codeville.net/2007/12/19/aspnet-mvc-prevent-xss-with-automatic-html-encoding/"}, {"author_name": "Kevin", "gravatar_hash": "b56fa324ae52977792fca24ccb247ced", "author_url": null, "date": "Jun 19, 2009", "message": "I think it should be either Stack-Exchange or StacksExchange.  Somehow I think it is appropriate considering previous comments on the show."}, {"author_name": "Patrick Johnmeyer", "gravatar_hash": "d13c16cb15cd0a22161dcdce9f159d10", "author_url": null, "date": "Jun 19, 2009", "message": "re: names for hosted service\n\nI liked Joel Coehoorn's FogBrainz.\n\nMy submission:\nBrainTrust (braintrust.com is for sale, FWIW)"}, {"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": null, "date": "Jun 20, 2009", "message": "I really like knowledgeflow however the .com is registered and in use, \"..formed in 1995...\" and it doesn't look like their website has been updated since much after then maybe it could be acquired. :)"}, {"author_name": "Bob", "gravatar_hash": "0b99033319a7f46661aaf0324c47f335", "author_url": null, "date": "Jun 20, 2009", "message": "Maybe ContextSwitch?"}, {"author_name": "Bob", "gravatar_hash": "0b99033319a7f46661aaf0324c47f335", "author_url": null, "date": "Jun 20, 2009", "message": "Egad nevermind.  Late to the party.\n\nOk, maybe CacheHits?"}, {"author_name": "Euro Micelli", "gravatar_hash": "a905a92a336eaea1b936c100ec49e229", "author_url": "http://stackoverflow.com/users/2230/euro-micelli", "date": "Jun 20, 2009", "message": "Personally, I would avoid the word \"knowledge\" because, believe it or not, it's not an easy word to spell correctly for many non-native English. A name that is hard to spell might make it harder for you guys to reach an international audience, especially on a hosted product that has the potential to generate interest in niche applications around the Globe.\n\nI would probably aim for using English words that have a Latin root, certainly with a phonetic spelling. That might attract a larger audience.\n\nBut maybe I'm just biased because of my own roots. A Chinese word might reach an even larger audience.\n\nI know it doesn't sound like a big deal, but why locking in unnecessarily?"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jun 21, 2009", "message": "@Euro Micelli,\n\nWell, there may be more Chinese speakers than any other language (if this is not technically accurate, please do not correct me because I'm not interested) and so in some sense you might be right in that using a Chinese word might reach a larger audience.\n\nHowever, is that an audience that is as likely to pay for such a hosted service than another?"}, {"author_name": "Ben Hammond", "gravatar_hash": "155e62a8ca34bc660d7f819ae7a1c5ce", "author_url": null, "date": "Jun 21, 2009", "message": "stackundertow.com"}, {"author_name": "Bartosz", "gravatar_hash": "49cb47842fdbd426134581fa77830688", "author_url": "http://bradaczynski.wordpress.com", "date": "Jun 23, 2009", "message": "Does anyone remember the C++ book that Joel was talking about a while ago? You know, the one that listed all the errors that you can make while writing your own string class in c++?"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jun 23, 2009", "message": "I was just out in the Hamptons and Montauk and saw a bagel store named \"twice upon a bagel\".  not sure if that is what joel was referring to."}, {"author_name": "russau", "gravatar_hash": "fb8f14461d037d601087c32f9fa9fea5", "author_url": "http://tinisles.blogspot.com/", "date": "Jun 23, 2009", "message": "RE: \"any question is valid\" discussion..  I get a little annoyed with people asking REALLY open ended questions where they haven't done any research whatsoever.  Something like \"I need the ability to edit images in Silverlight, please post examples.\".\n\nBut I think I'm coming around to Joel's way of thinking.  If someone is prepared to answer it, then how is it hurting me?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 24, 2009", "message": "> I was just out in the Hamptons and Montauk and saw a bagel store named “twice upon a bagel”. not sure if that is what joel was referring to.\n\nOdds are yes, since Joel is always running out to his fancy-shmancy place in the Hamptons on Fridays."}, {"author_name": "John Schroedl", "gravatar_hash": "ae600cb41baa60bce17302c2586dabec", "author_url": null, "date": "Jun 24, 2009", "message": "Names:\n\nPrivate Stack\n\nReserved Stack"}, {"author_name": "Kurt W Leucht", "gravatar_hash": "a83572382e18c7f160bb1c0ea43f98ee", "author_url": "http://www.leucht.com", "date": "Jun 25, 2009", "message": "On the topic of \"what is a valid question\", I'm with Joel.  I've been on other community sites and I've asked stupid newbie questions on these sites and the communities there made me feel really really bad and really really stupid.  I don't really want to be a part of a community that doesn't allow new people to be ... well, new people.  Everyone was new at everything at some time or another.  People should not be afraid of getting yelled at and chastised for asking a stupid question.  \n\nKurt"}, {"author_name": "Swanny", "gravatar_hash": "0c0734dbad2a8e0859d6597a20c306ff", "author_url": null, "date": "Jun 29, 2009", "message": "The problem with HTML Encoding by default is that you might actually be writing out a URL at the time, which of course needs different encoding."}, {"author_name": "Robert Greathouse", "gravatar_hash": "03a43ff1a7c9ca7b295549472da11497", "author_url": "http://cyotee.mp", "date": "Jun 30, 2009", "message": "Catching up on episodes. How about naming the product \"Knowledge Stack\"?\n\nAnd I agree with Joel about building an encyclopedia. An encyclopedia needs to have all knowledge. Nothing is too simple. Especially common sense.\n\nI see wikipedia having this problem. \"Fan Cruft\" should not be deleted, it's knowledge about something that is out there in the world, even just as a work of fiction. And with the edit log, it shouldn't matter is I edit information about myself."}, {"author_name": "nirenjanraj", "gravatar_hash": "b8bff93380c0edbf3dd781e42c9f7ca1", "author_url": "http://www.itsolusenz.com", "date": "Jul 15, 2009", "message": "Hey, you have a great blog here! I'm definitely going to bookmark you! Increasing your web traffic and page views <a href=\"http://directory.itsolusenz.com/submit-link.php\" rel=\"nofollow\"><b>Add</b></a>, add your website in www.directory.itsolusenz.com/ site, it's pretty awesome too!"}, {"author_name": "Wilfred Knievel", "gravatar_hash": "fea4f844fb882fe6bd01fb77c28bdc70", "author_url": null, "date": "Jul 22, 2009", "message": "\"Forget to encode some bit of user-entered data in one single stinking place in your web app, and you will be totally owned with XSS.\"\n\nJust reading a nice post about using Automapper. Could be used to avoid problems like this.\n\nAny hoo, here's the link hope it's useful:\nhttp://mhinze.com/automapper-in-nerddinner/"}, {"author_name": "Mobile App Development", "gravatar_hash": "a81a948de3183677537021329fb3357d", "author_url": "http://www.zco.com/", "date": "Jul 13, 2010", "message": "Really I enjoyed the argument between Joel and Jeff about “what is a valid question?”\n\nThe answer I think they danced around was: The question should be about a genuine problem the questioner has faced."}]}