{"response": [{"author_name": "Duckers", "gravatar_hash": "a8bc072b0c542343a4b36cb32cfaffba", "author_url": null, "date": "Jun 24, 2009", "message": "Thank you for posting this one day early :) Was in the mood for a podcast today.."}, {"author_name": "Dork", "gravatar_hash": "38b89191b4703a618bb18bfd6eba43b3", "author_url": null, "date": "Jun 24, 2009", "message": "1st. I had to do this."}, {"author_name": "Chris", "gravatar_hash": "4d3669c28a93c209801c8063cc11aa39", "author_url": "http://chrisboylan.com", "date": "Jun 24, 2009", "message": "The link for the Moro reflex video is a link to a twitter feed, not the YouTube video to which you were referring."}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": "http://quux.tumblr.com", "date": "Jun 24, 2009", "message": "Thanks for the mention of my answer, guys! I'm really flattered to have had a couple of my heroes mention my work.\n\n(I'm on the job market, too ...)"}, {"author_name": "William Brendel", "gravatar_hash": "18b6b068f92ee1b5408be98e7ecd4a9b", "author_url": null, "date": "Jun 24, 2009", "message": "Great show this week! I especially liked the presentation linked to at the beginning. I always used to wonder how those \"guys that get paid to work on cool stuff\" got where they are.\n\nFor those interested in even more information about CouchDB, check out episode 36 of FLOSS Weekly (http://twit.tv/floss36)."}, {"author_name": "Nathan Reed", "gravatar_hash": "1178609ba6835138fb8ae7f0a2eeffc2", "author_url": null, "date": "Jun 25, 2009", "message": "Maybe I am just too young compared to Joel and Jeff, but I found the Damien  explanation about what sort of data  to put into CouchDB really confusing. Are there really people still out there who think of a contact as a 'real life ' document that belongs in a rolodex (what ever that is)?"}, {"author_name": "William Brendel", "gravatar_hash": "18b6b068f92ee1b5408be98e7ecd4a9b", "author_url": null, "date": "Jun 25, 2009", "message": "@Nathan: I agree that the explanation was a confusing. That's actually why I linked to that FLOSS Weekly episode.\n\nThe explanation given on the SO podcast is confusing, I think, because Joel and Jeff were each cutting Damien off with \"Oh so you what you're saying is \".\n\nI can't fault Joel or Jeff really, because it is sort of a confusing concept to wrap your head around. Plus, they were trying to distill the information for themselves and the audience, which actually made it more confusing for both.\n\nAlso, I think having any kind of preexisting database knowledge actually makes it _more_ difficult to learn CouchDB, and both Jeff and Joel have preexisting knowledge.\n\nI definitely suggest downloading CouchDB if you're confused. Getting started is really easy. You can use the web UI to get started pretty quickly. You too will have that epiphany where you think \"Wow! I'm touching my data!\" :-)"}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Jun 25, 2009", "message": "so.......... with them using javascript.... does that mean that the daily wtf about the guy who said \"have you tried javascript?\" was a visionary?"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jun 25, 2009", "message": "The google embedded UPs for those that haven't seen it\nhttp://blog.sentilla.com/2009/04/google-unveils-custom-serverup.php\n\nThe idea is that instead of rooms full of batteries and then converting 12VDC to 110VAC and having the computer PSU convert back into 12VDC they simply put a cheap 12V backup battery from a fire alarm in parallel with the 12V to the motherboard."}, {"author_name": "Raymond", "gravatar_hash": "73633311a929af87cf9f8862a9d2141a", "author_url": null, "date": "Jun 25, 2009", "message": "I was disappointed there wasn't anything about MongoDB... I've been playing with it and it's way more impressive than Couch, imo.  \n\nCouch is fun for my toy projects, but it's kind of slow and views are annoying."}, {"author_name": "Bill Drissel", "gravatar_hash": "b7f3bbc3c49e4e97f0d3aff93068ecfa", "author_url": null, "date": "Jun 25, 2009", "message": "Well, I did go off and listen to Damien ... an inspiring story ... good guys don't finish last.\n\nThanks for linking,\n  Bill Drissel\n  Grand Prairie, TX"}, {"author_name": "Randal L. Schwartz", "gravatar_hash": "b337d1e52bf3d796a7728def67a602fd", "author_url": "http://www.stonehenge.com/merlyn/", "date": "Jun 26, 2009", "message": "I appreciate the link to my FLOSS Weekly interview with  Jan Lehnardt about CouchDB."}, {"author_name": "Jader Dias", "gravatar_hash": "3b95824785c2bb572d39dc3819e1fe51", "author_url": "http://hourlyapps.blogspot.com", "date": "Jun 26, 2009", "message": "I haven't seen any SuperUser.com Logo with the \"#\" symbol, which is the obvious choice since # is the superuser symbol for unix."}, {"author_name": "Maayan Keshet", "gravatar_hash": "ba266b8b44a8e09255c0ee25bfcae157", "author_url": null, "date": "Jun 27, 2009", "message": "Thanks for airing my question :)\n\nUsage is a good metric. I guess you can measure usage either by notoriety (i.e. Google results when used as a keyword/wikipedia entry), statistics (number of downloads on the website, number of users/stacks on ohloh.net) or activity (active wiki/forums).\n\nI always used projects like Lucene.Net in my home projects and log4net at work, but when I wanted to use Lucene.Net in a critical project at work I wanted to make sure I didn't insert some needless instability into the system.\n\nUsage checkup is still a little sketchy I think for not-so-famous projects. Famous = Lucene, not famous = ProjNet, which is a great project, and used extensively AFAIK in the GIS community, but you'll have hard time finding too much testimony to that on Google/Ohloh.\n\n---\n\nI have to say, CouchDB seems nice. Exploring its website has already given me ideas for some cool applications :)"}, {"author_name": "Bob", "gravatar_hash": "0b99033319a7f46661aaf0324c47f335", "author_url": null, "date": "Jun 27, 2009", "message": "I always felt that the \"1.0 release\" of a product should be the first stable release that is feature-complete.  This simply means it meets all of the original goals for a first release.  A 2.0 release would then meet the next benchmark in capabilities, and so on.\n\nThis does not mean a pre-1.0 version is unusable, any more than a release like 1.5 might be.  It just isn't \"fully baked\" yet."}, {"author_name": "Chris", "gravatar_hash": "e400600450847a664b70eabedb920d2e", "author_url": null, "date": "Jun 29, 2009", "message": "I haven't listened to the podcast yet, but isn't disabling the page file very operating system dependant?  What about booting across a network on a computer with no hard drive, just 8GB of ram?  What about 4GB ram, 4GB swap file on a 4GB second drive vs. 8GB ram no swap file?  Anyway, I agree in most circumstances the answer is no, but surely in the right conditions..."}, {"author_name": "Andrew Wood", "gravatar_hash": "a05ae3c23c293a241a11d68d62d9cee8", "author_url": null, "date": "Jun 30, 2009", "message": "Storing BLOBS in a database is indeed a no brainer and in ORACLE at least you can specify an alternative storage location for the BLOB so it does not get in the way of the rest of the record.\n\nOn a current system we changed from DB storage to file storage because the distributed nature of the client meant that limited bandwidth comms were available between some of the users and the database and we didn't want relatively large files crossing the links that were used for other traffic so we switched to local file storage.\n\nFor this we designed a base path and a file path. The document stores the file path and the app stores the relevant base path. In this way it is easy to move the file storage if required.\n\nIn years to come with infinite bandwidth ;) we can store the BLOBs in the database."}, {"author_name": "Plimb", "gravatar_hash": "e1e8f68c489bbe8db375d2c9cef361f3", "author_url": null, "date": "Nov 20, 2009", "message": "Processees?"}]}