{"response": [{"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 04, 2009", "message": "Fantastic news. Looking forward to analysing some of this :)"}, {"author_name": "Mats Lindh", "gravatar_hash": "106a9db806ef261a71ac34ed23d18a72", "author_url": "http://e-mats.org/", "date": "Jun 04, 2009", "message": "It's already been said, but: Awesome."}, {"author_name": "Konrad", "gravatar_hash": "f9401202ab73e624cc82800b0fff1489", "author_url": "http://madrat.net/", "date": "Jun 04, 2009", "message": "Thanks SO team (and Greg), this rocks. Like you, I'm really looking forward to see how this data gets used."}, {"author_name": "Cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Jun 04, 2009", "message": "Awesome! GJ guys!"}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Jun 04, 2009", "message": "Wonderful, news."}, {"author_name": "Khaja Minhajuddin", "gravatar_hash": "ca4be9237627c499136b8799ff0c7f57", "author_url": "http://minhajuddin.com", "date": "Jun 04, 2009", "message": "Simply Awesome !!\nYou guys may say that I am being a pessimist, But I never thought that Jeff and Joel would release these \"data dumps\". Now all I have to do is simply create a new SORIP.COM and upload the data to it ;)"}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "Jun 04, 2009", "message": "Excellent! I've downloaded the torrent and will be seeding for as long as my server holds up.\n\nThere's one bit of data that probably needs explanation. The VoteTypeId field in votes.xml can be one of the following values:\n\n1              AcceptedByOriginator\n2              UpMod \n3              DownMod\n4              Offensive\n5              Favorite\n6              Close\n7              Reopen\n8              BountyStart \n9              BountyClose\n10           Deletion\n11           Undeletion\n12           Spam\n13           InformModerator"}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309", "date": "Jun 04, 2009", "message": "From Rhino (Bolt - http://thephotoshopper.blogspot.com/2009/05/bolt-out-of-blue.html )\n\n&gt; You're beyond awesome! You're... be-awesome! \n\nStill from Rhino:\n\n&gt; the impossible can become possible if you're awesome!"}, {"author_name": "Brent Ozar", "gravatar_hash": "77f776c2eaf0cc691e8a0880bb8a191f", "author_url": "http://www.brentozar.com", "date": "Jun 04, 2009", "message": "Really cool.  Up to 17 seeds already, and I'll leave mine up permanently too.  Setting up to do a quick video on how to data mine it with SQL Server Analysis Services this morning."}, {"author_name": "tinkertim", "gravatar_hash": "d9015c14008f0f31144bf3f169e53943", "author_url": "http://echoreply.us", "date": "Jun 04, 2009", "message": "Hmm... code_swarm here we come :) Now just to get this into a format that will work for that. May try converting to wikimedia style, then use wiki_swarm.\n\nIf I get it working, I'll post a link."}, {"author_name": "Lior sion", "gravatar_hash": "0ee0f29e8f94b94a9ed3a114f028855b", "author_url": null, "date": "Jun 04, 2009", "message": "Hi,\n\nSound like good news but i'm wondering about the share alike part. How can companies endorse people using stack overflow with the danger of using code they were not supposed to, since very few commercial companies can actually abide to this rule"}, {"author_name": "tweakt", "gravatar_hash": "0b4adc19284ed0751844d610555dc6b2", "author_url": null, "date": "Jun 04, 2009", "message": "Awesome.\n\nOne small request: Please use the extension .7z so it's clear what the file format is."}, {"author_name": "Mark", "gravatar_hash": "51f84118376f4586690e84ee80d54102", "author_url": "http://moddb.com", "date": "Jun 04, 2009", "message": "Hey,\n\nWhats to stop your competitors (i.e. the hyphen one) from uploading this data into there db's?"}, {"author_name": "Patrick Johnmeyer", "gravatar_hash": "d13c16cb15cd0a22161dcdce9f159d10", "author_url": null, "date": "Jun 04, 2009", "message": "<em>And yes, it’s still fun to say “data dump”.</em>\n\nIn the spirit of Jeff's comment...\n\nWould you consider this an excremental improvement to the system?"}, {"author_name": "Daniel", "gravatar_hash": "ef62e78fd520a622778e3c2d151cc64f", "author_url": null, "date": "Jun 04, 2009", "message": "Thanks for the data dump, this is awesome.\n\nDitto with tweakt.  I didn't read the entry close enough and was confused why the file wasn't exploding until I re-read that it was 7zipped."}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Jun 04, 2009", "message": "awesome. i'll get started on the \"which porn star are you?\" app that correlates your SO score to the popularity of porn stars. \n\nrev 1 will even come with a badge! yay internets!"}, {"author_name": "Roel", "gravatar_hash": "89ae6efbbc533445eef32cb9dd7e175e", "author_url": null, "date": "Jun 04, 2009", "message": "So I'm probably missing something, but how can you license content under a CC-license without the original authors' consent? Is there a EULA agreement when users sign up that says they relinquish rights to their UGC, to the extent permitted by local law, to SO (whoever that may legally be)? I read the post in the first link - that post does not address what the anchor text suggests it does, though. Where do users give up their rights on the content they submit? The faq doesn't seem to address this, nor can I find a ToU for on stackoverflow.com (I would expect a link to it in the footer but I can't find it anywhere else, either)."}, {"author_name": "Brent Ozar", "gravatar_hash": "77f776c2eaf0cc691e8a0880bb8a191f", "author_url": "http://www.brentozar.com", "date": "Jun 04, 2009", "message": "I just posted a blog entry and tutorial video on how to data mine this with Excel and SQL Server Analysis Services:\n\nhttp://sqlserverpedia.com/blog/sql-server-tutorial/data-mining-the-stackoverflow-database/"}, {"author_name": "Bremen", "gravatar_hash": "9a45de8df0c5c3f6e137c785e71557b8", "author_url": null, "date": "Jun 04, 2009", "message": "Mm, 2.2MB/s.\n\nI'm also a little confused as to how the license pertains to code people get help with on the site -- would using code from the site therefore require the same license?"}, {"author_name": "Daniel", "gravatar_hash": "ef62e78fd520a622778e3c2d151cc64f", "author_url": null, "date": "Jun 04, 2009", "message": "Maybe there's something bad with my download, but posts.xml isn't well-formed for me.  In particular, Python's xml.parser.Expat is giving me this error:\n\nxml.parsers.expat.ExpatError: reference to invalid character number: line 1, column 7602956\n\nAm I the only one having issues with posts.xml, or should I use a parser which is more accepting of bad XML at it?  (lxml didn't work either, actually, but it doesn't give a column number for failure so its output wasn't particularly interesting.)\n\nAlso, I'm finding it really annoying that there's no data definition, leaving us all to figure out the format of the XML files ourselves; I wish I knew what attributes to expect (and what format they are in) ahead of time."}, {"author_name": "Brent Ozar", "gravatar_hash": "77f776c2eaf0cc691e8a0880bb8a191f", "author_url": "http://www.brentozar.com", "date": "Jun 04, 2009", "message": "In case the SQLServerPedia site is unavailable (as it already seems to be) you can get watch the video tutorial on my site (which hilariously, has a bigger server) - \n\nhttp://www.brentozar.com/archive/2009/06/data-mining-the-stackoverflow-database/"}, {"author_name": "Derek", "gravatar_hash": "9227ac7d54e73cbf01f28c4bd95b71dc", "author_url": null, "date": "Jun 04, 2009", "message": "&gt; anonymized public data dump\n\nWhy bother with the anonymization?  It's got to be trivial to reverse.  If you want to keep voting records and such secret, you should just not include them in the dump.  Remember when AOL released \"anonymous\" data?"}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Jun 04, 2009", "message": "This is wonderful. I can't wait for all the web apps that are bound to pop up and analyze this in all sorts of ways. Thanks, SO dudes."}, {"author_name": "dbr", "gravatar_hash": "edf857d71f672d8f411ef6b8376316b8", "author_url": "http://neverfear.org", "date": "Jun 04, 2009", "message": "I've posted a slightly-meta'ish-question on Stackoverflow about interesting statistics found in the data..\n\nhttp://stackoverflow.com/questions/951056/what-interesting-stats-have-you-found-from-the-stack-overflow-data-dump"}, {"author_name": "BCS", "gravatar_hash": "d68f8d8798ee2da0d94cda6d7a544c23", "author_url": null, "date": "Jun 04, 2009", "message": "What should people like me do who CAN NOT run torrents? I don't have anywhere I run a computer where I would be allowed to server out stuff as part of a torrent."}, {"author_name": "Jameel", "gravatar_hash": "d9206a101e47fdd8bc05e6bebe43200e", "author_url": "http://runawaycoder.co.za", "date": "Jun 04, 2009", "message": "Awesome stuff guys , thanks"}, {"author_name": "Wade", "gravatar_hash": "b3c95ff5fe298837ecbc7e9a1f2f514d", "author_url": null, "date": "Jun 04, 2009", "message": "Here's an interesting essay by Bruce Schneier on anonymous data:\n\nWhy \"Anonymous\" Data Sometimes Isn't\nhttp://www.schneier.com/essay-200.html\n\nand a more recent blog post:\nIdentifying People using Anonymous Social Networking Data\nhttp://www.schneier.com/blog/archives/2009/04/identifying_peo.html\n\nPretty interesting stuff!"}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://www.johntopley.com/", "date": "Jun 04, 2009", "message": "An XSD would be nice."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jun 04, 2009", "message": "&gt;So I’m probably missing something, but how can you \n&gt;license content under a CC-license without the &gt;original authors’ consent? \nThe CC logo and the FAQ clearly explain that content is licensed under CC. You are not relinquishing any rights over your content (IANAL) you still own it and are free to write the same question/answer somewhere else. All you are doing is giving SO the right to use your content under CC.\n\nCode fragments poste din answers would probably be small enough to be used freely in your own code. Me saying use std::stringstream with .str() to convert a long into a string in an answer doesn't exactly make your software package a derived work."}, {"author_name": "SA", "gravatar_hash": "3e6aff9e4fdc834a2e1cd282fec4afd3", "author_url": null, "date": "Jun 04, 2009", "message": "So can't someone take this dump and create a competing site?"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jun 04, 2009", "message": "Yes in theory, but they would have to make it more attractive than SO for visitors, which means better Google rank and there wouldn't be much point unless you also ran more ads - which would turn visitors away.\nMicrosoft is doing something like this with their new 'bing' search site, they are repackaging wikipedia pages as reference."}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "Jun 04, 2009", "message": "&gt; So can’t someone take this dump and create a competing site?\n\nAbsolutely. I remember when Wikipedia was new, clone sites came up all the time. Searching for things in Google was annoying because at the time, many of the knockoff clone sites actually had higher pagerank (that didn't last long).\n\nAlthough they thought these clone sites were competing in some sense, there was simply no comparison. The live interaction and freshness of content is what makes Wikipedia what it is. It's the same with Stack Overflow. If somebody were to take the Stack Overflow data, repackage it in almost any way at all (that of course serves their own interest in some way, like with more ads), then it will still ultimately be less interesting than the original site itself. And if you could even ask questions on such a clone site, who would answer them?"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jun 04, 2009", "message": "Thanks, this is a good contribution to the community."}, {"author_name": "Markus Jevring", "gravatar_hash": "9cc3d22d90033026b465ffd921c14d31", "author_url": "http://cutools.net", "date": "Jun 04, 2009", "message": "I think this is a very good initiative, but I also believe that this will create a lot of crap sites that basically just use your data. Today, a search on any major search engine for some concept or somesuch will return a link to a wikipedia page. The same search will also return hundreds of results to other ad-ridden sites that contain basically the same content.\n\nNow, with free content, just like open source in a sense, this isn't necessarily bad, but it does increase the clutter on the internet, which makes \"real\" results harder to find. Arguably, if they use the same data as you, the results they deliver are \"real\" in the same sense as yours. It's like with refactoring code in a sense. Try to avoid duplicate code that does the same.\n\nAnyway, nice initiative. =)"}, {"author_name": "Phil", "gravatar_hash": "77a2638d21cc223953b6ffa0accdaacd", "author_url": null, "date": "Jun 05, 2009", "message": "Hi\n\nLike Daniel (#comment-24179) I am having some trouble parsing this posts.xml. \n\nI have tried the .Net XmlReader and XmlTextReader.\n\nI am a noob when it comes to reading XML but have also tried the former with XmlReaderSettings.CheckCharacters turned off. It gets further but still fails.\n\nThe 2 errors I get with XmlReader are:\n\n' ', hexadecimal value 0x1F, is an invalid character. Line 1, position 7602959.\n\n'&lt;', hexadecimal value 0x3C, is an invalid attribute character. Line 1, position 44308159."}, {"author_name": ".jpg", "gravatar_hash": "a58cf658f3479a68bc801348902f48bc", "author_url": null, "date": "Jun 05, 2009", "message": "really wish you hadnt used torrent - its blocked on our corporate network.  \n\nAnd i might be a stick in the mud but dont allow torrent software on my home pcs either.\n\nAny chance of simple FTP?"}, {"author_name": "thijs", "gravatar_hash": "bee695854d65b5c75c81098763b67f2a", "author_url": "http://www.brokenwire.net/", "date": "Jun 05, 2009", "message": "It would be nice if you could publish an XSD for this as well, that would make life much easier."}, {"author_name": "Christopher Galpin", "gravatar_hash": "030d305207a41c1452a05bb6b36e8a6e", "author_url": "http://codeoptimism.net", "date": "Jun 05, 2009", "message": "@BCS @.jpg\n\nThis torrent appears to be small enough for Torrent Relay: http://lifehacker.com/395857/torrentrelay-downloads-any-torrent-through-your-browser\n\nFrom my understanding free users can retrieve &lt;= 800mB files at 200 KBps maximum download but it won't seed past completion."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Jun 05, 2009", "message": "What would be a good use for the data? \nIf I want to search it, I would use SO. \n\nThe only benefit I can think of is to create a better search functionality than SO's. Like with sort options and better filters."}, {"author_name": "sth", "gravatar_hash": "92fb4563ddc5ceeaa8b19b60a7a172f4", "author_url": null, "date": "Jun 05, 2009", "message": "For those that really can't use bittorrent:\nhttp://tejp.de/files/so-export-2009-05.7z"}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Jun 05, 2009", "message": "@jpg, why wouldn't you \"allow\" bittorrent software on your home computer?  Simple FTP would require potentially costly amounts of bandwidth on the part of Stackoverflow.  Using torrents they can utilize the bandwidth of all others who choose to seed and download the data and greatly reduce the strain on their servers.\n\nEven WoW patches are distributed via torrent.\n\n@Abdu,  One major possibility I see is the ability to have an \"offline\" version of Stackoverflow's content.  There are certain instances and places where internet isn't possible and with this data dump they have access to a very nice programming resource without the need for a connection."}, {"author_name": "Jay Stevens", "gravatar_hash": "770eb708789729b6ccbae9e2973e9996", "author_url": null, "date": "Jun 05, 2009", "message": "I'm also having problems with invalid characters in posts.xml (using a couple different parsers -- including Excel and a Xerces-based interface).  Any hints on this?\n\nAlso, if you happen have some data analysis insights but don't happen to have 750 rep yet, you can't share those insights on SO.  :("}, {"author_name": "Jon", "gravatar_hash": "a6740001b6d51965cd4e8ebcc52e847f", "author_url": "http://www.jonwinstanley.com", "date": "Jun 06, 2009", "message": "I have put a view of the file schema on my blog.\n\n<a href=\"http://logicflip.com/2009/06/stackoverflow-download-data-schema/\" rel=\"nofollow\">StackOverflow Download Data Schema</a>\n\nHope it helps!\n\nJon"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 06, 2009", "message": "If anyone is having trouble dealing with the XML files, I've copied the data to a sqlite3 database, which can be found here:\n\nhttp://modos.org/so-export-sqlite-2009-05.torrent\n\nThe only changes are in the format of times - the date/time literal has been replaced with the equivalent unix timestamp in most places; in the votes table, only the data was provided, so 00:00 was used.\n\nThis is an extremely large database (1.0GB uncompressed), and without indexing queries can take minutes to complete. the file index.sql contains sqlite expressions that will create indexes on each integer field in the database, as well as the badges table name field, as it might be helpful to select or group by the name of the badge.\n\nAs indexing noticeably adds to the size of the database, to save bandwith no indexing has been done beyond what sqlite3 automatically does for integer primary keys. however, you can add indexing by following the directions in the README file."}, {"author_name": "Luke Venediger", "gravatar_hash": "710e229215517291637f638127aa97f0", "author_url": "https://twitter.com/lukevenediger", "date": "Jun 06, 2009", "message": "Thanks @nobody for the prepped sqlite db! How did you get around the xml error in posts.xml? I got this when parsing with cElementTree:\n\nSyntaxError: reference to invalid character number: line 1, column 7602956\n\nCheers,\nLuke"}, {"author_name": "Alex Martelli", "gravatar_hash": "e8d5fe90f1fe2148bf130cccd4dc311c", "author_url": "http://www.aleax.it", "date": "Jun 06, 2009", "message": "I just posted at http://stackoverflow.com/questions/960020/how-can-i-know-the-average-reputation-of-the-users-in-so/ a Python 2.5 script that (on my Mac) parses the .xml files (with cElementTree) without problems -- they're Unicode with a byte-order mark at the start, not sure what underlying parser you have that can't deal with that.  Maybe you could try downloading and installing lxml...?"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 06, 2009", "message": "@Luke Venediger\n\nI wasn't aware of cElementTree when I wrote my import script, which is more or less regular expressions and generating the appropriate \"insert into\" statements. It basically did a low-level match for column=\"value\" on a row by row basis, so it's very possible for corrupted or invalid data to creep in. In any case, I'll release it if there's demand, but it looks like I might be able to get cleaner code and better performance if I go with a library that's meant for parsing XML, provided I can work around the error that you stumbled across."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 07, 2009", "message": "@Alex: My guess is that the parser your Python script is using just isn't as string as the .NET one. If there really *is* a character U+001F in the data, it's undeniably invalid XML.\n\nI'm going to have a look later today, hopefully (and convert the files to Protocol Buffers if possible, partly to see the difference in size)."}, {"author_name": "Brent Ozar", "gravatar_hash": "77f776c2eaf0cc691e8a0880bb8a191f", "author_url": "http://www.brentozar.com", "date": "Jun 07, 2009", "message": "Yeah, it's got invalid XML in it.  I emailed w/Geoff yesterday.  There are comments and posts that use strings that, when output to XML, are hosing things up.  I don't know enough (anything) about SQL-to-XML conversions to help on that one."}, {"author_name": "Jason Alexander", "gravatar_hash": "3bbdcac657bd8603d4fe21a84cf43059", "author_url": "http://JasonA.net", "date": "Jun 07, 2009", "message": "Dang, yeah, I ran into the same problem while generating XSD's for these. Looking forward to getting the corrected data."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 07, 2009", "message": "Hmm.. I just went into posts.xml with a hex editor, and it looks like the character at position 7,602,956 is an \"s\" (0x73). It's in the body of post id 139921 for future reference. Based on Jon Skeet's post, I also did a search for 0x1f in the file, but I could not find any occurrences. In short, I can't find anything wrong with the file, but I am concerned about the integrity of the SQLite DB that I'm distributing, so further help in nailing down the source of the invalid XML would be appreciated."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 07, 2009", "message": "@nobody_: The \"position\" is likely to be a position in terms of XML characters, not raw bytes. It's also possible that there's an entity reference of 0x1F rather than the character appearing directly. It's unfortunately quite tricky to analyze the problem when there's so much data, and when it's all on one line :(\n\nIf I can work out exactly where the file has gone wrong and how to fix it, I'll put up a small patch program. In the meantime, I'm just indexing your SQL database :)\n\nIt may well be that *using* the database, it's a lot easier to find the problems in the XML files..."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 07, 2009", "message": "Before the new data dump arrives, however, I believe I've found all the problems. (Not sure about posts.xml yet, as I haven't converted that to protobuf format, but the rest work.)\n\nFor both comments.xml and posts.xml, open up the files in your favourite \"large file hex editor\" (I used \"HHD Hex Editor Nero\") and use a regular expression (treating the binary data as ASCII) to replace \"&amp;#x0[12345678BCEF];\" with \"&amp;#x3F\"; ditto for \"&amp;#x1.;\". This will get rid of all the entity references which lead to invalid XML characters.\n\nThen find \"\" (that's the \"pre\" tag in case it's stripped here) in posts.xml at offset 0x2a45112. Do what you like with this - I changed it to \"[pre]\". That should be all it takes.\n\nJon"}, {"author_name": "Jason Alexander", "gravatar_hash": "3bbdcac657bd8603d4fe21a84cf43059", "author_url": "http://JasonA.net", "date": "Jun 07, 2009", "message": "@greg - I'd love to grab that py script from you, if at all possible. I'm getting impatient waiting, and was about to go your route. :)"}, {"author_name": "Phil H", "gravatar_hash": "77a2638d21cc223953b6ffa0accdaacd", "author_url": null, "date": "Jun 07, 2009", "message": "I managed to clean up the posts.xml file so the .Net XmlReader can parse it. Wrote a little program to add a newline before each row element (its all 1 line otherwise), and then used a text editor to check out the problems.\n\nI then hacked a little util together to produce each \"row\" as a separate Microsoft Word document. (I am doing this to produce a large set of documents for testing the peformance of another app.) Many hours later I aborted it after 340,000 rows and 3.2 GB of Word documents produced. (I say this cause if anyone else is interested in this sort of usage, let me know and I can look at sharing stuff)\n\nAnyway - Posts.xml has a PostTypeId attribute which seems to contain \"1\" or \"2\" which I assume represent \"question\" and \"answer\" respectively. What isn't immediately obvious to me is how the answers are mapped to their question. What am I missing?"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 08, 2009", "message": "I haven't checked the new dump yet, but would it be possible to make future ones create one line per row, instead of the whole XML document being on a single line? On text editors which can cope with large files, that would make it a lot saner to deal with.\n\nI'd like to suggest we create a wiki somewhere with the most interesting queries. (I don't think an SO question would really be appropriate...)\n\nOh, and I didn't *spot* anything to indicate whether a post was community wiki or not. I don't have the database in front of me at the minute, so I can't check... but if it's not there now, could you include it fairly easily?"}, {"author_name": "Brent Ozar", "gravatar_hash": "77f776c2eaf0cc691e8a0880bb8a191f", "author_url": "http://www.brentozar.com", "date": "Jun 08, 2009", "message": "I just wrote a blog entry explaining how to import the data into SQL Server and what the different fields mean:\n\nhttp://www.brentozar.com/archive/2009/06/how-to-import-the-stackoverflow-xml-into-sql-server/\n\nJon - if a Post has OwnerUserId = 1, that's the Community user account, so it's a wiki."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 08, 2009", "message": "@Brent: Ah, cool. So by counting OwnerUserId=22656 I really was only counting my non-CW posts. Fun.\n\nIt's not often I wish I had better SQL skills, but this kind of data does it. I might generate a Protocol Buffer version without any text in, which should be easily loadable into memory... then I could use LINQ to Objects, which I'm much more comfortable with :)\n\nI wonder if LINQPad has some easy way of loading in data that I could use... otherwise I could just munge Snippy a bit. So sad that I have about 101 other things I really should be doing..."}, {"author_name": "Brent Ozar", "gravatar_hash": "77f776c2eaf0cc691e8a0880bb8a191f", "author_url": "http://www.brentozar.com", "date": "Jun 08, 2009", "message": "Jon - great idea about the wiki.  I slapped together a section over at SQLServerPedia:\n\nhttp://sqlserverpedia.com/wiki/Data_Mining_the_StackOverflow_Database\n\nI've got my XML import queries, schema notes and a couple of queries there, and I'll add more after I get done with my next pet project."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 08, 2009", "message": "@Brent Ozar:\n\nI don't have the latest dump, so things might have changed, but all my posts have a OwnerUserID of 658, even the ones that are CW. Also, the user id of Community is -1 (Jeff has id 1) and does not own any posts.\n\n@Jon Skeet:\n\nRegarding the Wiki idea, I suggest you contribute to this question dbr set up:\n\nhttp://stackoverflow.com/questions/951056/what-interesting-stats-can-i-obtain-from-the-stack-overflow-data-dump\n\nI know you said you thought it wasn't appropriate for a SO question, but I disagree, and I think this is what CW is made for. Besides, it gets the most coverage and visibility if it stays on SO."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 08, 2009", "message": "Fair enough, as there's already a question there I'll do what I can with that (when I have time to do anything useful, admittedly - probably not tonight). Unfortunately I'm more likely to be a consumer than a producer on this one.\n\nJon"}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "Jun 08, 2009", "message": "It looks like the June dump cleaned up all the remaining XML formatting problems, so that script I mentioned yesterday is no longer needed.\n\nLooking at the latest dump, there appear to be no posts where OwnerUserId=\"-1\", so I'm still not certain how to identify community wiki posts.\n\nOn another note, the number of questions on a day last week reached 1307, which for the first time exceeds the number of questions per day on launch week (which was 1301). Here's some simple graphs: http://hewgill.com/~greg/stackoverflow/stats.html"}, {"author_name": "Brent Ozar", "gravatar_hash": "77f776c2eaf0cc691e8a0880bb8a191f", "author_url": "http://www.brentozar.com", "date": "Jun 08, 2009", "message": "Greg - Sorry, it's not negative one - that was supposed to be just one.  The community ID is 1.  If you query the users table it'll make sense.  Nice graphs!  I've put together a little site showing some of the metrics at:\n\nhttp://spwho2.com"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 08, 2009", "message": "@Brent Ozar:\n\nJeff's ID is 1, Community is -1:\n\nsqlite&gt; select id, displayname from users where id = 1 OR id = -1;\n-1|Community\n1|Jeff Atwood\n\ncapcha: stack 240"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jun 08, 2009", "message": "This is great that you all did this. It's good from a transparency and following the CC license sort of standpoint. My question is for users. Judging by the comments, this is a very sought after feature.\n\nWhat are you going to do with it? Unless you are trying to create a doomed-to-fail ripoff of SO or something like bigresource.com (this pops up in my search results way too much), I don't really see the use. You can already get the data on SO. I think a full SO API would be more interesting. But that's just me. I am interested to know what the uses will be though."}, {"author_name": "Phil", "gravatar_hash": "77a2638d21cc223953b6ffa0accdaacd", "author_url": null, "date": "Jun 08, 2009", "message": "Thanks for the update Jeff!"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 09, 2009", "message": "I just created a new sqlite3 file with the June 2009 data:\n\nhttp://modos.org/so-export-sqlite-2009-06.torrent\n\nThis time I decided to include indexing directly, so the file's a bit larger (~500MB gzipped, 1.6GB uncompressed).\n\nAlso, please disregard README~, Emacs can be a bit overzealous with its autosaving. Thanks."}, {"author_name": "Glitz", "gravatar_hash": "3bbbdeb4aa23c10ecfa4ad3578eef89c", "author_url": null, "date": "Jun 10, 2009", "message": "Is it possible to upload the tag db table(s) as well next time?  I understand if that's too much though.  Great stuff regardless!"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 10, 2009", "message": "@Glitz:\n\nAll the tag data is there, you can find it in the tags column in the posts table, so you can normalize it into a separate table (or two) if you want. However, I do with that the tags were separated by maybe a space instead of &gt;&lt; - it would definitely make it easier to read at a glance."}, {"author_name": "Stu Thompson", "gravatar_hash": "428344688dc21d72a3723d94bed66680", "author_url": "http://www.dietpizza.ch/geekomatic", "date": "Jun 10, 2009", "message": "Is there somewhere else where folks are discussing this?  E.g.: I see that the community user (-a) has ~11k of down votes.  Why?\n\n(This is just so fracking fun!)"}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Jun 10, 2009", "message": "@Stu Thompson:\n\nThe community user \"Own[s] downvotes on spam/evil posts that get permanently deleted.\"\n\nFrom http://stackoverflow.com/users/-1/community ."}, {"author_name": "Stu Thompson", "gravatar_hash": "428344688dc21d72a3723d94bed66680", "author_url": "http://www.dietpizza.ch/geekomatic", "date": "Jun 11, 2009", "message": "Ah, cool.  Thank you mmyers.\n\nI've my first take on the stats, which looks at up vs. down votes over time at http://lanai.dietpizza.ch/geekomatic/2009/06/09/1244565360000.html\n\nHours of entertainment!  I'm so glad this data is available now.  :)"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 11, 2009", "message": "@Stu Thompson:\n\nBesides dbr's post on StackOverflow and Brent Ozar's site, I don't think that there are any more discussions about the data dump. However, I do anticipate that we will need one as this blog post slides off the front page, so I've set up a forum:\n\nhttp://sof.modos.org/forum/viewforum.php?f=7"}, {"author_name": "Stu Thompson", "gravatar_hash": "428344688dc21d72a3723d94bed66680", "author_url": "http://www.dietpizza.ch/geekomatic", "date": "Jun 11, 2009", "message": "Thanks, nobody_says.  (Humph...that sounds strange.)\n\nI've found two anomalies with the badge data that are worthy of discussion and maybe even attention from the powers that be.\n\nOff to post on the forum now!\n\nStu"}, {"author_name": "Stu Thompson", "gravatar_hash": "428344688dc21d72a3723d94bed66680", "author_url": "http://www.dietpizza.ch/geekomatic", "date": "Jun 12, 2009", "message": "Humph, the forum is a ghost town (at least at the moment.)  I've blogged about two anomalies I've seen in the badges data at http://lanai.dietpizza.ch/geekomatic/2009/06/11/1244725080000.html\n\nBut quickly:\n\n* A permanent, huge change (down 2/3rds) in 'organizer' badges after an apparent mid-April badge granting machine problem.  \n* No 'Popular Question' badges awarded on 27 May, and apparently not awarded afterward."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Jun 12, 2009", "message": "@Stu Thompson:\n\"* No ‘Popular Question’ badges awarded on 27 May, and apparently not awarded afterward.\"\n\nBut I got one earlier this week (on Tuesday or Wednesday). This would be after the dump was taken, so perhaps there was a bug fixed recently?"}, {"author_name": "Stu Thompson", "gravatar_hash": "428344688dc21d72a3723d94bed66680", "author_url": "http://www.dietpizza.ch/geekomatic", "date": "Jun 12, 2009", "message": "Let me clarify: The 'Popular Question' badges that I expected to be issued on 27 May do not appear to have been issued retroactively on the 28th (where there were 'Popular Question' badges issued, but not 2x the average or even remotely more than average.)  \n\nIt looks like a one day whole day of 'Popular Question' badges disappeared, but everything is fine afterward."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Jun 12, 2009", "message": "Ah.\n\nWas that the day that view counts weren't working, perchance?"}, {"author_name": "Stu Thompson", "gravatar_hash": "428344688dc21d72a3723d94bed66680", "author_url": "http://www.dietpizza.ch/geekomatic", "date": "Jun 12, 2009", "message": "22 May: 68\n23 May: 34\n24 May: 29\n25 May (Mon): 59\n26 May (Tue): 95\n27 May (Wed):  0\n28 May (Thu): 84\n29 May (Fri): 75\n30 May (Sat): 35\n31 May (Sun): 35\n01 Jun (Mon): 86\n\nAt no point since Beta Days (sans the outage) did the count hit 0."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": "http://sof.modos.org/forum/", "date": "Jun 12, 2009", "message": "@Stu Thompson:\n\nGeoff has posted an explanation of the drop on Organizer badges on the forum:\n\nhttp://sof.modos.org/forum/viewtopic.php?f=7&amp;p=10#p10\n\nSorry that's it's a bit of a \"ghost town\", but it was released less than 24 hours ago. Hopefully, as more people become aware of its existence, activity will pick up."}, {"author_name": "Stéphane Bortzmeyer", "gravatar_hash": "0aa21d9610079a97733219ae7f4f9c3b", "author_url": "http://www.bortzmeyer.org/", "date": "Jun 14, 2009", "message": "The attribute CreationDate in votes.xml is a date, not a time. It does not give enough resolution to study the evolution of votes in time (since almost all votes happend during the first 24 hours of a post).\n \nIn other files, such as users.xml, the date includes the time, down to one second."}, {"author_name": "Stéphane Bortzmeyer", "gravatar_hash": "0aa21d9610079a97733219ae7f4f9c3b", "author_url": "http://www.bortzmeyer.org/", "date": "Jun 14, 2009", "message": "I wrote a small program to load SO data in PostgreSQL, for easier mining:\n\nhttp://www.bortzmeyer.org/stackoverflow-to-postgresql.html"}, {"author_name": "Stu Thompson", "gravatar_hash": "428344688dc21d72a3723d94bed66680", "author_url": "http://www.dietpizza.ch/geekomatic", "date": "Jun 15, 2009", "message": "@mmeyers: I've posted another graph &amp; detailed post on nobdy_'s meta-SO forum at http://sof.modos.org/forum/viewtopic.php?f=7&amp;t=7\n\nSomething smells wrong, I am convinced.  There are a few dozen SOpedians who have been denied their 'Popular Question' badges!"}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Jun 15, 2009", "message": "If people are looking to load up the data into sql server. I just wrote a little tool that brings in all the data in less than 5 minutes (on my machine) \n\nhttp://github.com/sambo99/So-Slow/tree/master\n\nThe XML technique is painfully slow and resource intensive."}, {"author_name": "no", "gravatar_hash": "2a22069e01e220a74b99b3a953a741a3", "author_url": null, "date": "Jul 10, 2009", "message": "My first python program ever :)\nConverts the xml to sql for use in mysql\nhttp://paste.org/index.php?id=8946"}, {"author_name": "Sundar", "gravatar_hash": "01171f6fc1eac8737fe49b5334f68171", "author_url": "http://blog.devsundar.com", "date": "Apr 20, 2010", "message": "Thank you very much for sharing the data."}, {"author_name": "dan", "gravatar_hash": "c78041a1003b8b8f7d27c800723954e9", "author_url": null, "date": "Apr 27, 2010", "message": "Guys, you need to put a \"download\" icon next to the \"Locate and Download the Latest Stack Overflow Creative Commons Data Dump\" link.\n\nI scanned several minutes and could not find the link. Finally I gave up scanning and started reading line by line. ;)"}, {"author_name": "Benjamin H.", "gravatar_hash": "31c13c37c930b2279f0910b47a75bd4b", "author_url": null, "date": "Mar 27, 2011", "message": "Dan is totally right!\nPlease add a download icon or something like that...\nI also spent minutes searching for a download link."}, {"author_name": "Feral Oink", "gravatar_hash": "8cce7b70d30f42045bc6c8569f5549e2", "author_url": "http://myindigolives.wordpress.com/", "date": "Jan 22, 2012", "message": "Thank you for leaving the comments open. The Stack Overflow data dump is alive and well. Here's a link where I just saw it cited, as it is being used for the second year in a row as part of the curriculum for a Data Science course at University of California at Berkeley:  http://www.quora.com/Jeff-Hammerbacher/Introduction-to-Data-Science-Data-Sets/Stack-Overflow-data-used-in-the-final-project-by-Spring-2011-Team-11-and-Team-7 However, it was accompanied by a photo of none other than Jon Skeet. I think that was unintentional, a mistake. It was posted only a few days ago. \n\nRest assured, I took action and informed the poster of the situation. I do this out of regard for fair attribution, and my enduring esteem for the Coding Horror. (If I can do this, I should not be afraid to do anything...):\n<blockquote>Jeff Hammerbacher, that is a photo of Jon Skeet, a famous programmer type from Microsoft (I think). He was the first person to make a comment on the blog post that you linked to, about Stack Overflow Creative Commons Data Dump. However he was merely saying thank you. Jeff Atwood specifically mentioned two people who contributed to the data dump creation, if you really want to include a picture of someone. Or you could just not include a picture of anyone at all (Jeff does not require it)....</blockquote>"}, {"author_name": "chepukha", "gravatar_hash": "4ffa600af79b1c1830e851bc6e52e7dd", "author_url": null, "date": "May 29, 2012", "message": "So where is the link to download the data dump, e.g. for Stackoverflow? Am I missing something?"}, {"author_name": "Kuhan Muniam", "gravatar_hash": "6ccc4a654ab3f1fb525a5d0e7a9c83ec", "author_url": "http://eraserboxtips.blogspot.com", "date": "Sep 02, 2012", "message": "\"providing a database dump of public data.\"\nthe link doesn't work"}, {"author_name": "shaoweiwang", "gravatar_hash": "e350fdcf8af9cb6508ad77638d61cbb9", "author_url": null, "date": "Sep 12, 2012", "message": "like it , it's good"}, {"author_name": "Roddi Walker", "gravatar_hash": "5229b9691e5d84f64ef5670946735f79", "author_url": null, "date": "Sep 14, 2012", "message": "I've created a Visual Studio 2010 project to load the SO data into Postgresql, with foreign keys between the tables (well, the obvious ones anyway).\nIt isn't super clever - just insert statements through the .Net driver DLL.\nIt should be trivial to change to other DBs.\nYou can get it from https://bitbucket.org/roddiwalker/pgsoload"}, {"author_name": "tqjustc", "gravatar_hash": "6b0d2577dfb7d3bcea0dc6f3b4133339", "author_url": null, "date": "Jan 17, 2013", "message": "I read that the data is upto september 2011. So does it imply it will include all questions asked till 30th September, 2011 (so even if some of the questions asked on 30th do not receive an answer, they will be included, am I right?)"}]}