{"response": [{"author_name": "Richard", "gravatar_hash": "810b52ddfa35565b35bf6f37c5d05a88", "author_url": "http://scifi.stackexchange.com/users/20774/richard", "date": "Jun 16, 2015", "message": "Speaking as someone who spends most of their time on Scifi:SE, what new user profile?"}, {"author_name": "Eric", "gravatar_hash": "cad36aea9ff5e233ea939e212bfc466b", "author_url": null, "date": "Jun 16, 2015", "message": "Richard, see: http://blog.stackoverflow.com/2015/04/two-new-user-pages-one-new-stat-this-ones-big/"}, {"author_name": "Richard", "gravatar_hash": "810b52ddfa35565b35bf6f37c5d05a88", "author_url": "http://scifi.stackexchange.com/users/20774/richard", "date": "Jun 16, 2015", "message": "Yes, I was being facetious because the new pages still haven't been rolled out on Scifi. Something about CSS and design issues."}, {"author_name": "Homegrown Tomato", "gravatar_hash": "dce0b9873422a08a79a71743aaf0107a", "author_url": "http://meta.stackexchange.com/users/259867", "date": "Jun 16, 2015", "message": "\"co-founder (emeritus) Jeff Atwood\"\n\nNo (emeritus) needed. One can't retire from being a co-founder."}, {"author_name": "john", "gravatar_hash": "0bad2a3dc3868b744155f76fb8d2c77b", "author_url": "http://adventedesigns.com/", "date": "Jun 16, 2015", "message": "Thanks for the Podcast"}, {"author_name": "Thomas the Tank", "gravatar_hash": "9c64dcfc5ae68595728a2d0efee2d0bf", "author_url": null, "date": "Jun 17, 2015", "message": "You guys should stop making a website and stick to doing podcasts more often. This was great! I literally LOL'd several times, which is embarrassing if you listen on public transport as I do. People think you're nuts. :-D\n\nRegarding the Android app - the changelog notes are the best bit, good work whoever does that.\n\nCareers.. meh. All your jobs are in London or NY and only hipsters need apply. Gumming the site up with more careers is pretty lame, what if I'm not looking to change jobs? Can I opt out of ever seeing those adverts? Haha.\n\nFinally, I am deeply offended by your use of reCAPTCHA. Google has us doing mechanical turk image recognition for nothing. What swines."}, {"author_name": "Erno", "gravatar_hash": "e5b03745134c5e1ebeb773053b047ca0", "author_url": null, "date": "Jun 17, 2015", "message": "Thanks Joel!"}, {"author_name": "BMDan", "gravatar_hash": "a2ce56e5a0ee00932855aed42c70e355", "author_url": null, "date": "Jun 17, 2015", "message": "It's pretty much what you'd expect: \"Sivvie-C-R-M\".  As in the first part of \"civilian\" or \"civilization\", then the three letters, pronounced."}, {"author_name": "News Margin", "gravatar_hash": "45451062b3678ca5dc961f1e23c113d8", "author_url": "http://newsmargin.blogspot.com/", "date": "Jun 18, 2015", "message": "I was being facetious because the new pages still haven’t been rolled out on Scifi. Something about CSS and design issues."}, {"author_name": "Matt Ellen", "gravatar_hash": "ea5fb0bda281e5ddab057950eb17882a", "author_url": null, "date": "Jun 18, 2015", "message": "Don't read the Language Instinct, the theories in it are outdated. I found it profound when I read it 10 years ago but I have since been convinced that the book's devotion to Chomskian Universal Grammar is wrong, as UG is based on untested assumptions that have since been proven incorrect.\n\nI'm currently reading the Language Myth by Vyvyan Evans, which deconstructs UG. I haven't read anything on developmental linguistic since Language Instinct, but I expect David Crystal will have written something good. I should look that up, actually."}, {"author_name": "recurvata", "gravatar_hash": "1df740386c9804ef98abbc4639166118", "author_url": null, "date": "Jun 18, 2015", "message": "Android site looks really nice. Like the font &amp; layout."}, {"author_name": "Oded Coster", "gravatar_hash": "ae979ceb25bc16cd8f9886d66240d642", "author_url": "http://meta.stackexchange.com/users/140505/oded", "date": "Jun 18, 2015", "message": "Hearing the guys talk about the Russian Stack Overflow UI - how they can't figure out what the different tab titles are just confirms to me that the move to have Stack Overflow in many languages is a good one.\n\nHere's a thought experiment for you - go to the Portuguese or Russian Stack Overflow site (one where you don't speak the language, in case you do speak either of those). Look at the UI, click around. Now imagine you had to ask a question on that site.\n\nYeah.\n\nThat's how Stack Overflow feels like for programmers who don't speak English."}, {"author_name": "krowe", "gravatar_hash": "611f88a22ca25f97cfe11dcce9948ea5", "author_url": null, "date": "Jun 18, 2015", "message": "@OdedCoster I agree with you about the move but for a completely different reason. SO isn't intended to be a place to ask questions, it is a place to get answers. A simple example of what I mean is the way duplicate postings are handled. On SO we actively try to prevent these. If our goal was to answer questions then that wouldn't make any sense. Since the ultimate goal is more about providing answers for questions that weren't asked (only searched for) it is perfectly reasonable. Asking questions is simply a means to an end. \n\nNow, given that our goal is to provide answers, why would we want a non English speaker to go around posing poorly written questions? This only degrades the site. We're better off not allowing non English speakers to ask questions to begin with and waiting for an English speaker to come along and write the question in a way that is more easily understandable for everyone (and likely has a few more choice keywords mentioned than a non English speaker would've used)."}, {"author_name": "GiantCowFilms", "gravatar_hash": "e618a333f4dfb48f6b83a4f99c8061bb", "author_url": "http://GiantCowFilms.com", "date": "Jun 18, 2015", "message": "I think to build on the idea of how many people helped, you should add a views sort with the vote and date option to the profile. This should be for both the answers and questions. I'd really like to know which of my contributions has been most values. Face-palm in advance if this feature exists and I just missed it. Promise I looked."}, {"author_name": "David Speyer", "gravatar_hash": "01632db9787f8da89709d5aa098ddd5e", "author_url": null, "date": "Jun 19, 2015", "message": "I'd like to point out that there is a compromise on thank you's which we use on Mathoverflow and works great. The first \"thank you\" comment is permitted. Anyone else who wants to say \"thank you\" upvotes the first tank you comment instead. That way, you get a single comment with 25 upvotes next to it, it doesn't clog up screen space, and there is an easy count of how many people wanted to say thanks. \n\nWe do this by telling people about it when they post a second thanks, but it would be easy to automate."}, {"author_name": "Erno", "gravatar_hash": "e5b03745134c5e1ebeb773053b047ca0", "author_url": null, "date": "Jun 19, 2015", "message": "@David Speyer - perhaps we should rename the answer's upvote button to \"thank you\" button. That would remove the unneeded thank you comment and add score to the answer."}, {"author_name": "Sue MacCallum", "gravatar_hash": "c4dc12fb2f2b347ba4e660154a81e1e8", "author_url": null, "date": "Jun 19, 2015", "message": "Thanks for the hard work! I agree with GiantCowFilms about the value of a views sort. Also, I still think we need to eliminate place-holder text, or at least let people know it exists and give them the choice to opt-out. It's the one thing I find inconsiderate, and contrary to the effort to enhance the user's experience. I assume meta's the place to revisit the issue.  \n(I believe there's a typo here. It looks like \"We talk about this for a while.\" should be \"We talked about this...\" I apologize if I'm wrong!.)"}, {"author_name": "Nirmal", "gravatar_hash": "c735d92bf02293a89a695961c816c0e5", "author_url": null, "date": "Jun 22, 2015", "message": "Great! This thing exists! I am now hooked to this podcasts. Incredibly nice collection of content that I am so up for. Thanks to all of you for doing what you do."}, {"author_name": "نرم افزار انبوه سازان", "gravatar_hash": "1cb277f8af7415ebfac21e93b902e9c5", "author_url": "http://anboohsazansoft.ir/", "date": "Jun 25, 2015", "message": "Good article, thanks for sharing such a good stuff."}]}