{"response": [{"author_name": "Guilherme Nascimento", "gravatar_hash": "4c937661dc06b46b541d3e6ccdc19687", "author_url": "http://pt.stackoverflow.com/users/3635/guilherme-nascimento", "date": "Jun 04, 2015", "message": "Os sistemas de fóruns convencionais, aonde a única colaboração possível era perguntar e responder sem compromisso, tornava conteúdos de qualidade invisíveis e ficava abarrotado de perguntas mal feitas e repetitivas. O StackOverflow.com mudou isto, pois é um sistema que permite uma moderação informal pelos usuários e levar isto para outros idiomas tornou tudo melhor, o StackOverflow em Português abriu novos horizontes para nós que estávamos presos aos sistemas de fóruns convencionais, mostrando que Portugal e Brasil tem um grande potencial de colaboradores e programadores, ao proporcionar uma ferramenta de Q&amp;A colaborativa/comunitária. Só quero dizer parabéns aos idilizadores e aos frequentadores que mais colaboram (parece que nem dormem rs). Obrigado graças a vocês temos um lugar mais saudável (comparando com outras \"coisas\" que já existiam em nosso idioma) para tornar este local uma verdadeira fonte de pesquisa."}, {"author_name": "Franck Dernoncourt", "gravatar_hash": "5a151713b9eae8dc566f5957acee3475", "author_url": "http://francky.me", "date": "Jun 04, 2015", "message": "Looking forward to the day there'll only be one language or perfect machine translation, for knowledge to be accessible to anyone."}, {"author_name": "Albey Amakiir", "gravatar_hash": "fa1512d38160d0546361d2723d0949e4", "author_url": null, "date": "Jun 04, 2015", "message": "Both cases are impossible, given human nature (in both the creation of new languages and in their machine-non-translatable style). We'll need sites like this pretty much forever. :P"}, {"author_name": "Me", "gravatar_hash": "7864d809993744583d15b0f0a2f8dded", "author_url": null, "date": "Jun 04, 2015", "message": "@Franc Dernoncourt IMHO for IT that language could be English (as Latin is for medicine :) )"}, {"author_name": "Camilo Martin", "gravatar_hash": "14570e9514625800a440f40fec36ed6e", "author_url": "http://stackoverflow.com/users/124119/camilo-martin", "date": "Jun 05, 2015", "message": "As a native speaker of Portuguese and generally someone who loathes geopolitics (and frankly thinks English-speaking countries have some of the most stupid politics), I'm 100% in support of people learning English.\n\nThe only reason not to study English is because someone is lazy. I've learnt English by reading an old dictionary (made 10 years before I was born).\n\nStill, I wish this site will prosper and can hold a candle to the real StackOverflow. Of course I want my country (Brazil) to have a great resource, I just think there's no way in hell any other language but English will unite the world's greatest minds. And going there just requires you to learn this language."}, {"author_name": "laika", "gravatar_hash": "f55ef196c5158ab1bd9d26ca185ff79f", "author_url": null, "date": "Jun 05, 2015", "message": "Parabéns! I can read Portuguese, but I wouldn't be able to ask questions... it's a pity that when I browse the stack overflow website I don't see the related questions in Portuguese"}, {"author_name": "Sumurai8", "gravatar_hash": "191dbc0ae8b2e1192d867f5e806bbf71", "author_url": null, "date": "Jun 05, 2015", "message": "Congratulations!"}, {"author_name": "Wrzlprmft", "gravatar_hash": "48ca286c674155fbbe8413791d783566", "author_url": null, "date": "Jun 05, 2015", "message": "@Camilo Martin: But then we are living in a world where programming becomes more and more important to the extent that it should be taught early in school – where most people actually start learning English. \n\nAlso, programming may motivate learning English and help you with it."}, {"author_name": "Marco", "gravatar_hash": "0a0cff0112e0f2e4323d33d1179f3227", "author_url": null, "date": "Jun 05, 2015", "message": "Why are reputation points kept separate between the US and PT version of Stack Overflow? Wouldn't it be better to merge them?"}, {"author_name": "Ismael Miguel", "gravatar_hash": "f4a16b1101f97665c00f3cc187352157", "author_url": null, "date": "Jun 05, 2015", "message": "'Nossa teoria é que falantes de Português tem super-poderes.' --&gt; 'A nossa teoria é que quem Português tem super-poderes.' ou 'A ossa teoria é que falantes de Português têm super-poderes.'"}, {"author_name": "xanex", "gravatar_hash": "227b81d6e12157f978465a521b746a84", "author_url": null, "date": "Jun 05, 2015", "message": "A minha teoria é que se tiver em portugues quer dizer que está mal! vou continuar a ir ao stackoverflow normal"}, {"author_name": "Joe", "gravatar_hash": "e1cf18a5461edc1709cc439e8d915077", "author_url": null, "date": "Jun 05, 2015", "message": "@Marco Stack Overflow in Portuguese is a separate site from Stack Overflow just like every other StackExchange site - so it has its own registration, its own reputation.  All sites contribute to your Network reputation, of course."}, {"author_name": "Gabe Koscky", "gravatar_hash": "93027dde9069f0ff325cfd691799f8db", "author_url": "http://meta.stackexchange.com/users/175506/gabe", "date": "Jun 05, 2015", "message": "@xanex ... Seu comentário está em Português ;)"}, {"author_name": "Ciro Santilli", "gravatar_hash": "c979bd881b6755f84947a5a8ecc7c6f7", "author_url": "http://www.cirosantilli.com", "date": "Jun 06, 2015", "message": "Agente tem q codar mais em Portugol https://pt.wikipedia.org/wiki/G-Portugol , C sucks."}, {"author_name": "badp", "gravatar_hash": "c81f585328c241594864f888f1154025", "author_url": null, "date": "Jun 06, 2015", "message": "It's not fair to expect everyone to speak the same language. What is fair to have some questions in English, some questions in Spanish and some questions in Japanese, so you only have to learn three languages.\n\nProgress!\n\nCongratulations on graduation, though."}, {"author_name": "Anonymous", "gravatar_hash": "c4fde8fbfee1266cfaf967d32ffd931f", "author_url": null, "date": "Jun 07, 2015", "message": "\"Portuguese\"... OF BRAZIL\nSTOP, Just STOP saying that Portuguese was CREATED in BRAAZIL.\nPortuguese was create in Portugal, so stop calling \"Portuguese\" to everything related to Brazil or other \"Portuguese Speaking countries\".\n\nIf it's in Brazilian Portuguese, then say PORTUGUESE OF BRAZIL.\nIs that hard?"}, {"author_name": "kenorb", "gravatar_hash": "8bbc94977312d285045b2412257b6cb8", "author_url": "http://ads.london/", "date": "Jun 07, 2015", "message": "@FranckDernoncourt This is exactly what I was looking for and it's actually possible (and I'm not talking about Google Translate), but you've to change your way of thinking (outside of the box), in other words - not thinking in terms of the machines (otherwise it won't happen)."}, {"author_name": "Marciano", "gravatar_hash": "b1abe7b15d104cca253849fb882cd85f", "author_url": null, "date": "Jun 08, 2015", "message": "@Anonymous Nobody said that SOpt is focused on Brazilian Portuguese. Actually, we are accepting any variation of the portugues language.\nGet your facts straight before complaining"}, {"author_name": "Asia Inspection", "gravatar_hash": "4fb33e942db25b86ce3d0ea93670509f", "author_url": "http://sbeinspection.com/", "date": "Jun 09, 2015", "message": "Eu acho que um estouro de pilha é uma condição indesejável em que um programa de computador específico tenta usar mais espaço de memória do que a pilha de chamadas tem disponível. Na programação, a pilha de chamadas é um tampão que armazena os pedidos que têm de ser tratadas.\n\nO tamanho de uma pilha de chamadas depende de vários factores. Ele é geralmente definida no início de um programa. Seu tamanho pode depender da arquitetura do computador em que o programa é executado, o idioma no qual o programa é escrito, ea quantidade total de memória disponível no sistema. Quando um estouro de pilha ocorre como resultado de excesso de demanda de um programa de espaço de memória, esse programa (e às vezes o computador inteiro) pode falhar."}, {"author_name": "brazilianldsjaguar", "gravatar_hash": "fe78c2a7e66c0de0c77bb198e0d00147", "author_url": null, "date": "Jun 11, 2015", "message": "Hah, @Asia Inspection, you literally described a Stack Overflow in Portuguese. :P"}, {"author_name": "john", "gravatar_hash": "0bad2a3dc3868b744155f76fb8d2c77b", "author_url": "http://adventedesigns.com/", "date": "Jun 16, 2015", "message": "Another Great Move, Now in Portuguese too."}, {"author_name": "News Margin", "gravatar_hash": "45451062b3678ca5dc961f1e23c113d8", "author_url": "http://newsmargin.blogspot.com/", "date": "Jun 19, 2015", "message": "This is the best site"}, {"author_name": "Heating And Air Reno", "gravatar_hash": "8b82ff58073809f1dd74e619857af1fa", "author_url": "http://www.nvenergyexperts.com/", "date": "Jun 21, 2015", "message": "I am unable to speak this language, but I want to congratulate you for this.\nKeep it up"}, {"author_name": "Reno Fireplace", "gravatar_hash": "8b82ff58073809f1dd74e619857af1fa", "author_url": "http://www.nevadaheating.com/", "date": "Jun 22, 2015", "message": "A nice post, very informative."}, {"author_name": "Pellet Stoves Reno", "gravatar_hash": "9ea6509d744cca05aab259f53f2a5d59", "author_url": "http://renofireplaces.com/", "date": "Jun 22, 2015", "message": "<a href=\"http://renofireplaces.com/\" rel=\"nofollow\">Chimney Repair Reno</a>\n\n\nIn different language but informative post."}]}