{"response": [{"author_name": "Vasya", "gravatar_hash": "c4a1cb85640f577a936837fe0741b0a1", "author_url": null, "date": "Jun 11, 2015", "message": "Первый нах!"}, {"author_name": "TylerH", "gravatar_hash": "1cd9e6edf9f4defca0c0d5b68ac9cded", "author_url": null, "date": "Jun 11, 2015", "message": "In Russia, Stack Overflows You\n\n(Welcome!)"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jun 11, 2015", "message": "Oh wow, what a surprise! Well, at least to me. Best of luck!"}, {"author_name": "Andrei", "gravatar_hash": "8eeec535d349fc4acd0492c4a56716a8", "author_url": null, "date": "Jun 11, 2015", "message": "In Russia, Overflow Stacks You"}, {"author_name": "ArtB", "gravatar_hash": "a5f7ff911c368f70c10417b8de5c8c2c", "author_url": null, "date": "Jun 11, 2015", "message": "Next up I'm betting on hindi. Maybe arabic, but probably hindi."}, {"author_name": "rumtscho", "gravatar_hash": "c345be66512ee14f08acd1e27e387c4a", "author_url": null, "date": "Jun 11, 2015", "message": "Добро пожалoвать, Nicolas! Я радa, что мы теперь также доступни для сообществ, где английский не является основным языком.  \n\nWelcome, Nicolas! I'm glad to see that we are extending our offering to communities where English is not the primary language."}, {"author_name": "Vlad", "gravatar_hash": "86f623b60778646739dba1fec8d54a57", "author_url": null, "date": "Jun 11, 2015", "message": "OMG! They killed Hashcode!"}, {"author_name": "Mayank K. Swami", "gravatar_hash": "a1355335e15f9c1bc61b05df6a14ccad", "author_url": "http://brightmeup.com", "date": "Jun 11, 2015", "message": "HashCode link is kind of dead , And Good luck!"}, {"author_name": "R", "gravatar_hash": "28af467eb309ca3d12cec68ace7b3f05", "author_url": null, "date": "Jun 11, 2015", "message": "Great!!!"}, {"author_name": "Nakilon", "gravatar_hash": "dce43cb8158a14c3fed02bea797becd7", "author_url": "http://about.com/", "date": "Jun 11, 2015", "message": "There are two problems:\n1. While working in Russia I know very well, who much people who do not know English are useless and sometimes even harmful in average for development. Giving these people Russian language platform makes them be even more confident in that learning isn't important.\n2. Not all moderators are that good as at SO. While SO's moderators aren't always right and there are reopening votings and other debates, Russian moderators have another issue -- Russian Internet mentality of \"это интернет детка -- тут могут и нахуй послать\", being ignorant and sometimes speaking rude. I reported such issue and I'm glad that flag was marked \"helpful\" but I warned you..."}, {"author_name": "vgrem", "gravatar_hash": "65c86dd2b869571f56e7826026d44dc4", "author_url": null, "date": "Jun 11, 2015", "message": "Wow, congratulation on launching SE in Russian and best of luck to Nicolas!"}, {"author_name": "bot.se", "gravatar_hash": "d61105ffe05dbd1ad26afca911f52236", "author_url": null, "date": "Jun 11, 2015", "message": "Congrats Nick, Team SE and the RuNet users! That's a great step to help people to Q/A in the language they feel are more confident to speak of.  Also, I guess that will mean less editing on ru.so in regard of spelling/grammatical mistakes compared to English version of SO. :D\n\nBut I wonder, do we have a system (a good one) where the ru.so's or pt.so's question can be translated  or moved to and from English SO. Russian and Portuguese community might miss some good experts from English SO if there is no such system (and vice versa). We can afford to have a decentralized library of Q/A but not a dispersed one, some of which can't be understood by majority.\n\nAnyhow, good luck to all involved here in their future endeavor!"}, {"author_name": "Nick Volynkin", "gravatar_hash": "5dd875dfee978c2b0ef148e52e748a1a", "author_url": "http://stackoverflow.com/users/2790048/nick-volynkin", "date": "Jun 11, 2015", "message": "@Vlad Bastards! (no offence, just a reference to a popular cartoon)\n\nCongratulations to us all!"}, {"author_name": "Marina S", "gravatar_hash": "ca901a2dcd63537cb96c5b44e0dc2bef", "author_url": null, "date": "Jun 11, 2015", "message": "Yay! Go Russian community of Stack Overflow! Вперед, Россия! :)"}, {"author_name": "Николай", "gravatar_hash": "fa3c347a854132e18609730d2ed32acb", "author_url": null, "date": "Jun 11, 2015", "message": "Примечательно, что релиз состоялся накануне Дня России!\n\nIt is worth mentioning that the release of Stack Overflow in Russian happened just a day before the Day of Russia (12 June)."}, {"author_name": "Boris", "gravatar_hash": "f02925eef8f737905a8702b9cc21ff07", "author_url": null, "date": "Jun 11, 2015", "message": "Why split community on the langauge basis? I think it makes no sense. Let's face it - programming is an English-language discipline. It has been this way from the beginning. I can't name a single viable non-English programing technology of the top of my head. So I think instead of dublicating the same content on every language, it is way more effective for everyone to force programmers communicate in English."}, {"author_name": "Zane", "gravatar_hash": "a015d8464fcf65e58f554b1d049c4896", "author_url": null, "date": "Jun 11, 2015", "message": "I'm surprised they didn't set a built in counter for how many times someone will make this joke\"In Russia, Stack Overflows You\"."}, {"author_name": "Nicholas Chammas", "gravatar_hash": "9b7fe7ecbea69ba0bf0166b2d8c21b5f", "author_url": null, "date": "Jun 11, 2015", "message": "Boris:\n\n&gt; Why split community on the langauge basis?\n\nThis is not splitting the community. This is extending the Stack Overflow community to people who previously could not be a part of it.\n\n&gt; So I think instead of dublicating the same content on every language, it is way more effective for everyone to force programmers communicate in English.\n\nThat's a cute suggestion, but it is totally unrealistic.\n\nImagine being a Russian programmer living in Russia, and you want to ask some fellow Russians a programming question online.\n\nHow absurd would it be for some random person from another country to butt in and tell these Russians: \"Sorry, to ask each other programming questions you must use English. Why? Because English is the lingua franca of programming in some other countries.\"\n\nEnglish is my mother tongue. But just as I would find it ridiculous if some random Chinese people told me I could only take kung fu classes in Chinese, or some random French people told me I could only discuss French cuisine online in French, it is ridiculous to ask Russians -- or anybody else -- to discuss programming only in English."}, {"author_name": "Derek", "gravatar_hash": "d6fab176b3d9d3026ee3eec2dba19fbe", "author_url": null, "date": "Jun 11, 2015", "message": "Boris:\n\nConsidering Chinese and Spanish as the most common languages, I suggest that we should force everyone to use either Chinese or Spanish instead of English when communicating with other programmers.\n\nThis seems unrealistic, isn't it? Not only you don't have time and resources to be fluent in another language, I believe you don't even want to give up your own native language and use some foreign language!"}, {"author_name": "Albey Amakiir", "gravatar_hash": "fa1512d38160d0546361d2723d0949e4", "author_url": null, "date": "Jun 11, 2015", "message": "Learning a language is *hard*, and your brain really needs to work a certain way to find it enjoyable. But we are programmers and handle logic better (generally speaking). If anything, a universal language should be Logban or something otherwise based on logic. Not English. That's an awful mess."}, {"author_name": "meneldal", "gravatar_hash": "a4c50fba863550f9eee4230d514d560b", "author_url": null, "date": "Jun 11, 2015", "message": "While I completely agree that giving more resources in a language can make programmers refuse to learn English even more, you have to be realistic. I can see it in Japan, those guys would be screwed if it weren't for the 9001 programming books in Japanese (for some reason they seem to believe that if it was published it must be good and useful).\n\nI would really be much happier if they could make the effort of learning English but they won't (it seems to be hardcoded in their brain that this is impossible) so you have to do with it.\n\nFor cases like this, I believe having a resource like SO is infinitely better than using some books of questionable quality. Maybe with that there is a chance to save those guys from getting all wet with Java and designs patterns and actually help them do good code."}, {"author_name": "VeroLom", "gravatar_hash": "0c9aeae62abbaf218a28a4668fd7e40f", "author_url": "http://0xff.su", "date": "Jun 11, 2015", "message": "Ура! :) Tnaks!"}, {"author_name": "Sergey", "gravatar_hash": "4eaa5809792625926cfc8c0fff54c51b", "author_url": null, "date": "Jun 11, 2015", "message": "Why do I have to make a new account instead of just using my current one? And yes, those who mention Russian internet mentality have their point. These days if you don't know English and don't know how to be polite to people... crawl back to your hole and be proud of what you are."}, {"author_name": "SO", "gravatar_hash": "d675b3e6225683ba6432496ec23ed806", "author_url": null, "date": "Jun 11, 2015", "message": "Why are you guys doing it? Your starting idea was to create a centralized knowledge center and right now you are destroying it by making as fractalized as possible. Portugees, Russian, what is next? Will we come back to hundreds of non-connected forums like SO in German, Spanish, French, Chinese, Norwegian and Klingon?\n\nI do realize that SO is afraid to lose a niche and some participants, but does it really worth it?"}, {"author_name": "Yola", "gravatar_hash": "2e41d52b2986c0c63a2f464e34b7b3f3", "author_url": null, "date": "Jun 11, 2015", "message": "I agree with SO. Not a brilliant idea. I would like to search it easily at one site. \n\nI think every programmer must know english, that is not a problem."}, {"author_name": "Tim Post", "gravatar_hash": "23ebed7bd341bb9765bf4d24e31ff334", "author_url": null, "date": "Jun 11, 2015", "message": "@bot.se - We're looking at ways where we can surface related content across sites *when the user might find it useful*, but it's purely hypothetical right now. If the system knew that you spoke Portuguese, and the community identified a question on PT.so that was basically identical to the one in English, we could show that to you somehow. It would be totally community controlled. \n\nAgain, *purely* hypothetical, just something we're kicking around."}, {"author_name": "Shekhar", "gravatar_hash": "92f40a6ac6d15ce2802f6cfbf2880faf", "author_url": null, "date": "Jun 11, 2015", "message": "@Art B - That's not possible. Because we Indians don't code in Hindi. We are used to English..."}, {"author_name": "Петрович", "gravatar_hash": "aa93e24ac27e3da387c28f8672b73fac", "author_url": null, "date": "Jun 11, 2015", "message": "@Boris, @Shekhar:\nThere are some popular in Russia and post-soviet republics software like 1C:Enterprise that are using russian language for coding.\nFor example:\n\n    Запрос = Новый Запрос;\n    Запрос.Текст = \"ВЫБРАТЬ\n        |   ЗарплатаКВыплатеЗарплата.Физлицо как ФизЛицо,\n        |   ЗарплатаКВыплатеЗарплата.Сумма как Сумма\n        |ИЗ\n        |   Документ.ЗарплатаКВыплате.Зарплата как ЗарплатаКВыплатеЗарплата\";\n    Результат = Запрос.Выполнить();"}, {"author_name": "peterh", "gravatar_hash": "1be1fb6a7465f6fbe97f0dbdd69d1e77", "author_url": null, "date": "Jun 11, 2015", "message": "On area51, Turkish, German and Spanish SOs are in commitment. Earlier the Spanish was mentioned as a supported language of the company, but they have plans with the Turkish, too. I think, German will follow only after them."}, {"author_name": "Mike", "gravatar_hash": "361fd9b1b32d13cd1c1dc03e5c6a2127", "author_url": null, "date": "Jun 11, 2015", "message": "I too see no real point in splitting SO into language dependent parts, really. That not-willing-to-learn-the-lingua-franca-of-programming is one point I agree with, but more importantly the separation will duplicate work and will certainly hide good answer from each other. The biggest advantage of SO today is that you can find your answers in a single place."}, {"author_name": "meneldal", "gravatar_hash": "a4c50fba863550f9eee4230d514d560b", "author_url": null, "date": "Jun 12, 2015", "message": "@Mike\n\nSince most of the people who join this communities have poor English (they would have been using SO probably if they did) I don't believe SO will lose many people with the splits. It might actually increase the average English level of questions which wouldn't be a bad thing.\n\nSO will probably remain the biggest community, especially because of its age and the already huge number of questions around.\n\nIf there's one thing I would worry about is more about people farming reputation by basically translating very popular questions from SO."}, {"author_name": "Петрович", "gravatar_hash": "aa93e24ac27e3da387c28f8672b73fac", "author_url": null, "date": "Jun 12, 2015", "message": "@meneldal\nI think there is nothing bad to get a reward for a good translation with link to the original post."}, {"author_name": "Daneel", "gravatar_hash": "fd8a980ee2d74b9640bfe1c062e00a35", "author_url": null, "date": "Jun 12, 2015", "message": "So poorly logic-based idea...\n\nI'm not native English speaker, but I accept SO and similar portals to improve not only my programming and other skills but also to improve my English.\n\nI don't see really concrete reasons and advantages to do that. Seems to me that all these Spanish, Russian etc. versions are only about nationalism, \"I-don't-like-English/UK/US\" and laziness..."}, {"author_name": "ElmoVanKielmo", "gravatar_hash": "3ca9a29c5fef8b27046af4dcbf7a901f", "author_url": null, "date": "Jun 12, 2015", "message": "What are you doing? The best thing about SO is that we can share the knowledge and experience no matter the country we come from!\nOne of the key skills of a software developer is the ability to learn quickly and learn programming LANGUAGES.\nI'm sorry but I'm not buying the idea. If one have problem to learn a simple language like English - yes, it's simple (no declination etc.), I don't believe this person can learn a programming language.\nIt will end up with massive flood of questions asking for ready made solutions, because the author of the question is unwilling to learn and to try to understand anything more challenging than the mother language."}, {"author_name": "TMST", "gravatar_hash": "b4d02dc91d4623865c3f2994f52006b8", "author_url": null, "date": "Jun 12, 2015", "message": "Derek : care to share with us the data that shows Chinese and Spanish are the most popular languages *among programmers*? Should be interesting!"}, {"author_name": "George", "gravatar_hash": "cb51901b5973f3cadc2d55b16a3b3fa5", "author_url": null, "date": "Jun 12, 2015", "message": "Best of luck, Nickolas"}, {"author_name": "Michal Paszkiewicz", "gravatar_hash": "f8231ccab5f14c6499e32e17700399d9", "author_url": "http://www.michalpaszkiewicz.co.uk", "date": "Jun 12, 2015", "message": "It's time to start learning Russian!"}, {"author_name": "brosef", "gravatar_hash": "ba5188f28326c2f5d09641a016732df5", "author_url": null, "date": "Jun 12, 2015", "message": "Daneel, nationalism and laziness? Good lord! Every time something is mentioned about Russia or, really, any foreign country, all of these xenophobic armchair generals crawl out from under their rocks and start spouting their political nonsense. Fact is, some people find it difficult to communicate in English and it's certainly a good thing that they would have access to community in their own language to help them solve problems."}, {"author_name": "Elnur Abdurrakhimov", "gravatar_hash": "21387fbefd1625a9ebe359e307b55098", "author_url": "http://elnur.pro", "date": "Jun 12, 2015", "message": "I'm a Russian programmer born in Russia and I've been living here my whole life. Russian is my native language.\n\nLet me tell you one thing. If you are a programmer and you can't at least read in English, you suck balls. I'd never ever hire you. No matter how good you are. In fact, you can't really be good in programming without English. Hence a good programmer not knowing English is an oxymoron.\n\nEven when I was running the Web department in a Russian company, I'd hire only those who could at least read in English. Now that I work with US companies, we still hire Russians, but this time it's a requirement for them to know English. Not because it's my personal whim, but because these are US companies, you know.\n\nI'd say there's only 1% of information on programming ever being translated to Russian, and then only 1% of that translation is being done not by moronic imbeciles. Sure, the numbers are not exact, but you get the picture.\n\nAnd that's exactly the reason why if you don't know English, you're cut off of all the enormous wealth of useful information without which you can't be any good programmer by definition."}, {"author_name": "Matthias", "gravatar_hash": "ef219171011d33702601c80ee25615fa", "author_url": null, "date": "Jun 12, 2015", "message": "I like all those new communities. They offer a place for people who are not able to speak proper english. \n\nIf they have their own place, we will get less questions that are hard to understand on the \"real\" site. \n\n\nNo offense, but I hope Hindi and Turkish are next."}, {"author_name": "Elnur Abdurrakhimov", "gravatar_hash": "21387fbefd1625a9ebe359e307b55098", "author_url": "http://elnur.pro", "date": "Jun 12, 2015", "message": "And that's why Russian Stackoverflow is just a fugly stupid little brother of the main Stackoverflow that's going to be full of lame developers that suck because they don't know English. And that leads to very low credibility of the community. And hence no serious developer in Russia would look for answers in Russian Stackoverflow."}, {"author_name": "Sumerk Bogov", "gravatar_hash": "5fd8a1ee23558228620fd3bae1bf5324", "author_url": null, "date": "Jun 12, 2015", "message": "Why can't those haters of Russian SO just continue to use English SO? You don't like Russian SO, you don't use it, as simple as that. You also want to decide for those who like the idea? \"Thanks, but no, thanks.\"\n\nImplying that THE ONLY reason for using Russian SO is lacking knowledge of English is narrow-minded and even insulting. A person can LIKE or PREFER to communicate in Russian, even being able to communicate in English or another language. And there can be other reasons.\n\nAnother insulting thing is assigning labels like \"they suck balls\", \"fugly stupid\" and \"lame\" to large groups of people. With as solid reasoning as \"Let you tell me one thing\", \"I'd say\" and \"you get the picture\". On a technical forum like Stack Overflow. I am suggesting to stop doing it."}, {"author_name": "MR Widström", "gravatar_hash": "c576e8880f1b48d1bbe2d90bfd0acf7d", "author_url": null, "date": "Jun 12, 2015", "message": "Great news for the many russian speaking co-developers out there!\n\nLooks as if it already have a critical mass to keep it going.\n\nA bit sad that some feel the need to show themselves superior by saying this and that about the site or it's users."}, {"author_name": "Tim Post", "gravatar_hash": "23ebed7bd341bb9765bf4d24e31ff334", "author_url": null, "date": "Jun 12, 2015", "message": "To this \"Everyone must know English\" - I'm delighted to see you all posting this *in* English, because you speak it. Many people do not, many people *will not*, and there's positively nothing wrong with us making our software available to them as well. \n\nIf you don't want to participate on the [language] site, just use the English one. But please, stop condemning their mere existence under the flag of knowledge fragmentation - the folks we're trying to serve *would not be inclined to type stuff on our English site to begin with*, or do it so poorly that the experience is just awful for them (and you). \n\nPut yourself in another country, in need of assistance, and without the capabilities to ask for it. When you've done that, as I have, I'm happy to hear constructive arguments from you against our localization effort."}, {"author_name": "Samia", "gravatar_hash": "41b50f2c2defa3dbaf9063d13273c5eb", "author_url": null, "date": "Jun 12, 2015", "message": "@Tim, thumbs up. I wanted to write a huge comment, but English is not my first language (nor strongest), I'll refrain! Localization is awesome! \n\nWelcome Nicolas! I hope your stack is organized and not overflowed! :p"}, {"author_name": "Zekka", "gravatar_hash": "b149275af28979d33a8369b69f441f21", "author_url": null, "date": "Jun 12, 2015", "message": "I was very surprised to find out this didn't already exist.\n\nDefinitely hoping to see incentives for good cross-site translations!"}, {"author_name": "EMB", "gravatar_hash": "f359ce4d16fff9f536436f358fc48b1a", "author_url": null, "date": "Jun 12, 2015", "message": "@Tim Post\nGlad to see more languages. I'm not a fanatical user, but I saw problems with SO when \"engrish\" results in \"BAD Question!\" flag."}, {"author_name": "Pluto", "gravatar_hash": "12066cbfd8fce49065b384d49de5e707", "author_url": null, "date": "Jun 12, 2015", "message": "@Elnur Abdurrakhimov\n\nDoesn't the mere creation of ru.so start a path to remove the requirement of knowing English, because it does allow people to share programming knowledge/help in Russian? As an American, I feel it's plain wrong for English to be a requirement to learn to program. Even MDN has much of its knowledgebase translated: https://developer.mozilla.org/en-US/docs/Web/HTML"}, {"author_name": "Rubén", "gravatar_hash": "32316c561bb1c4d85647963ca44913c5", "author_url": null, "date": "Jun 12, 2015", "message": "Congratulations. \n\nI'm glad to know that the Stack Exchange network has more sites in other languages."}, {"author_name": "Andrey", "gravatar_hash": "f2f628187840684f1e41f19bd5ecf1d9", "author_url": "https://www.linkedin.com/in/cplusplus", "date": "Jun 12, 2015", "message": "Congratulations!"}, {"author_name": "Elena", "gravatar_hash": "9ecc3c5f7fda4f9d4790e7d986b101ed", "author_url": null, "date": "Jun 12, 2015", "message": "Awesome!"}, {"author_name": "J0e3gan", "gravatar_hash": "68c4911127e973b1fc529ee79cc73cfb", "author_url": "http://stackoverflow.com/users/1810429/j0e3gan", "date": "Jun 12, 2015", "message": "Great news!  Welcome to the new SE-tizens. :P"}, {"author_name": "Nicholas Chammas", "gravatar_hash": "9b7fe7ecbea69ba0bf0166b2d8c21b5f", "author_url": null, "date": "Jun 12, 2015", "message": "Tim Post:\n\n&gt; If you don’t want to participate on the [language] site, just use the English one. But please, stop condemning their mere existence under the flag of knowledge fragmentation – the folks we’re trying to serve *would not be inclined to type stuff on our English site to begin with*, or do it so poorly that the experience is just awful for them (and you).\n\n+9000 to this.\n\nIf y'all haven't done so already, I think you should write a dedicated blog post about why different language sites are necessary. It's totally obvious to some people, but to others it clearly needs some explaining."}, {"author_name": "Jeffrey Bosboom", "gravatar_hash": "7349581b85c8d503fe8d907b74d35e5c", "author_url": "https://stackoverflow.com/users/3614835/jeffrey-bosboom", "date": "Jun 12, 2015", "message": "I'd like to see platform support for translation that tracks the provenance of posts across sites, alerts translators when the source post is edited, and allows users to request translation through the bounty system.  Fragmentation is not inevitable."}, {"author_name": "sandrstar", "gravatar_hash": "2fdbbd90206f6213cb3ff7e81e3020b5", "author_url": null, "date": "Jun 12, 2015", "message": "Наконец-то!\nFinally!"}, {"author_name": "InRuSOU", "gravatar_hash": "4390b9c0c91ccb6da7f4b0c468127276", "author_url": null, "date": "Jun 13, 2015", "message": "I believe most Russians actually prefer to use Russian instead of English (even when knowing how to communicate properly, and the same goes to most of the other languages, except maybe in India, where most are comfortable with English), so it's a good improvement.\n\nBut a GREAT IMPROVEMENT would be creating an auto-translate system to all Stack Exchange websites, which means: any text that is not inside a `code` block would be viewed in the user's language.\nIt'd be great mainly because currently a lot of good questions/answers are only known to a particular language, so breaking the language barrier would make the entire world more knowledgeable. The option to view it in the original language or use other translation engines (provided externally, fecthing through Javascript) would be a plus.\n\nAnyway, congratulations in joining Portuguese and Japanese in the seemly growing Stack Overflow languages websites group :)"}, {"author_name": "TMST", "gravatar_hash": "b4d02dc91d4623865c3f2994f52006b8", "author_url": null, "date": "Jun 13, 2015", "message": "Tim Post: I'm  going to have to call BS on that one. Time and time again, whenever a voice of dissent gets posted on the SE blog on the subject of yet another (inter)nationalized version, this straw-man argument gets pushed around, and invariably, it gets more ridiculous in the light of actual native speakers of the given language voicing their dissent.\n\nWhether there is a net worth in creating non-English SO versions is a matter worthy of discussion (I think it's way too early, and the decisions are knee-jerk reactions due to the rise of clones - but I acknowledge that I may be wrong), but please treat your in-network social standing with its due respect and don't base your posts on obviously emotionally-loaded, rhetorical fallacies!"}, {"author_name": "Tarquin", "gravatar_hash": "bc3ca52d4df95ab4b8d1903625443bd8", "author_url": null, "date": "Jun 13, 2015", "message": "I can't say that I feel this is a good idea either. Not because I am against people talking in their own language, but because the code used is in pure english. Just looking at the Russian page, all portions of code are in English with russian comments.\n\nI feel that while people here are going a bit far with their comments, their belief aligns with the idea that doing this will remove potentially good answers from the SO community and spread them so slightly to other locale SO's.\n\nThis may have an affect over the next few years in reducing the rate of which questions get answered and potentially reduce the quality of the answers.\n\nI also agree that if you are developing HTML, PHP, jQuery, JS... etc etc that you should probably have an understanding in the English language.\n\nA more appropriate way to further include users into the community is to either have a system that translates posts content (excluding code etc) into a users local language (Setting Option) or;\n\nOffering rep rewards for manual translations of content into different languages for people to view.\n\nIf you find a question in English that you like but you cant understand it due to your inability to understand English, you request it translated and the reward +5 rep (or something?) to the person who translates it.\n\nAgain, I am not hating on Russian speaking, or anyone else for that matter, people... I am simply stating that for this excercise that English is the decided language."}, {"author_name": "Evgeni Sergeev", "gravatar_hash": "bf11af111cab6e513d68e5e30762deb5", "author_url": "http://evgeni.org", "date": "Jun 13, 2015", "message": "This is great, because in the Russian-speaking world, there is a very high standard of humour. It's the cultural wisdom of not only getting the job done, but also having a quality time doing it.\n\nOn the other hand there are some problems too. Of the two historical Russian problems, roads is not important here, but the problem of adoration of dunduk officials might be an issue."}, {"author_name": "user", "gravatar_hash": "5090955f02d7ea4650533102fb988464", "author_url": null, "date": "Jun 14, 2015", "message": "Welcome!"}, {"author_name": "rumtscho", "gravatar_hash": "c345be66512ee14f08acd1e27e387c4a", "author_url": null, "date": "Jun 14, 2015", "message": "A small anecdote: about 10 years ago, I wanted to get my Palm T|X to display ebooks in a cyrillic encoding. The English speaking sources had nothing on the topic, so I found a large Russian forum, and did my best to compose a description of my problem in Russian. Somebody took enough pity on me to answer - and did it in English, probably because he thought that a person with my atrocious skills of writing Russian won't understand him else. I didn't get it to work well, and when a few years later I had the same encoding problem with the Sony e-reader, didn't even try posting for help anywhere. \n\nI use each of my three main languages daily, if one gets left out, it's my mother tongue. I also sometimes try to read texts in languages I don't know (as long as I know the alphabet) and get the gist of it - for fun. So I'd say I have way more motivation and experience of immersing myself in foreign languages than the average person. And still, *getting technical help in a language I speak badly turned out to be difficult, time-consuming, fruitless and frustrating* to the point where I preferred to leave the problem unsolved. \n\nIf that's the experience for me, it's unlikely to be any better for the millions of Russian (or Portuguese, or whoever) programmers who don't speak English well. Sure, we could step on a high pulpit and tell them all to learn English ASAP, because that's how they have to be. Also to read Programming pearls, to start doing TBD, and to floss their teeth regularly, because everybody knows it's good for you. Or, we could lose the \"you only deserve my help if you meet my expectations\" attitude and, you know, get along with people as they are. Not withholding resources which would be well suited to them because we want them to get accustomed to using the ones which are suited to us."}, {"author_name": "Todaytopoffers.com", "gravatar_hash": "60a433165f517c336921cd647bafb19e", "author_url": "http://www.todaytopoffers.com", "date": "Jun 14, 2015", "message": "StackOverflow in Russia, Congratulations"}, {"author_name": "Kavita", "gravatar_hash": "0e51df151a4d05229ba210b31a4ba5d2", "author_url": "http://www.fridayblockbuster.com/", "date": "Jun 14, 2015", "message": "Nice share my friend."}, {"author_name": "Candy Swift", "gravatar_hash": "b2fe316542ac321f2d9012c603b133a7", "author_url": "http://www.creative-biolabs.com", "date": "Jun 15, 2015", "message": "WOW! Sound like we should get started on learning Russian now. Congratulations!"}, {"author_name": "meneldal", "gravatar_hash": "a4c50fba863550f9eee4230d514d560b", "author_url": null, "date": "Jun 15, 2015", "message": "@rumtscho That was a great post, you have put my ideas in a much better form than I could.\n\nI'm glad some people have a realistic point of view on the issue. As for me the issues I would have are mostly with Japanese and I know that I had a hard time following information in Japanese that was supposed to fix issues I had. I'm glad I eventually found something in English."}, {"author_name": "john", "gravatar_hash": "0bad2a3dc3868b744155f76fb8d2c77b", "author_url": "http://adventedesigns.com/", "date": "Jun 16, 2015", "message": "Congrats, Make stackoverflow to all"}, {"author_name": "News Margin", "gravatar_hash": "45451062b3678ca5dc961f1e23c113d8", "author_url": "http://newsmargin.blogspot.com/", "date": "Jun 19, 2015", "message": "I love this site"}]}