{"response": [{"author_name": "JoshDM", "gravatar_hash": "82762ea3991b3411abab1054dea063a4", "author_url": "http://www.joshdm.com", "date": "Apr 17, 2014", "message": "I like how you used Pets as the example."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://meta.stackexchange.com/users/1438/jon-ericson", "date": "Apr 17, 2014", "message": "During my interviews, several people asked what one feature I'd want to have implemented on Stack Exchange. This is that feature.\n\nWell done, Tim and the developers and designers who worked on it. MSE looks great and MSO is <em>so clean</em>.  Here's to the brand new and long awaited town hall."}, {"author_name": "Doorknob", "gravatar_hash": "bf5ae1189f8b36ece8fcdc2e2e761104", "author_url": "http://keyboardfire.com", "date": "Apr 17, 2014", "message": "I don't like how you didn't use Code Golf as the example."}, {"author_name": "celtschk", "gravatar_hash": "fc32a26226e9fb508da358488d8cd225", "author_url": null, "date": "Apr 17, 2014", "message": "Now that Meta is a separate stackexchange site, will there also be a meta.meta.SE? ;-)"}, {"author_name": "Ben", "gravatar_hash": "ada90dc82e9546879ac95847117d1a3e", "author_url": "http://www.kd7uiy.com", "date": "Apr 17, 2014", "message": "I've always thought that meta.meta.SE should be for the moderators, but maybe I'm just crazy..."}, {"author_name": "Franck Dernoncourt", "gravatar_hash": "5a151713b9eae8dc566f5957acee3475", "author_url": "http://francky.me", "date": "Apr 17, 2014", "message": "Yeah actually I already have a meta meta questions regarding the excessive use of whitespaces in the new meta website design... http://meta.stackexchange.com/q/229898/178179"}, {"author_name": "alienated_SE_anti-member", "gravatar_hash": "cf9f0023c406557ff7fb41b6996ec0c9", "author_url": "http://www.useit.com", "date": "Apr 17, 2014", "message": "*I* like how you admit you \"fought hard\" against a great -- and more importantly, common-fricking-sense -- idea and ultimately came to accept it, when there are so many other terrible, common-sense-defying ideas and designs (and anti-ideas/anti-designs) that you adhere to and defend after all these years.\n\nyou go!"}, {"author_name": "msh210", "gravatar_hash": "78a50094ca87aaed01e076f4c8808ed8", "author_url": "http://mi.yodeya.com/u/170", "date": "Apr 17, 2014", "message": "First Stack Overflow... the next thing you know, the District of Columbia will have its own legislative body."}, {"author_name": "SAJID", "gravatar_hash": "8dfc8803dcd4b3a016bf19a9dd9c265a", "author_url": "http://techguru3d.com/", "date": "Apr 17, 2014", "message": "When you visit Meta Stack Exchange, you’ll see that the split is still a a work in progress. We’re in the process of migrating quite a few Stack Overflow specific discussions that are still relevant and unresolved, to help to show the kind of topics that belong on the new MSO. \n\nReally???"}, {"author_name": "Shadow Wizard", "gravatar_hash": "ab78492b42045cfabc0e857908519fea", "author_url": null, "date": "Apr 18, 2014", "message": "That was a long 6-8 weeks but worth waiting. Kudos for job well done, guys!"}, {"author_name": "HostileFork", "gravatar_hash": "805b10453f2d30f8499e46b1b8002637", "author_url": "http://blog.hostilefork.com", "date": "Apr 18, 2014", "message": "So many sites make excuses for \"why we can't do that\".  (They probably spend more time arguing for their laziness than it would take to do the necessary thing.)\n\nRefreshing to see a system that is actually willing to get better and do the organizational work required.  I'm pleased to be watching the StackOverflow-specific questions slowly migrate across (though shouldn't there be a button for suggesting that?)"}, {"author_name": "Alienated_Too", "gravatar_hash": "a33448aee48e80a87490b010d9debf12", "author_url": null, "date": "Apr 18, 2014", "message": "Lol Alienated, good point.  Maybe we need an anti-Meta Stack Exchange, where we can point out without fear of being gagged by a moderator all the really stupid things SE does to make sure that only the questions the moderators care about stick around.\n\nIsn't it amazing that something like SE would end up being edited/run by people who aren't too busy to spend hours a day on a questions site?  Something that is supposed to be a resource for busy programmers, run by programmers who apparently aren't all that busy... Spider Robinson's God would so approve."}, {"author_name": "cyrus", "gravatar_hash": "df18a6e25acf0ebd6edd27c9f49e684f", "author_url": "http://xtreamcoder.com/", "date": "Apr 18, 2014", "message": "Nice move, MSO will surely help us and new users,about how SO works and what are its features"}, {"author_name": "...", "gravatar_hash": "c00b7423e25f45959690ed41fb84f141", "author_url": null, "date": "Apr 18, 2014", "message": "\"and we fought it hard before we realized how right you guys were\"\n\nYou do this a lot.  Why do you do this so much?  Is there more to it than just being stubborn?\n\n<blockquote>Because adding complexity to a system always has a significant, ongoing cost, and it's easy to build up so much \"debt\" this way that it eventually brings further development to a stand-still. <a href=\"http://blogs.msdn.com/b/ericgu/archive/2004/01/12/57985.aspx\" rel=\"nofollow\">Eric Gunnerson's \"Minus 100 points\" post</a> is worth keeping in mind when discussing new features to *any* moderately-complex system: you need a compelling argument, something beyond just \"wouldn't it be cool if this existed...\" - but when something manages to inspire a *lot* of support from a *lot* of people, it's worth taking a serious look at implementation. This, in a nutshell, is the value of meta: it gives us a place where we can listen to y'all tell us how wrong we are. \n--Shog</blockquote>"}, {"author_name": "Deepak Mishra", "gravatar_hash": "cde2fd007ff808c600cc177aa9c3935d", "author_url": "http://metamug.com/deepak", "date": "Apr 19, 2014", "message": "So this covers all the stackexchange sites."}, {"author_name": "Ethen A. Wilson", "gravatar_hash": "0aa20e98e5a600b87554bd491c5279c1", "author_url": null, "date": "Apr 19, 2014", "message": "Is there going to be a meta for SE Meta? What if we need a place to discuss things about the SE Meta?"}, {"author_name": "Robin Carlin", "gravatar_hash": "0429d64ced68a78c7b19b8b2921356c0", "author_url": "https://Github.com/AdminCarlin", "date": "Apr 20, 2014", "message": "OKAY!!!\nNow we can work to meet my standards. We are strong soon to became a force of recognition globally.\nMother of many nations is what I call my team yet not chosen.\n\nTruly yours,\n\nAdministrator\n\nRobin Carlin\nFederalcarlin@gmail.com\nCental time zone"}, {"author_name": "DENI KUTA", "gravatar_hash": "a0eb01b0f1eaff25caaa6f2ec612f86d", "author_url": "http://denikuta.blogspot.com/2014/04/terobsesi-ahli-pakar-seo-indonesia.html", "date": "Apr 20, 2014", "message": "Komonity person familiar and always share the truth is that I want, Meta has always been one of the most important Things That make my network.than's for share."}, {"author_name": "Tim Post", "gravatar_hash": "23ebed7bd341bb9765bf4d24e31ff334", "author_url": null, "date": "Apr 20, 2014", "message": "@Ethen - You can just discuss it on MSE itself. There are scope and tag related tags, just use those like you'd use them on any other meta site."}, {"author_name": "mehow", "gravatar_hash": "1100758a0c4987aac1f3604c8147e2c4", "author_url": "http://vba4all.wordpress.com", "date": "Apr 22, 2014", "message": "havent really been following much lately but why reputation gained/lost on SO-Meta isn't accounted anywhere? Ie. you can upvote and downvote things but that takes no effect on rep?"}, {"author_name": "longtimeSOuser", "gravatar_hash": "53f31582b4c3d36b113142a87647afbb", "author_url": "http://bugmenot.com", "date": "Apr 22, 2014", "message": "It's now pretty much lame as can get. It's the end of an era! Thanks for all the fishes!"}, {"author_name": "mehow", "gravatar_hash": "1100758a0c4987aac1f3604c8147e2c4", "author_url": "http://vba4all.wordpress.com", "date": "Apr 23, 2014", "message": "it sucks you can't delete or flag for removal your own comment here.."}, {"author_name": "keaton", "gravatar_hash": "b0659c13a343cd06f21376b3d4ba0928", "author_url": "http://getajobstaffing.weebly.com/", "date": "Apr 27, 2014", "message": "Beautiful. Meta has always been one of the most important thing that make our network work.So in a word it is very nice.<a href=\"http://getajobstaffing.weebly.com/\" rel=\"nofollow\">Weebly natwork marketing in North America\n</a>"}, {"author_name": "Laurence Gonsalves", "gravatar_hash": "fe40b570b44ed39f4a06ac913af1ec2b", "author_url": "http://xenomachina.com", "date": "Apr 28, 2014", "message": "@Shog: In my experience, the old meta.stackoverflow (and new meta.stackexchange) was far from being \"a place where we can listen to y’all tell us how wrong we are\". It was more like a place for user suggestions to get shot down, and bad existing behavior to be justified.\n\nSort of like how you're defending the old and broken behavior in the name of reducing complexity, when in reality making meta.stackoverflow behave like all of the other metas is the less complex option in the long run.\n\nI see a lot of people complain about the negativity of StackOverflow, but it's *nothing* compared to the old meta. Were there any suggestions to split meta that weren't downvoted into oblivion?"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "May 01, 2014", "message": "Yes, many @Laurence. It was a persistently popular idea. And as with many such ideas, there were also quite a few duplicates that didn't add anything to what had already been discussed and got shut down and redirected to an existing discussion. \n\nYou're right though: in the long run, this will be better. Not necessarily less <i>complex</i>, but more useful. The cost of implementing it was high enough to delay it being done for quite a long time past the point where it was clear that it had become necessary; that's just an unfortunate consequence of building a large system with a small team. There are advantages, but also trade-offs and missed opportunities."}]}