{"response": [{"author_name": "Chad", "gravatar_hash": "d2f14b7c252d0223dffd78b2eab0932f", "author_url": null, "date": "Apr 08, 2014", "message": "Have you considered adding a timer to the protection.  Let it fall off after 3-7 days unless a mod says make me permanent?"}, {"author_name": "David Thomas", "gravatar_hash": "3c89927e3ef6cdc985624637217867c3", "author_url": "http://stackoverflow.com/users/82548/david-thomas", "date": "Apr 08, 2014", "message": "As a non-moderator, how  should I ascertain whether attention is 'recent' in order to meet the unprotecting criteria?"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Apr 08, 2014", "message": "@Chad\n\nWhy would you want to do that?  Bikeshed questions don't get any better with age."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Apr 08, 2014", "message": "We've considered it, @Chad. Not convinced it's necessary just yet though - would like to see how willing folks are to remove it when unnecessary first. There are a lot of questions that will tend to attract noise in perpetuity, so a fair number of existing questions would need perma-protect anyway."}, {"author_name": "Michael", "gravatar_hash": "cd0165a88a06fc92a36f222606f17a11", "author_url": null, "date": "Apr 08, 2014", "message": "Is there a mechanism to discover protected questions other than googling for them? In the 10k tools for example, maybe a list of recently protected questions or a list of questions protected for more than &gt;=N days with &lt;=N views or some such thing. Clearly this would have to be thought through better than I have here, to prevent Wikipedia-style edit wars protecting and unprotecting if they were more visible outside of organic discovery..."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Apr 08, 2014", "message": "Outside of the 10K tools (which should suffice for general oversight - you need 15K to <i>do anything about it</i> if there's a mistake), I'm not aware of any tools for listing these, @Michael."}, {"author_name": "G M", "gravatar_hash": "29470b2fa544111600d417fb08b21d69", "author_url": null, "date": "Apr 09, 2014", "message": "Why don't let the user post the answer but wait until the other users with a privilege accept it and only then post it with the others answer."}, {"author_name": "Toon Krijthe", "gravatar_hash": "0b4b433679e1fb52f7e2ef4ea492496d", "author_url": null, "date": "Apr 09, 2014", "message": "Right now, you can only unprotect a question you have protected. \n\nAre there any plans to unprotect all for all 15k users? This would be useful when you encounter protection that needs to be removed.\n\n<blockquote>Yes, this is done - guess I didn't call it out blatantly enough in the post. --Ed.</blockquote>"}, {"author_name": "Aditya Patil", "gravatar_hash": "d7c08b07a7828cbd5fdc509a3b046ea7", "author_url": null, "date": "Apr 09, 2014", "message": "Fine with all the stuff in this post, but what are the \"new\" changes(I came here from AU because I thought there are some new changes been made, but I don't find any in the blog).\n\n<blockquote>I've added a bit of text to indicate which behaviors are <i>new</i>. So much for a quick'n'dirty post! --Ed.</blockquote>"}, {"author_name": "Al S", "gravatar_hash": "78eabf31eb20f8146f66df1dd2fa568c", "author_url": null, "date": "Apr 09, 2014", "message": "G M's idea is a very good one. Rather than locking new users out completely, how about new answers from new users on protected questions go into something like the edit queue, so established users can check and approve, edit or deny them as appropriate?\n\nPlease bare in mind that not all SE sites are StackOverflow: while it's often true that a typical 1 rep StackOverflow user writing an answer on a much-linked-to question will be usually a novice or non-professional, on most other StackExchange sites which aren't yet behemoths and household names in their industries, 1 rep new users following links from blogs etc are often valuable, knowledgable professionals with lots to offer who have only just discovered the site and could become valuable users - if we don't greet them by telling them to go away.\n\nCompletely locking out new users from popular questions, rather than allowing a slower moderated route in, causes much more damage to community development for smaller sites than it does to SO."}, {"author_name": "Rachel", "gravatar_hash": "01b235a8024b2dd10f427c301c876a0b", "author_url": "http://rachel53461@wordpress.com", "date": "Apr 09, 2014", "message": "@David If you're looking to see a timeline of post activity, you can use  the url <code>site.stackexchange.com/posts/&lt;questionId&gt;/timeline</code>. For example, http://meta.stackoverflow.com/posts/226619/timeline\n\nTypically for me that just means going to a question, changing the word \"questions\" in the url to \"posts\", and replacing anything after the questionId/ with \"timeline\""}, {"author_name": "Duncan", "gravatar_hash": "32b712ec4f7dcc2e8a6907b9903aa8ba", "author_url": "http://stackoverflow.com/users/474189/duncan", "date": "Apr 10, 2014", "message": "@Rachel The important thing is whether the protected status is still preventing bad things from happening. I'm not sure how I would determine that from the link you suggested."}, {"author_name": "panabar", "gravatar_hash": "04be6c1b7d5e6df9fcefd18af7ebf03d", "author_url": null, "date": "Apr 10, 2014", "message": "hello\nI need sane one good experience category design"}, {"author_name": "zzzzBov", "gravatar_hash": "248d820c4cc1b6eb7924c658c45443b5", "author_url": "http://zzzzbov.com", "date": "Apr 10, 2014", "message": "So with all the focus on Protected Questions, is there a chance that the [protected question message can get updated](http://meta.stackoverflow.com/q/210481/153542)?"}, {"author_name": "damryfbfnetsi", "gravatar_hash": "8efc875cafcdabb7323e2f5c628d49bd", "author_url": null, "date": "Apr 11, 2014", "message": "@zzzzBov The message has changed. It now says (for new users) \"Thank you for your interest in this question. Because it has attracted low-quality answers, posting an answer now requires 10 reputation on this site. [paragraph space] Would you like to answer one of these unanswered questions instead?\""}, {"author_name": "damryfbfnetsi", "gravatar_hash": "8efc875cafcdabb7323e2f5c628d49bd", "author_url": null, "date": "Apr 11, 2014", "message": "I think that a new bullet should be added to the Community user's bio:\n\nI do things like\n• Randomly poke old unanswered questions every hour so they get some attention\n• Own community questions and answers so nobody gets unnecessary reputation from them\n• Own downvotes on spam/evil posts that get permanently deleted\n• Own suggested edits from anonymous users\n• **Protect questions that attract spam/low-quality answers from new users**\n• Remove abandoned questions"}, {"author_name": "Sofia Rhodes", "gravatar_hash": "2a1d846a7b9eaa612adf6f7ddc83a8e8", "author_url": "http://www.vlondoncity.co.uk/author/sofiarhodes/", "date": "Apr 14, 2014", "message": "Nice and useful stuff, but i could not find the changes.What are the new changes?"}, {"author_name": "gurpreet", "gravatar_hash": "475ed4ab7c21c15602e0e75340acf5d4", "author_url": "http://www.earnonlinee.com", "date": "Apr 18, 2014", "message": "good day , nice stuff usefull info shared here thanks for sharing ."}, {"author_name": "Akustik", "gravatar_hash": "cfac9d320cf31b76150deee2fbdec722", "author_url": "http://www.sesizolasyonu.com", "date": "May 07, 2014", "message": "What are the new changes?"}]}