{"response": [{"author_name": "Tieson Trowbridge", "gravatar_hash": "5990edb0cd45a208e3a938b410831e5c", "author_url": "http://tiesontrowbridge.com", "date": "Apr 24, 2014", "message": "Point #3 on the \"New Features\" contains a broken link. Just FYI\n\n<blockquote>Thanks - fixed. --Ed.</blockquote>"}, {"author_name": "Kevin Luddy", "gravatar_hash": "184b63e337507d572ec48c05d32b65c1", "author_url": "http://t.kevinluddy.com", "date": "Apr 24, 2014", "message": "While listening to the +StackExchange podcast yesterday, at the exact moment they were talking about a way to visualize cars driving hats around, this car pulled up next to me...﻿\n\nhttp://goo.gl/s6RZ0t"}, {"author_name": "M", "gravatar_hash": "cd0165a88a06fc92a36f222606f17a11", "author_url": null, "date": "Apr 24, 2014", "message": "There was a pretty good episode of the PBS children's show \"Arthur\" in which the dog and the baby travel through the clothes dryer and into the \"Sock Exchange\" where socks lost in the laundry go to be traded on the Sock Market. http://en.wikipedia.org/wiki/List_of_Arthur_episodes_(season_7)\n\nSo Joel's onto something."}, {"author_name": "Roland", "gravatar_hash": "10595ff0d78c1c61dfda5ee37152b6d7", "author_url": null, "date": "Apr 25, 2014", "message": "As one of the [MESE](http://matheducators.stackexchange.com/) committers, I am delighted by the fact that MESE is mentioned, but I feel a bit underrepresented, especially when comparing the info with the other sites mentioned. Is there something the MESE community can do to go beyond \"yet another math site\" in your and your reader's perception?"}, {"author_name": "Avi D", "gravatar_hash": "a88248f632c039340efa02505be355e5", "author_url": null, "date": "Apr 25, 2014", "message": "Actually, the Security.SE name change was about *widening* the scope, NOT narrowing it.    \n\nIt was originally named \"IT Security\", which connotes a bit of a narrower focus than any type of information, regardless of where and how it is stored.  \n(The URL was not changed, either way the domain was \"security.se\"...) \n\nOh and btw, re Joel's signoff - we have a few really good questions about that type of \"complex\" passwords.... :-)"}, {"author_name": "Jay Hanlon", "gravatar_hash": "7b525bc6c12773131e9bd6ef5b766a6f", "author_url": null, "date": "Apr 25, 2014", "message": "@roland, jaydles here.  Don't feel underrepresented - the sites we feature in depth are more mature ones.  Math Educators was covered as one of our new \"public betas\", which are pretty much always shorter overviews, and in this case, the point was how impressed we've been with your community engagement, and how wrong I was about the scope being off.  Good reminder of why, whenever we're in doubt, we should defer to community's view of what they need..."}, {"author_name": "e-sushi", "gravatar_hash": "082feba3d01261803ee532b566b2dd60", "author_url": "http://www.e-sushi.net/", "date": "Apr 25, 2014", "message": "Not wanting to nit-pick here, but the closing line states: \n\n“…brought to you by Hearbleed – the first…”\n\nUnless my ears should start bleeding due to a newly discovered bug, that’s a typo missing a “t” in there. ;)\n\n<blockquote>I really suck at proofreading. Fixed! --Ed.</blockquote>"}, {"author_name": "Brian Rushton", "gravatar_hash": "c55f8151bc25e976ee83a29a7c7cf97f", "author_url": null, "date": "Apr 27, 2014", "message": "Everytime that Math Educators does something incrediblem like get 8 people at 3000 reputation at 46 days, or get a question with 24,000 views, or attract large numbers of new users each day including famous bloggers and researchers, or getting some of the highest answer/question ratios on the network, I like to check for any sort of recognition from the SE team on meta, or meta.stackexchange, or on the blog posts. Finally, we were mentioned in the podcast. \"Doesn't it look like they are going to run out of questions soon?\"  Meanwhile expats is one of the worst new public betas. What a joke."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Apr 27, 2014", "message": "It's not a zero-sum game, @Brian."}, {"author_name": "Brian Rushton", "gravatar_hash": "c55f8151bc25e976ee83a29a7c7cf97f", "author_url": null, "date": "Apr 28, 2014", "message": "@Shog9 Well, you're right, and looking at my comments, I'm embarrassed that I was so petty. I'm sorry; I actually like expatriates. I was just disappointed that many people think so poorly of a site that I've put a lot of time into and think is pretty good."}, {"author_name": "nadrimajstor", "gravatar_hash": "ff802135d161b3c16a669c28a3bb7239", "author_url": null, "date": "Apr 28, 2014", "message": "Yugo\nhttp://upload.wikimedia.org/wikipedia/commons/e/e7/Yugo.jpg"}, {"author_name": "Jay Hanlon", "gravatar_hash": "71bb9b543b69ec8dd5c59238697c6f2d", "author_url": null, "date": "Apr 29, 2014", "message": "@brian, don't let Joel and the rest of our silly idiocy get you down - the real point was that you guys are doing great, and that my initial view that the scope was off was dead wrong."}, {"author_name": "KiZi", "gravatar_hash": "26e7111998194f600943a96735f38e18", "author_url": "http://www.kizihot.org", "date": "May 18, 2014", "message": "Heartbleed not only affects the error on the web and online payment services, Heartbleed dangerous vulnerabilities also affect the Android mobile platform by Google. Estimates there are millions of Android devices have gotten this serious security flaws. I'm looking for how to fix it.than'k post.!"}]}