{"response": [{"author_name": "Undo", "gravatar_hash": "9278dc00e1a8755dc2de02b6a908a15a", "author_url": null, "date": "Apr 22, 2014", "message": "This is awesome. Goodbye, annoying robots!"}, {"author_name": "allquixotic", "gravatar_hash": "3e53e57f97ff1a63f41e421818d4836b", "author_url": null, "date": "Apr 22, 2014", "message": "About time! This was a CW that I felt shouldn't have been made a CW, because there were only about 3 truly meritorious answers, while the rest were just people providing about 10% of the explanation and trying to get some easy rep from a question that got a lot of views.\n\nhttp://superuser.com/a/565974/144607\n\nThis change addresses this and prevents it from happening in the future. That CW cost me a lot of rep at the time. :P"}, {"author_name": "Jakub Narębski", "gravatar_hash": "672aa8b373071ef9f06db563d1c08d77", "author_url": null, "date": "Apr 22, 2014", "message": "That's nice... though too late for me.  One of my most voted up answers got automatically converted to community wiki because it was created in pieces, with many edits extending it, partly for [perceived] safety (to not loose thousands of lines of written response), partly because of ongoing research."}, {"author_name": "Mason Wheeler", "gravatar_hash": "50facfccdffe2e9cabaa589205959d30", "author_url": "http://tech.turbu-rpg.com", "date": "Apr 22, 2014", "message": "Thank you! Those robot-slaps did definitely get annoying."}, {"author_name": "Uwe", "gravatar_hash": "53a82f701ae492808834e621de2586eb", "author_url": "http://www.zeta-producer.com/", "date": "Apr 22, 2014", "message": "Too bad the automatic transitions aren't reverted, at least on my article on serverfault.com (maybe this would only happen on stackoverflow.com?!?)"}, {"author_name": "Troyen", "gravatar_hash": "38c4716a36624814c1e0c7fd527150a9", "author_url": null, "date": "Apr 22, 2014", "message": "Uwe, flag a mod and they can revert if it they decide it was an unfair conversion."}, {"author_name": "vzn", "gravatar_hash": "b7026b87c51690329e9ef5b74928bbfb", "author_url": "http://vzn1.wordpress.com", "date": "Apr 22, 2014", "message": "glad to see you somewhat addressing this confusing aspect of stackexchange that has tripped up many. however, is there a community wiki where the question is wiki but answers arent? for me, community wiki posts are actually strong reasons *not* to collaboratively edit the posts or add answers, because there is *no rep credit*..... feel like that still needs some basic/major rethinking there!"}, {"author_name": "Matthew Read", "gravatar_hash": "9f45abdea17c709041812609c7fdfb69", "author_url": null, "date": "Apr 22, 2014", "message": "CW will never make sense.  Consider leftover cases: Like where one person maintains someone else's answer long term.  They get no rep, and the OP gets undeserved rep long-term unless someone makes it CW and we all lose."}, {"author_name": "Anonymous", "gravatar_hash": "146e55a02f418a3f5d351af7806db488", "author_url": null, "date": "Apr 22, 2014", "message": "This addresses the most annoying part of CW. However, I still think there are unresolved problems, e.g. it is not clear what change (if any) has taken place regarding the reputation. The fundamental problem is using a single kind of votes that both represents the interest in the question and the contribution of the author. Sometimes users are interested in a question so they upvote it, however the question didn't require much effort on the part of the author. Removing the reputation from CW is often abused for this purpose. The problem with CW is unlikely to be resolved until the issue of votes represent these two not strongly correlated concepts is properly addressed."}, {"author_name": "nyuszika7h", "gravatar_hash": "b1e6b52622c80c9a0ef78a76080f5af1", "author_url": null, "date": "Apr 22, 2014", "message": "Anonymous, isn't that what the star is for?"}, {"author_name": "Andrew", "gravatar_hash": "77efcaefdc62a601d1f0cb506085bca5", "author_url": null, "date": "Apr 22, 2014", "message": "The issue that bugs me the most at the moment is the fact that users (such as myself), that do not have sufficient reputation, are unable to contribute.  Just now I wanted to comment on an issue and add what I felt was some useful information.  I cannot because I don't have the 50 points required.  The net result?  Everybody loses.  The information doesn't get passed on, and I get frustrated and lose interest in helping others.  A relatively small number of \"super posters\" take over control - we've all seen them - those with many thousands of points.  Do they really have ALL of the answers?  \n\nWho knows how many others like me simply decide to no longer bother trying to contribute?\n\n<blockquote>Comments are borderline useless unless you're active on the site in other ways. I know, I know, they look so enjoyable, like farm labor in truck commercials... It's all a lie, they're not. If you have useful information, post it in the form of an answer - that is, explain <b>how</b> it's useful <i>in terms of answering the question</i>. Do this a few times, and you'll even have the opportunity to find out how awful comments are for yourself. --Ed.</blockquote>"}, {"author_name": "VonC", "gravatar_hash": "4fc12eea3fb81ede59d064d0fdbb84ab", "author_url": "http://stackoverflow.com/users/6309/vonc", "date": "Apr 22, 2014", "message": "Yay @JakubNarębski, you got your answer back (http://stackoverflow.com/a/1599930/6309), thanks to moderator Grace Note♦!\n\nI remember that post well (Git and Mercurial - Compare and Contrast, Oct. 2009): it was and still is an awesome answer.\n\nDoes that mean we can start mentioning (in meta perhaps) our old questions that got eventually converted to CW? (like http://stackoverflow.com/a/272595/6309)"}, {"author_name": "Doorknob", "gravatar_hash": "bf5ae1189f8b36ece8fcdc2e2e761104", "author_url": "http://keyboardfire.com/", "date": "Apr 22, 2014", "message": "This is definitely a huge help for Programming Puzzles &amp; Code Golf, as we often get challenges with a lot of answers that are hit by auto-CW. Hooray!"}, {"author_name": "Athari", "gravatar_hash": "911580f86f620825b4ebaad5c68012a1", "author_url": "http://snowlands.ru/en/", "date": "Apr 22, 2014", "message": "Community Wiki seems completely redundant to me. Anyone can edit any post, the only difference is that contributions from low-rep users need to be approved.\n\nCW was used as a protection from bumping, which is stupid, so I'm glad to see it go away. But what's left now? There's zero incentive to mark your own post as CW. There never was. \"Compiling a reference\", \"consolidating the knowledge\"? Really? That's bulls**t, if you ask me.\n\n<blockquote>I know, right? Back in MY day, folks answered the same stupid questions 9,000 times every day and THEY LIKED IT. Kids these days, with their \"collaboratively-edited compendiums of useful knowledge maintained for the good of all humanity\" - bah humbug, I say! --Ed.</blockquote>"}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Apr 22, 2014", "message": "Sounds good, long overdue!  Next up, have a look at duplicate closes :)"}, {"author_name": "Grace Note", "gravatar_hash": "f2a931b98d958009eb7249623064d06e", "author_url": null, "date": "Apr 22, 2014", "message": "There are a lot of automatically converted posts out there. There's a portion of them, of unknown fraction, which should not have been converted. But they were because, well, as said earlier, we are dumb.\n\nWe thought, while making this change, about implementing some kind of script to de-convert the good stuff. But that ended up pretty infeasible and would still require hours and hours of manual sifting. Not really reasonable.\n\nIt wouldn't be a bad idea to check with the moderators how best they feel to approach fixing up what needs to be deconverted. They'd be the ones doing the real legwork, so seeing what means of bringing attention and at whatever velocity and certainty that they feel it best, that probably would work nicely."}, {"author_name": "AsheeshR", "gravatar_hash": "909aa23f4e7adfa2519ac2697fda6f30", "author_url": "http://thecodeofmylife.blogspot.in", "date": "Apr 22, 2014", "message": "Why do we continue to put so much focus on community wikis? In many cases, instances of CW questions could and should actually be in the Tag Wikis. If anything, tag wikis need to get more attention in general than the already very controversial and problematic CWs.\n\nhttp://meta.stackexchange.com/q/179500/200868\nhttp://meta.stackexchange.com/q/188197/200868\n\nMany users (who know about CW) don't even know Tag Wikis exist!"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Apr 22, 2014", "message": "The problem we've run into every time we've tried to sketch out a design for better tag wikis has been that... Well, they start to look a lot like CW posts, @AsheeshR!\n\n- Add linkable sections or sub-pages with distinct titles to combat the \"this thing is too long to read\" problem.\n- Add search indexing\n- Lower the bar to editing / increase the number of folks reviewing edits\n\n...All good things, some of which should still probably happen (why the hell did we not index these) - but the further down that path we go, the further we get from the notion of a tag-specific directory and the closer we get to... Well, a normal post, albeit one with special editing / rep rules. \n\nSome day, perhaps they'll just converge."}, {"author_name": "Skyhawk", "gravatar_hash": "5fa69a5e1da2f87ac30b62293208d55a", "author_url": null, "date": "Apr 22, 2014", "message": "The \"no credit\" aspect of voluntary CW designation bewilders me. I designated a lot of my early questions and answers as CW, thinking that was a friendly and trusting thing to do as a new member of a community. Some of these got lots of upvotes, and only then did I realize that my effort to be a good citizen had denied me the reputation points that I had earned."}, {"author_name": "Christian Rau", "gravatar_hash": "8dbcb7c2b8ab0d089201052433afff92", "author_url": null, "date": "Apr 23, 2014", "message": "Wow, for someone who usually revises his answers a thousand times shortly after posting that definitely needed to be done. Finally no more moderator flags to revert stupid robot actions. Thanks."}, {"author_name": "Muz", "gravatar_hash": "ff37915c58e1ad2c48dbaa0a64580499", "author_url": null, "date": "Apr 23, 2014", "message": "Now if you'd just convert that wiki-ed 161 upvote answer on SO into points for me, I'd be happy :P\n\n(But I don't really mind since it's helped a lot of people in wiki format. Still... 1610 points is a lot.)"}, {"author_name": "[Enter Random Name Here]", "gravatar_hash": "d6d904021bf50ecbc3c4f1f5394aa578", "author_url": null, "date": "Apr 23, 2014", "message": "&gt; …someone who usually revises his answers a thousand times shortly after posting…\n\nOh, I’m not the only one fiddling with edits to fine-tune answers? Good to know! ;)"}, {"author_name": "[Enter Random Name Here]", "gravatar_hash": "d6d904021bf50ecbc3c4f1f5394aa578", "author_url": null, "date": "Apr 23, 2014", "message": "What? No MarkDown support in this comment area?  \nPlease put that on your to-do list…"}, {"author_name": "Assaf Lavie", "gravatar_hash": "9d6269c9d53bb17f3e27bedafe5aea86", "author_url": null, "date": "Apr 23, 2014", "message": "Still feels wrong. Community wikis are a second-class citizen. Why shouldn't a user get rewarded for doing 90% of the collaborative work on some question or answer? SO is saying \"yes, invest more time than anyone does on a regular question, compiling results from other answers, editing and reediting over time, and get nothing in return in terms of recognition\".\n\nBoo! \n\nWhy not get creative - show a treemap of contributions by editors, or something? Show contributions over time, like Github. Rep isn't an evil thing. It's a motivator and it's fun. By excluding collaboration from the rep game you're just stomping down collaboration."}, {"author_name": "Luke Stanley", "gravatar_hash": "7ba33fdcf3b9f2658839421ea0d1d67f", "author_url": null, "date": "Apr 23, 2014", "message": "Not sure the alt text is right for the barn raising pic!"}, {"author_name": "طراحی سایت سنندج", "gravatar_hash": "a301e551bac70bdcd27dc48cea26f825", "author_url": "http://www.idea-soft.ir", "date": "Apr 24, 2014", "message": "Good article, thanks for sharing such a good stuff."}, {"author_name": "Lightness Races In Orbit", "gravatar_hash": "3189f1e006358ec6c65481b9605cd0e3", "author_url": null, "date": "Apr 24, 2014", "message": "Those people are far too well-to-do to have come from the Lounge."}, {"author_name": "Xeo", "gravatar_hash": "eb538603c2b80ea703e92abf5b45c791", "author_url": "http://stackoverflow.com/users/500104/xeo", "date": "Apr 24, 2014", "message": "&gt; rare image of the Lounge working on The Definitive C++ Book Guide and List\nWe are famous!\n\nAlso, nice avatar @GraceNote. :)"}, {"author_name": "R. Martinho Fernandes", "gravatar_hash": "f64914b68ff9076e46156c07c96e890f", "author_url": "http://flamingdangerzone.com", "date": "Apr 24, 2014", "message": "The racist remarks against robots on this page are a bit unsettling. Hope you're not first against the wall when the revolution comes."}, {"author_name": "Paul", "gravatar_hash": "cdf82fcf174272f3a6c70021ac3210e4", "author_url": null, "date": "Apr 24, 2014", "message": "Being a newbie here on SO what if people thought less about the rep gained/lost and just focused on the bigger picture - is this too quixotic?"}, {"author_name": "Daniel Earwicker", "gravatar_hash": "0256f9dfdd00ce1d37ab3f70abc561f3", "author_url": "http://earwicker.com", "date": "Apr 24, 2014", "message": "I find SO these days to be actively hostile to questions that would once have been marked CW. Such questions now get closed as \"too broad\" within a couple of minutes. Someone will comment that this isn't the type of question that is worth asking on SO.\n\nSame goes for a newbie question that needs help being improved. Instead of helping them fix the question, they are \"assisted\" by having their question closed immediately."}, {"author_name": "Natasha H.", "gravatar_hash": "91825ef332db3a2eab0d9ac0ed425249", "author_url": null, "date": "Apr 25, 2014", "message": "The reputation caste system defiantly needs some improvement in both wiki and forums. Like Daniel has pointed out the current one is prone to chase newbies and the like away from this website and onto other ones. Why not when their questions get closed down on the broadest of terms and within minutes? \n\nWho wants to use a website where questions relevant to the topic aren't even allowed to be asked? That defeats the purpose of Stack Overflow and it's something that the devs on this site need to adjust.\n\nPut the 'community' back into StackFlow. In other words, friendliness and openness."}]}