{"response": [{"author_name": "sup", "gravatar_hash": "1d76ce3e3207c1eb8f9f83924d815dad", "author_url": null, "date": "Oct 07, 2014", "message": "&gt; while reasonable edits may be rejected for many reasons outside of your control\nPlease name a few?\n\n<blockquote>Edit collisions for one. If someone else submits an edit while yours is pending review, yours will be automatically rejected. --Shog9</blockquote>"}, {"author_name": "J. Musser", "gravatar_hash": "cdc56124cfb5230a7b666cb7ad6ead9b", "author_url": "http://gardening.stackexchange.com/", "date": "Oct 07, 2014", "message": "I particularly like the edit rejection reasons. I am active on GL (small beta site), so I don't yet have The Illuminator badge, but the  other two were easy. I was sceptical at first (it seemed we had plenty of badges already), but I think they are a good addition."}, {"author_name": "Care Bear", "gravatar_hash": "75402a8b88a7328ed75f27248c991390", "author_url": "http://math.stackexchange.com/users/147263/care-bear", "date": "Oct 07, 2014", "message": "\"C++ problem” or “Java doubt” would be blocked outright on Stack Overflow. \n\nEditing is important and badges are fun, but the question submission dialog could give more guidance to question writers, network-wide. So far, it seems that it only looks for appearance of \"you\" in the title, generating a warning about subjectivity. <a href=\"http://meta.math.stackexchange.com/q/16573/\" rel=\"nofollow\">I suggested to do more than that</a>.\n\n<blockquote><a href=\"http://meta.math.stackexchange.com/questions/16573/should-the-site-have-an-automatic-word-filter-for-titles/17012#17012\" rel=\"nofollow\">That's do-able too.</a> I'm all about useful titles. --Shog9</blockquote>"}, {"author_name": "Mark Erickson", "gravatar_hash": "5ecae50c4e29a4d18118ada1d417e7eb", "author_url": null, "date": "Oct 07, 2014", "message": "Thanks for the insight into StackExchange's preference about editing questions.  Up until now I've not done much question editing with the thinking that it was somehow rude to do so.  Incentivized by this blog post, I'll be doing more revising of questions with an eye for the question to be more discoverable and useful to future visitors."}, {"author_name": "Fabrício Matté", "gravatar_hash": "326fba1c2980ce0073f6b212acf71ea0", "author_url": "http://stackoverflow.com/users/1331430/fabr%C3%ADcio-matt%C3%A9", "date": "Oct 07, 2014", "message": "Awesome work! Keep it up, Stack Exchange. :)"}, {"author_name": "Erno", "gravatar_hash": "e5b03745134c5e1ebeb773053b047ca0", "author_url": null, "date": "Oct 07, 2014", "message": "&gt;&gt; Refiner - Edited and answered 50 questions (both actions within 12\n&gt;&gt; hours, answer score &gt; 0)\n\nMy first thought: who is going to edit and answer 50 questions, ALL within 12 hour...\n\nBut then it made sense; surely if someone is able to:\n\n&gt;&gt; Illuminator - Edited and answered 500 questions (both actions \n&gt;&gt; within 12 hours, answer score &gt; 0)\n\nis must be easy to do 50 in 12 hours."}, {"author_name": "Chris", "gravatar_hash": "3038142cea42b76065fd0e9462d6e210", "author_url": null, "date": "Oct 07, 2014", "message": "\"irrelevant tags\" for president! I can't count how often I saw edits which just added [string], [osx], ..."}, {"author_name": "Noah", "gravatar_hash": "7bbf2fadaebeb77eb32ed09203c8fcea", "author_url": null, "date": "Oct 07, 2014", "message": "I'm pretty comfortable with this change, but I'm a little concerned about the wording of \"no improvement whatsoever.\"\n\nImagine trying to make a contribution to a website, and then being told your contribution has absolutely no value to the community whatsoever. Kinda sounds like \"shut up and go away; you're not wanted here\" to me. I'm sure some users would read this correctly, but...\n\nJust my two cents."}, {"author_name": "carlspring", "gravatar_hash": "1a319d488294dc382be41fa8226e71c3", "author_url": null, "date": "Oct 08, 2014", "message": "Is the illuminator badge at all realistic? 100 answers and 100 edits in 12 hours could be possible, but 500? You should be completely stuck in Stackoverflow with this badge being the purpose of your life...\n\nJust saying..."}, {"author_name": "Rohit azad", "gravatar_hash": "76e03db06bb6dcf24f95bf4d354486db", "author_url": "http://www.rohitazad.com", "date": "Oct 08, 2014", "message": "nice ... i love stackoverflow."}, {"author_name": "Gaby", "gravatar_hash": "a3a6dc62f2c7a9e739e30479bf982d39", "author_url": null, "date": "Oct 08, 2014", "message": "on another note,\n\nthe featured link on stackoverflow (on the community-bulletin section) has a ?cb=1 to the address of this post (as it does to all links).\n\nBut the site loads very ugly when that url parameter exists.."}, {"author_name": "Gaby", "gravatar_hash": "a3a6dc62f2c7a9e739e30479bf982d39", "author_url": null, "date": "Oct 08, 2014", "message": "hmm .. might have been a temp issue.. failed for 5-8 refreshes. but now it is shown as it should.."}, {"author_name": "Arno", "gravatar_hash": "7fa738ef24eea8ede9ff0127728ee621", "author_url": null, "date": "Oct 08, 2014", "message": "I agree with @noah. Please consider toning down the headline and the content of \"no improvement whatsoever\". I feel it's too harsh for the same reasons and also reminds me of the high-minded put-downs which so discourage newbies on Wikipedia. I don't see this kind of culture at all on Stackoverflow and it would be a pity if it started seeping in now."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.billthelizard.com", "date": "Oct 08, 2014", "message": "@Noah and @Arno,\n\nI think the \"no improvement whatsoever\" wording is mildly harsh by design. It should be used when people are trying to game the edit/reputation system by suggesting an inconsequential edit when there are substantial improvements that could be made. That kind of behavior should be discouraged."}, {"author_name": "Flimm", "gravatar_hash": "936383b387d6cc6d51279e429e5d7cd9", "author_url": null, "date": "Oct 08, 2014", "message": "I really like the new edit reasons. For comparison, here are the old edit reasons https://i.stack.imgur.com/VNKmG.png\n\n\"Invalid edit\" was too vague, it left reviewers too much room to reject good enough edits for whatever reason they wished. \"No improvement whatsoever\" makes it clear that goodish edits are acceptable, only bad edits should be rejected.\n\nI've developed the opinion that there needs to be more feedback for the reviewers. Reviewers can reject edits for really bad reasons, and only low-rep users suffer from this, which means it goes unnoticed by high-rep users, who are the ones who suggest changes to SE. At the very least, I think moderators and the original author of the post should be able to accept previously rejected edits, which they currently cannot do, in which case the reviewers who rejected it should get notified, so that they realise they are being too harsh."}, {"author_name": "Zack", "gravatar_hash": "dd7cc06b1b1c347e172c6ba532937173", "author_url": null, "date": "Oct 08, 2014", "message": "I mostly like these changes, but I might miss \"copied content.\"  Can I suggest that \"spam or vandalism\" be expanded to \"spam, vandalism, or plagiarism\" ?8\n\n<blockquote>\"copied content\" still exists - but it's only shown when reviewing edits to tag excerpts and wikis. Those were the primary sources of plagiarism in *edits*, so restricting it to those should help emphasize its importance. For the rare case of plagiarism in question/answer edits, just use \"causes harm\" and link to <a href=\"http://meta.stackexchange.com/help/referencing\" rel=\"nofollow\">/help/referencing</a>. --Shog9</blockquote>"}, {"author_name": "TylerH", "gravatar_hash": "1cd9e6edf9f4defca0c0d5b68ac9cded", "author_url": null, "date": "Oct 08, 2014", "message": "&gt; for conscientious reviewers\n\nShould we be designing the process for any other type? I certainly hope not.\n\n<blockquote>We should design the system for the people who <i>are</i> using it, and design it to encourage the behaviors we hope to see. A big problem with the design up to this point has been... A broad lack of agreement within the community over what those behaviors were. Eventually, it becomes necessary to just pick a side rather than letting indecision hamstring further development - so, conscientious editors it is. That's annoyed a lot of folks who don't like to spend time on their reviews and don't like editing, but so far we seem to be getting by without them - we'll see how it pans out long term... --Shog9</blockquote>"}, {"author_name": "Martha", "gravatar_hash": "f86f8f8ff9e1217108e14251ba80ba60", "author_url": null, "date": "Oct 08, 2014", "message": "I don't know whether to be amused or depressed at the people who misinterpret the \"both actions within 12 hours\" clause to include all 50/500 answer+edits. (Hint: the word \"both\" means there are exactly two actions in question.)"}, {"author_name": "Arno", "gravatar_hash": "7fa738ef24eea8ede9ff0127728ee621", "author_url": null, "date": "Oct 08, 2014", "message": "@bill the lizard\n\nI don't question at all the need for a firm response in cases such as the one you mentioned. But should clearly unsocial behavior be echoed with a rude response? I don't think it's necessary, and, I feel, not likely to influence someone who is deliberately trying to game the system. Further, I feel that listing a response like this as an option may send a signal that Stackoverflow the kind of place that sanctions aggravated responses i.e. not a welcoming place for a newcomer.\n\nMy suggestion is not to change the substance of the message jn any way – just the tone. For example:\n\n- No improvement\nThis post fails to make the post easier to read, easier to find or more accessible. The changes are unnecessary or actively harm readability.\n\nI don't think this response is in any way less firm. But the tone is different."}, {"author_name": "tmyklebu", "gravatar_hash": "a0991b9f14a94a126187ac3aa342d3d2", "author_url": null, "date": "Oct 08, 2014", "message": "The new reasons are a major improvement.  Thank you!"}, {"author_name": "Kass", "gravatar_hash": "343709a3d1f2dd42333d0f8fe567dad3", "author_url": null, "date": "Oct 08, 2014", "message": "@Martha I keep shaking my head all these comments as well. Maybe the badges need a bit of clarification but they don't expect you to edit and answer 500 questions all in 12 hours. They mean this:\n\nEdit a question. Answer a question. Do this within 12 hours.\n\nRepeat 500 times.\n\n\nI'm just confused, is this supposed to be the same question? So I have to edit Question A and answer it? Or can I edit Question A and answer Question B?"}, {"author_name": "Jay Hanlon (jaydles)", "gravatar_hash": "7b525bc6c12773131e9bd6ef5b766a6f", "author_url": null, "date": "Oct 08, 2014", "message": "@noah, the strong wording of \"no improvement whatsoever\" was actually chosen as a signal to the *reviewer*.   We felt that small, but useful edits were often getting lumped in with completely noisy or abusive ones, so the strong language was actually intended to ensure that people making small improvements *don't* get told that they weren't helpful at all, even if the reviewer felt more editing would be even better.\n\nIn theory, the language is supposed to make it very rare that anyone making small, useful changes sees it."}, {"author_name": "Adam Zuckerman", "gravatar_hash": "8360387f7a7660cc2c0ba013572ba898", "author_url": "http://Programmers.SE", "date": "Oct 08, 2014", "message": "What about the small changes that are made to improve spelling, grammar, and incorrect English? A lot of the edits I make are specifically changing where the OP used \"i\" (first person pronoun) instead of \"I\". Should these be rejected as completely superfluous?\n\n<blockquote>There's no hard rule here - there <i>can't be</i>, as sometimes such edits are critical, while in others they are superfluous. Read each edit in context, and ask yourself: does it make the post <b>better?</b> --Shog9</blockquote>"}, {"author_name": "Chris", "gravatar_hash": "3038142cea42b76065fd0e9462d6e210", "author_url": null, "date": "Oct 08, 2014", "message": "@Adam: If you only make the I upper case, but don't fix other obvious reason, I would reject it. In my opinion it doesn't make it easier to read, easier to find or more accessible."}, {"author_name": "TylerH", "gravatar_hash": "1cd9e6edf9f4defca0c0d5b68ac9cded", "author_url": null, "date": "Oct 08, 2014", "message": "Also, while the combination of #2 and #3 might give reviewers \"more\" power, #4 decidedly hamstrings them by greatly confining the reasons for which we can reject an edit."}, {"author_name": "Ellie Kesselman", "gravatar_hash": "8cce7b70d30f42045bc6c8569f5549e2", "author_url": "http://myindigolives.wordpress.com", "date": "Oct 08, 2014", "message": "Both of these,<blockquote>Refiner – Edited and answered 50 questions (both actions within 12 hours, answer score &gt; 0)</blockquote> and 500 for Illuminator need rewording! @Kass's description, a snippet of it, is a good start! I didn't even understand @Martha's description (maybe that's my fault though :o"}, {"author_name": "Noah", "gravatar_hash": "7bbf2fadaebeb77eb32ed09203c8fcea", "author_url": null, "date": "Oct 08, 2014", "message": "@jaydles That... does indeed make a lot of sense, and I can definitely see how that makes itself apparent in the implementation of this change. I definitely agree with this component of it.\n\nHowever, it's really important to note that it's _not_ just the reviewers who are looking at these review messages. There are two sides to this: there's the reviewer's perspective, and then there's the suggester's perspective, and the suggester would frequently be seriously off-put by this message.\n\nI definitely understand the need for the change, though. The first solution that comes to mind is to show different messages to different people, but... I'm not totally sure. I'm confident that this is an issue, though. Just not completely sure how to solve it.\n\n<blockquote>We considered adding separate guidance for reviewers and editors, but that'll have to wait - the primary goal right now is to see if we can make these unambiguous enough to be used <i>consistently</i>, as without that it hardly helps to elaborate on them. Frankly, engineering the system to be inoffensive when it's misused is somewhat fatalistic - if folks are using this reason to reject edits that are making real, <b>solid</b> improvements... Then we have a bigger problem. --Shog9</blockquote> "}, {"author_name": "ouflak", "gravatar_hash": "380bf7e0e66a0c863ac54bed39d5886d", "author_url": null, "date": "Oct 09, 2014", "message": "Does this in anyway affect the audit process? If I get an audit question, and decide to edit it or comment on it, will this still count as a 'failed'? Even if the edit was going to be a valid one or the comment a positive useful comment?\n\n<blockquote>It fixes an edge case for suggested edit audits where the reviewer wishes to edit: <a href=\"http://meta.stackexchange.com/questions/169580/improve-treated-as-improper-response-to-proper-response-to-audit/239157#239157\" rel=\"nofollow\">“Improve” treated as improper response to proper response to audit</a>. --Shog9</blockquote>"}, {"author_name": "Matt", "gravatar_hash": "fbb4d027695dfdf76bf448b15d7e306a", "author_url": null, "date": "Oct 10, 2014", "message": "I'd like a way of rejecting or at least down voting edits that are NOT up for audit. I see sooooo many poor, careless, insufficient edits. Clearly people just use this as a way to rack up rep. But why should you get rep for doing a slapdash job of editing?"}, {"author_name": "Skippy le Grand Gourou", "gravatar_hash": "c880f325d3b581289aef2423ad3920fe", "author_url": null, "date": "Oct 10, 2014", "message": "\"We’re now notifying editors of past rejections\" makes me think it would be nice if past rejections *by other users on the post to be edited* were also notified when editing.  If three users tried to make the same edit as you before and all were denied, chances are yours won't as well…"}, {"author_name": "Tanmayi", "gravatar_hash": "8a93bb63579cd9303a70a1cd0a1cbc30", "author_url": "http://www.listdelhi.com", "date": "Oct 17, 2014", "message": "These new features really helps us. I love Stackoverflow. This website is always good in adding new features."}, {"author_name": "jack", "gravatar_hash": "ac42ce4c1744f341e66aa0bf6bb531ed", "author_url": null, "date": "Oct 17, 2014", "message": "Need to improve!!"}, {"author_name": "Smith", "gravatar_hash": "bcfe3aa6688b119b6e05e7917d7405e9", "author_url": null, "date": "Oct 17, 2014", "message": "Nice!!"}, {"author_name": "Budy K", "gravatar_hash": "7671a183b1ba128d0b11e15b144d8ad5", "author_url": "http://teknosains.com", "date": "Oct 24, 2014", "message": "its too bad the Imgur images are blocked in Country :("}]}