{"response": [{"author_name": "Dynamic", "gravatar_hash": "c87b87de5eb7fdec4d3d28ee9dc036ac", "author_url": null, "date": "Dec 24, 2012", "message": "He looks more like Will Wheaton... than Will Wheaton."}, {"author_name": "Tshepang Lekhonkhobe", "gravatar_hash": "88e60659e997d36af3ff348b3251e1a6", "author_url": "http://tshepang.net", "date": "Dec 24, 2012", "message": "Homepage url is what is labeled website on profile page?"}, {"author_name": "Isaac Moses", "gravatar_hash": "2bb572e05887045b95d99d8a5819eb14", "author_url": "http://mi.yodeya.com", "date": "Dec 24, 2012", "message": "Man, that title is *serious* false advertising. It's just plausible enough that you could have landed the real Wil Wheaton as a podcast guest, and that would have been really exciting.\n\nOn the other hand, I, for one, would have listened anyway, and I enjoyed hearing about your serious look at some of SO/SE's biggest usability issues."}, {"author_name": "Isaac Moses", "gravatar_hash": "2bb572e05887045b95d99d8a5819eb14", "author_url": "http://mi.yodeya.com", "date": "Dec 24, 2012", "message": "Hey, given that you said his name three times, shouldn't he have just showed up automatically anyway?"}, {"author_name": "Martijn", "gravatar_hash": "1d7a76fc62600ac7ccf57a511f5d3ae1", "author_url": null, "date": "Dec 24, 2012", "message": "Only when said backwards in a mirror."}, {"author_name": "LJLB", "gravatar_hash": "7bb3f4a5cc5cee347cb2a7535af42b93", "author_url": null, "date": "Dec 26, 2012", "message": "Interesting lineup of the team members.  Is it really hard to find developers who are black women who are qualified to do the job, or older people with experience who can fit in? I'm a triple minority running a small startup with two partners, who is allergic to affirmative action (I believe being qualified to do the job trumps skin pigment) and enjoys browsing through StackOverflow (although I don't answer many questions because it does take me a good long while to think about possible answers and others can answer these so much better than me).  Keep up the good work and best wishes for a successful 2013!"}, {"author_name": "Craig", "gravatar_hash": "cf855db26f72a03af1c4d31fc4ad5a78", "author_url": null, "date": "Dec 26, 2012", "message": "In regards to the ugly UX of submitting/creating a Gravatar, I would suggest you guys do something similar to the way http://annualcreditreport.com does there thing of getting access to your credit report from the three credit agencies. Basically it does some sort of div header that acts similar to an iframe without being an iframe."}, {"author_name": "John Dyer", "gravatar_hash": "0fc637a07270d4dfbf6958a281a5305e", "author_url": null, "date": "Jan 02, 2013", "message": "Hmm, One of the more interesting items was the discussion on Lucene and text search however no mention at all about that in the show notes. : )"}]}