{"response": [{"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Mar 19, 2010", "message": "Should we read anything into the fact that the cost of downvotes (to both the voter and recipient) isn't changing? Is there still a plan to increase them, or has that been shelved?\n\nEnquiring (and idle) minds need to know!"}, {"author_name": "NVL", "gravatar_hash": "3983438e2b3ae0258d247597301b6439", "author_url": null, "date": "Mar 19, 2010", "message": "Seems Fair Enough!\n\n&gt;We already discourage downvoting by making downvotes cost -1 rep to the casting voter\n\nSo, why not make downvotes cost -2 to voter."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 19, 2010", "message": "We have shelved any plans to increase the power of downvotes. Mostly because (ironically enough) I feel the proposed change would result in <i>fewer</i> downvotes being cast and that's bad.\n\nhttp://meta.stackoverflow.com/questions/7322/should-the-weight-of-downvotes-be-increased/42763#42763"}, {"author_name": "Robert MacLean", "gravatar_hash": "bf2af16812228b5a54daeb30c96efaf2", "author_url": "http://www.sadev.co.za", "date": "Mar 19, 2010", "message": "Demo Ggods strike again: one week before I use my StackOverflow points in a major demo they going to be recalc'd."}, {"author_name": "Omar", "gravatar_hash": "40bd6fa511aed8cab1e12bb104b88b4e", "author_url": "http://www.ohmz.net", "date": "Mar 19, 2010", "message": "i'm not complaining because i'm not to fussed about my rep so long as i don't lose the ability to do anything, but the will probably half my rep...\n\nI ask too many questions i guess..."}, {"author_name": "Gordon", "gravatar_hash": "f65024c57e12069c25a9bbfe2e1cf601", "author_url": null, "date": "Mar 19, 2010", "message": "What will happen to any user rights that might be invalidated by a drop in rep?"}, {"author_name": "Chris Leong", "gravatar_hash": "a8c9322c0aff859ec2ab977c728200d1", "author_url": null, "date": "Mar 19, 2010", "message": "Ouch. I agree that people who answer questions have done more to earn rep than those who ask, but the interaction of this with bounties will personally really hurt my rep. I have a rep of slightly less than 2000 with only 530 from questions. I have spent about 900 points on bounties, so my total gain from questions is about 2400 = a rep loss of 1200 (60%) down to 800. I am sure there are other people who have posted lots of bounties who will lose even more. I've got a lot of use out of StackOverflow, so this isn't going to reduce my usage, but there are a lot of other people who mightn't take it so well.\n\nI think that making only positive upvotes count towards rep would have been a much way to encourage higher quality questions, but since you've blogged about it, its pretty much certain to happen anyway."}, {"author_name": "Nathan Reed", "gravatar_hash": "1178609ba6835138fb8ae7f0a2eeffc2", "author_url": null, "date": "Mar 19, 2010", "message": "It feels pretty wrong to change peoples Rep retroactively. Fair enough to change the system, But to come along and steal a quarter of my rep when I havent done anything wrong is pretty fkd up."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 19, 2010", "message": "I'll lose reputation too -- but I think it's healthy for everyone to realize that rep is kind of an arbitrary concept, and think about what it means to them, to anyone else, and why.\n\nThat said, I believe this is a necessary change and will ultimately result in rep being a stronger, more practically useful number than it was before."}, {"author_name": "Sam", "gravatar_hash": "1d6b86488273310fc47ea40f31adb45b", "author_url": null, "date": "Mar 19, 2010", "message": "I think there is just as much, if not more, bad feeling generated by the attitudes of a) over-specificity; b) bias towards high-rep users. I'm not a particularly active user but often see this (not just affecting me). I think these are important points.\n\nYou make a website, you decide what's appropriate. Ultimately, fine, of course. Most friendly and productive? Not really. People looking for answers to programming related questions getting shut down engenders bad feeling. They see higher-rep users asking similar or even totally frivolous questions getting even more rep for doing so. Not nice.\n\nThere is no other decent place to ask, that was part of the point of creating such a great resource/community/business. \"Make your own if you don't like the rules, or start a stackexchange\". Sure, possible. But is a completely fragmented community really in the best interests of anyone except obsessive categorisers? A simple change from \"when in doubt, close and delete\" to \"when in doubt, leave\" would make it all a lot friendlier AND get more information to more people. Joel made this point several times: you already have voting/tags!\n\nThe subtle bias in favour of higher rep users also doesn't help with good feeling but more importantly, it has an effect on the meritocratic ideal of the site. People with rep have obviously achieved that \n\nI'm absolutely not blaming my low rep on these points (I simply don't use the site much). But I have seen communities ruined or weakened by this kind of exclusivity and unfriendliness. You can say: fine, but these things mostly only affect a small number of questions and small number of beginner or infrequent users. I say: it affects the quality of the site overall as both a nice place to be and an information resource. If you are willing to optimise for 6 users, logically this stuff matters too."}, {"author_name": "Sam", "gravatar_hash": "1d6b86488273310fc47ea40f31adb45b", "author_url": null, "date": "Mar 19, 2010", "message": "Sorry, was supposed to say \"have obviously achieved that... by giving good answers/asking good questions, but it becomes self-propagating. Inferior answers are sometimes voted up seemingly based on rep. I would say there's a case for something like hiding rep in answers.\""}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Mar 19, 2010", "message": "The business rules around reputation are getting awfully complicated. I hardly ever vote on answers now since the Electorate gold badge was introduced. I mainly vote on questions.\n\nCAPTCHA: accept trilogy"}, {"author_name": "Ian Ringrose", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Mar 19, 2010", "message": "Maybe some safety net is needed for people that are now over 2000, and goes a bit below 2000 after the recalc.   Something like.  Once you get “edit rights” you keep them provided your rep remains over 1500.\n\nAlso you are changing bounties a bit.  It use to be that if I put a bounty on a well written question I would often get the 50 reps back in up votes, this is now very unlikely to happen.\nThinking about bounties. I often set a bounty to give away all the rep I got on the question, now in retrospect it turns out I have given away more then I intended.\n\nBut after saying the above, I am far enough over 2000 that the recalc will not affect me personally in any bad ways."}, {"author_name": "Dan Singerman", "gravatar_hash": "88a93460e93e2c37a277caf48c405220", "author_url": null, "date": "Mar 19, 2010", "message": "I think this is a good move. 100% agreed with."}, {"author_name": "Kristof", "gravatar_hash": "d813e1a6fa1430f89c6508ab51743854", "author_url": null, "date": "Mar 19, 2010", "message": "I think that this is tackling the problem in a wrong way. I do not think asking questions should be discouraged. I believe that good questions should be rewarded in the same manner as good answers. \n\nAs for the problem with people who just ask many questions and end up with high reputation, as long as the questions are of a good quality I think no one would have anything against it.\n\nI think that the problem lays elsewhere. It is when someone who is asking very poor questions end up with a high reputation, and changing the up vote weight from +10 to + 5 will not completely solve that issue.\n\nCurrently  if a person asks a poor question that receives fro example 3 downvotes and 2 upvotes it earns them +14 points of reputation even though when you look at the question it shows -1. That is clearly wrong. And changing the upvote weight to +5 will only partiality reduce that problem. as a question with  3 downvotes and 2 upvotes will still earn the reputation +4\n\nI believe that the solution could be to change the way the reputation is earned, instead of counting every vote, simply take into account the vote balance on the question, in the mentioned example: 3 downvotes, 2 upvotes so balance 1 downvote - that is exactly what you see when looking at the question (-1). And that would earn -2 reputation\n\nmore on meta: http://meta.stackoverflow.com/questions/7322/should-the-weight-of-downvotes-be-increased/39054#39054"}, {"author_name": "Nathan DeWitt", "gravatar_hash": "0a1a220854cb0e2a7d4d7a1e1bc638b8", "author_url": "http://notunto.us/", "date": "Mar 19, 2010", "message": "When I was at around ~900 points, there was a major motivation for me to get to the next level of 1000, which would give me the ability to edit posts.  I was seriously demotivated when that threshold changed to 2000 right as I crossed the 1000 point.\n\nNow I'm at ~1740 and I'm beginning to get motivated to get to 2000 so I can get that ability to edit.  Now I'm about to lose a significant number of points, thereby further delaying that next step.  I find myself demotivated again.\n\nI know I shouldn't care, but I also shouldn't care about those stupid badges either."}, {"author_name": "Sosh", "gravatar_hash": "28b32e959ebbbf7e418f96bcd7c1db7e", "author_url": null, "date": "Mar 19, 2010", "message": "I think this is a good move, but I think further tweeks to curtail overly negative behaviour are in order.  \n\nTo Quote Sam: \"A simple change from “when in doubt, close and delete” to “when in doubt, leave” would make it all a lot friendlier AND get more information to more people.\" - I stronly agree with this, and feel that editing is also an area that is being 'used' a little too much."}, {"author_name": "Sosh", "gravatar_hash": "28b32e959ebbbf7e418f96bcd7c1db7e", "author_url": null, "date": "Mar 19, 2010", "message": "I should add, that my comment related to the second of the two changes."}, {"author_name": "TM", "gravatar_hash": "15a89c429f7dcca72ab78a66341cd06b", "author_url": null, "date": "Mar 19, 2010", "message": "Nooooooo! My rep!\n\nBut, while I am bummed to lose points (I must always have more!), I agree with these changes."}, {"author_name": "brian", "gravatar_hash": "27962e8d275127cf88313d08b3770a1d", "author_url": null, "date": "Mar 19, 2010", "message": "This constant changing and making it all retroactive to all previous votes cast is crap. When people signed up you told them the rules and awarded points based on those rules.\n\nI understand that things change and need to be changed in order to keep possible issues and problems in check. However rolling back people's points is a jerk move and one you seem to have no issue doing. I wonder what your blog post would have read if you were on the other end of this stick?\n\nYou SHOULD make the changes effective and leave previous vote counts alone.\n\nBy doing it retroactively you are breaking the contract and trust you created with the user at the time they decided to play the game and register. \n\nImagine if you signed a contract and once the deal was done the other party decides they don't like the deal and retroactively remove half of the money paid from your checking account without your permission? Would it be a problem if they simply said they were only going to pay half in the future? no. \n\nYou gave people rules to earn points. Quit screwing with them each time you see a flaw and take away points from them retroactively."}, {"author_name": "Dominick", "gravatar_hash": "424e5cb7ec6e99175bf73d3a17636978", "author_url": null, "date": "Mar 19, 2010", "message": "I agree with Kristof completely. This is a bad idea."}, {"author_name": "brian", "gravatar_hash": "27962e8d275127cf88313d08b3770a1d", "author_url": null, "date": "Mar 19, 2010", "message": "\"I’ll lose reputation too — but I think it’s healthy for everyone to realize that rep is kind of an arbitrary concept, and think about what it means to them, to anyone else, and why.\" - Jeff Atwood\n\nWill you loose being a moderator or edit posts? NO, but a lot of loyal SO users will. \n\nAnd the points system didn't seem so \"arbitrary\" (subject to individual will or judgment without restriction) when you were singing it's praises back in the old days. What you are saying now is that we shouldn't care about the points because the rules for earning those points have and continue to change and retroactively so, at your will. Making WANTING to earn those points much less attractive and valuable. Not because you earn less, but just because you may decide in some future date that +5 isn't a good number either and it should just be +1 for up votes on Questions.\n\nMake the changes, leave the previous votes alone if you want to be fair and decent."}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Mar 19, 2010", "message": "Finally!! I am sick and tired of people asking \"how do I get the length of a string in c#\" and getting reputation for this..\n\nI mean this kind of thing is lame. Some do it intentionally to gain rep."}, {"author_name": "Dan Singerman", "gravatar_hash": "88a93460e93e2c37a277caf48c405220", "author_url": null, "date": "Mar 19, 2010", "message": "I wonder what proportion of the naysayers have more rep from questions than answers?\n\ncaptcha: returned entitled"}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Mar 19, 2010", "message": "However, making retroactive changes is pure communism."}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Mar 19, 2010", "message": "Please leave meta out!"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Mar 19, 2010", "message": "Any chance the ratio could be different on Meta? On Meta it's different because you want to reward good feature request ideas or good bug finds (i.e. questions) and most of the time \"answers\" are just discussion which would happen anyway whether it's encouraged or not. This is kind of the opposite of SO where questions come naturally but answers need to be motivated more.\n\nAlso, why do you feel it necessary to do a retroactive recalc? Is there a philosophical reason or is it just because coding it another way is too hard?"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Mar 19, 2010", "message": "Who is this really going to have an effect on?  If you get the majority of your reputation from answers this will have very little effect.  If you get most of your reputation from questions this will have a large effect.  Your reputation could be cut in half.  If you get all of your reputation by asking hundreds of bad questions that get lots of downvotes and a few upvotes, netting a small positive, this will drastically reduce your reputation.  I feel bad for the people in the second group, but we all get the added bonus of *having our questions answered* when we ask them.  I think this change just shifts the focus of asking a question away from gaining reputation and towards getting an answer.  Just as it should be.\n\nCaptcha: delays strenuously"}, {"author_name": "Bryan D", "gravatar_hash": "3497d52dba17d86666a7bc82a2243c07", "author_url": "http://www.bryandenny.com", "date": "Mar 19, 2010", "message": "I can understand the need of the changes *now*, but why punish those who helped bootstrap the system by providing lots of questions in the beginning?  There wouldn't be any answers without any questions to answer!\n\nYes, I'll admit that I have more rep from questions than answers, but that is mainly because many of my questions are so ancient (and therefore have accumulated slowly over time) and I've been a slacker lately about answering questions.\n\nIf you retroactively remove the points but do not remove our abilities to edit, vote to close, etc. then I think I would be okay with that.  Otherwise, I feel like the rug is being pulled out from under my feet.\n\ncaptcha: the bamboo?"}, {"author_name": "FarmBoy", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Mar 19, 2010", "message": "As one that has gained more rep from questions than answers, I welcome the change.\n\nI've long thought my rep was overinflated, but I keep asking questions because I need answers.\n\nKeep up the good work."}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Mar 19, 2010", "message": "+1 to Bryan"}, {"author_name": "Josh Curren", "gravatar_hash": "0e58db669fe3497aff26dbdcac5dccb0", "author_url": null, "date": "Mar 19, 2010", "message": "For students like me I find this unfair. I have about 1850 rep, just under 800 of it is from questions. As a student I ask many questions because I am still learning. I try to answer as many questions as I can but as a student I just don't know as much as the experienced users. I have been a member for almost a year and I have been working very hard to get enough rep to edit posts. I understand changing the rep for the questions but I think it is unfair to do so retroactively. Jeff, it may not be a big deal to you, but you wont loose any ability. I am so close to finally being able to edit but yet this will set me back to under 1500."}, {"author_name": "voyager", "gravatar_hash": "c658f5d2eae05b8e7cab26a40106cd7c", "author_url": null, "date": "Mar 19, 2010", "message": "Will anything be done about pity upvoting?\n\nCaptcha: an unstated"}, {"author_name": "voyager", "gravatar_hash": "c658f5d2eae05b8e7cab26a40106cd7c", "author_url": null, "date": "Mar 19, 2010", "message": "@Josh: then you'll lose less than 400 points. Some recalcs have put people as much as 700 points down. I still think that *just* increasing the weights of the downvotes would have been more *fair*, but what do I know..."}, {"author_name": "FarmBoy", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Mar 19, 2010", "message": "Josh,\n\nI'm a student too, as I'm starting my second career.  Shouldn't those of us that know less be trusted less?"}, {"author_name": "Miyagi Coder", "gravatar_hash": "add6bd5fd799ebc6093bce08b83684e6", "author_url": null, "date": "Mar 19, 2010", "message": "why even bother posting the question on meta want feedback when you are just going to do it anyways?"}, {"author_name": "David Basarab", "gravatar_hash": "200cc24cc0555d1c6bd14b5a7fe8f852", "author_url": "http://stackoverflow.com/users/2469/david-basarab", "date": "Mar 19, 2010", "message": "The biggest issue is retro active.  I don't see many people have problems with questions being 5 going forward.\n\nMany countries have Ex Post Facto laws (http://en.wikipedia.org/wiki/Ex_post_facto_law) meaning that the government doesn't pass a law and then make it retro active.  \n\nRetro active regardless who it effects feels wrong, and most societies have made laws to prevent it.  \n\nMy solution is to have the community vote on if it should be retro actively applied."}, {"author_name": "Nick Craver", "gravatar_hash": "52b6e4f1831bcd153f645a14f29aa185", "author_url": null, "date": "Mar 19, 2010", "message": "@David - From a technical standpoint, it introduces complication not to make it retroactive.  At some point glitches happen, people find a way to cheat, calculation bugs, etc...a re-calc is needed from time to time.  When that happens, whether now or later, the new rules get used when totaling things up.\n\nIf it wasn't retroactive, the rep calculation would need to handle a cutoff date, calculate everything between these dates a certain way, another date range another way...you see how that gets messy real fast with the next reputation tweak."}, {"author_name": "David Basarab", "gravatar_hash": "200cc24cc0555d1c6bd14b5a7fe8f852", "author_url": "http://stackoverflow.com/users/2469/david-basarab", "date": "Mar 19, 2010", "message": "@Nick Craver  - I understand your point.  Jeff needs to then state that in the blog post.\n\n\"Item the first: question upvotes will now grant only +5 rep instead of +10. There is no change to answer upvotes. This will apply retroactively to all users.\" \n\nNo mention that it was done to be easier on the developers of Stackoverflow.\n\nI have no idea technically how the rep is calculated behind the scenes.  My understanding is reason for the retro-active nature was \n\n\"There are a few users who ask hundreds, sometimes even thousands of questions. Over time, these users generate a fairly sizable reputation entirely through the tiny trickle of upvotes gained by these questions. In a sense, we want to discourage question asking a little bit, and make sure that people who ask questions are doing it for the right reasons and not to generate reputation. \"\n\nThere is a way to accomplish this without making it retro active.  It has a time and cost, but the price on both might be too high.\n\nRunning for almost 2 years under a certain set of rules and then changing them just feels wrong."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Mar 19, 2010", "message": "The up/down vote ratio thing still bugs me. Even though (like the question-vote rep reduction) it's unlikely to ever touch me personally, I worry that folks who spend most of their time in niche topics (the \"Specialists\") could end up effectively paralyzed, forced to up-vote posts they don't agree with merely so they can down-vote those that are wrong...\n\nSpecial-purpose laws/rules have a nasty habit of hanging around long after the problem they were intended to solve has been forgotten.\n\nBut no matter. I am glad to hear there'll finally be a global rep-recalc; plenty of users on the site now who've never had that bit of fun..."}, {"author_name": "paxdiablo", "gravatar_hash": "a6e7ad8582ac390cd668b2b0d6b3058c", "author_url": null, "date": "Mar 19, 2010", "message": "These changes don't seem too bad to me. Rep is, after all, just an arbitrary measure.\nMy questions and answers lose none of their value for having given me less rep.\nAre any of you seriously going to be less able to feed your families because you lose some score in an artificial popularity contest.\nI do like the required-ratio idea but I'd love to know who those 6 users are :-)\nNo, just kidding, we don't need a name-and-shame campaign."}, {"author_name": "Stefan Kendall", "gravatar_hash": "cc39fb58e903e1377081c621c2f53c7c", "author_url": "http://Progamonth.com", "date": "Mar 19, 2010", "message": "A re-calc is justified, but don't lower everyone's points all at once. Rather, store how many points each user owes the site (difference of current points and recalc'd points) as a sort of loan. For each future positive transaction, deduct some fixed tax to pay off this debt. In this way, no one loses priveleges, and people aren't discouraged from seeking points. \n\nThis system would work in both directions for all future changes in the points system."}, {"author_name": "Eric", "gravatar_hash": "cad36aea9ff5e233ea939e212bfc466b", "author_url": "http://devadept.com/", "date": "Mar 19, 2010", "message": "I think this is a good change, and I have no problem with periodic adjustment of the reputation rules.\n\nI've always viewed my reputation points as a measurement of the SO community's perceived value of my contributions. The rep points belong to the *community*, not to me. If SO adjusts its values, and that leads to an adjustment my rep, so be it. The value I get out of SO is so much more than reputation points."}, {"author_name": "Fredou", "gravatar_hash": "6191322922ecb29b38339db6d65f56ac", "author_url": null, "date": "Mar 19, 2010", "message": "I don't care about rep, all I want to do is post questions or answer questions."}, {"author_name": "Douglas Neiner", "gravatar_hash": "6868c2908859c318f4fa0911eb6029b0", "author_url": "http://dougneiner.com", "date": "Mar 19, 2010", "message": "I applaud this change! It was really discouraging to spend hours on StackOverflow answering questions and troubleshooting problems with the OP's questions, sometimes back and forth multiple times, then see someone who asks *tons* of questions gaining reputation almost as fast. I think this is a good move for StackOverflow!"}, {"author_name": "m4bwav", "gravatar_hash": "2a7422e683acff1b012c7564823963ae", "author_url": "http://www.markdavidrogers.com", "date": "Mar 19, 2010", "message": "I will be hit pretty hard because I like asking questions in general. But I can understand given there are so many rookie developers with astronomical scores due to fluff questions.  If it fills another reputation hole in the system that rewards unknowledgeable people, then so be."}, {"author_name": "Daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": "http://none", "date": "Mar 19, 2010", "message": "If a question shouldn't be asked, it should be simply closed.\n\nI think you are attacking the problem in the wrong way. Less questions, less answers, less visits. \n\nAnd, a good question deserve the same amount of reward of a good answer. How many time an already question save me a lot of time. I was very happy to reward the original poster.\n\nThe problem is in fact that you have some problem with the system with question already asked. And some people, are getting reputation from it. Your solution is in fact just a temporary solution to a persistent problem."}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Mar 19, 2010", "message": "The whole issue with respect to retroactive recalc also involves the technical complexity of the vote calculation mechanism.  Assume that in the future someone's rep will be recalculated.  The question really is whether or not the current rules are applied to their historical data or whether the recalculation rules need to take into account the rules as they existed at the time.  The former is undoubtedly much simpler to implement and maintain.  The latter would require some sort of strategy pattern and selecting the proper strategy based on the date for the particular action.  Theoretically the former might be done as a single (albeit complex) SQL statement.   The latter would require at least a series of statements -- one per rule set -- over subsets of the data.  I think the fairest thing for existing users is to either never do a recalculation at all (not likely) or use the complex calculation logic that applies different rules sets.    The fairest thing from the perspective of future users (and the devs) is probably to apply the rules retroactively to put every one on a level playing field.  In the end, there is probably no solution that satisfies everyone and I default to the simplest.\n\nAnother (out of the box) alternative would be to refactor the game entirely so that's really multiple games.  We've discussed this before but the conclusion was that it probably wouldn't affect the ordering all that much, so why bother.  Now there's an additional reason -- you can change the rules for the new game, while leaving the old game intact.  Rep then becomes your score in the current game and you keep track of your position/score in previous games as an overall rep.  Privileges are granted once you achieve a minimum score in any game and are never lost.\n\nThis solves the problem that you never get the rules right the first (or second) time you design a game.  Usually this isn't an issue because the games are short and you simply start over with better rules the next time.  Unfortunately, SO is a \"forever\" game at this point and refining the rules while playing does seem like \"cheating.\""}, {"author_name": "Stephen", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Mar 19, 2010", "message": "We don't lose rep on community wiki upvotes do we?\n\ne.g. I have a question that is CW... if it gained 2 upvotes (in a CW state) (e.g. I got no rep from it) that will be excluded from the retroactive (-5 * 2upvotes) = -10rep... right?\n\nI can't recall if SO keeps track of whether upvotes/downvotes were given before/after CW status or if it just keeps a running total."}, {"author_name": "Joni", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Mar 19, 2010", "message": "I've got 3090 rep. Most of it is from answers (and only some from questions, which aren't bad, btw :P) but it'll certainly drop below 3000, maybe to 2700 or so. Well, no biggie. Dropping below 2000 would be more annoying to me (and bigger loss to the site) as I edit posts actively.\n\nIn any case, as others pointed out, leaving previously-earned scores alone would in fact be more fair. But in the end I suppose it won't hurt the sites too much even if some good editors or moderators lose their abilities for a while. I like Stefen Kendall's \"loan\" idea, though that would make all this a tad too complicated perhaps. :-) Nick Craver's technical keep-it-simple/\"lazy programmer\" standpoint (which I suspect Jeff et al share) certainly has merit too."}, {"author_name": "m4bwav", "gravatar_hash": "2a7422e683acff1b012c7564823963ae", "author_url": "http://www.markdavidrogers.com", "date": "Mar 19, 2010", "message": "Regardless, though the more you take reputation from people through recalculation, the more likely they are to think stackoverflow sux, and no longer contribute, IMAO."}, {"author_name": "Brian R. Bondy", "gravatar_hash": "f0566752ce55a90dbb5f80cd4f79fe14", "author_url": "http://www.brianbondy.com", "date": "Mar 19, 2010", "message": "Suggestion: The new users (if any) that get introduced onto the first page should maybe be sent so t-shirts?"}, {"author_name": "Gordon", "gravatar_hash": "0bf5f81f9852861944d7306696884226", "author_url": null, "date": "Mar 19, 2010", "message": "Queue panic and hysteria."}, {"author_name": "Adil", "gravatar_hash": "2b39dfea7ab847034d3da6961d07fe8c", "author_url": null, "date": "Mar 19, 2010", "message": "Its quite unfair for those who are still in the process of learning, they have questions to contribute not answers... Secondly if there is no question, what is point of this site then? If people are not going to ask any question, where those with lot of knowledge will go?"}, {"author_name": "Dynamo", "gravatar_hash": "2be09fb757e237b40d4a8b918606ac44", "author_url": null, "date": "Mar 19, 2010", "message": "I'm a little confused as to how this will help the problem of people slowly gaining rep by asking hundreds of throw away questions. Won't it just take longer now? Your first and second justifications for this made sense to me but it won't stop the third problem. These people will just ask twice as many questions to get what they want.\n\nAs for the recalc... meh. Doesn't bother me much. I'm getting a little sick of the rep game on the site and how much weight it holds for certain users."}, {"author_name": "gnovice", "gravatar_hash": "f10d46954aba4a7207ea3ba66d4e6f86", "author_url": null, "date": "Mar 19, 2010", "message": "I think all the people who seem to be equating SO with nations or societies by way of comments referencing communism and such are missing the point entirely.\n\nSO is not a *society*, it's a *service*.\n\nGranted, it's a service that would not exist without a huge community following, but it's still a service nonetheless. Jeff and Co. supply a forum in which users can disseminate information to one another, and they have final say over how the rules work. Even though they take input from the community, it's not a democracy. And anyone who has been operating under such a misguided notion needs to wake up.\n\nCaptcha: \"bare equipment\" (is my fly open?)"}, {"author_name": "DBoarman", "gravatar_hash": "0c5a5aa70c6436d498bd65ff828d4fb0", "author_url": null, "date": "Mar 19, 2010", "message": "I know I'll be hit hard by the recalc. But I certainly see the value. No worries - I'll just have to get better and faster at answering."}, {"author_name": "Jonathan Sampson", "gravatar_hash": "a84a8714fd33f6676743f9734a824feb", "author_url": "http://sampsonresume.com", "date": "Mar 19, 2010", "message": "I agree with the many users prior who feel this will be a good thing. Regarding retroactive-application, I think this is necessary to keep things fair. It's not good that I should keep twice as much rep for the same action that others will only get half as much on.\n\ncaptcha: rundown now"}, {"author_name": "Kev", "gravatar_hash": "a9840656ceee0faa528806c4c04a9399", "author_url": "http://stackoverflow.com/users/419/kev", "date": "Mar 19, 2010", "message": "Perhaps the solution is to have no upvoting on questions at all. After all if you're asking a question (no matter how great the question is) you're asking the community to spend its time helping with a solution. Why should you be rewarded for that? The people answering the questions should be rewarded surely? It annoys me whenever I see questions that have more upvotes than the accepted answer, that's unfair.\n\nI'd suggest that votes on questions be used to determine whether it's worthwhile, i.e. make them all community wiki."}, {"author_name": "Dynamo", "gravatar_hash": "2be09fb757e237b40d4a8b918606ac44", "author_url": null, "date": "Mar 19, 2010", "message": "@Kev You know what, I don't hate that idea."}, {"author_name": "Stephen", "gravatar_hash": "6400a9f2e6cc16639e2369612d984a61", "author_url": null, "date": "Mar 19, 2010", "message": "I will still ask my questions on SO, (because I get answers), but in interest in the site has just taken a very very sharp drop.  \n\nI make it a point to not play with people who change the rules in the middle of the game.  It is not fair or nice others.\n\nPerhaps you should be more concerned about the bulk your normal users (that you may be loosing) than \\a few users who ask hundreds, sometimes even thousands of questions\\.  Punish everyone because of the few?  Yeah, that will make your customer happy(yes, us lowly users are your customers)."}, {"author_name": "William Shields", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Mar 19, 2010", "message": "I agree with the change to question upvote weighting. I also agree that making it retroactive is the only reasonable (but not the only possible) solution.\n\nThe vote ratio thing is a little weird in this sense: if it only affects 6/100,000 users on SO is it really enough of an issue to change?\n\nI see users with only X hundred rep with over a hundred downvotes and less upvotes. I have to wonder who these people are. Are they real accounts? Misguided users?\n\nThis change won't affect them (too few overall votes) but maybe it should. This change is like acknowledging there's a problem but not really doing anything about it."}, {"author_name": "T.J. Crowder", "gravatar_hash": "ca3e484c121268e4c8302616b2395eb9", "author_url": "http://www.crowdersoftware.com", "date": "Mar 19, 2010", "message": "On the downvote thing: \"...realize that this will affect very, very few users — on the order of about 6 users out of 100,000+ on Stack Overflow\" So that's...9 users then. (http://stackoverflow.com/users) *Wow* that's targeted. Still probably a good idea, though. The content I've seen on SO and SF is easily more than 2:1 good:bad."}, {"author_name": "Otaku", "gravatar_hash": "a7702f74f3814b23e7aa6040a211f487", "author_url": null, "date": "Mar 19, 2010", "message": "I came across this link when someone put it in a comment - otherwise, I probably would have been baffled with the recalc of rep. If there is a change this big affecting the community, wouldn't it have been better to put this to a community vote? In fact, it doesn't feel like much of what is decided about the site is based on the community - if you happen upon meta and you can find it, maybe you could weigh in with your opinion, but by then decisions are usually made. Why not put important things to a vote on the main SO home page and involve us all?\n\nFor example, you've made this decision about upvotes for questions - the case could just as easily be made for answers, and probably at a far bigger ratio than 6/100,000, that there are folks who just answer with any old thing and live off the \"long-tail\" of votes on those answers. The right answer could be given far more votes and any upvotes it has received could also be given far more votes. Encouraging answers is one thing by keeping points at 10, but why not encourage the right answers?\n\nAgain, how would just a normal community member who doesn't run out to this blog at the right moment or ever visit mSO even be able to know that is was possible to have an opinion - let alone one that is heard?\n\nAnyway, I'm pretty sure this will just fall into the ether, so I'll stop writing now."}, {"author_name": "Otaku", "gravatar_hash": "a7702f74f3814b23e7aa6040a211f487", "author_url": null, "date": "Mar 19, 2010", "message": "Oh, and this \"decision-making process\" started 21 hours ago (from the time I'm posting this). Is this really the way big decisions are made? Have an idea, post on it, get opinions, keep original idea almost fully in tact despit all the opinions, make the final call, blog about it the decision - all within 21 hours?"}, {"author_name": "Mark Harrison", "gravatar_hash": "f79b395a801bf291b74e8bccea8e03f8", "author_url": null, "date": "Mar 19, 2010", "message": "It was pretty much a wash for me.\n\nMy rep went down 0.4%, and my relative ranking went up 0.04%.\n\nI like the idea of discouraging too much negativity.\n\nGood Job, Jeff!!"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Mar 19, 2010", "message": "I don't think this affects me but it seems like applying it retroactively is not very fair.\n\ncaptcha: Though corrupts (seriously)"}, {"author_name": "Anton Geraschenko", "gravatar_hash": "bb9c1fa136cbda222700efff19d8b171", "author_url": "http://mathoverflow.net", "date": "Mar 20, 2010", "message": "I don't like decreasing the weight of upvotes on questions. The problem this is meant to solve is that of users asking lots of bad questions, each of which earns a little bit of rep, but this solution simply penalizes <em>all</em> questions. As Joel said on a recent podcast (I'm not sure which), people asking good questions drives a community much more than people providing answers (though that's obviously important too).\n\nIt's not hard to come up with algorithmic solutions that target the problem more effectively. For example, you could impose the rule that you can only post one or two questions per day, but questions with a high score (at least three upvotes, say) do not count towards this limit.\n\nIf for some reason you really need to ask a lot of bad questions (or just a lot of questions in a short time), you can still do it by logging out and asking as an unregistered user. But since you don't earn reputation on your account by doing that, the motive to spam the site with crappy questions is removed."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 20, 2010", "message": "> As Joel said on a recent podcast (I’m not sure which), people asking good questions drives a community much more than people providing answers (though that’s obviously important too).\n\nI have never agreed with that random Joel bon mot, and there is -- literally, I am not making this up -- published research that contradicts this claim. They even <i>used creative commons Stack Overflow data</i> in their study!\n\nhttp://www.wsdm-conference.org/2010/proceedings/docs/p311.pdf\n\n<hr>\n<i>\nThe main finding is sort of obvious:\n\n<ul>\n<li>People who ask questions care about how many experts you have. When you have more experts, the questioners grow superlinearly.\n<li>People who answer questions (experts) do not care about number of people who ask questions. There is a constant rate of experts joining the site.\n</ul>\n\nThus, <b>for faster growth it's better to focus on signing more experts than it is to get more users who just ask questions.</b>\n</i>\n<hr>\n\nThe answers, and a strong community around answers, drive everything else. While we continue to reward good questions (they are still +5, after all), we will unabashedly and <i>generously</i> reward the real drivers of community -- those people who provide great answers."}, {"author_name": "Hanno", "gravatar_hash": "565798f3420b2682c103a5e2c48f03f8", "author_url": "http://stackoverflow.com/users/2077/hanno-fietz", "date": "Mar 20, 2010", "message": "I have a high question:answer ratio in my posts (&gt; 3:1), and a lot of my reputation of 5.7k as well as many of my badges come from asking questions, so I expect to really feel the change.\n\nHowever, as others have noted, I don't ask to get rep, I do because I either want the answer or have the answer and figure the question should be in SO.\n\nI have already gotten so much out of SO and I like the site so much that it already felt bad to answer so little. I'm starting to run out of questions, however, at least of those that are not ultra-specific to my current project and would fall into the \"do my work for me\" category.\n\nSo, either way, for me it's time to move from student to teacher, and I certainly approve of the change, it just feels right."}, {"author_name": "Hanno", "gravatar_hash": "565798f3420b2682c103a5e2c48f03f8", "author_url": "http://stackoverflow.com/users/2077/hanno-fietz", "date": "Mar 20, 2010", "message": "This is another occasion where a common community theme comes up in comments, the expectation that community == democracy. In web communities, whose members join and leave entirely at their own discretion, a benevolent dictatorship is actually fine, I think.\n\nOne, whoever lays down the community's \"constitution\" usually wants it to grow and flourish, which requires that members on average profit from whatever site policy is in place. While that person, or team, certainly can be wrong and do harm, there are many ways to avoid this other than paying attention to Civil Rights Movements.\n\nSecond, the behaviour of a group, as reflected by majority rule, often has a substantial part dedicated to stabilizing whatever the current culture happens to be. This is not always desirable and it's great if there's people who are able to just override majority rule.\n\nI'm not saying Jeff and the team shouldn't listen to the community, but I, for one, welcome our proven SO overlords."}, {"author_name": "Ether", "gravatar_hash": "43722cb1e955874a8eb721e9dfe101d1", "author_url": null, "date": "Mar 20, 2010", "message": "Note to readers: you can see how this will affect your rep by viewing your reputation report: details at http://meta.stackoverflow.com/questions/43004/how-do-i-audit-my-reputation.\n\nTo SO developers: what sort of timeline is planned for implementing these changes?"}, {"author_name": "Mike", "gravatar_hash": "0beafee95b4dc2466ef636657834f9ff", "author_url": null, "date": "Mar 20, 2010", "message": "So, you're saying we took some time to contribute content to your site by trying to ask good questions and now you don't think they have any value?"}, {"author_name": "Duncan Construction", "gravatar_hash": "c705c1d246a9887cbe656dd870a9537a", "author_url": null, "date": "Mar 20, 2010", "message": "Don't be a ponce, Mike. How does \"+5 rep\" equate to no value?"}, {"author_name": "Mike", "gravatar_hash": "0beafee95b4dc2466ef636657834f9ff", "author_url": null, "date": "Mar 20, 2010", "message": "Ok, I read through these answers.  They can create the rep economy any way they want.  Devalue someones effort and they aren't going to be happy.  Personally, I'm leaving.  Unfortunately, it seems like I can't take my questions off the site.\n\nI can always find an answer to my question somewhere else.  I've certainly lost my incentive to contribute to the StackOverFlow.   I was at 91 questions, deleted down to 80.\n\nhttp://stackoverflow.com/users/5020/delete-me\n\nSee ya all on IRC and the news groups."}, {"author_name": "Duncan Construction", "gravatar_hash": "c705c1d246a9887cbe656dd870a9537a", "author_url": null, "date": "Mar 20, 2010", "message": "Don't be a ponce, Mike."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Mar 20, 2010", "message": "Why not make the question votes be +5 from now on rather than changing everyone's rep retroactively. I'm 9k rep, only 1k from 10k. Whenever I ask a question I put a lot of detail in describing it clearly so I get upvotes. I've been a member for over an year. Now 1k away from editor rights you're going to slide me back down to 4500? Do you think that's fair to me? I haven't abused any of the power gained through my rep and not planning to do that in the future either.\n\nIf this only affects future questions and doesn't change anyone's existing rep, then I won't have any problem with this and I think it would be a positive change.\n\nI think good questions need to be rewarded just as much as good answers."}, {"author_name": "Shog9", "gravatar_hash": "4f0af2dc52e6ff228e4d69f7e1e8aa5a", "author_url": null, "date": "Mar 20, 2010", "message": "Click Upvote:\n\nTo be fair, you already have editing rights, and should retain them after the recalc. You won't have the ability to delete/undelete posts, or access to deleted posts and a handful of reports."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Mar 20, 2010", "message": "&gt; A re-calc is justified, but don’t lower everyone’s points all at once. Rather, store how many points each user owes the site (difference of current points and recalc’d points) as a sort of loan. For each future positive transaction, deduct some fixed tax to pay off this debt. In this way, no one loses priveleges, and people aren’t discouraged from seeking points.\n\n&gt; This system would work in both directions for all future changes in the points system.\n\nYes, please do that if you must. I'm content with my rep staying where it is for a while until the 'loan' rep is paid back."}, {"author_name": "Mike", "gravatar_hash": "0beafee95b4dc2466ef636657834f9ff", "author_url": null, "date": "Mar 20, 2010", "message": "I got beat up last week when I asked to have people get badges for asking questions and getting them answered.\n\nhttp://meta.stackoverflow.com/questions/41993/badges-for-asking-questions-and-getting-them-answered\n\nI *already* thought my effort was undervalued!!\n\nThe site is probably getting inundated with \"C#/.Net./Asp.net/Should I even be a programmer\" questions.\n\nI was hanging out in the Lisp/Android/Scala/Emacs sections trying to make things interesting.\n\nhttp://stackoverflow.com/questions/2170528/writing-hello-world-in-emacs\nhttp://stackoverflow.com/questions/2264267/generating-a-quiz-in-common-lisp\n\nI say let these guys build the best Q&amp;A site for Windows programmers on the Internet.  They do have a great idea.  Hopefully, someone take the idea and improve upon it.\n\nIn the meantime, I think I'll just blog."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Mar 21, 2010", "message": "@Click Upvote: If there's a loan, what should the interest rate be? How does the community (or just Jeff) decide? Does the interest cause your real rep to be lopped off, or just add to your loan?\n\nA can of worms, in other words. :-)\n\nI think a clean one-time adjustment makes things easier. But your mileage may vary."}, {"author_name": "Paul", "gravatar_hash": "fc3225dc3119500fcbf7af646a83c914", "author_url": null, "date": "Mar 21, 2010", "message": "Well, that's demotivating. I'm pretty close to 10K, and this rule-change/recalc will drop me back to 8.7K. \n\nNot much incentive to keep running on the rat machine, is it?"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Mar 21, 2010", "message": "@Paul: Have you considered answering more questions instead? Those aren't affected by the rule changes."}, {"author_name": "Shoban", "gravatar_hash": "cefea7db59f677c668a74699e49c1934", "author_url": "http://www.codegeeks.net", "date": "Mar 21, 2010", "message": "I think this is a good move just because of the change in vote points for questions."}, {"author_name": "Ether", "gravatar_hash": "43722cb1e955874a8eb721e9dfe101d1", "author_url": null, "date": "Mar 21, 2010", "message": "I strongly disagree with letting people keep their pre-recalc \"abilities\". A lot of the central thrust of this change is to reduce the abilities of \"Question Pumps\" who have gained abilities and responsibilities that the community does not feel they have justifiably earned.\n\nThose who answer a lot of questions are not impacted much at all by the change. Those who ask a lot of questions are, but this is simply more encouragement to start answering them too.  If you've been around on the site for a while, there will definitely be questions you can answer, even if they are \"only\" beginner-level. I'd estimate at least 80% of the questions I see are at the beginner level, so there are no shortage of opportunities to move up in the rankings.\n\nhttp://meta.stackoverflow.com/questions/37066/lost-my-motivation-after-3000-points has a good discussion on staying motivated, if you need some extrinsic carrots."}, {"author_name": "Tim Long", "gravatar_hash": "df0478426c0e47cc5e557d5391e5255d", "author_url": "http://community.tigranetworks.co.uk/blogs/Tim_Long", "date": "Mar 21, 2010", "message": "I call foul on this. It's not fair to punish existing users (be revising their rep downwards) for playing bu your (previous) rules. Existing users should keep their reputation. If you do this, YOU will lose some of your reputation with the community."}, {"author_name": "Shaun Finglas", "gravatar_hash": "5fa64738b2b35539637c51e7a098587b", "author_url": null, "date": "Mar 21, 2010", "message": "I agree with the user who said they were a student and were going to get hit pretty bad by this.\n\nI too am a student and agree that staring the new rules from now on, rather than effecting everyone is better. That's just my two cents. \n\nHowever, I'm not getting hit too hard at all. I like to think I've put something back to the site, and losing ~500 points on a website is nothing to fret over."}, {"author_name": "Paul", "gravatar_hash": "fc3225dc3119500fcbf7af646a83c914", "author_url": null, "date": "Mar 21, 2010", "message": "@Chris,\n\nI'm not fast enough anymore to answer a question before it can be answered correctly in most cases. My rep acceleration has been negative for quite some time.\n\nAnd I don't have a great desire to camp SO for rep. That just feels...like an MMO."}, {"author_name": "Rob", "gravatar_hash": "5d6db59f028e16f93d3af876c0e73129", "author_url": null, "date": "Mar 21, 2010", "message": "As the top C++ asker, my rep has just dropped by 2,000 points which I'm not best pleased about, especially as I've asked some very good questions that other people have obviously found useful.  This change has not been handled well and, IMHO, should of applied to new questions and not retroactively.  The change has also been communicated very poorly - I visit this site many times every day and had no warning of this.  The least you could of done was to advertise these changes with a banner along the top of the main site.\n\nI'm not sure if I'll be bothering to visit this site in the future."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2010", "message": "Rob, we understand that this is a bit of a sacrifice for anyone who gained rep through questions -- but we believe it is the correct balance to favor answers over questions, and that means a better Q&A ecosystem for all."}, {"author_name": "Seth Petry-Johnson", "gravatar_hash": "592ce06e300c7947559cff31295ee0bd", "author_url": null, "date": "Mar 21, 2010", "message": "I have to chime in and say that even though I agree with the motivation of the changes, it is very disappointing to have rep taken away. I put in a lot of effort to break 2000 so I could do some editing (which benefits the community and the site), and I just had that taken away. \n\nChange the rules if you think you need to, but isn't there a way to do it that doesn't _feel_ like you're penalizing members of your community? \n\nI understand that rep is an arbitrary concept, but once you start attaching rights and privileges to it then it becomes a little less arbitrary."}, {"author_name": "Thomas", "gravatar_hash": "b6243503d15a0072605521d06d9a0f53", "author_url": null, "date": "Mar 21, 2010", "message": "If I understand the change correctly, if you never asked a question and only every answered questions, and you have not voted more than 300 times your reputation should not change, correct? If that is the case, I suppose I'm curious as to why mine dropped albeit only a little."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2010", "message": "Thomas, the most likely explanation is deleted posts, deleted users, or migrated questions."}, {"author_name": "Thomas", "gravatar_hash": "b6243503d15a0072605521d06d9a0f53", "author_url": null, "date": "Mar 21, 2010", "message": "@Jeff - Gotcha. Thanks!"}, {"author_name": "Rob", "gravatar_hash": "5d6db59f028e16f93d3af876c0e73129", "author_url": null, "date": "Mar 21, 2010", "message": "Retrospectively applying this change has upset people and was totally unnecessary.  You should of started using new rules from an agreed date and avoided upsetting loyal users.  I have been a committed user of Stack Overflow since it went public and have often evangelised it's existence to others - to have my reputation cut by over 20% in one feel swoop like this is actually quite distressing and has tarnished my opinion of the site."}, {"author_name": "StephenWrighton", "gravatar_hash": "53a4066fb888b4a54fa1e650945e34a8", "author_url": "http://programmer.wrighton.org", "date": "Mar 21, 2010", "message": "I'm unconcerned either way regarding the retro-active application of this change, but I do agree with Rob in that there was a failure of communication in regards to this happening.  I use StackOverflow-I don't use ServerFault, SuperUser or Meta and I don't read the blog. Thus, it was a shock to come back from dinner, refresh SO and see that my rep dropped. \n\nI, for one, would have really appreciated having one of those orange banners that are used to inform users of things, displayed and directing users to this blog post so that I wouldn't have had to go hunting for the reason for my rep dropped."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2010", "message": "Stephen & Rob\n\nI thought about putting up a global message, but I don't like nagging every single user, when it's unclear how many of them care about their reputation number.\n\nWe are of course trying to be as responsive as possible to those who do notice and care, though."}, {"author_name": "Norman Ramsey", "gravatar_hash": "7dd45a27a5616b8a5608b84007e4e08f", "author_url": "http://www.cs.tufts.edu/~nr/", "date": "Mar 21, 2010", "message": "Jeff,\n\nI'm not even sure how my rep changed---but I agree with Stephen that when you build one of the world's better Skinner boxes, the least you could provide a banner at the top letting people know \"Your reputation has changed: to understand why see [blog entry](...)\".  If the change in rep is not an interesting event, surely most of the other bannered events are not interesting either...\n\nCould the recalc have led to my receiving the Taxonomy badge?  If not, I can go back to hunting for why I have it..."}, {"author_name": "Just Ed", "gravatar_hash": "755b567e3d4e20fe9cb1d1c6445e6eab", "author_url": null, "date": "Mar 21, 2010", "message": "I for the life of me don't understand why anyone cares what their rep is...I had a rep of about 2500, now its about 2000, the thing is, I went to the coffee store and tried to buy a cup of coffee with my S.O. reputation, and I couldn't get one. They still wanted 99cents."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2010", "message": "Just Ed -- well, I am sympathetic to those who lost the ability to edit (2000 rep) or cast close votes (3000 rep) as those are pretty significant.\n\nRep (and abilities) can be earned back, it's just more efficient to do it through answers than questions now."}, {"author_name": "nickf", "gravatar_hash": "0a6d284d4e2ce68e1c60871858da800b", "author_url": null, "date": "Mar 21, 2010", "message": "Man... I lost ~4250 rep. Bummer. Not so happy about it being retroactively applied."}, {"author_name": "Stephen", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Mar 22, 2010", "message": "I'm ok with the rep loss (~700) but man it is a bummer when I was just a few 100 short of reaching my 10K milestone! :-(\n\nOh well, I guess I just have *more* motivation now to provide great answers!\n\nPS IMHO I still feel that Re-Captcha is the all time worst Captcha services ever.  It wouldn't be so bad if they indicated in a *majorly* clear way that 1 of the words is an utter WTF and that they aren't *expecting* you to get it perfect vs. expecting you to study it for 60 seconds staring at it in a faint hope of getting it right. [/end rant]"}, {"author_name": "Anthony", "gravatar_hash": "6c42283aeb1521ae0e27bd41b7fdb227", "author_url": "http://stackoverflow.com/users/49478/anthony", "date": "Apr 06, 2010", "message": "I know I've seen some pretty no-brainer questions get upvoted, but whenever any of my questions get the bump, I tell myself that it's because the question a) is really difficult, b) really relevant, or c) needed to be asked. In the case of the last two, some questions address problems that may have simple (and well-known) solutions, but the documentation is such crap that RTFM is not realistic.\n\nHaving said that, while I will probably (sadly) drop quite a bit from a recalc, the number of upvotes is much more the reward (for me) than the reputation it has earned me."}, {"author_name": "Tiago", "gravatar_hash": "39bf070ec22954f58bbcbc63ff03ecfc", "author_url": null, "date": "Mar 10, 2011", "message": "You really don't have anything else to do than put barriers to people getting reputation points?\nIf questions are being upvoted, then they are important. Subjective questions are already rightly shunned, and there'a always CWs."}]}