{"response": [{"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Mar 16, 2010", "message": "Gaming! =)"}, {"author_name": "Dimitry Z", "gravatar_hash": "41bd070da37f1b03b8f272d741406545", "author_url": "http://webit.ca", "date": "Mar 16, 2010", "message": "Not tech, but oddly related, I'd like to see a cooking SO."}, {"author_name": "Marc Gravell", "gravatar_hash": "b4ae7f8b50a2c32287e456394570679e", "author_url": "http://marcgravell.blogspot.com", "date": "Mar 16, 2010", "message": "Pfah. That kind of obsession could never happen to [pause - distracted by a question about bulk data queries] us!\n\nAnyone for a waffle?"}, {"author_name": "Matt J", "gravatar_hash": "7707ad54df94fa33fa4ee2de7225c3f8", "author_url": "http://Matt@Jeffry.es", "date": "Mar 16, 2010", "message": "iPhone (and other mobile operating systems to some extent). Questions about using the iPhone are often posted to SuperUser. Since smartphones are basically underpowered PCs these days either StackOverflow should accept questions about them or there should be a separate site for them."}, {"author_name": "Shaun Kruger", "gravatar_hash": "f3caa87e9ebac39c3740af30aaaceb5a", "author_url": "http://www.fastinfra.com/", "date": "Mar 16, 2010", "message": "I second the motion for cooking.  It would be awesome to get some of the food network crew in on it."}, {"author_name": "EpochWolf", "gravatar_hash": "c27f158e95e252c8c9c4eab473f6b60e", "author_url": null, "date": "Mar 16, 2010", "message": "Third motion for cooking!"}, {"author_name": "Drew", "gravatar_hash": "f95c0f59cb9cef293c54bffd193a2652", "author_url": null, "date": "Mar 16, 2010", "message": "If by cooking, I'm allowed to ask: \\How do I get butter onto my toast? It's making my hands smell.\\\n\n:D"}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Mar 16, 2010", "message": "One of the things that I see quite frequently are questions by developers asking which vendor/software/framework/tool to use from the pantheon of choices.  Most of these are not particularly programming related, nor do they fit well into any of the other sites.  I could easily see people posting to and using a \"best of\" site which consists only of poll-type questions on the various options for a particular choice.  I don't know how you'd keep it from devolving into flame wars or you would get knowledgable people to participate, but I don't think you'd run short of questions."}, {"author_name": "bangoker", "gravatar_hash": "dfff0518037e2f04a72cbf1801986a9b", "author_url": null, "date": "Mar 16, 2010", "message": "I guess that a place to ask about programming-work related things that are not quite programming related would be good. Sometimes it can be done in SO, but many times they would be closed. \n\nA place where you could talk about how is it to work at a Company, ask how is the programming industry in X country, what keyboard is best for ergonomic reasons, etc, a place where you could ask about things that go around a programmer's life, but not just the programming per se."}, {"author_name": "Bill P. Godfrey", "gravatar_hash": "760bfd359153d0682dbe113dc02f81ba", "author_url": "http://billpg.com/", "date": "Mar 16, 2010", "message": "Isn't this what stack exchange is for?"}, {"author_name": "TREE", "gravatar_hash": "fdd2cee0ff73e9805b94654e4d7418d3", "author_url": null, "date": "Mar 16, 2010", "message": "If you're seriously branching out beyond programming, and really beyond things that definitely have a \"right answer\" into general communities, you really have to look at ravelry.com. They have an absolutely insanely excellent online community around... KNITTING! If you really want to have the best site focused on cooking, or some other creative endeavor, that style of site is much better than Q &amp; A."}, {"author_name": "Richard Gadsden", "gravatar_hash": "3c291e7858e6b79e06889fa7dbf16d31", "author_url": "http://backtype.com/po8crg/", "date": "Mar 16, 2010", "message": "Law.  The IT bits, like DMCA takedowns, licensing managment, consultancy contracts.\n\nI actually suspect that a lawyer-to-lawyer site where questions from non-lawyers were not welcome would be interesting."}, {"author_name": "Ivan Belov", "gravatar_hash": "59fc27af7133ea451cdaca3b2c5354d0", "author_url": "http://www.codermanager.com", "date": "Mar 16, 2010", "message": "Getting around American school system for parents graduated from non-american schools. :)\n\nAll levels - pre-k/primary/inter/high school, colleges, universities."}, {"author_name": "Ross Johnston", "gravatar_hash": "4137e6127b071d41180b3f105f677b24", "author_url": null, "date": "Mar 16, 2010", "message": "Second for the US school system."}, {"author_name": "Bill Paetzke", "gravatar_hash": "c91ce3d89649695f1b35ffa2a07b100e", "author_url": "http://careers.stackoverflow.com/billpaetzke", "date": "Mar 16, 2010", "message": "Convert doctype.com into a StackExchange site."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 16, 2010", "message": "> Isn’t this what stack exchange is for?\n\nSort of. Big changes coming in this area.\n\nAnyway, I'm specifically asking about questions that tend to recur on the trilogy itself, which implies there is an unmet need within the existing sites."}, {"author_name": "Scott", "gravatar_hash": "6285ff8f79ce11a5c9161011137258bc", "author_url": "http://www.simpsoncrazy.com/", "date": "Mar 16, 2010", "message": "I've noticed a lot of people complaining about web-related questions (specifically HTML/CSS) but personally I think those totally belong with Stack Overflow. They are essentially programming (code telling a computer what to do), and are tightly coupled to programming languages such as Javascript, PHP, C#, VB, etc.\n\nHowever, I would love to see a fourth part to the trilogy aimed towards design and user interface.\n\n\n&gt; \"they are quite literally the fabric of Stack Overflow\"\nWait, your servers are made from cloth? ;)"}, {"author_name": "Anton Geraschenko", "gravatar_hash": "bb9c1fa136cbda222700efff19d8b171", "author_url": "http://mathoverflow.net", "date": "Mar 16, 2010", "message": "It doesn't look like the public dump contains information about which questions were closed or for what reasons. Jeff, perhaps you could query the database and post a list of titles from questions that were closed as off topic (you may want to exclude deleted questions). Looking at such a list might make it pretty obvious what unmet needs there are within the S[OFU] communities. Or at least it would make it easier for people to say what kind of additional site they want since it's easier to recognize what you want than to come up with it."}, {"author_name": "Tati Hana", "gravatar_hash": "06997de36e4665ff74bb369d7ccdee33", "author_url": null, "date": "Mar 16, 2010", "message": "Are you crazy? If it's a trilogy, they are supposed to be just three..."}, {"author_name": "Stefan Kendall", "gravatar_hash": "cc39fb58e903e1377081c621c2f53c7c", "author_url": "http://stefankendall.com", "date": "Mar 16, 2010", "message": "As it stands, there's nowhere to ask timely or opinionated technical questions. How you would captivate THAT audience, however, is beyond me.\n\nwww.notebookreview.com does \\purchasing laptops\\ quite well. I'm thinking something like that in a more general sense. Perhaps a technology-purchase trilogy site? TVs, routers, computers...there's usually a \\best\\ out there, and there's always a community devoted to finding out what exactly the best is."}, {"author_name": "Oorang", "gravatar_hash": "74c236638d43b713794e529cd59e9aa1", "author_url": "http://oorang.webs.com", "date": "Mar 16, 2010", "message": "Yes, didn't you learn *anything* from Douglas Adams? Wait..."}, {"author_name": "Brad", "gravatar_hash": "08140dcf13ee3cd731277a716394cde5", "author_url": null, "date": "Mar 16, 2010", "message": "How about home repair/DIY?"}, {"author_name": "Thor", "gravatar_hash": "9fae936d3174f168ca80ee2b91f7be21", "author_url": null, "date": "Mar 17, 2010", "message": "I think it is time you step up to serve some worthy humanitarian challenges. I help start your brainstorm:\n - food/health/diet Q&amp;A\n - climate changes Q&amp;A\n - developing countries Q&amp;A (can be broad; how to develop a country)"}, {"author_name": "Thor", "gravatar_hash": "9fae936d3174f168ca80ee2b91f7be21", "author_url": null, "date": "Mar 17, 2010", "message": "Adding to the developing countries Q&amp;A, questions could be like \"How are the options for a desert village to get a sustainable water source?\", or \"How can I best help people in developing countries?\".\n\nTo get more success with this Q&amp;A approach, you could consider partnering with some news or media unit that could provide background articles, and your Q&amp;A tech could provide a forum in this field. Even the UN has news/media organizations.\n\nI think its worth a real try."}, {"author_name": "Thor", "gravatar_hash": "9fae936d3174f168ca80ee2b91f7be21", "author_url": null, "date": "Mar 17, 2010", "message": "Allright, this will be posted on the meta :)"}, {"author_name": "Benedict", "gravatar_hash": "e164876f30b5aa511b02c6241b5315da", "author_url": "http://benedictcohen.co.uk", "date": "Mar 17, 2010", "message": "People/work place questions - anything that happens at work that isn't related to the core discipline (ie development/programming). Questions of this ilk get closed for being subjective/off topic (which is correct), but that doesn't mean they're invalid questions."}, {"author_name": "Andy McKenna", "gravatar_hash": "811103db4bcf408dba46a72f95628429", "author_url": null, "date": "Mar 17, 2010", "message": "Gardening\nHome Automation\nHome Theaters"}, {"author_name": "Martin Wallace", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Mar 18, 2010", "message": "Gaming and/or Hardware."}, {"author_name": "Kevin Connolly", "gravatar_hash": "30d5456d1b71664feb5cda0233bf0d0d", "author_url": "http://www.kconnolly.net", "date": "Mar 19, 2010", "message": "When you alternate quoted text with article text as much as the end of your article, it kinda looks like a comment section and people are likely to gloss over it.  Just sayin'."}, {"author_name": "Peter", "gravatar_hash": "ac4039b12cd45da928a6f3c2752ad7c7", "author_url": null, "date": "Mar 21, 2010", "message": "Software engineering - agile practices, Kanban, XP, etc."}, {"author_name": "Caue Rego", "gravatar_hash": "c6768f8be92fe851f2a5502fb9845778", "author_url": "http://www.cregox.info", "date": "Mar 22, 2010", "message": "I'm still new around the trilogy, but I'd say web services are quite recurrent. Plus they're practically software, but not welcome anywhere unless it's programming related. Maybe they should just be accepted in superuser, I'm not sure it would be enough for a whole new site."}, {"author_name": "drejc", "gravatar_hash": "9b9319dade67212ce94a60fcaa09df6e", "author_url": null, "date": "Mar 23, 2010", "message": "http://allrecipes.com/ is doing a fairly good job on the cooking side."}, {"author_name": "Stefan Monov", "gravatar_hash": "9b4e0447e8d049ba853fe368765f6f76", "author_url": null, "date": "Mar 23, 2010", "message": "+1 for health Q&amp;A. In fact, make that general self-improvement Q&amp;A. Anything from \"Is it bad to mix fish with yoghurt\" to \"How do I stop being so submissive in my interactions\"."}, {"author_name": "Pyrolistical", "gravatar_hash": "b2896eaafd7ead3a3063a9162aa1dcce", "author_url": null, "date": "Mar 31, 2010", "message": "What about discussion type questions?  I know this isn't a forum, but there's a bunch of smart people here!  And we all know forums suck.\n\nI asked a very interesting question on SO, but then it got closed and deleted.\n\nNow the really sad part is I forgot my epic question!\n\nThat's another problem with deleting questions, because now somebody is free to post the same question again.  If it was just closed and not deleted it may prevent a repost."}]}