{"response": [{"author_name": "Sing a Long Joe", "gravatar_hash": "3712cd4b895249e1fd22288c3a66fa62", "author_url": null, "date": "Mar 14, 2010", "message": "I pretty much like the current format, it's relaxed, unpretensious and most important of all it helps me to sleep ! dont change please!"}, {"author_name": "Kaare Skovgaard", "gravatar_hash": "1abe8fd3a3b219b0ac8e8d9fd2271ca7", "author_url": "http://www.kaareskovgaard.net", "date": "Mar 14, 2010", "message": "I agree - the relaxed way of the podcast needs to stay the same - for some bizarre reason, just listening to people talk - most of the time ignoring the fact that they are broadcasting themselves (well that's what it sounds like at least) is rather entertaining.\n\nTalk about the SO family is always a plus, that should obviously be the overall topic of a podcast from SO IMO. Maybe some more talk about technical problems that has occoured, like the early talk about the RAID issues and etc - programming / hardware related, it's all good. But all in all - keep the shining personalities in there - NOT some of these show hosts that are just there to do one thing (ie laugh)."}, {"author_name": "Lars Wirzenius", "gravatar_hash": "4446f50fa72a1b8fe7fee62381757404", "author_url": "http://blog.liw.fi/", "date": "Mar 14, 2010", "message": "I, too, like the current format, but I admit it is occasionally repetitive. I like the technical/programming stuff way more than the discussions about the StackOverflow/StackExchange sites. Please do not get rid of the discussions where Joel explains things to Jeff and Jeff absolutely rejects it. That never gets old, regardless of which one of them is wrong.\n\nMore guests would be good, too."}, {"author_name": "Entity", "gravatar_hash": "e326f7efc603a1881cd645d22a663de2", "author_url": "http://www.vbs2.com", "date": "Mar 14, 2010", "message": "God whats going to happen to my relaxing Thursdays nights with a cigar and coffee."}, {"author_name": "Alex McBride", "gravatar_hash": "8a5f65062b9908152a7b00fab3df6c58", "author_url": null, "date": "Mar 14, 2010", "message": "I enjoy the podcast too, but I do think you guys need to bring in some outside influences. You say you are repeating yourselves, but I challenge anyone to have an 85 hour long conversation and not repeat themselves! Personally, I would like to see more interviews with interesting programmers/geek cultural icons, more discussion about real programming issues, but most importantly I want more opportunities for Joel's computer to make funny bleeping noises. :)"}, {"author_name": "Austin Grigg", "gravatar_hash": "66b17fd69991d5daf6bc042ebe173853", "author_url": "http://codingscars.blogspot.com", "date": "Mar 14, 2010", "message": "What I really loved about the podcast when I first started listening was hearing about the nitty gritty of developing and running a popular website.  I enjoyed hearing about solving interesting problems and potentials issues with MVC, running your own servers, and business decisions.  I would like to hear more about real-world developer issues and interviews with other people in the trenches. \n\nThank you for a great site and podcast."}, {"author_name": "Jonathan Sampson", "gravatar_hash": "a84a8714fd33f6676743f9734a824feb", "author_url": "http://sampsonresume.com", "date": "Mar 14, 2010", "message": "I stand in chorus with the previous comments admitting the show is excellent as-is. Of course, that's what we thought of just about every great thing before it was made even greater.\n\nI would love to see more guests on the show, even though both you and Jeff do an excellent job filling the space on your own. I understand that from the inside it may seem a bit dull, and boring. It's anything but that from the outside though - the Stack Overflow podcast is one of the highlights of my week.\n\nThe show may be repetitive, but what isn't? I think as long as you guys keep the conversation personal, discussing personal-interests and items you've stumbled across recently, the quality of the show will continue to soar.\n\nKeep up the great work, guys. Looking forward to the future of SOCast."}, {"author_name": "William Shields", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Mar 14, 2010", "message": "Joel,\n\nI think you're taking the criticism you've gotten about self-promotion a bit too much to heart (and I say that as someone who has criticized you for that).\n\nIt seems as if you've been taking to heart Jason Calacanis's ideas. Speaking as a fan of his \"This Week in Startups\" there are two observations worth making:\n\n1. TWIST isn't about Mahalo. Sure it comes up but it's not what the show is about; and\n2. Anyone in the public eye will have their detractors, warranted or not.\n\n(1) is key here. Jason gives something to budding entrepreneurs. So the question should be: what can you and Jeff give to the SO (or broader SO/SU/SF) community via the podcast? As long as you're providing value--even entertainment value--to people without it being about you guys, Fog Creek or some other shallow self-promotion vehicle, keep doing it.\n\nAs other commenters have said: I enjoy the SO Podcast more, say, than what are possibly more technically-minded podcasts like the Java Posse.\n\nI can't remember if this was you or not but someone (many people no doubt) have said about blogging: don't try and blog about something you don't care about or don't understand. So perhaps you should be talking about what you care about and know about rather than appealling to the public as to ideas of what you should be.\n\nOver the years I've greatly appreciated your commentary on desktop vs Web development, your commentary on Craigslist (from the podcast) and many other topics.\n\nYou are an interesting and entertaining speaker so keep speaking about things you're interested in until you've got nothing more to say.\n\nRegards"}, {"author_name": "Martin", "gravatar_hash": "903d1f6eb1dc53cc0810d9fcec0f3b8a", "author_url": null, "date": "Mar 14, 2010", "message": "Sad, sad, sad news. I'd like to stick with the same format (sadly without Joel). Try and find a replacement for Joel - maybe look at previous guests for possible hosts (like Eric Sink if he's available)."}, {"author_name": "James", "gravatar_hash": "43140301aa4b7d368673d3a412883305", "author_url": null, "date": "Mar 14, 2010", "message": "I would definitely go the direction of getting more interesting guests.  Those were always the best shows."}, {"author_name": "Bill P. Godfrey", "gravatar_hash": "760bfd359153d0682dbe113dc02f81ba", "author_url": "http://billpg.com/", "date": "Mar 14, 2010", "message": "You could call it 'The Coding Horror Show'?"}, {"author_name": "Lucas", "gravatar_hash": "2083165026d11a172ce52453237d294c", "author_url": "http://lincolnfair.net", "date": "Mar 14, 2010", "message": "Dare I say it but I welcome the change. I think everybody is afraid of change because no one is sure what to expect, but I think this could really be good.\n\nHowever, I will miss Joel's monologues. Those were great in my opinion. That being said I would like to see some of the other Valued Associates on the show to tell what they have been up to."}, {"author_name": "Michael Pryor", "gravatar_hash": "83678606ffe33ee7c1fb50b97338daed", "author_url": "http://stackoverflow.com", "date": "Mar 14, 2010", "message": "Ask programmers from other sites on to talk about how they got to where they are today... I believe Yegge was your most popular podcast (based on comments).\n\nExamples: Get Marco on to talk about how Tumblr went from 1.5 mm visitors in Jan to 2.5 mm in March.  Get Damian Katz on (he was a big hit at DevDays). Ask one of the Twitter programmers on so they can argue with you about how it's going to change the world."}, {"author_name": "Stefan Kendall", "gravatar_hash": "fe3af2a85aff9824c949d82cad67d974", "author_url": "http://stefankendall.com", "date": "Mar 14, 2010", "message": "The podcast makes my Thursdays. If anything, add more interviews, but I'd still like to hear why the world is in fact shaped like a banana, followed by Jeff's simple \"No.\" or half-hearted \"Maybe.\""}, {"author_name": "Jin", "gravatar_hash": "70ad2c2830eb9a7753bd6312f3811e3e", "author_url": "http://www.8164.org", "date": "Mar 14, 2010", "message": "Recently I read a good article on how a company's blog can be useful, and successful. The author quoted Kathy Sierra:\n\n<blockquote>\nTo really work, Sierra observed, an entrepreneur’s blog has to be about something bigger than his or her company and his or her product. This sounds simple, but it isn’t. It takes real discipline to not talk about yourself and your company. Blogging as a medium seems so personal, and often it is. But when you’re using a blog to promote a business, that blog can’t be about you, Sierra said. It has to be about your readers, who will, it’s hoped, become your customers. It has to be about making them awesome. \n</blockquote>\n\nI like the SO Podcast format the way it is now. It's relaxed, it's human and it's not markety. I do however welcome more guests on the show."}, {"author_name": "Jake McGraw", "gravatar_hash": "769b1f309a41e2893654c81496b9f8b4", "author_url": null, "date": "Mar 14, 2010", "message": "Two things:\n\n1. Keep up the consistency, I loved the fact that I always had something to look forward to on Thursday mornings.\n\n2. More history, I'm a relative newcomer to the world of software development, I find any information from the 80s, 90s and early '00s fascinating."}, {"author_name": "Kev", "gravatar_hash": "a9840656ceee0faa528806c4c04a9399", "author_url": null, "date": "Mar 14, 2010", "message": "I think this is a good idea, the current format has gotten stale and to be honest I stopped listening to the podcasts around August/September last year. I did dip into a couple just recently but there's not much on offer to hold my attention, which is a shame because it was one of my top 5 podcasts.\n\nI think you need more guests to liven things up and to vary the content, two folks who work together, batting back and forth their own opinions, does not an interesting podcast make. Having a third or fourth person on the call for different opinions/viewpoints (we've heard all of Jeff's now [twice] :) ) would be way more interesting.\n\nI agree with the \"less about programmers\" (I find this whole putting programmers up on pillars of gold/celeb thing we do in this industry distinctly disturbing and makes me queezy), but I don't think there's any harm in maintaining content \"about programming\". For example, would the trendy NoSQL databases appearing recently be a viable option for Stack Overflow (and have a guest that knows the subject well come on the show to discuss?).\n\nI'd also like to hear more about the ongoing challenges of running the Stack Overflow sites and a lots more details about the underlying technology stack and how you've used it, and how you've had to change things over time to accommodate increased traffic, bad behaviour etc. Also what the thoughts are wrt the upcoming VS2010/.NET 4 release, how will that impact the team, do they feel the irresistible desire to upgrade...\n\nI'd also like to hear less about the process of blogging, jeez guys, if you've raked that set of coals once you've raked it a hundred times. Your stuff is either interesting &amp; relevant, or it's not. How you got there, I don't really care. OT: Jeff also needs to re-learn blogging because he's blogging like a \"blogger\" these days and not like a programmer any more, but I think that's maybe an overall symptom of the current SO podcast situation.\n\nOne podcast I enjoy every month is the Herding Code podcast. Whilst they seem fairly ad-hoc, there's clearly a fair bit of prep gone into each programme. This doesn't seem to be the case with the present SO podcast which oft-times wanders off into a Joel or Jeff navel gaze session.\n\nI know you guys can do better, but on a final note. A few years back I did a radio show, it was fun and I wasn't locked into a station playlist. I did it for the music and to get tunes out there that no-one was getting the opportunity to listen to. I did this for two years, then suddenly it was a drag, my heart wasn't in it, and so I stopped rather than drag the listeners down too. Every now and again I feel like spinning disks again. Maybe the podcast/bloggy thing has gone the same road, it feels like that just now. So why not take a break and just put something up there when you've got something interesting to broadcast instead of being beholden to a strict monthly schedule and subject matter is thin on the ground?"}, {"author_name": "Goyuix", "gravatar_hash": "846aeb3494a51fdd2af2bb0b99dc364c", "author_url": null, "date": "Mar 14, 2010", "message": "Two things I LOVE about this podcast:\n\n* Discussing the development and changes to the StackOverflow engine including the challenges that face the team and how they end up being addressed.\n\n* The guests. I love hearing from other successful people and get a small glimpse at how they think and what is important to them\n\nTwo things I STRONGLY DISLIKE about this podcast:\n\n* Too long. Often it is longer than 1 hour, and that means I will inevitably get interrupted while listening. And no, I won't make my commute longer.\n\n* Hating on certain technologies. I respect that everyone has their preferences, and hopefully even based on experience - I even have my own - but I grow tired of the rants that crop up every once in a while. For that matter, the continued praise of certain technologies, even when deserved, gets old after 85 podcasts...."}, {"author_name": "Robert", "gravatar_hash": "febbd0cf7b0bd71438417f7352d40fb4", "author_url": null, "date": "Mar 14, 2010", "message": "@Joel - \n\nAs one of the ideas for the new podcast format you said, \"Less about programming and programmers, and more about the broader world of StackOverflow, ServerFault, SuperUser, and StackExchange.\"\n\nAre you possibly making a joke or did you mean to write the opposite?  The fundamental reason the podcast has gotten repetitive is BECAUSE Stackoverflow is discussed vs other broader topics. \n\nI think a problem here is that since you guys are so close to Stackoverflow you sometimes forget that it's not everyone's primary focus. Maybe 3% of the audience is the rabid group who just can't get enough. The rest of us want insightful and quality technical content. The podcast has become *incredibly* meta. Most of it is **already** about Stackoverflow. \n\nWe need more of what you guys are good at - generating insightful discussion. That's why I kind of chuckled when you said, \"...the broader world of Stackoverflow\". The problem is exactly the opposite. \n\nThoughts?"}, {"author_name": "William Shields", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Mar 14, 2010", "message": "@Goyuix: too long? An hour is pretty standard. The longest TWIST Podcast topped out at 2h43m!\n\nPotential talking points:\n\n- Guests\n- What's happening in the programming world;\n- Maybe discussing popular open source projects that you guys use, support through the ad program or whatever;\n- General discussion.\n\nI think it would be a mistake for the podcast to go too technical (programming-wise) for two reasons:\n\n1. Podcasts (imho) are not a great format for discussing programming, which often relies on code samples and such; and\n2. With all due respect, Joel's programming knowledge, from a practical standpoint, isn't current."}, {"author_name": "Bill Paetzke", "gravatar_hash": "c91ce3d89649695f1b35ffa2a07b100e", "author_url": "http://careers.stackoverflow.com/billpaetzke", "date": "Mar 14, 2010", "message": "Your podcast is one of my weekly highlights.  It's humorous, informative, and thought-provoking. \n\nThe dynamic between you and Jeff is electric.  **You guys** make these podcasts interesting. \n\nIf you add guests, please make sure they mix well with your dynamic--someone with a sense of humor. You've had a few dull guests in the past.  Perhaps stick to guests who are fellow software entrepreneurs or software developers (regardless of employment) who blog well. Or make a web form for listeners to submit topic proposals and be guests. \n  \nI am interested to hear the struggles that you and Jeff overcome in your daily work--whether that's programming, IT, or business related. I look up to you guys as role models. One of my goals is to be a software entrepreneur. So, almost any topic that interests you will interest me.  \n\nFollow your heart!  And good luck."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Mar 14, 2010", "message": "Joel,\nCongrats on the puppy.  I hope you both have lots of fun years with Taco.  Get out to the country with him/her/it!  \n\nDo what makes you happy for the podcast.  Screw the rest of us.  If you're not having fun, then why bother?  You should relax and enjoy the helicopter rides to HTO/east hampton airport."}, {"author_name": "Frank Rizzo", "gravatar_hash": "9b2c958dfe7eed7002b55d7715613d0f", "author_url": null, "date": "Mar 14, 2010", "message": "A couple of guests is ok, but don't overdo it.  We already have Hanselminutes.\n\nI'd suggest you bring back discussion of specific SO questions, maybe throw in discussion of various questions from the StackExchange universe."}, {"author_name": "Mike", "gravatar_hash": "657a587546d1d1a7eac618088230cce2", "author_url": null, "date": "Mar 14, 2010", "message": "I enjoy the podcast precisely for the reasons you mention.\n\nRemember, you may be getting the emails from people who don't like the format, but there are plenty out there who do like the podcast, you just don't hear from them!"}, {"author_name": "Peter Stegnar", "gravatar_hash": "6310e30d9a42af8321feda96250d40da", "author_url": "http://blog.stegnar.com", "date": "Mar 14, 2010", "message": "Well I pretty much like the current format. It is really interesting, amusing and informative. Do not change it TOO much!\n\nI know Joel what do you think about people resisting changes (and that is mostly true), but I really do not understand you that you are going to go more specific in podcasting as the same time you write that it is advisable to go more broaden in enterprise blogs than is your product ... Can you explain that?"}, {"author_name": "Martin", "gravatar_hash": "0310d3cf8c61eeefd8195c0bcc6e90f6", "author_url": "http://dnknormark.net", "date": "Mar 14, 2010", "message": "Reading your first idea, makes me think that you don't listen to your own advice for other blogs, about you should blog about something bigger than yourself. And not your self entirely. Doesn't the same thing go for podcasts?\n\nThat said, I think it would be great to have a monthly video podcast, in addition to the weekly one, but where you visit exciting software companies, see what they're doing, how is it like working there etc."}, {"author_name": "Frank Krueger", "gravatar_hash": "3eef89c1710742937cc74bf88da9dff8", "author_url": null, "date": "Mar 15, 2010", "message": "This is really sad news.\n\nAs someone who listens to a lot of podcasts, I can precisely state that your show was 1,000,014x better than anything else on air. \n\nJoel, your monologues were the best part. You may be tired of telling us the world is shaped like a banana, but we're not tired of hearing it!"}, {"author_name": "macbirdie", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Mar 15, 2010", "message": "I loved the current podcast for the programming topics, talks on challenges encountered during development of stack overflow engine, conversations with other programmers, human side of this business and, frankly, Joel's monologues that were followed by Jeff's \"yeah!\". I wouldn't like the podcast to turn into an elaborate Stack Exchange commercial, but I actually do believe you won't do that do us."}, {"author_name": "Bill Billington", "gravatar_hash": "e6f407d5c456c07416f427a66776de5b", "author_url": null, "date": "Mar 15, 2010", "message": "+1 for sticking to something similar.\n\nToo often focusing on guests devolves into people giving lectures on pet projects which can be really dull.\n\nPersonally what I find interesting about the pod-cast is the discussions on general programming and business topics.\n\nThe details of the Stack Overflow family for me are nice but secondary to just hearing some interesting opinions.\n\nThat said im open minded and will give whatever you come up with a whirl"}, {"author_name": "Paulo Santos", "gravatar_hash": "49490fc6113db81448b7ccfd0a41633a", "author_url": "http://bytefood.blogspot.com/", "date": "Mar 15, 2010", "message": "For me the best part of your podcast is to hear about your opinions, advices on every day life of real projects in real companies. It makes me rethink of my own processes, and makes me realize that the problems I face are not unusual. I love the insight of Joel and Jeff, please don't stop doing it!"}, {"author_name": "Gareth Conner", "gravatar_hash": "a72d2d5513eb6079a6cce677ddffcd17", "author_url": "http://creativeconners.com", "date": "Mar 15, 2010", "message": "I thoroughly enjoy the show in it's current format and particularly enjoy Joel pontificating about his view of the world.  The technical content is great, and Jeff's stories about the challenges in creating and maintaining SO are priceless.  The shows with guests were some of the best, but I wouldn't want you guys to have the pressure of finding guests for every show since that format gets tiresome as well.\n\nI like the current format, but if you both need a change of pace to keep it interesting for you, go for it!  I'll keep listening ;-)  Just rest assured that both of your insights are interesting and useful."}, {"author_name": "Jon Smock", "gravatar_hash": "7cf5af9e0f94976adae00ce7dfdd467b", "author_url": "http://stackoverflow.com/users/25538/jon-smock", "date": "Mar 15, 2010", "message": "Yes, please don't change the format!!  I'm ok, if Joel says he doesn't want to do it anymore.  I will miss that aspect, but that's a personal choice.  But, please don't change the actual format.\n\nI love how it just feels like two guys in a room (sometimes with a guest).  Don't add ridiculous sound effects and smooth transitions.\n\nI do really like how consistent it was there for a long time.  I would look forward to Thursdays because of it.\n\nAnd I absolutely love hearing about the trials and tribulations of a long public site and about how decisions are made on things like hardware, setup, features, spam, etc.  Most of us will never experience this kind of project, so it's awesome that you can share it with us.\n\nKeep up the good work guys!"}, {"author_name": "Matt B", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Mar 15, 2010", "message": "I agree with what Michael Pryor said above.\n\nThe episodes with Yegge were among my favorites.\n\nI would like to cast a vote for *more* interviews with programmers, and more discussion about programming as a whole, and less about SO / Server Fault / SE etc."}, {"author_name": "Sosh", "gravatar_hash": "28b32e959ebbbf7e418f96bcd7c1db7e", "author_url": null, "date": "Mar 15, 2010", "message": "For me the, it was the open and honest discussion of the day to day issues you had encountered during development of the concept and business - both commercial and technical.   'Giving back to the community' is a theme you often talk about, and I think the frankness of discussion was a great example of this in practice - it was really refreshing and inspiring to hear about the goings-on, warts and all, of a start-up that didn't sound like BS advertorial. \n\nI would love to hear more of this - it seems to me that this has been pushed to the back a little in recent months, with more general postulating and philosophising taking it's place (although I have still enjoyed this!). Perhaps there is less of this kind of thing to talk about now, or perhaps the issue of confidentiality is becoming unavoidable.  Personally I imagine that there will be lots still to talk about: the enigmatic areas of business such as raising VC funding, how VC-founder interaction pans out during the relationship; scaling the business culture (if you rapidly take on staff); remote working; technical issues, such as dealing with scalability as the site(s) grow and you hit the inevitable bottlenecks, or the impact of new technologies. \n\nI really hope that this openness can continue to some degree once other people's money is involved.  But, in any case, thanks for the stuff you have shared already!"}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Mar 15, 2010", "message": "I hate Jake McGraw but agree with him 100%"}, {"author_name": "Matthew Morgan", "gravatar_hash": "fbd3e5cc0b7dd5648f43d49719d2f4a8", "author_url": null, "date": "Mar 15, 2010", "message": "I really like the discussion about programming.  Several folks here have talked about wanting to hear more about programming and less about SO, etc., but I agree with Goyuix.  I like hearing about challenges you've faced with the websites and how you got around them.  That's real world stuff we can learn from.\n\nIt's hard to ask someone to go into in-depth discussion about coding for projects other than ones he/she is working on!"}, {"author_name": "Chris Barry", "gravatar_hash": "475ad7c536c1b9d3cd48825ec1b2cd42", "author_url": "http://chrisbarry.info", "date": "Mar 15, 2010", "message": "I too currently really enjoy the current format of the podcast. The technology discussions fused with the energy of Joel and Jeff is what makes it for me. I wouldn't mind having more guests or trying to change the format, but I'm not sure that a switch from programming/technology discussion to social applications is the right directions for the podcast. It may help of course with the investment talks that are going on.\n\nThanks for the podcast, I can quite easily say it has changed my life."}, {"author_name": "Jason Baker", "gravatar_hash": "b8e26b9942e7193a4fe32c407aacfef5", "author_url": "http://jasonmbaker.com", "date": "Mar 15, 2010", "message": "\"Less about programming and programmers, and more about the broader world of StackOverflow, ServerFault, SuperUser, and StackExchange.\"\n\nTo me, it sounds like this is becoming a bit too \"meta\" for me.  In fact, that's one of the reasons why I don't really listen to the podcast that much.  I like stackoverflow, but I don't really want to listen to a 1 hour podcast about it.\n\nThat said, I do think that you can do more than just talk about programmers and programming.  Perhaps you can do a format more similar to Planet Money or This American Life.  Not that I don't like listening to you guys, but I think that you guys probably aren't the best people to talk about things outside of programming.  Perhaps you could invite guests to present stories related to their fields of expertise."}, {"author_name": "ADB", "gravatar_hash": "d622054cf6bc37a82dc13708b440aedd", "author_url": "http://www.greencod.com", "date": "Mar 15, 2010", "message": "Like many other, I enjoy the current podcast (and other Joel's work) and being told that the earth is banana shaped. It does feel a bit repetitive at times however, so a fresh look into it may be nice. However, I do like to get a quality podcast about programming, so I will be sad if the focus is moved away from it. I do understand that after awhile, someone gets tired of doing the same thing and wants a change. We have been following Joel over the years and it has been a nice ride, but when the driver gets tired, he has the right to pull off the highway and do something else. Best of luck."}, {"author_name": "Petros Amiridis", "gravatar_hash": "2fba0881396c95771fd22ff200c16294", "author_url": "http://amiridis.net", "date": "Mar 15, 2010", "message": "The current format is great and helped me sleep many times. I mainly use it during my daily 60 minutes walking routine. It's the only time I don't sleep because that wouldn't be efficient.\n\nOf course any change is welcome."}, {"author_name": "Andrew lewis", "gravatar_hash": "0f52d9bce4427e6a0e36a0f7d78ec6ae", "author_url": null, "date": "Mar 15, 2010", "message": "Can we get the name changed in iTunes from \"Blog - StackOverflow podcast\" to something that starts with \"StackOverflow\"?\n\nAlso, I'm much more interested in development details about StackOverflow than information about StackExchange. I don't mean I want generic developer info, but more of a case study of the ins and outs of StackOverflow development."}, {"author_name": "Abraham", "gravatar_hash": "a48922e5d886767bd95505252e343c71", "author_url": "http://www.corevolt.com", "date": "Mar 15, 2010", "message": "I second Andrew's comment. I find the Stackoverflow development process to be inspiring, from the server selection to specifics about code implementation, specially since I work on the same Microsoft stack. Please keep all the existing content, or otherwise let us know, so I can start downloading like crazy."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack-peterson", "date": "Mar 15, 2010", "message": "Stack Overflow morning zoo crew!\n\nhttp://s235.photobucket.com/albums/ee242/bshiloff/?action=view&amp;current=DingoandtheBaby.flv"}, {"author_name": "Ivan Belov", "gravatar_hash": "59fc27af7133ea451cdaca3b2c5354d0", "author_url": "http://www.codermanager.com", "date": "Mar 15, 2010", "message": "I suggest that you'd take a break much longer than two weeks. :) You obviously need to recharge, get a fresh perspective altogether. It seems your venture is doing great and can survive without podcast for couple of months or so.\n\nGood luck! I really enjoyed listening first nine month of your podcast!"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack-peterson", "date": "Mar 15, 2010", "message": "This is sad news.  I enjoy the current format and Jeff and Joel's personalities. I want to hear of their continuing adventures tackling interesting software, hardware, social, and business challenges. As Jon Smock wrote: \"Most of us will never experience this kind of project.\" Their real-world developer and entrepreneur issues are fascinating.\n\nI also agree with Sosh and others that the open and honest discussion has been especially refreshing. But, I think this has been lacking lately. I get the feeling that Joel and Jeff have recently become too concerned with confidentiality and Stack Overflow trade secrets. That's a shame.\n\nPoint-by-point:\n\nless about programming and programmers\n- don't dedicate an hour to some obscure .NET or Java class library\n- do discuss general issues of architecture, patterns, and principles\n- do discuss project management strategies\n\nmore about SO, SF, SU\n- discuss interesting questions and answers\n- invite moderators and reputable users to guest host\n\nmore guests\n- invite SE operators (successes and especially failures)\n- developer/entrepreneurs\n- other SO and SE team/partners (get your VC to guest host!)\n\nfewer monologues\n- strongly disagree"}, {"author_name": "Matan", "gravatar_hash": "0bb7bf3089b704277bac6d9acc7bb22b", "author_url": null, "date": "Mar 15, 2010", "message": "Don't cut on programming and programmers topics. I'm listening to your podcasts because this is what interests me. I'm on StackOverflow first because I like programming, and only second because I like stackoverflow. Maybe you can start a Meta podcast (to which I won't subscribe) and talk about StackOverflow?\n\nI don't know who's the douche who gave you the idea we don't like listening to your personal views about things relating to programming (explicitly or otherwise), but at least I do. Yes, you should cut back on repeating yourself, but don't be overwhelmed by people who don't agree with you. Keep your opinions on the podcast -- it's your podcast after all.\n\nYes, more guests. Try to choose your guests based on how well they talk, not how much they know or what they've done in the past. I know it's hard to find such people without trying them out on a podcast, but that is to say seek for good speakers not impressing resumés.\n\nPlease don't bring ServerFault and SuperUser to the podcast. Please, please don't.\n\nHow about keeping an eye open for any (obscure or otherwise) \new topic that relates to programming? Any new language you found that might be interesting (even if it was there for 5 years already, but nobody heard of it). Any interesting tool you came across. Any productivity tips for programmers that you discovered. Any new programmer arrested for murdering his wife.\n\nMaybe try giving your podcast a presentation-feel: like, choose a single topic, research it thoroughly and dedicate a podcast for it. Not with a discussion flavour, but with a presentation flavour. Or maybe discussionish-presentationish.\n\nI donno."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Mar 15, 2010", "message": "@Matan \n\n\"Try to choose your guests based on how well they talk, not how much they know or what they’ve done in the past.\"\n\nYes, by all means, let's have vapid, good looking and smooth-talking people who know nothing and have accomplished nothing.  I am tired of hearing really bright people say \"um\" during the podcast - that is terrible.  I would much rather hear someone who never mis-speaks but is a dumb as rocks.  \n\nThose sound like great guests to me."}, {"author_name": "csmba", "gravatar_hash": "e8ec9371b0173179ee41dd68e0e80ddd", "author_url": "http://knol.google.com/k/csmba/free-tools-and-websites/2p76v0g9rhval/4", "date": "Mar 15, 2010", "message": "I was always disappointed with the lack of actually real-life description of problems, design and solution to SO as a product.\n\nI expected we will actually see things like \"we implemented this 3 tables () and then we had to change it to  since we had this problem.\n\nha,\nand here is the code to handle the rendering of the results on the page\n\nLike in school, it is always good to learn by example, and if the example is something you REALLY know (sine we use SO) then it is just that much more useful."}, {"author_name": "mrjtrue", "gravatar_hash": "415d48f49b177499256b0a408ba53622", "author_url": null, "date": "Mar 15, 2010", "message": "I too enjoy MORE talk about programming, programmers and technical stuff than just stack overflow, etc. chitchat"}, {"author_name": "Hogan", "gravatar_hash": "face3276756bf64319a7d1df0d194d5c", "author_url": null, "date": "Mar 15, 2010", "message": "What a bummer.  I really enjoy listening to you two talk... the topic does not seem to matter.\n\nFull disclosure: I only started to listen the last 20 shows or so, but I've been going back and listening to old ones and enjoying them too!!"}, {"author_name": "Andy", "gravatar_hash": "481be96b4cf3f3e717add09745ccc3e8", "author_url": "http://www.crawlabout.com", "date": "Mar 15, 2010", "message": "I find the podcast is something I look forward to.  I enjoy the current format.  Less stackoverflow stuff more programming related discussion.\n\nEither way i'm sure I will enjoy what ever you come up with. (Wow I must actually be a fan!)\n\nbtw http://www.crawlabout.com is a new search engine I've built while listening to your show!"}, {"author_name": "CarlieBoy", "gravatar_hash": "224d6b1e81d19d11648e3a6c56f947df", "author_url": null, "date": "Mar 15, 2010", "message": "I must say that the topics I enjoy the most is the really deep programming/geeky stuff and not so much the business side of Stackoverflow.\nJoel's monologues and Jeff's utter lack of response to jokes, I must say, always brings a smile to my face while on the buss, heading for work."}, {"author_name": "Olly", "gravatar_hash": "3d6de5277ae7dfb854cb3316eb982df5", "author_url": "http://www.lylo.co.uk", "date": "Mar 15, 2010", "message": "Joel, your monologues are the reason why I tune in every week!  What makes your podcast stand head and shoulders above *every* other tech podcast (and I have listened to them all, I have) is PERSONALITY. So, whatever you do, keep that in.  It goes a long way."}, {"author_name": "Michael A. Puls II", "gravatar_hash": "304d6e1b17c5bdd141f9dc5aef93587b", "author_url": null, "date": "Mar 15, 2010", "message": "I like the podcast as it is mostly. But, would like more guests and more programming talk (related to stackoverflow or not).\n\nThe last episode was a little dry for me. But, I figured you guys just have to get back in the swing of things.\n\nI have sensed some repetitiveness. Mostly, it's the \"Like I said before, this is what Stackoveflow is about...\". But, no biggy."}, {"author_name": "Geoff", "gravatar_hash": "1c8b162f95755fceb0f089bedd66e805", "author_url": null, "date": "Mar 15, 2010", "message": "Joel, I totally respect your desire to reduce pontification.  But, listening to you each week validate what I've been thinking, or forcing me to think in a different way has made me better at what I do.  So, change the podcast as you need to, but keep some aspect of you coming in and telling us all how we should be doing things and why we still need C programmers in the world!"}, {"author_name": "Wayne Koorts", "gravatar_hash": "ae020e99cc0f4e8a49961da01f07aafe", "author_url": "http://www.wkoorts.com", "date": "Mar 15, 2010", "message": "While I am happy with the show the way it is I would much rather you changed it than stopped altogether, and I have faith that whatever you guys come up with will still be awesome!\n\nJoel, I love hearing the wisdom of your programming experience, and your views on the psychology of programmers is something I haven't heard much about anywhere else.  It's also very clear that everything you talk about has been very well thought out over time, which makes them all the more solid.  This is also why I'm really sad that you're no longer blogging, but as long as the archives stay up the community will continue to benefit for years to come.\n\nThe one thing I think would be nice to add to the podcast would be guest programmers from the Stack Overflow community.  People who have a reasonable rep, not necessarily just 10k or even 5k plus, and a blog.  Maybe you could have people email in if they're interested in being on and then pick from that list every week, or second week.  Might be risky but might be AMAZING also!"}, {"author_name": "Brad Campbell", "gravatar_hash": "8edf3bc2bdca2f7f408938f5b409d568", "author_url": "http://www.bradcampbell.com", "date": "Mar 15, 2010", "message": "In my opinion, these are the best parts of the Stack Overflow podcast, in order:\n1. An interesting, well spoken guest.\n2. Specific discussions on a particular, real-world programming topic.\n3. Personal stories/opinions.\n4. Discussion about changes to the sites.\n5. Joel constantly interrupting Jeff.\n\nMore guests would be great, but getting rid of Joel's stories, the banter between Joel and Jeff, or discussions on programming issues would make the podcast much less interesting and therefore much less valuable."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 16, 2010", "message": "> Joel’s monologues and Jeff’s utter lack of response to jokes,\n\nWell, maybe Joel should be FUNNIER!\n\nI think my sense of humor is a bit darker and less slapstick than Joel's.*\n\n* I'd cite Perry Bible Fellowship as one of my favorite online comics, for example.. http://pbfcomics.com/"}, {"author_name": "a listener", "gravatar_hash": "e3b2f6cece4a7d02e58c5e5c3946be03", "author_url": null, "date": "Mar 16, 2010", "message": "I'm very happy with the current format. Please don't change it to much. The discussions between Jeff and Joel are very nice, funny &amp; interesting.\nIn special I love to here more about bootstrapping and going along with the VC invested startup company  around stackoverflow.\nGood luck your guys!"}, {"author_name": "Ilya Birman", "gravatar_hash": "4fbd7500ec74b8ec43a75d9bd35c4cf9", "author_url": null, "date": "Mar 16, 2010", "message": "Currently SO is the best podcast I know of, and I will be very unhappy if it dissapears. Changing format sounds scary. Now it’s good, what if it will be not good, you know? :-)"}, {"author_name": "Fredrik Holmström", "gravatar_hash": "f4438110ce4d4aa3fdacb07882e75bde", "author_url": "http://ironjs.com", "date": "Mar 16, 2010", "message": "Keep it the way it is, I like the current format. It's relaxed and easy going. \n\nBy far the best programming/tech/web podcast atm!"}, {"author_name": "Johan", "gravatar_hash": "ffbf4d2094927573d442f79c50d74d0f", "author_url": null, "date": "Mar 16, 2010", "message": "I'm also quite happy with the current format! To talk less about programming also sounds like a bad idea, since most of your audience probably are programmers. If you want to change something, more guests would probably be a good idea."}, {"author_name": "Jon Galloway", "gravatar_hash": "1c494896dd56e0e27253156c28f1dfb9", "author_url": "http://weblogs.asp.net/jgalloway", "date": "Mar 16, 2010", "message": "I love the podcast and would really miss it if it went away. I really like the conversations you guys have. Sometimes it's just fun conversation, sometime I strongly agree, sometimes I violently disagree. I like that, because most technical podcasts never express enough of an opinion for me to care one way or another.\n\nIf you were to change things around, I'd say get more guest on and involve them more. Seems like some of your guests are along for the ride rather than being the center of attention. I think you guys have the notariety and listenership that you could bring in some top guests, like some of the other speakers at webstock or something.\n\nThis blogging retirement thing seems a bit dramatic to me, but I can live with it. I will not permit the podcast to be shut down, however."}, {"author_name": "Henrik", "gravatar_hash": "fafb4771745e6a4da3d4df6c8215f6e4", "author_url": null, "date": "Mar 16, 2010", "message": "I like the current format, too."}, {"author_name": "Felix Leong", "gravatar_hash": "2ec836f495a5a58b1df5ae191488acf6", "author_url": "http://felixleong.com/", "date": "Mar 16, 2010", "message": "As much I liked the current format, I really welcome any change you'd like to experiment with. But the only thing I really don't want to see changed is the relaxing, conversational, laid-back dialogue. But I suppose with Joel and Jeff still manning the mic, we won't be seeing any drastic departure in terms of style and feel.\n\nWould really love to see more guest shows: I think one interesting idea would be to bring in some founders/key contributors of successful StackExchange sites and have a chat with them, would be more interesting if they aren't from the tech/startup background and talking on topics other than tech. I think I would find it interesting to imagine someone from Moms4Mom would come on the show and talk about parenting :LOLOL:. (this alone may break the positioning as a techie/programmer podcast)\n\nAlso I do wonder whether would there be room to give some love to SO Careers in the podcast. Some obvious ideas would be talking about interesting companies, interesting search term/hiring trends… I'm pretty sure there would be some fundamentally interesting stuff would come from there."}, {"author_name": "Nick Hawtin", "gravatar_hash": "880529a270bb4e844e31e31e6343179c", "author_url": "http://riskcontainment.com/", "date": "Mar 16, 2010", "message": "New Coke worked out great for Coca-Cola, why not?\n\nAs a big fan, who's never written let alone understood a word of code, I'm worried you might be about to break something unique. SO is a gift to those of us who work near tech, around tech - in short everywhere except right up at the coalface. Software guys that can speak English!? Eureka! \n\nRecommendation: do whatever it takes to keep the podcast interesting for the two of you and I'm sure we'll like - no, love - the results.\n\nThanks for everything so far, even if this is all we get.\n\nNick Hawtin\n\nCopenhagen, Denmark"}, {"author_name": "Gordon", "gravatar_hash": "0bf5f81f9852861944d7306696884226", "author_url": null, "date": "Mar 16, 2010", "message": "Possibly hire a part-time profession editor for the podcast. Someone who can edit when they go off tangent also removing duplications when they arises. Keeping the whole thing fresh.\n\nNot withstanding Joel and Jeff do a great job at the moment however I can only imagine how time consuming it would be every week for an hour long show.\n\nKeep up the good work, I'd be sorry to see the podcast disappear."}, {"author_name": "Joe F", "gravatar_hash": "65ef6a3b0543f13dfcb7dc8ea50c1ec9", "author_url": null, "date": "Mar 16, 2010", "message": "This isn't like when Facebook changes it's layout. This is like, Quality Entertainment vs A Scarier Form of Entertainment That I Have Yet to Discover. \n\nBut really, I most enjoyed the podcast where I was learning, but it felt like I was part of the discussion. Lately, when there's a guest, I don't feel that. Obviously, that's in my very humble opinion. \n\nTry a few different setups, maybe? Then let us vote again?"}, {"author_name": "Andrew Brehm", "gravatar_hash": "d0597e4239a3469367ea9c4df9dad423", "author_url": null, "date": "Mar 16, 2010", "message": "I like the current format. It's like a talk show for geeks.\n\nJoel's monologues are great. But I would like to hear more technical stuff, especially about crossplatform considerations etc. as well as Joel's opinions about programming languages, platforms, SDKs etc. (Not that I don't value Jeff's opinions, but he seems more Windows-centric than Joel.)"}, {"author_name": "Alan Mc Kernan", "gravatar_hash": "f48078cdad0a8a4112df367d105bafe2", "author_url": "http://www.poken.com", "date": "Mar 16, 2010", "message": "Yes, please save the podcast.\n\nI understand you guy's have lives too, and doing the podcast each week requires time and effort.\n\nPersonally, I look forward to listening to it each week. The lively, animated, and informal format is fantastic. I enjoy your opinions, and real-life experiences.\n\nIt would'nt bother me if you change the format, or get more guest speakers on board. Maybe you could choose a topic each week?\n\nEither way, I wish you guys all the best with StackOverflow, you've done the community a service."}, {"author_name": "Niklas", "gravatar_hash": "87c277137b44313d30b3ed1789072860", "author_url": null, "date": "Mar 16, 2010", "message": "Please don't shut it down. It's the best podcast ever - don't be so hard on yourselves! Very few people have the unique combination of traits that you guys have (e.g. programming knowledge, \"charisma\" and literacy) and that's what makes reading and listening to your stuff so entertaining."}, {"author_name": "Martin", "gravatar_hash": "e3af100e16281c1af1adf78b750232fa", "author_url": "http://www.invalidcast.com", "date": "Mar 16, 2010", "message": "The one thing you guys have over other similar podcasts is the informal, conversational style and it really works. \n\nPeople love just listening to what is a conversation, rather than a planned talk about a certain topic.\n\nI vote to keep the current format for sure."}, {"author_name": "Kyle", "gravatar_hash": "45f753cb5a80e3c80e2c9e8a49e61282", "author_url": null, "date": "Mar 16, 2010", "message": "This is very disappointing. I like the current format and look forward to hearing it weekly. I'm currently a Fogbugz/Kiln user and never would have been without this podcast!\n\nCaptcha: tanama took"}, {"author_name": "Jon Smock", "gravatar_hash": "7cf5af9e0f94976adae00ce7dfdd467b", "author_url": "http://stackoverflow.com/users/25538/jon-smock", "date": "Mar 16, 2010", "message": "I thought about this more later, and I realized you have every right to change the podcast or stop the podcast entirely.  I think the above responses are evidence enough of how much we all enjoyed listening and following your journey.  But, like open source software, this is a gift.  We can't demand anything more from you.  So I wish you the best no matter which direction it goes."}, {"author_name": "Travis", "gravatar_hash": "b2b360e6d04cd301094b828fb8a318f3", "author_url": "http://travisfischer.com", "date": "Mar 16, 2010", "message": "Absolutely keep it going! It's a great podcast, although it has been slumping lately.\n\nHowever, I think the opposite of what you suggested would help. Do not dilute the technical talk. Programmers are your audience and the joys and trials of programming is what unites us and makes the podcast universally accessible for programmers. All the focus on your specific projects is going to be less interesting than your programming, software business related rants, discussions, arguments, etc... You are interesting guys and your area of expertise is software/programming so stick with that.\n\nLess info about your specific websites/businesses and more about the generally applicable principles, details that you deal with is good. Think along the lines of what you write for Inc except with a programming specific audience. \n\nGuests are great! Every guest episode has been a highlight for me. That additional perspective helps reign in your stack-centric-ness."}, {"author_name": "Lorenzo", "gravatar_hash": "1595094fc2c924729d77273e425e67b6", "author_url": null, "date": "Mar 16, 2010", "message": "I'm very happy to hear this. I really like the podcast when it was new, but I've been bored with it for a long time now.\n\nIt's an excellent idea to go for broader topics. And it would be great if you could make it a bit more entertaining somehow."}, {"author_name": "Bobby Cannon", "gravatar_hash": "139b14c009a54a0d7c1c305ffe55086d", "author_url": "http://sharpdeck.net", "date": "Mar 16, 2010", "message": "DON'T CHANGE ANYTHING. Serious guys. The podcast is perfect and I have few podcast I really like. Stackoverflow podcast is one of the very few I really LOVE.\n\nFor all that is good don't change anything.\n\nMy two copper,\nBobby Cannon"}, {"author_name": "glaxaco", "gravatar_hash": "12528d0957525f720b9f3ab2e8a815de", "author_url": null, "date": "Mar 16, 2010", "message": "I'll echo many of the other comments, in particular:\n\n- Do what makes you happy\n- Keep it relaxed and informal\n- Guests are generally good\n- Discussions of interesting SO (&amp; related site) questions are always interesting\n\nIf you're worried about things getting stale or repeating yourselves, you could always cut back on the frequency of the podcasts. Maybe a biweekly or monthly schedule would give you more ideas and energy for each 'cast."}, {"author_name": "Stephen Breen", "gravatar_hash": "4a9b9143e398c6d8a6f58f6024707c70", "author_url": null, "date": "Mar 16, 2010", "message": "It's like finding out your close friend wants to have a sex change: you're not comfortable with it, and you want things to stay the same, but if that means a miserable friend then it's not worth it."}, {"author_name": "developingchris", "gravatar_hash": "1ce04312daddc2060e9f6d87805cad2a", "author_url": null, "date": "Mar 16, 2010", "message": "I like it the way it is. If you add intro music I'm out. I can't take any more intro music and beginning crap.\n\nBasically as it is now, its like we're just sitting at the  lunch table where you are arguing about this stuff. On occasion we invited a few more people to eat.\n\nFeel free to spice it up a bit, lets try a new restaurant, but if its a whole new game, no more banter around the table, then I'll go to lunch with your former guests."}, {"author_name": "Damien", "gravatar_hash": "16ceb28d7e6867f78e92c3b82ac01b48", "author_url": null, "date": "Mar 16, 2010", "message": "What would Ernie Wise have been without Eric Morecambe? Without Joel there no much point in that podcast.\n\nIf the lack of response from jeff piss you off, get rid of him for most of the show."}, {"author_name": "Daryl Spitzer", "gravatar_hash": "56dbb3799dd6358c3bee3468d0328046", "author_url": "http://yacitus.com/", "date": "Mar 16, 2010", "message": "My favorite Stack Overflow podcasts were the ones with guests.  Steve Yegge and Uncle Bob Martin were especially memorable.  It's been a while since you've had a guest.\n\nAnd I'd prefer you keep it technical and oriented towards programmers.  There are plenty of business-oriented and strictly promotional podcasts already."}, {"author_name": "Joel Barsotti", "gravatar_hash": "6d4c2c23fd707f84db28b38e5036795e", "author_url": null, "date": "Mar 16, 2010", "message": "Hello Joel,\n\nI know I'm a bit of a johnny come lately to the podcast, but I really enjoy the programming aspect of it.  There may be people who are more knowledgeable than you and Jeff, but few that make it more interesting. I listened to a few episodes around thanksgiving and found the podcast in it's current format so compelling I went back and listed to the entire archive.\n\nIf you had to take the podcast in a specific direction, I'd go with more community guests.\n\nOf course laughing at your jokes might require better jokes ;)\n\nThanks,\nJoel Barsotti"}, {"author_name": "Matan", "gravatar_hash": "0bb7bf3089b704277bac6d9acc7bb22b", "author_url": null, "date": "Mar 16, 2010", "message": "@tim: Funny.\n\nThere's a balance between knowing your stuff and speaking well. What I'm saying is that for a show, for a podcast, I prefer one thing over another. There are people out there who have done lots of coding or lots interesting stuff that relates to software development or software developers -- and also lots of public speaking. I love listening to those.\n\nThis is in contrast to people who've done lots of coding (or lots of other interesting stuff) but next-to-no public public speaking. Or, they just haven't caught the skill for public speaking. These people are probably awesome to chat with, but imho not so suitable for a show I'd enjoy so much.\n\nI do most of my learning by reading and doing, not by listening to podcasts. This is just for entertainment."}, {"author_name": "Robert", "gravatar_hash": "0ebb76444bec6d7027af1e488dd89c7b", "author_url": "http://onedozenbagels@blogspot.com", "date": "Mar 16, 2010", "message": "What Makes for an Interesting Podcast? Interesting Hosts\n\nThe topic can draw you in. The format can give it shape. A guest can pique your interest. But none of that is enough to make a good podcast. The one thing that makes or breaks a podcasts is the hosts. You guys are up there with the best of them. You have good chemistry, interesting things to say, and there are enough jokes to keep things lighthearted. I wouldn't change a thing.\n\nIf you feel that things are getting stale, then bring in more guests. That will help to change the conversation from week to week."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Mar 16, 2010", "message": "All you need is more Miguel de Icaza."}, {"author_name": "Pablo A", "gravatar_hash": "fb354accf9ba93229aa735557abf316b", "author_url": null, "date": "Mar 16, 2010", "message": "I will really miss your podcast. Opposite to what seems to be the common theme here, I did not like most those with guest. The ones I felt more interesting where those in which you or Jeff had strong opinions about a particular theme. Say Twitter, or Silverlight, or flash.  Same thing with your blogging.\n\nIt kind of gave me an intro to that particular tech, and made my take position.\n\nI would like you take a break and then start over, talking to jeff and an ocassional guest, using as a starter what you where doing that week, but feeling free to ramble."}, {"author_name": "Dimitry Z", "gravatar_hash": "41bd070da37f1b03b8f272d741406545", "author_url": "http://webit.ca", "date": "Mar 16, 2010", "message": "To echo @Robert and others, I would like to see *more* programming and tech on your podcast. Take the best of Stackoverflow and talk about it. Programming gotchas, interviews with some of the top people,  SO trends. That's what I enjoyed most in every episode."}, {"author_name": "Tom", "gravatar_hash": "d6fb3e436ce94206550908d76931e121", "author_url": "http://www.catnapgames.com", "date": "Mar 16, 2010", "message": "Interviews! John Carmack!\n\nThe digg/slashdot interview format is cool. Ask questions from the community that get the most votes. I'd welcome less talking from you when someone else is there - let them speak more, ask questions, listen. If you really have stuff to say, first end the interview, say thanks &amp; bye, then continue without them."}, {"author_name": "B", "gravatar_hash": "b2bccad5ec08b50a9df7e7bcf18a2b65", "author_url": null, "date": "Mar 16, 2010", "message": "Great podcast. I say don't change a thing other than more guests."}, {"author_name": "JM", "gravatar_hash": "3bb08583a7e7627f184b3ab279c2dd71", "author_url": null, "date": "Mar 16, 2010", "message": "The SO podcast is one I genuinely look forward to.  I think Joel gets too self-critical at times, but at least he understands his niche.\n\nI think the podcast sometimes shoots down tangents a little too easily.  I'd like to hear more listener questions and a little less \"uh... do we have a listener question\".  However, I do realize that a free-to-download podcast can't have the same production value of Transformers 2.\n\nI'd probably stop listening to the podcast if it tried to stampede down the same presentation format that Polymorphic Podcast, .NET Rocks and Hanselminutes.  They have the podcast-as-powerpoint presentation market covered.  I listen to the SO podcast because I enjoy listening to smart people have smart discussions/debates."}, {"author_name": "No verification!", "gravatar_hash": "b02cecec1e2ed853c67e5fb0ba94daa8", "author_url": null, "date": "Mar 16, 2010", "message": "May be discussing your sexual lives"}, {"author_name": "Roalt", "gravatar_hash": "c4c168e9f1f4711c9c1b84240464980b", "author_url": "http://www.roalt.com", "date": "Mar 16, 2010", "message": "I like your intelligent discussions, please keep the podcast!\n\nSome ideas: Your (both) opinions are very much valued, keep this in the podcast.\n\nMaybe you can comment on Programming news, developments, new technologies, not only that what spins-off from stackoverflow development.\n\nGood luck!\n\nRoalt"}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Mar 16, 2010", "message": "&gt; I think the podcast sometimes shoots down tangents a little too easily.\n\nThat’s the only thing I’d change — make each show a little more focused.\n\nNot too much: the original idea, if I remember correctly, was you guys recording and making public the weekly phone call you’d be having anyway about Stack Overflow whilst building it. The informal, conversational style is great — both of you have long and broad experience in building great software, so it’s genuinely interesting just to hear you shoot the breeze — but like good conversations, it’s better if it doesn’t drift.\n\nAlso yes yes moar guests plz, great for the weeks when there’s not much going on in the Stack Overflow world."}, {"author_name": "John MacIntyre", "gravatar_hash": "31f9c461f411969e33ca6bd13b536360", "author_url": "http://whileicompile.wordpress.com/", "date": "Mar 16, 2010", "message": "I also like your current podcast, but it is kind of inefficient and unfocused.\n\nI think this podcast would be an awesome platform for you to interview other awesome developers.  Maybe interview all the programmers on the top 5 pages of users.  That might be kind of interesting (albeit possibly very difficult to perform an engaging interview)"}, {"author_name": "PhantomTypist", "gravatar_hash": "bb54d41013255a7697a412d3e586c890", "author_url": null, "date": "Mar 16, 2010", "message": "Are you kidding me!?!\n\nWhy would you change the podcast format?  I love the way it's going!"}, {"author_name": "Pandincus", "gravatar_hash": "3032cb003c381ca7466775e08d8cbf5c", "author_url": null, "date": "Mar 16, 2010", "message": "\"Less about programming and programmers, and more about the broader world of Stack Overflow, Server Fault, Super User, and Stack Exchange.\"\n\nWell, I feel that you folks DO talk about the broader world of Stack Overflow, Server Fault, etc ... what, you mean like, talk about it more? What about? Anyway, who's listening to your podcast but programmers who enjoy programming? I find what you currently talk about (even when it rambles) very entertaining -- not at all tiresome.\n\n\"As a part of my retirement from blogging, I’m trying to stop personal public pontification, podcast or otherwise.\"\n\nI really don't think you present yourselves in a way that you are the gods that must be listened to OR ELSE. You're both usually fairly humble ... okay Joel, maybe you get on the lecturing block now and again, but usually the points you bring up are great! I've found a lot of good advice in your monologues, whether or not you feel they're useful.\n\n\"I think we’ve started repeating ourselves quite a bit.\"\n\nHmm ... OK, I agree with this. But that's the thing -- its so informal, of course you two repeat yourselves. You're just two people having a conversation, and that's part of what I love about the podcast.\n\nAnyway, just my two cents!"}, {"author_name": "Stephen", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Mar 16, 2010", "message": "The banter between the two of you is great - and I actually like/look forward to the disagreements - its great to see passion for a subject.\n\nSpecial guests that get into the mix are great too and always welcome.\n\nIt would be nice to hear some more topical discussions on technology as it is released. (e.g. Windows Phone 7, IE9 preview, etc.)  As well as thoughts on technology direction... e.g. 3yrs from now, how do expect the smart phone landscape to look with regards to iphone, blackberry, android, etc.\n\nHowever as always, any week with a podcast is a good week!\n\nCheers,\nSteve"}, {"author_name": "Nick Josevski", "gravatar_hash": "47ea641609d2e7895b9dd3f20ca3ffe5", "author_url": "http://nickjosevski.wordpress.com/", "date": "Mar 17, 2010", "message": "Not sure how accurate a poll/survey would be, but it might help if it was added as an update / tweeted about.\n\nExample options:\n - End it\n - More guests\n - Keep it the same\n - Other type of revamp \n\nMy vote would be to keep it the same - really enjoy it as is, but I have no objection to more frequent guests."}, {"author_name": "kost", "gravatar_hash": "335fc20f7203bda8fdcd109410ad1683", "author_url": null, "date": "Mar 17, 2010", "message": "I would love to actually hear more talk about programming/technical stuff.\nSO related stuff are great, but for me, you are the only good programming podcast out there, and you should stay that way :)"}, {"author_name": "rhubarb", "gravatar_hash": "61396c69040bbc56dbad1c5c71ac27d2", "author_url": null, "date": "Mar 17, 2010", "message": "NO DISASSEMBLE!\nDon't change the podcast.\nI can live with repetition and for newbies, it's all, well, new. Anyway.\n\nThe mix with pontificating vs talking to guests is just perfect as it is.\nSome guests are good - too many just gets boring (e.g. Hanselminutes format. I like Scott Hanselman, and his podcast is useful and his interviewing technique is great, but the podcast just isnt nearly as interesting as SO because often the guests are boring).\n\nI've been reading Joel on Software since the start, and it's been just fanstastic as a way to get access to all of the wisdom Joel has garnered and is able to dispense so eloquently... The podcast goes even better - every week Joel and Jeff are dropping nuggets of wisdom, and especially the stories and experiences Joel offers. These are totally off-the-cuff, fresh and every bit as good and valuable as the carefully crafted essays on JoS.\nI often find myself thinking during the podcast that the sheer density of entertaining wisdom around the software business that you _generously_ dole out in this unscripted podcast leaves all other such sources for dead. \n(Which I guess all argues in favour of your decision to discontinue the blog- still, damn shame, I wish you could keep that up too)\n\nDon't turn off that tap! Don't stop the stream!\n\n\nThe back-and-forth between Jeff and Joel has the ideal dynamic (and hey, I'm laughing at the jokes, no need for a laugh track). It must be getting better in fact, since lately this is my favourite podcast each week (inched ahead of TWIT even)\n\nkeep it up, and keep it the same - please!"}, {"author_name": "Skilldrick", "gravatar_hash": "2b0a93dc132be4bf3b15b50c8a7e8089", "author_url": "http://www.skilldrick.co.uk", "date": "Mar 17, 2010", "message": "Just to join in with the general vibe I'm getting here...\n\nChange the format if you want, but please please please **don't** talk less about programming and more about SO etc.\n\nI thought Jeff was anti-meta-discussion!"}, {"author_name": "mmcglynn", "gravatar_hash": "50cda789575d42daab8775666867a659", "author_url": "http://www.reignition.net", "date": "Mar 17, 2010", "message": "I'm a Joel fanboy, I like has opinions even when repeated. More programming specifics, though, would be great. I like Jeff too, but Joel is my main man!"}, {"author_name": "joe", "gravatar_hash": "1110c2bdb3b7be8380de211e85fefdb3", "author_url": "http://nofouls.com", "date": "Mar 17, 2010", "message": "I like the current format. StackOverflow is my favorite podcast and I also listen to TWIST, TWIT, Radio Lab, This American Life."}, {"author_name": "Nathan Bowers", "gravatar_hash": "8ef1faca1032b44b8ca486a4e52501ed", "author_url": "http://uxhero.com", "date": "Mar 18, 2010", "message": "I nominate Wil Shipley for Joel's replacement.\n\nWil is accomplished, cares about his craft, and would bring fresh experience to the table: Mac and iPhone dev, running a software business, and he's been around long enough to have good war stories.\n\nHis back and forth with CodingHorror on Twitter is lively and fun, would be great in podcast form. With their strong points of view and differing backgrounds, I think the podcast would crackle."}, {"author_name": "Jonathon Watney", "gravatar_hash": "0f0f5d11143921e700f2d98a2a7850cb", "author_url": null, "date": "Mar 18, 2010", "message": "+1 Wil Shipley if Joel takes off. Or even have Wil as a regular guest or fill in."}, {"author_name": "Stewart Robinson", "gravatar_hash": "5cf02781a271470da9a3627d43bffb59", "author_url": "http://stewsnooze.com/", "date": "Mar 19, 2010", "message": "Go towards the @Jason approach. Why not even make it This week in programming with tech guests using the this week in startups formula."}, {"author_name": "Timothy", "gravatar_hash": "ae5a0ccc5ab519f0a66b3ed0620c855b", "author_url": null, "date": "Mar 20, 2010", "message": "Keep talking about programming.  Start doing more of it even - talking about problems you encounter in programming, your approach to technical issues, what you find cool in your work as programmers, etc.\n\nIt was nice to have the development of StackOverflow as the background of the podcast, and hear about interesting things that go on in the realm of StackOverflow and co.  But this was really mostly just an excuse for Joel &amp; Jeff to talk for an hour and broadcast it live.  The talk about StackOverflow tended to general and high level, so I can't see talking chiefly about it an hour a week being so interesting -- unless either (1) the talk gets more technical and deep, or (2) the target audience shifts away from programmers.\n\nThe form of an informal discussion between Joel, Jeff, and the occasional guest(s), that happens to be recorded and published, is also nice, as opposed to some staged \"talking to the audience\" thing.\n\nJoel mentioned interaction with people in his blog as the main motivation for quitting blogging.  If the talk about people in the industry or the \"personal pontification\" is also the main drive behind the change in the podcast format, just do less of that.\n\nI personally am a bit tired about all the talk about \"community\" that arose in recent episodes with the shift of focus from the development of the technology behind StackOverflow to fine tuning its use and watching other sites based on the same engine grow.  It may just be because I am a programmer and more interested in software than communities at that level, but I have the feeling it's more because so much of it is just obvious and repeats itself.\n\nBring in more guests, not business people who deal with software, but hardcore prorammers who write or wrote awesome code and have things to say about it -- John Carmack, Charles Petzold, Rob Pike, Guido van Rossum, and lesser known people of that class."}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": "http://echoreply.us/tech/", "date": "Mar 21, 2010", "message": "It would be neat if you could discuss how people are (or aren't) using the database dumps, or invite people to do something interesting with them.\n\nIs SO popular enough now to be a good measure of what people are working with and how they expect it to work? If so, how are various projects putting this data to work?"}, {"author_name": "Alex Andronov", "gravatar_hash": "542f45519ec27c8147da98b9226f331c", "author_url": "http://www.gamboling.co.uk", "date": "Mar 24, 2010", "message": "How about this as an idea... Before you start the record you decide on 2 topics (1 each) and 2 trilogy / meta / stack exchange questions (1 each).\n\nBefore you start the record proper you create a wav / mp3 or ogg vorbis file of you saying the topic in an introductory way eg:\n\nJoel: Joel's Topic - Programming underwater - is it even possible?\n\nJeff starts off with the answering but of course it's a discussion. And you're limited on a timer to 10 minutes total - but of course you can bail early.\n\nWhen you have guests they suggest both topics and you guys still find the questions."}, {"author_name": "Dzejms", "gravatar_hash": "84e1ba0c41dc6d5e61c48c9352026239", "author_url": null, "date": "Mar 24, 2010", "message": "Keep the format, more MVC tho plz."}, {"author_name": "Mike May", "gravatar_hash": "08b45d1b1a04e4b5014a11d0844779e3", "author_url": null, "date": "Mar 24, 2010", "message": "I like the podcasts as they are but I think you're probably sensible to look at tweaking the format before it get's stale.  A mix of guests programming, SO, technology gurus would be good.\n\nGood luck to Joel giving up the PPPs.  I shall miss them."}, {"author_name": "Damien", "gravatar_hash": "16ceb28d7e6867f78e92c3b82ac01b48", "author_url": null, "date": "Mar 24, 2010", "message": "Is there discussion bout podcast future on Meta?"}, {"author_name": "Fredrick Pennachi", "gravatar_hash": "80868923b060c85c9704f2e09fd74bae", "author_url": "http://fredrickpennachi.info", "date": "Mar 24, 2010", "message": "I think the best parts of the podcast are when Joel and Jeff are disagreeing about some programming concept.\n\nPerhaps if instead of interviewing people, you get a couple of guests on each episode who hold opposing viewpoints on particular programming issues and let them argue it out.\n\nThe guests need not be famous people or people associated with a popular project, they could be regular SO users.\n\nThen, other SO users/listeners could vote on who they thought was right and that person could win more rep, or a prize, or something like that.\n\nI know, it seems a bit gaudy but it might be fun ^^"}, {"author_name": "Mr. Berna", "gravatar_hash": "2cb201decb1ace6499b271e3c8779c7a", "author_url": "http://www.ericberna.com", "date": "Mar 25, 2010", "message": "Lately the podcast has been more the \"Meta\" podcast than the \"Stack Overflow\" podcast.  I think it was in Joel's last Inc. column that I read the reason behind the success of Joel on Software: that he wrote about software development, not Fog Creek.  Joel seems to be forgetting that with the Blog Stack Overflow podcast.  The latest episodes are not about programming, but about building the new Stack Exchange business.  \n\nIf Jeff and Joel continue with this trend, they may have an audience in Stack Exchange site owners, but that won't include me. \n\nWhat I want to see is a podcast about the content of Stack Overflow.  Jeff and Joel can discuss the interesting questions posted on Stack Overflow and invite guests to cover the hot topics."}, {"author_name": "Simon Rodia", "gravatar_hash": "04c965e86383cc6c24bb269c88d8b82d", "author_url": null, "date": "Mar 25, 2010", "message": "So many of the users on StackOverflow are incredibly knowledgeable and passionate about what they do. I would love to hear from some of them.\nWhat they are working on how they got into programming.\nI always enjoy good war stories."}, {"author_name": "Brendon", "gravatar_hash": "13bf2d79c001944892d0791c13e1c274", "author_url": null, "date": "Mar 25, 2010", "message": "love the show but keep having people on, would like to hear more people from oss. Have the vbulletin phpbb guys on. Love the show just have more coders on from different projects."}, {"author_name": "Jarrett", "gravatar_hash": "62360ae4de5346051017a87fdd31c3cd", "author_url": null, "date": "Mar 25, 2010", "message": "When I really think about it, my favorite part of the show is Joel and Jeff arguing about things. If you have guests on that one or both of you basically disagree with, I think that would make for good shows, so you can all disagree about things and have interesting debates. So next time there is a disagreement about hosting DNS or source control or whatever, go find someone who is an \"expert\" on that topic and have them on and talk about details that developers would like. Just an idea."}, {"author_name": "Kam", "gravatar_hash": "c8d07780d01616519c7f19a967f3b7d8", "author_url": "http://seeclickfix.com", "date": "Mar 25, 2010", "message": "If I could wave a magic wand the pod cast would work like this:\n\n- A totally bad ass hacker programmer/technical person on each show, some one who could have been interviewed for a chapter from coders at work. Or is in the trenches right now and belongs in the book in 5 years.\n\n- Spend twice as much time talking with the guest. Have them tell war stories or describe their current research/work (example podcast #50)\n\n- Have Jeff tell a story about some hard technical topic/problem he is working on (like forcing networking duplex and why it can cause failure).\n\n- Almost nothing about the trilogy sites. Unless it comes up and is relevant.\n\nYou guys have the access and ability to deeply interview people most of us will never meet. You guys have the chops to push people to express the essential and not fluff it up.\n\nBasically I would like the podcast to be the coolest graduate level CS speakers seminar of all time.\n\nI understand if your business needs require more \"marketable\" content which could garner a larger audience. Thought I should take a stab at getting the best thing ever. Thanks for all the mental stimulation and for all the chances to learn more about our craft. Cheers!"}, {"author_name": "lh", "gravatar_hash": "33974ac55e5240bcc34a067a5644726c", "author_url": null, "date": "Mar 25, 2010", "message": "Hi,\n\nI would really like to see (or actually hear) quality guests from all different professions. If you are going to introduce some music etc please try to control yourselves. Nobody likes the excessive music playing of Jason Calacanis' podcast. You should rather do your podcast in a no-nonsense way like Scott Hanselman does."}, {"author_name": "Jakob Eriksson", "gravatar_hash": "420430937af91f300a417cb0343fe8c9", "author_url": "http://vmlinux.org/", "date": "Mar 26, 2010", "message": "Guys!\n\nI love you both and what you do. I would very much miss you Joel if you disappeared from podcasting. You put something fun into my commute to and from work.\n\nThanks!  I listened to all the backlog after I found you around ep. #30 or so."}, {"author_name": "Gary Alexander", "gravatar_hash": "3568292ea564bb31bcb4a68ef947fda6", "author_url": null, "date": "Mar 29, 2010", "message": "I thoroughly enjoy your shows, but feel the format is a bit tired.  Please keep the discussions of questions.  Better quality guest would help. Keep the discussions of StackOverflow features to a minimum.  Widen your subject matter to include more general social networking topics."}, {"author_name": "Dan Corder", "gravatar_hash": "83823500659152fbff48600d85f3a2c5", "author_url": null, "date": "Mar 31, 2010", "message": "I've just listened to the last podcast (yes I'm a little behind) and I just wanted to comment on what I hope was a throw-away comment by Joel. Please don't go to video.\n\nOn an iPhone at least a video podcast means that the touchscreen is always on whilst the podcast is playing (locking the phone stops the podcast), and you can't do anything else with the iPhone at the same time.\n\nAlso, even if you have good visual content I'd probably stop listening (watching) as I mainly listen to podcasts whilst walking.\n\nAnyway, thanks for the old podcast that I have enjoyed listening to, and here's hoping I can continue listening to the new podcast whatever it may turn out to be."}, {"author_name": "Kamil Zadora", "gravatar_hash": "ce9a46a386f4cc5aaa71c683b8027cb0", "author_url": "http://kamilzadora.com", "date": "Mar 31, 2010", "message": "Have you thought about joining with Twit.tv network? I think they are missing a programming oriented podcast, and since that you are not a hardcore one, and there is a lot about community building in your content you fit there quite well. They could help you with live streaming and engineering of the podcast too."}, {"author_name": "Toby Ho", "gravatar_hash": "a333869fa8934ab32efb4e78e7c1dff1", "author_url": "http://tobyho.com", "date": "Mar 31, 2010", "message": "As a listener who listens on and off, I thought I would provide my 2 cents. The thing about the podcast I don't like are you guys going on and on about the website itself. You can only beat a dead horse so much. I would like to see you guy diversify your topics more. One way to do this is guest interviews, which I love and you already mentioned you are going to do more of. Another way is to talk about the news - this is what many podcasters do. Every week gather a list of items from your news/CSS feeds, and talk about them."}, {"author_name": "David", "gravatar_hash": "8c76979fc8c7453cea6af9643954d7f7", "author_url": null, "date": "Mar 31, 2010", "message": "I would like to hear more about the real world problems and solutions of running a top 1000 web site. This sort of advise from people who have been there is invaluable for those of us who aspire to also run successful sites one day.\n\nPlease try and keep some of those discussions in the new format podcast."}, {"author_name": "Arne Evertsson", "gravatar_hash": "c938e635f9e3b38b23fd735b6a45ef56", "author_url": null, "date": "Apr 01, 2010", "message": "Talk business!"}, {"author_name": "daniel", "gravatar_hash": "63942eaa9397ae5c11fc1799cead9067", "author_url": null, "date": "Apr 03, 2010", "message": "Please never allow joel to play music on the podcast any more i am still having nightmare because the yikes (i will never call that music) he played in the podcast 85!!!."}, {"author_name": "Dan Bays", "gravatar_hash": "9156a60501b69ce0e38b7288d03762a7", "author_url": "http://comrec.com", "date": "Apr 08, 2010", "message": "In your last podcast you mentioned your equip is failing and you wanted something like Twirt.  I work on a programming project that controls and works with the IP based radio station equipment Leo Laporte just put in.  So if you are serious we may be able to help.  But my advice would be to forget the gear and outsource the production to someone like us so all you have to worry about is dialing in, and somebody else gets to worry about levels/editing/etc.  Give us a call if you are interested.\n\nThe more you can do on programming concepts with specific examples and the less on Stack overflow the better.  The discussion on Stack overflow was interesting in the beginning when it was about the prgramming challenges of creating the site.  I'd like to see it get back to that more."}, {"author_name": "Mark Howard", "gravatar_hash": "948627a3c67aeaea0049106c6a57be49", "author_url": "http://www.elexient.com", "date": "Apr 14, 2010", "message": "More Q&amp;A and LIVE dialog with the listener asking the question!...\n\nLately, I've also been listening to the Dave Ramsey Show on my Zune as Podcasts.  And I can't get enough of it.  It is interesting, entertaining, funny, sad at times, and everything else.\n\nThe reason it's so interesting to me is because it is real life people calling in to talk about real life problems that I myself could be having.  I love hearing somebody call in with a similar situation as mine and hearing what Dave has to say about it.\n\nOn the Stack Overflow Podcasts, there are the \"Listener Questions\" where you hear about people's real life problems as well.  However, you only get to hear a pre-recorded question and you don't get to hear what the person asking the question thinks about the answer, maybe further clarification of the question, etc., etc.  \n\nOnce you hear the question, you get to hear what Joel and Jeff think about whatever subject was brought up.  These are the most interesting moments of the podcast for me, especially when I can relate to the topic.  \n\nAnd so, I propose a Podcast Format where a caller calls in to ask a question and Joel and Jeff talk with the caller and have a dialog with them.  Without going as far as actually broadcasting LIVE on the radio, I believe this is technically possible.\n\nIt's basically Q&amp;A with Jeff and Joel and since StackOverflow is a Q&amp;A site I think it fits..."}, {"author_name": "Andrew R.", "gravatar_hash": "519f51ec8eafd71703f9698c330fa757", "author_url": null, "date": "Apr 15, 2010", "message": "Whatever you do guys, hurry up!\nI need new episodes to make my commute enjoyable again,\nand as motivation to create something good for the world myself.\nKeep it up!"}, {"author_name": "phil colbourn", "gravatar_hash": "cd2ea9a49f4d261c83eda340ac0326fe", "author_url": "http://philatwarrimoo.blogspot.com", "date": "Apr 17, 2010", "message": "I like the current format and how it has slowly changed over time.\n\nMy fear of a new/different format would be like if Get Smart changed their format - it might be good, but would I be happy with it?\n\nIt will still be Jeff and Joel won't it?\n\nI will say 'Thanks for the podcast and all you and your teams efforts.' - 'cause I might not care to thank you if I don't like the new format. \n\nWhen CUSTOMers move away they don't often let you know why."}, {"author_name": "phil colbourn", "gravatar_hash": "cd2ea9a49f4d261c83eda340ac0326fe", "author_url": "http://philatwarrimoo.blogspot.com", "date": "Apr 17, 2010", "message": "One more thing...\n\nPlease entertain."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.systempuntoout.com", "date": "Jan 10, 2011", "message": "I love that format, it does not need any changes in my opinion.\nYou are really great and the podcast was interesting, funny and entertaining, period.\nThere are a tons of new cool things happened to Stack Overflow/Stack Exchange to talk about.\nPlease start it again."}]}