{"response": [{"author_name": "Peter Stegnar", "gravatar_hash": "6310e30d9a42af8321feda96250d40da", "author_url": "http://blog.stegnar.com", "date": "Mar 12, 2010", "message": "-&gt;Joel is ending his blog\n\nIt is said to hear that."}, {"author_name": "Anton Geraschenko", "gravatar_hash": "bb9c1fa136cbda222700efff19d8b171", "author_url": "http://mathoverflow.net", "date": "Mar 12, 2010", "message": "Re: people being unimaginative about how SO could use VC.\n\nIt's really easy to imagine what SE could do with a big pile of money, but quite a bit harder to image what SO could do with it. SO has basically saturated the market for programming questions (to within an order of magnitude). You could hire a new developer or two, or perhaps launch a couple of extra services (like careers), but I don't see a way that SO itself could grow a lot bigger given a bunch of cash.\n\nI hang around meta.SE more than SO or meta.SO, so I may have a completely different point of view from most people, but I was pretty confused when <a href=\"http://meta.stackexchange.com/questions/4352/what-will-vc-investment-mean-for-stackexchange/4356#4356\" rel=\"nofollow\">Joel wrote</a> <em>\"At this point we are talking about raising money for Stack Overflow, not Stack Exchange.\"</em> Given that Joel's article said <em>\"Now we’re biting off the bigger goal of changing the way everyone gets answers to their questions on the Internet\"</em>, it seems crazy to say it has nothing to do with SE. I think this disconnect made (makes?) some people on the SE side nervous.\n\nOn the SO side, people probably think (thought?) that the only reason to seek VC is if you're planning on making some sort of big change(s). You've basically always followed the path of tweaking SO to make it more awesome, so the prospect of big changes is a disconnect that makes people nervous."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Mar 12, 2010", "message": "Just to clarify my Meta question a little, I wasn't so much worried about what would happen to the site itself... I'm comfortable trusting Jeff and Joel on that.\n\nI was just concerned about what can happen when money gets involved - unintended consequences and secondary effects basically.\n\nLooking forward to hearing more though :)"}, {"author_name": "Marc", "gravatar_hash": "7c3f63b2f0e528bcec32e18b78d46f17", "author_url": "http://marcellusmiles.com", "date": "Mar 12, 2010", "message": "Referring to \"If you consider that our core mission is to kill software like vBulletin and phpBB\". \n\nWhy is that? Why must you \"kill\" another company/service.  Why cant you both co-exist.  Message boards are needed just as much as the type of framework you have built with SO.  \n\nIf that is your core mission, you may want to modify it some as from a VC's point of view many play the \"we want to kill xyz\" game and it's just not the right attitude."}, {"author_name": "Jakub Narębski", "gravatar_hash": "672aa8b373071ef9f06db563d1c08d77", "author_url": null, "date": "Mar 13, 2010", "message": "@Marc: I think \"kill vBulletin/phpBB\" refer to replacing forums for Q&amp;A, something for which web fora are ill suited.  Q&amp;A needs specific, targeted software."}, {"author_name": "HardwareGuy", "gravatar_hash": "fcfc36d64bd909df102dc91c961554af", "author_url": "http://www.google.com/profiles/hardwareguy", "date": "Mar 13, 2010", "message": "I can't download or stream the podcast.  Anyone else having that trouble?"}, {"author_name": "Martin O'Connor", "gravatar_hash": "70d63510b63e2b8b6ebcd9595f1879e2", "author_url": null, "date": "Mar 13, 2010", "message": "Looks like the Conversations Network site is down right now which means I cannot download the podcast :("}, {"author_name": "Justin Dearing", "gravatar_hash": "735a05084346db68dff750870654da3d", "author_url": "http://justaprogrammer.net", "date": "Mar 13, 2010", "message": "@Marc, what is wrong with a mission to destroy something that you deem bad? If you do that, you free the resources dedicated to maintaining that bad software to do other things."}, {"author_name": "Alex McBride", "gravatar_hash": "8a5f65062b9908152a7b00fab3df6c58", "author_url": null, "date": "Mar 13, 2010", "message": "I'm glad to see you guys are continuing with the podcast. :)"}, {"author_name": "Ajay", "gravatar_hash": "e453a2ee10ea548127d4801464b9cc43", "author_url": null, "date": "Mar 13, 2010", "message": "Hello, long-time listener, first time commenter.  I think the problem people have with your raising VC is that you're essentially selling out.  The only reason that stuck out for me from Joel's blog post is the one about why you <i>shouldn't</i> raise VC: you have no idea how else to make money.  The last decade or so has been littered with startups that had no idea how to make money, raised a bunch of VC money, then failed spectacularly.  It really doesn't matter if it's Joel and Jeff in control, once you raise many millions of dollars, you have to pay that back someday.  People are skeptical that you have hit upon some monetization scheme that none of those failed startups were able to find and understandably so.  If your solution is ads, let me tell you now: it will fail.  So far, only search ads have worked.  If it's paid jobs listings, people are understandably skeptical that you need millions to scale that up.\n\nIf you were merely raising money, I think people would be fine with hearing that you've hooked up with some seed or angel investors that will put in half a million to $1+ million to grow faster.  However, once you start talking much larger VC sums, it is a flashing red light that this service won't last, because of our recent experience with many sites like that.  At best, the founders sell out to some dumb giant corporation like Yahoo, Google, or Ebay, where the product is taken out back and shot.  You may become rich off that, if you somehow manage to hit that acquisition lottery, but it's not what people want to hear for the service.  I keep using the word \"people\" because I don't actually use stack overflow, ;) I just enjoy the podcast and thought I'd put my two cents in."}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Mar 13, 2010", "message": "This was a vintage episode for those playing the Stackoverflow Podcast drinking game :)"}, {"author_name": "Kevin Connolly", "gravatar_hash": "30d5456d1b71664feb5cda0233bf0d0d", "author_url": "http://www.kconnolly.net", "date": "Mar 13, 2010", "message": "Did you get that quote from the infamous Quotes thread?  http://stackoverflow.com/questions/58640/great-programming-quotes/314416#314416"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Mar 13, 2010", "message": "Why kill vBulletin and phpBB?\n\nThey don't work for your vision of SO - but they do work for lots of forums where SO doesn't.\nI can't split SO into different sections\nI can't use images\nI can add an attachment eg. to submit bug fixes on an OS forum.\nI can't link it to a mailing list."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Mar 14, 2010", "message": "I don't think there's any danger of the Stack Overflow engine really killing vBulletin and phpBB any time soon, at least for discussion forums."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Mar 14, 2010", "message": "@Ajay, where do people get this idea that StackOverflow is not already profitable and successful on its own, sans VC (and even sans StackExchange monies). Listen to the podcasts and read the blog posts, it's obvious that the site is making enough money to pay for its hosting and for several employees just in advertising alone. Look at the careers pricing for employers and then look at the employer counts on the site (I assume not everyone has this, but it's easy to get if one is curious), even if the stats are untrustworthy in some way or other it's still obvious what level of revenue they're earning off of it.\n\nStackOverflow could continue, profitably, indefinitely exactly how it is today. Which, as Joel points out in this podcast, makes it the perfect candidate for applying VC in order to grow it, because the SO folks already know how to spend (and not spend) money effectively, so infusions of cash will be used effectively.\n\nAlso, Ajay, you seem to have a misapprehension about the nature of investment. You say \"It really doesn’t matter if it’s Joel and Jeff in control, once you raise many millions of dollars, you have to pay that back someday.\" Actually, the \"millions of dollars\" is being traded for partial ownership of the company, it doesn't \"have\" to be repaid any more than the grocery store has to repay you for the money you gave it in exchange for the loaf of bread you bought there. That transaction is complete. Without a controlling stake in the company, if they aren't repaid (in the form of a future StackOverflow, Inc. worth an amount of money such that their share is worth considerably more than their initial investment) then there's precious little they can do about it other than to look really, exceptionally pouty during board meetings. Though, obviously, Joel, Jeff, and \"the investors\" (currently of the hypothetical variety) all expect SO Inc. to eventually increase in value sufficiently to make that investment worthwhile for the investors.\n\nAll that being said, I think one very big reason why there is so much second guessing and criticism of this fund-raising is not necessarily because people don't trust Joel and Jeff specifically but rather that as a consequence of there having been so many instances of people having their trust abused in the past in this sort of scenario that people no longer trust anyone. A disturbingly large percentage of corporations of any significant size (e.g. &gt; $1mil annual revenue) treat customers and users as nothing more than expendable money-generation-units. Users have internalized this and translated it into perpetual distrust and fear of anyone in any similar position relative to them."}, {"author_name": "Scott", "gravatar_hash": "6285ff8f79ce11a5c9161011137258bc", "author_url": "http://www.simpsoncrazy.com/", "date": "Mar 14, 2010", "message": "Regarding the SE spider issue, I was looking at http://stackoverflow.com/robots.txt since you also mentioned that, and if I'm not mistaken, you're blocking the Yahoo crawler:\n\n#\n# Yahoo bot is evil.\n#\nUser-agent: Slurp\nDisallow: /\n\nSo in Yahoo's case at least, that may be why you're not getting spidered. Bing on the other hand... just take a look their webmaster forums, it's full-to-bursting of threads about how incredibly slow/inefficient their crawler is. Sites that have been online years barely have a third of their pages indexed.\n\nAnd here are the number of results for \"site:stackoverflow.com\" on the big four engines:\nGoogle - 8,550,000\nBing - 1,690,000\nAsk - 311,000\nYahoo - 4,483"}, {"author_name": "Ajay", "gravatar_hash": "e453a2ee10ea548127d4801464b9cc43", "author_url": null, "date": "Mar 14, 2010", "message": "Wedge, it is easy to be profitable when you don't pay many of your employees, though they've started doing that to some extent recently.  I'm sure SO is doing fine but it's certainly not from advertising: you should try taking your own advice and pay attention to the podcasts.  Google ads pay almost nothing, as they've noted, and they don't have a sales force to place their own ads.  Whatever money they're making is likely from the paid job listings, but I don't believe they've made those numbers public.  I think you're mistaken in saying that just because they're barely profitable today, SO is a good candidate for VC.  By that rationale, <i>every</i> barely profitable business is a good candidate for VC. ;) You have to have a business model to justify that large investment, that's what I questioned in my last comment, otherwise you're simply putting that basic question off and hoping you'll figure it out later, which may make you the next Skype but not much else.  As for your quibble about equity vs debt, I'm well aware of that distinction but I don't believe any VC allows their investments to simply collapse without taking control.  The way I understand it they have terms put in that if things go bad, they take over, which is why you see that happen so much with failed startups.  Regardless, that money has to be repaid in one form or another.  The reason the money-generation unit scenario that you talk about happens is precisely because companies take on too much money and then have to squeeze their users to make it up, exactly what people are apprehensive about with this fund-raising for SO.\n\nbtw, I took a look at the bot numbers for a subdomain of mine that gets a fair amount of international traffic.  I actually got the most hits from Baidu, 4 times second-place Yahoo, followed by msn, google, then yandex.  That's just crudely tallying up hits though, so not a good indicator of the breadth of the pages their spiders index, plus my site is a little unusual since I get a lot of Japanese, Russian, and Chinese traffic for an internationalized open source software product."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Mar 14, 2010", "message": "@Ajay, perhaps I listened to just the right parts of the podcasts, but I believe they have mentioned several times that their home-grown ad system has netted them orders of magnitude more revenue than their google ads experiments. They talk about some of their failed ad experiments but they also have successful ad experiments, which you have to read between the lines to interpret. Even so, it's pretty obvious that from just ads alone they're taking in perhaps low 6 figures a year.\n\nThe careers revenue is more difficult to determine because there are lots of variables that aren't visible, but from what's knowable I would estimate they're taking in at least $20k a month (I'd guess considerably more). And this is for a service that's less than 4 months old.\n\nAs far as business models go, I can guarantee that the business model with respect to the VC funding is not to simply expand SO proper as much as possible, there's only so much you can do with a programming Q&amp;A site. Rather it is as Joel and Jeff mentioned, turning the SO software stack (including the ad engine, the jobs listings, the CVs, the careers bits, and new functionality they develop) into *the* way that q&amp;a and conversations happen on the internet, replacing phpbb, vbulletin, etc. That's a huge task with many sub-elements, and it is a task worthy of substantial funding and also capable of generating substantial revenue down the road. You can either believe it or not, and you'll find out whether or not your beliefs are borne out by reality as Jeff and Joel put their vision into practice. If they prove you wrong I doubt you'll take the effort to acknowledge your mistakes or apologize for your seeming denigration of their efforts."}, {"author_name": "Ajay", "gravatar_hash": "e453a2ee10ea548127d4801464b9cc43", "author_url": null, "date": "Mar 14, 2010", "message": "Wedge, I haven't listened to several podcasts, in particular many from last summer, but orders of magnitude times nothing is still nothing.  <a href=\"http://inedomedia.com/stackoverflow.aspx\" rel=\"nofollow\">They claim to get 26 million page views/month</a>; given how little programmer audiences convert, as most use adblock and never click on ads, I'd be surprised if they're getting low five figures a month, meaning they're unlikely to be even getting the low six figures per year from ads that you claim.  I would bet that most of SO revenue is from the job listings.  It's nice that they're ambitious about expanding SO to other categories, but that's why people were confused when they said they were raising VC for SO, not Stack Exchange, as SO is the programming site.  Forgive me for thinking that dominating internet conversation software is impossible, but I don't think they're foolhardy enough to aim for that anyway: they simply want to make good money raising the game in that category.\n\nHowever, being \"capable of generating substantial revenue down the road\" is completely different from having a business model that says how you will do it.  Every startup that has sold this pipe dream and raised VC money has failed or is on its way out, with the lone exception of Google.  Acknowledge my mistakes?  I'm summarizing the past and making predictions for SO based on that, how that could possibly add up to a \"mistake\" someday, I don't know.  Denigrating their efforts?  You need to stop making stuff up and putting words in people's mouths, I did no such thing.  Please get out of fanboy mode and actually think about what's going on here, as I'm trying to do."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 15, 2010", "message": ">  I’d be surprised if they’re getting low five figures a month, meaning they’re unlikely to be even getting the low six figures per year from ads that you claim.\n\nI can't talk about money, as I am sure you know, but the actual reality is closer to Wedge here than you are."}, {"author_name": "Ajay", "gravatar_hash": "e453a2ee10ea548127d4801464b9cc43", "author_url": null, "date": "Mar 15, 2010", "message": "Eh, after doing the math, the numbers I came up with weren't that far off from Wedge's, as all you have to do is make $8.3k/month, ie the four figures I mentioned, to break low six figures.  Whatever the number is, that's a pretty pathetic CPM on the volume of pageviews you're carrying, proving yet again that the ad model doesn't work.  Care to say if I was right in guessing that SO makes much more from job listings, Jeff?  I hope for your sake you're pursuing some paid model and not ads, because the startup graveyard is littered with companies that thought they could make ads work."}, {"author_name": "Skizz", "gravatar_hash": "e222c924e06cc579a6866f6d7588ca66", "author_url": null, "date": "Mar 15, 2010", "message": "I too don't have a Facebook page. I don't have a Twitter account either.\n\nMaybe we can start a new group of internet users that aren't members of social networks. ;-)"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Mar 15, 2010", "message": "You pointed to YouTube being more popular that Google Video as an example that Google can't dominate everything... but Google owns YouTube, which is why Google Video has lapsed."}, {"author_name": "Marc Reside", "gravatar_hash": "b7e546676228f3dc9caee37c8fa24908", "author_url": null, "date": "Mar 15, 2010", "message": "While I do have a Facebook page, my wife does not. There are very few people, it's true, but they do exist."}, {"author_name": "Mr. Shiny &amp; New", "gravatar_hash": "dba5361a2c56c84b01f9c046d076459d", "author_url": "http://eternalephemeron.blogspot.com", "date": "Mar 15, 2010", "message": "Just wanted to point out that Joel's comment about canonical URLs to pages is partly wrong.  There is a standard link re=\"canonical\" syntax which lets a page declare its own canonical URL, which the spider can use to detect dupes.  Google promotes this and recommends it and any good spider should follow it.  Actually I note that SO already uses it."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Mar 15, 2010", "message": "@Wedge\nMostly good points - but remember the guys at Sun were really smart, and cool and opensource friendly. And MySQL never thought they were selling themselves to Oracle.\n\nAs to the replace Phbb etc. The SE stack isn't going to be a free download, and even if it was the licence costs of SQLServer/Win2003/IIS would put it out of reach of most PhBB users.\nSo it will have to be hosted, even if this is free for non-commercial users. You have to trust that it will always be free and you have to be happy about whatever ads SE decide to show on 'your' site\n\nI wish Joel well, but I can't think of many commercial web  offerings that have replaced entrenched open alternatives - however much money they had behind them."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Mar 16, 2010", "message": "@mgb, If the SO team really wanted to they could get all of their software running on Mono and MySQL or PostgreSQL (or the equivalent) in a fairly short manner of time. Indeed, this is precisely the sort of thing that Jeff has talked about repeatedly in the podcasts whenever he has waxed philosophically about how an SO-derived software stack could ultimately beat out phpbb et al.\n\nAlso, in terms of success I don't think Jeff and Joel are Microsoftian (see the original MS mission statement on the wiki page for MS for example) in their goals of actually having software from Stack Overflow Inc. backing every web forum or discussion board on the entire internet. I think their goal is more Googlian (if I can coin such a word), meaning that they plan on doing something worthwhile, perhaps making a lot of money along the way, but also raising the game in the industry while they're at it. Ultimately they don't want to be masters of the Universe, I think. They do want to make a lot of money (who doesn't?) but they want to transform the playing field so that in, say, 2015 instead of competing with phpbb and vbulletin they are instead competing with products that are more SO-like and are more advanced than the state of the industry today.\n\nAs to the business arguments, those are perfectly valid points. However, I believe Joel has a pretty good head on his shoulders when it comes to business and I trust him well enough to not be fearful that he will \"sell out\" SO.com in some way that the community will come to regret."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Mar 16, 2010", "message": "\"While I do have a Facebook page, my wife does not. There are very few people, it’s true, but they do exist.\"\n\nNonsense! Most people don't have a Facebook page. If you have any intentional online presence, then you're in the minority. I know plenty of folk who don't even have a computer/Internet access at home."}, {"author_name": "An Antipodean", "gravatar_hash": "5e92b26d10bd786f590bddff84e7c4a7", "author_url": null, "date": "Mar 16, 2010", "message": "Joel: \"Antipodes\" is the word I think you were looking for."}, {"author_name": "TJB", "gravatar_hash": "20e04754409abe97cca30b5cda369fcc", "author_url": null, "date": "Mar 16, 2010", "message": "I'm proud to share that I too have abstained from Facebook.  It's been a tough journey, and I was getting close to giving up, but now with Jeff's inspiration, I know i can make it!  Someday, someday the world will learn."}]}