{"response": [{"author_name": "William Shields", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Mar 24, 2010", "message": "Just one comment: Joel's comments about allowing duplicates and linking them together touches on an issue I know has come up on Meta but never gone anywhere.\n\nPerhaps we should disallow deletion of questions closed as exactly duplicates as these seem to be overzealously deleted?"}, {"author_name": "Alex McBride", "gravatar_hash": "8a5f65062b9908152a7b00fab3df6c58", "author_url": null, "date": "Mar 24, 2010", "message": "My dog like pigs ears. They come in little packets of four or five and they keep him entertained for several minutes. With most treats he just gulps them down, so I feel he gets more value from these."}, {"author_name": "Ralph Rickenbach", "gravatar_hash": "09eb3720b1c9d33bedd35a3bd47ec1c9", "author_url": "http://www.rickenba.ch", "date": "Mar 24, 2010", "message": "Really seems to be a good idea to restart the podcast - this has been our several hours and I am still the first to comment?\n\nAnother reason: my captcha spells \"new scharff\", when in English \"scharff\" could be translated \"really hot\" (taking the double ff as a way of augmentation).\n\nMathOverflow has been gute some help lately as I am using more of my math from university at my job at the moment, going into measuring and meteorology software. So thanks.\n\nLooking forward to see the restart and hear all the good news."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Mar 24, 2010", "message": "For a Siberian husky - I would assume Siberian hamsters\n\nps. If the JoS blog is now about pictures of the new baby, JoelOnHusky.com is available!"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Mar 24, 2010", "message": "For a Siberian husky would a Siberian hamster be a tasty bite sized treat?\n\nps It seems Jeff's anti-viking stance means that users of the fastest most compliant browser can't post here, as well as can't remove vandalism from the wiki."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Mar 24, 2010", "message": "for(balmer=0;balmer&lt;65;balmer++)\n   printf(&quot;Backups!\\n&quot;);"}, {"author_name": "Chris-S", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.shrinkrays.net", "date": "Mar 24, 2010", "message": "Joel - what you describe about newsgroups and questions that have already been asked - the exact same attitude is found on Stackoverflow and the duplicate questions are closed, usually some demeaning comments and some slight debate, within 30 minutes. That's just seems to be human nature and can't be changed."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Mar 24, 2010", "message": "The \"Proof without words\" MathOverflow question is another good one that might be of interest to a broader audience. http://mathoverflow.net/questions/8846/proofs-without-words"}, {"author_name": "Stefan Kendall", "gravatar_hash": "fe3af2a85aff9824c949d82cad67d974", "author_url": "http://progamonth.com", "date": "Mar 24, 2010", "message": "What?! No more listener questions? I always thought they were one of the more interesting facets of the podcasts. Generally, Joel has some opinionated rant-like opinion on whatever is being asked, and Jeff disagrees, with reasoning.\n\nThese sorts of debates probably told more about the subjects being discussed than pre-planned monologues ever could."}, {"author_name": "William Jens", "gravatar_hash": "7308be06f5df7d30881669b423ca319e", "author_url": null, "date": "Mar 25, 2010", "message": "You mentioned having a DB copy in read only mode to prevent having to sync the original DB when it comes back online. Have you looked into SQL Server's DB mirroring? It's a step above log shipping but not quite as involved as DB clustering (no shared storage requirements). It can provide for automatic failover in the event that the primary goes offline.\n\nI haven't tried it yet, but we were looking into this as an alternative to log shipping to maintain a hot spare."}, {"author_name": "Jack M.", "gravatar_hash": "9ecd2f59de5e03ba481723637fc74fad", "author_url": null, "date": "Mar 25, 2010", "message": "One treat that a few friends have used for their dogs is cereal.  A ziplock full of Cheereos is dirt cheap, and seems to work well for the pups.  Nutritious, not going to hurt 'em, and tasty for you if you happen to be trapped in a snow drift."}, {"author_name": "Scott W.", "gravatar_hash": "7a03f436e9458527368e5eaa45f85d40", "author_url": "http://moms4mom.com/", "date": "Mar 27, 2010", "message": "Anton's comments about the meta site are thought provoking.  We've considered a meta site for moms4mom, but have always held out hope that Fog Creek is going to eventually include a meta site with the cost of each StackExchange site.  Given the faint glimmer of hope that it might happen, we don't want to expend the resources to create a meta site of our own based on Wordpress, or something, that we might have to worry about migrating later.\n\nIf StackExchange builds in a meta site, it makes sense to share the same user database.  That's hard to do with a homegrown solution."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Mar 28, 2010", "message": "I made doggie treats from peanut butter, oats, eggs, corn meal, flout and some water.  Cut to size or roll into shapes and bake for 20 minutes to an hour - whatever your preference."}, {"author_name": "Brett", "gravatar_hash": "444c8d7844ba3aed548964c7524208bf", "author_url": "http://blog.brettski.com", "date": "Mar 30, 2010", "message": "Two thoughts based on comments in the podcast.\n\nFirst on backups, what about using an application like DoubleTake to continually copy changes to New York.  For a single server the price is not too bad.  This would eliminate your 12+ Gig push of data once an X.  You will always have a .dbf to mount in New York if your CA data center goes away.\n\nSecond, you were discussing your spare SQL server, and setting it to read only if the first server vanished.  How about setting the servers up in a clustered fail-over mode?  It does require a SAN or NAS (w/ iSCSI) to implement, but is not that difficult to do and is supported by SQL Server Standard Edition.  This way when db1 is no longer available the cluster will fail-over to db2 and continue working with the same set of data.\n\nThank you,\n\nBrett"}, {"author_name": "AJ", "gravatar_hash": "5effec3786700dd1c39b3b00e1f1f127", "author_url": null, "date": "Apr 15, 2010", "message": "I feed my small dog baby carrots.  There hard enough to clean his teeth as well as full of wholesome goodness.  I don't give him too many a day, though -- i don't want him turning orange."}, {"author_name": "Abe", "gravatar_hash": "080f15b1b908c100514c15dfe55eaf1e", "author_url": null, "date": "Apr 22, 2010", "message": "New podcast?"}]}