{"response": [{"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": "http://careers.stackoverflow.com/kyle", "date": "Mar 21, 2010", "message": "How does the system handle questions that generated reputation on the origin site, were turned Community Wiki, then migrated to another site? Do you still get reputation from the pre-CW votes on the target site?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2010", "message": "It's pretty simple: *all* votes are migrated to the destination site.\n\nThere is a caveat, in that the question \"stub\" is left on the source site temporarily, with links for people to find their way to the new location on the destination site. So question votes (and <i>only</i> question votes) would stick around at the source. But we eventually go in and delete that, too."}, {"author_name": "William Shields", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Mar 21, 2010", "message": "I just wanted to say thanks for fixing the inconsistencies around vote, bounty and accepted answer timing. This made a difference of 7k to me and probably more to a few others.\n\nMore importantly though: now it just makes sense and that's why I had in the past had argued for it."}, {"author_name": "Alan", "gravatar_hash": "34776138bdf89902a18921560f8c49b6", "author_url": null, "date": "Mar 21, 2010", "message": "Boo!\n\nGrandfather clause!"}, {"author_name": "Tom Hawtin", "gravatar_hash": "ca38e010104d9d255928940c6809ab60", "author_url": "http://blogs.sun.com/tackline/", "date": "Mar 21, 2010", "message": "Perhaps a banner mentioning the recalc and offering to explain why reputation changed would have been a good idea. There's going to be lots of dupe questions about it. Perhaps this might have been a better suggestion if I mentioned it a few days ago."}, {"author_name": "Ole jak", "gravatar_hash": "7cda6613fee35e6b5f99a29faf149703", "author_url": null, "date": "Mar 21, 2010", "message": "I see big dis respect in your actions to the people asking questions! I have lost 50% of my reputation. How do you think it Fils?!?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2010", "message": "Ole, I understand -- there will be some short-term pain with this change, but we believe it will make the entire trilogy Q&A ecosystem healthier for everyone in the long run."}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Mar 21, 2010", "message": "Is there any reason why we might expect a double whammy? I had a big jump (+5K) , then I think a small backward correction (-250 or so) after 4pm PT.  I originally thought I had a downvote since the last digit was off what I thought it should be, but examining my history for the day shows this isn't so. \n\nMy numbers are only approximate -- I'm only roughly aware of what they were pre-recalc, post-recalc, and at the end of the day because I'm getting close to a fairly big boundary and had calculated how long I thought it would take me.\n\nCaptcha: the broads"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2010", "message": "tvan, you're seeing the effect of the +5 on questions now, whereas you saw the bugfixes before. It's the same thing, just somehow you had 2 recalcs instead of the 1 others had.,"}, {"author_name": "Brian R. Bondy", "gravatar_hash": "f0566752ce55a90dbb5f80cd4f79fe14", "author_url": "http://www.brianbondy.com", "date": "Mar 21, 2010", "message": "Glad to see this change in effect.  I now feel 50% less bad for my asked questions."}, {"author_name": "Mehrdad", "gravatar_hash": "df0bd8a818111607704dab056fcfc091", "author_url": "http://mehrdadafshari.com", "date": "Mar 21, 2010", "message": "Thanks for the longstanding bug fixes and the logical and consistent reputation system we've been asking for."}, {"author_name": "William Shields", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Mar 21, 2010", "message": "@tvan I had two recalcs too. Up ~7k, down 500 or so."}, {"author_name": "Oorang", "gravatar_hash": "74c236638d43b713794e529cd59e9aa1", "author_url": null, "date": "Mar 21, 2010", "message": "You might think it will benefit the site in the long run, but this devalues reputation in a very insidious way. The whole point of rep is that people will work long and hard to advance that number and collect the shiny badges. \n\nIf you can and will change something that's mine anytime you think it's for the \"greater good\", then I never really had it to begin with did I?\n\nSo why would I work long and hard to advance the little number unless I know you won't be messing with my earnings?\n\nYou might say because you just like helping people out. Which is true, but then if you are helping just for helping sake, then reputation never mattered at all. So why have it at all?\n\nIf you want to change what people are *going* to earn, fine. That's fair. But to screw with what people have already earned just because you changed your mind undercuts people confidence in the \"dollar\". \n\nThis was a really, really bad call. You should rethink it."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Mar 21, 2010", "message": "I lost almost 3k rep because of this stupid change. How would you feel if you were on the receiving side of this? You don’t change the rules mid-game. After the rep has been gained its ridiculous to take it back. Why couldn’t it have just been implemented for future questions instead.\n\nHope karma bites you on this real hard, Jeff."}, {"author_name": "Sky", "gravatar_hash": "df4a7fbd8a054fd6193ca0ee62952f1f", "author_url": null, "date": "Mar 21, 2010", "message": "Bitter much, Upvote? lmao."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2010", "message": "Click, we are fundamentally rebalancing to favor answers. You can still get rep from questions, but at 50% the rate of answers. We believe this more accurately reflects the dynamics of an effective (eg, everyone gets answers!) Q&A community."}, {"author_name": "Jason", "gravatar_hash": "0e2e822d32a7ab3d7f0b7098d03b1d16", "author_url": "http://www.jasonedelman.com", "date": "Mar 21, 2010", "message": "Seriously, can we whine a little more? It's points on a website. You don't even get prizes for them. I lost about 800 rep, but so what.\n\nCry."}, {"author_name": "Poor man", "gravatar_hash": "6f370c8c7109534c3d5c394123a477d7", "author_url": null, "date": "Mar 21, 2010", "message": "Hehe, you could have doubled the score for everything except question upvotes. Would accomplish the same thing but generate positive responses from the reputation junkies ;)"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Mar 21, 2010", "message": "This game never ends, so any rules changes pretty much have to be made in the middle of the game.  This is just how MMORPGs work.  The Questioner class got nerfed a little, but they've always had the advantage of getting answers to their questions.  This just brings a little balance to the game."}, {"author_name": "APC", "gravatar_hash": "09939a1d3bd9c1af199a948bdc68cb71", "author_url": "http://radiofreetooting.blogspot.com", "date": "Mar 21, 2010", "message": "I recall reading that penalties for downvotes would be re-weighted from -2/-1 to -5/-2.   That doesn't seem to have happened in this exercise.  So, is there another recalculation in the pipeline?"}, {"author_name": "Stephen Jennings", "gravatar_hash": "9f17df847cd69055fdbe0e3cc98423b8", "author_url": null, "date": "Mar 21, 2010", "message": "I like these balance changes. I too think a good answer should generate more rep than a good question.\n\nWow, there is a lot of hate being generated by changing a number on a website. I'll borrow a quote from Everything2 because it's particularly relevant: \"[Reputation] is an imaginary  number granted to you by an anonymous stranger. Treat it as such.\""}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2010", "message": "APC: no, that has been shelved for the forseeable future.\n\nhttp://meta.stackoverflow.com/questions/7322/should-the-weight-of-downvotes-be-increased/42763#42763\n\nThis change has a similar effect, though: if questions are worth +5, that also means a -2/-1 downvote to a question has more weight as well."}, {"author_name": "Chris Charabaruk", "gravatar_hash": "c6d7e2689cfa7ed7aaf419fdc9cc8862", "author_url": "http://coldacid.net", "date": "Mar 21, 2010", "message": "Everyone complaining about their rep loss: U MAD? :D\n\nC'mon, while reputation points are generally a good indicator of quality of questions and answers, the accumulation of them by users is more of a game or gimmick than anything else. Treating your rep scores as such SRS BUSINESS is pretty pathetic, and when I see it, I feel embarrassed for you.\n\nI lost points too. Perhaps not as drastic as some here, but other than wanting the ability to edit questions and answers (thanks to a tingling Grammar Nazi sense) I couldn't care less how many or how few I have. I could have been dropped to 1 point and I honestly wouldn't have thought twice about it after reading about why it happened.\n\nSo come on, grow up about it. Sure it sucks, but it's not the end of the world. Stop acting like it is."}, {"author_name": "Rob", "gravatar_hash": "5d6db59f028e16f93d3af876c0e73129", "author_url": null, "date": "Mar 21, 2010", "message": "@Chris\n\nSpeak for yourself.  The reputation system obviously matters to people else there would be no need for such a system in the first place.  Just because you don't care doesn't mean others can't feel disgruntled about it.  This whole episode has been handled very badly."}, {"author_name": "Jake McGraw", "gravatar_hash": "769b1f309a41e2893654c81496b9f8b4", "author_url": null, "date": "Mar 21, 2010", "message": "Armies of the interwebs, put down the hot pocket and take off your wrist guard.\n\nSO reputation is intangible. What is real is the knowledge transfer that has taken place because of the trilogy sites. Where before there were only a few that knew the answer to a given question, now many  are unobstructed from learning these things, all thanks to Jeff and Co. That is the real value of SO, not the inflated sense of pride each of you get when marveling at your gamed rep."}, {"author_name": "johnc", "gravatar_hash": "0a8d214b6959c90c4d61ba26b78f2fa9", "author_url": "http://obviouscode.com", "date": "Mar 21, 2010", "message": "My rep! My lovely Rep!\n\nI am ambivalent as I can't decide whether I'm surprised this has caused such a stir, or not more of a stir.\n\nAt the end of the day, however, I think that if your rep loss is going to cause you to rant in these comments, perhaps you should get out more."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2010", "message": "I think it's completely reasonable for people to be concerned about changes to their reputation.\n\nBut it's also important to be fair to the greater community in terms of balancing the way reputation is earned.\n\nThe goal is for every question to get good answers; that is a net benefit for not just both the asker and the answerer, but anyone else on the internet who has that question."}, {"author_name": "APC", "gravatar_hash": "09939a1d3bd9c1af199a948bdc68cb71", "author_url": "http://radiofreetooting.blogspot.com", "date": "Mar 21, 2010", "message": "MetaSO has a banner at the top of every page linking to this blog page.  But none of the other trilogy sites have it.  Perhaps they should?   It might save a lot of questions which need to be closed and migrated to Meta so Bill The Lizard can mark them as dupes."}, {"author_name": "Kev", "gravatar_hash": "a9840656ceee0faa528806c4c04a9399", "author_url": "http://stackoverflow.com/users/419/kev", "date": "Mar 21, 2010", "message": "Seriously folks, if you're just here to earn rep from asking questions then you're in the wrong place and probably asking the wrong questions.\n\nI'm here to ask questions about stuff I'm stumped on or don't have the time to research. Getting answers (often within minutes) is the reward.\n\nSome may argue they spent time composing 'great' questions, but shouldn't you be doing that in any Q&amp;A community, I know I do. That's how you attract great answers no matter what forum or Q&amp;A site.\n\nI can't think of any other forum or Q&amp;A site where I can pop in a question and have access to such a hugely active and enthusiastic bunch of experts. \n\nFor comparison, over the years I've asked questions over on the MS developer forums, USENET and the Citrix Xen forums and have been lucky to see so much as a nibble or a view over a period of 5 days after posting my question. On SO I've had to delete my question temporarily just to hide it whenever I've spotted a mistake or something that's not clear simply because the flood gates open up within minutes of asking.\n\nSo folks, if you're moaning about losing rep because of the question rep recalc, go back and look at your questions and ask yourself what was the value of the time saved for each one answered? and what was the value of the time spent by the person(s) who posted the correct answer(s). I'm damn sure the loss of 50% rep gained on question asking pales into insignificance. Don't be so damned selfish, you got an answer, isn't that what you were after?"}, {"author_name": "STingRaySC", "gravatar_hash": "592ad90ad35076864ef7dfaff2cfc69b", "author_url": null, "date": "Mar 21, 2010", "message": "Why did I lose rougly 25% of my rep on SO, but looking at other high-rep users I'm familiar with, I see noone else lost anywhere near 25%, if any at all?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2010", "message": "STingRaySC, the general rule of thumb is, the more your rep came from questions, the more reputation change you will have. For a handful of users who only ask questions, it is close to 50%, but it can be anything from no change to an increase (due to the enhanced immunity of accepts and bounty awards)."}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Mar 21, 2010", "message": "I get it, but I don't. Rep has always been sold to us as a measure of the trust the site has in a particular individual - not a measure of value, not a measure of worth, not a measure of anything but trust.\n\nAs such, the weight of up-votes on questions was creating an undue level of trust in people asking only questions (which do have value, and do contribute to the site, but are rather worthless without answers...) and that trust is being re-balanced."}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Mar 21, 2010", "message": "@Bill the Lizard,  I think your MMORPG analogy is a little flawed.  Sure, classes get nerfed (in this case the Question Asker) but I've never seen experience points taken away from the users of that class, even given their previous advantage.  Their advantage is simply removed, not their points.\n\nIn any case, I think I agree with the changes.  I lost a little under 5k rep, but it doesn't really matter.  Those popular questions I asked didn't require near the effort that many of the great answers other users have given."}, {"author_name": "Martin D", "gravatar_hash": "ead57e5bebe4e7d4a9bc06353d10de82", "author_url": null, "date": "Mar 21, 2010", "message": "Taking away a third of my points was kind of a dick move. Not all of us follow this blog, I had no idea why I lost so many points in the past couple of hours."}, {"author_name": "I. J. Kennedy", "gravatar_hash": "a983df0a24f8714e0c9850cc7e96aa95", "author_url": null, "date": "Mar 21, 2010", "message": "Painful or not, I'm glad the rep system is undergoing repairs. I lost about 30% of my rep, but that's ok. \n\nThe core problem with the rep system as I see it--and Jeff unfortunately has already said on the podcast that he doesn't want to fix this--is that all votes count the same. The obvious thing to do in my opinion is weight upvotes by the rep of the upvoter.  \n\nIt just kills me that this accepted answer, (http://stackoverflow.com/questions/59667/why-would-i-ever-pick-char-over-varchar-in-sql), which provides very very rudimentary information, gets 54 votes, while (my own!) accepted answer to this other question received only 1 vote.  (http://stackoverflow.com/questions/2313271/how-do-i-pass-arguments-to-c-functions-when-i-call-them-from-inline-assembly)\n\nSorry to pick an example from my own answer portfolio but the case I'm trying to make is that my 1-vote answer is more than 1/54 as valuable than the 54-vote answer. I'm not saying there's anything wrong with the 54-vote answer, it's a fine answer, but that information is available anywhere and doesn't represent hard-won expertise.\n\nIt's true that the 54-vote answer was useful to 54 people, but my guess is, judging by the question at hand, these voters are newbies. It's great that they are learning the difference between CHAR and VARCHAR here on Stack Overflow, but there's no doubt they'd learn this information, because it is so basic, sometime early in their careers, even if Stack Overflow didn't exist.\n\nA weighted voting system would improve the accuracy of rep scores. It's not done in the real world because it's impractical, but on Stack Overflow it would be quite doable. Jeff, I wish you'd reconsider."}, {"author_name": "Kev", "gravatar_hash": "a9840656ceee0faa528806c4c04a9399", "author_url": "http://stackoverflow.com/users/419/kev", "date": "Mar 21, 2010", "message": "@I. J. Kennedy - those two examples are exactly why I'd go as far as having no upvote rep gained on questions at all."}, {"author_name": "Eli Bendersky", "gravatar_hash": "fc761ccaf6c0d7d977e2959f9bfebd06", "author_url": "http://eli.thegreenplace.net", "date": "Mar 21, 2010", "message": "Jeff, once again thanks for this decision. Although I myself lost more than 1K rep as a result of the recalc, I feel it makes SO a better place."}, {"author_name": "Justin Nelson", "gravatar_hash": "2e3bb9e76b9e5cd8f7eedc040d5ccd58", "author_url": "http://stackoverflow.com/users/2598", "date": "Mar 21, 2010", "message": "I would just like to voice my approval of this change.\nI think that answers deserve more rep than questions.\n\nI would only caution that you don't make changes like this too often.  If people start to feel like the rep system is to flimsy and can change too often, they may begin to lose trust in it."}, {"author_name": "Keith", "gravatar_hash": "22aac6106c44ae4078bd4c0a564714e0", "author_url": null, "date": "Mar 21, 2010", "message": "partly it messes with peoples psychological buy in to the site, however, I suggest people refer to \"who moved my cheese?\"  :-)\n\nI'd complain, but the real value has been having my questions answered! to which I'm hugely grateful.  To the people who have answered my questions, definitely more kudos should go to them for helping me."}, {"author_name": "Rashmi Pandit", "gravatar_hash": "bd1611fecec0f4a5a845c8f6a3315b7c", "author_url": null, "date": "Mar 21, 2010", "message": "I lost approx. 200 rep points. However, to me, it still makes more sense to have 5 points for questions and 10 for answers."}, {"author_name": "Daniel", "gravatar_hash": "1c5255f8496fcade0244f12cb6ca6405", "author_url": null, "date": "Mar 21, 2010", "message": "Can you imagine what you happen if the government said.. we are increasing tax to 40% but we are applying it retrospectively over the last 20 years and then came and took the money out of your bank account.\n\nSucks doesn't it..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2010", "message": "> I would only caution that you don’t make changes like this too often\n\nDefinitely agree.\n\nIn this case, we were \"saving up\" a bunch of changes and doing them all at once. The last big rep change like this was in December 2008."}, {"author_name": "Michael Petrotta", "gravatar_hash": "ec23f7cf0263a623bea6aca36a77a58b", "author_url": null, "date": "Mar 21, 2010", "message": "Daniel - lucky, then, that all we're talking about is an abstract number, and not real money.\n\nReally, folks.  What did you derive satisfaction from, before Stack Overflow reputation existed?"}, {"author_name": "Kev", "gravatar_hash": "a9840656ceee0faa528806c4c04a9399", "author_url": "http://stackoverflow.com/users/419/kev", "date": "Mar 21, 2010", "message": "@Martin D, Daniel, et al - SO is free, rep is imaginary. If it's so bad why not head over to expertsexchange and part with $12.95 a month to get your stuff answered or earn a free membership by answering questions?\n\nThere's that old saying \"Don't look a gift horse in the mouth\"."}, {"author_name": "manohar", "gravatar_hash": "47f64f0fffd4b46e778850bf58a2d08e", "author_url": null, "date": "Mar 21, 2010", "message": "My reputations is reduced by half, I am not happy."}, {"author_name": "nedm", "gravatar_hash": "e5adb0683b86819124da6cfbbfe63b1c", "author_url": null, "date": "Mar 21, 2010", "message": "I completely agree that the substance of the change is a good idea, but tend to disagree with how it was implemented.  The change to my reputation was minimal, but I'm bothered by the notion that things may be recalculated down the road according to a different weighting system, as it seems like the only real reason this was done retroactively was that it's too much of a PIA to just do it going forward.\n\n&gt; I think it’s completely reasonable for people to be concerned about changes to their reputation.\n\n&gt; But it’s also important to be fair to the greater community in terms of balancing the way reputation is earned.\n\nIt seems to me that damaging the trust of existing users by making these sorts of changes retroactive outweighs the injustice of having users who've asked lots of questions gain inflated reputations, and that if it's a good change it will work going forward. But hey, this is your baby."}, {"author_name": "Ash", "gravatar_hash": "f92d5235e6adc05254196f4fe69685a3", "author_url": null, "date": "Mar 21, 2010", "message": "@Jake, @Chris, @Kev, Jason do you seriously believe what you have written.  If so, your naivete is stunning.  To most StackOverflow users it is *all* about reputation and comparing themselves to other programmers.  Thankfully SO also happens to be a very useful resource, but to be surprised why people do not like losing reputation is, once again, naive."}, {"author_name": "Kev", "gravatar_hash": "a9840656ceee0faa528806c4c04a9399", "author_url": "http://stackoverflow.com/users/419/kev", "date": "Mar 21, 2010", "message": "@Ash - what do you mean by naivety? The folk who are mostly grumbling about their rep loss are the ones who have gained substantial amounts of rep for asking questions and not from answering questions. \n\nSurely comparisons, if made at all, should be made on the rep gained from providing good answers?"}, {"author_name": "Josh Einstein", "gravatar_hash": "8f5dc1cfbfb55f306a3ae937bb3d8b84", "author_url": "http://www.josheinstein.com", "date": "Mar 21, 2010", "message": "I actually didn't get dinged by this cause I don't usually post questions. I actually probably got a few points cause of the bounty issue. But I have to say I think it's a pretty lousy thing to do to adjust people's reputation score especially given the fact that there seems to have been little or no warning/explanation on the main site. I should know, I'm there for several hours a day.\n\nAnyhow, I recently broke 10,000 points the other day and was very excited about it. Had this change wound up bumping me down below 10,000 I probably would have been pissed enough to stop using it for a while and once I got a taste of having a normal social life I probably would never have come back.\n\nJust saying..."}, {"author_name": "Josh Einstein", "gravatar_hash": "8f5dc1cfbfb55f306a3ae937bb3d8b84", "author_url": "http://www.josheinstein.com", "date": "Mar 21, 2010", "message": "@Daniel... \"Can you imagine what you happen if the government said.. we are increasing tax to 40% but we are applying it retrospectively over the last 20 years and then came and took the money out of your bank account.\"\n\nWatch what you wish for. :) While they can't go back 20 years, they will certainly try to retroactively apply the capital gains tax increase that's coming."}, {"author_name": "James", "gravatar_hash": "0ae5a1789b1a79f44545ef410828e2d5", "author_url": null, "date": "Mar 21, 2010", "message": "Only here would men measure themselves by their rep, and not by their balls.\n\nGet over it. It's a meaningless number."}, {"author_name": "Ben", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Mar 21, 2010", "message": "I took a 27% hit, which hurts.\n\nI don't think Jeff can be too sad about people lashing out in pain - that's just proof of people's engagement with SO.\n\nBut I've noticed people who had twice my reputation and had barely ever answered a question. (Like 379 questions for 18 answers: and that particular user is still ahead of me even after the recalc...)\n\nSo I'm not overly sad, at least I didn't lose my edit rights!"}, {"author_name": "torva", "gravatar_hash": "ad18372d3f3738c43d44f8f66544f7d1", "author_url": null, "date": "Mar 21, 2010", "message": "well i dunno. SO derives profit by having a happy community of users. so maybe not such a great idea to annoy essentially everyone..."}, {"author_name": "KMan", "gravatar_hash": "c7cf5f8467d9c0763cdf0d039168bca7", "author_url": "http://izlooite.blogspot.com", "date": "Mar 21, 2010", "message": "The reputations definitely matter to SO community; and I believe reputations were one of the major reason, if not 'the-major', that SO is able to create an authentic career web site.\n\nEven if rules are getting changed in the mid game, it should apply to the \"rest of the game\" not the previous part of the game; since the previous part was played with previous rules in mind. It would have been better, and would have generated less comments/arguments had it been implemented for future questions/answers instead.\n\n@Jeff: \n\"But it’s also important to be fair to the greater community in terms of balancing the way reputation is earned.\" - \n\nAgreed! and I would add, the system is changed eventually - abrupt changes, especially in SO, would have caused reputation-polar-storms (0:"}, {"author_name": "Carson Myers", "gravatar_hash": "f4cdb7db0efa2c5a63fb0a0796be2bb3", "author_url": null, "date": "Mar 22, 2010", "message": "I lost about 36%, and lost my vote-to-close rights... This really takes away the motivation I had to start answering more questions..."}, {"author_name": "epaga", "gravatar_hash": "f5632284a6668f4b442b564967ed5c96", "author_url": "https://twitter.com/epaga", "date": "Mar 22, 2010", "message": "Love the change though I lost about 1/4 of my points...\n\nthe one thing I think I would have done differently is not have the change be retroactive. That way you don't piss off all the users who wake up and go \"hey, where's my rep?!?!?! My life is worth 50% less now!!!1!\" but you also keep the system fair from here on out...\n\nbut too late for that now and better this way than no change imho."}, {"author_name": "Chris Leong", "gravatar_hash": "a8c9322c0aff859ec2ab977c728200d1", "author_url": null, "date": "Mar 22, 2010", "message": "Losing half of my rep was quite disappointing, but on the plus side, due to unintentionally generating a controversy http://stackoverflow.com/questions/2481814/objective-measures-of-the-expressiveness-of-programming-languages, I had edit rights for a few hours and certainly made the most of them."}, {"author_name": "T.J. Crowder", "gravatar_hash": "ca3e484c121268e4c8302616b2395eb9", "author_url": "http://www.crowdersoftware.com", "date": "Mar 22, 2010", "message": "I think changing the balance to favor answers makes sense; StackOverflow would be nothing if it were just a bunch of unanswered questions, and the questioner is already getting a huge benefit: Getting their question in front of thousands of smart people with demonstrated willingness to help them.\n\nBut I would recommend more active advance community consultation for any substantial changes in the future. I'm on SO nearly every day, but not a blog follower, and so barring someone having mentioned it in a comment a couple of days ago, I wouldn't have had the slightest idea why my rep changed suddenly overnight.\n\nIn a similar vein, I would be very much slower to lock feature request questions on meta. I've seen them locked just over a day after being asked, when the original questioner hadn't even responded yet to the comments made. That's not community involvement, that's stifling discussion, as no one can even post a *comment* to a locked question. I've had that, and it felt very much like a door slammed shut in my face. I can see why eventually you'd need to lock those questions, but \"eventually\" is a big part of that sentence."}, {"author_name": "Razzie", "gravatar_hash": "31b89c12bc0ab3a23c32bf4e8e86764c", "author_url": null, "date": "Mar 22, 2010", "message": "I feel so sad for Edward Tanguay :-)"}, {"author_name": "Bryan", "gravatar_hash": "4683e2e4466593f52ef3b06566e20dff", "author_url": null, "date": "Mar 22, 2010", "message": "Not phased by the detail of the change (i.e. 5 points instead of 10 for upvoted questions), however I'm most disappointed in the way it was implemented. I've only lost a couple of hundred, but I feel like I've been robbed!\n\nRep and badges on SO, SU &amp; SF are quite addictive, kind of like getting achievements on Xbox games, it's the drive behind me visiting these site part of my daily 'start-up' routine. - but I'm sad like that!\n\nI know I'll get over it, but right now I just want to throw my toys out of the pram!\n\nQuestion for Jeff: Why was this retrospectively calculated? Could it not have been changed only for future questions?"}, {"author_name": "Otaku", "gravatar_hash": "a7702f74f3814b23e7aa6040a211f487", "author_url": null, "date": "Mar 22, 2010", "message": "@Razzie: Don't feel that bad - he's done a great service to many others. Of 734 questions, he has an 85% acceptance rate - that's almost 10,000 points he's dolled out to others. Now if he'd just accept my damn answers as the correct one, I'd love him even more!"}, {"author_name": "Daniel Earwicker", "gravatar_hash": "0256f9dfdd00ce1d37ab3f70abc561f3", "author_url": "http://smellegantcode.wordpress.com", "date": "Mar 22, 2010", "message": "Not entirely surprised that people are complaining, but pretty shocked that they are comparing SO reputation to money.\n\nDo these people really look at someone 10x richer than another person and say \"Ah, see, that means that the rich guy is 10x more knowledgeable, trustworthy or helpful than the poor guy?\" I certainly hope not; not merely on moral grounds but for your own safety! I have no particular problem with Bill Gates, but I don't trust him 10x^7 times as much as myself.\n\nAs for the idea of not making such recalculations retroactive but letting you \"keep your earnings\" up to this point... so then what of our attempts to understand existing reputations: \"Well, this guy has a high score, but then he did ask 1000 question before March 2010, whereas this other guy...\" We'd have to do an approximate and very time-consuming recalc of our own in order to make any sense of the number. The displayed reputation number would become a very unreliable criterion for comparison - kinda like accumulated money!\n\nAnd though you may be able to (in some loose sense) \"trade on\" your SO reputation in the real world, you can't literally trade *with* it. Nor can you break off a tidy pile of rep points and give it to your daughter to let her have the head start you never had.\n\nSo whatever SO reputation is, it's not money. I love the price system and markets and so on, I definitely want to keep my real property, thanks very much, but the USP of something like SO comes from the fact that it's different from money. Otherwise we may all as well just display our bank balance next to our usernames."}, {"author_name": "T.J. Crowder", "gravatar_hash": "ca3e484c121268e4c8302616b2395eb9", "author_url": "http://www.crowdersoftware.com", "date": "Mar 22, 2010", "message": "I think Daniel Earwicker hits the nail on the head wrt about the change being retroactive: How then would we interpret reputation? If I earned all my rep from dozens of questions before the change, you wouldn't be able to meaningfully compare my rep with someone of similar profile who posted his questions *after* the change. (That does raise a point about meaningfully comparing reputation gained mostly from questions with reputation gained mostly from answers, but let's not go there, we don't want two rep values.)\n\nThe aspect I would have liked to have seen addressed was people losing editing rights and such, but I expect (not having read the code) doing that would have had a non-trivial effect on the code, which is not a good idea for a one-off situation.\n\nAnd let's not forget: There will be people who *gained* editing rights as a result of the recalc, if they primarily answer questions, because of the cap immunity fixes on answers being accepted and bounties being awarded.\n\n(I don't normally do this, but: captcha: \"regulatory cobbing\" Made me chuckle.)"}, {"author_name": "trampster", "gravatar_hash": "1c5255f8496fcade0244f12cb6ca6405", "author_url": null, "date": "Mar 22, 2010", "message": "Actually rep is already a tradable commodity, you trade a good answer or question for reputation. Then later you can trade reputation for a answer to a difficult question using the bounty system.\n\nYou already cant tell how much the community values a person. A low rep user could have traded a lot of rep using the bounty system. A high rep user could only be providing average quality answers but has hundreds of them."}, {"author_name": "Lionheart", "gravatar_hash": "4c3faf6ee10a90c46875a5e5c9d8b637", "author_url": null, "date": "Mar 22, 2010", "message": "You so mean!!"}, {"author_name": "Will Culpepper", "gravatar_hash": "a2092b13a0738e1d981787b0d2b50df4", "author_url": "http://eliolhan.com/wordpress1/", "date": "Mar 22, 2010", "message": "Since I lost about 1/3 of my points you'd think I'd feel bad, but reading butthurt nerds write upset comments FILL ME WITH WHITE LIGHT, so it comes out even.  \n\nPlus, thanks to SO, I've learned enough about iPhone dev in the last year to answer more and more questions. I got help, now I'm helping others. Cycle of nerd life."}, {"author_name": "Srinivas Iyer", "gravatar_hash": "daa0acce95f1e9b236ad8e2df875d1fb", "author_url": "http://stackoverflow.com/users/131024/srinivas-iyer", "date": "Mar 22, 2010", "message": "I am happy with the Change brought into  SO reputation , This  will make users to answer the unanswered questions. This may also trigger coders to provide quality , more precise and more descriptive answers .BTW I lost 110 reputation ,but still chanting the mantra \"All izz well All izz well\" :)"}, {"author_name": "pinkgothic", "gravatar_hash": "dc81a151a2e68360f919e82174ffa7b2", "author_url": "http://www.pinkgothic.com", "date": "Mar 22, 2010", "message": "I'd just like to point out that for some people, this change meant that they lost the right to do something. My SO account had only just barely made it over 100 the other day. I'm still over it, thankfully, but I was definitely wondering what's wrong - \"Did I do something wrong? I wasn't abusing the system at any point. What happened? Did I get a bunch of angry downvotes for something?\" / etc.\n\nNow I'm just worried about the people with few rep points that might've lost fairly basic SO usage rights such as for commenting.\n\nEither way, I hope the change works out for the better."}, {"author_name": "Mike", "gravatar_hash": "c98e188ba63a7875d61a77d7aaa3f5c7", "author_url": "http://careers.stackoverflow.com/mikebull", "date": "Mar 22, 2010", "message": "I lost around 1500 reputation, bringing me to almost 3000 on the dot. I don't particularly care because as already said it's just points on a website, but I was thinking of adding a bounty on one of my unanswered questions but as that would kill my ability to be able to close and reopen questions I think I'll leave it for a bit. That for me is the real kicker in this situation."}, {"author_name": "Cameron", "gravatar_hash": "e2eca8022784fe382c46535bfd2d81cd", "author_url": "http://www.cameroncooke.com", "date": "Mar 22, 2010", "message": "I don't have a problem with the changes you made. It seems to make sense to give more points to answers than to questions.\n\nI do have a problem with changing the value of existing rep earned. I think it would have caused less confusion and anger if previously earned rep was left as is and any new rep is scored at the new levels."}, {"author_name": "Lasse V. Karlsen", "gravatar_hash": "1b11262da6d1cd26b1b0bc99a2620cee", "author_url": "http://www.vkarlsen.no", "date": "Mar 22, 2010", "message": "I wholeheartedly agree with the retroactively applied bit of the rep changes. I hope this is a policy they've made, that changes to the rep calculation requires a full rep recalc, and applies backwards in time as though the changes were in effect from day 1.\n\nOtherwise they would have had a maintenance nightmare, where the routine would have to switch recalculation methods on the fly as certain crossover dates was reached, and there would probably be a whole lot of edge cases that needs special attention. For instance, now that bounties are fully immune to the daily cap, what if the rep system change occured in the middle of a day, are bounties immune or not? Depending on time?\n\nOf course, I only lost a minute amount (actually, I have no idea if I lost anything, probably not, I see some caps so perhaps those gave me the same amount back), I can understand that people that lost 1/4 of their rep is feeling bad about it.\n\nA rule I go by is that if you cannot (or won't) satisfy everyone, at least go for the change that can be easily explained. If you need to explain the rep change as \"see, you earned some of the points with system A, some with system B, a whole lot with system C, and most with system D, and the way they differ is ....\".\n\nAt least now everything is consistent."}, {"author_name": "Totophil", "gravatar_hash": "4008c948b1b3bde08d42ba6c467c7f48", "author_url": null, "date": "Mar 22, 2010", "message": "Jeff, this is just not cricket. \n\nYou might need to change the rules and it's fair play, but the rules should not be changed retrospectively. In opposite case you guaranteed to alienate part of the community."}, {"author_name": "Ondrej Spanel", "gravatar_hash": "1c4ee627a28a9a586f4fece1947c6bd0", "author_url": "http://www.bistudio.com", "date": "Mar 22, 2010", "message": "Even losing some reputation from the recalc, I am very glad for the change. I would even wish it to be a more drastic, but you cannot please everyone.\n\nIf there would be no reputation at all given for asking the question, it could lead to the state where people would mostly ask questions they have some \"external\" reason to ask, often the reason would be they want to  ... what a surprise ... know the answer. :)\n\nThe less rep given for questions, the closer to this state."}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Mar 22, 2010", "message": "Why so much pain for losing reputation? It's not real money. You will still be able to pay your mortgage people!\n\ncaptcha : Armadas although"}, {"author_name": "Daniel Earwicker", "gravatar_hash": "0256f9dfdd00ce1d37ab3f70abc561f3", "author_url": "http://smellegantcode.wordpress.com", "date": "Mar 22, 2010", "message": "@trampster - good point about the bounty system, I forgot about that.\n\nBut I remembered something else I was going to say before: with rep votes, although we can't award ourselves, we each have an *infinite* amount we can give away to others. That's another thing that's very different from money. As everyone has their own printing press for money in the SO system, inflation is a basic fact of life. If your rep stays on the same numeric value, even so its *perceived* value is probably dropping like a stone. We just have to try not to let it keep us awake at night!\n\n\"A high rep user could only be providing average quality answers but has hundreds of them.\" Why is giving a little bit of help to a million people not as good as giving a lot of help to a dozen people?\n\nAnyway, as we all know, an honest fella's rep points count for nothing these days, not with the T-shirtocracy strolling around in this season's hottest new looks! :p"}, {"author_name": "Ole jak", "gravatar_hash": "7cda6613fee35e6b5f99a29faf149703", "author_url": null, "date": "Mar 22, 2010", "message": "Some people here say that Qs are not as cool as ansers but - no Qs - no As! I asked more than 210 Qs and The ammount of upvotes given paople for ansering my Qs is much biger than  ammout of mine upvones - people just give upvotes to As not to Qs! So if I would be informed about this stupid thing you'll do to my account I'd spend all my rep to openingbountys! But cutting with no informing previosly is wary bad.\nAnd now because of that cutt I ll be able to give 50% less bountys and so on..."}, {"author_name": "Pekka", "gravatar_hash": "afe64f801c30838ee52c3c83d36b4f34", "author_url": null, "date": "Mar 22, 2010", "message": "I gained 4k rep from this recalc. As there is no virtual pub on SO, I think I'll start a few 500 bounties in the days to come :) I can also totally see the rationale behind changing the value of upvotes on questions to 5. I can also see how people having 10k+ reputations only from asking questions can't be right. \n\nDuring the discussion about this change on Meta I got the impression that many people view questions as somewhat inferior to answers. While I can see that in situations where somebody needs help, asks a question, and gets a good answer, I have come to value a good question to the extent that I think they should be rewarded *more*, not less. \n\nThere are a few people on SO who are learning a field systematically, and in that, asking basic, sometimes stupid-looking, but very justified questions, many of which have made me stop and think about something fundamental that I, having worked in my field for ten years now, have not bothered to think about for a long time. Also, the way a question is titled and put has an immense effect on how it is understood and received, and how valuable it will be for people searching for it later. The \"findability\" is in 99% of cases down to how good the *question* is. And last but not least, a good question is often an expression of expertise and deep thinking on the asker's end, and sometimes, it's the answerers who learn something. \n\nI'm not saying the +10/+5 change should be reverted. But I would like to see more ways of these good questions to get some recognition and reward."}, {"author_name": "Daniel", "gravatar_hash": "134545a5736a5e267e90f4e6bc8ca304", "author_url": null, "date": "Mar 22, 2010", "message": "I am disappointed with Jeff.\n\nYou shouldn't take it back what you already gave. If it is mine you shouldn't take it away from me!\n\nBut, I think it is fair to change the rule from now on. But, recalc the past? .... don't think so."}, {"author_name": "thSoft", "gravatar_hash": "83ebb10a57f3dd5f582f56e481337ab5", "author_url": "http://thsoft.hu", "date": "Mar 22, 2010", "message": "There should be a notification on all of the sites of the trilogy, not just meta. I was totally clueless when I saw my rep decrease, and had to think a while to come here."}, {"author_name": "paxdiablo", "gravatar_hash": "a6e7ad8582ac390cd668b2b0d6b3058c", "author_url": null, "date": "Mar 22, 2010", "message": "I wonder whether the outcry would have been as great if, instead of halving question points, we doubled everything else. Not saying that should have been done, just that it would be an interesting social experiment."}, {"author_name": "Omer Katz", "gravatar_hash": "ecefdcbc16e0f1fd61be3011b0045761", "author_url": null, "date": "Mar 22, 2010", "message": "Hmm that's strange, I lost 500 rep but I can still edit questions.\nIs it a bug or is it intended?"}, {"author_name": "Matt", "gravatar_hash": "ec42a20decd7e0ec8c337e23a4c92328", "author_url": "http://gardenfork.tv", "date": "Mar 22, 2010", "message": "In the end, the real benefit of the site is in getting answers to questions out of the heads of knowledgeable folks and into a publicly accessible format.\n\nI suspect the reputation scoring and changes to the system will always create grumblings.  I honestly don't care much how they are scored.  I don't live or die by my SO rep.  It provides some SO-related perks but if one routinely is involved on the site, the reputation will take care of itself.\n\nJust my two cents."}, {"author_name": "Matt", "gravatar_hash": "67da4fc845ee53a04bce4e7d2934055f", "author_url": null, "date": "Mar 22, 2010", "message": "Just lost a bunch of reputation ... I don't think this should have been done retroactively ... silly, if you ask me, but then again, nobody at www.stackoverflow.com did. \n\nDefinitely puts the site in a state of suspect ... when will another recalc happen? Kinda of \"feels\" like the government, when they say, oh wait, you are prospering too much from the system ... we better adjust the rules ... let's level the playing field. \n\nC'mon Jeff and Joel ... you should know better."}, {"author_name": "Victor", "gravatar_hash": "7a8b6acaf3c00f5f8ca118093ddfa9f2", "author_url": null, "date": "Mar 22, 2010", "message": "I don't care a lot about these points, but just an opinion: I think you shouldn't decrease anyone's reputation because of new rules. They're important and will estimulate good answers, this is very good. But suddenly loosing previous points (or anything) you've earned is not very motivational IMHO."}, {"author_name": "Maxim Z.", "gravatar_hash": "319bd6ef9c9c8d876f731150cb4951c7", "author_url": null, "date": "Mar 22, 2010", "message": "What's done is done, but, while I agree that the problem of people gaining too much rep from only asking questions needs to be solved, I don't think this is the way to solve it. Why _not_ reward people for questions? To me, a question is as important as an answer, because, if a person is able to explain the issue that they're having and then get answers, that deserves a +10.\n\nI think that a much better way, however, of solving the original problem, would be to institute a **ratio rule**, as you did for downvotes. If a user has some ratio of questions over answers and is getting a lot of rep for them, decrease question upvotes to +5, but only for that user.\n\nPlus, Jeff, I saw a post by you somewhere on Meta yesterday that called rep an \"arbitrary number\". Have we really gotten _that_ far? We give people priveleges based on it, we have Careers, which is _completely_ based around rep, and it's essentially the most important system of evaulating a user's trustworthiness on the site. \n\nWell, what's done is done..."}, {"author_name": "STingRaySC", "gravatar_hash": "592ad90ad35076864ef7dfaff2cfc69b", "author_url": null, "date": "Mar 22, 2010", "message": "Could someone please calculate the ratio of people complaining about the people who are complaining about losing rep to those people actually complaining about losing rep?  I think it is &gt; 1."}, {"author_name": "AntonioCS", "gravatar_hash": "8495abb9d44de2866b83a6d164948e0c", "author_url": "http://antoniocs.org", "date": "Mar 22, 2010", "message": "I, like many others, took a huge blow in the reputation score with this new rule. I think this was a really bad move on your part.\n\nI really like so and I do enjoy helping others and also of course getting help when I need it. But this cut in the rep really makes me angry. It may seem funny but I really worked hard on some answers to try and get votes (because I treated this as a game)  and now.. I lost almost half my score. I am not happy with this!!"}, {"author_name": "Daniel", "gravatar_hash": "d225ebf0faa666ac7655cc7e4689283c", "author_url": null, "date": "Mar 22, 2010", "message": "@paxdiablo: That might've actually gone over a lot better.  I heard a talk from Blizzard once about World of Warcraft during beta.  They had a system in place to try to discourage people from playing 24/7 - if you played for too long, you'd go down to 1/2 XP gain.  People bitched and moaned.\n\nSo what did Blizzard do?  They simply doubled all the numbers related to XP and turned the penalty into a bonus - for the beginning of the day, you got double XP!  It went over extremely well with the community, even though it was literally the exact same system."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": null, "date": "Mar 22, 2010", "message": "I stopped listening to the podcasts a few months ago when I found them starting to get stale so I unsubscribed to the blog. The blog got my renewed attention after getting a 27% hit in reputation though. I was about to do the 'SO careers' thing but don't really feel confident that my number is any longer that impressive. Hell of a way to start the week."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Mar 22, 2010", "message": "I'm not a big looking for rep points, but this is just another reminder, all this talk about \"it's all about the community!\" to the contrary, who's really in charge.\n\nWhich is fine.  Jeff built it.  He can do what he wants with it.  But let's not kid ourselves that this is some egalitarian community.  It isn't."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Mar 22, 2010", "message": "Lost 3k rep, but sometimes corners have to be cut to make stuff work in the long run.\n\nSure, SO is almost 2 years old now, but that does not mean it's \"done\".\n\nThe team does not have the right to change stuff midway - they have the *duty* to do so if they detect stuff goes wrong!\n\nIf SO is really here to stay for a decade or longer (Experts Exchange was founded in 1996 btw.), they have to react if they see an imbalance. And the imbalance was brought up on Meta at least 4 or 5 times.\n\nOf course, it could be debated whether the changes should be retro-active, but it would be a maintenance debt if they were not (as this would complicate rep recalcs forever).\n\nAlso strangely, no one seems to mind if the reputation goes up due to a bugfix, which is hardly surprising. But well, just with any system, there will be buffs and there will be nerfs, but it's far more acceptable than realizing in 5 years or so \"Oh crap, we should have done these changes\" and really messing stuff up."}, {"author_name": "Sean Patterson", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://dillieodigital.net/blog", "date": "Mar 22, 2010", "message": "You beat me to the punch Michael. I don't think it has happened yet, but if Jeff found a bug in how badges were being awarded or rep was calculated and Jeff announced he wouldn't be recalculating rep because it was done and over with. I think the same folks would be up in arms.\n\nKeep up the great work Jeff &amp; Crew! Been here since beta, still struggling to hit 9K (lost about 500), still loving the system."}, {"author_name": "Chad Johnson", "gravatar_hash": "4cd7dd6827a5a8b531cc6242a103f0a1", "author_url": null, "date": "Mar 22, 2010", "message": "Great! Maybe next recalculation I'll have 0 for my reputation...or maybe even a negative number!\n\nYou should have made this only affect NEW awardance of points."}, {"author_name": "BradC", "gravatar_hash": "c5c2165949f71bcd1fafbd8e694ab5f2", "author_url": "http://bradcorbin.net", "date": "Mar 22, 2010", "message": "I don't know exactly what my rep was before the update, is there any way for me to look that up? Didn't someone put up a queryable website with the data dump data?\n\nI also thought for some reason that I had gotten a larger bounty (400+ pts) at some point, but I don't see it in my rep history. Surely posters can't delete bounty posts after an answer has been accepted?"}, {"author_name": "joe", "gravatar_hash": "1110c2bdb3b7be8380de211e85fefdb3", "author_url": "http://nofouls.com", "date": "Mar 22, 2010", "message": "aaaahhhh! My rep went down to -200 on the graph. I was spending rep on bounties that I was tricked into believing I had. Not fair. Reminds me of the people who sold loans that caused the sub prime mortgage crisis.\n\n\nNo biggy I guess, I still love you Jeff."}, {"author_name": "Dan M.", "gravatar_hash": "ec326c009186734854c600265b69a6ce", "author_url": null, "date": "Mar 22, 2010", "message": "You know what's funny to me? The trilogy sites work because people *do* care about their reputation. If they didn't, they wouldn't try so hard. So, with these changes, you took away something people care about. You can laugh and say it's just a number that has no intrinsic value or tell people to get a life, but you undermine the very reason the trilogy sites have succeeded so dramatically. You are basically saying, \"We know what makes you tick, now we are going to take it away and hope you get over it.\" The correct move, as many have pointed out, is to change the point system *going forward*, not rob people of something they've worked hard to accumulate under a particular set of rules."}, {"author_name": "JulianR", "gravatar_hash": "d2f65b970cccd83fa86bb4c4600d490c", "author_url": null, "date": "Mar 22, 2010", "message": "Lost my ability to edit, which is a shame, but I'll get it back."}, {"author_name": "SP", "gravatar_hash": "abb1d15a28e1a7fa3f9376815a1e15bc", "author_url": null, "date": "Mar 22, 2010", "message": "I lost a couple hundred rep.\n\nOnly reason it annoys me is that I won't have enough to offer a bounty if I get stuck on something."}, {"author_name": "Jason Rikard", "gravatar_hash": "dd99027df46a8ed5c07380f6bb263fb7", "author_url": "http://www.jsndev.net", "date": "Mar 22, 2010", "message": "I like the changes to the rep system. Thanks for leveling the battle ground."}, {"author_name": "Ferran", "gravatar_hash": "36311f08439ec65a1427a0e78fba6cc1", "author_url": null, "date": "Mar 22, 2010", "message": "I'm lost 800 reputation, that's not serious. Not professional."}, {"author_name": "Andrew", "gravatar_hash": "5796cb83a9abf0244d4e2eb295999368", "author_url": null, "date": "Mar 22, 2010", "message": "There were two ways to do this:\n\n1) take away some points for asking questions\n2) give some more points for writing answers.\n\nOf course, Scrooge McDuck took away the points.\n\nWell done."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 22, 2010", "message": "> I wonder whether the outcry would have been as great if, instead of halving question points, we doubled everything else\n\nThis would have also required doubling the weight of downvotes, which isn't good. Bear in mind that at +5, an (unchanged) -2 downvote on a question is substantially more powerful now, and that's intentional.\n\n> this is just another reminder, all this talk about “it’s all about the community!” to the contrary, who’s really in charge\n\nI should note that this question rebalancing is based on 6+ months of meta.stackoverflow.com feedback on the subject -- so it is coming from the community, as well.\n\nAnd I initially <i>disagreed</i> with this, but the meta community convinced me! See for yourself:\n\nhttp://meta.stackoverflow.com/questions/33398/the-surest-way-to-gain-lots-of-reputation-on-stack-overflow-ask-questions/33404#33404\n\n>  It may seem funny but I really worked hard on some answers to try and get votes (because I treated this as a game) and now.. I lost almost half my score\n\nPerhaps, but you didn't lose any reputation from your answers! If anything, you should have gained (due to enhanced immunity of accepts and bounties, which are answer-specific, as well as being able to \"re-earn\" rep lost via downvotes when someone upvotes you.)"}, {"author_name": "BCS", "gravatar_hash": "d68f8d8798ee2da0d94cda6d7a544c23", "author_url": null, "date": "Mar 22, 2010", "message": "I'd love to see a scatter plot of pre/post reps. Anyone?"}, {"author_name": "Oorang", "gravatar_hash": "74c236638d43b713794e529cd59e9aa1", "author_url": null, "date": "Mar 22, 2010", "message": "@Jeff Atwood\n\n*sorry if this is a double post*\n\n\nI think the point you are missing, and the point that a lot of people are taking issue with is *not* whether or not the reputation calculation should be changed going forward; it's that you made it *retroactive*.\n\nAny third grader can tell you that if you give something and then take it back, it's wrong. If you don't get that very basic concept, then nothing else will prevail here, because almost all the protest of this highhanded behavior is based on this one simple concept. \n\nPeople on this site have provided you with something valuable and marketable... Content. Their reward is being given reputation and recognition. \n\nIf you give someone something, you relinquish ownership. \n\nIf you take something you don't own without asking... It's stealing. \n\nIt's highhanded and offensive. \n\nIt's not that I will quit the site or anything like that, because the content that we have put on your site is too useful. \n\nSo can you get away with? Yes, yes you can.\n\nBut just because you can, doesn't mean you should."}, {"author_name": "Cameron McKay", "gravatar_hash": "6ebd160dfe542ce08608dbf10652919f", "author_url": "http://cdmckay.org", "date": "Mar 22, 2010", "message": "I think we should've had a site-wide vote on this issue in the same vein as voting for moderators."}, {"author_name": "Renee", "gravatar_hash": "f618fa5c7739c7cf27f2873203cdf8f7", "author_url": null, "date": "Mar 22, 2010", "message": "Once you've earned rep, you've earned it. People wear their rep with pride and to arbitrarily take it away is more than a little inconsiderate. Would it have been so difficult to apply this policy to all rep-earning actions after a certain date? Also, have the capabilities associated with certain rep-levels been adjusted to reflect the new relative scale?"}, {"author_name": "Carlos Heuberger", "gravatar_hash": "0dee6ce22d63c1862ff0b0c7589cde03", "author_url": null, "date": "Mar 23, 2010", "message": "First: I like that change; it was strange to see \"askers\" getting rep faster than \"answers\"...\n \nBut interesting how it seams like some people, probably most with over 10K rep, forget that rep is also needed to interact with the site. It's not just an imaginary number, at least if you want to do more than just writing questions and answers (editing tags, titles; the gap between the \"Unanswered\" and the \"Ask Question\" button,...).\n\nAnd also not to forget that SO would not work without *good* questions, nor without the reputation points!"}, {"author_name": "Bryan", "gravatar_hash": "1b05b6ad8bbc5355916bda73c43ec414", "author_url": null, "date": "Mar 23, 2010", "message": "I wish SO would go to a model where they show two rep numbers: one that considers questions and answers, and one that just shows rep based on answers. \n\nThis would let those that want to play the game, play the game. Plus, it gives answer-seekers a more useful number when evaluating the strength of an answer. \n\nFor example, if you have a rep of 5000/1000, that means you write a lot of questions. If your rep is 500/5000 that means you give a lot of answers. Both of those numbers are useful for different reasons."}, {"author_name": "fred-hh", "gravatar_hash": "8a12016e08eb5381ab588d046917dcb2", "author_url": null, "date": "Mar 23, 2010", "message": "The change is fair. Nevertheless, it should be more widely publicized: on this day there is still no warning banner on SO and no easy way for a SO user to know about the change, even if that SO user wonders about a sudden drop in reputation and try to understand it as I did yesterday.\n\nI ended up posting a duplicate question yesterday on MSO about why my reputation dropped from 100 to 50 and while some people responded politely and helpfully, I got rebuffed by high MSO reputation people who couldn't understand that it's always good to be polite to well-meaning users and who couldn't accept that it was possible that despite reasonable efforts, a not-so-naive SO user doesn't get the information that a reputation recomputation occurred. \n\nYET, TRUST ME, it WAS and STILL IS possible.\n\nThe fact that my question was deleted is not going to improve things, since people who would ask the same question using the same words will NOT find any information about the recomputation in the first \"similar questions\" returned by the search engine."}, {"author_name": "Carlos Heuberger", "gravatar_hash": "0dee6ce22d63c1862ff0b0c7589cde03", "author_url": null, "date": "Mar 23, 2010", "message": "First: I like that change; it was strange to see \"askers\" getting rep faster than \"answers\"...\n \nBut interesting how it seams like some people, probably most with over 10K rep, forget that rep is also needed to interact with the site. It's not just an imaginary number, at least if you want to do more than just writing questions and answers (editing tags, titles; the gap between the \"Unanswered\" and the \"Ask Question\" button,...).\n\nAnd also not to forget that SO would not work without questions, nor without the reputation points!"}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Mar 23, 2010", "message": "From the beginning, we have been told that SO reputation is based upon the level of trust that SO gives to a user rather than as a measure of knowledge/skill.  It thrills me to know that SO trusts me less today than it did last week. :)\n\nThanks,\nJess"}, {"author_name": "Adam Bellaire", "gravatar_hash": "b7b7883a31427dbf51a6235e2046e169", "author_url": null, "date": "Mar 23, 2010", "message": "@Jeff: Firstly, I agree with the change.  Nicely done, no complaints.  \n\nWith regards to your last post, though, I think that we're all a little perplexed by the swiftness of this change.  It's great that after the previous proposal had been planned for 9 months, you listened to the discussion and decided to table it.  But it's not clear why, by contrast, the time from proposing these specific changes (reduced upvotes for questions) and implementing them was less than 24 hours.  \n\nhttp://meta.stackoverflow.com/questions/42769/should-the-weight-of-question-upvotes-be-reduced\n\nIt's clear that you value the input of the community, but the manner in which you collect that input is a little... unpredictable.  In particular, why not leave this proposal in place for a little while on meta to collect yet more discussion?  Why so quick to implement?\n\nThis is a long-standing question on meta: why do some planned features languish for months while others are implemented nearly immediately?  For the most part, the answer was that small changes need less discussion than large ones.  But this was a huge change... so it's odd that the specifics of one huge change sat around for 9 months of discussion before being tabled, while the specifics of this huge change (the mechanics of which are different from anything that was on previously the table) were discussed for less than 24 hours.\n\nAgain, I like the change, and I am not one of those shell-shocked by it.  Just pointing out that the roll-out might have been handled more smoothly.  (Maybe.  Who knows?)\n\nCaptcha: earnest fanfare"}, {"author_name": "Bryan D", "gravatar_hash": "3497d52dba17d86666a7bc82a2243c07", "author_url": "http://www.bryandenny.com", "date": "Mar 23, 2010", "message": "Well, I lost ~1400 dropping me from ~3300 to ~1900 so I lost both edit posts and vote to close (double whammy, ouch).  But that's okay, I've already gained back ~300 yesterday and today from answering a bunch of questions. Plus, answering questions is so much more fun (unless Jon Skeet enters the arena ;))"}, {"author_name": "Hanno", "gravatar_hash": "565798f3420b2682c103a5e2c48f03f8", "author_url": "http://stackoverflow.com/users/2077/hanno-fietz", "date": "Mar 23, 2010", "message": "Ouch, that was -3k - more than 50%. But given my Q:A ratio, this was exactly what I expected, and I'm not gruntled at all.\n\nTo me, the change makes sense, I feel a retrospective application is the cleaner way to do it, and I'm glad that you have enough reason and balls to make changes as you see fit. \n\nYou already have made SO a great place, and I trust you guys to make the right decisions and make it even better. Taking the community seriously to the point that you are willing to accept individual disappointment to improve future development, is a skill I would love to see in many politicians in the real world.\n\nOn a side note, a change like that makes me wonder: How would this have worked in stackexchange communities? As a stackexchange site owner, would I have had a choice of whether or not I want to go along with the new policy?"}, {"author_name": "TwentyMiles", "gravatar_hash": "44daa844fd24e745e2a91f8a562a1ff8", "author_url": null, "date": "Mar 23, 2010", "message": "Although I lost comparatively few points (~200) compared to some people, if this had been a video game I think I still would have thrown my controller at the wall."}, {"author_name": "Smith", "gravatar_hash": "2079ae5b8b9992f633c41db678767d89", "author_url": null, "date": "Mar 23, 2010", "message": "Not satisfied. Retroactive changes are not good ones, even when imperative, which this was not. Not Satisfied at all."}, {"author_name": "Phil", "gravatar_hash": "bcc7e312e045f2264e252c591e7af1de", "author_url": "http://zoldello.wordpress.com", "date": "Mar 23, 2010", "message": "It is horrible to do an Ex Post Facto point-change/recalculation. It like paying someone for a job well done then wanting your money back because of a tax increase or something else; a deal is a deal and point earned ought to be point to stay. I have lost some interest in contributing due to this."}, {"author_name": "Blaenk", "gravatar_hash": "526e8137f5b3a003d873c2da2ecf1129", "author_url": "http://www.blaenkdenum.com", "date": "Mar 23, 2010", "message": "Cool I only lost about 300 rep points :)"}, {"author_name": "Stephen", "gravatar_hash": "6400a9f2e6cc16639e2369612d984a61", "author_url": null, "date": "Mar 24, 2010", "message": "&gt;&gt;I should note that this question rebalancing is based\n&gt;&gt;on 6+ months of meta.stackoverflow.com feedback on \n&gt;&gt;the subject — so it is coming from the community, as \n&gt;&gt;well.\n\nTrue that there was a problem with people asking lots of lame questions.  But the idea to half all question points was not from meta (at least as far as I could see).  It got posted on meta by Jeff and then cemented in 5 hours later (by posting it as a plan on the blog).\n\nSo the point that \"this is just another reminder, all this talk about “it’s all about the community!” to the contrary, [this change shows] who’s really in charge\" has some weight.\n\nI agree with JohnMcG.  Jeff built it, he can do what he wants with it.  But, while the community gets to comment on meta all they want, in the end it is an owned product and unilateral decisions can be (and were) made and put in to effect with little to no feed back from the \"community\"."}, {"author_name": "Keng", "gravatar_hash": "15769bbea999aee421458f52e7c9d011", "author_url": "http://stackoverflow.com/users/730/keng", "date": "Mar 24, 2010", "message": "Now that I've had a couple of days to let the dust settle in my own head, I'll go ahead and say what's on my mind, if comments are even still being allowed here.  Here it is.  \n\nRep is important.  It has always been important.  Both Jeff and Joel have assigned special privileges to rep thus proving that even THEY think it is important.  To show just how important they think that rep is they have even gone so far as giving very high rep score users a great deal of special privileges on the site.  I don't think that any of that can be reasonably disputed.  Rep is important.  I also hold this opinion.\n\nI was first involved with SO very early on in its development; my user id is 730 (I have both a beta and yearling badge).  When Careers started up, I paid to have my cv published and have been putting my cv link on ALL my job correspondence.  That may not seem a big deal, but as I have been out of work since mid-November and only recently picked up a three-month contract just this month, it's been circulated a great deal.  There is an important point to make here about SO and Career's; the rep score is prominently displayed on the CV and my score of 2085 is a very good rep (that puts me in the top 2% of all SO users).  I say all of that to establish two things: \n\n1. I am no \"johnny-jump-the-internet-troll-bandwagon-lately\" for the sake of a cause to be angry about.\n2. I am vested in this family of sites more than most.  I've been here a long time and I've put actual money into it.\n\nWhen I was granted access to the beta site, I was tasked by Jeff and Joel to start seeding the site with questions.  We all were; they said they needed a critical mass of questions to help people start getting to the site.  So I (we) did.  I had put up some 36 questions and 73 answers (and numerous comments).  I have 47 badges (which include the Taxonomist and Disciplined badges).  So, how much did I lose?  Right at 500 points; 25% of my rep.  So, now I sit at 1584.  Not a bad rep; still in that top 2% of all users.  But, all my resumes that have been sent out over the past three months show my rep right at about 2000.  Yes, I can tell people there was a large adjustment in the rep scores this week...If they ask me...Or, if the look at the SO blog....But, I think we both know what they are going to be thinking.  \"My, my, I guess you thought I was too stupid to check you score, huh.\"  \"Well, Mr. Not-Gonna-Work-Here, I don't have time for people who make spelling mistakes on their resume and I DON'T have time for people who LIE on their resumes.\"  Well, maybe they will and maybe they won't; I'll never know...and neither will you.  They'll just move right on past and I'll never get a chance to explain why I sent them an inflated figure.  Simply put, Jeff and Joel asked me to seed the site and I did and now they've taken back what they 'paid' me because they think they are currently 'paying' too much.  \n\nI think that it would have been fair to change the values for the questions going forward not retroactively.  That sort of retroactive-scope change may start to make a person think where else their hard work may be devalued in the future.  It may make me a person think, \"oh yes, he'll give me 10 points an answer now, but next year he may think that he wants to discourage someone from going through and marking three or four of the ten answers on a question as good and so only allow 5 points for the third or fourth question that particular person marked up on that particular question.\"\n\nI wish you would reconsider this again and give back what you said you would give us for the questions.  You can of course re-negotiate what you will 'pay' for the future and that seems fair but reaching backwards to take what's been earned may have a chilling effect that you'd want to discourage as well.\n\nword verification:mammas region\nI'm uncomfortable with that....80)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 25, 2010", "message": "> But the idea to half all question points was not from meta (at least as far as I could see). It got posted on meta by Jeff and then cemented in 5 hours later (by posting it as a plan on the blog).\n\nThe idea to double the power of downvotes was indeed there.\n\nhttp://meta.stackoverflow.com/questions/7322/should-the-weight-of-downvotes-be-increased\n\n+180 votes.\n\nIf you halve the value of a question upvote, <b>you have implicitly doubled the value of a downvote</b> .. on a question.\n\nAnd that was always the goal."}, {"author_name": "Eric Ryan Harrison", "gravatar_hash": "84d9c06ad23348c26556512289dfe6a4", "author_url": "http://ericharrison.info", "date": "Mar 25, 2010", "message": "Mr. Atwood:\n\nI haven't seen this mentioned in any of the blog posts or comments, so I'm asking here:\n\nWith the reputation changes, will you guys be tweaking the badge requirements for certain badges that are granted at certain reputation thresholds? The easiest example of this is the Yearling badge, in which you've been a member for a year and have gained \"X\" reputation during that period.\n\nWill those rep requirements be tweaked?"}, {"author_name": "Dani", "gravatar_hash": "b50e05a5f1954d250dd908dacce081c0", "author_url": null, "date": "Mar 26, 2010", "message": "I Think the change is good, but no recalc should have occurred taking people's already earned reputation.\n\nThese kind of changes should effect from now and in the future, and not take's people rep that they've earned in the past - being legitimate or not.\n\nPlus (and I saw it here before) if you decided to recalc - you should have post something in the header of each site, with a link to this page.\n\nAbout deleted questions - If someone puts an effort answering a question and get reps for it, why do you take it when Question is deleted ? (same goes for user)\n\nIMHO since it cost nothing to give reputation points, but it makes the people in this community happier, the site administrator should try to remove a little as possible reputation over a non - \"bad answer/question\" reasons...."}, {"author_name": "Daniel Earwicker", "gravatar_hash": "0256f9dfdd00ce1d37ab3f70abc561f3", "author_url": "http://smellegantcode.wordpress.com", "date": "Mar 28, 2010", "message": "@Keng - I'm kind of astonished by your comment.\n\nI was totally on your side. Then I got to the part about what your rep reached. Are you serious?\n\nBased on your rep graph. you've barely contributed to the site for most of its existence (since about Oct 2008).\n\n----\n\nTo re-iterate for the many disgruntled posters who aren't interested in reading the thread-so-far, and who are still saying:\n\n\"Please don't take away my existing rep\"\n\nIf SO reputation is supposed to mean something, how would be helpful for the meaning to depend on how many of a person's received votes were cast before or after a certain date in the history of the site?"}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Mar 29, 2010", "message": "@Daniel,\n\nThink about how this might apply in other contexts:\n\n* If you get a raise or a pay cut, your employer re-calculates your compensation for your entire employment, then cuts you a check or reaches into your bank account, and grabs the amount to match that rate.\n\n* Basketball adds the 3 point line.  They then re-calculate every players' point total to reflect what they would have scored if the 3-point line was in place.  \n\n* The government lowers the speed limit on a road.  They then issue speeding tickets to people who exceeded the new speeding limit before the change.\n\n--\n\nIn software, it is a little easier to change things.  That doesn't mean we should.\n\nFor me, what the recalc underscores is that the reputation scores are just an arbitrary number that are subject to change on arbitrary whim.  One might say that only a fool would believe otherwise, but the site is built in part on the notion of using this as an incentive for quality content."}, {"author_name": "ex-cowboy", "gravatar_hash": "f6d720dcaf6b76a3f44f2ed507e857ee", "author_url": null, "date": "Mar 29, 2010", "message": "Now that the dust has settled and I've got over my slightly reduced rep, I'm left with the feeling that this was a very badly handled change.  \n\nStack Overflow users have spent a lot of precious time making the site a success, thereby proving the concept and enabling its founders to seek funding to expand it as a business.  If you get your funding and the business becomes a success, it will be in large part due to the unpaid efforts of all those users who wanted nothing more than to get their tough questions answered and help others in return.\n\nThese users are your customers, and to make a \"stealth\" change where many of them had their (to them precious, as evidenced by the comments above) reputations reduced without any explanation other than a blog post is just bad customer service.  I'd have liked to see at least an acknowledgement of that, if not a full blown apology."}, {"author_name": "Daniel Earwicker", "gravatar_hash": "0256f9dfdd00ce1d37ab3f70abc561f3", "author_url": "http://smellegantcode.wordpress.com", "date": "Apr 01, 2010", "message": "@JohnMcG - \n\n\"If you get a raise or a pay cut...\"\n\nSO reputation is definitely not money. See previous comments. Or alternatively, think about whether you'd like our SO avatars to be accompanied by a number representing how much money we have in the bank, so others can judge us by it.\n\n\"Basketball adds the 3 point line. They then re-calculate every players’ point total to reflect what they would have scored if the 3-point line was in place.\"\n\nSounds perfect. Why wouldn't they do that if only it was practically possible? The statistics are supposed to help you compare players, so it would be crazy to NOT make such changes retroactively recalculated if you had the ability. To not do so would make the numbers almost meaningless for years, if they are supposed to help you predict how a player will perform in the future. This is a very good analogy with SO, well done! :)\n\n\"The government lowers the speed limit on a road. They then issue speeding tickets to people who exceeded the new speeding limit before the change.\"\n\nAnd speeding tickets represent fines, which represents dipping into people's bank accounts to punish them. But SO reputation is not money. See above. Other people are \"stealing\" the value of your reputation score every second! Every time I upvote someone else, I create a unit of SO rep value, out of thin air, causing inflation, and thus damaging the relative value of everyone else's reputation score. SO reputation simply does not represent an absolute value that you've accumulated and that no one has the right to take away from you. It's shrinking in value all the time.\n\n\"For me, what the recalc underscores is that the reputation scores are just an arbitrary number\"\n\nNo, you have it backwards. If the recalc had not been retrospective, everyone's rep would have included an arbitrary historical error rendering them all meaningless until there was enough rep-inflation to make the error insignificant (which would probably take a few years).\n\nIf rep scores were protected individual property, they would be like money: not much use as an indicator of how helpful or knowledgeable a person is.\n\nIt is a fact of life that we need some thing to represent protected individual private wealth, *but we already have money for that*. SO reputation is for a *different* purpose."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Apr 01, 2010", "message": "I'm aware that reputation scores aren't money.\n\nBut they are, in a sense, compensation for one's contributions to the site.  It is how we are keeping score, and various parts of the site (e.g. including the score in \"flair\", displaying it in careers, linking it to admin abilities) have encouraged us to think that way.\n\nJeff (or \"the SO community\") determined it would be prudent to tweak how that's calculated.  Fine.\n\nBut, I think it's damaging to the credibility of the metric.  And yes, I think it would be damaging to go back and re-calculate athletes' statistical totals every time the rules change.  They're a measure of how effective players were in that context.  Retroactively applying a different context makes those accomplishments meaningless.  \n\nMany programming tasks that were very difficult years ago are easy today.  Should we thus downgrade our opinion of earlier developers?  Of course not.\n\n---\n\nObviously Jeff has the \"right\" to do whatever he wants with our reputation scores (though as I said above, acting in such a capricious manner belies the \"it's all about the awesome community\" rhetoric we've been treated too.).\n\nI'm just relaying my reaction that doing this undermines my confidence in the reputation scores, and makes it a less attractive incentive for me to contribute to the site.  YMMV."}, {"author_name": "matt", "gravatar_hash": "875b592087c435ab4a8d533cda9b69c1", "author_url": null, "date": "Apr 06, 2010", "message": "My habit has been to make every question and answer a community wiki. I'd like to leave the door open for future community members to correct and enhance the info that is there. I didn't realise this came at the cost of reputation. So now I have to choose between self agrandizement and community service. Blech."}, {"author_name": "Daniel Earwicker", "gravatar_hash": "0256f9dfdd00ce1d37ab3f70abc561f3", "author_url": "http://smellegantcode.wordpress.com", "date": "Apr 07, 2010", "message": "@Matt, users with 2000+ rep can edit any post, regardless of whether the post is CW. Anyone with 50+ can leave you a comment to get you to fix your answer. Anyone with 100+ can downvote your answer. And anyone at all can write their own answer, in which they directly criticise yours and call you all kinds of names! So CW is not a prerequisite for making an open/correctable contribution to the site."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Apr 07, 2010", "message": "At the risk of beating a dead horse, let me say there are two ways of using metrics:\n\n1.) To reflect what someone <i>did</i>\n\n2.) To predict what someone <i>would do</i> in current circumstances.\n\nI submit that everything about how Stack Overflow operates is based on the first model rather than the second, which is why I think recalculating the scores makes little sense."}, {"author_name": "Daniel Earwicker", "gravatar_hash": "0256f9dfdd00ce1d37ab3f70abc561f3", "author_url": "http://smellegantcode.wordpress.com", "date": "Apr 12, 2010", "message": "No, please, flog the dead horse! It's probably only me reading it now, but it's interesting. :)\n\n\"I submit that everything about how Stack Overflow operates is based on the first model rather than the second\"\n\nWhy? For example, the \"SO Jobs\" thing encourages employers to use SO reputation to predict how valuable a candidate will be.\n\n\"which is why I think recalculating the scores makes little sense.\"\n\nDouble Why?!\n\nIf you don't recalculate then you'd have two users, one who was active last year, another who is active next year, and who did exactly the same thing but have totally different scores.\n\nSo even if you think the reputation is purely about reflecting what someone did, it's not going to be able to do that accurately if it is skewed in a way that bears no relation at all to what people actually did, but merely *when they did it*."}, {"author_name": "Furiant", "gravatar_hash": "731409b9212396a1671fdccf013c57f0", "author_url": null, "date": "May 16, 2010", "message": "I don't really see the reputation score as being a reward, but as more of an indicator of how much credence, or perhaps benefit of the doubt, I should give I see an answer to a question. Someone with very high rep has probably answered a large number of questions in a way that helped people, so I tend to take their answer more seriously, even if I don't ultimately go with it. \n\nI don't really see the benefit of assigning positive rep for questions. I like that 'noise' questions can garner negative rep, but only in that it serves the same purpose outlined above - not for some 'punishment' factor.\n\nAll in all I think it would be better to discourage thinking of rep as a 'reward' for participating in an activity that is rewarding by its very nature."}]}