{"response": [{"author_name": "Jack Marchetti", "gravatar_hash": "d8dbec34a43456856f7d219da71d6a50", "author_url": "http://4ofakindfilm.com", "date": "Jul 20, 2012", "message": "Bravo Joel."}, {"author_name": "Kevin Duffield", "gravatar_hash": "29bfc2f25eb8ecc01b6ebc2922deb196", "author_url": "http://Infinitysum.net", "date": "Jul 20, 2012", "message": "Glad this is being addressed, I've watched ths transformation in other communities ans was sad to see it happening on SE sites. Although I must admit I've caught myself being a snark at times."}, {"author_name": "Daniel Serodio", "gravatar_hash": "945258270639ca5c60f7bc5b778b3319", "author_url": null, "date": "Jul 20, 2012", "message": "The correct spelling is \"plz give me teh codez\" :-)"}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Jul 20, 2012", "message": "Oh, welcome to 2010.\n\nGreat initiative, but saying that the place is *starting* to be a bit insular or unfriendly to people who don't know the rules is one hell of an understatement. \n\nThe last year or two has been little more than a competition of who could turn away the most people and delete the most questions. And about who could say the most words on Meta about which tags should be deleted, which rules to create, how to shape, limit and constrain the site. \n\nBecause apparently, the people who want to influence SO think it looks untidy if people ask too many questions. Because SO is a community of programmers, and if there's one trait you can rely on finding among programmers, it's OCD. Everything must be in its place, tagged in the right way, following the right template, and NOTHING must be duplicated, nothing must be *wrong*, nothing must fall outside my norms and expectations.\n\nAnd so, questions can be deleted if they don't conform. Comments can be deleted because they're not supposed to contain anything important *anyway*. \n\nAnd, I might add, given your tweets about Wikipedia just a day or two, there's a certain irony here.\n\nSO and Wikipedia are both suffering from a small \"ruling\" (I realize that word is contentious among, well, the ruling clique) clique who have *their* idea of what's relevant and what is not, and who will gladly and uncritically delete and censor anything that does not fit their vision, no matter how many newcomers are turned away, and no matter how much it isolates them and impoverishes the site.\n\nOn Wikipedia, otherwise well-written and high-quality articles are deleted because of the absurd and inconsistently applied \"notability\" requirement, discouraging many people form contributing. Quality has nothing to do with it. You just chose to write about something that we, the ruling elite, found irrelevant, so we're going to delete it.\n\nOn SO, otherwise well-written high-quality questions or answers have to be defended almost on a monthly basis, against hordes of Meta'ers or moderators who need something to delete, something to retag, something to CHANGE and REDUCE. \n\nUtterly harmless little touches like ending an answer with \"Hope this helps\" get silently edited out because it looks untidy -- and if it turns away the person who wrote the answer, who just wanted to be helpful and add a human touch, sees his answer reduced to an impersonal blob, then that's an acceptable loss.\n\nQuestions with a thousand or more upvotes and which have been favorited just as many times are attempted deleted because, while the question is obviously popular and helps a lot of people, it doesn't conform to the \"accepted\" template of \"how a SO question should be structured\".\n\nComments get deleted because, while they obviously add information that's not present in the answer, the comment thread had gotten long enough that \"it looked untidy\".\n\nA reminder to be friendly to newbies is much needed, and a great start. But actions speak louder than words; it doesn't matter how friendly you are to a newbie, if everything he writes, questions, comments or answers, is being butchered, if legitimate content is sacrificed just to satisfy a group of programmers' collective OCD.\n\nThis is a great initiative. But it's not enough."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 20, 2012", "message": "@jalf can you provide any specific examples of what you're talking about? It's hard to understand what you mean unless you can point to some concrete examples.\n\nAnd on the topic of popularity, remember that popularity isn't the only metric that matters. If it was, we'd all be doing nothing but listening to Justin Beiber albums 24/7 right now.\n\nhttp://blog.stackoverflow.com/2012/01/the-trouble-with-popularity/"}, {"author_name": "Ronald Stewart", "gravatar_hash": "e695e1e5fd528758c9c2da4e10e299ac", "author_url": "http://xoxo.gl", "date": "Jul 20, 2012", "message": "From a newbie and a passer-by who has left the site for this reason: thanks for identifying this problem and good luck! It seems like a lot of work to tackle this now."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 20, 2012", "message": "&gt;  I did a quick survey and found that about 50% of questions that are closed on Stack Overflow are also accompanied by an unfriendly comment.\n\nCan you provide any specific data on this? Didn't you guys do some kind of sentiment analysis?\n\nI'm doing a \"quick survey\" right now, and here's my data. I'll pick the top 10 questions from page 100 of the close list:\n\nhttp://stackoverflow.com/search?page=100&amp;tab=newest&amp;q=closed%3a1\n\nI honestly can't see one comment in those 10 questions that could be construed as rude. Most have no comments, or just comments asking for clarification. None make fun of the question or the asker in any way that I could see.\n\nTo be clear, I am all for civility, and in fact civility is *required* and *enforced* per the FAQ. It never hurts to remind people to be civil, either!\n\nStill, I think this post would be stronger with actual real world examples of snarky comments (and some data on how often it was seen, next to the examples) to show people what not to do."}, {"author_name": "Jeremy", "gravatar_hash": "5557f2954ecfcd2d3c8a2138127e9f0c", "author_url": null, "date": "Jul 20, 2012", "message": "First off: Great post.  The anti-new user hostility on SO is something I've tried to (politely) fight back against recently, so it's great to hear that it's not just a personal battle anymore.\n\nSecond: What Jalf said ... with about half as much ranting ;-)\n\nThe crusade against \"subjective\" questions (as if anything on SO is truly \"objective\") is a solution in search of a problem.  No one is hurt by these \"subjective\" threads, and to the contrary a large community of users is helped by them, yet they are often closed (or worse) by a couple of snarky 500k-rep users.\n\nIt should be obvious that something is wrong when a few power users can destroy value for a much larger group of users, just to satisfy their OCD cravings and fulfil the mythical goal of \"true objectivity\" on SO.  Anyone who can't see that needs to get off their high horse and stop pontificating on the great philisophical goals of SO, and try actually reading some of those threads.\n\nI don't mean that as a rhetorical threat, I mean really, go read those threads.  If you do I think the inevitable conclusion you'll draw is that they benefit the SO community, and something like a \"this post is more subjective than most\" flag would be a MUCH better solution than closing/deleting them."}, {"author_name": "Hossein", "gravatar_hash": "3516826949422fb6a54ed6923221c398", "author_url": null, "date": "Jul 20, 2012", "message": "What do you think about a rewarding SE communities in some sort of way on factors such as the number of new users joining the community, etc."}, {"author_name": "Laura", "gravatar_hash": "5028fddccddf5610dac7383b00da7619", "author_url": "http://stackexchange.com/users/463263/laura", "date": "Jul 20, 2012", "message": "@Jeff\n\n\"And to make everything, you know, scientific, we’ve started actually measuring friendliness in comments, automatically, using Mechanical Turk. We’ll share some astonishing results of that study soon.\"\n\nThere will be a follow-up blog post."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 20, 2012", "message": "&gt; The crusade against “subjective” questions (as if anything on SO is truly “objective”) is a solution in search of a problem. No one is hurt by these “subjective” threads, and to the contrary a large community of users is helped by them, yet they are often closed (or worse) by a couple of snarky 500k-rep users.\n\nYou're twisting civility into a totally different discussion. See\n\nhttp://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/\n\nStack Exchange is about questions that can be answered and verified at least a *little*. It's not about discussion, creating lists of opinions, surveys, polls, etcetera. There are many other places on the Internet to do that stuff.\n\nOn Stack Exchange we prefer answers that can be verified in some tiny way with a little bit of armchair science. \"Because that's what I think\" is a valid reason to answer anything on Quora (and most other places on the Internet), which gets into unpleasant weirdnesses like judging answers based on the fame/success of the answerer, because, well, what other science can you apply to an <i>opinion</i>?"}, {"author_name": "Rachel", "gravatar_hash": "01b235a8024b2dd10f427c301c876a0b", "author_url": "http://rachel53461.wordpress.com", "date": "Jul 20, 2012", "message": "Where's the +1 button for @Jalf and @Jeremy's comments??\n\nI'm really happy to see this post though. It's an attitude that has bothered me a lot with the SE sites, and I'm glad to know it is not something SE endorses, and that they actively want to work at addressing the issue.\n\nSome users don't even realize that their choice of words comes off as rude, hostile, unfriendly, etc. They read their comments using the eyes of someone who's been around SE for years and see nothing wrong with what they're saying. I'm glad to your drawing so much attention to the matter now.\n\nAnd I'm very interested in seeing the followup blog post too :)"}, {"author_name": "Jeremy", "gravatar_hash": "5557f2954ecfcd2d3c8a2138127e9f0c", "author_url": null, "date": "Jul 20, 2012", "message": "@Jeff Sorry if I was unclear: I'm not saying \"let's just have completely personal opinions on SO\".  What I'm saying that \"what is subjective?\" is a subjective question.  The standard of subjectivity on SO is not some magical clear line, it's an almost arbritrary decision made by power users on a case by case basis.  Furthermore, that standard has varied significantly over the lifetime of the site.\n\nIt seems to me (in my 100% subjective opinion) that the current guardians of SO are now significantly happier to close/delete threads for being subjective than they used to be.  In the process they are destroying resources which are valuable to other users.\n\nRather than focus so much on this subjective assement of what is or is not subjective, I think it would be healthier for the community to focus on what's valuable to the community.  Personal opinion threads are value-less, we both agree, but that doesn't mean that \"which framework is best for me\" threads are similarly value-less.  In my (again, 100% subjective) opinion, value trumps percieved objectivity."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.billthelizard.com", "date": "Jul 20, 2012", "message": "Jeremy,\n\nWe have <a href=\"http://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/\" rel=\"nofollow\">Good Subjective, Bad Subjective</a> to help guide us on that issue.  We get a lot of \"which framework is best\" questions that get closed and deleted every day.  Those typically devolve into everyone answering/voting for their favorite without giving any supporting evidence.  Occasionally though, we do get a question in that vein that gives enough details to be useful, or someone gives an answer that's just too good to delete.  It's those rare cases where we relax the rules a little and prefer to preserve good content."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jul 20, 2012", "message": "@Jeremy: yes, \"subjective\" *is* subjective. That's why the notion of classifying pure-subjective vs pure-objective <a href=\"http://blog.stackoverflow.com/2010/08/the-death-of-meta-tags/\" rel=\"nofollow\">was abandoned by force</a> some time ago. \n\nThat doesn't mean folks don't fixate on the wrong things though. That \"Good Subjective / Bad Subjective\" post Jeff linked to? It lays out exactly what you touch on in your last paragraph: the sort of \"subjective\" questions that are <b>valuable</b> and those that are not. \n\nUnfortunately, some folks have forgotten <i>why</i> we discourage certain forms of questions, and have chosen instead to fixate on the form over the results when evaluating them (example: flagging every question that contained the word \"recommend\"). This isn't something we condone. At the same time, simply being popular is frequently mistaken for \"useful\" - it's critical that <i>both</i> sides keep going back to the question of \"how is this useful, what problem does it solve?\""}, {"author_name": "phwd", "gravatar_hash": "d51a60c7bade46cd12ac19008ba3d8e7", "author_url": "http://FoedariProvincial", "date": "Jul 20, 2012", "message": "Sure one can look at the problem as the fault of the old timers.\n\nor\n\nThe new guys could learn to read. Would it *not* be amazing if new users actually read the FAQ instead of skipping over it, wrote properly and provided sufficient explanation? You don't need to be *in* Stack Overflow to know how to write and explain properly.\n\n\"Here's my code, it doesn't work. Thanks in advance\"\n\nor\n\n\"Here's my code, here is a brief explanation of the problem and my error log\"\n\nFix only one side and your old timers who would put on the flowers and smiles are going to get burnt out guiding and holding every user who is too *lazy* enough to do their own work."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jul 20, 2012", "message": "@phwd:\n\n> The new guys could learn to read. \n\nYeah, the solution to \"<a href=\"http://en.wikipedia.org/wiki/Eternal_september\" rel=\"nofollow\">Eternal September</a>\" is to make it not be September anymore. The flaw in that plan is that it <i>always will be September</i>. That's why we call it \"Eternal\". Your solution is perfect in its elegance, worthy of <a href=\"http://en.wikipedia.org/wiki/The_Hitchhiker%27s_Guide_to_the_Galaxy\" rel=\"nofollow\">Ford Prefect</a>:\n\n<blockquote>\n\"Yes,\" said Ford, \"we're trapped.\"\n\n\"Well didn't you think of anything? I thought you said you were going to think of something. Perhaps you thought of something and didn't notice.\"\n\n\"Oh yes, I thought of something,\" panted Ford. Arthur looked up expectantly.\n\n\"But unfortunately,\" continued Ford, \"it rather involved being on the other side of this airtight hatchway.\" He kicked the hatch they'd just been through.\n\n\"But it was a good idea was it?\"\n\n\"Oh yes, very neat.\"\n</blockquote>\n\nThere is an endless supply of new users, unfamiliar with the increasingly-large canon of rules and etiquette, and mostly unwilling to read it. So any solution that involves the absence of this constant is doomed.\n\nWhich is why folks tend to get progressively more irritated, at least until they realize this. \"I keep helping these people, and yet they never learn!\" This is why the first step to dealing with <a href=\"http://slash7.com/2006/12/22/vampires/\" rel=\"nofollow\">Help Vampires</a> <i>isn't</i> to stab them repeatedly - it's to recognize what you're dealing with, and <a href=\"http://en.wikipedia.org/wiki/Triage\" rel=\"nofollow\">triage</a> them: help those you can, in as friendly a way as possible - these will become your allies in the future. And for the rest... Just walk away. Don't waste your time or anyone else's with snarky, preachy, faux-helpful or outright mean comments - it does nothing for the vampire, and only serves to further exhaust you."}, {"author_name": "Your own medicine", "gravatar_hash": "c8338a75914971cef5add9cc6cec0314", "author_url": null, "date": "Jul 20, 2012", "message": "The funny thing is, I stopped asking questions on SO when the question would be deleted for being too similar to another question, then get deleted from the comments on that 'similar question' for being off-topic.\n\nAlso, if it were simple laziness that gets a question deleted, as the question seems to be asking for a simple, everyone-knows-THAT sort of answer, then all questions should be deleted, as there will always be someone with an answer that seems obvious to them.  It's not too hard to see how the logic of assumed laziness could cause SO to appear to be irrelevant as a whole.  If questions are deleted due to the appearance of laziness to a few old-timers, then just be done with the whole mess and delete the entire domain already.\n\nFor the record, I am just meeting phwd's full-flavored snark with a bit of 'snark-lite' of my own."}, {"author_name": "phwd", "gravatar_hash": "d51a60c7bade46cd12ac19008ba3d8e7", "author_url": "http://www.imdb.com/title/tt1099212/", "date": "Jul 20, 2012", "message": "@Shog10\n\nAll comments don't need to be \"snarky\" (sometimes it's subjectivity and the user perspective of the comment, as seen by @Your own medicine who feels I am being snarky... subjectivity and bias is at play) and all actions that contribute to the supposed unfriendliness comes in down-votes and close votes. So come next summer would we talking about removing those as well?\n\nThe fact that someone took the time to comment (excluding the extremely obvious snark comment) must mean they care to help even it if makes them look unfriendly.\n\nGiving in to the idea of Eternal September isn't really good either. It's basically saying new users or people in general would never get better at reading manuals/faqs. If they did, they may, you know, actually get better at coding and finding the solution to their problem.\n\nA problem can be self-solved by the author just by rethinking it and writing it out in a detailed explanation.\n\n&gt; By the time I started writing up the question, I realized where the fault was\n\nSo yes, how about not make it September anymore since it's July."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jul 20, 2012", "message": "@phwd: again, don't confuse <i>individuals</i> with The Internet at large. Individuals can - and often <i>do</i> - \"learn to read.\" The most useful, constructive thing you can do for a new user is to guide them into this: Stack Overflow and Stack Exchange are <i>full</i> of success stories here, folks who were confused and initially resisted correction mightily when faced with how different we are from the forums and chatrooms they were used to, but eventually came around and understood the rationale behind them. \n\nBut for every convert, there are a dozen new people showing up with the same confusion, the same resistance. If you succumb to frustration and stop offering that helping hand, you're hurting your cause: instead of finding those new allies, you strengthen the opposition. \n\nEventually, you'll lose by attrition alone, even if you do <i>everything else right</i>. I've seen this happen, over and over and over again. <a href=\"http://en.wikipedia.org/wiki/Triage\" rel=\"nofollow\">Triage</a> is a somewhat grim metaphor, but IMHO it's the only real solution: \n\n<blockquote>\nAt its most primitive, those responsible for the removal of the wounded from a battlefield or their care afterwards have divided victims into three categories:\n<ul><li>Those who are likely to live, regardless of what care they receive;</li>\n<li>Those who are likely to die, regardless of what care they receive;</li>\n<li>Those for whom immediate care might make a positive difference in outcome.</li></ul>\n</blockquote>\n\nThere are people who don't need your help. There are people who can't use your help. And there are people who both need, and have the ability to benefit from your assistance. Focusing your efforts sincerely and wholeheartedly on this last group is the only way to avoid bitter disappointment."}, {"author_name": "Tom", "gravatar_hash": "bb77eb91c2d8a076f7844800702e543e", "author_url": null, "date": "Jul 20, 2012", "message": "Just this week I asked a question about AJAX security best practices and immediately received a down vote with no explanation as to why it was down voted. I've used SO for 3 years and the community has recently become unbearable to deal with. \n\nAfter going back and forth with someone in the comments and getting no where. I deleted my question and went to google/duckduckgo for answers.\n\nIt's strange to see this community become so insular as you put it. Due to the wide range of topics that are covered here. I've seen it happen on small forums in less than a year, but they were very focused in their topics. \n\nI really hope you can figure out a solution Joel. Perhaps some method of estimating the difficulty of the question so that more senior users can hone in on the tougher questions.\n\nFor now, I will observe but I'm done participating. I have better things to do than deal with snobby people when I'm trying to solve a problem. The nerd ego is a dangerous thing. It's something I specifically look for when interviewing people and if they have it I give them the thumbs down."}, {"author_name": "Your own medicine", "gravatar_hash": "c8338a75914971cef5add9cc6cec0314", "author_url": null, "date": "Jul 20, 2012", "message": "@phwd\n\nYou see, when you commented, you failed to see the snark in your own words.  Yet, when I directed a similar comment back at you, my comment became an obvious snark, and likely, not because I stated so in the last paragraph.\n\nPart of the problem here is that you assume new users are not reading the FAQ, but that after a while in the community, they learn how to act around the older members.  Even though I read the FAQ before attempting to post my first question in SO (a simple question of 'here's my code, this is what it does, this is what I want it to do, I've tried reworking the thing for over a month-now over a year-,and what am I doing wrong?) and applied both the letter and spirit of the FAQ to my question, I was still told to read the FAQ before asking any questions.  That is no different than scolding a non-smoker for smoking and screaming about how he will give himself cancer.  Clearly, people are barking up the wrong tree.\n\nMind you, Eternal September is referring to new users who did not read the FAQ, who are not interested in knowing what is in the FAQ or how to apply it, as well as to the constant influx of new users.  Once a new user is around, they should eventually begin to understand the ever-changing unwritten rules as well as the written rules in the FAQ, however, that new user is not the only new user to have ever joined.  Who takes the role of 'the new guy' will always change as more new users join.\n\nPerhaps if the new user must read the FAQ and pass a test on the content of the FAQ before being allowed to register, with registration as a requirement to post anything at all in the site, that may help, if only a little.  The larger problem is that there are as many sets of zero-tolerance unwritten rules for the use of SO as there are people using SO, and most claim that these unwritten rules are clearly stated in the FAQ, proving that many of the old-timers have no idea what the FAQ actually says.\n\nTo be honest, nearly all questions as to whether a comment is snarky (the exception being when the person posting states the comment is snark) are a question of subjectivity.  This is much like the perception that my question posted twice and deleted twice so long ago was somehow something I should be able to answer myself by thinking about how to reword the question.  If it had been that simple, I would have answered my own question long ago, especially considering that I've scrubbed every blog and help guide for coding, including the original jQuery site and W3C and still have not found an answer to any question like mine.\n\nWhy does jQuery not work at all on any page I code, regardless of browser, browser version, or computer I use, whether I've saved it as a local file or uploaded it, while it appears to always work for everyone else?  Who knows, it's not covered anywhere and a year of rewrites hasn't shed any light on the subject.  Clearly, the answer is NOT obvious or simple to find."}, {"author_name": "ben", "gravatar_hash": "57161e73e4edde463aff308f47fe6c20", "author_url": null, "date": "Jul 20, 2012", "message": "Stop sending android tablets to mobile.  UA string is mobile, not android."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 20, 2012", "message": "Will be very interested to see the statistics and, perhaps more interestingly, the methodology, of the Mechanical Turk study. Good to hear you guys using more empirical studies into user experience."}, {"author_name": "phwd", "gravatar_hash": "d51a60c7bade46cd12ac19008ba3d8e7", "author_url": "http://stackoverflow.com/users/321505/phwd", "date": "Jul 20, 2012", "message": "@Your own medicine\n\n&gt; You see, when you commented, you failed to see the snark in your own words.\n\n&gt; To be honest, nearly all questions as to whether a comment is snarky (the exception being when the person posting states the comment is snark) are a question of subjectivity\n\nJust so that we are clear, you are the one that have taken into it as such, and I have failed not to thus our different subjective views on how my comment was shown. It's even apparent in your username \"Your own medicine\"\n\nIt seems to me that you are holding on to the bitter wounds from the actions taken on your question, which a good few users do. To show a helpful hand, you could send all the information to the address linked in my profile and I'll see if I can write it in a form that works for SO.\n\nYou do have points that make sense, it's just unlucky that they needed to be after the initial fire instead of before."}, {"author_name": "Jesse", "gravatar_hash": "7a385dc413797704b58b50eae6809072", "author_url": null, "date": "Jul 20, 2012", "message": "The thing about new users is they will never read.  They come to the site because they're in need, they're stuck, frustrated and found a place of hope to get what they need.  They don't come looking for a community to read the faq for and to contribute to, they come for help.\n\nThe escalating privileges provide a great means for new users to ease into the community.  They can't comment, they can't post files, they can only ask or answer.  It simplifies their experience and eases them into the community's expectations.\n\nI think where it breaks down is the need to try and educate the new users all at once.  Let them post a silly question, point them to a duplicate that exactly answers their question with some suggestions on how they could implement it.  They'll get the hint."}, {"author_name": "Your own medicine", "gravatar_hash": "c8338a75914971cef5add9cc6cec0314", "author_url": null, "date": "Jul 20, 2012", "message": "@phwd\n\n&gt;Just so that we are clear, you are the one that have taken into it as such, and I have failed not to thus our different subjective views on how my comment was shown...\n\n...which is exactly one of the reoccurring themes in SO, more so now than previously.  There are people who use this subjectivity to their advantage.  They post a comment they do not see as snarky, and when anyone notices how snarky it sounds to others and posts a reply, the first snark says it wasn't snarky at all and proceeds to find a way to delete both the person with the original question and the person who called out the snark, all while fussing about how the mods aren't doing enough to remove snark from SO.  That is not to say you personally are at fault for such behavior, merely that such rude and insular behavior has become ever more common.\n\n&gt;You do have points that make sense, it’s just unlucky that they needed to be after the initial fire instead of before.\n\nAgreed.  As far as a helping hand, that's all I've ever wanted (well, a helpful hand with an answer as to how I can fix my problem) and as soon as I have the time, I will follow your link.\n\nUnfortunately, it's time for me to get to work, so I will have to send it afterwards."}, {"author_name": "Cade Roux", "gravatar_hash": "d45ef03e9450599588bf733662f792e5", "author_url": "http://www.semicolon.net", "date": "Jul 20, 2012", "message": "Beginning users want to ask a question and get an answer.\n\nAdvanced users want good questions which haven't been asked before and by people who will listen to the answers and not be idiots about it.\n\nReconciling those is always going to be difficult.\n\nEvery helpdesk goes through this, which is why the helpdesk always has the high burnout rates.  The people who really can stay on the helpdesk for a long time are rare.  The challenge of programmers on the helpdesk only compounds the difficulty.\n\nGood Luck!"}, {"author_name": "Ned Batchelder", "gravatar_hash": "75e9a11371cbe1566607180863efdf4c", "author_url": "http://nedbatchelder.com", "date": "Jul 20, 2012", "message": "I have noticed question being surprisingly closed unilaterally by moderators.  I wish I had a link to one at hand to post here.\n\nCoincidentally, I was just struck by the problem of people posting bad answers to bad questions, and wrote about it: [Bad Answers on Stack Overflow](http://nedbatchelder.com/blog/201207/bad_answers_on_stack_overflow.html).  I hope my criticisms of the answers is not considered snark, or unnecessary scolding.  I am very concerned about people accepting wrong answers, and then having them enshrined forever."}, {"author_name": "Adam", "gravatar_hash": "fcbf8b1d0bffb1b55239250bd3e1f321", "author_url": "http://suspensao.blog.br/descrenca", "date": "Jul 20, 2012", "message": "Hi, Joel et al.\n\nSO is a gret community but the problem you are addressing was becoming really annoying. This is actually an old tale I have watched in a lot of earlier communities. The difference is that you all are addressing it. I am no less than amazed by your boldness.\n\nThank you all, SOers."}, {"author_name": "MSeven", "gravatar_hash": "4ac684a356d5d546bd4af16670ee4132", "author_url": null, "date": "Jul 20, 2012", "message": "As a \"newbie\" who had both browsed the site and searched it for help for a month or so, I was legitimately concerned I would be on the receiving end of said snark when I posted my first question two days ago. Was it too long? (I'd seen \"snark\" related to length before) Was it too vague? Was I asking for too much? Will it get DOWNVOTED?! Did it even make sense? I'm generally confident in my ability to explain technical problems, but the culture of SO, or at least my perceived version of it, still left me in doubt.\n\n(Of course, my question was answered quickly and politely, even given my unfamiliarity with what I was doing, and I was pleasantly surprised when it received an upvote.)"}, {"author_name": "Aleks G", "gravatar_hash": "9075315c5f4b734a8f2567be54a4cc45", "author_url": null, "date": "Jul 20, 2012", "message": "I am all for the \"civitility\" and being nice to newbies - and not just newbies.  I'm glad somebody shares my sentiments on this.  Actually, I have no problem with newbies asking questions that \"break the rules\".  I have no problem explaining in the comment what's missing in the question or what other information may be useful. Oh, and I VERY rarely if ever downvote a question, especially if the asker's rep is low.\n\nWhat really does annoy me is not \"plz give me teh codez\" type questions.  I have asked a fair share of my own questions.  However every time before posting the question, I would spend some time trying to find the answer.  In a way, posting a question is me raising my hands and giving up, as it means I can't solve the problem myself.  What really annoys me is when the question should be entered into a google search instead of SO - and the first link would give you the solution.  Moreover, in many cases I would actually do the corresponding search myself and post a comment with a link to a particular site or blog or article, stating \"Have a look at this blog/article/etc. for details on how to do this\".  And what do I get back?  A comment: \"Please write this code, I don't understand that article.\"  Well, if you cannot read a sample code and adapt it to your own project, then you shouldn't be called a programmer.\n\n(Me talking to myself: ok, enough, you vented it, now say something nice.)\n\n(Now me continuing the \"be nice\" subject) Despite all this, there are few of those posts.  On the whole, I do see general politeness and I do see people helping other people.\n\nOne thing I would recommend: don't hit the downvote button on a question too quickly.  If you can't understand what the OP is asking, just read it again.  If you think it's not clearly written, edit it - there are no penalties for this.\n\nOr how about removing the option to downvote a question if the user asking it has rep below a certain level (110 maybe?)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 20, 2012", "message": "To be 100% crystal clear:\n\nTotal civility is required on Stack Exchange, one hundred percent of the time. It is not optional. Ever. EVER!\n\nIf you are rude to other users, the offending content will be removed. Do it enough and YOU will be removed. With extreme prejudice. We've done it before and we will do it again.\n\nAre we clear on that? Yes?\n\nNow that we have that out of the way, I think what some people may be seeing as \"rude\" is that \"you guys have rules I don't understand, and I don't agree with those rules.\" The Internet is the wild west most of the time, and you can almost do anything you want on most websites on the Internet. Particularly forums. So to encounter a site that has rules, at all, and enforces those rules, at all, is enough to be disconcerting to a certain percentage of the audience, enough to cause them to complain about \"rudeness\".\n\nBut please don't conflate \"rudeness\" with \"you guys have rules I don't agree with\".\n\nI hear the guys at Harvard are REALLY rude, because they rejected my application. Meanies!"}, {"author_name": "skinnytod", "gravatar_hash": "e2aa4cd8ca03c4b2f71c6443f6e437b1", "author_url": null, "date": "Jul 20, 2012", "message": "@JeffAtwood asks (of @jalf) for examples of insularity and snark from power users on SO? Here's some from you @JeffAtwood in the comments to a question I posted on Meta:  http://meta.stackoverflow.com/a/136136/182042\n\n---------------------------------------\ner, are you high? Try asking a question and see how many \"hey, how about this!\" prompts you get as you compose the question. Really go through the motions, write an actual question. Note that new users (by rep) also get an unskippable EULA page with a giant search box directly in the middle of it. See for yourself: stackoverflow.com/questions/how-to-ask – Jeff Atwood♦ Jun 15 at 4:50\n\t \n\t\n@jeff atwood: No, I am not high. Are you jaded? Smug? Too used to SO to even see it? Seems so. The prompts that are presented can be mere word hits if one doesn't include a tag as a filter. They are not ranked by number of votes, by number of answers or by date (that's a separate tab). There is no UI for advanced search - just a separate page with suggestions. If you want users to 'do the right thing' you make it easy. But whatever. – skinnyTOD Jun 15 at 5:05 \n  \t\n \t\n@skinny I don't think you actually know how the site works. 1) Try entering \"java generics\" in the search and see what happens. 2) Try asking a question as a new user (open an anonymous browser page) and see what happens. – Jeff Atwood♦ Jun 15 at 5:09\n\t\n@jeff atwood: So I don't know hw the site works? Sorry but that is blaming the user, too often the cause of poor UI design. fwiw, I have been using the site for over a year. – skinnyTOD Jun 15 at 5:23 \n  \t\n \n@skinny can you answer the two questions I asked in the above comment, please? I numbered them so it's clear which is which. Thanks. – Jeff Atwood♦ Jun 15 at 5:27\n\t\t\n\t\nand just so that we're clear, searching for \"java generics\" (without the quotes) is in fact a tag search equivalent to entering \"[java] generics\". This is completely automatic and true for the top 60 tags, as documented on the stackoverflow.com/search page. That's why your statement that \"users need to enter [tag]\" is totally incorrect, at least for the 60 most common tags. – Jeff Atwood♦ Jun 15 at 5:31\n \t \n\t\nI did do that prior to my last comment. The results were exactly the same and no, I did not see your point and it was not obvious that a tag search was automatic. I see that now. My point however remains: search here is weak in terms of UI/usability (as mentioned, no sort, no filter). I don't get why that should be. Example: do a search for \"UIImage crop\" (no quotes). Loads of hits in no apparent order. Click on the 'votes' tab - is that votes of my search result? Appears not. Why not? Click on 'newest' or 'active' and it appears to be hits only for 'UIImage'. Confusing/ not helpful. – skinnyTOD Jun 15 at 6:13 \n \n\t\n@Jeff I find SO's search largely helpful. SkinnyTOD has a point in one aspect though - the advanced search is incredibly hard and counter-intuitive to discover. Have you considered adding a simple link next to the box? (I know you have, but I can't find the discussion in question) – Pekka Jun 15 at 14:43"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jul 20, 2012", "message": "<i>Note to self: modify Benjol's pro-forma comments script to automatically prefix comments with \"Are you high?\"</i>\n\nBut yeah, @skinnyTOD - this is a <i>great</i> example of how this isn't a problem limited to certain users. Sooner or later, everyone writes something that's less-than-constructive, myself most certainly included. \n\nAnd learning to recognize the problem in <i>your own</i> writing is a hell of a lot harder than picking at someone else's. "}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 20, 2012", "message": "1) That's not particularly snarky. (OK maybe \"are you high?\" was, a little. That's fair.)\n\n2) Apples to Oranges. All the above examples are from <b>Meta</b>. Meta is a behind-the-curtain place intended for governmental discussion, often spirited discussion. That's how government works.\n\nDifferent sites, for different purposes, resulting in different kinds of discussions."}, {"author_name": "skinnytod", "gravatar_hash": "e2aa4cd8ca03c4b2f71c6443f6e437b1", "author_url": null, "date": "Jul 20, 2012", "message": "@JeffAtwood - Well, you asked for an example of insularity on SO/SE and I gave you one. And here you have just given another.\n\nIn the example, I posted what I hoped was a constructive comment about how search is implemented on SO. Your response was a small jibe and the assertion that I didn't know how SO works, completely discounting the 'user feedback' aspect of what I was saying. \n\nThere is a reason why programmers can not adequately do usability testing on the software they write: **they know how it works**. Users are not necessarily stupid (or \"high\") if they don't 'get it.' It might just be that a certain insularity has also bleed into the user interface.\n\nAt any rate, I'm glad that there is concern at SE over the continuing health of the community."}, {"author_name": "Joe Zoller", "gravatar_hash": "c245af4580409c11120f4ece20b7d4b9", "author_url": null, "date": "Jul 20, 2012", "message": "Sometime, oh, about a year ago, I stopped thinking of SO as \"a community of knowledgeable folks\" and started thinking about it as \"a really big hash table\".\n\nBoth are useful, but I'd rather be a part of the former.  Glad to see you making an attempt."}, {"author_name": "Brandon Bertelsen", "gravatar_hash": "a1c36731ff9f4b59301769f9ad9c44d7", "author_url": "http://www.bertelsen.ca", "date": "Jul 20, 2012", "message": "Brilliant post that will be bookmarked and linked everytime I see a snarky comment or answer. Bravo, Joel. \n\n@Skinnytod, to your last comment it's called \"curse of the eye\". One can't see past what you've created. Happens to writers, researchers, programmers and anyone involved in creating something that others use."}, {"author_name": "scunliffe", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": "http://www.SongName.Info/", "date": "Jul 20, 2012", "message": "This post is good and I certainly like the intentions.\n\nI'm an \"oldie\" now I suppose and although I certainly try not to be snarky a little reminder once in a while is helpful.\n\nIf I'm ever being snarky on Stack(overflow/exchange) I'd welcome a gentle tap on the shoulder reminder that I'm out of line.\n\nSummer of love it is!"}, {"author_name": "David Harkness", "gravatar_hash": "9462edf139e6a4a74a19dcd536dcb26d", "author_url": null, "date": "Jul 20, 2012", "message": "The hardest part in trying to help new users is separating each new user from the previous ones. When you address the same behavior again and again, it's difficult to avoid thinking, \"When is this guy gonna catch on?\"\n\nOne thing that might help is to make it easier to leave feedback on a question/answer that doesn't necessarily require closing or downvoting it. I'm thinking of something similar to how you rate videos on TED: pick from several descriptions such as \"Post the input/output\" or \"Which line is line X that you refer to?\".\n\nYou can type those canned responses into comments, but after doing so many times you start to get annoyed and try to be creative with your comments which is a bad combination. :)"}, {"author_name": "David Harkness", "gravatar_hash": "9462edf139e6a4a74a19dcd536dcb26d", "author_url": null, "date": "Jul 20, 2012", "message": "I forgot the second part of that suggestion for leaving feedback. Instead of the user seeing that snarky short description which would normally make a poor comment, they would be shown a civil explanation with reasons to back it up.\n\n\"When you post the code you've tried yourself along with the input and output (both expected and actual), not only do you make it easier for others to provide an answer, you also demonstrate that you've done some due diligence on your part. Both of these will increase the likelihood that you'll get an informative and helpful answer.\"\n\nEach feedback item would provide a mini-FAQ, and they wouldn't be forced to wade through a ton of stuff they might already do. Only when they falter will they be taught specific, correct behavior."}, {"author_name": "chris", "gravatar_hash": "739b569caed61f131ea4c2ad55482041", "author_url": null, "date": "Jul 20, 2012", "message": "snark is ok in some communities, but not in others. that sounds like a problem right there"}, {"author_name": "Jeremy", "gravatar_hash": "e0f502a6b3a7c216b85ed88d3d0b2799", "author_url": "http://AppointmentsBook.com", "date": "Jul 20, 2012", "message": "I'm so glad you wrote this article Joel. I am going to reference this when people are being unfriendly. Share the love!"}, {"author_name": "Kyle Sevenoaks", "gravatar_hash": "423fcc51d53e79d6d8af9466ea7adc39", "author_url": "http://www.dspore.com", "date": "Jul 20, 2012", "message": "\"...we’ve started actually measuring friendliness in comments, automatically...\"\n\nSounds like something Aperture Science would do.. :D"}, {"author_name": "DavidCary", "gravatar_hash": "2f3aa1c23aa5ee5a5b031a15b1710eac", "author_url": "http://david.carybros.com/", "date": "Jul 21, 2012", "message": "We all know \"There are many other places on the Internet to do that stuff\" that is off-topic here.\nAnd yet people continue to post such off-topic \"questions\".\n\nIs there no alternative between (a), do nothing and allow stackoverflow to be clogged with off-topic stuff, or (b), do something about off-topic stuff that to a newbie sounds a lot like the rudeness of \"Shut up!\" if not censorship?\n\nI speculate that perhaps those posters don't actually know about those \"other places\".\nTherefore, I'd like to propose an alternative (c):\nWhenever someone says \"that's off-topic\", someone (perhaps that same person) should should also point out some other site where that topic is ... at least somewhat less off-topic.\nhttp://www.communitywiki.org/en/OnAndOffTopic\n\nImagine someone has a practical programming problem that, because they didn't know any better, they post to one of those other sites.\nRather than being told \"that's off-topic here\" (i.e., \"shut up\"), period, wouldn't we rather that person be informed \"that's off-topic here, but it would make a great post over at that stack overflow thing\"?"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jul 21, 2012", "message": "Yes, I tend to think the best way to comment on bad questions is the way a well-trained police officer deals with people who are being difficult - curt, formal, but always polite, even when insulted or threatened.\n\nAlso, we all know that you can't transport everyday speaking to the Internet. What will sound perfectly normal and nice in a real world conversation may sound sarcastic or rude underneath a SO question. \n\nHowever, working on a friendly comment so you can be sure it's read the way it was intended (eg. turning \"Have you read the documentation?\"  into something like \"I think this behaviour is mentioned in the manual. Did the workaround presented there not work for you?\") is <i>work</i>, and it becomes old fast if you have to repeat it a hundred times. Also, not every SO user can be expected to be good at this in the first place. \n\nI still think some automation in the form of good comment templates is needed here, and there can be no summer of Love without it."}, {"author_name": "Steven Jeuris", "gravatar_hash": "2648f806f3af808a2ed537c8e745558e", "author_url": "http://whathecode.wordpress.com/", "date": "Jul 21, 2012", "message": "I'm really glad to read this post, thank you Joel!\n\nIt's this kind of small mentality change I have been advocating for a while now. There is no need to change our rules, but the way we communicate them can definitely happen in a nicer way.\n\n@Pekka, we do need good templates, that's why I previously suggested a friendlier close reason template, which only got implemented partially.\n\nhttp://meta.stackoverflow.com/questions/125255/improve-not-a-real-question-close-reason-message\n\nThe way some people respond on meta to such suggestions is a clear indication of the problem, at least the way I perceive it."}, {"author_name": "Sab", "gravatar_hash": "5eda7113498d159450ff8d157485c580", "author_url": null, "date": "Jul 21, 2012", "message": "This is a great initiative.\n\nI am someone who has been somewhat frequent on SO in the recent years and on a few different occasions just stopped visiting and contributing because of the very reason specified above. \n\nOn a personal level I don't totally agree with the downvote. I have hardly ever used the downvote during my time here. If you don't agree with an answer, just ignore it or leave a comment on why its not correct. \n\nA community where people come purely out of love of knowledge sharing, should remain focused on that. The negativity of the downvotes and insults are just a huge turn-off. The newbies need to feel welcome into the community and understand that SO (and other sites) are not only a tool to help others but also rectify or improve your own. Recently I have started to notice fewer answers on questions as compared to how it used to be, I think the main reason is users are scared of contributing and being penalized for not living up to the expectations of the 'elders'."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jul 21, 2012", "message": "@Sab:\n<a href=\"http://blog.stackoverflow.com/2009/03/the-value-of-downvoting-or-how-hacker-news-gets-it-wrong/\" rel=\"nofollow\">The trick here is that downvotes are mostly informational.</a>\n\nIMHO, down-votes are <i>critical</i> in keeping back the ocean of negativity. See something horribly, tragically wrong? Down-vote it! Are you able to point out the problem in a constructive, polite fashion? Comment! \n\nOh... You were about to write, \"Are you high?\" <i>weren't you...</i> Well, best just stick with the down-vote then. \n\nFolks take this stuff seriously, and rightly so - for a lot of us, it concerns our livelihoods, and seeing something posted that's caused us pain in the past cuts right past that filter where we normally perform the mental translation from \"Fool! You've doomed us all!\" to \"Pardon me good sir, I do believe you might be in error...\"\n\nVoting is a way to remain relatively dispassionate about your evaluation of a post, even when you can't do so in your writing."}, {"author_name": "Sab", "gravatar_hash": "5eda7113498d159450ff8d157485c580", "author_url": null, "date": "Jul 21, 2012", "message": "@Shog9 thank you for your reply and I agree on some level the need for this mechanism, I am just not sure downvotes are the way to go. \n\n\"If a post has zero upvotes, does that mean it’s bad? incorrect? uninteresting? mediocre?\"\n\nIMO the downvote doesn't really tell me the answer to that as well. When I am browsing through the questions(or answers), most times I would just ignore the ones with downvotes. A zero vote post kinda forces me to atleast give it a brief read. Your stats for upvotes vs downvotes look great however the number I would be interested in seeing is the co-relation between downvotes and contribution. Your numbers doesn't necessarily mean that you are right in your assumption that downvotes are serving the intended informational purpose. Posts with serious flaws can be flagged, which I find a better alternative to downvote. Copy issues can be fixed with editing, which is amazingly useful as well.\n\nIn the spirit of conveying information based on downvotes, wont it be logical then to remove the downvotes if someone fixes their question/answer? I know you can change your vote once an edit has been made but how many people actually do that? The negativity sticks with them for the rest of their community life.\n\nI just find the notion hard to digest where somebody having a bad day for xyz reason has the power to negatively impact your day. You never know how far the impact of that downvote goes? Can't we see newbies as babies/kids (and they kinda are), being a father of 2 myself, I see negative feedback having more impact on kids than positive. Would you slap your kid on the wrist or insult them every time he/she messed something up? Most times you just ignore it by giving them the benefit of their age, other times you sit them down on your lap and 'explain' to them why what they did was wrong. \n\nAgain I understand the reasoning however I just think we have enough negativity in our society, the last thing we need is a learning place like SO to judge us for our language or our lack of ability to convey the problem.\n\nI understand that in the effort to promote positive behavior you guys removed the WSOIN post. Although it is slightly hard to digest as most of us here thought of the site as community-driven. Again I understand the underlying reasoning. In the same spirit of positiveness no-downvoting might be worth a shot? It would be unfair to assume that this deletion would have a positive impact and no-downvoting wont."}, {"author_name": "skinnytod", "gravatar_hash": "e2aa4cd8ca03c4b2f71c6443f6e437b1", "author_url": null, "date": "Jul 21, 2012", "message": "Down-votes are ineffective in encouraging better behavior and/or reducing comment snark because they are opaque. Flags are ineffective because they are not visible to the user or the community (at least they are not to me - with @ 1500 rep on SO).\n\nI don't much like down-voting a question because of the ambiguous nature of what it implies. I don't <i>usually</i> mean \"this is an idiotic question which has no place here\" but that is at least one way it comes across to both the person posting the question and to the community.\n\nWhen I down-vote a question I am prompted to add a comment explaining the down-vote. I think we all agree that \"whathaveyoutried.com\" type comments are not particularly community friendly or informative to the person posting the question. I could type in a statement explaining a down-vote but for many questions that would tend to be boiler-plate stuff (more civil 'whathaveyoutried', 'post some code', etc.). This becomes very tedious to do.\n\nIf we were given the option to add a specific down-vote badge or flag, <b>which is visible to the community</b> AND which sends a nice explanatory FAQ-type notification to the person posting the question, I think it would steer new users to follow SE guidelines through providing meaningful, snark-free feedback (and in the process help themselves through improving the likelihood of getting a good answer).\n\nAdditionally, if the person down-voting received a notification when the OP edited or updated the question, there would be an option to remove the down-vote. This could eliminate the 'whathaveyoutried' comment-litter which hangs around on questions which have been improved."}, {"author_name": "bimargulies", "gravatar_hash": "e6eeaf8698180e971e169a925d8e0f4f", "author_url": null, "date": "Jul 21, 2012", "message": "Let's see. Floating up there in the sea was someone who was hurt, deeply hurt, to get *even one downvote*. Welcome to crowd-sourcing. With this many people participating, downvotes you will get. And upvotes. And side votes. It's pointless to claim that this is diagnostic of any particular state of community health.\n\nSO is aimed, as I see it, at a very carefully drawn target: sociable without being \"social\". Professional without being 'antisocial.' So, no, no salutations and sign offs on the one hand, and no 'are you high' / 'and I want a pony' comments on the other hand.\n\nA concrete suggestion: let comments be 'resolvable', like google doc comments. The legitimate purpose of comments is to ask for clarifications or corrections, not to provide a forum for debate, let alone a way to throw tomatoes. Why not make it clearer that each comment is an ephemeral 'point of order' that *goes away* once resolved. And goes away anyway in a month if not?"}, {"author_name": "Standback", "gravatar_hash": "77302a6c0989999e15aebc7968310acb", "author_url": "http://writers.stackexchange.com/users/1046/standback", "date": "Jul 21, 2012", "message": "I'm really glad to see SE open to self-reflection and positive initiatives like this.\n\nCan I humbly-yet-emphatically suggest that now might be a good time to take another look at <a href=\"http://meta.stackoverflow.com/questions/70061/i-propose-changing-the-term-closed-out-for-something-else\" rel=\"nofollow\">concerns that the \"close\" phrasing are discouraging</a>?"}, {"author_name": "Mike Deitrick", "gravatar_hash": "f03ea1bb0ada4dc59beb0cf4e621b460", "author_url": "http://stackexchange.com/users/1132728/mike-dtrick", "date": "Jul 21, 2012", "message": "I am very happy to see that Stack Exchange is really pushing to make changes regarding user behavior.  If it's any consolation, I almost left the site because of users bickering.  It's just not very becoming."}, {"author_name": "Marc Noon", "gravatar_hash": "a82f9eb7c99cebb5100ac790545df05e", "author_url": "http://www.simtest.net", "date": "Jul 21, 2012", "message": "I'm going to ask a bunch of stupid question now.... haaaa"}, {"author_name": "Andy Valdez", "gravatar_hash": "d7cfa4fe2375b781d476643cd119d679", "author_url": null, "date": "Jul 21, 2012", "message": "Time you took on this is much appreciated. I am glad this is being addressed because sometimes I have to wonder. I was lucky enough to continue using it even after I made those \"newbie\" mistakes and got scolded for it by these bad apples."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 21, 2012", "message": "<blockquote>\nhttp://meta.stackoverflow.com/questions/125255/improve-not-a-real-question-close-reason-message\n\nThe way some people respond on meta to such suggestions is a clear indication of the problem, at least the way I perceive it.\n</blockquote>\n\nThe outcome was that the NARQ (Not a Real Question) explanatory text was updated to clarify. Seems like a fine outcome to me. Also, remember that meta is the governmental site intended for behind the curtain discussion. \"The way some people responded on meta\" describes an entirely different situation than the site proper, where we really don't even <i>want</i> discussion, or at least as little as we can get away with while providing core Q&amp;A.\n\nTL;DR: <b>meta is not the main site</b>. While civility is (of course!) still required on meta at all times under penalty of death, naturally, pointing out that \"the way some people respond on meta\" isn't particularly relevant to the main sites at all. Remember meta is for governmental discussion, whereas the main sites <i>aren't even supposed to have discussions at all!</i>\n\n<blockquote>\nWhy not make it clearer that each comment is an ephemeral ‘point of order’ that *goes away* once resolved. And goes away anyway in a month if not?\n</blockquote>\n\nIn spirit you are correct, and we point out all the time that comments are very intentionally third class citizens in the Stack Exchange world. However, in practice important and necessary clarifications do sometimes need to live on permanently in the comments. So having all comments \"fade away\" after a month would be harmful.\n\nAnyway, we do this already by suppressing the display of any more than 5 comments behind a \"click to see more\" and prioritizing comments with upvotes in that 5 comment list. (Note that on meta, we allow many more comments before suppression, which brings me to the point I already made above: meta ain't main, and expecting them to be is already a misconception.)\n\n<blockquote>\nCan I humbly-yet-emphatically suggest that now might be a good time to take another look at concerns that the “close” phrasing are discouraging?\n</blockquote>\n\nYou can, but the explanation of close is what needed updating and it has been significantly revised since then. I'll provide an answer to that Q which explains this better.\n\nI dunno, I read a lot of this feedback and I get a real sense of \"You're telling people they are not good enough to get into Harvard {or, more realistically, Insert Name of Local Community College here}, and therefore your system is mean.\" Listen: Harvard is not the only game in town. Nor is Harvard mean for telling people that, hey, you're a fine student, but maybe not such a great fit for Harvard. <b>Harvard has the rules it has, because that's what makes it Harvard, just like Stack Exchange has the rules it has about questions and answers because that's what makes us Stack Exchange and not, y'know ... Yahoo Answers or Reddit. </b>\n\nIf you want to play a different game on the Internet that has different rules, go for it. But don't sit down to the table and declare that our game is mean because you disagree with the rules. When this happens, it means <i>you're playing the wrong game</i>.\n\nAnd, for the record, none of what I just said has anything to do with civility or lack thereof, but expectations."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 22, 2012", "message": "To prove my point about the way users commonly conflate \"rudeness\" with \"I don't like your rules\".\n\nThis gaming meta question is about a truly 100% unambiguously rude comment on a question. The fact that the rude comment was upvoted to 3 is kind of shameful, honestly. Kudos to the question owner for calling it out on meta; he's right.\n\nhttp://meta.gaming.stackexchange.com/questions/5040/are-rude-comments-on-questions-turning-away-new-users\n\nBut in it, the author says \"I wish this were the first case were a user complained about our site in such a manner, but it's not.\" Wherein he links to this other meta.gaming post:\n\nhttp://meta.gaming.stackexchange.com/questions/4318/do-esoteric-rules-hurt-the-site\n\nBut this question <b>is not about civility <i>at all!</i></b> It's about \"You guys rejected my application to attend Harvard, and that's mean\" with a side dish of \"I disagree with your rules, man\".\n\nNot the same thing. Not related! Not even a little!\n\nIf you want to have a discussion about our rules and how they work, you're welcome to (fair warning: we've probably heard what you're about to say before. Probably thousands of times. So please search first). But just don't conflate \"civility\" with \"I don't like your rules, and you are too strict\" because this, too, happens <i>all the time</i>."}, {"author_name": "noko", "gravatar_hash": "96d38a55aa5a723af46b68dfcea08631", "author_url": null, "date": "Jul 22, 2012", "message": "It's funny, 4chan users do all they can to keep new*ags away, yet they keep coming and coming."}, {"author_name": "Baboon", "gravatar_hash": "4d1795fc22c16e533fd1d11fae39fef8", "author_url": "http://baboon.eu", "date": "Jul 22, 2012", "message": "To me, the biggest issue about closing/deleting is the static **5** people vote to close.\n\nIt doesn't matter if the question had 2k upvotes under 24h or if it's been seen 10 times only after a week. 5 people, arbitrarly or not, decide to close it and BAM! it's gone.\n\nThere should be a threshold beyond which the number of people required to close would be higher.\n\nBecause say a question has a lot of attention, but it's not a perfect match for the SO standards. Over the 10k+ people who are going to read the question a lot can vote to close it, and if only 5 feel like it, it will close.\nA battle then ensues between reopens and recloses, which takes us back to kindergarten..."}, {"author_name": "Ciaran G", "gravatar_hash": "9a0520e69f8ec9f642cca279a017fd51", "author_url": null, "date": "Jul 22, 2012", "message": "As a relatively new user and one who is a student with limited experience, I have found StackOverflow extremely useful, but I know exactly what you are talking about in terms of it being insular and not always friendly to those who are new. I've had legitimate questions closed by the community because they deemed my question the same as another one. First of all, my question only bared a small resemblance to the other question, and in fact the other question didn't even have a solution with it. The community didn't bother to properly read what I was asking or look to see whether my issue hadn't actually been solved - instead they were hungry for internet points that they rushed in and deleted my question. That was probably one of the first few questions I asked too."}, {"author_name": "Anon", "gravatar_hash": "01822efaf66e4b81d6f947cba7e0613a", "author_url": null, "date": "Jul 22, 2012", "message": "Jeff,\n\n&gt;&gt;And, for the record, none of what I just said has anything to do\n&gt;&gt;with civility or lack thereof\n\nWhen the godfather of a site shoots down any ideas anyone suggests with long angry responses, I think it's safe to say that the whole conversation feels less civil; maybe not to you, but to the rest of us.\n\nA truly civil discussion allows different parties to disagree and still make progress on an issue.  Your comments in this thread have done NOTHING to help with the issue Joel wrote about, and if anything you've dampened the conversation by aggressively responding to anyone whose ideas in any way relate to any idea you've ever disliked on SO.\n\nMaybe you need to step away for awhile, you're strangling the baby with your love."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jul 22, 2012", "message": "@Anon I think Jeff is being very civil, not angry at all, and he's contributing to the discussion with important points. Have you read them?"}, {"author_name": "Russ C.", "gravatar_hash": "2eb68f5f072b1591728e64cfb0effae9", "author_url": null, "date": "Jul 22, 2012", "message": "I certainly welcome this initiative; anyone who cares to look will see that I've called people out for being nasty about things.\n\nIt's not white-knighting by any means; its just an acknowledgement that communities do get cloistered and more importantly to me; we all appreciate programming (on SO) from a different perspective.\n\nSometimes I see answers that could only be paraphrased as 'you must be stupid if you don't know this' and that's the worst thing for me.\n\nAs a lot of successful coders are, I'm self taught and admittedly I know little of certain parts of the programming ecosphere if you will; I know very very little of things like red/black trees and I tend to get lost when Big-O notation is used. That doesn't make me a weak or bad programmer by any means; we could talk for hours about nested sets in SQL and how to optimize the inner loop of a costly method.\nY'see, when you're self taught - you often know the subject but don't know the Grammar if you see what I mean.\n\nIt's something we're guilty of at Stack Overflow and it comes off as elitist and jerkish.\n\nAmen for the summer of love!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 22, 2012", "message": "<blockquote>When the godfather of a site shoots down any ideas anyone suggests with long angry responses, I think it’s safe to say that the whole conversation feels less civil; maybe not to you, but to the rest of us.</blockquote>\nWhere are you seeing \"long angry responses?\" Do I make mistakes? Well, last time I checked I am still human, so sure I do. I'll agree that \"Are you high?\" -- as a comment on meta, remember, the behind-the-curtain site where we're supposed to have discussions -- was over the line, and I edited it out as soon as it was pointed out here.\n\nFeel free to read through my recent meta comments:\n\nhttp://meta.stackoverflow.com/users/1/jeff-atwood?tab=activity&amp;sort=comments\n\nAnd my recent meta posts (mostly answers):\n\nhttp://meta.stackoverflow.com/users/1/jeff-atwood?tab=activity&amp;sort=posts\n\nI'm curious to hear your basis for this claim. I think my record of participation speaks for itself. I try my damndest to be as civil as I can in all my posts. That is not to say I always succeed, but ... well, just click the above links and read for yourself. You tell me.\n\nDo I have <i>strong feelings</i> about the way things need to be in the world? Sure I do. That's why I created Stack Overflow. That's why we have many of the rules we have. It's also why the overwhelming, vast majority of interactions on the site are perfectly civil and reasonable. It is a system predicated on no-nonsense information, presented in a clear, concise, and <i>always</i> civil manner.\n\n(The underlying elephant in the room is that for a significant percentage of the world, the presence of rules on the internet, rules that are actually enforced, will be viewed as \"rude\" and \"mean\" irrespective of any actual measurable rudeness. Because, y'know, Harvard wouldn't let me attend their college even though I'm a really good student. Those guys are jerks!)\n\nIf I didn't have strong feelings about the way things need to be in the world, we wouldn't need to have this discussion because Stack Overflow and Stack Exchange wouldn't exist."}, {"author_name": "Federico", "gravatar_hash": "303b0a741a14439b53c23ce4c9e28a12", "author_url": "http://fedmich.com/works/stackoverflow/", "date": "Jul 22, 2012", "message": "Good to know this is being address. In the past weeks, I've noticed in quite a number of times that some are being \"not nice\" to the newbies, even though they did asked politely.\n\nAnyways,\nAdvance Happy Birthday StackOverflow and Thank you so much to all contributors to the site :)\n\nCheers!"}, {"author_name": "Keithsoulasa", "gravatar_hash": "6e45187e6d795365957611ee2a8600ab", "author_url": null, "date": "Jul 22, 2012", "message": "In defense of people who are a bit mean to noobs like myself , much of this stuff is really complex , taking years to fully master . Although I admit this is much more mature then a Game Dev forum , where you get questions like \" Hi , I want to make a MMO , how do I do this \" . \n\nAlot this depends on your person values , some people will tell you that you should always be considerate , others tend to be blunt and honest ."}, {"author_name": "Will", "gravatar_hash": "c0dd04beb96268a1d27e0e86366e5dba", "author_url": null, "date": "Jul 22, 2012", "message": "i enjoy participating a lot more at the unix and linux stack exchange than on stack overflow -  that audience is a lot friendlier to people who are earnestly trying to learn."}, {"author_name": "Avi", "gravatar_hash": "2ed2d9abe0bc471403e64c14426f388d", "author_url": null, "date": "Jul 22, 2012", "message": "I started to be active with answering questions and I am quite enjoying the reputation points hunt stage.\nWhile doing so I found out that I am worried of downgrades.\nI would be very happy if it wasn't so."}, {"author_name": "scorpiodawg", "gravatar_hash": "088e42f9cf70f976371be11fd2c8c68e", "author_url": null, "date": "Jul 22, 2012", "message": "I think this is awesome that the creator(s) are addressing this issue -- so I'd ask everyone to take a step back and take perspective. I mean, imagine a heated discussion on the effects of the iPhone on society with Jobs (RIP) himself; this is rare and must be appreciated.\n\nI'm an occasional user of SO and find it immensely useful. I think moderators that take themselves too seriously may push newcomers away from this site, which is the exact opposite of what SO strives for. My take is:\n\n1) let everyone ask any question they want. A question that goes unasked is worse than one that goes unanswered.\n\n2) Disallow arbitrary deletion of questions by *anyone* unless they are patently *offensive* (eg: \"Why do  programmers write crappy code?\"). If a question is poorly researched or obviously homework bait, DON'T ANSWER IT. That way it stays at zero votes, or at the very least, unanswered.\n\n3) Exact duplicate questions can be auto-closed after being marked as duplicates and linked off of the question they are a duplicate of (to preserve that the question was asked and any comments).\n\n4) Questions that become discussions (\"What framework should I use to build my web site in Python?\") should NOT be automatically closed or deleted. If there is a spirited discussion with lots of opinion, this is still VALUABLE. Instead, these can be moved over to an overflow section, perhaps (Stack Overflow Overflow?) so that it is marginalized, but not stifled.\n\n5) Keep everything TRANSPARENT. All upvotes, downvotes, comments, deletions, etc. should be recorded in history. There is, in my mind, nothing worse and discouraging that someone's innocent questions/thoughts disappearing arbitrarily. \n\nI will repeat the primary thesis of my suggestion again: IGNORE bad questions, IGNORE suspicious homework assistance requests, IGNORE snarky comments, IGNORE self-important behavior, stick to and SUPPORT stuff that ADDS VALUE. It's like training toddlers to become good functioning citizens (ignored bad behavior has less likelihood of returning); it should work for SO.\n\nMy 2 cents."}, {"author_name": "丁小贝", "gravatar_hash": "7103b2972d6ebd7702e4d3a3999eb8a7", "author_url": "http://dingxiaobei.com/", "date": "Jul 23, 2012", "message": "Constant today is tomorrow's variable"}, {"author_name": "Rig Perez", "gravatar_hash": "e3c2fe034437705ab357219111915f3c", "author_url": null, "date": "Jul 23, 2012", "message": "@Kevin DreamInCode is the worst for cult culture. I don't see it here. I honestly don't see anything insular here. I more often than not see members with history that have pinpoint accuracy on pointing out answers to questions that have been answered ad nauseum or are entirely unrelated to a community. \n\nThat being said some of the \"admins\" are super trigger happy. That is a small selection of the community. They are the ones that need to be addressed. \"Close happy\" is an understatement for a select individuals (especially on programmers)."}, {"author_name": "Benjol", "gravatar_hash": "501465a53bf1042de206d7d79cc68942", "author_url": null, "date": "Jul 23, 2012", "message": "This is **not** a new problem:\n<blockquote>\nThere is a distinct decline in the level of civility here. Some of this is due to new users coming in and posting spam and other nonsense, but the offtopic and downvote buttons are doing a pretty good job of keeping this under control.\n\nUnfortunately, a lot of this is coming from more experienced users, and the site's built-in moderation system is not (and probably cannot) handle this very well. Folks are rushing to pound new users down with \"this belongs on meta!\", \"this is off topic\", \"this is a duplicate!\" and \"read the FAQ!\". All this, of course, is accompanied by a flurry of downvotes. This is not very welcoming to new users who don't know about meta, or what is offtopic, or the FAQ.\n\nNow I am not proposing that we just allow offtopic, meta, or duplicate questions. However, I think we could be gentler in the way we express these sorts of things. Explain what meta and the FAQ are and provide useful links. Just using please and thank-you when asking folks to read the FAQ or post something on meta would be an improvement. I also think we could rein in the downvoting a bit. Not that we shouldn't vote stuff down, but unless a new user's post is clearly spam, voting it down to -1 or -2 should be sufficient to send a message without piling on.\n\nI like Stack Overflow and I want it to become a resource for everyone, not just an elitist site for people who were in the private beta.\n</blockquote>\n\n<a href=\"http://meta.stackoverflow.com/q/9953/130064\" rel=\"nofollow\">Could we please be a bit nicer to new users?</a>"}, {"author_name": "Naveen", "gravatar_hash": "167f4b56e9ba1c1660e5980a84e96bbe", "author_url": "http://stackoverflow.com/users/17447/naveen", "date": "Jul 23, 2012", "message": "I just got kicked in beautifully in this summer of love :) What a day?\nhttp://stackoverflow.com/questions/11612189/close-all-the-items-in-accordion-menu"}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 23, 2012", "message": "Uh, this post is about rude comments, guys. Those of you wanting a complete removal of Downvoting, closing questions or deletions are going to be very disappointed."}, {"author_name": "Matthew Read", "gravatar_hash": "9f45abdea17c709041812609c7fdfb69", "author_url": "http://meta.stackoverflow.com/users/154510/matthew-read", "date": "Jul 23, 2012", "message": "I'm going to disagree with Jeff here.  MSO isn't kept civil (\"under penality of death\") *at all*.  I posted 3 feature requests about how to address that, which were heavily downvoted due to not being very good suggestions, but the actual response in comments was quite disheartening.  3 variations:\n\n- There's no problem\n- It's OK, it's Meta\n- Prove it or GTFO (as if I can prove something is subjectively rude, and as if I have the time to qualitatively rank a statistically meaningful number of comments)\n\nMostly from \"insiders\", as some commenters have put it.\n\nIf you want to eliminate rudeness, you have to stop justifying and allowing \"special cases\".  Disallow and work to eliminate rudeness across the entire network.  No solution will be perfect but as soon as you start saying \"it's OK in this one case\" you've lost."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jul 23, 2012", "message": "Increasingly, I am coming to the conclusion that the only good comment is no comment at all.  Vote to close, vote to delete, downvote, but say nothing at all in comments; let the system speak for you (the FAQ, How to Ask, How to Answer).  That's the only sure way you won't be accused of rudeness."}, {"author_name": "shankar", "gravatar_hash": "5b66fa39fd97d13b317135bbfb36a5bd", "author_url": null, "date": "Jul 23, 2012", "message": "+1 to Jalf and Jeremy. More often than not, I find \"closed\", \"subjective\" questions on stackoverflow nowadays. Many of the questions which I thought were good questions, have been closed.\n\n@jeff: I'll take a note of them next time when I come across."}, {"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Jul 23, 2012", "message": "I think it should be more difficult to close or delete old questions with many upvotes and/or views. When questions get high rankings in Google searches, they become the quintessential answer in the universe. It seems absurd to decide (often, years later) that it's \"not a good fit for SO's Q&amp;A format\" or something like that.\n\nYet, it seems to happen a lot, because someone adds a new answer or a comment, bumping it, and some aggressive modern-day reviewer applies their narrow interpretation of SO's rules.\n\nThe irony is, revising old questions, especially those that have achieved high google positions, should be encouraged. We would like people to find current, relevant answers to old questions, rather than having them re-asked, or having a frequently-viewed question contain only old, out-of-date information. But the very act of updating an old question exposes it to scrutiny.\n\nHow does this help anyone? Questions don't get a lot of upvotes because they aren't useful. And causing a first-page google search result to vanish doesn't help the people who would have otherwise found it. Shouldn't the appropriateness of a question on SO be determined in some part by the value it brings to the community? What better measure of this than its place in the historical record?\n\nI think that it might be time to think about rewording the rules a bit. The reality is, many, even a majority, of the questions asked violate the rules. That's just a reality when you have a public site that wants new people to join. That's the point of this blog post: about being nice.  But the rules are often used as an excuse for moderators to have their way. They shouldn't be - they should be used as a last-resort when dealing with something that's offensive, pointless, or unintelligible. They shouldn't be used as a way for people on some personal crusade to prune out questions that are *clearly* valuable, just on the basis on the number of views or upvotes they have."}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Jul 23, 2012", "message": "Negative feedback is actually the greatest part of Stack Overflow.  When I think I know something, and a few people downvote it, and I re-examine my answer and find it lacking.\n\nOn the other side, many questions by newbies get closed, when they are certainly not worse than the earliest questions from the close-voters.  The \"duplicate\" reason is fairly notorious for this.\n\nThere should be less \"snarking\" of newbie who are trying to do the right thing.  And more \"snarking of people who post incorrect stuff."}, {"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Jul 23, 2012", "message": "Sorry for the double comment, but the other thing I've butted heads with moderators over a few times is the \"too localized\" concern, in the context of someone trying to solve a very specific, context-situational problem.\n\nI am not sure if this was the intent of that rule or not, but the idea of deleting a question because it's not deemed to be helpful to a certain minimum number of people seems absurd.\n\nFor those of us who are experts in our trade, *the only reason* we would ask a question on SO is because we couldn't figure it out after googling for hours. To me, this rule just says \"if it's a really tricky problem, you can't ask it here, because not enough people have your problem.\" Or that's how mods often use it.\n\nThere are *millions* of questions on Stack Overflow. 98% of them are duplicates. Yet there's not room for a few really hard questions, for which no answer can be found on google?\n\nThis rule should be eliminated. There is no pervasive problem of \"too localized\" questions cluttering search results, and the rule is widely used as an excuse for closing questions -- questions which, actually, would probably help someone else one day because there was no other answer to it online. I think there's room in SO's database of millions upon millions of \"how do I hide an element in jQuery\" questions for a handful of \"localized\" ones that might only benefit a few people... but boy will those people be grateful when they find it."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 23, 2012", "message": "Given that many if not most of the posts here discuss closure/downvoting/deleting rather than comments themselves, I'm rather disturbed at how accurate Robert Harvey's comment is sounding."}, {"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Jul 23, 2012", "message": "@Ben Brocka, I didn't realize that we were only allowed to comment within a narrow focus as determined by the blog comment moderators. \n\nI thought it would be appropriate to discuss the methods and application of rules. If you close a question without comment, that still seems rude to me. Kind of like cutting someone off in traffic. No words, still rude. I thought this was about being inclusive. Perhaps I've strayed a bit from the narrow focus of his point. \n\nAnyway, both of your comments are critical of others' comments. I don't see how that adds value either. But by your own observation, most of the people commenting here want to expand this discussion a little bit. What's the harm?"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jul 23, 2012", "message": "Discussing closure/downvoting/deleting here is perfectly fine, it just has nothing to do with being polite in comments, that's all.  Some people here are conflating the use of comments to clarify policy with the policy itself."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 23, 2012", "message": "Being critical of other's comments isn't okay? That's exactly what debate and discussion are about; these things should be discussed, of course there's value in being critical. And I didn't say all comments about close votes/whatever should be removed with extreme prejudice, but talking about largely unrelated points waters down the on-topic discussion and appears to wrongly combine the two separate issues here."}, {"author_name": "Benjol", "gravatar_hash": "501465a53bf1042de206d7d79cc68942", "author_url": null, "date": "Jul 24, 2012", "message": "@Robert Harvey, re \"only good comment is no comment at all\", <a href=\"http://meta.stackoverflow.com/a/140844/130064\" rel=\"nofollow\">someone else</a> said pretty much the same thing, at around the same time, not your sock puppet, I hope? :)"}, {"author_name": "nnnnnn", "gravatar_hash": "c68e714465a5e1483b86fc6b81f48bc1", "author_url": null, "date": "Jul 30, 2012", "message": "Something I find rude on SO, which I'm putting out there just for people to think about in the context of the Summer of Love, is when poor questions are closed overly quickly without giving the OP a chance to edit. I've seen this a lot on JavaScript and jQuery questions (where my main interest lies).\n\nSomebody might post a vague but almost reasonable question, something that could be a good question with a few edits. A couple of comments get posted asking for clarification - so far so good. But then within fifteen to thirty minutes the question is closed, sometimes even after a reasonable best-guess-at-what-the-OP-meant answer has been posted.\n\nThe people closing these questions seem to think that the OP should sit there clicking refresh over and over waiting for a response and thus immediately see the request for clarification and edit the question straight away - at least one such \"closer\" confirmed this for me explicitly in a comment. Can't somebody post a question before stepping out of the office for an hour or two to get some lunch and clear their head?"}, {"author_name": "Jim Schubert", "gravatar_hash": "466dc28e15028c7353552022d2de1f9e", "author_url": "http://ipreferjim.com", "date": "Jul 31, 2012", "message": "Man, I'm so glad you're addressing this.\n\nOver the past year, I've participated much less in SO because of this same reason. In fact, I've had one member with high reputation essentially call me a rep whore because I delete my own content which is obviously not providing value to the community. I could care less about how many points I have on the internet, I just don't want to steer someone in the wrong direction.  \n\nIn another situation, I've also disagreed with another user's over-generalization (\"you should never ______\" &lt;- insert common practice), only to be immediately followed by a flurry of down-votes across numerous questions.  That user is now a moderator.\n\nAcknowledging the problem is really only the start. Getting a group of people to quit acting like they&#039;re better than others because their reps are magnitudes higher is a completely different issue which I don&#039;t think SO will be able to fix anytime soon.  Behaviorally, I think programmers are naturally *ironically rude* to start with. I don&#039;t think it&#039;ll be easy to determine the difference from harmless comments and people being complete jerks.  I mean, I could comment on a question, &quot;This is an excellent question.&quot; and at least one person may think I&#039;m being facetious."}, {"author_name": "Jon", "gravatar_hash": "623b6f40a1c66b943ce27f9c38661065", "author_url": null, "date": "Aug 01, 2012", "message": "There is nothing more annoying than googling a problem only for the first google result to be your question, followed by a terse \"dude, can't you google response.\""}, {"author_name": "Chris Beeley", "gravatar_hash": "62c338b7c8a0b3fd778a1fc493ad92b5", "author_url": null, "date": "Aug 02, 2012", "message": "I think this is great. I'm a big user of Cross Validated and I think it is very friendly, maybe other areas are less so, but it's a wonderful initiative and there is certainly too much snark on the internet.\n\nI do wonder whether we even want users who ask questions that are answered by a Google \"I feel lucky\" search of the keyword in their question. I've seen this several times on Cross Validated and it actually makes me quite angry. The greybeards on Cross Validated are really awesome statisticians and programmers and to waste their time with such silliness seems to me to be rude in the extreme.\n\nBut other than that, totally agree! Sometimes it's not easy to google the right answer, I find that myself."}, {"author_name": "matt wilkie", "gravatar_hash": "acd0e289c2d32dbb5ba6cfbecd708c97", "author_url": "http://arymren", "date": "Aug 05, 2012", "message": "Thank you for putting some serious energy into this. I've been slowly  curtailing my participation in Stack Overflow and a few of the other SE site as my contributions are increasingly met with unfriendly feeling responses. (not that my participation was that high to begin with as I'm not a real programmer. Still, even a small lessening is a loss, I think.)"}, {"author_name": "JP", "gravatar_hash": "118f49e3ea76935f3e7be907a9bbc068", "author_url": null, "date": "Aug 07, 2012", "message": "\"Now that Stack Exchange is getting to about that age, we’re starting to see some warning signs that the community is getting insular.\"\n\nOne corollary to the \"insular\" community is the appearance that the rules don't apply in certain situations. People who should be disciplined aren't, posts that should be removed are left (\"protected\"). And all the while, a myriad of excuses are used to justify this behavior (\"historical significance\"). Sorry, but I fail to see how Stack Overflow is avoiding this fate. It has several well-known (among the regulars, of course) jokey questions and answers that simply have no place on anything but a humor site. That these posts continue to exist on the site in spite of their off-topic nature further cements the very type of insular community that this article preaches against. As the article says, it's the passers-by who see the hypocrisy and avoid the site that are the casualties."}, {"author_name": "HackerJack", "gravatar_hash": "1cffcdcf0f6f411de65bd550363256cf", "author_url": null, "date": "Aug 09, 2012", "message": "You have missed out on the simplest solution, one that could have allowed a useful thread to continue and also to remove the spectre of seemingly negative comments for browsers.\n\nThe solution is easy, have two types of comments.\n\nThe first will be public comments, designed to ONLY deal with the questions content itself in a way that drives towards a solution.\n\nThe second would be private/semi-private comments.  These could cover anything from advice as to why this is a poor question, suggestions on reformatting, or any other comment not directly related to solving the askers actual problem.\n\nIf Private then only the original poster and the commenter would be able to see it, this would be best to keep the site clean but doesn't allow for group collaboration, it would also probably lead to numerous people posting the same comment as they cant see previously posting ones.\n\nSemi-private would hide the posts unless the browser selects to show them, this would allow their removal from view for the majority of viewers, leaving a clean question with constructive posts but still allowing those who wish to make a comment or partake in improving the non-question elements of a post to see and contribute.  \n\nSemi-private would be my preferred option.  I don't see any real technical reason why this could not be applied quite easily.  Sure some people would post in the wrong type of comment but that is behaviour that can be corrected more easily.  Whilst it doesn't get rid of those who choose to be rude because they want to be, it does give the opportunity to provide valid criticism without distracting from the Q&amp;A nature of the site."}, {"author_name": "Brad Mace", "gravatar_hash": "1f744618bae7f59c10ae01152c85d8f6", "author_url": null, "date": "Aug 11, 2012", "message": "The snark which the Summer of Love is trying to treat is merely a symptom of the veterans and moderators being overwhelmed by the flood of new people, making any effort to control quality feel like bailing out the ocean. If anyone has any ideas about fixing *that*, come join the [discussion on meta](http://meta.stackoverflow.com/questions/143113/are-unanswered-questions-a-problem-yet)."}, {"author_name": "anonymous", "gravatar_hash": "b7026b87c51690329e9ef5b74928bbfb", "author_url": null, "date": "Aug 15, 2012", "message": "hi joel, this is brilliant writing and a real treasure esp for the amazing comments. must admit I agree strongly with \"jalfs\" early comment. there seems to be an untapped reservoir of user generated content that is still quality yet being held back by the current software/design decisions. I like your emphasis on *emotional intelligence* and cultural anthropology. awesome man!\n\nit looks like web sites go through growth/aging periods. they have an early/middle/old age, and take on characteristics based on the members participation/dynamics. wikipedia has matured. maybe stackexchange is starting to also.\n\nIm just disappointed that you arent suggesting or perhaps realizing that there maybe untried technical solutions to some of the issues you mention. eg I like hackerjacks proposal of private/semiprivate/mixed comments. think its worth a shot. a plaintive blog post is not gonna change the culture.\n\nI think the moderator culture needs to be addressed. I think the lifetime moderator policy should be revisited. think that lifetime moderators is partly what leads to calcification of the site... suggest there be a way for users to vote to replace a moderator. radical? or natural?\n\nheres a radical idea-- let the community decide what posts to kill based solely on votes, and skip the question closing mechanism. try it out somewhere. create a sandbox where people can experiment and try out new ideas with low risk, and promote the best ideas to other sites. let some sites customize their quality mechanisms.\n\nanother idea. allow very small stackexchanges to be started by anyone who can get just a few people to join. ie low threshhold. let people create their own sites and grow them organically. let people vote by where they participate. thats the ultimate voting of all.\n\nanyway I really like stackexchange software but what I like the most is that its *evolved* over time. I think further evolution is possible, maybe even necessary. I think sometimes radical changes can lead to radical improvements. there are some improvements that are nonlinear. think that the feature space for this type of collaborative software is still not very fully explored. there are lots of other mechanisms/ideas/features to try out. think the skys the limit.\n\nhere is another thread that some may find relevant to this subject. its a small, rather arcane stackexchange struggling to deal with a significant drop in participation. they are proposing \"expanding the scope\" but I think even that alone is somewhat futile. its as if they imagine that all they have to do is issue a post, or a proclamation on meta, that they are widening the scope, and magically new questions will show up. something much deeper, \"structural\" is in play, as you indicate in your analysis above. \n\nhttp://meta.cstheory.stackexchange.com/questions/1572/on-modifying-our-scope-a-proposal\n\n\nhope you revisit this subject. a summer of luv is a start but only a temporary fix. theres something much deeper going on here. you're on the right track. but its a long track. =)"}, {"author_name": "Motion Graphics", "gravatar_hash": "24cf897e6275ade38ff3cc8211d0f656", "author_url": "http://www.hurricanemedia.co.uk", "date": "Oct 01, 2012", "message": "Ok so Stack Exchange is going to be a friendly place from now on then"}, {"author_name": "Modele Perdele", "gravatar_hash": "e8d6ff64fc875e516aabccbbd5f98e77", "author_url": "http://www.dekoris.ro", "date": "Nov 29, 2012", "message": "A couple of comments get posted asking for clarification – so far so good. Advanced users want good questions which haven’t been asked before and by people who will listen to the answers and not be idiots about it."}, {"author_name": "Vanessa Prepagos Medellin", "gravatar_hash": "adfceac64f3ffe6657eea9db8d82dbde", "author_url": "http://www.lindaspaisas.com", "date": "Dec 03, 2012", "message": "Sure one can look at the problem as the fault of the old timers.\n\nor\n\nThe new guys could learn to read. Would it *not* be amazing if new users actually read the FAQ instead of skipping over it, wrote properly and provided sufficient explanation? You don’t need to be *in* Stack Overflow to know how to write and explain properly.\n\n“Here’s my code, it doesn’t work. Thanks in advance”\n\nor\n\n“Here’s my code, here is a brief explanation of the problem and my error log”\n\nFix only one side and your old timers who would put on the flowers and smiles are going to get burnt out guiding and holding every user who is too *lazy* enough to do their own work."}]}