{"response": [{"author_name": "kaiser", "gravatar_hash": "b633452832ed5613b18a4432b0149ae9", "author_url": null, "date": "Jul 31, 2012", "message": "Yea, \"hehe…that was fun!\" adds lots of value to a question. When I'm searching something, I'm also reading through comments, to not miss that one single important note that was no edit. When I then have to read such \"noise\", things start slowing down. Honestly: \"be nice\" ... ok. But please don't throw such comments in as \"good examples on how to behave\". It makes searching a pain and brings me much faster to opening another question. Thanks."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 31, 2012", "message": "&gt; all they knew was that it was a “programmer’s discussion forum”\n\nUh, wouldn't it have been more accurate to call it a Question and Answer site, and possibly result in more accurate ratings?"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jul 31, 2012", "message": "My first observation here is that <i>most</i> of these - friendly and otherwise - are fairly superfluous. \n\nParticularly liked,\n<blockquote>NO. GOD. these comments are getting irritating.</blockquote>\n\nReminded me of \n\n<img height=\"128\" src=\"https://lh5.googleusercontent.com/-foLTZ2sLbWU/T8kGcmifBEI/AAAAAAAAIzo/hBJDKwr4XtE/s750/infinite_motivational_poster.gif\">"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jul 31, 2012", "message": "•This is not correct, for many reasons, many of which were pointed out by plinth below. -- Not friendly, but not particularly offensive.\n\n•could you please stop reposting all your questions 4 times? -- Instructional.  He even said \"please.\"\n\n•Spencer, my tone? You sir are political correctness gone mad! -- Chatty, even a bit playful, but not particularly offensive.\n\nThe rest of the \"bad\" comments are really over-the-top bad.  Does anyone seriously think any of them are acceptable?\n\nThe examples for good comments... Really? Sure, they're \"nice,\" but none of them are particularly helpful or instructive.  Recall that the purpose of comments is to provide clarification.  None of the \"good\" comments serve that purpose at all.  I don't think any of these are examples of good, instructive, helpful comments."}, {"author_name": "ernie", "gravatar_hash": "439efa7cf19fd8a7e6a1600822fb2114", "author_url": null, "date": "Jul 31, 2012", "message": "They didn't ask for 'good' v. 'bad' comments.  The three categories of classification were \"Friendly, Unfriendly, or “Neutral/Unclear.\""}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jul 31, 2012", "message": "@Ernie: Nevertheless, you do get my point, don't you?  A friendly, but useless comment is still useless."}, {"author_name": "Peter", "gravatar_hash": "d4ecac7536f7077f664a84735e6f1549", "author_url": null, "date": "Jul 31, 2012", "message": "Hmm. Looks to me that both very friendly and very unfriendly comments have very little relevant content."}, {"author_name": "ernie", "gravatar_hash": "439efa7cf19fd8a7e6a1600822fb2114", "author_url": null, "date": "Jul 31, 2012", "message": "@Robert Harvey - I get your point, but their methodology looks like it wouldn't allow for the \"value\" judgement aspect . . . maybe a follow up study could be done to add a second criteria, and compare friendly/unfriendly to value?  Seems like it could result in some interesting x-y plots . . ."}, {"author_name": "voretaq7", "gravatar_hash": "03b75a71937ed56b4d9c3d244f776d05", "author_url": "http://www.bsd-box.net/~mikeg/", "date": "Jul 31, 2012", "message": "As Shog9 pointed out, most of these comments are noise.  This is particularly true for the \"friendly\" comments, the majority of which I personally don't consider friendly -- I consider them *useless fluff*.  \n\nConversely the \"unfriendly\" comments seem to be the longer ones, which makes me wonder if our Turks are predisposed to \"TL;DR;Words are MEAN!\" -- It might be interesting to see the median length of Friendly vs Unfriendly comments, and perhaps to normalize the length somehow in the future to weed out \"fluff\".\n\n***\n\nA couple of observations based on the context-free snippets above:\n\n1. **Context is important.** (at least sometimes)  \n`This is not correct, for many reasons, many of which were pointed out by plinth below....` could in fact be a quite friendly comment depending on what happens after the ellipsis -- Just because you're telling someone \"you are incorrect\" does not mean you're being \"mean\".  (Huge personal pet peeve.)  \nThe lack of context here (and presumably in the Mechanical Turk evaluation) may skew the perception somewhat, though false-positives (mean) are better than false-negatives...\n\n\n2. **The full comment is really needed** (definitely for the turks, but also for us)  \nThis is a natural follow-on from (1) -- Many of these comments trail off before you can make an adequate determination of whether or not they're \"mean\".  Having the full comment would be helpful in illustrating your point..."}, {"author_name": "ernie", "gravatar_hash": "439efa7cf19fd8a7e6a1600822fb2114", "author_url": null, "date": "Jul 31, 2012", "message": "I think the full comments were provided, as they're in the Excel file . . . looks like they were just trimmed for web presentation."}, {"author_name": "Joel Spolsky", "gravatar_hash": "95e6837f350869bfb44e069a98885c58", "author_url": "http://stackoverflow.com", "date": "Jul 31, 2012", "message": "\"Friendly but useless comments are useless\" -- that's a tautology. The question is whether we want them on our site. \n\nPersonally I think that they are a good thing and we want them--they create an environment and an online culture that is appealing to humans and encourage people to participate. When you go to a place and see people being nice to one another and apparently being happy, you tend to like that place and want to spend more time there. When you go to a place and see anger and people getting in fights, you tend to not like that place and want to leave.\n\nI do, completely, understand the other point of view, which is that our goal should be to create a site that consists, as much as possible, of 100% pure information... all signal, no noise. I do understand that some people consider it tedious to browse through friendly \"thanks!\" and \"you're welcome!\"'s when they are trying to find the answer to a specific programming problem that they are facing right now.\n\nThat said, an unfriendly comment is vastly more \"noisy\" than an equal-length friendly comment, for the same reason as people always gather to watch a fight but don't stand around waiting to see if two people will greet each other politely... it is a human impulse to pay attention to conflict and everything about your brain is tuned to pay close attention to potential danger, so when you see a fight or what looks like it might become one, it does far more damage to the \"signal-to-noise ratio\" than when you see a \"Thanks!\" comment."}, {"author_name": "Joel Spolsky", "gravatar_hash": "95e6837f350869bfb44e069a98885c58", "author_url": "http://stackoverflow.com", "date": "Jul 31, 2012", "message": "By the way, to all of you who are nitpicking individual comments, there are 7000 comments in the Excel document, and this is a statistical exercise. We are not proposing to use Mechanical Turk to punish users or to delete comments; all we are doing so far is showing that it is a reliable way to get reasonable statistics on things like friendliness over time. And, all the nitpicking aside, I think you would be very hard pressed to make the argument that we need more comments like the ones that most mturkers found unfriendly."}, {"author_name": "Wug", "gravatar_hash": "2152f0665d54a5cfe8bde11b18f91547", "author_url": "http://NULL", "date": "Jul 31, 2012", "message": "What I got out of this is that any comment can be spun as friendly by appending a smiley face to it."}, {"author_name": "Jim d.", "gravatar_hash": "a00fcc9ed6e6ae344efff9fe317c7a5a", "author_url": "http://youfailed.us", "date": "Jul 31, 2012", "message": "Hi Joel, great article.\n\nOne of the great ironies of Q&amp;A sites and forums in general is that they simultaneously rely on participation yet they can also provide a hostile environment for would-be participants. So I'm glad to see that you've made friendliness a priority."}, {"author_name": "Chris Francis", "gravatar_hash": "bda3f58999e71f9e76fc7ee418b3ec67", "author_url": null, "date": "Jul 31, 2012", "message": "@Shog9 - That is the best gif I've ever seen... :)"}, {"author_name": "Amro", "gravatar_hash": "4b8ce2e5dff7e913642c84213353f6a3", "author_url": null, "date": "Jul 31, 2012", "message": "There is a lot of promising research done in natural language processing (NLP). [Sentiment_analysis](http://en.wikipedia.org/wiki/Sentiment_analysis) is particularly of interest here."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jul 31, 2012", "message": "Can I just go on record that I think we are expending time, energy and money vastly out of proportion to the perceived \"pr0blem?\"\n\nNegative comments are already adequately handled by the flagging system.  If people are not flagging, then let's focus on that.  But nobody disagrees that these comments are harmful and should be removed, and there is generally universal agreement over which comments are bad.\n\nAs to the chatty comments like \"thanks,\" the consensus on Meta seems to be that upvotes are preferable."}, {"author_name": "Josh Caswell", "gravatar_hash": "79f438a6844f77869a79854eb9404aae", "author_url": "http://meta.stackoverflow.com/users/159251/problem", "date": "Jul 31, 2012", "message": "Robert's statement was not really tautological; the point he was making was that \"useful\" has always been the primary factor for the answer to \"Do we want this comment?\", (whereas this Summer of Love discussion seems to be suggesting that \"friendly\" should be more important). A comment which is useless goes into the \"Unwanted\" pile _despite_ its friendliness."}, {"author_name": "Wug", "gravatar_hash": "2152f0665d54a5cfe8bde11b18f91547", "author_url": "http://NULL", "date": "Jul 31, 2012", "message": "On that note, there is one direction that isn't considered in this post: the neutral.  Neutral comments might come across as unfriendly, but they aren't malicious or ill-intended, often they are meant to help or to improve, but the way they are written seems terse or short.  Consider the following examples, pulled from the \"unfriendly\" category above:\n\n&gt;could you please stop reposting all your questions 4 times?\n\n&gt;This is not correct, for many reasons, many of which were pointed out by plinth below. ...\n\n&gt;Jesus! Start fixing your question.\n\nTaken out of context, it's hard to decide whether these comments were \"mean\" or otherwise.  However, I can think of plausible explanations for a user to leave these comments without meaning ill, or while meaning well.\n\nThe first, for example, could definitely have been a little more in depth, maybe with a link to the rules and the FAQ, but (while it certainly isn't friendly) it doesn't come across as mean (though maybe a little irritated).  \n\nThe second is purely business (or it looks like it, it's cut off and I can't see the whole thing, probably a user informing another user that an answer they posted has a flaw.  Nothing wrong with weeding out the incorrect answers (it definitely helps to have a little grace when your answer is criticized though).\n\nThe third looks more like a cry of shock with a humorous twist.  Not designed so much to needle the OP into feeling bad, but to needle them into fixing their post.\n\nThat being said, several of those comments appear neutral at first glance, but have a sting in the tail if you read them again, and others are outright malicious.\n\nLooks like Harvey beat me to this.\n\nAnyway, what should we do with comments that suck, either because they are useless, or because they are rude or offensive?\n\n* Should we flag comments just because they are rude?\n* Should the author of a post or answer flag comments on it that they think are out of line?"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.billthelizard.com", "date": "Jul 31, 2012", "message": "This is the money quote for me:  \"Of those 2.3% extremely unfriendly comments, less than 1/5th have been deleted. Most of them are still on Stack Overflow right now.\"\n\nI'm sure this is all leading somewhere, but I still want to ask, what do we do now?  Now that you've identified that there is a problem, how do we A) clean it up, and B) prevent its spread?"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jul 31, 2012", "message": "* Should we flag comments just because they are rude?\n\nYes.  One of the flag reasons is \"Rude or Offensive.\"\n\n* Should the author of a post or answer flag comments on it that they think are out of line?\n\nYes.  The purpose of comments is clarification.  Any other use subject them to removal."}, {"author_name": "Rachel", "gravatar_hash": "01b235a8024b2dd10f427c301c876a0b", "author_url": "http://rachel53461.wordpress.com", "date": "Jul 31, 2012", "message": "Stack Exchange is a community of volunteers that enjoy spending their time sharing their knowledge and helping others. If you take away the \"friendly\" aspect of it, you're likely to lose a lot of volunteers.\n\nI don't want to just sit around answering questions for points. I want to genuinely help other users understand a topic, and assist them in solving their problems. If you take away the \"human\" aspect of the site and only show the \"information\" side of things, I probably wouldn't be around.\n\nI don't view the \"thanks\" comments as \"useless fluff\" because they contribute to SE being the friendly community of helpful volunteers that they are. \n\nAnd the rude, sarcastic, elitist, hostile, and condencending comments *are* a problem because this is the sort of behavior that will drive away users that only want to volunteer their time and knowledge to help others."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jul 31, 2012", "message": "Helping others *is* being friendly already.  Nobody is saying that rude comments are not a problem."}, {"author_name": "Rachel", "gravatar_hash": "01b235a8024b2dd10f427c301c876a0b", "author_url": "http://rachel53461.wordpress.com", "date": "Jul 31, 2012", "message": "@RobertHarvey I must have misunderstood your comment about \"Can I just go on record that I think we are expending time, energy and money vastly out of proportion to the perceived “pr0blem?”\". I assumed you were referring to the \"Summer of Love\" topic of rude comments.\n\nThe \"thanks\" comments add a touch of humanness to the whole Q&amp;A thing, which I enjoy. It makes the SE sites seem more like a community and less of a Question/Answer factory."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 31, 2012", "message": "\"Helping others *is* being friendly already.\"\n\nThis can't be emphasized enough.\n\nAnd I have to agree with Robert that friendly, noise comments are still a problem. One of the reasons I love Stack Exchange is because I can find a question and an answer fast. One of the biggest problems in traditional forums is that the question and especially the answer are hidden among \"noise\" posts. Yes, even the friendly ones. \n\nWhen I'm looking for what to do about this null reference error, what I want to see is an answer stating what to do about this null reference error. I am not looking for 500 \"Thanks\" comments (or 500 \"you suck\" comments, to keep that clear).\n\nSignal over noise is a very important aspect of the user experience of these sites."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Jul 31, 2012", "message": "&gt; When you go to a place and see people being nice to one another and \n&gt; apparently being happy, you tend to like that place and want to spend \n&gt; more time there. When you go to a place and see anger and people \n&gt; getting in fights, you tend to not like that place and want to leave.\n\nI think this is a good point, though it's possible that this can be taken too far, in a \"15 pieces of flair\" kind of way.\n\nBut here's one point -- why *shouldn't* we be happy to be there?  It's one thing to force a waitress making $2 / hour plus tips to paint on a smile and act like she's at a party.  Nobody *has* to be at Stack Overflow.  If we're not happy to be there, it raises the question of why we're there in the first place.\n\n&gt; That said, an unfriendly comment is vastly more “noisy” than an  \n&gt; equal-length friendly comment, for the same reason as people always &gt; gather to watch a fight but don’t stand around waiting to see if two &gt; people will greet each other politely…\n\nAmen.  To put it another way.  If I'm at a movie theater, a couple holding hands is not a distraction; a couple arguing is.  Conflict draws our attention and demands mental energy to process, positive energy does not.\n\n---\n\nAs for what the big deal is, it has been my perception that SO/SE culture rewards few things more than recognizing and purging \"crap\" content.  That the way one gains status around here, other than domain expertise, is by recognizing and labeling crap content.  Long-time users had come to see themselves as Guardians of the Internet.  This was added on in no small part by the repeated notion that aggressive moderation was a big part of what made SO/SE great.\n\nSo, if a new user posts a question outside the guidelines of the FAQ, a race ensues to see who can be the first to shame the questioner.\n\nAs noted, this isn't the type of place a lot of people, particularly those who might be unclear about the rules, will want to spend a lot of time."}, {"author_name": "voretaq7", "gravatar_hash": "03b75a71937ed56b4d9c3d244f776d05", "author_url": "http://www.bsd-box.net/~mikeg/", "date": "Jul 31, 2012", "message": "@Joel - Re: nitpicking, for the record I'm not picking on the statistical validity of the exercise (the large sample set and the nature of mTurk offsets that quite nicely), I'm picking on the choice of examples, particularly the set chosen to represent \"snark\".\nWhen we talk about snark on Server Fault we call ourselves out on our most egregious examples, and the shock of \"Wow, even the thick-skinned BOFHly types that hang out here are offended\" is a powerful tool in the fight to maintain civility.\n\nRe: My point about the fluffy comments, it isn't that I think they're unwelcome, but rather that they may be skewing the data set <i>toward friendliness</i> if there are enough of them.\nThat's a subject for a much deeper data analysis than I can do during a work day though, but what I'm getting at is I would hate to have you guys re-run this analysis at the end of Summer of Love and be all proud of how friendly we are only to discover the random number gods happened to get a bunch of back-patting posts that really skewed the stats and we're really dicks."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Jul 31, 2012", "message": "&gt; “Helping others *is* being friendly already.”\n\nLet's see how that sounds when applied to other contexts:\n\n* Correctly processing the transaction at the DMB is being friendly already.\n* Bringing customers their correct food order at a restaurant is being friendly already.\n* Taking a technical support call and making some effort to solve the problem is being friendly already.\n\n\nYou're free to have that attitude, but it typically isn't true from the customer's perspective.  I hate small talk, and value efficient transactions, but still don't appreciate it when people who are helping me act like it is some tremendous burden.  And I will tend to work with those that don't.\n\nIf the Culture of Snark remains, and an alternative pops up that is a little bit better place to be, that's where people will go, and people here can remain and congratulate themselves over how they kept the internet from getting worse and cleaned out all the crap questioners."}, {"author_name": "Zirak", "gravatar_hash": "348d335cd13298e475eeaefa1841dee6", "author_url": null, "date": "Jul 31, 2012", "message": "Really? Are we in 7th grade? You don't need to hide your kids from those awful, God forsaken words. No warlocks will come out to eat your mother just because you said \"ass\" or \"fuck\". And I am amazed that people over-react to them; or rather just react. You also shouldn't shield your kids from ever having to think for themselves. It's better to be a bit mean and make the other party truly learn than to be Mother Teresa and shower everyone with all they need.\n\nI have to disagree about some of the negative comments: The downright mean are offensive, true, but just to nitpick, \"I mean, really, WTF?\" isn't offensive.  Sure, it's not very helpful, but why do people care? And you can't deny you get exasperated after some time. We all have our limits, and we should be able to express them. And since we are talking about humans here, context is important. Some comments which look offensive to an outsider can be a joke or friendly-banter, or a million other possibilities.\n\nBeing a jerk should certainly be frowned upon, but you can be helpful and say \"bitch\" under the same breath. You can also be the biggest douchebag in the universe and have a smile on your face. I'm getting tired of people grasping at words instead of actually looking at what you're saying. And don't give me any of the \"professional\" crap; just give it up. There's no such thing.\n\nTo sum the last paragraphs up: Tough love is good, being a dick isn't. That's why there are flags. And at the end, isn't this The Internet?"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jul 31, 2012", "message": "@JohnMcG: Thanks for the hyperbole, but there doesn't seem to be much in the way of evidence to back up your assertions about aggressiveness.  Rude, uncivil comments are crap content, too.  The \"Guardians of the Internet\" can chew on those, if they're bored.\n\n\"Thanks\" comments: meh. I can live with or without them; that's not really the reason I'm here.  Ultimately, the purpose of Stack Overflow is to create a high-quality repository of software development knowledge; any comment that doesn't further that goal is just noise.  \n\nIf you really want to leave your \"thanks\" comment, and the person you've directed it to has already seen it, there's no real reason for it to stay, unless you're trying to prove to the world for all time how nice you can be."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Jul 31, 2012", "message": "@Ben Brocka: so? How do \"thank you\" *comments* make it harder to find *answers*?\n\nThis is not a crappy web forum. It is, I believe, very very easy to locate the answers to a question, no matter how many comments there are.\n\nAnd most of the time, we are not talking about '500 \"thanks\" comments', but *one* \"thank you\" from the person who asked the question.\n\nI don't think signal over noise is a concern in that situation.\n\nYou are right, of course, that if left unchecked, if people started posting \"thank you\"'s as answers, and hundreds of them, then it would dilute the site and make it impossible to find the useful answers.\n\nBut I don't see that happening when people try to be polite, and say \"thank you\" in a comment. Can you give us an example of where this is *actually* a problem? A link to a question where the answers are harder to find because of too many \"thank you\" comments?\n\nAs @Rachel says, a comment which contributes to making SO a nicer, friendlier place where people actually feel welcome, and *dare* to ask questions or post answers is certainly not \"useless\". \n\n&gt; Can I just go on record that I think we are expending time, energy and money vastly out of proportion to the perceived “pr0blem?”\n\n&gt; Negative comments are already adequately handled by the flagging system.\n\nWell, given that these comments still exist, they are clearly not \"adequately handled\". And even if they are quickly removed, the damage is done, to some extent. Nasty, angry snarky comments tend to leave an impression even if they get deleted after they were read.\n\nAnd I get that you don't have a problem with how unfriendly SO can sometimes seem. But what if others do? What if newcomers are turned away by it? What if regulars stop answering questions because they just no longer feel welcome or appreciated?\n\nI can't read Joel's mind, but I'm guessing that he did not institute a \"Summer of Love\" because he was worried that Robert Harvey was feeling unloved on SO. You know how the place works, people know you and generally respect you. You have a high rep and a little diamond next to your name. So yes, of course the place is lovely to someone like you (and, generally speaking, to me, and most other regulars) But not everyone is in our position. Most likely this effort is because of how people who are not in your position, who are newcomers to the site, or who have been turned away by the rule-mongering or by angry comments, by questions being closed/deleted too quickly, by the feeling that they're just not welcome.\n\nI guess I'll go on record saying that I think the time, energy and money expended on this is a damn good thing, it's long overdue, and I hope to see more like this.\n\nOn a side note, I freely admit that I've posted more than a few comments along the lines of \"interesting question, +1\", because I feel it's worth it to encourage people (and, of course, because I felt it *was* an interesting question, and one that I'd like to see answered), to make them feel that they're not just posting their question into an empty void, and, at times, to forestall close-votes and angry comments. People tend to behave better when others have already expressed that they see value in a question.\n\nPerhaps I am guilty of the deadly sin of cluttering up SO, and perhaps someone should go through aaaalllll my comments and delete all the offending ones.\nBut I think the \"human touch\" is important. And I think that, when we actually have a site which distinguishes between comments and answers, which lets me find answers regardless of how many \"me too\" comments have been posted, we should make the most of it. Not to needlessly spam comments everywhere, but to make the site a nicer place to be.\n\nBut really, if I can't say \"thank you\", or \"That's a really good question. I'd like to know the answer to this too\" without risking my comments being removed, then I start questioning why I bother answering questions in the first place.\n\nI do it to help people. I'm a human being interacting with human beings. Reduce me to a cog in a machine, and I'll lose interest. I don't contribute to Wikipedia because I have no interest in writing an encyclopedia. I don't want to share my knowledge with an impersonal webserver. But I do genuinely enjoy sharing my knowledge with *people*. And the comments are pretty vital in keeping that \"human\" element. It feels genuinely nice when people say \"thank you\". It reminds me why I've spent so many hours answering questions here.\n\nAnd once or twice, I've asked a question which was faced with pointless comments along the lines of \"you shouldn't worry about this\", or \"what do you need to know that for?\" and then someone saying \"hey, that's a good question\" actually helps as well.\n\nThe cold heartless robots at Meta might not appreciate that kind of thing, but tough luck. I do. I *want* to see a certain number of comments around whose only purpose is to be friendly and to express enthusiasm about a question or an answer. Within reason, of course, but having *some* such comments can make a world of difference to someone trying to form an impression of the site, or to someone trying to decide if it's worth answering a question here."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 31, 2012", "message": "<blockquote>\nI don’t view the “thanks” comments as “useless fluff” because they contribute to SE being the friendly community of helpful volunteers that they are.\n</blockquote>\n\nTo be clear \"Thanks great answer!\" is indeed useless fluff. Use the giant upvote arrow next to the comments, question, or answer instead.\n\nNow, something like \"Thanks, that really helped me fleex the gubratron, particularly when I vanaxed the slimthor to 12\" is actually useful.\n\n<blockquote>\nThe point he was making was that “useful” has always been the primary factor for the answer to “Do we want this comment?”, (whereas this Summer of Love discussion seems to be suggesting that “friendly” should be more important). A comment which is useless goes into the “Unwanted” pile _despite_ its friendliness.\n</blockquote>\nCorrect. Celebration of friendliness <i>for the sake of friendliness</i> is misguided (and arguably kind of harmful if promoted as an end in itself). Celebration of <b>friendliness while providing <i>useful information</i></b>, now that's something I can get behind."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jul 31, 2012", "message": "@Jalf: The problem is not the flagging system, the problem is that some folks on the site think it's more amusing to upvote snarky comments than it is to flag them for removal.  Snarky comments get removed if they're flagged, and we suspend the egregious offenders.  Simple as that.\n\nIf nothing else comes out of this conversation than people start flagging snarky comments rather than celebrating them, then it was probably worth having the conversation."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 31, 2012", "message": "<blockquote>\nIf you browse Stack Overflow for a few minutes, it’s likely that you will come across one of these extremely unfriendly comments\n</blockquote>\n2.3%, while indeed a problem worth discussing and addressing, does not seem to justify the use of the word \"likely\" and the phrase \"if you browse Stack Overflow for a few minutes\" here.\n\nLet's test this assumption. I'm going to visit page 10 of recent questions on Stack Overflow right now (at 15 q/page). <b>I encourage you to try this experiment yourself:</b>\n\nhttp://stackoverflow.com/questions?page=10&amp;sort=newest\n\nLooking at the 15 questions on that page:\n\n- self ask/answer \n- \"please be more explicit. tell us the error.\"\n- no comments\n- clarifying \"perhaps you are looking for\" comments with links to other questions\n- no comments\n- \"can you post the code of what you have tried\"\n- no comments\n- no comments\n- \"what do you mean by this?\" \"you have to explain...\"\n- \"load the model\", \"possible duplicate of\"\n- \"are you asking in the general, i.e. abstract sense..\"\n- no comments\n- no comments\n- basic discussion of the question's technical content\n- no comments\n\nI just browsed Stack Overflow \"for a few minutes\" and I didn't see a single rude comment. \n\nI loaded all 15 questions that happened to be on page 10 at that particular moment. None of these questions happened to be closed, however. I wonder if Joel's \"likely\" statement is about the comments on <b>closed</b> questions, which perhaps tend to be a little more statistically off-color by the nature of the interaction? \n\nWell, let's put on our science lab coats and try that out too. How about page 10 of the last 15 closed questions? Again, I encourage you to <b>try this experiment yourself:</b>\n\nhttp://stackoverflow.com/search?page=10&amp;tab=newest&amp;q=closed%3a1\n\nLoading up the 15 closed questions in tabs:\n\n- \"welcome to Stack Overflow! Please don't use the mysql_..\"\n- \"this is a dupe of about a million and a half things, hang on a sec while I find one of them\"\n- no comments\n- \"consider the following link..\"\n- no comments\n- no comments\n- \"You literally just asked this question.\"\n- \"How ironic, a question about how to find stolen code on a Q&amp;A site which is full of code snippets..\"\n- \"provide some info if you want good help ;-)\" \"You should wonder more about why you have so many downvotes\"\n- no comments\n- no comments\n- \"you should post on programmers.stackexchange.com\" (not correct, btw)\n- \"So you intend to bet the farm on advice from strangers whose qualifications to provide such advice are completely unknown to you ? Take my advice, get better advice.\"\n- no comments\n- \"what error do you get?\" \"Asking for help to program something that behaves like a virus will not endear you to the SO community. I suggest you think about what it is you want to achieve.\"\n\nWhile the \"how ironic\" answer may be a little sassy, I don't know if I'd rate that as mean and snarky, certainly nowhere <i>near</i> the level of the overtly rude 2.3% examples provided in the blog post.\n\nAnyway, based on \"browsing Stack Overflow for a few minutes\", I did not \"come across one of these extremely unfriendly comments\" <i>even on closed questions</i> -- which actually surprised me a little.\n\nThat is not to say that 2.3% of comment meanness isn't a problem. It is. But let's be clear that we're talking about some pretty rare stuff here. 2.3% is less than 1 comment in every 40, and I strongly suspect that such comments tend to appear in the weirder areas of the system: the questions that are unusual, contentious, in the process of being closed, and so forth.\n\nThe #1 thing to take away from this is <b>don't ever hesitate to flag rude comments when you see them</b>. The same way we always have..."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Jul 31, 2012", "message": "&gt; The same way we always have…\n\nThen why do ~80% of the comments identified as extremely unfriendly still exist on the site?\n\nLet's look at Jeff's list:\n\n* A friendly comment.\n* A hyperbolic and sarcastic scold.  \n* A neutral direction\n* A scold.\n* Sarcasm and accusation of intent to plagiarize.\n* Helpful suggestion followed by unsolicited personal advice\n* A bum steer.\n* A post oddly enough mocking the idea of someone seeking help on SO.\n* Helpful question followed by accusation and condescending suggestion.\n\nIf these were a new user's first interaction with the SO \"community,\" (and remember, Jeff, you're the one who kept pushing this term) would you want to come back for more?\n\nAnd this in the face of a public \"summer of love\" campaign.  Can't say that I'm relieved that there's not a problem."}, {"author_name": "mogged", "gravatar_hash": "03f501772c13dc573f78f08d9d83dcb0", "author_url": null, "date": "Jul 31, 2012", "message": "In the past, I've tried to post thing like \"That works great, thanks!\" and other users have edited my questions to remove it saying that it was \"superfluous\".\n\nSeems to me like there is a bit of a double standard, there. On the one hand, you want a community - one which seems to be becoming increasingly cynical - to start being more friendly, but on the other hand, you want people to \"get to the point\" and not bother with \"niceties\". \n\nI hate to be the one to point this out, but niceties go a long way towards improving the general friendliness of any given interaction. Maybe the decision to delete all niceties needs to be scaled back or made more reasonable than a 100% ban?\n\nWhat's wrong with saying \"Thanks!\"?? It literally takes less than half a second to read and can completely change the tone of a message.."}, {"author_name": "xaade", "gravatar_hash": "7e0f4fa88f1acd2e5464b5490c3fffa2", "author_url": null, "date": "Jul 31, 2012", "message": "Seriously. You guys are acting like you can put statistics to friendliness. This type of scrutiny will only lead to some hard-ball rules, barriers to entry, and political correctness that will drive pragmatics away. Context matters.\n\nIMO, If one of my \"+1 Thanks\" comments is removed, myself will be removed as well, because **the act of censoring friendliness is rude**.\n\nThe argument to *just upvote* is short-handed, because there's no good way to see *who* upvoted. As such, \"+1 Thanks\" comments are indeed helpful. If you want to implement this as a feature to filter out these comments into another section, feel free."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 31, 2012", "message": "<blockquote>\nAnd this in the face of a public “summer of love” campaign. Can’t say that I’m relieved that there’s not a problem.\n</blockquote>\nI think this gets to the root of the problem: \"snark\" is often in the eye of the beholder. That's why you <i>have</i> to use objective science, comments as rated by multiple independent outside observers -- that is the purpose of the Mechanical Turk examples cited in the above post. And kudos to Joel for posting it, because it helps immensely in avoiding the \"well, I define rudeness thusly\" part of this discussion.\n\nIt'd be quite a stretch to argue that any of the comments I saw (and quoted, above) in those 30 question samples was even remotely close to the objectively rated Mechanical Turk \"snark\" comments. For one thing, many of the Turk examples contain actual expletives and/or overt attacks on the poster.\n\n<blockquote>\nIn the past, I’ve tried to post thing like “That works great, thanks!” and other users have edited my questions to remove it saying that it was “superfluous”.\n</blockquote>\nIn addition to your thanks, can you explain <i>why</i> it worked great for you? Were there any caveats or additional information you might want to add that could help future explorers get even <i>better</i> results?\n\nOtherwise, if all you have to say is \"worked, thank you!\" then use the giant upvote button. That is what it is for. See also: http://blog.stackoverflow.com/2011/01/how-to-say-thanks-in-an-answer/"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 31, 2012", "message": "<blockquote>IMO, If one of my “+1 Thanks” comments is removed, myself will be removed as well, because **the act of censoring friendliness is rude**.\n</blockquote>\nIf the rules of the game don't make sense to you, perhaps you are playing the wrong game?\n\n<blockquote>\nThe argument to *just upvote* is short-handed, because there’s no good way to see *who* upvoted. As such, “+1 Thanks” comments are indeed helpful. If you want to implement this as a feature to filter out these comments into another section, feel free.\n\nVotes are anonymous because they should speak to the <i>correctness</i>, <i>completeness</i> and <i>utility</i> of the question or answer. Votes are not intended to be pats on the back, but independent verification that the information presented can be verified to be objectively correct in <i>some</i> way, even if it is very small.\n\nI agree that public statements \"who upvoted/downvoted this?\" makes sense for a system based on opinions, but we do science-in-the-small here, not opinions.\n\nhttp://blog.stackoverflow.com/2011/12/dont-be-afraid-to-use-the-science/"}, {"author_name": "xaade", "gravatar_hash": "7e0f4fa88f1acd2e5464b5490c3fffa2", "author_url": null, "date": "Jul 31, 2012", "message": "@Jeff\n\nLet's have an experiment. Phrase your idea thusly, \"Don't say thanks, it's just useless fluff. Upvote instead\", and send that to Turk.\n\nGet back to me."}, {"author_name": "Cody Gray", "gravatar_hash": "3f8912af19fe86b7b34a0b011a962460", "author_url": null, "date": "Jul 31, 2012", "message": "Wait, so we're not supposed to leave comments like\n\n&gt; This isn’t a programming question, it is a psychology question. It doesn’t ask for an expl…\n\nand\n\n&gt; This is not correct, for many reasons, many of which were pointed out by plinth below...\n\nanymore?\n\nAll of our comments should now be in the form:\n\n&gt; +1 This is a good question. Great analogy! O_o\n\n? That's sad to see. If that's the direction we're now going, I don't think this is the site for me anymore.\n\nObviously leaving expletive-laded, personally insulting comments is bad. But I don't think anyone is contesting that, nor have they ever contested that. Those comments get flagged and deleted all the time. And considering that it isn't possible to reform everyone on the Internet, it's hard to see what this extended series of blog posts is intended to accomplish, other than alienate and offend dedicated users."}, {"author_name": "xaade", "gravatar_hash": "7e0f4fa88f1acd2e5464b5490c3fffa2", "author_url": null, "date": "Jul 31, 2012", "message": "@Jeff\n\nWhat I'm trying to get at, is if you're going to open Pandora's box on rudeness, then you need to include your objectivity into that evaluation.\n\nStringent rules are seen as unfriendly, and a negative stance of usefulness on friendly comments is going to be seen as rude.\n\nYou can't do both. You can't appear as friendly and cut down to objectivity. The goals are conflicting.\n\nI personally feel that the human-ness of friendly comments is necessary to appear user-friendly to new people, and I'd be willing to bet on that put to a vote."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 31, 2012", "message": "@JohnMcG\n\nRE the \"doing your job is being friendly\" comparison; that's a facile comparison. We're not being paid to answer questions. This is all for free, done by volunteers. Instead of \n\n\"Bringing customers their correct food order at a restaurant is being friendly already.\"\n\nIt's \n\n\"Bringing free food to the needy is friendly already\"\n\nWe're freely donating our time to help people. We are not performing a contracted service for payment. It's very different to expect extra friendliness out of a paid worker vs a volunteer worker. Realistically, *you* should be friendly to the volunteer, but neither of you should be jerks."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Jul 31, 2012", "message": "Jeff,\n\nYou're the one who is answering data with your subjective judgement.  Joel did the work and research.  He may have exaggerated a bit with his \"spend a few minutes\" comment, but your method of challenging it relied heavily on your subjective judgement that the comments were not unfriendly.\n\nAdmittedly my counter also relied on my subjective judgement.  The only one with a legitimate claim to evidence-based high ground is Joel.\n\n---\n&gt; If the rules of the game don’t make sense to you, perhaps you are playing the wrong game?\n\nYou also seem to be leaning heavily on the notion that this is the way things work around here.  We don't say \"thanks;\" we upvote instead.  But \"the way things work around here\" is precisely what is being challenged.\n\nTo phrase it your way, if the rules of the game are leading to sub-optimal behavior, perhaps we should re-consider the rules?"}, {"author_name": "mogged", "gravatar_hash": "03f501772c13dc573f78f08d9d83dcb0", "author_url": null, "date": "Jul 31, 2012", "message": "`In addition to your thanks, can you explain why it worked great for you? Were there any caveats or additional information you might want to add that could help future explorers get even better results?\n\nOtherwise, if all you have to say is “worked, thank you!” then use the giant upvote button. That is what it is for. See also: http://blog.stackoverflow.com/2011/01/how-to-say-thanks-in-an-answer/`\n\nWhile I understand that this works great for machines, my point was that when one is dealing with a human being, an anonymous/face-less/toneless numbers don't really make for a \"friendly\" environment. As I said before: \"I hate to be the one to point this out, but niceties go a long way towards improving the general friendliness of any given interaction. Maybe the decision to delete all niceties needs to be scaled back or made more reasonable than a 100% ban?\"\n\nWe're not all machines interacting through machines. We're people using machines to facilitate human interaction. A general rule of normal social interaction is that certain types of social lubricant are accepted and encouraged. Reasonable and small niceties are probably the quintessential form of this.\n\n\"Let's be more friendly\" and \"let's not waste any time on fluff.. get to the point, and don't bother with the social aspect\" are two ideas at direct odds with one another."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 31, 2012", "message": "@Cody Gray don't give up yet, there's no referendum requiring fluff or constant agreement with all other users. When there is I'll be one of the first out the door with you, but lets not assume anything to0 extreme; no policy has been laid down, just some research and some brainstorming."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Jul 31, 2012", "message": "If I were running a soup kitchen, and a volunteer came with the attitude that it was enough that they were there and providing food, and didn't need to treat those receiving food with dignity and respect, I would send him home."}, {"author_name": "Leongaban", "gravatar_hash": "ba93eff1cf83643769a0bf5f62156a48", "author_url": "http://leongaban.com", "date": "Jul 31, 2012", "message": "Whoa that is nuts! I've never seen comments like that on Stackoverflow, at least not on my questions or the questions I look up. Wondering which languages produces the most frustrated coders lol..."}, {"author_name": "DVK", "gravatar_hash": "f3d2c01f6f55bb34530fcbae9a39d285", "author_url": null, "date": "Jul 31, 2012", "message": "I agree with Cody Gray. The main thing this sort of \"let's punish people trying to straighten out bad posters asking bad questions\" campaign will result in will be less good will from people who bring in REAL value to the site - useful content. If someone gets run off from the site where they went **to get free help** by a snarky comment because they are acting like a vampire, I honestly don't see that as a  net net loss to the community.\n\nAnd to explain further Jeff's point that he didn't elaborate on, the damage from \"Thanks\" comments is that - my my experience - they VERY frequently correlate to NOT being up-voted by thanking person (and yes, I am correcting for 15rep upvote requirement in this assesment)."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 31, 2012", "message": "I feel I have to note that the \"unfriendly\" comments at the stop start with the very worst, and there are enough of them many people will skip over them. It sort of reeks of a nasty copywriting trick; leading in with the scary stuff, it's harder to notice that some of those \"worst of the worst\" comments (like Cody Gray and Robert Harvey brought up) actually aren't bad at all like \n\"This isn’t a programming question, it is a psychology question. It doesn’t ask for an expl…\"\n\nSo don't read too much into the \"80% haven't been deleted\". I would be very disturbed if Stack Exchange started removing comments simply stating why a question is off topic in non-offensive ways."}, {"author_name": "Nicol Bolas", "gravatar_hash": "7b1af0a134b3cf0892025b0ec4ba65a9", "author_url": null, "date": "Jul 31, 2012", "message": "&gt; If these were a new user’s first interaction with the SO “community,” (and remember, Jeff, you’re the one who kept pushing this term) would you want to come back for more?\n\nAbsolutely. Well, for me.\n\nIt would tell me that this is a place where we want *information*. It tells me that the community polices itself. It tells me that the community doesn't like duplicates. And so forth.\n\nI believe that friendliness can *only* be measured by context. That is, being friendly to someone who is a help vampire is helpful to no-one. If someone can't do their basic homework, can't put forth the effort to Google, won't read how the site works, or otherwise just wants others to think for them, why should we have to be \"friendly\" to them?\n\nIn short, I don't see what is wrong with being curt with someone who is not being a useful member of the site.\n\nExcessive friendliness has its downsides too."}, {"author_name": "Aaron", "gravatar_hash": "527a1486a2c5c6d1f9beb9a6a82834df", "author_url": null, "date": "Jul 31, 2012", "message": "Responding to @JohnMcG:\n\n\"To put it another way. If I’m at a movie theater, a couple holding hands is not a distraction; a couple arguing is.\"\n\nDo you think that's maybe, *possibly* because arguing creates noise which can't easily be ignored, as opposed to hand-holding which you don't have to look at?\n\nIf the same couple were having rough sex instead of holding hands, don't you think that would be equally distracting?\n\nDistractions are not inherently friendly or unfriendly. Unfriendly distractions will certainly make onlookers feel worse than friendly distractions, but our goal as a network isn't supposed to be to make people feel good, it's to solve their (programming) problems. Over the long haul, fuzzy-wuzzy smoochy-woochy carebear antics can easily drive people away - and also attract the wrong kinds of people, i.e. those with very thin skins who can't handle any kind of criticism in the form of downvotes or disapproving answers.\n\n\"Professional courtesy\" AKA \"polite but firm\" should be the name of the game here. As far as I know, we're trying to be the LinkedIn of Q&amp;A, not the Facebook."}, {"author_name": "Josh Caswell", "gravatar_hash": "79f438a6844f77869a79854eb9404aae", "author_url": "http://meta.stackoverflow.com/users/159251/problem", "date": "Jul 31, 2012", "message": "I'm in agreement with Ben Brocka: @JohnMcG, you keep using (here and on Meta) customer service analogies to describe Stack Overflow. This _isn't customer service_.\n\nAnalogies have a wonderful power to lead discussions off track. If _I_ were running a soup kitchen, and one of the volunteers was insisting on effulgently greeting every person who came in with a hug and a discussion, I'd tell her to stop holding up the line and get back to ladling. Hyperbole works on both sides of the argument.\n\nThe thing is, you're not arguing against a position that anyone holds. There's absolutely no reason to display or tolerate rudeness on SO. Neither is there any reason that interactions need to be full of smileys, \"thank you\"s, and pats on the back. The _useful, informational content_ is the point of this place. Civility and respect are absolutely required; a culture of rudeness will absolutely lead to destruction.\n\nAnother way to cause it at least serious harm (as Cody Gray has already said) might be to aggravate core users with paternalistic and unilateral bloviation about how rude the site is, when even one's own data does not support that position.\n\nIt's pretty unclear to me what the point of this \"Summer of Love\" thing is, but it's looking more and more like it's going to end up with some kind of an attempt at making the culture of SO more like \"customer service\", passed down from on high without much discussion.\n\nGranting the premise that there is troublesomely pervasive and active rudeness (which I dispute), it would be much better to ask _why_ it appears, and in response to _what_. Seeking and addressing an inciting factor would be far more productive than harangues about politeness.\n\nAlso, @JohnMcG, to answer your question \"Why I am I here?\" -- I'm here to help curate the most helpful resource I've ever seen for solving my programming problems."}, {"author_name": "Alok", "gravatar_hash": "41af8f18f236ae1719878c1028a2b623", "author_url": null, "date": "Jul 31, 2012", "message": "Seems this conversation has devolved to arguments on posting 'thanks' rather than the actual problem comments.\n\nThanks comments can be useless, but they're still way better than the outright rude ones that are there as examples (besides the ones pointed out by Robert Harvey which are actually quite neutral). Thankfully I haven't seen rude comments get upvoted often, though I am also guilty of not flagging them regularly as I should.\n\nI don't get where Cody Gray got the idea that '+1 would vote again' is specifically encouraged - can you mention which post suggests this? As for the two examples that shouldn't be considered negative, I'd agree with the first one but not entirely with the second ('pointed out by plinth below'), it is neutral but adds no information - he should just upvote plinth's comment instead.\n\nIf we're talking of fluff; another common pattern I notice is a long thread of comments that were helpful, and assisted someone to improve or change his question or answer - and now are irrelevant but weren't deleted."}, {"author_name": "Josh Caswell", "gravatar_hash": "79f438a6844f77869a79854eb9404aae", "author_url": "http://meta.stackoverflow.com/users/159251/problem", "date": "Jul 31, 2012", "message": "@Alok:<blockquote>Seems this conversation has devolved to arguments on posting ‘thanks’ rather than the actual problem comments.</blockquote>\n\nThat's because, first and most importantly, the problem comments are acknowledged to be a problem by <em>everyone</em> -- no one's arguing that rudeness is good. Second, because Joel <a href=\"http://blog.stackoverflow.com/2012/07/the-hunting-of-the-snark/?cb=1#comment-68537\" rel=\"nofollow\">has explicitly said</a> \"Personally I think that they [comments in the \"friendly\" list above] are a good thing and we want them\" when that is <a href=\"http://meta.stackoverflow.com/questions/139809/when-should-comments-be-used\" rel=\"nofollow\">contrary to their accepted use</a> on SO.\n\nAs a note, the \"pointed out by plinth\" comment is cut off above; it may be that there is useful expansion past the ellipsis."}, {"author_name": "Nicol Bolas", "gravatar_hash": "7b1af0a134b3cf0892025b0ec4ba65a9", "author_url": null, "date": "Jul 31, 2012", "message": "@JoshCaswell\n\n&gt; Second, because Joel has explicitly said “Personally I think that they [comments in the \"friendly\" list above] are a good thing and we want them” when that is contrary to their accepted use on SO.\n\n... and?\n\nJoel said \"Personally\" because that's what he *personally* feels. Nothing more, nothing less.\n\nHe never said that he wanted it to be a universal rule or anything; he just said that he doesn't believe that these are bad. Also, he never said that *every* comment \"in the 'friendly' list above\" was a good thing."}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": null, "date": "Jul 31, 2012", "message": "Joel, why not provide moderators with a tool to see all comments with more than 3 up votes on posts that received more than one down vote?\n\nThis would tell us if the theory (suggested by several) of users up voting instead of flagging snarky comments has weight and allow us to take immediate action while investigating.\n\nStack Overflow should be a little intimidating from the perspective of a new user, if only to encourage them to look around and see how things work. Someone should be thinking 'If I don't write clearly I'm not going to get any help'. However, we can't tolerate rudeness that is visibly cherished through voting."}, {"author_name": "roast", "gravatar_hash": "a5b360ad26b73bce949840a1450b57dd", "author_url": null, "date": "Jul 31, 2012", "message": "Joel, don’t be a f___ing lamer. (kidding)"}, {"author_name": "Heartland Hannah", "gravatar_hash": "7acb2a304b927a8552ae6fec87191a40", "author_url": null, "date": "Jul 31, 2012", "message": "Temper tantrums aren't welcome, I think everyone agrees with that.  But is is hilarious that those arguing the most against rudeness are being the MOST rude in their commentary in this forum here.  And making their attacks against the other users personal.  Perhaps those of you that protest the most need to consider how you are coming across?  As in I wouldn't give any of you smiley faces - especially those who are leaving in a huff become someone dares to disagree with them.  Sigh..."}, {"author_name": "Nicol Bolas", "gravatar_hash": "7b1af0a134b3cf0892025b0ec4ba65a9", "author_url": null, "date": "Jul 31, 2012", "message": "&gt; Golden piece of evidence of lack of sense of humanity in you guys. You think of some rules, you’re stuck on the idea that you’re right about it. If people disagree, you ask them to buzz off.\n\n... what? I know Hassan can't read this (assuming he was serious about leaving because of a comment on a blog post), but this is for anyone else who agrees with this.\n\nRules exist to serve the spirit that engineered them. Thus, re-evaluating a rule to see if the rule is properly serving that spirit. So let's talk about the spirit of Stack Overflow.\n\nStack Overflow does not exist to create a community; it exists to create *information*. That is its purpose. If there is a community here, it is only as a necessary evil.\n\n2 years from now, your \"+1 thanks!\" comment will be completely meaningless. The person reading it doesn't know you or the person you're talking to. What *they* will see is a question with an upvoted answer, possibly accepted. Because they're not interested in the community; they're here for *information*.\n\nInformation needs to be dispassionate.\n\nPoliteness is not a bad thing, when dealing with people. But we're *not* dealing with people. We're dealing with questions and answers. The entire Stack Exchange system is designed to make this exchange as impersonal as humanly possible. Because once it starts getting personal, people start getting chatty. People start getting personally upset when someone downvotes one of their questions/answers. And so forth.\n\nIn short, it starts becoming a forum.\n\nNo matter how nice, friendly, genuinely courteous your comment is, if it is not in some way contributing to the generation of good information, it is noise. Anything that is not information, or something needed to *create* information, is by definition unwanted. It takes up time from every reader who reads it.\n\nSuch comments have value only for two people: the person making the comment (who feels better about themselves for thanking them) and the person receiving the comment.\n\nNow, you could argue that it has value for anyone who feels warm and fuzzy when they see one person thanking another. It creates a friendly atmosphere. Who feels that this makes the atmosphere more comfortable. Well... that's not a good thing. Because again, this *encourages* that behavior, leading to much more chat and much less info.\n\nStack Overflow should not have a friendly atmosphere. It should not have a harsh atmosphere. If it must have an \"atmosphere\" at all, it should be of professionalism. Cold and clinical. You're here to give and get information; you don't care who gives it or who takes it.\n\nThe rules against \"+1 thanks\" comments exists to prevent the decay from cold information to chatty forum-like behavior. I believe that it serves this purpose well."}, {"author_name": "skinnytod", "gravatar_hash": "e2aa4cd8ca03c4b2f71c6443f6e437b1", "author_url": null, "date": "Aug 01, 2012", "message": "<blockquote>\nStack Overflow does not exist to create a community; it exists to create *information*. That is its purpose. If there is a community here, it is only as a necessary evil.\n</blockquote>\n\nI'm sorry but that is pure Asperger's arrogance (and I mean that in every possible way anyone wants to interpret it) and as a participant in SO I find that point of view incredibly offensive. I have restrained myself from responding to insulting comments like <i>\"If the rules of the game don’t make sense to you, perhaps you are playing the wrong game?\"</i> along with some others, like the inane comparison of SO to Harvard, but the quote about just really galls me.\n  \nIf SO has some presumption to being some sort of pure \"knowledge base\" then it is laughably broken and incomplete. At best it is a <b>feeder</b> to a possible knowledge base. It is worthwhile? Yes. Is it helpful to users? Yes. But please, let's not encourage some fantasy that it is any more than a collection of ephemeral questions of varying clarity, with answers of varying quality and correctness. It is not <i>small science</i> (whatever the frack that was supposed to mean). It is simply a forum with some rules. That's it. That's all.\nThe quote above and the rest of the post from <i>@Nicol Bolas </i> and along with others expressing similar points of view is <strong>future oriented</strong>: that someone will come by at some ideal future time and see expressions of thanks, etc. as merely crumbs on the keyboard, annoying litter left by the last users at the picnic table. But we humans ask and answer questions in the <strong>present</strong>. I appreciate hearing if my answer helped and I am glad to let someone know that their efforts helped me. My prime motivation for helping someone is not getting some meaningless &quot;rep&quot; points or silly &quot;badges.&quot; Sure, those are a fun game at first but they are a side issue and hopefully not what truly motivates someone to contribute to SO.\nMost users come with their questions to help them with a problem they face in the present. Those of us who may have more experience answer in the present. We don't do it to build a &quot;knowledge base&quot; for some ideal future. We do it to help someone, just as we have been helped. This is called &quot;community.&quot;\nIf SO/SE wants to build knowledge bases, I wholeheartedly support that, and have posted my suggestions on Meta numerous times. It is not going to work by doubling down on the existing rigid rules. There needs to be a process separate from the feeder Q+A which elevates questions and answers to canonical status and then applies the stylistic and technical editing efforts which, in my opinion, are mostly wasted on the raw feeder Q+A.\nSummer of Love? Reading most of the comments here, it feels more like Alamont."}, {"author_name": "James Mortensen", "gravatar_hash": "d4518e6223a1a82f53dc4919d0165151", "author_url": "http://pm.stackexchange.com/users/34/jmort253", "date": "Aug 01, 2012", "message": "Try this as an experiment. Go find a friend who is just learning to program, such as a nephew, the neighbor kid, your aunt, or someone volunteering their time to work on their church website, and have them post a question on Stack Overflow. \n\nDon't help them. Instead, do a hallway usability test, not by watching what he or she does on Stack Overflow, but on your friend's **reaction** to Stack Overflow.\n\nFrom @jalf:\n\n&gt; \"You know how the place works, people know you and generally respect you. You have a high rep and a little diamond next to your name. So yes, of course the place is lovely to someone like you (and, generally speaking, to me, and most other regulars) But not everyone is in our position. Most likely this effort is because of how people who are not in your position, who are newcomers to the site, or who have been turned away ... by the feeling that they’re just not welcome.\"\n\nAs someone with plenty of experience on Stack Overflow, I was *relieved* when my friend's question was migrated to Database Administrators. A few DBA members even offered to work with her in a chat to help her troubleshoot her problem. I was glad that the DBA site was her first experience with the network, because it was clear that she would be treated with the respect she deserved, even if she didn't yet understand the rules."}, {"author_name": "Nicol Bolas", "gravatar_hash": "7b1af0a134b3cf0892025b0ec4ba65a9", "author_url": null, "date": "Aug 01, 2012", "message": "&gt; It is simply a forum with some rules. That’s it. That’s all.\n\nIf SO were just \"a forum with some rules\", then odds are good none of us would be here.\n\n&gt; Most users come with their questions to help them with a problem they face in the present. Those of us who may have more experience answer in the present. We don’t do it to build a \"knowledge base\" for some ideal future. We do it to help someone, just as we have been helped. This is called \"community.\"\n\nThe point of the whole Q&amp;A thing is to *trick* people into building a knowledge-base by formulating it in a Q&amp;A style. If all you are doing is helping one person with their personal problems, you're using SO wrong.\n\nThere is a reason why we have \"too localized\" as a closed reason: because such questions only will be helpful to that person and no one else. The reason we have voting by people who aren't the asker is because we want the community's input. And if the community thinks the wrong answer was accepted, it can make its voice known.\n\nThat's not for the benefit of the person being \"helped\"; it's for the benefit of anyone who follows later and reads the questions/answers. If what we did was only to help someone in the present, we wouldn't need voting at all.\n\nIt is important to understand the difference between \"help\" and Q&amp;A. \"Help\" is something that requires dialog, which SE's Q&amp;A methodology expressly forbids (or at least channels, redirects, and minimizes). SE doesn't provide \"help\"; that's not its purpose.\n\n&gt; Go find a friend who is just learning to program, such as a nephew, the neighbor kid, your aunt, or someone volunteering their time to work on their church website, and have them post a question on Stack Overflow. \n\nIf you're \"just learning to program,\" you don't need Stack Overflow. You need someone who's going to sit down with you and teach you stuff. You need someone who is going to stop and figure out what you really mean by your question by engaging in a dialog with you.\n\nIn short, you need *help*, not Q&amp;A. SO is not intended to be all things to all people. This is exemplified in your DBA example; your friend needed someone to engage in a dialog with in order to get her problem fixed.\n\nQ&amp;A isn't about dialog.\n\nThat's why we close broad questions that are typically asked by people \"just learning\": 'how do I make a website?' and so forth."}, {"author_name": "James Mortensen", "gravatar_hash": "d4518e6223a1a82f53dc4919d0165151", "author_url": "http://pm.stackexchange.com/users/34/jmort253", "date": "Aug 01, 2012", "message": "&gt; \"If you’re “just learning to program,” you don’t need Stack Overflow. You need someone who’s going to sit down with you and teach you stuff. You need someone who is going to stop and figure out what you really mean by your question by engaging in a dialog with you.\"\n\nOkay, then do what I did, go find a colleague who hasn't ever posted on Stack Overflow. My friend was trying to solve a database problem, she was hardly a beginner to programming, just a beginner to Stack Overflow.\n\nGo on, try it. Then come back and tell us how you felt when that person hit the submit button.\n\nOh, and no helping them! You're not allowed to explain the rules to them. A valid hallway test involves a user having no prior knowledge of the platform. Good luck! :)"}, {"author_name": "James Walford", "gravatar_hash": "a1865886e832b2f8681e3ecd7ae9bc01", "author_url": "http://stackoverflow.com/users/528656/james-walford", "date": "Aug 01, 2012", "message": "I totally agree that friendly fluff is fine. If someone has gone out of their way to help me then I'd like to be able to thank them for it. Letting people know their input has been valued is far more important than trimming out all \"noise\".\n\nIt's also worth noting that if information in a coment is important to understanding a question or answer then really that information should be in the question or answer. Most users gain the privilige to edit fairly early on - so why not use it? If you want a repository of well written useful questions and clear informative answers and are frustrated that the important information is drowned out by debate forum style \"fluff\" then make sure the information is put in the right place."}, {"author_name": "tripleee", "gravatar_hash": "c82d817971b93cb22cc590612c8582a5", "author_url": null, "date": "Aug 01, 2012", "message": "The task was not to gauge usefulness, it was to gauge the friendliness of the tone.  A friendly but useless message is still friendly.  A rude but highly informative, on-topic, and accurate reply is still rude.  If you can be friendly and still be informative, on-topic, and accurate, that would be ideal, but friendly is probably the only factor that can be affected by pure will-power."}, {"author_name": "xaade", "gravatar_hash": "7e0f4fa88f1acd2e5464b5490c3fffa2", "author_url": null, "date": "Aug 01, 2012", "message": "@NicolBolas \n&gt;2 years from now, your “+1 thanks!” comment will be completely meaningless. The person reading it doesn’t know you or the person you’re talking to. What *they* will see is a question with an upvoted answer, possibly accepted. Because they’re not interested in the community; they’re here for *information*.\n\nBut what you fail to realize is that the persons currently asking and answering questions, won't stick around if that help isn't appreciated. Maybe you should have people police comments once a question reaches a certain age so the fluff is removed. Or have a different style of comment that has an expy date. (Novel).\n\nIf you kill the human spirit, then you will find there are no humans using your site.\n\nThis will never be tricked into a knowledge-base. It will always be solving problems Q&amp;A. Knowledge-bases don't solve problems; they provide minimal data, and are plagued with \"not helping anyone\".\n\nWhat you're really hoping for, is that a question and answer is useful to many people. The chance that if someone had to change a radiator in a Ford F150, that someone else will too."}, {"author_name": "Michael A. Smith", "gravatar_hash": "fd9f67766f4db58b520e730d16ed6872", "author_url": null, "date": "Aug 01, 2012", "message": "Joel says:\n\n<blockquote>I think this proves that the methodology is reasonably sound. I think everyone can agree that the Mechanical Turk reviewers… [produced] results that seem to agree with how we, inside the community, would judge the comments.</blockquote>\n\nWhere does the methodology demonstrate this? It's evident from the comments to this blog post that *we, inside the community* disagree significantly with the ratings of several of the comments posted."}, {"author_name": "ChrisF", "gravatar_hash": "8d450f5636c06655f01d530470154fd9", "author_url": null, "date": "Aug 01, 2012", "message": "Surely all that's required is a big notice on each and every page that says:\n\n&gt; If you see a rude comment flag it for moderator attention.\n\nOK, I wasn't being totally serious about the notice being on every page, but we have the tools to keep the site \"clean\" already. We need to encourage people to use them.\n\nAlternatively implement a rule that says if a comment gets more than 5 rude or offensive flags it's auto deleted. We already have auto deletion for comments that complain about people's accept rate so the code already exists.\n\nAt the moment \"rudeness\" is seen as allowed if not acceptable because of the number of upvoted snarky comments. If people don't see rude comments on the site hopefully they'll be less likely to post a rude comment themselves."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 01, 2012", "message": "&gt; I’m sorry but that is pure Asperger’s arrogance (and I mean that in every possible way anyone wants to interpret it) and as a participant in SO I find that point of view incredibly offensive.\n\nDo you even read what you write? The thing I find most offensive in this whole discussion is how rude (or blatantly and deliberately offensive) many people are when telling others they should be rude. Agreed wholeheartedly with @Heartland Hannah. Many of those claiming SE is \"rude\" seem to be making an extremely emotional claim, often based on SE's policies rather than the actual rudeness of what people say.\n\nRobert, Jeff and others have been very cool-headed and rational when making their points. I wish the other side of the conversation would do the same."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 01, 2012", "message": "@ChrisF comments with 3 or more unhandled rude/offensive flags are already auto-deleted (as with other comment flags). Only time it takes more flags is if the comment is highly voted."}, {"author_name": "ChrisF", "gravatar_hash": "8d450f5636c06655f01d530470154fd9", "author_url": null, "date": "Aug 01, 2012", "message": "@BenBrocka - in that case we come back to my tongue-in-cheek suggestion of a message on every page :)\n\nSeriously though we need to educate people that they can and *should* flag rude and/or offensive comments."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Aug 01, 2012", "message": "Let me back up a bit.\n\nWhat the data demonstrates is that a small but significant percentage of comments are deemed offensive by a set of neutral observers.\n\nThis is unacceptable to the SE staff and to a good portion of the SO/SE community.\n\nObviously, nobody is actively encouraging comments like the ones listed, but for some reason, people feel like they can do it.\n\nWhy?  That's the big question.  It could just be the Internet anonymity that brings down all sorts of online commenting platforms.  \n\nBut I submit that there has been a cultural drift in SO/SE over the years.  That with the noble purpose of building a knowledge base that will be generally useful, we have adopted an attitude of ruthlessness toward any content that is not likely to be useful long term.  This takes many forms -- from the speed with which off topic questions are closed and deleted, the purging of historical questions, to discouraging social niceties that do not add content.\n\nAs a result, this has become a less pleasant place to be, both for veterans and new questioners.  \n\nHow big a problem is this?  I don't know.  A peak at the front page shows no shortage of questions, including those from relative newcomers.  But IMO, it leaves SO open to competition that is a bit more welcoming of their participants as human beings, rather than cogs in a content machine.  Apparently, it's a big enough deal that it has attracted the SE's attention.\n\nSo, I think it's worthwhile to consider a course correction. Not to a complete \"every comment must have 15 pieces of friendly flair\" caricature of fake cheer, but not the Soup Nazi either.   That instead of actively discouraging social nice words, we can tolerate them.\n\n--\n\nOn a side note, I wonder if it would be worthwhile to fork the Q/A and \"knowledge base\" concepts."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Aug 01, 2012", "message": "@JohnMcG: SE's data does not back up your assertions.  SO is becoming a friendlier place; see http://blog.stackoverflow.com/2012/07/week-2-of-the-summer-of-love-researching-comments/"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 01, 2012", "message": "I can't seem to understand why I cannot leave a friendly comment.  Or as Jalf put it, \"+1 that's an interesting question\".  If it's such a problem then why do we even call it a \"Comment\".  In fact, after I read this blog post at the end of it clearly says \"Leave a comment\".  If I want to leave a comment (not a rude one, but a good one) allow me to leave a comment.  It is my choice, and sometimes I may up vote the question / answer (as Jeff mentioned click the little up arrow).  But, Jeff other times I do not want to up vote it, its my personal decision.  I have the right to up vote or not.\n\n@Jeff, the whole test you just did in a \"few minutes\" reeks.  It definitely doesn't generalize the stackexchange community and it doesn't come close to why Joel has brought up this topic.  Joel sees there is an issue, and he's done a very good job presenting it.  You have to stop taking it to heart so much.  Your answers suggest that your way is the only way and based on these blog posts I am seeing a lot of people do not agree with you.  The meta people will hate it, some mods may hate it, but at the end of the day you have to cater to your customers (we the end users).  If that means change - so be it...if you don't want to change then you are left with a bunch of moderators and meta folks arguing about why a question needs to be closed or flagged."}, {"author_name": "Will", "gravatar_hash": "3568876d79f0551ec5d77652eb8ae9ef", "author_url": "http://statestreetgang.net", "date": "Aug 01, 2012", "message": "\"Of 7000 comments submitted, 557 were rated as “friendly” by 75% of more of the reviewers.\"\n\n6725 were flagged as \"chatty\"."}, {"author_name": "Jon", "gravatar_hash": "623b6f40a1c66b943ce27f9c38661065", "author_url": null, "date": "Aug 01, 2012", "message": "There is nothing more annoying than googling a problem, then seeing a forum type result as the first result, with your question followed by a \"dude, can't you use google\" response."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Aug 01, 2012", "message": "@JonH: You seemed to have glossed over the part where Jeff says \"If you're going to leave a friendly comment, include some content.\" \n\n\"+1 that's an interesting question\" doesn't say anything.  Sure, it demonstrates that you are friendly, but can we all just agree that you are a friendly sort?  I am friendly because I contribute content and help keep the site clean.\n\nHow about saying \"This is an interesting question, because...\" and give a reason why you think the question is interesting?  Then, at least your comment is not content-free.  \n\nI personally may not find the question particularly interesting at all, and I don't get to have my say because my comments are not supposed to be negative."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Aug 01, 2012", "message": "@Robert_Harvey\n\nWe are aware that you would like us to include some \"useful\" content with complementary posts.  We are challenging that.  We may be wrong, but simply repeating what the current norm is is not going to demonstrate that.  The current norm is what has led to what is perceived as the problem.  You can confront that by either disputing that there actually is a problem, or by challenging the link between the norm and the problem.\n\nAnd I don't find your claim to disenfranchisement terribly compelling, particularly in the face of all the tools you have at your disposal to express your disapproval of a question.  In most social situations, I am permitted to compliment someone's clothing, but not permitted to criticize it.  I and most people don't find this terribly stifling."}, {"author_name": "anonymous coward", "gravatar_hash": "647bdd327b24597c169bdf89aa465981", "author_url": null, "date": "Aug 01, 2012", "message": "Feature request: downvotes for blog posts. Oops, I guess that wasn't friendly."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Aug 01, 2012", "message": "@JohnMcG: Well, you can't have it both ways.  Either you endorse comments as a feedback mechanism (both positive and negative) and allow me and others to voice our opinions good or bad, or you allow the tools to speak for themselves.  Allowing only feel-good comments and suppressing the opinions of those who disagree is disingenuous.\n\nFree speech is only free speech until it becomes inconvenient, at which time it becomes \"You can have your free speech, but only if I like it.\""}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 01, 2012", "message": "@Robert Harvey,\nSo you want a system that appears to be coming from machines rather then humans...*sigh* why do we even bother, you probably work out of a cave too?  \n\nMe: \"Wow, what a nice shiny red car\"\nCar Owner: \"You can't say that unless you give me a reason why you think its nice and shiny...\"\n\nCase closed!"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Aug 01, 2012", "message": "Despite efforts by some to turn Stack Overflow into another Facebook, my position still stands.  \n\nStack Overflow is about collecting useful programming information, not engaging in pleasant banter.  It is carefully crafted to optimize for signal and reduce noise as much as possible.  It is a successful response to the vast wasteland of banality we call Internet Forums, and is antithetical to the entire notion of social networks. \n\nIf you want to be social, do it in Chat.  That's what it is there for."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 01, 2012", "message": "@Robert Harvey - You don't open chat sessions to questions to simply say thank you.  Show me in the FAQ where it says that.  This isn't facebook,  not even close to facebook, that was just silly to say."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Aug 01, 2012", "message": "My position isn't to \"suppress\" anything.  My position is to relax the established norm on the SE/SO forums against purely social comments.\n\nAnd, yes, I can have it both ways.  I support the societal norm that compliments of acquaintances are welcome but insults are not.  It looks like I have that in common with almost everyone else.  That doesn't mean I want to \"suppress\" insults and throw people in jail. Just that I support nudges toward being nicer to each other.\n\nAnd I have to add that it is extremely odd for someone to on the one hand to support a very strict definition of what content is appropriate for SO/SE and then claim the mantle of free speech for the content he wants to write.\n\nThis isn't about \"free speech.\"  This is a a cultivated forum, that will allow the content the employees and community allows.  Nobody believes that, for example, spam, should be allowed to remain on the board because of free speech.  SO/SE bought this microphone; they get to decide how it's used, and the rest of us can decide whether those restrictions are ones we can live with.\n\nIf you would like to start your own blog where you criticize every SO question you find objectionable, you are free to do that.  It seems to me the problem isn't the ability to express your criticisms, but to have and *audience* for them. \n\nAnd I am aware that you would prefer that social content be ghettoized to chat.  That hasn't worked, for a variety of reasons.  Again, we're here because there's a perceived problem.  Pointing out the existence of tools that have been ineffective at addressing the problem does not move the conversation forward."}, {"author_name": "Josh Caswell", "gravatar_hash": "79f438a6844f77869a79854eb9404aae", "author_url": "http://meta.stackoverflow.com/users/159251/problem", "date": "Aug 01, 2012", "message": "It sure would be nice if the guy who started this -- Joel -- actually got involved in this discussion. Perhaps my verbiage above, \"paternalistic and unilateral bloviation\", was over the top, but I say that because nearly every time I see Joel make a Meta post, he drops his opinion, then largely ignores questions and responses. The same seems to be happening here.\n\n---\n\n@Nicol, re your \"...and\": Joel's opinion seems to count for something around here (in fact, seems to be the driver behind the \"Summer of Love\"), so that's one reason that the conversation has moved from \"rude is bad\" to \"thanks are wanted\". (As I said, the more important reason is that nobody disagrees that \"rude is bad\".)\n\nVery much in agreement with your last two comments, especially this bit: <q>The point of the whole Q&amp;A thing is to *trick* people into building a knowledge-base by formulating it in a Q&amp;A style.</q> That's it <em>exactly</em>!\n\n@skinnyTOD: This is now the second time that I've seen you imply that a person is mentally ill, during a discussion saying that rudeness is pervasive and should not be tolerated. (The other was addressed to me, in a comment attached to a now-deleted question on Meta.)\n\nI do, however, agree with your statement <q> At best it is a feeder to a possible knowledge base. ...let’s not encourage some fantasy that it is any more than a collection of ephemeral questions of varying clarity, with answers of varying quality and correctness.</q> What it is in actuality absolutely differs from the ideal, which will never be reached. The important thing is to keep the ideal in mind as a motivation, and keep moving towards it -- which leads to proposals like \"canonical questions\"."}, {"author_name": "skinnytod", "gravatar_hash": "e2aa4cd8ca03c4b2f71c6443f6e437b1", "author_url": null, "date": "Aug 01, 2012", "message": "Then perhaps what is needed here are <i>\"evaporating\"</i> comments which automatically disappear after a week (or are relegated to some back link). \n\nThis would serve those who are <b>future focused</b> and don't want any trace of process or community to linger on the site, also serve those of us who are <b>present focused</b> and feel the need to give and receive some personal expression when appropriate.\n\nWouldn't this satisfy both points of view?"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Aug 01, 2012", "message": "\"... don't want any trace of process or community to linger on the site ...\"  That's a bit extreme.  Nobody is saying not to be nice.  Be nice, but do it in a way that contributes to the site, using the established channels.  Upvoting is nice.  Writing constructive questions is nice.  Using proper grammar and punctuation is nice.  \n\nSaying \"+1, would vote again\" only draws attention to yourself, although it is humorous.  It is humor that is lacking nowadays, because people are too sensitive.  This is why we can't have nice things."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": "http://thinelamay", "date": "Aug 01, 2012", "message": "Keeping the place clean is... Nice."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 01, 2012", "message": "To me the place is clean enough, the argument about it being so hard to find an answer amongst all the litter (comments) is blasphemy.  I don't know about you but the answer is listed first and has a solid green check mark next to it, how hard can it be ?  A comment is just that a comment, if I want to say \"+1 nice job I find this interesting.\" how am I trying to draw any attention to myself?"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Aug 01, 2012", "message": "The place is clean because a number of community members have graciously donated their time to help sweep the floors.  That's being nice too.\n\nLet me be clear about this. Comments have one sanctioned use: clarifying a post.  That's it.  Say thanks if you must (I don't particularly care one way or the other), just don't be surprised if your comment doesn't stay permanently affixed to the site."}, {"author_name": "Ben Barden", "gravatar_hash": "e78b25c29a4a45b332aecb69a42992e4", "author_url": null, "date": "Aug 01, 2012", "message": "I note a misperception.  There is an idea that comments that contain friendliness and perhaps a bit of humor and nothing else (\"Thanks\", \"+1, would post again\", and so forth) bear meaning only for those who write them and whoever they are directed to.  This is incorrect.  These comments are also of value in setting tone, in establishing community standards by implication, and in either drawing people in or driving them away.  At a basic level, this has become a discussion of how SO should feel.  Should it be a warm, fuzzy, personable place, where people enjoy being helpful to each other, or should it be a colder, cleaner, more rigorously defined space where subject matter experts demonstrate that expertise to the benefit of those petitioners who are able to demonstrate their worthiness to be helped?  Obviously, there's a continuum, but it seems that the whole \"Summer of Love\" push is an attempt to move us away from the latter towards the former."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Aug 01, 2012", "message": "I would be perfectly happy if people would simply flag the snarky comments instead of upvoting them.  That is all that is necessary here.  \n\nThe warm fuzzy content-free comments I'm neutral about; they are not actively harmful, but they are also completely unnecessary. Comments do not set the overall tone of the site: good content does.  \n\nThe fact that you got your question answered, or you helped someone get an answer to their question, should really be thanks enough."}, {"author_name": "Ben Barden", "gravatar_hash": "e78b25c29a4a45b332aecb69a42992e4", "author_url": null, "date": "Aug 01, 2012", "message": "Comments do set the overall tone of the site.  They don't contribute to the quality of the site as an information source (which is what most of us, myself included, are most interested in), but they definitely contribute to tone.  There are a lot of subtle social cues that people use to determine what sort of a place they're in, what the social norms are, and how they should act within it.  In an online community like this, most of those cues come from things like the comments people post.  A SO that is focused entirely on efficiently exchanging data feels very different from one where people take a bit of time to express appreciation of one another - and for many people while the little numbers on the side are nice, they're not the same as a personalized note.  Note here that I'm not advocating for any particular tone.  I'm just saying that there is a difference in tone, that a fair percentage of the populace can pick up on, that will affect their experience of SO, their attitudes towards it, how they comport themselves while here, and how long they stay.  I'm saying that the discussions/arguments here *are*, in general, over what that tone should be (to oversimplify: business-like, efficient, and somewhat exclusive on the one side; warm, friendly, and welcoming on the other) and that discussions and debates of this nature are really far more effective at coming up with useful insights when people actually realize, accept, and acknowledge what the discussion is about."}, {"author_name": "Ben Barden", "gravatar_hash": "e78b25c29a4a45b332aecb69a42992e4", "author_url": null, "date": "Aug 01, 2012", "message": "@Robert_Harvey - to clarify, I'm not pointing specifically at you when I say these things.  I'm seeing this misperception (or apparent misperception) in a fair number of people on both sides of the discussion."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 01, 2012", "message": "\"...just don’t be surprised if your comment doesn’t stay permanently affixed to the site.\"\n\nAnd when it comes time to vote off a mod, you won't have my vote."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 01, 2012", "message": "Sorry:\n\nvote off / vote for / And when it comes time to vote for moderators, you won't have my vote."}, {"author_name": "PaulSM", "gravatar_hash": "4db993d6b09e27bd6205bc13d6672ce0", "author_url": null, "date": "Aug 01, 2012", "message": "@JonH: +1, would vote again ;)\n\nFor the irony-impaired among us, let me just say: I *agree* with you."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Aug 01, 2012", "message": "Moderators aren't re-elected: their election is permanent.\n\nHowever, you can still request removal of a mod.  Give it your best shot; email to team@stackoverflow.com.  Be prepared to provide supporting evidence."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 01, 2012", "message": "I think by now these blog posts have created more animosity amongst the community than a few hundred comments on random questions ever could."}, {"author_name": "Chris", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.yetanotherchris.me", "date": "Aug 01, 2012", "message": "I mean really, WTF?"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 01, 2012", "message": "\"Moderators aren’t re-elected: their election is permanent.\"\n\nAnd here lies one major problem."}, {"author_name": "xaade", "gravatar_hash": "7e0f4fa88f1acd2e5464b5490c3fffa2", "author_url": null, "date": "Aug 01, 2012", "message": "@RobertHarvey Never said it had to stay permanently affixed. Matter of fact, I suggested a comment type with an expiration date.\n\nThat would be fine with me.\n\nI don't want my \"+1 ...\" Comments to stay forever. But I also don't want my \"+1 Thanks! thoroughly answers question.\" and \"+1 Also see [question] which has other helpful hints.\" to be ruthlessly deleted because nice is fluff.\n\nI think it's pretty rare I have no reason to say \"+1 Thanks.\" But when I do, I'd like to have the option of setting a 3 day expy on it.\n\nWhen we talk about unhelpful, I see up/down-voting without comment as unhelpful."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Aug 01, 2012", "message": "It was my understanding that there should be no expectation that comments (good, bad, or indifferent) should be permanent."}, {"author_name": "WendiKidd", "gravatar_hash": "5681f9a67cab8b97d0cda310990acccd", "author_url": "http://stackoverflow.com/users/1023783/wendikidd", "date": "Aug 01, 2012", "message": "@Everyone: Can we not have differing opinions without attacking each other?  I think we all agree that rude comments on SO are counterproductive; so are rude comments to this post.  We're not going to draw any useful conclusions from this discussion if we don't try to have it professionally.\n\nRegarding 'fluff' (for lack of a better word) comments, I have to say I'm curious: what harm do they do?  I've seen the argument mentioned that they cloud the signal-to-noise ratio, but I'd argue against that.  The answer is quite clearly separate from and above the comments posted on it.  If accepted, it has a bold and obvious green check mark next to it and floats to the top of the page.  The answer itself seems quite obviously placed, to me.  If you have something important to add to the answer, propose an edit.  I'd much rather that all content required of the answer was placed *in the answer*, and that comments were just that--comments on the post.  I'd argue that the format of SE is such that all pertinent content ought to be contained within the question and the answer, and that you shouldn't need to read the comments to understand them.  That's a major reason why we have the editing system after all, right?  To improve relevant content after it's been posted?  If comments are supposed to contain answer-relevant content as well, why can't we edit them?  I'd say the fact that we can't shows a fundamental distinction between their purposes.\n\nOpen to hear opposing viewpoints.  Let's please try and be kind to one another? :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 01, 2012", "message": "<blockquote>\nTo phrase it your way, if the rules of the game are leading to sub-optimal behavior, perhaps we should re-consider the rules?\n</blockquote>\nPer:\n\nhttp://www.quantcast.com/stackoverflow.com\n\n(set range to 1y or all, or whatever you like)\n\nFrom the beginning Stack Overflow was predicated on some rather strict rules and ongoing moderation to keep the signal-to-noise ratio unusually high. It seems to be working so far."}, {"author_name": "Jeremy", "gravatar_hash": "e0f502a6b3a7c216b85ed88d3d0b2799", "author_url": "http://AppointmentsBook.com", "date": "Aug 01, 2012", "message": "Hi Guys, I know this study `does` hold value but the bottom line is  90% of comments are neutral!!! I'd prefer to know about the other 90%? what info does that hold??\n\nWould thee results from programmers in-context yield better metrics? \n\nIf you agree the answer is to get the community to review anonymously.\n\nI am suggesting a new feature in the `Review` page, similar to how `suggested edits` moderation works. You get users with &gt; 3000pts to review questions they haven't yet seen. Redact all the names/signatures in reviewer mode so that results aren't biased. Then you could get stats for 'Helpfulness','Useless comment','Snarky','Rude but not on report','GET THE POPCORN!' etc. The trick is if a reviewer tried to view the page to see the redacted names during the review, then their review on that Q &amp; A would be invalid..."}, {"author_name": "Benjol", "gravatar_hash": "501465a53bf1042de206d7d79cc68942", "author_url": null, "date": "Aug 01, 2012", "message": "So we have a choice between flaming dog poo and useless crap? \n\nHow good can things get? :)\n\nI completely understand the point of view of all the people here 'lobbying' for niceties, but I think it should be clear that these are not two competing views of what SO <em>is</em>. \n\nSO as it currently stands <em>is</em> the no-noise, no-frills, Q&amp;A site that several people here have already set out quite clearly. You may well disagree with that, but if so, you are the one asking for change, and you are the one who needs to convince, persuade, and bring forward some cogent arguments (or 'science', if you will).\n\nUnfortunately, the 'it will scare people way' argument, though possibly true, is difficult to quantify, and, as you may have noticed, is water off a duck's back to those in favour of the status quo. Because the new users, and new questions, just keep on coming. Personally, I can cope with the 'robotic coldness' because I <strong>need answers to my questions</strong>.\n\nThat said: I think that having 'noise' comments automatically expire after a given period could be a good compromise. Unfortunately, <a href=\"http://meta.stackoverflow.com/q/140703/130064\" rel=\"nofollow\">Pekka's suggestion</a> didn't get a lot of love."}, {"author_name": "SoboLAN", "gravatar_hash": "8feac14b86e6408e19694122993e7935", "author_url": null, "date": "Aug 02, 2012", "message": "If this whole thing (evaluation of comments) is/was just out of curiosity, then please disregard the next few paragraphs.\n\n-----START OF ANTI-MICRO-MANAGE MESSAGE------\nI don't know why you're suddenly obsessed with the topic \"friendliness of comments\". There are hundreds of thousands of members on SO, there are thousands and thousands of questions/answers posted DAILY. Most of them remain on the site (they are not deleted or moved to other sites in the StackExchange network). It's obvious to anyone that there will be a big number of unfriendly/evil comments.\n\nThis is the Internet. Nothing has changed. Nothing will. DO NOT start to micro-manage this. You will fail. It's just too big. And even if you succeed somehow, you're going to kill SO in the process.\n\nWhat you see in the questions/answers/comments is normal, completely normal.\n-----END OF ANTI-MICRO-MANAGE MESSAGE------\n\nI must check, but I think 1 of those comments is mine :D . The problem with such an evaluation (even when done by humans) is the enourmous number of factors that will influence the choice between friendly, unfriendly and neutral. Given the fact that the comments were sent for evaluation were completely out of context, I strongly believe that your results are waaaaay off."}, {"author_name": "Rex", "gravatar_hash": "e6eece137c095760b2f02d1d0c4c0f7f", "author_url": null, "date": "Aug 02, 2012", "message": "Here's my $0.02 - Time was when I missed Usenet for the sort of Q&amp;A that Stackexchange now provides. As Jeff said, all you had were a zillion different forums running on vBulletin, that you'd have to sign up for to post a question. And sometimes the subject matter is not something you're passionate about or work with extensively; you just want an answer and to move on. Signing up just to ask a question becomes a chore, and it's not as though you're going to ever return to that forum and hang out with the regulars either. \n\nI agree with the sentiment that this should be a Q&amp;A repository and can do without the 'fluff'. There are plenty of the old style forums still around if you're looking to socialize.\nSO's USP was the interface, the ease of finding similar questions and the easy signup with your existing account providers.\nLet's not make it into a clone of the very forums it was trying to replace.\n\nAnd the alternative is not that we become all clinical and robotic either, one can be humorous or friendly while making relevant and useful points as well."}, {"author_name": "James", "gravatar_hash": "c0efe8e5c15bd268224fbc40a574329d", "author_url": "http://blog.yourlabs.org", "date": "Aug 02, 2012", "message": "Here's a possible compromise:\n\n0) when clicking the giant arrow, pop-in an input with a placeholder like \"You can say thank you here\"\n1) next to \"add comment\", add \"just say thank you\" that would pop in a message like \"click the giant arrow and say thank you in the input that pops\"\n\nThe same pattern could be applied for unfriendly comments, a flamewar once in a while can be utterly hilarious.\n\nThen you could add a link like \"see social comments\" (that would market better than \"see useless comments\")."}, {"author_name": "Chris", "gravatar_hash": "b7d2033d9e8e5e9c3291dec32ef9e228", "author_url": null, "date": "Aug 02, 2012", "message": "Seems not every site is so cool, XDA-developers.com lost me already during the registration process when I was told to watch the \"[XDA noob video](http://forum.xda-developers.com/register.php)\""}, {"author_name": "Justin", "gravatar_hash": "506084fa293b055fd627f9e41b4c0f2a", "author_url": "http://lushcomics.com", "date": "Aug 02, 2012", "message": "What about automating the friendliness quotient to some small degree? There is likely a minimum cost that gives reliable feedback from Mechanical Turk. Off the top of my head, 4 workers at .05$ a HIT, and if 3/4 rated a comment as unfriendly, you could accept that as true (those numbers are just a guess, but something like that). So then you know costs $.20 to automate friendliness in one comment.\n\nYou can then choose to just spend $XX/day picking random (or, perhaps not-so-random, perhaps all posts with +2 comments), and let an automated MTurk workflow delete/flag unfriendly comments. It would be a cool case study in automating Mturk. Perhaps you could even use that nifty AWS' Simple Queue Service or Simple Workflow Service, whichever one makes more sense.\n\nThat is, all assuming that friendliness is worth enough to pay for it. Perhaps there is a minimum amount of friendliness, that if you pay for it, that sets the tone for the whole site, and the return on the cost is greater  because others will follow the lead of your \"Mturk friendliness bot\". And it would be cool to build."}, {"author_name": "Christopher", "gravatar_hash": "f85acc2a97a2ccbb06eb358a0274c35b", "author_url": null, "date": "Aug 02, 2012", "message": "I had some questions about the content analysis methodology used here, so I posted it to the stats SE: http://stats.stackexchange.com/questions/33566/is-joel-spolskys-hunting-of-the-snark-post-valid-statistical-content-analysis\n\nSeemed like a decent place to discuss it..."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Aug 02, 2012", "message": "@Chris: That video you linked...\n\nhttp://forum.xda-developers.com/register.php\n\nWow... just.. wow.  Mind blown, and not in a good way either.\n\nIt's hard to imagine a more condescending, insulting, confusing and unconstructive way to introduce a new person to their website.  I think they were trying to be funny or amusing, but it certainly doesn't come off that way."}, {"author_name": "PaulSM", "gravatar_hash": "4db993d6b09e27bd6205bc13d6672ce0", "author_url": null, "date": "Aug 02, 2012", "message": "This URL (http://www.youtube.com/watch?v=JmvCpR45LKA&amp;feature=player_embedded) is a *parody* of the real XDA developers welcome video (http://www.youtube.com/watch?v=2Hqwn5HpESc&amp;feature=player_embedded#t=14s)\n\nIt's funny, though ;)"}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 02, 2012", "message": "@PaulSM no, noth are real welcome videos, the \"parody\" one is the real, current one. The more polite and less vomit-inducing one is the one that will be used in 2013."}, {"author_name": "Nathan", "gravatar_hash": "d0ae73be3dfd1a62e92bbed013b6abaf", "author_url": null, "date": "Aug 02, 2012", "message": "An interesting debate - I would just like to note that the FAQ section is pretty light on advice for commenting. There is guidance on asking and answering questions, but not really anything I could see about what are and are not appropriate comments (notwithstanding the general etiquette advice to be nice and be honest).\n\nThanks or \"me too\" responses as *Answers* are covered in the \"Why are some questions or answers removed?\" section, but if thanking a poster in the *comments* is inappropriate, then putting something to that effect in the FAQ might also be a good idea."}, {"author_name": "DVK", "gravatar_hash": "f3d2c01f6f55bb34530fcbae9a39d285", "author_url": null, "date": "Aug 02, 2012", "message": "1) To all those who want to make SO into Facebook (including, seemingly, Joel): There is a reason why Facebook is not the pre-eminent Q&amp;A programming site.\n\nAnd while one factor for that is the unique interface of SE engine, a much more important factor is that it's a community that values Info/noise ratio. You don't collect good information by encouraging people who LIKE noise and discouraging people who don't.\n\nFor those who don't believe that it's not only about the interface, case study: Perlmonks website. Pure annoying forum format/interface. STILL one of the main sources for Perl Q&amp;A, perhaps more pre-eminent than SO's Perl tag (I wouldn't presume to know enough to be able to weight the two, but my really difficult Perl questions more frequently google-find answers on PM than SO). Yet, it has a community with the same non-nonsense noise/info ratio mindset, which is what makes it effective.\n\n==============================\n\n2) I would like to second a couple of people's opinion from above. The tone and behavior of the proponents of \"fuzziness\" on this comment thread was 2x more unfriendly and rude than MOST of the \"rude\" comments Joel used as examples. If these are a good sample of who would be setting the new tone for SO, you will be eventually left with a lot of newbies posting crappy questions, and people posting \"me too\" \"I like that\" \"howdy ya'll\" comments. The same exact useless forum content that SO was meant to phase out. \n\n@skinnytod - I may be a cold robotic automaton who's a poster child for Aspergers. But I'm a cold robotic automaton who's a poster child for Aspergers who provided 1,285 mostly-useful answers and little fluff comparatively.\n\n==============================\n\n3) Also, Joel - this is the same old discussion (same on a philosophical level) that's been already joined by you once before, when you finally had to agree that a question upvote must be worth less than the answer one - because experts providing good answers are what makes this network tick, not people with a lack of assorted good qualities who can't be bothered to read the FAQ or a couple of other questions before flooding the site with bad quality questions, or people who want to use the site to showcase just how friendly they personally are. As this comment thread shows, you can't thread the goldilocks middle ground - you will either alienate the skinnytod's of the world or Robert Harvey's. Choose wisely, to misquote Indiana Jones."}, {"author_name": "siddharth", "gravatar_hash": "52861ca2f4d19a1b6a029c13a58ddd37", "author_url": null, "date": "Aug 02, 2012", "message": "Reading through the comments, it seems that there is a good chunk of people who would like to do away with comments all together. There are already mechanisms available to work without the comments - you want to suggest a change in answer, you edit it. You find the answer helpful, you upvote it. You find the question interesting, you upvote the question. There is no need to say anything.\nDownvotes would be a problem , but a lot of downvotes don't accompany any comment anyways.\nWe should just test SO by completely turning off the comments for some time and see if it affects the participation in anyway."}, {"author_name": "Mr Lister", "gravatar_hash": "6caee048c059d29522426ad86324fa59", "author_url": null, "date": "Aug 03, 2012", "message": "I'm with those who believe \"usability\" of comments is more important than \"friendliness\". If I were to be tasked with cleaning up comments that didn't contribute to the question, I'd flag more of these \"friendly\" ones as too chatty than I would flag \"unfriendly\" ones as offensive."}, {"author_name": "Lyuben T.", "gravatar_hash": "b3e368c3a2d17ae5b15c0bed554d19f7", "author_url": "http://lyubentodorov.wordpress.com", "date": "Aug 03, 2012", "message": "Quite surprised to see some of the comments with swearing in them. You do get some users that ask vague questions and expect to be rewarded with 100% functioning code and that is frustrating, but surely a down-vote would do the job."}, {"author_name": "Christopher", "gravatar_hash": "f85acc2a97a2ccbb06eb358a0274c35b", "author_url": null, "date": "Aug 03, 2012", "message": "Attempted to construct an additional statistical analysis of these results in this question: http://stats.stackexchange.com/questions/33639/what-am-i-measuring-when-i-apply-a-graded-response-model-to-the-hunting-of-the"}, {"author_name": "matt wilkie", "gravatar_hash": "acd0e289c2d32dbb5ba6cfbecd708c97", "author_url": null, "date": "Aug 05, 2012", "message": "The ability to comment with a self imposed evaporation date sounds like a good idea. The big up (and down) vote buttons are good tools, but they're anonymous. Sometimes it's nice to connect a little more fully.\n\nAs to the general theme of doing away with or lessening comments: many of them contain important and sometimes critical information that doesn't get folded into the answer or question itself. (even though editing feature is available, it's not used that often, relative to commenting.)\n\nTo back up a bit, the discussion has been focussed on comments, but that's just an easier aspect to talk about, as it's relatively contained and there is specific data to study. The whole user experience at SO is much larger and there are many other points at which a person can have good or bad experience. Having a question closed before they have a chance to adequately respond to and incorporate feedback for example."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Aug 06, 2012", "message": "@matt wilkie\n\nClosure is that chance ti adequately respond to and incorporate feedback. Closure still allows all edits and gives a general reason the post needs improvement automatically. \"Closing too early\" isn't really a think.\n\nSince this must be the 10-20th time I've said that, I really think the problem is people (even users who aren't new to the site) don't seem to understand that closing is not the end and that you can edit it."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Aug 06, 2012", "message": "Umm.... looking at those comments.... \n\nSome of the comments MUST be from Meta. One is addressing Rich B, who has not had that user name for years; another talks to TheTXI, whose last activity on the network was in 2009.\n\nWhat kind of data have you been using here? Or is that part of the program and I'm overlooking something?"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": null, "date": "Aug 06, 2012", "message": "@Pekka: yes, this data was drawn from the past three years - see: http://blog.stackoverflow.com/2012/07/week-2-of-the-summer-of-love-researching-comments/"}, {"author_name": "Austin Salonen", "gravatar_hash": "c5ca0194c4cfd38e4531ef115e9d5167", "author_url": null, "date": "Aug 07, 2012", "message": "So I found that one of my comments was in your list and it was considered unfriendly by 17/20.  In context it was a comment of the code snippet's comments; out of context, it appears unfriendly towards other user's comments.\n\n&gt; FWIW, those comments are just noise...\n\nhttp://stackoverflow.com/questions/2851402/execute-multiple-command-lines-with-the-same-process-using-c-sharp\n\n\nThough my comment is a \"false negative\" (obviously in my opinion), I'm sure there was at least one backhanded compliment that was flagged as friendly.\n\nAnyways, great work and I'm sure a sociologist would have a field day with all of the SO data."}, {"author_name": "Lynden", "gravatar_hash": "0359a8d7001be9e82bd9a2c3f309576f", "author_url": null, "date": "Aug 15, 2012", "message": "People seem worried about the 'noise' by comments that consist of nothing but \"thanks!\"\n\nI think those comments are very valuable. However I see the noise problem. Maybe we should only allow comments like that as the last comment in a thread (and maybe an acknowledgement of it also, like \"glad to help :)\").\n\nComments with thanks in them that also add more to the discussion, like \"thanks, but I also have this other problem ...\" should IMO be favoured over ones with the same information content but no thanks, i.e. \"but I also have this other problem ...\""}, {"author_name": "rds", "gravatar_hash": "1be30c101873e68a9917027728823a96", "author_url": "http://regis.decamps.info", "date": "Jan 15, 2013", "message": "I don't really like the useless fluff either.\n\nDo you want an objective drawback of it: each comment creates a notification. \n\nYou think you'll have to interact, and instead find a \"thanks\". And for the sake of politeness, should I post a new comment \"you're welcome\" or \"all my pleasure\"?\n\nAlso, I'll feel the need to understand what I was thanked for, reopen the question, maybe re-read my answer.\n\nWhat I consider polite is: a thoughtful question, answers that fit, no duplicates, proper spelling and formatting.\n\nI don't see see stackoverflow as a place of social exchange. I'd rather see it as a knownledge base / automatic FAQ. Those don't usually have thanks between each section. I don't want to see friendly people. I want to see respected and helpful people."}]}