{"response": [{"author_name": "Jamie", "gravatar_hash": "1ce5d75a43aea1b5815b8860c15b39e0", "author_url": null, "date": "Jul 23, 2012", "message": "\"And subtly, ‘Android’ is friendliest\"\n\nIt was programmed for that. It's a protocol droid."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 23, 2012", "message": "For the statistically/scientifically inclined, make sure you check out the full summary (link in last paragraph). I almost missed it. It's a pretty brief write up but still interesting"}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 23, 2012", "message": "Anyone at Stack Exchange want to share some more detailed numbers on comments on new users' posts? What was the % of friendliness on new users' frist posts vs other posts? Was the % of friendliness on closed posts comparable to new users' first posts that got closed? \n\nBasically I'm wondering :\nA) How significantly different friendliness is on a users' first post\nB) How much of that effect is due to closed posts (which probably have more unfriendly comments than others in general)"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Jul 23, 2012", "message": "Total civility is an unreachable goal.\n\nScenario 1:  Comment posted: \"Stack Overflow is not your personal research assistant.\"  Post closed.  Comment flagged for incivility.\n\nScenario 2:  Downvote without explanation.  OP responds: Y U NO EXPLAIN DOWNVOTE?  Comment flagged as too chatty.\n\nScenario 3:  Lengthy comment posted that goes off-the-scale on the Mechanical Turk politeness index.  OP argues that question should be reopened because the existing rules suck, and \"I should be able to do whatever I want.\"\n\nScenario 4:  OP is offended because, while the comment you posted is acceptable to us WASPy Americans, it offends some other culture.\n\nIt's a nice idea, but 100% politeness 100% of the time is unattainable.  I personally view a very high degree of politeness as disingenuous (\"What is this person not being honest with me about?\")"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jul 23, 2012", "message": "@Robert: no, expecting rude comments to never be posted is unobtainable, and expecting everyone to like you 100% of the time is doubly unobtainable.\n\nBut striving for 100% civility - even if unobtainable - is a worthy pursuit. Some folks will still hate you for telling them they're wrong, because they don't want to hear that they're wrong - but if you're civil about it, they don't really have a leg to stand on. If folks hate us because we're obsessive about quality, great - if they hate us because we're a bunch of insular jerks, not great. \n\nNo one's polite 100% of the time. Heck, I certainly don't come close to it. But that doesn't mean I should stop trying."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://hermeneutics.stackexchange.com/users/68/jon-ericson", "date": "Jul 23, 2012", "message": "I'm curious about the thing that Ben mentioned.  In addition:\n\nCan we get a sample of what the test subjects were given?  Maybe even three with one rated friendly, one unfriendly, and on neutral?\n\nDoes the data show any difference between comments on first posts that are also only posts and comments on first posts of users who later contribute other posts?  (In other words, does an unfriendly post discourage further participation and vice-versa?)\n\nAt any rate, it's gratifying to have some indication that comments are generally friendly on SO."}, {"author_name": "Ben", "gravatar_hash": "58f6261702ca9e0c19eb0f5c5271b3e2", "author_url": null, "date": "Jul 23, 2012", "message": "We found that comments on first posts are significantly less friendly compared to the rest, regardless of time period'\n\nNo doubt the average first post is of lower quality than the average second post, etc. So users learn quickly, but it would be nice if their teachers were more firendly.\n\nIs there any indication on a first post that the user is popping their cherry (I'm only a casual user). A big honking icon that tells the commenter that this is a first post might temper their response a little."}, {"author_name": "gnat", "gravatar_hash": "d6db99aa846a8217f7e2aba6fa198e7c", "author_url": "http://meta.stackoverflow.com/users/165773/gnat", "date": "Jul 23, 2012", "message": "Did sampled comments include those that were removed by moderators after being flagged as rude / offensive - or at least part that have been visible for a substantial period of time prior to deletion (for a week or month or I dunno year)?"}, {"author_name": "phwd", "gravatar_hash": "d51a60c7bade46cd12ac19008ba3d8e7", "author_url": "http://stackoverflow.com/users/321505/phwd", "date": "Jul 23, 2012", "message": "&gt; Independent ratings were obtained by presenting\nexperienced English speaking raters the comment text with contextual information including\nonly that the comment was taken from an online discussion between computer programmers.\n\nCould we see an example of the contextual information used?\n\nThere is a lot of emotion that can go into one of these comments based on the layout of the question itself. If the only contextual information given is the content of the post less any formatting/grammatical/technical errors/tone, then the ratings end up a bit skewed in my opinion."}, {"author_name": "Chris Baker", "gravatar_hash": "e385b6ee766f289fe921610c025717c0", "author_url": null, "date": "Jul 23, 2012", "message": "\"Did sampled comments include those that were removed by moderators after being flagged as rude / offensive – or at least part that have been visible for a substantial period of time prior to deletion (for a week or month or I dunno year)?\"\n\nTHAT is an excellent question -- if the data sample only looks at what remains in place, your results will be significantly skewed to positive because a statistically significant portion of the negative has been skimmed off already."}, {"author_name": "Hans Passant", "gravatar_hash": "4235db1aa1b11bcddb720dbc70b34a0f", "author_url": null, "date": "Jul 23, 2012", "message": "Wow, way to make a point.  Android is the toilet-bowl of SO, only out- voted by the cesspool of the Facebook tag.  Accompany it with a graph that shows a drastic lack of data points to make your point.  Is this science?  http://meta.stackoverflow.com/questions/100529/help-us-clean-up-the-android-tag/125361#125361"}, {"author_name": "msh210", "gravatar_hash": "78a50094ca87aaed01e076f4c8808ed8", "author_url": "http://judaism.stackexchange.com/users/170/msh210", "date": "Jul 23, 2012", "message": "How about other SE sites'?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 23, 2012", "message": "Kudos on the science and data. This is exactly the kind of thing I wanted to see.\n\nI've said it a jillion times, but I'm gonna say it again: <b>civility has been required under penalty of extreme moderation banhammer from day zero of Stack Overflow</b>.\n\nI'm concerned, though, that some seem to see \"infinite\" civility -- to the point of writing a small, intimate novella to each new question asker -- as a solution. I am not sure it is. Here is why.\n\n1. When most people complain about rudeness on Stack Exchange, it's rarely actual rudeness. What they're really communicating is their belief that Stack Exchange's rules are too strict. \"This is the Internet, man, how dare you tell me my question/answer/comment is not good enough for your sites. JERKS!\"\n\n2. Adding an infinity of \"extra niceness\" will do virtually nothing to change point #1.\n\nPlease do not read this as an attack on civility because it is not.  Civility is now, and has always been, a pillar of the Stack Overflow and Stack Exchange community.\n\nI just don't believe, in my heart of hearts, that a bunch of \"extra\" friendliness on top of our common standard of civility, will convince users that these rules Stack Exchange has, that they frequently view as too strict and unfair and jerk-y, are suddenly <i>awesome</i>.\n\nIt's also asking a lot of our existing users, who not only have to be perfectly 100% civil all the time, but also-oh-by-the-way, we need you to be SUPER friendly to new users. The ones who didn't bother reading the FAQ even a little or for that matter any of the other questions on the site to get a sense of what goes on there.\n\n<b>Uber-extra-friendliness makes more sense on smaller sites where the users have less to do, and the sites fundamentally <i>need</i> more new users to grow.</b> So on a site like http://bicycles.stackexchange.com absolutely. Totally makes sense. But on Stack Overflow, which gets 6k+ questions <i>per day</i> and is already enormous? (fun experiment: visit the sites page and calculate how many SE sites Stack Overflow would be bigger than in a single day) Stack Overflow is pretty much already the Wikipedia of programming. It's a bit of a stretch to argue that Stack Overflow *needs* to go far out of its way (again, fundamental civility is bedrock, I mean writing friendly novellas) to educate and woo new users, otherwise it will die a horrible, insular death.\n\nThat seems... unlikely.\n\nIt's not like New York City has an extra special welcoming committee waiting for you when you cross the city line, or anything. Does it really need one? Just come visit, follow the rules, and enjoy the city with the rest of everyone in a civil manner."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": "http://kevinmontrose.com", "date": "Jul 23, 2012", "message": "\"Did sampled comments include those that were removed by moderators after being flagged as rude / offensive – or at least part that have been visible for a substantial period of time prior to deletion (for a week or month or I dunno year)?\"\n\nSeth will probably go into more detail in future posts, but I'll answer this now too.\n\nThe selection process went like so:\n - take all comments on *questions* in a given month\n - make note of various metadata (tag of the question, rep of the user at the time, closed/open question, deleted, etc.)\n - take 500 random comments on open questions\n - take 500 random comments on closed questions\n - repeat for each chosen month\n\nIf you assume (which you really can't, because we're testing that theory; but for the sake of argument) that comments on closed questions are typically ruder then we might be biasing the aggregates toward \"more rude\".  Less than 50% of questions are closed after all (I think it's closer to 3%, but don't quote me on that).\n\nWe didn't intentionally include any flagged/deleted comments, but some were present in the data set just do to random selection."}, {"author_name": "Seth Rogers", "gravatar_hash": "9f71e62ebbf97a376f207bd22983869c", "author_url": null, "date": "Jul 23, 2012", "message": "Did the sample include deleted comments and comments on closed posts?\n\n-Yes, we accounted for confounds like deletions and closes in the model. Deleted comments in or out of the sample would skew the results. We considered this in our analysis and the above findings hold in any event.\n\n\"Could we see an example of the contextual information used?\"\n\n-Yes. Raters read (only) the following message and then the comment: \n\n-\"This comment is a single message (taken out of context) from an online discussion between computer programmers. To the best of your ability, rate the comment Friendly (positive feeling), Neutral/unclear, or Unfriendly (negative feeling).\""}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 23, 2012", "message": "Wait, is \"Positive\" friendly only or friendly + neural? If it's friendly + neutral, what % were actually rated unfriendly?"}, {"author_name": "SoboLAN", "gravatar_hash": "8feac14b86e6408e19694122993e7935", "author_url": null, "date": "Jul 24, 2012", "message": "This is a very very very important subject (note that I didn't say issue).\n\nJeff's point is key here: New York doesn't have any welcoming commitee. And it should never have.\n\nIn my opinion, every question and answer and comment on SO is unique somehow. Being a little more tough with a newcomer is good in some situations. Maybe he asked about the solar system and added the SQL tag to his question. Or maybe it's a little more subtle.\n\nI would love to see what are the factors that the Mechanical Turk tool uses to evaluate its input. This is very important, because that graph does look a little disconnected from reality (not too much, just a little :D )."}, {"author_name": "msw", "gravatar_hash": "b512058437c392e361e5378fa39a2f63", "author_url": null, "date": "Jul 24, 2012", "message": "Until there is a way to politely say \"You came here, read no other posts, didn't read the FAQ, made no effort to search for the answer yourself, asked a question that's nearly incomprehensible and dreadfully incomplete\", first questions will get biased response on average.\n\nCivil intercourse requires that the newcomer observe the norms of the society at peril of censure; this applies to every community everywhere. You can't force people to pay attention to the norms except by social censure when they violate them. In life, we have a couple of decades of training in just how to attend to such conventions; on the internet, too frequently are they presumed not to exist.\n\nPersonally, I just vote to close the egregiously bad questions, giving some guidance when it looks like they might pay attention. Compare — for example — the communities of MetaFilter and Yahoo Answers; the former is a community, the latter a permanent chat room."}, {"author_name": "Hasan", "gravatar_hash": "5438cb3219d0a21693842f4982066dbc", "author_url": null, "date": "Jul 24, 2012", "message": "I think this data should have also taken into account how many votes posts are down voted without explanation and how many questions are closed. You don't always have to 'say' something bad to make someone feel bad. Down vote and question close are a good way to slap without much explanation.\n\nThe no. of down votes from users more than a month old over time can mean 2 things. 1) The community is becoming a bunch of highly opinionated snobs who are under the assumption of being in charge of some superficial level of quality of their own liking or 2) a lot of crap has started coming in from general public. The later would be un likely since the diversity of new audience coming in must not be different today than what it was on day 1. What may have changed over time is the attitude of 'existing' users."}, {"author_name": "Raphael", "gravatar_hash": "6a4d2d42ded7e86ca65f2d45b6cad765", "author_url": "http://lmazy.verrech.net", "date": "Jul 24, 2012", "message": "Wow, that graph is horrible. It does not tell us anything! Where are the actual data points? What is the scale on the y-axis, that is what are min and max? What is the variance (or, alternatively, error bars)? Maybe the average went up, but the unfriendliest comment today is unfriendlier than before. The plot makes it hard to believe in the statistics you say you did.\n\nI would also be very interested in comparing different communities."}, {"author_name": "R. Martinho Fernandes", "gravatar_hash": "f64914b68ff9076e46156c07c96e890f", "author_url": "http://rmartinho.github.com", "date": "Jul 24, 2012", "message": "@Hasan \"The later would be un likely since the diversity of new audience coming in must not be different today than what it was on day 1.\" It is not unlikely. On day 1 you had practically the public that read Jeff and Joel's blogs. Now you have practically everyone (like Jeff said, Stack Overflow is like the Wikipedia of programming)."}, {"author_name": "Jacobus", "gravatar_hash": "37ce082c85173317772af80b64345526", "author_url": null, "date": "Jul 24, 2012", "message": "Stack Overflow is 'well balanced'. I work from home, but whenever I open StackOverflow, then I know I'm at work.\n\nMost people are very nice and helpful.\n\nAh, except whoever downvoted this answer of mine:\nhttp://stackoverflow.com/a/11619040/828757\n\nThere I was, adding a friendly answer to an old post to keep it up to date.... seconds later someone downvoted me without giving me a reason.\n\nNow I keep my nunchucks next to my keyboard. Let them try it again!!!\n\n:-)"}, {"author_name": "Rachel", "gravatar_hash": "01b235a8024b2dd10f427c301c876a0b", "author_url": "http://rachel53461.wordpress.com", "date": "Jul 24, 2012", "message": "We may not be able to achieve 100% civility, however there's definitely room for improvement. 75% friendly comments means 25% unfriendly, which seems like a pretty big number when you consider how many comments SO gets"}, {"author_name": "gnat", "gravatar_hash": "d6db99aa846a8217f7e2aba6fa198e7c", "author_url": "http://meta.stackoverflow.com/users/165773/gnat", "date": "Jul 24, 2012", "message": "Seth - thanks for explanation. My understanding is, deleted comments are taken into account separately, correct? that would make sense to me. Actually that would make better sense than indiscriminately mix these with the rest."}, {"author_name": "ian", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Jul 24, 2012", "message": "Say 90% of people that ask a first question don’t come back again; provided the other 10% of new users contains the best programmers do we care?\n\nPersonally I think the best thing StackOverflow can do is drive away anyone that can’t ask good questions or provide useful answers.   \n\nStackOverflow is already big enough…"}, {"author_name": "Torsten", "gravatar_hash": "69c7b71af2a70b8d3f96082c80ed9934", "author_url": null, "date": "Jul 24, 2012", "message": "@ian: what makes you believe that the remaining 10% are \"the best programmers\"? Let's face the truth, that 10% includes you and me, so it can't really be the best programmers at all, right?"}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 24, 2012", "message": "@Raphael proper error bars are in the \"full summary\" in the link at the end of the post"}, {"author_name": "Raphael", "gravatar_hash": "6a4d2d42ded7e86ca65f2d45b6cad765", "author_url": "http://lmazy.verrech.net", "date": "Jul 24, 2012", "message": "@ian Nice scenario, unfortunately it can neither be verified nor falsified as you can not get a handle on those who never came back.\n\n@Ben Yes, I saw that after I commented. Seth should have included that one in the post. In particular using the full y-axis; the improvement looks more sobering if you see its real scale.\n\nBy the way, did you find users that were unusually (un)friendly?"}, {"author_name": "Will", "gravatar_hash": "3568876d79f0551ec5d77652eb8ae9ef", "author_url": "http://statestreetgang.net", "date": "Jul 24, 2012", "message": "We all know what needs to be done to make StackOverflow 10k times nicer, but none of you are man enough to say it.\n\nBan PHP and C++ questions.\n\nThere.  I did it."}, {"author_name": "Steven Jeuris", "gravatar_hash": "2648f806f3af808a2ed537c8e745558e", "author_url": "http://whathecode.wordpress.com/", "date": "Jul 24, 2012", "message": "Does the gathered data also allow looking for additional correlations?\n\nI'm very interested in seeing whether there is a correlation between first unfriendly posts and users which don't return vs. friendly first comments and still active users."}, {"author_name": "Josh Caswell", "gravatar_hash": "79f438a6844f77869a79854eb9404aae", "author_url": "http://meta.stackoverflow.com/users/159251/problem", "date": "Jul 24, 2012", "message": "So...now that we've determined that this isn't the problem Joel was fantasizing it was, can we have WSOIN back?"}, {"author_name": "Taste", "gravatar_hash": "8c2392da041304fda667e525f3e80fdd", "author_url": null, "date": "Jul 24, 2012", "message": "Although newbie status is visible from the user's score reputation, it might help to add extra highlight/ extra visual elements to bring better to attention that a question is the first (or maybe one of the first four) of a particular user, thereby reminding the people answering to take extra care, even if the question quality might be low. That might address the problem of first questions receiving statistically less friendly answers."}, {"author_name": "Hasan", "gravatar_hash": "5438cb3219d0a21693842f4982066dbc", "author_url": null, "date": "Jul 24, 2012", "message": "What StackExchange staff fails to realize is that they have succeeded in creating a system to evaluate people instead of content.\n\nIf you say something that community agrees with, you get up voted. If you fail to understand the rules of the game, or your question is not nicely worded because you're not a native english speaker or your question doesn't comply with so and so policy then you get down voted.\n\nWhat does 0 vote mean? Worthless question or an answer. What does -1 -2 -10 votes mean? You're a loser. While there are hundreds of people who are winners every day. There are also hundreds of people who are told by the community 'WITH ABSOLUTE CIVILITY 100% AT ALL TIMES' that brother you suck! Your contributions suck! look at your score. You're a loser! \n\nDown votes and closing questions are an insult for the intellect of the person who is making contribution. I seriously find it ironic that stackexchange staff makes the comparison of StackOverflow with Wikipedia. Wikipedia totally focuses on knowledge sharing. It is not a system for evaluating people. I'd argue it is much more successful in serving its purpose. People don't leave wikipedia with bad feelings if they make a bad contribution. Over time it is edited out. THAT is civility.\n\nStackOverflow doesn't take into account the human sensitivity factor in its gamification philosophy. And frankly speaking who ever doesn't get the concept of down votes and closed question, the high rep member and official staff has really one answer to this. 'There is no shortage of sites on internet where you can post whatever you want'. In other words its a polite way of saying go buzz off from my lawn. THAT is where the problem is. \n\nDoing sentiment analysis on comments via some algorithm and plotting it over graph doesn't show how much hatred and bad feelings stackoverflow succeeds in producing at the expense of trying to make a site full of useful content.\n\nStackExchange staff's focus at all times is on the product and never on the people who use the product. Even community managers. If you read their posts and comments and replies. You'll rarely see them 'receiving' or 'listening' to feedback. They are pushing the same agenda and philosophy everywhere.\n\nYou don't have to use foul language to make someone feel bad. Telling them they are losers and down voting their content and closing their questions is good enough! THAT is what is wrong with StackExchange. And please stop comparing it with Wikipedia. You declare as many losers every day as you declare winners. It is sort of a survival of the fittest game. It has this elitist culture. THAT is what needs to be fixed in this summer of love.\n\nYou wan't to fix your network? Remove upvotes and downvotes. Make it entirely collaboratively edited site. Then call it wikipedia!"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jul 24, 2012", "message": "@Hasan I couldn't disagree more. Downvotes mean \"your post sucks\". The right reaction is not to feel like a loser, but to <i>go and write a better post!</i>Voting is a quality filter without which this site couldn't do. You want to let every one of the <b>4,000 questions</b> that come in on SO <b>every day</b> live so someone will fix them all one day. That's an... unrealistic expectation.\n\nYou may want to read Jeff Atwood's comments in the other Summer of Love post: http://blog.stackoverflow.com/2012/07/kicking-off-the-summer-of-love/ \n\nEspecially:\n\n&gt;  I think what some people may be seeing as “rude” is that “you guys have rules I don’t understand, and I don’t agree with those rules.” The Internet is the wild west most of the time, and you can almost do anything you want on most websites on the Internet. Particularly forums. So to encounter a site that has rules, at all, and enforces those rules, at all, is enough to be disconcerting to a certain percentage of the audience, enough to cause them to complain about “rudeness”."}, {"author_name": "octopusgrabbus", "gravatar_hash": "fd31b8bcea99fa7b0711fbc424587774", "author_url": "http://octopusgrabbus.wordpress.com", "date": "Jul 25, 2012", "message": "I have found the best I can do is to comment in an answer the way others have brought me along in my technical career. That is I try to treat people the way I want to be treated. \n\nI agree that total politeness may not be possible."}, {"author_name": "wax_eagle", "gravatar_hash": "4320ac0987d82025b454bcee57d708d1", "author_url": null, "date": "Jul 25, 2012", "message": "@Hasan you realize the mechanical turk is actual people right? It's an amazon service that provides artificial artificial intelligence. In other words, it's people doing simple tasks computers are largely incapable of (for very little money).\n\nAlso, gamism is what makes SO the site that it is, removing that would be silly."}, {"author_name": "jalf", "gravatar_hash": "de77b4f64cbf825db2a08128228dc929", "author_url": null, "date": "Jul 26, 2012", "message": "Interesting data. But I think we all already knew that *most* comments are friendly.\n\nI think it'd be more interesting to drill into the (fortunately few) unfriendly comments: what do they say, when and why?\n\nHow much of them are associated with votes to close, how many are \"please fix your accept rate\", and so on.\n\nHope to see that in the next post. :)\n\n\nAnd I disagree with Jeff: if New York was truly unique, the only civilized city on the continent, then it should absolutely have a welcoming committee, someone to help newcomers get settled in.\n\nIn the real-world New York, it is assumed that \"people who come here are used to people, are used to cities, are used to functioning in a social environment\".\n\nOn StackOverflow, we have to assume that \"people who come here are used to Yahoo Answers, Youtube comments and Wikipedia\"; that people are used to different rules (or no rules at all). And explaining the rules in a friendly/civil manner can make a lot of difference. (Of course, there's also the other side of the issue: that as part of this whole \"being civil\" package, perhaps, sometimes, people should also be a liiiittle bit more relaxed about the rules? Perhaps there should be room for newcomers to make a misstep or two before they're descended on by the hordes eager to fill their question-closing quota. And perhaps we should, just sometimes, allow people to say \"hi\", or \"hope that helps\" in their questions or answers. Perhaps that would be the civil thing to do. Perhaps, sometimes, these complaints about rudeness are because certain rules, and certain people's interpretation and enforcement of the rules, *is* rude.)\n\nApart from that, it's also a strawman argument. Because some people don't understand/don't agree with the rules, we shouldn't strive to be as civil *as possible*. What?\n\nOr, \"because SO is already a big site, and doesn't desperately need to grow, we don't need to go out of our way to make newcomers feel welcome\"\n\nWhat happened to the whole \"make the internet a better place\" thing?\n\nWhy should we *not* try to be as civil as possible? No one is asking for the impossible, and I see no requirement for complete and total 100% perfect friendliness, helpfulness and civility with a sprinkling of infinite patience.\n\nBut I don't see the problem in striving for it, in trying to move in that general direction."}, {"author_name": "Raj", "gravatar_hash": "1e5319be312a6d19f98442d8894f6fe2", "author_url": null, "date": "Jul 26, 2012", "message": "Give me teh codez!!!"}, {"author_name": "roger", "gravatar_hash": "9887130ab70f6e66b50f2c5e19272c67", "author_url": "http://freeldssheetmusic.org", "date": "Jul 26, 2012", "message": "I would agree that it's friendlier...except for moderators marking questions as closed that are actually quite useful.  And also the meta SO people not being so nice."}, {"author_name": "Michael", "gravatar_hash": "61859ff9f918219e577f5c760a362851", "author_url": null, "date": "Jul 26, 2012", "message": "What would be interesting in the friendly vs. unfriendly post would be time of day (are the unfriendly mostly late in the afternoon) and also post number of the current user (are they more unfriendly after the nth post vs. the 1st post?)"}, {"author_name": "Mike", "gravatar_hash": "46b95bfccbd5c721268cab89ac0ae9fe", "author_url": null, "date": "Jul 26, 2012", "message": "Yawn, did no one think of the southern hemisphere?"}, {"author_name": "backlord", "gravatar_hash": "4f6d4adec0428986ff9a7501f0690bbf", "author_url": "http://www.antalya-kamera.com", "date": "Jul 27, 2012", "message": "We all know what needs to be done to make StackOverflow 10k times nicer, but none of you are man enough to say it."}, {"author_name": "NIck", "gravatar_hash": "a5f3fbfe7d35f2c7aa0f4d66930426fa", "author_url": null, "date": "Jul 27, 2012", "message": "I think SO is getting nicer, although I still spend most of my \"wandering\" time on SO trying to +1 noobs whoetct are already being pounded for their first questions. I wonder if it's worth putting a filter so that you can't -1 someone with less than 3 points or who is asking one of their first couple of questions."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jul 27, 2012", "message": "Nick - I know you mean well, but *please* do not +1 contributions whose quality doesn't justify it. Help <i>fix</i> them instead. Otherwise, you are impeding the most important quality filtering system on SO, and in the long run, worsening the problem because more bad contributions survive."}, {"author_name": "James Mortensen", "gravatar_hash": "d4518e6223a1a82f53dc4919d0165151", "author_url": "http://www.loopto.do", "date": "Jul 27, 2012", "message": "To follow up on what Pekka said, being nice isn't the same as being weak. Do not sacrifice quality in the name of being nice. That's not what this campaign is about.\n\nAs Joel says in the \"Summer of Love\":\n\n&gt; The goal is simple: to keep Stack Exchange a welcoming, friendly place without lowering our standards. No, you may not ask “plz send me the code” questions, but if you do, we will explain to you, in a friendly and professional way, what you did wrong."}, {"author_name": "Ben Brocka", "gravatar_hash": "51ec0ca52727a2a471cb40ca684d6c8e", "author_url": null, "date": "Jul 27, 2012", "message": "Agreed with Pekka; trying to turn upvotes into \"Yeah! I like you!\" is exactly the wrong route to take. Votes are not personal, they are not directly for people; they are directly for content.\n\nBuilding the impression that you should get upvotes because we're nice and love you just strengthens the impression that downvotes are mean."}, {"author_name": "Kiru", "gravatar_hash": "596e7cfcc68c6711dced05001e3bf746", "author_url": null, "date": "Jul 30, 2012", "message": "One odd problem we've had on JLU is that we'd really like to use chat to handle many of the newbie offtopic questions. (particularly questions about \"how should I get started..?\" since they tend to be so personal to the individual asker, and useless to the site in the long term)\n\nHowever, since new users tend not to have any reputation, they can't actually get into chat. Occasionally we've invoked odd workarounds such as asking them to link accounts or upvoting+closing to give them the requisite reputation, but we'd definetely prefer a boilerplate \"This question isn't really a good fit for JLU, but click here to join us in the chatroom and we can help you there.\" AND automatically give them whatever permission needs to be given to chat there. (offtopic... redirect to chatroom, perhaps?)"}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": null, "date": "Aug 11, 2012", "message": "Did my part to show that not *all* C programmers are grumpy old neckbeards:\n\nhttp://stackoverflow.com/a/11915754/50049"}, {"author_name": "draperii online", "gravatar_hash": "e8d6ff64fc875e516aabccbbd5f98e77", "author_url": "http://www.dekoris.ro", "date": "Nov 29, 2012", "message": "You can’t force people to pay attention to the norms except by social censure when they violate them."}, {"author_name": "transfer", "gravatar_hash": "c49d7241a616b7a60f26d0528d2b8884", "author_url": "http://antalyatransfer.im", "date": "Dec 17, 2012", "message": "aHelp fix them instead. Otherwise, you are impeding the most important quality filtering system on SO, and in the long run, worsening the problem because more bad contributions survive"}]}