{"response": [{"author_name": "Samuel Bronson", "gravatar_hash": "165e55c78689e561c554c3dec671fb50", "author_url": null, "date": "Feb 06, 2012", "message": "You should probably change the title to \"Farewell to Jeff\"  or something like that, so people don't see \"Farewell, by Joel Spolsky\" when they hover over the \"new\" indicator next to the blog link. This made me think \"Joel Spolsky is saying goodbye?\""}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://about.me/cky", "date": "Feb 06, 2012", "message": "Take care, Jeff, and all the best with your newly-expanded family! It was good knowing (and meeting up with) you. May your road ahead be filled with much more awesomeness. :-)"}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Feb 06, 2012", "message": "Congratulations on your recent additions, Jeff!  You have made an invaluable contribution, and while you will be missed I know I'm not alone in looking forward to your next adventure!\n\nP.S. No fair changing my cw posts to regular and doing a recalc on your last day. ;-P"}, {"author_name": "Stephen Adams", "gravatar_hash": "426acf0dbf41313272df2b9feab262ef", "author_url": null, "date": "Feb 06, 2012", "message": "Jeff, congrats on your family expansion ... my little one is almost 2 months so I can understand the serious change of focus! :-)  1 has been a challenge, twins are going to be fun!\n\nYou can look back on what you built here with pride, I hope to still see you around as a user getting tips on games and other projects ... well once you have time again.\n\nAll the best and thank you for all you've done here."}, {"author_name": "Bill Smith", "gravatar_hash": "19f6f44cba644cd3cb0cc057c4cce515", "author_url": null, "date": "Feb 06, 2012", "message": "Congratulations and best of luck to Jeff!  Hope he gets some sleep at night, now and then."}, {"author_name": "Matt", "gravatar_hash": "0ef084c1304db64b8a44ddfb7e041a86", "author_url": "http://mattchan.net/", "date": "Feb 06, 2012", "message": "I truly wish him all the best. He helped make the internet a better place."}, {"author_name": "Kirk Kuykendall", "gravatar_hash": "e7530369d435cf6ba72042915b47a682", "author_url": null, "date": "Feb 06, 2012", "message": "Best wishes Jeff.  I really appreciate all that you've done."}, {"author_name": "Chris", "gravatar_hash": "bd97ad406560c9276d29e19222785d2d", "author_url": null, "date": "Feb 06, 2012", "message": "Farewell, I came to SO by the way of his blog.  He'll be an internet personality who is sorely missed.  Best of luck with the kiddos.  I'm sure he'll be seen around parenting.se ."}, {"author_name": "Kyle Staskiewicz", "gravatar_hash": "74f051a77a735d93c2fc130480007429", "author_url": "http://animuson.me", "date": "Feb 06, 2012", "message": "Man, this is like Steve Jobs announcing his stepping down from Apple... You will be missed!\n\nBefore you go, we need a super-designated person to handle the burnination of tags; for you to pass on... the dragon image. Who will it be!?"}, {"author_name": "sudo rm -rf/", "gravatar_hash": "45513a79bbcf50348ce795822e902265", "author_url": "http://appjon.com", "date": "Feb 06, 2012", "message": "Lets just say you've made a profound impact on the way we as programmers program.  Thanks for your hard work over these years to make StackExchange the great place it is now.  I'll (we'll) miss you, but I have high respect for the choice you made.  Best of luck in the future!"}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Feb 06, 2012", "message": "I think this is terrible. I mean, I know there are things to prioritize in life and everything but I honestly think this StackOverflow thing is just starting. \n\n\nWhat if Bill Gates or Steve Jobs ( or even Mark Zuckerberg )  have left their companies after 4 years?! \n\nI know StackOverflow and StackExchange will be fine because it is a good product already and I don't hesitate Joel Spolsky will do a great job, but there will be always a missing part in SO. \n\nI wish you the best Jeff and I'll wait for your return to StackOverflow \n\n:)"}, {"author_name": "Jim McKeeth", "gravatar_hash": "e5ca3abec062f8174570a4b1d1c840d8", "author_url": "http://delphi.org/", "date": "Feb 06, 2012", "message": "Farewell Jeff, you will be missed. Enjoy your kids while they are young, they grow up so fast."}, {"author_name": "ripper234", "gravatar_hash": "40656706454dcbdbcec125b85b01f1e4", "author_url": "http://ripper234.com/", "date": "Feb 06, 2012", "message": "Thanks for all the fishes ... you've changed the way we program, and Stack Exchange is changing the way we do everything else.\n\nEnjoy your time with your family ... if there's something that money _can_ buy, it's quality time at home with your loved ones. I'm sure we'll see new great projects from you in the future."}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": "http://kylecronin.me/", "date": "Feb 07, 2012", "message": "Farewell, Jeff! Thanks for all the time, dedication, and hard work you put into Stack Exchange.  It's never quite the same once a cofounder leaves the company, especially one that's been leading primary development for the last (nearly) 4 years. Stack Exchange won't be the same without Jeff."}, {"author_name": "Ates", "gravatar_hash": "49e9f25add9922c7f992be840bc3ada1", "author_url": "http://eatesgural.blogspot.com", "date": "Feb 07, 2012", "message": "Honestly, I never liked you Jeff, but you have been a great manager and developer and I can't thank you enough for giving us this great site.\n\nI hope you visit sometimes, with answers and questions.\n\nYou will always be the user:1.\n\nRegards."}, {"author_name": "Simon", "gravatar_hash": "d0ad58f953d035a0bcdc01501dc55992", "author_url": null, "date": "Feb 07, 2012", "message": "Isn't \"leaving the company to spend more time with his family\" a euphemism?"}, {"author_name": "Josh", "gravatar_hash": "e22fcc2b5b7fbc19e1f9e9f9d8ddf0fc", "author_url": "http://josh.gitlin.name", "date": "Feb 07, 2012", "message": "Thank you for the dedication and devotion you gave to Stack Exchange, Jeff! You have created a great product, one which touched the lives of many, many people (myself included). Congratulations on your expanded family, and good for you for making the choice to be with them. Stack Exchange will be here when they grow up, their childhood will be fleeting. You will be missed, but somehow I doubt we've seen the last of you. I know from personal experience that your product is fairly addictive and not very easy to put down ;-)"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Feb 07, 2012", "message": "Jeff thanks for your efforts, they are greatly appreciated.  It takes a strong person to give up something they love so dearly and focus on whats more important.  Thumbs up to you."}, {"author_name": "UncleZeiv", "gravatar_hash": "bd24dab59beada36b501670cd01b8e2c", "author_url": "http://unclezeiv.kerid.org", "date": "Feb 07, 2012", "message": "I can't believe this... no more podcast then?\n\nYou will be missed, I hope you'll join StackExchange again in the future!"}, {"author_name": "Jeff Lunt", "gravatar_hash": "8ef93fcf1d542ad7bbe654a74d24716d", "author_url": "http://karmanebula.com", "date": "Feb 07, 2012", "message": "Congrats on the family, and undoubtedly the impact you've made on the internet with the help of the SE team. Truly a remarkable contribution to be proud of for a long time to come."}, {"author_name": "Greg Mattes", "gravatar_hash": "642eea8127a7695eed5a2f3ba8360b5a", "author_url": "http://stackoverflow.com/users/13940/greg-mattes", "date": "Feb 07, 2012", "message": "Congrats to the Atwoods and thanks Jeff!"}, {"author_name": "Basic", "gravatar_hash": "d9e82c152a414ff9ea04813b6d0e4431", "author_url": null, "date": "Feb 07, 2012", "message": "Jeff, I have to admit I've disagreed with your decisions more often than not, but I can't tell you  how grateful I am for the SE sites. You've made my life as a developer considerably easier.\n\nThank you and best wishes to your new family."}, {"author_name": "stealthyninja", "gravatar_hash": "5f2b4416fa5d321a643e3714705a7ca8", "author_url": null, "date": "Feb 07, 2012", "message": "Am I the only one who wants a SOPA/PIPA-like black-out in response to this sad news? :-/\n\nMr. Atwood, you'll be missed. As much for your insight as for your snarky comment (often in conjunction with your insight) and my only hope is that you won't be a complete stranger and will check in once in a while on your other child (that is StackOverflow and the StackExchange network)."}, {"author_name": "Aaron", "gravatar_hash": "0cbe44e566b0668184262f7d35b44829", "author_url": "http://icelava.net", "date": "Feb 09, 2012", "message": "I applaud Jeff for prioritising family and children over job and career. But I am wondering if it was necessary to leave Stack Exchange entirely?\n\nCouldn't Jeff have done the Bill Gates move of retiring to a limited capacity so he can focus more time outside the company? Or is he aiming for the househusband role? :-)"}, {"author_name": "Camilo Martin", "gravatar_hash": "14570e9514625800a440f40fec36ed6e", "author_url": null, "date": "Feb 12, 2012", "message": "I never liked his over-moderative approach, and won't miss him. But I really like the software he built."}, {"author_name": "Matt Phililps", "gravatar_hash": "db157f5dda9a08b97c28282e12d350b0", "author_url": null, "date": "Feb 14, 2012", "message": "Stack Overflow is a wonderful site that has allowed me to not only get my own questions answered quickly, but to build my own expertise by answering the questions of others.  The privilege/badge/voting architecture is brilliant.  Thanks Jeff for your part in this."}, {"author_name": "Ali", "gravatar_hash": "9e80a6b9426d029877b5f3c8f163c698", "author_url": null, "date": "Feb 15, 2012", "message": "Jeff, you were an inspiration for me with your accurate discussions on Q/A and game design in the website. \n\nHope you the best!"}, {"author_name": "Mike", "gravatar_hash": "c98e188ba63a7875d61a77d7aaa3f5c7", "author_url": "http://mikebull.info", "date": "Feb 17, 2012", "message": "I too am surprised that a limited role within the company wasn't announced. Jeff has made a fantastic decision, but down the line there will always be doubts on this decision and an advisory or part-time role would probably help rather than hinder his family time.\n\nAdditionally, if Jeff decides to put himself back on the market when the kids are in school would there be a space for him to rejoin SE? As much as this project is attributed to Joel much of what we see was (probably) a labour of love from Jeff so it'd be nice to at least see an opportunity where Jeff could return."}, {"author_name": "@csharp4evermore", "gravatar_hash": "69b78654cf193351b12d1d6750aa91a7", "author_url": null, "date": "Mar 01, 2012", "message": "This is the saddest news I've heard in ages. Just hope that the god that is Jeff returns. To say he changed my life is no understatement for if it wasn't for my feeling of fascination by his hilarious critique of code over at Coding Horror, followed by awesome rise to success with Stack Overflow and Co, I would never have gotten back to college, then university, and now earning a decent wage as a developer. You changed my very small life in an unimaginable way. I just hope you do come back. That small beacon of hope is all that stops me bawling like a baby. Thanks for everything man, and congratulations. We the community salute you as proof that new ventures online can work if you are intelligent, analytical, witty, and motivated."}, {"author_name": "Allen Conway", "gravatar_hash": "2311a032d27f8278b61dac7574a00931", "author_url": "http://allen-conway-dotnet.blogspot.com/", "date": "Mar 01, 2012", "message": "Congrats! I have twin 1 year old girls and a 4 year old girl, plus a wife (yes understand the ration 4:1). Life is challenging and I admire you for being able to not have to work. Both my wife and I work so life is always full and free time is sparse (hence my &lt; 1000 rep on SO) :P\n\nGood luck and have fun Jeff!"}, {"author_name": "Feral Oink", "gravatar_hash": "8cce7b70d30f42045bc6c8569f5549e2", "author_url": "http://myindigolives.wordpress.com/", "date": "Mar 01, 2012", "message": "Jeff: Congratulations! I only wish I had discovered StackExchange a few years earlier. Like CSharpEvermore, I read your Coding Horror blog, then found my way here. I appreciate the meritocracy that is StackExchange. Really, it is, in comparison to other similarly purposed websites.\n\nBest of luck to you &amp; your family. You (and Joel) helped many people get accurate advice about English, Wordpress, math, economics, quant finance, French, even SQL now and then. Thank you!"}, {"author_name": "Cordie", "gravatar_hash": "2783c725a9d0f44d9b7fe66d2eafa606", "author_url": null, "date": "Mar 06, 2012", "message": "Looks like the stackexchange investors are not happy with Jeff's moral  integrity."}, {"author_name": "Voislav Sauca", "gravatar_hash": "72f6bd498fc6deaf9ac2f91e1f250e6e", "author_url": "http://www.voislavsauca.com", "date": "Apr 02, 2012", "message": "All the best:)"}]}