{"response": [{"author_name": "Nick T", "gravatar_hash": "f6c0ac45bcae6669b2739e9e33e00f8b", "author_url": null, "date": "Feb 29, 2012", "message": "Yeah, I've long been wanting to obliterate identify-this-game (ITG) from Gaming as it is far too problematic/subjective to determine if any given  ITG is specific enough to fit the \"rules\" and be allowed to stay.  Banishing them all is a much cleaner solution."}, {"author_name": "joe larson", "gravatar_hash": "2b5281974a45573daa6409ce4478b40d", "author_url": "http://joewlarson.com", "date": "Feb 29, 2012", "message": "Understood. Where should a person with a guessing game question go then - meta? chat? Quora? ExpertSexChange?"}, {"author_name": "Steve", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Feb 29, 2012", "message": "So... what is the outcome of this?... will there be a \"close as: looks like a guessing game\" question"}, {"author_name": "Lucas Arruda", "gravatar_hash": "b4a8c65887f9fed0970287904e92b3d3", "author_url": "http://lucasarruda.com", "date": "Feb 29, 2012", "message": "Well, even though I agree with you, Joe Larson has a good point. Mainly because, the way StackExchange community is build and the way the sites and infrastructure is optimized and not to count the amount of members it has, it makes it fairly easy to get this type of questions answered.\n\nPerhaps only allow this kind of questions when they are not too obvious or at least not documented/present on the Internet in a easy way to be find. \n\nAt least it makes sense to ask here where you can't easily find somewhere else."}, {"author_name": "Jacob", "gravatar_hash": "97296f4eb35ae5756e67a2a148735c3b", "author_url": "http://jacobeggers.com", "date": "Feb 29, 2012", "message": "@joe Exactly, these questions can get answered. They're useful for the people asking. So, where should they be asked? If the questions bother you, it's pretty easy to block a tag, so just block the tag."}, {"author_name": "Phil Pursglove", "gravatar_hash": "ee753c26051b3cc45094e20aa73b93a1", "author_url": "http://philpursglove.blogspot.com", "date": "Feb 29, 2012", "message": "I get what you're saying, but the FAQs for SciFi and Literature both explicitly state that story identification questions are on topic for the sites."}, {"author_name": "Nick T", "gravatar_hash": "f6c0ac45bcae6669b2739e9e33e00f8b", "author_url": null, "date": "Feb 29, 2012", "message": "@Jacob a recommendation question can also be answered and is useful for the person asking.  The issue is that it's useless for most other people that stumble across it, and other people are generally unfit to judge the \"correctness\" of an answer and vote on it appropriately, so tying it into the rep system is just useless."}, {"author_name": "Cade Roux", "gravatar_hash": "d45ef03e9450599588bf733662f792e5", "author_url": null, "date": "Feb 29, 2012", "message": "People find the existing sites valuable enough that they want to use them - Building a community requires people to want to come and ask questions.  If their questions have to be so carefully chosen before asking them that it becomes a chore, people will move to communities with rules which are easier to comply with. i.e. the terrible bulletin-board/forums\n\nThe arbitrariness of moving questions between stacks and closing questions which are not the canonical Q&amp;A for a specific topic weaken the community aspect of sites - which is fine if your target is the library of Alexandria."}, {"author_name": "dmckee", "gravatar_hash": "9100fb18460057e68cadc6132add0f7f", "author_url": null, "date": "Feb 29, 2012", "message": "I have to say that on SciFi they have worked better than I anticipated.\n\nThe big surprise for me has been how *few* answer most of them have. Users *aren't* just throwing out every vaguely related story they've ever read (well, some in the comment, but those are transient).\n\nThe site has a pretty strong norm for editing the titles to be maximally descriptive, which may help.\n\nNow the big questions is \"How many people find their lost story by search for previous [story-identification] questions?\". If the answer is near zero then I have to agree with Jeff, if it is significantly non-zero then I have to disagree. Anyone have a thought on how to figure it out?"}, {"author_name": "Pat George", "gravatar_hash": "097693527848bfac69f3675f9e0d4b86", "author_url": null, "date": "Feb 29, 2012", "message": "That's too bad.  I always liked knowing I could come to SE if I had one of these.  I personally think the SE sites will be worse without them."}, {"author_name": "joe larson", "gravatar_hash": "2b5281974a45573daa6409ce4478b40d", "author_url": "http://joewlarson.com", "date": "Feb 29, 2012", "message": "I think SE sites needs not only core QA, Meta and Chat, but also a \"Free Range\" section in which any kind of question can be asked and answered in a way that is managed like core QA but does not effect rep.  Questions that get rejected from core QA would automatically bounce over to the Free Range section..  SE gets to serve Ads for these questions, and gets to keep the community engaged fully within their ecosystem, without rejecting them completely.\n\nIt is only because we love SE that we ask all our questions on it, including stupid ones.\n\n---\n\nalso, man recaptcha sucks, I have refreshed about 5 times without seeing one i can actually read!"}, {"author_name": "dmckee", "gravatar_hash": "9100fb18460057e68cadc6132add0f7f", "author_url": null, "date": "Feb 29, 2012", "message": "It occurs to me that duplication rate might be a handle on how often people are using existing questions to find existing answers (i.e. the question are being useful). \n\nSome metric like (mean number of duplicates)/(mean number of views) on a per tag basis?\n\nI'll work up an explorer query eventually, unless someone beats me to it."}, {"author_name": "Jacob", "gravatar_hash": "97296f4eb35ae5756e67a2a148735c3b", "author_url": "http://jacobeggers.com", "date": "Feb 29, 2012", "message": "@Nick I hadn't heard of these tags before, (stackoverflow user here) but I'm browsing `single-word-requests` on english.stackexchange now, and I quite like it.\n\nI would keep these tags."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Feb 29, 2012", "message": "They are fun while they last, but I think these types of questions generally fail the \"adds more signal than noise\" test.\n\nI think chat would be the best place for these if your site has an active chat room.  If you can come up with a good enough description to interest other people they can star them so they stay pinned in the sidebar for a while.  Other people can reply directly back to you if they know the answer, so the one person these questions actually help will get the answer."}, {"author_name": "dforck42", "gravatar_hash": "026f3abfbd6ac89b6dbabbd4cef2e83d", "author_url": "http://literature.stackexchange.com", "date": "Feb 29, 2012", "message": "So, are we supposed to consider these off-topic netowrk wide now and should start closing them?"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Feb 29, 2012", "message": "@dfork42: use your judgement. This post spells out pretty clearly HOW and WHY these questions cause problems, so you should be able to recognize the problems when you see them. Deal with them as you'd deal with any other problematic question."}, {"author_name": "Eduardo", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": null, "date": "Feb 29, 2012", "message": "\"we found a popular trend in SE, let's kill it\""}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Feb 29, 2012", "message": "@Eduardo \n\nit is not popular <b>for the right reasons</b>, though, see: \n\nhttp://blog.stackoverflow.com/2012/01/the-trouble-with-popularity/"}, {"author_name": "badp", "gravatar_hash": "e64b121f4d288e1f5a34d3f4dc8ebfb9", "author_url": null, "date": "Feb 29, 2012", "message": "I'm glad to hear that the rest of the network and the other kinds of questions don't, after all, suffer from the same issues of discoverabilty and duplication that identify-this-* questions have.\n\nLike 80% of Stack Overflow, that really is identify-this-bug. For the three duplicate ITG questions you've found on gaming, I can raise you 400 questions about incorrectly handling character sets in Python 2.5, 40 of which asked in the last two months:\n\nhttp://stackoverflow.com/search?q=+ordinal+not+in+range+closed%3A0\n\nEven stronger measures such as banning the worst askers really didn't help much here.\n\nIs the solution banning all identify-this-bug questions on Stack Overflow? I'm certain we can do better than just \"BAN THEM ALL.\""}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Feb 29, 2012", "message": "Not exactly. In the \"identify this bug\" case you have <i>compilable source code</i>, whereas a true guessing game question only has vague remembrances.\n\nIt's a big difference."}, {"author_name": "Malcolm", "gravatar_hash": "acc9ff1ba30ea1b7581a53030084b290", "author_url": null, "date": "Feb 29, 2012", "message": "’d say this is rather debatable. If a person really vaguely recalls something and makes other people guess for him, this really is a bad question. But if a description is more or less precise, then the question becomes pretty much answerable. Also question about single words are quite different from guessing something because the author is not trying to remember something, he is trying to find a name for a specific concept. I’d say this is absolutely answerable. So I’d say questions like this are not inherently vague and thus impractical, only easy to not get them right.\n\nCounterarguments to the rest of the points are similar. The fairness depends on the specificity of the description. In the case with the words I think it is perfectly fair if a person comes up with the most commonly used word for a specific concept. The author can't know which word will suit him best beforehand. With the games or stories the description can be less specific in most cases, but still if it is, the right answer will not be a wild guess, therefore it is absolutely fair.\n\nAs for the educational value: if a question is specific, then you broaden your vocabulary (literally in the case with the words and figuratively with stories and games). With the words it works quite well, to my mind: if a person can't come up with the name of the specific concept himself even after doing some research (in other words, the question is a good question), it is likely to be something others won't know as well. The answer will probably be either a rare word, or a rare meaning for a word.\n\nNow only the helpfullness for the others remains and this may be true because it is not easy to search for a description and not a term (if we don't take the educational value for consideration). But where should I go with this kind of questions then? If I have a good description question (description is specific, I have searched for the answer, and so on), I still need experts to help me, and where shall I look for them if not on StackExchange? Forums, maybe, but they are fit for discussion, not questions.\n\nSo the main point is that these questions are not easy to get right, but this doesn't mean all of them should be frowned upon regardless of the quality."}, {"author_name": "Ilmari Karonen", "gravatar_hash": "9905bf9a7b8d5a587c1bdff07ef2e801", "author_url": "http://vyznev.net/", "date": "Feb 29, 2012", "message": "Well, I'll be sad to see them go.\n\nI don't usually ask questions if I can find the answer myself, and I usually can — my Google-fu is pretty strong.  But the one time I was stumped enough to actually ask a question on SE, it was a story-identification question about an obscure Philip K. Dick short story I'd read years ago:\n\nhttp://scifi.stackexchange.com/q/4732/2489\n\nIt actually took me several months to decide that, no, I wasn't going to be able to find the answer myself, except maybe by checking out every Dick anthology I could find from the local library and re-reading them.  Yeah, I know — I just tend to be kind of stubborn than way.  But I went and asked the question, and you know what?  I got an answer, in less than two hours!  And I'd at least like to hope that my synopsis was detailed enough that someone else, remembering the same story, might now be able to find that question on Google.\n\nIt's still the only real question I've ever asked on SE — code golf doesn't count."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Feb 29, 2012", "message": "<i>Also question about single words are quite different from guessing something because the author is not trying to remember something, he is trying to find a name for a specific concept</i>\n\nExcept that word <b>might not even exist at all!</b> If you remember hearing a word that kinda-sorta met your criteria, which is usually the case, then it's a typical remembering question."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Feb 29, 2012", "message": "I really think that the balance of attention has shifted far too much in the direction of \"get rid of these offending questions/answers\" away from \"attract good questioners and answerers.\"\n\nI know that the deletionists believe these impulses are one and the same -- that people will be attracted to a community without these bothersome guessing game questions and where every question in precisely on topic for the site and there are no meme-ish fun posts.\n\nI think it's the opposite.  Most of us have jobs where what we have to do what people tell us to do.  The last thing we want to do in our free time is visit a Q/A site where we're going to get our hand slap if we veer too far from the straight and narrow."}, {"author_name": "Brad Leach", "gravatar_hash": "00e39a04e47171773c803e347c6ee924", "author_url": null, "date": "Feb 29, 2012", "message": "This is an interesting problem. As Jeff mentions in one of comments, the \"fun\" questions also don't have a home at the StackExchange sites. It also seems that questions that don't have a factual answer don't really belong on StackExchange (i.e. opinionated answers). \n\nA perfect example is this answer I gave about WPF books (http://stackoverflow.com/questions/9591/what-wpf-books-would-you-recommend). It seems to be a useful answer to many people. I've got lots of upvotes for it. However, it's my opinion, and the question can't ever have a factual answer - thus, by the site rules, it is not a good question and thus has been closed and locked.\n\nThe team at StackExchange have done a truly wonderful job of bringing communities together. These communities have questions that may not have a factual answer. Remembering that old book name from a plot you half remember may not be useful to others (although it could be). Getting opinionated advice about a technology stack dilutes the facts, but can also be very useful.\n\nIt's a difficult tightrope the team are facing."}, {"author_name": "bcs", "gravatar_hash": "f2d485d809e88339a6f78e584ce760b3", "author_url": null, "date": "Feb 29, 2012", "message": "I'd suggest creating a \"what's that thing?\" Stack exchange for ONLY this kind of question. A somewhat related thought is a \"facts\" site for questions that have a one (or a few) precise answers that are hard to locate without specialized knowledge about what to look for.\n\nHowever, that (or they) would be to generalized and wouldn't draw enough experts in any given field to work.\n\nMight there be value in adding this as a \"sidebar\" channel of some sort? Questions are limited to tweet lengths and answers are limited even more (links would be free). Auto include links to \nLMGTFY and other site specific sources. Age questions quickly: auto lock them after O(week)."}, {"author_name": "Jacob", "gravatar_hash": "97296f4eb35ae5756e67a2a148735c3b", "author_url": "http://jacobeggers.com", "date": "Feb 29, 2012", "message": "@codinghorror It's pretty clear that most people feel that these kinds of questions do belong on the stackexchange site. At least in some form.\n\nThe post you linked describing \"not popular for the right reasons\" was talking about topics that are popular because they are fun. These identification tags aren't popular just because they are fun, they are actually productive.\n\nMaybe the rule that \"You should only ask practical, answerable questions based on actual problems that you face. Chatty, open-ended questions diminish the usefulness of our site and push other questions off the front page\" is too strict. Consider this question, asking for a layman explanation of the weak force: http://physics.stackexchange.com/q/4428/5207 This is clearly an open ended question with no one right answer, yet it is also clearly the perfect kind of question for physics exchange.\n\nI think you may have confused a personally disliked topic with an unproductive topic."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Feb 29, 2012", "message": "> These identification tags aren’t popular just because they are fun, they are actually productive.\n\nThey are productive for one person, the original question asker. They're largely a game of \"go fish\" for the experts on the site, e.g. \n\n<blockquote>“Is it mentor?” Nope, try again! “Is it Star Fighter XXIV: The Star Fightening!” Sorry, go fish!</blockquote>\n\nAnd to the rest of outside the world, they're unfindable, buried artifacts."}, {"author_name": "Jacob", "gravatar_hash": "97296f4eb35ae5756e67a2a148735c3b", "author_url": "http://jacobeggers.com", "date": "Feb 29, 2012", "message": "@codinghorror I used to work in a bookstore a number of years ago, and people would always come in asking for things such that red book with a cutout dog, or a blue book with a tiger on it (Actually asked, multiple times). To the novice, that is a game of go fish with no reuse, but to any bookseller worth their salt, those were an immediate \"The Curious Incident of the Dog in the Night-Time\" and \"Life of Pi\" respectively."}, {"author_name": "greyfade", "gravatar_hash": "9f0e4ed8302b4c11c4135a09bfe15e9e", "author_url": null, "date": "Feb 29, 2012", "message": "I'm not sure I agree with the premise here: Do questions like this really, *truly*, have a negative effect on the site as a whole?\n\nI find the idea rather dubious, to be honest. Sure, it might result in a false-positive for someone searching for something else, but how is that necessarily a bad thing?\n\nHow does this go against the site being educational? Indeed, I'd counter that it makes the site all the more valuable, as there is something to be learned from the vagueness of the question: People don't remember everything they see or read. These vague gists lend themselves to an understanding of what may be memorable about something.\n\nOn the Language site(s), I can see how these are especially valuable - someone looking for a word that has a particular meaning, especially if they can't really find the right synonyms to describe it, is not going to find it in a dictionary or thesaurus. Learning a definition from its (obscure) word is, to me, not as valuable as having the opportunity to learn the word that clearly encapsulates the definition. Even as a way to simply educate oneself by adding to your vocabulary, this, I think, is a perfect way to do it.\n\nMoreover, it seems questions like this, while valued by portions of the community and abhorred by others, have no place - there is no StackExchange site where these questions would otherwise be accepted, and there are no equally active communities filled with as knowledgeable people that could answer some of these questions. Where, then, is one expected to find the knowledgeable and helpful people that StackExchange sites attract? How do I answer these hard questions? On Yahoo! Answers, where the SNR is somewhere around 0?"}, {"author_name": "msh210", "gravatar_hash": "78a50094ca87aaed01e076f4c8808ed8", "author_url": "http://judaism.stackexchange.com/users/170/msh210", "date": "Feb 29, 2012", "message": "I agree with this blog post with respect to identify-this-book or -film or -game questions. But find-a-word-for-this-meaning (reverse-lookup) posts on EL&amp;U are downright useful for future visitors, and are Googlable. Consider https://www.google.com/search?&amp;q=weekly+biweekly+triweekly+%22every+four+weeks%22 for example."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Feb 29, 2012", "message": "@msh210: While I'm not particularly fond of the answer on that question, it is an example of a question that CAN be answered objectively - at which point, you're not playing a guessing game anymore. Here are some more:\n\nhttp://english.stackexchange.com/questions/6414/is-there-a-single-term-for-nieces-and-nephews\n\nhttp://english.stackexchange.com/questions/6798/is-there-a-word-for-four-times-as-much-analogous-to-once-twice-and-thrice\n\nhttp://english.stackexchange.com/questions/31675/what-comes-after-octuplet\n\nNote how striking the difference is between these and, say, http://english.stackexchange.com/questions/9108/is-there-a-word-meaning-a-problem-that-has-to-be-solved-in-order-to-work-on-anot - a seemingly reasonable question resulting in 15 different answers (one actually consisting of 20-something other suggestions). \n\nParticularly bad are the questions from askers who already *know* there are multiple valid answers to what they're asking, but rather than trying to provide something in the way of guidance simply wait for folks to post a list so they can pick one for their own inscrutable reasons. Ex: http://english.stackexchange.com/questions/42322/a-vocabulary-word-meaning-to-completely-embody-the-meaning-of-a-term\n\nFWIW, I've written about this before: http://meta.english.stackexchange.com/questions/2160/single-word-requests-crosswords-and-the-fight-against-mediocrity"}, {"author_name": "GSerg", "gravatar_hash": "d4d284c3c214d52f004df795aee394e3", "author_url": "http://stackoverflow.com", "date": "Feb 29, 2012", "message": "This is just sad. Emotionally sad, as it is sad to see your better feelings diminished.\n\nFor no reason, a game from the days when I was a child would pop up in my mind. The memory is not that vivid when it comes to visual details, but the fun I used to have and the fact that I never finished the game are well damn real.\n\nI go on Wikipedia, where there are comprehensive lists of games grouped by consoles. I spent literally *hours* stepping through them, opening pages that look promising, googling when a promising name doesn't link to a page. I look through lists of ROMs available online. But I just cannot find it. And then I do my best at writing my (vague and imprecise) memories down and post it on [games].\n\nAnd I get an answer. And it is the right one. I do not want to build a list of games that would fit my \"requirements\" and then play them at my leisure. I do not want to make it a poll; I particularly, specifically do not want to know people's opinions on whether the game whose name I'm trying to recall rocks or sucks.\n\nIs my question open-ended? Not in the slightest. There is only one exact definitive answer. The only right one, which makes it answerable and not opened to prolonged discussions.\n\nIs it not possible to answer because it is vague? There is a chance; but as I said, I do my best at wording, and I get an answer, and other people get their answers, too. Because the answers are steadily found for these questions, they are, by evidence, answerable.\nUnless it is a poorly worded question, which there are many as well, but then, there are much more absolutely awful questions on programming on Stackoverflow, and noone says this is a reason to stop taking questions on programming. Poor questions get downvoted and closed on SO. Poor game-finding questions get downvoted and closed just as quickly on games.\n\nIs it too localized? Yes, it is! The only point against which I have no valid objections. I have an invalid one though: There are even more too localized questions on programming, the essence of which lies in a missing bracket in the expression, and they get answered and not closed as too localized.\n\nIs it impossible to find / unhelpful to others? Maybe it is, and maybe it is not. Identify-this-game questions do get closed as duplicates, so at least, \"not entirely.\"\n\nIs it unfair because I spit some unintelligible blubbing of mine in community's general direction and now having my coke while other people are doing my job? It is not. I've done my homework. I have a good chance to be right in saying that I've done more searching than any of my anticipated answerers will have done. I do not expect them to search for me. I hope my question will ring a bell for them. And it does.\n\nDo I want my question to be a little trivia? Do I want others to play the guessing game with me? Upvoting answers that suggest games that fit my description in an unexpected, clever way? For God's sake, no. NO. I want to reunite with a little piece from my childhood.\n\nSo, as I said, it just makes me sad. The way in which this intention of mine was perceived. Without any offence meant, I do think there are better things to fight against."}, {"author_name": "Peter Turner", "gravatar_hash": "edfa1f5a3274d9d6faa2035e6cd32077", "author_url": null, "date": "Feb 29, 2012", "message": "We've got this kind of stuff going on on Christianity.SE in the form of \"Where does it say X in the Bible?\" and on Gardening.SE in the form of, \"What is this thing growing out of my bathroom sink?\".  So, do those all go out with the kitchen sink as well?"}, {"author_name": "Becca", "gravatar_hash": "e1f06ae1247be9946e54cd4991326c33", "author_url": "http://nutrendmedia.com.au/", "date": "Feb 29, 2012", "message": "Very interesting games. We will try this in our coming family reunion.\nthanks for sharing."}, {"author_name": "Oded Sharon", "gravatar_hash": "a44e1dcfafeac8020876651a6047615c", "author_url": null, "date": "Feb 29, 2012", "message": "guessing games are informational, but they're fun. perhaps they simple need another place to be..."}, {"author_name": "msh210", "gravatar_hash": "78a50094ca87aaed01e076f4c8808ed8", "author_url": "http://judaism.stackexchange.com/users/170", "date": "Feb 29, 2012", "message": "@Shog9, I don't see the difference between the first three links you list (nephew, frice, nonuplet) and the next two (lemma, epitomize) except that the former have good answers and the latter do not. The asker (if asking in good faith, viz putting all his relevant knowledge into the question) does not know that, so the too-localizedness of the former questions is the same as that of the latter ones."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Feb 29, 2012", "message": "@msh210: the difference is simple - the first three were specific enough to HAVE good answers; the next two were not. That doesn't mean they were asked in bad faith - but the end result is the same as if they were: anyone answering must be prepared to hear, \"go fish.\""}, {"author_name": "fredley", "gravatar_hash": "d8d1d62f89cf41fb5ff7a06e1b5c22fb", "author_url": null, "date": "Mar 01, 2012", "message": "Surely guessing games are one of the reasons we have chat?"}, {"author_name": "Paul Morriss", "gravatar_hash": "8691b744cb9151e4a173a23eb44eab3b", "author_url": "http://paulmorriss.com", "date": "Mar 01, 2012", "message": "I wonder how many people on SciFi are asking questions because they have a problem they have to sort out? (Apart from those doing research for dissertations etc.) Whilst that rule about \"problems you face\" makes sense for some sites, I don't think it applies to all sites. The second half of that first rule - \"chatty, open ended\" - I agree with, but doesn't apply to these, because there's probably one answer when it comes to, say, books/films, and a small number when it comes to words."}, {"author_name": "Malcolm", "gravatar_hash": "acc9ff1ba30ea1b7581a53030084b290", "author_url": null, "date": "Mar 01, 2012", "message": "@JeffAtwood\n\nIf a word doesn't exist, this doesn't seem to be a big problem for me, the correct answer will be a word combination in this case.\n\nAs for remembering the word, I'm not entirely sure how it works. With the game it is simple: you remember there was some game, but you can't provide every detail of it. However, with the word you describe a concept which exists anyway. As for the word itself, you either remember it or not. In the first case you have only a game, in the second case you have a concept and a word which exist independently of each other. In my opinion it's not the same."}, {"author_name": "Pierre Lebeaupin", "gravatar_hash": "68795690302f37a7119d8e340c73e4c9", "author_url": null, "date": "Mar 01, 2012", "message": "Let me tell you a story… (stop me if I start sounding like Joel Spolsky)\n\nI was reading Spinnerette, and <a href=\"http://krakowstudios.com/spinnerette/2010/11/10/11102010/\" rel=\"nofollow\">this page</a> immediately reminded me of something. I remembered a TV series with a hero that was a researcher or something, who was hemiplegic for reasons I can't remember, and who managed to build a bulky, diving suit-like armor in which he could walk again, but not only, in it he was pretty much unstoppable (I could remember him being hit by a car in his armor, and the armor wouldn't budge). Just like Marilyn/Mecha Maid, he could not be normal: either handicapped, or a superhero, and a researcher to boot (okay, it was just like her up until I got to the bottom of the page; yes, I did the following search in between reading the first half and the second half of the page; anyway…). So I started searching the web for this work, I quickly found <a href=\"http://www.imdb.com/title/tt0108843/\" rel=\"nofollow\">MANTIS</a>, but that was not it (the one I remembered had a 70's-80's aesthetic). After some time, I did manage to finally find <a href=\"http://www.forumsfu.com/index.php?topic=547.0\" rel=\"nofollow\">this forum topic</a> which told me it was <a href=\"http://www.imdb.com/title/tt0076008/\" rel=\"nofollow\">Exo-man</a> (turns out, it was just a made for TV flick, maybe a pilot for a potential series, not a full series). I could tell the same story about <a href=\"http://www.imdb.com/title/tt0084988/\" rel=\"nofollow\">Blackadder</a>, a few other things I saw on TV a long (or not so long) time ago, etc.\n\nMy point is that just like there are programming, troubleshooting, and many types of questions that are/were traditionally asked on forums and that are \"stuck\" there with either no answer, bad answers, a good answer but three pages afterwards, a good answer which you have to piece out from the various posts as it got progressively discovered, or a good answer but no alternative answer in case you would like more than one option (and as always in forums, a lot of noise, signatures, etc.), such guessing questions are stuck there too and are findable as well and are useful for more than one person, I'm sorry.\n\nI admit it's not a clear cut case, and I have nothing but respect for the way you manage Stack Overflow/Stack Exchange and how you take quasi-editorial decisions so that the sites remain high signal and low noise, and I know that just because something can be done it doesn't mean it should be done, so I'm not going to take you to task for any decision you take about these. That being said, I think something useful would be lost if you were to discourage guessing game questions, as (provided some effort from the asker, as with every question) these do make the Internet better too."}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Mar 01, 2012", "message": "\"The goal of Stack Exchange is not to construct un-findable single-serving questions that only help one person, but that’s exactly what guessing game questions tend to do.\"\n\nThis seems like an awfully unlikely claim - how many \"Why does (1/3.0) * 3 == 1?\" questions do we have on Stackoverflow?  That doesn't mean they're not helping anyone, just that people don't search beforehand.\n\nAnecdotally, I've found several games I was searching for on gaming.SE through google.  I really appreciated not having to google for hours, like I often do."}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Mar 01, 2012", "message": "\"Why doesn't\"*** of course :)"}, {"author_name": "Martha", "gravatar_hash": "f86f8f8ff9e1217108e14251ba80ba60", "author_url": null, "date": "Mar 01, 2012", "message": "One last kick at the poor deceased horse before you leave? (You're still wrong about all of these types of questions, but I know there's little chance of convincing you of that fact.)"}, {"author_name": "UncleZeiv", "gravatar_hash": "bd24dab59beada36b501670cd01b8e2c", "author_url": "http://unclezeiv.kerid.org", "date": "Mar 01, 2012", "message": "Jeff, I usually understand the reasoning behind many \"unpopular\" StackExchange policies, but this time I'm really puzzled. If this is meant to read as \"moderators, watch out for this kind of questions\", then fine. If this is more like \"let's ban this kind of questions\", then it's really sad that this is your legacy.\n\nI agree with what @greyfade said, and I add: what happened to the long tail? Frankly, a \"find the word\" question is much more likely to be at the very least interesting, if not outright useful, for someone else, rather than the super-answerable \"obscure bug #345\" with three screenfuls of code.\n\nFinally, this is very different from the popularity of \"memes\", that could easily collect hundreds of votes *each* because of the broad appeal."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 02, 2012", "message": "Well, look at the data.\n\nhttp://scifi.stackexchange.com/search?q=views%3A500\n\n571 questions with views of 500 or more.\n\nOf those ONLY SIXTEEN, 2.8% are [story-identification].\n\nhttp://scifi.stackexchange.com/search?q=%5Bstory-identification%5D+views%3A500\n\nThat’s a little odd, don’t you think, considering [story-identification] is the second most common tag on the site?\n\nLike I was saying.. “The goal of Stack Exchange is not to construct un-findable single-serving questions that only help one person, but that’s exactly what guessing game questions tend to do.”\n\nI know they’re fun in a way, but a) we’re not shy about demoting fun when it isn’t producing useful artifacts and b) you have to take a cold, hard look at the utility of the artifacts that are produced."}, {"author_name": "Tony Meyer", "gravatar_hash": "929fba6f82f04811b09c16df239bbb21", "author_url": "http://scifi.blogoverflow.com", "date": "Mar 02, 2012", "message": "Yes, let's look at the data.\n\nhttp://data.stackexchange.com/science%20fiction%20and%20fantasy/query/edit/62919\n\nOnly three tags, from massively popular franchises (at least two of which had separate Area51 proposals that were merged into scifi.se) have contributed more views: [star-wars], [star-trek], and [harry-potter] (the C#, Java, and PHP of the scifi/fantasy world...)\n\n[story-identification]'s views are spread over more questions, sure, but even per question the average is around the midpoint of all tags, and it's a lot more views than \"one person\".  [story-identification] also misses out on the outlier super-popular questions, which account for the view count of the 10 most popular tags by view, and skew the mean of some of the others.\n\nhttp://data.stackexchange.com/science%20fiction%20and%20fantasy/revision/62889/65922/average-number-of-views-for-the-top-20-tags"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 02, 2012", "message": "@Tony scoping that query to tags with at least 20 questions so there’s actually <i>sufficient data to analyze</i>, [story-identification] ranks 41st out of 43 total tags in average views per question.\n\n(just add <code>having Count(*) &gt; 20</code> to the query clause)\n\nSo I guess it’s a “success” that the 2nd most popular tag on the site isn’t, uh, dead last in average views. It did beat [fantasy-genre] and [the-new-52] at 202 and 166 average views per question."}, {"author_name": "tim", "gravatar_hash": "94a0e83767dbc71db135454693540015", "author_url": null, "date": "Mar 02, 2012", "message": "Not surprisingly, I disagree with Jeff yet again.  These types of questions ARE useful and the \"popularity\" of them is a good indicator that they are useful and serve a purpose."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Mar 02, 2012", "message": "To rephrase my objection, I think the focus is too much on the visible problem of questions that are a bit off scope rather than the invisible problem of contributors who don't think the SO sites are a worthwhile investment of their time.\n\nI want to be able to write a question with out racking my brain over whether it's truly on topic for the site or \"makes the internet better.\"  I have a question -- I'd like an answer.\n\nI want to be able to upvote an answer I find useful and correct without being nagged to also upvote questions.\n\nI just have a general feeling that on the SO sites, I'm being treated like a kid, subjected to all sorts of nudges, rules, and suggestions so I don't screw up the whole thing.  As I said on another thread, perhaps this is inevitable given the scale of the SO sites.  But my personal preference for where I spend my free time is a place where I'm treated like an adult."}, {"author_name": "Durathor", "gravatar_hash": "3033d12bf56a6535c7f8155ed757a73c", "author_url": null, "date": "Mar 03, 2012", "message": "SO has guessing games too - e.g. I'd like a control that does X (e.g. http://stackoverflow.com/questions/9545103/you-are-here-links).  Or the many 'my website looks strange please correct my CSS' type questions.\n\nI'd like to echo some of the other commenters that being able to ask an identify question can be very powerful - leveraging the entire community memory vs your own.  \n\nFor example I have a sci-fi short story that I kept telling friends about, but couldn't find in my collection.  After years of looking (and contemplating re-reading the entire collection) I asked on sci-fi and had the answer in 10 minutes! I don't know anywhere else on the internet I could go for that kind of help: http://scifi.stackexchange.com/questions/1820/identify-short-story-war-with-changing-time-speed-further-from-the-front\n\nI worry that SE as a whole is so afraid of turning into Yahoo answers that many lines of questions get shut down, preventing communities from flourishing.  There are certainly SE sites that I stay on the edge of, because my attempts to ask questions fail one criteria or another.  \n\nBy contrast SO seems somewhat more 'anything goes' because of the sheer size of it.  I'm not sure that just because someone has 'compilable source code' (arguably a flawed description of an idea) that doesn't work it is much more useful to more than the asker than the flawed descriptions of remembrances brought to other SE sites."}, {"author_name": "Durathor", "gravatar_hash": "3033d12bf56a6535c7f8155ed757a73c", "author_url": null, "date": "Mar 03, 2012", "message": "Conclusion repeated &amp; extended...\n\nBy contrast SO seems somewhat more ‘anything goes’ because of the sheer size of it. I’m not sure that just because someone has ‘compilable source code’ that doesn’t work (arguably a flawed description of an idea) it is any more useful to the internet at large than the flawed descriptions of remembrances brought to other SE sites.  \n\nPerhaps if people start searching for similar remembrances these questions and answers will help make the internet better too.  After all we're outsourcing our memory to the internet (http://www.sciencemag.org/content/early/2011/07/13/science.1207745).  \n\nPerhaps one aspect of SE is destined to be the retrieval part of that system for memories and information that don't float on the surface of Google."}, {"author_name": "Feral Oink", "gravatar_hash": "8cce7b70d30f42045bc6c8569f5549e2", "author_url": "http://gooplex.wordpress.com/", "date": "Mar 04, 2012", "message": "Just consider this please, on Literature SE (not Writers SE), and tell me how this is constructive. Not only is it a guessing game, it is impossibly specific for anyone to answer. To even ask this question expecting an answer is scary. But we've left the question open, so as not to discourage participation. It is tagged \"Book recommendations\". http://literature.stackexchange.com/questions/1441/quality-examples-of-fast-forwarding-in-modern-novels-movies-etc\n<blockquote>I want to start the story from a part near the end after the climax. The serial is 4 parts (only three planned with 1-2 TBD) and the start of the first part I want to give a view of how the characters will be throughout the serial; the whole book is an origins' story so they start  quite different from how they become at the end and by extension the glimpse the reader is presented with at the beginning\n\nExplanation: (Numbers followed by dots indicate order in the book, by hyphens indicate the chronological order.)\nThe characters are presented just after the main plot of book 1 is finished and before the foreshadowing of the main plot of book 2 (3-)The narration rewinds 31 days; just before the main plot of book 1 starts to appear.Due to time-travel, the time the characters spend is longer and their personalities are quite different comparing when they begin at (1-) and when they end up at (3-) which are (in real-world time) 31 days apart.\nThe story proceeds until the climax and the portion first represented at the beginning of the book; more is revealed there including the final round ups and teasers.So, I want quality recommendations of novels, short stories, movies, etc... that use this method.</blockquote>"}, {"author_name": "kolobos", "gravatar_hash": "db8cf63c2d979e2311a8feb3bd0d3dc8", "author_url": null, "date": "Mar 16, 2012", "message": "Please remove the first example (\"I remember myself playing this a bit childish, but in some ways awesome game\"), because:\n1) The author (me) remembered the game very well.\n2) After the vague part you cited it had very descriptive bullet point list of the game features.\n3) The vague part isn't really vague: there are not many games where you can stack multiple turrets/guns on top of your tank - trust me.\n4) Because of all of the the above, it was answered in no time, and deleted after it was answered.\n\nOriginal question: http://gamingqna.blogspot.com/2012/02/2000year-3d-tank-game-where-you-can.html\nI usually don't care, but this time looks like manipulation.\n\nI agree that identify-this-game questions have some issues, but not very happy that the place that seemed like a most appropriate (and useful) for them (gaming.stackexchange.com) is now gone."}, {"author_name": "Gilles", "gravatar_hash": "a717291747c76567bb0f086e15ae6e43", "author_url": "http://stackexchange.com/users/164368", "date": "Apr 01, 2012", "message": "I made a little experiment: I wanted to see if your arguments could be generalized to other types of questions. It turns out that they apply to all kinds of questions, for example…\n\nhttp://meta.stackoverflow.com/questions/127706/how-to-do-my-job-or-ban-the-word-how-in-questions\n\n(I admit I couldn't find a snappy name like “guessing game”. But it's scary how little I had to change. Clearly, these questions need to go too.)"}, {"author_name": "Greg", "gravatar_hash": "e4567c809ac54619a9c54d731bf30881", "author_url": null, "date": "Sep 13, 2012", "message": "my post may prove to be half-off-topic.\ni submitted an itd-type question, without knowing it was one. in fact, it was the very first time i did this, as i don't want others to do my work for free.\n\ni got the answer almost immediately, and was happy with it. unfortunately i forgot to write the answer on a piece of paper - and now it is gone.\n\ni don't quite want anyone to make an exception of my question. i wish to share my opinion that these type of questions are indeed unfair, will not help others, and are not quite educational either. in my case, it was at least a little practical, of course, since someone identified the game - both games, to be precise - for me on the first try, based on (and possibly because of) my lengthy description. i even got a badge for my question. i was extremely happy, because i've spent \"countless\" hours looking for the answer on the web first, but the japanese title of both games left me without any clues. in fact, i have been looking for the title of these games for about 10 years.\n\ni understand that the policy got changed, so my question may not show up again on the page. what i ask for is, if it is possible, to grant me temporary access to that answer. i hope someone will help me find the appropriate person to decide on my case."}, {"author_name": "Greg", "gravatar_hash": "e4567c809ac54619a9c54d731bf30881", "author_url": null, "date": "Sep 13, 2012", "message": "...and i will help you finding me without another 10 years of searching.\nhttp://gaming.stackexchange.com/badges/20/nice-question?userid=12264"}, {"author_name": "Beech Horn", "gravatar_hash": "2802bf954654bd316b96a85c7c739ef0", "author_url": "http://beechhorn.com", "date": "Jan 01, 2013", "message": "As this is forcing others to do work and adds no value long term why not have a challenges system? The rules:\n\n1) challenges are transient, their pages are not to be search engine indexed and are removed after the challenge is completed\n\n2) a challenge (identify this vague description, etc) would cost 10 rep or similar to ask with a minimum reputation requirement\n\n3) badges, etc could be provided to whoever answers the question correctly instead of rep\n\nAll of the \"do my work for me\" style questions where SE is the best place to find the answer could be subjected to similar rules, hopefully solving the problem for multiple angles."}, {"author_name": "David", "gravatar_hash": "9e197fd621ca36a4cb19038d985e4967", "author_url": null, "date": "Jan 03, 2013", "message": "The whole point is that the person answering, one in a thousand, is probably going to recall instantly what you're trying to remember. Almost zero effort is required from the community. Someone out there will always know. \n\n\nFortunately, the internet is a big place. There's always somewhere else to go."}, {"author_name": "David", "gravatar_hash": "9e197fd621ca36a4cb19038d985e4967", "author_url": null, "date": "Jan 03, 2013", "message": "sigh..."}]}