{"response": [{"author_name": "David", "gravatar_hash": "23d82ea2162e72a5d0fd124d88141d2a", "author_url": null, "date": "Oct 23, 2009", "message": "So you have a website and want to know if a change will make a difference?  Use split testing!"}, {"author_name": "Max Schmeling", "gravatar_hash": "56e5c12047b131b9a4a2bb4a4556253e", "author_url": "http://maxschmeling.blogspot.com/", "date": "Oct 23, 2009", "message": "I would personally like to see this change, and I think that members of the triology sites would easily be able to understand the system. However, it would require them to read about it, rather than just recognize the pattern of higher number are, well, higher.\n\nI think it makes more sense, even with the differences between Reddit and the triology sites, but the immediately obvious way its done now is also valuable for that very reason.\n\nSo, I think it's cool, and maybe that could be another option that users have to sort their answers that way, but I think the default should stay as is."}, {"author_name": "Martin OConnor", "gravatar_hash": "70d63510b63e2b8b6ebcd9595f1879e2", "author_url": null, "date": "Oct 23, 2009", "message": "It does not have to be the default sort order. You could add an option to the answer sorting options labled \"reddit\" sorting."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Oct 23, 2009", "message": "One answer to the \"looking confusing\" part would be to display both upvotes and downvotes - at least when using that sort order. I think various people have said before that that adds more information anyway. It may be a bit confusing for a newcomer to the site, but I suspect old hands would welcome it.\n\nJon"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Oct 23, 2009", "message": "Personally, I'd like to see the upvotes/downvotes shown via a tooltip. Keep the layout exactly as it is now, but when you mouse over the score it says \"n% positive\"."}, {"author_name": "çağdaş", "gravatar_hash": "7ffd13d6e7b8d7d2c62f72268453be0e", "author_url": null, "date": "Oct 23, 2009", "message": "I've never hit the daily vote limit. I guess I just don't vote much because I rarely think my vote would make a difference on the presentation of the question and answer.\n\nBut I think having a more complex sorting system like that would encourage the users like me to vote more."}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://www.pauldwaite.co.uk/", "date": "Oct 23, 2009", "message": "Oof, split testing something like this, can you imagine. Ouchies."}, {"author_name": "Drew Arrigoni", "gravatar_hash": "f95c0f59cb9cef293c54bffd193a2652", "author_url": null, "date": "Oct 23, 2009", "message": "Sure, implement it and give the user the option. Rollover summary of number up and downvotes would be neat. As would percentages. \n\nI'd imagine, however, that a large chunk of users probably don't care all THAT much how the fourish answers to their question are sorted."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 23, 2009", "message": "> a large chunk of users probably don’t care all THAT much how the fourish answers to their question are sorted\n\nMy thoughts exactly. For the hundreds of comments and thousands of votes on a popular Reddit thread, different story."}, {"author_name": "Sinan Unur", "gravatar_hash": "7804ebae32fbadef38537d74a915c22f", "author_url": "http://www.unur.com/", "date": "Oct 24, 2009", "message": "First, you and the algorithm designer misunderstand confidence intervals (classical statistics):\n\nConsidering **all** possible sets of five **randomly** and **independently** picked ratings out of the population, what is a formula, which, at least for 95% of such randomly independently picked ratings, will give me an interval that includes the population's rating of this comment.\n\nNote that the **true** population rating of a comment is just a number that is either within the interval you calculated or not. I.e. the statement that \"there is a 95% chance that this number is in this interval I calculated\" is meaningless.\n\nKeep in mind that, even if you correctly understood what a confidence interval is, the votes you observe are neither random, nor independently picked out of the set of all votes for that question.\n\nI would be inclined to just divide the average vote by the standard deviation of the votes: 1 vote =&gt; infinite standard deviation =&gt; complete uncertainty."}, {"author_name": "Motti", "gravatar_hash": "6183c6f9d621a125cd3aa0f7ae324285", "author_url": "http://stackoverflow.com/users/3848/motti", "date": "Oct 24, 2009", "message": "The obvious way to reduce confusion with such ranking would be to display the percentage of people who liked/disliked a post. You can still show the total vote but make it less prominent."}, {"author_name": "Chris", "gravatar_hash": "e400600450847a664b70eabedb920d2e", "author_url": null, "date": "Oct 24, 2009", "message": "\"He also provided some sample Ruby code that implements the above formula\"\n\nEdwin B. Wilson new how to program in Ruby 70 years before it was invented?  Amazing."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Oct 25, 2009", "message": "There's already a sort order that has a mix of items with high and low vote counts: the \"hot questions\" sorting. I thought at first this was a replacement for that system and am now confused as to why it wouldn't be a replacement for that."}, {"author_name": "dan", "gravatar_hash": "e058655769d843632955f6b436207bd7", "author_url": null, "date": "Oct 25, 2009", "message": "Perhaps not useful for stackoverflow, but maybe the hosted sites would find it useful?"}, {"author_name": "dlamblin", "gravatar_hash": "60fec2454b16f5fd5ec243fa98d71351", "author_url": null, "date": "Oct 25, 2009", "message": "Sinan has a point in that the first x votes are not a random selection of the total votes because the next y votes cast are influenced by the previous x votes and their tabulation.\n\nAnd as for sorting, I had assumed this could only be useful on the front page on questions with more than 10 answers anyways."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Oct 26, 2009", "message": "I agree with Wedge above.  Such a complicated method may not be worthwhile for ordering (few) answers.  But it might be for ordering (many) questions!"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Oct 26, 2009", "message": "I absolutely do not want anything like this for answers. When i'm looking for an answer, I want one that's been read and (hopefully) vetted by as many readers as possible; this isn't Reddit, and the only time i've observed the problem their algorithm was designed to fix has been on questions that attract ultra-subjective, \"populist\" answers - which, frankly, don't matter and should probably just be deleted.\n\nFor questions... Well, search ranking generally sucks, except for simple \"tag + keyword\"-based searches, where sorting by votes *generally* points me toward what i'm looking for on the first page or so. This might help improve that... Then again, it might just emphasize duplicate questions. Throw up a test, if you're bored... Wouldn't mind trying it out."}, {"author_name": "Shilad Sen", "gravatar_hash": "492f4c8840b29deda169c3e05995e59c", "author_url": "http://shilad.com", "date": "Nov 06, 2009", "message": "One other sorting method that might work well (and is certainly simpler) is to treat the fraction of up ratings as a random variable somewhere between 0 and 1 and estimate your best guess.  Through some lovely math involving conjugate priors, you get the extremely complex formula:\n\np = (nUp + alpha) / (nDown + alpha + beta)\n\nYou can choose alpha and beta to match your application.  The fraction (alpha / (alpha + beta)) should be close to the overall fraction of ratings that are up.  The scale of alpha and beta indicates how strongly to weight the \"smoothing\" factor.  One common choice is alpha = 1 and beta = 1, which functions as one simulated up and down vote for every item."}]}