{"response": [{"author_name": "Entity", "gravatar_hash": "e326f7efc603a1881cd645d22a663de2", "author_url": null, "date": "Oct 28, 2009", "message": "Please note, when you say \n\"We're serious about....\"\n\nIt just makes you sound less serious about what you're doing. Just do it all-ready and let the market decide if you're serious or not."}, {"author_name": "Luke", "gravatar_hash": "4d69df831be32d2e5eddbd7afe1d671c", "author_url": null, "date": "Oct 28, 2009", "message": "When I sign in with my OpenId that I user for all trilogy sites I get this message:\n\n\"This is an OpenID we haven't seen on Stack Overflow Careers before\""}, {"author_name": "Luke", "gravatar_hash": "4d69df831be32d2e5eddbd7afe1d671c", "author_url": null, "date": "Oct 28, 2009", "message": "Sorry. Just ignore that... my bad..."}, {"author_name": "Daniel Reeves", "gravatar_hash": "02b053ea78b2ab803ba810a386fda1ef", "author_url": "http://messymatters.com", "date": "Oct 28, 2009", "message": "You can publish for free but it costs money to be searchable?  That probably means you keep search engines from indexing the public pages.  Does paying also let the search engines crawl your CV, or just provides access via a custom search of your creation?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 28, 2009", "message": "> “This is an OpenID we haven’t seen on Stack Overflow Careers before”\n\nYep, that's normal.. Careers hasn't seen you before, but Stack Overflow has. Just visit the associate tab once you've created the account."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 28, 2009", "message": "> That probably means you keep search engines from indexing the public pages\n\nNo, we don't do that, the whole point is for your CV to be something you can reference online. It's just a regular web page.\n\n(note that we don't show some employment-only fields on the public CV, as they don't really make sense there anyway..)\n\n> Does paying also let the search engines crawl your CV, or just provides access via a custom search of your creation?\n\nFiling (paying to subscribe) allows you to opt-in to searches by hiring managers. We don't mean Google searches, but our custom search interface within careers.stackoverflow.com, specifically tailored to employers."}, {"author_name": "Daniel Reeves", "gravatar_hash": "02b053ea78b2ab803ba810a386fda1ef", "author_url": "http://messymatters.com", "date": "Oct 28, 2009", "message": "Very nice!  I didn't mean to imply that blocking search engines from public CVs (via robots.txt) would prevent you from referencing your CV online or it being a normal web page.\n\nIf you can publish, googlably, for free that's even better.\n\nBut if the one thing paying gets you is to be included in the custom search then the real question is why would hiring managers use that rather than just googling \"foo bar baz site:careers.stackoverflow.com\"?"}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": null, "date": "Oct 28, 2009", "message": "The idea, as I understand it, is that anyone can make a public CV; which means the standard spam problems will apply.\n\nPresumably, only serious job applicants will make the $30 (to become $100) investiment in getting your CV into the hiring manager search.  So, hiring managers are paying for access to more qualified and serious candadiates and candidates are paying to demonstrate their seriousness."}, {"author_name": "Markus", "gravatar_hash": "ee2809522b2e56d0d6b656486bc5e0db", "author_url": null, "date": "Oct 29, 2009", "message": "I tried registration with my E61i and Opera mini, unfortunately after I got back from my OpenID provider (Yahoo) clicked create a new CV account, I received a \"Request Too Long \\n HTTP Error 414: The request URL is too long.\" :-("}, {"author_name": "Pat", "gravatar_hash": "a0c394e31c9740376635c8878cf5889e", "author_url": null, "date": "Oct 29, 2009", "message": "I typed my first_name.last_name after the http://careers.stackoverflow.com/ box and it got silently converted to a dash and saved.\n\nMaybe you should put a notice that the dot has been converted, or if you do it silently, at least redirect the url with the dot to the url with the dash. I think the current behavior will lead to unnecessary confusion."}, {"author_name": "forceinline", "gravatar_hash": "e425f6ceb2b5351a71f2cd9b9b5bca3e", "author_url": null, "date": "Oct 29, 2009", "message": "When will information be released about the employer side? Your already asking for money saying 'get it now at a great deal' but have barely described anything about the employer side? How will this be marketed to employers?"}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Oct 29, 2009", "message": "Thank you :)\n\nI think in the end you'll somehow make posting CV free, perhaps only for SO users with 1000+ reputation or so. Job boards get much better with scale."}, {"author_name": "Spoike", "gravatar_hash": "dc374f99f92956f128ef79df36d819e9", "author_url": null, "date": "Oct 29, 2009", "message": "Pies: Posting the CV in public is free. It is filing them for hiring manager search that isn't."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Oct 30, 2009", "message": "Perhaps there should be a link at the top of each page to one of Joel's articles (\"High Notes\") to remind each person posting a CV that if they are using this service, they are probably very mediocre at best and really probably shouldn't be programming anyway! (by the logic discussed in that article). :)"}, {"author_name": "skolima", "gravatar_hash": "b6f2f9275a3eb6c38433419311d723a2", "author_url": null, "date": "Nov 18, 2009", "message": "There's a small problem with the \"fee to prove that you're serious\". 30$ is less than an hourly wage for a developer in US, but it's about a daily programmer wage in Central Europe... Do we have to prove we're much more serious? ;-)"}, {"author_name": "Career cvs", "gravatar_hash": "c163fd35a5a269a0657e01b41e53916f", "author_url": "http://www.cvtemplate.net/cv/careers", "date": "Jun 18, 2010", "message": "The Cv format is nice, but i would be convenient if you post a text content rather than image."}]}