{"response": [{"author_name": "Sam Cogan", "gravatar_hash": "e240b917fd1e0c5cc2ab6e1d33aca317", "author_url": "http://samcogan.com", "date": "Oct 07, 2009", "message": "Awesome, now will we be getting a Serverfault version for sysadmins?"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Oct 07, 2009", "message": "Hmm. I'm really not looking for another job at the moment... but I'm tempted to join just to see what sort of emails I get..."}, {"author_name": "Alberto", "gravatar_hash": "428694e128aeca0042e42306ca297632", "author_url": "http://www.albertopl.com", "date": "Oct 07, 2009", "message": "This looks like a good idea, but I guess I'm still confused as to how it will integrate with your SO profile. What would that even mean?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 07, 2009", "message": "> I’m tempted to join just to see what sort of emails I get…\n\nPff, who would want to hire this \"Jon Skeet\" person? :)\n\n> I’m still confused as to how it will integrate with your SO profile\n\nTry it out and see; it's free to do everything up to filing (final step)."}, {"author_name": "Greg", "gravatar_hash": "8438e7bf53378150813b3dfec7f22232", "author_url": "http://www.roborg.co.uk", "date": "Oct 07, 2009", "message": "Congrats at the launch. Is this for freelance type jobs or just proper \"employee\" type jobs?\n\nAlso, @Jon - don't you get enough email already? :)"}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Oct 07, 2009", "message": "Interesting idea.  I'm going to sign-up and try it now.\n\n$29 for 3 years is not too bad.  I don't think I'd be willing to pay $99 for 12 months though.  Every other job site is free for the candidate to register.  I'm sure this one will be an improvement, but $99 per annum better?  I guess we'll see how well it works..."}, {"author_name": "John Uhri", "gravatar_hash": "f77ec29fb7de4e624851abc3618b9da7", "author_url": "http://redbitbluebit.com/", "date": "Oct 07, 2009", "message": "I'm with @greg. I hope it can be used for freelance gigs too."}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Oct 07, 2009", "message": "Mmm, my CV is 115% complete, and I'm not finished yet."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 07, 2009", "message": "you're such an overachiever! :)"}, {"author_name": "Marc Gravell", "gravatar_hash": "b4ae7f8b50a2c32287e456394570679e", "author_url": "http://marcgravell.blogspot.com", "date": "Oct 07, 2009", "message": "The linking to an SO profile sounds double-edged; it may discourage a lot of people linking if they think that their current employer can see that they're in the market for a new job..."}, {"author_name": "Brad Gilbert", "gravatar_hash": "6a81b9b2f0280da70b19d2dddcd8dc03", "author_url": "http://b2gills.blogspot.com", "date": "Oct 07, 2009", "message": "If it works out well, $99 dollars a year won't seem like that much ($9 a month + 1 free month)."}, {"author_name": "Joshua", "gravatar_hash": "0fd6ff9f5a1f053b51fe4627f7bcbc8c", "author_url": "http://www.zduck.com", "date": "Oct 07, 2009", "message": "Will there be a way to link to a public copy of my CV? I'd love the option of linking to my CV on SO Careers instead of to my public Linked-in profile page which I use as my resume."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 07, 2009", "message": "> The linking to an SO profile sounds double-edged;\n\nThis is of course optional.\n\n> Will there be a way to link to a public copy of my CV?\n\nThis is under discussion at meta\n\nhttp://meta.stackoverflow.com/questions/24926/how-much-of-your-profile-on-careers-stackoverflow-com-should-be-public-facing"}, {"author_name": "Drew", "gravatar_hash": "f95c0f59cb9cef293c54bffd193a2652", "author_url": null, "date": "Oct 07, 2009", "message": "Um, when I try to log in to careers, it fails to connect my Google OpenID to my Stack Overflow account. I tried both pressing the Google button and copy/pasting the OpenID from SO."}, {"author_name": "Sean McArthur", "gravatar_hash": "bf52e9879a293a43269759d3c7728a47", "author_url": "http://mcarthurgfx.com", "date": "Oct 07, 2009", "message": "Will you be considering a monthly payment structure instead of yearly? I know you abhor recurring fees, yet one doesn't typically look for a job a year at a time... my experience has been a month to 2."}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://www.pauldwaite.co.uk/", "date": "Oct 07, 2009", "message": "Fantastic. Love the attitude and intentions. Pricing for candidates sounds great. I hope you charge firms more for accessing the data. Not only would that help keep out the idiots, I’ve heard some huge referral bonuses being offered for employees who refer candidates who end up getting hired."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 07, 2009", "message": "Drew -- if you use Google OpenID you must hold the right cookie to your SO account. Try clearing cookies, logging in to SO again, then try again on SOC."}, {"author_name": "Pascal MARTIN", "gravatar_hash": "37458c7c44851cd6c402e02e5a9be94f", "author_url": "http://blog.pascal-martin.fr", "date": "Oct 07, 2009", "message": "Hi,\n\nThis seems pretty interesting : it would allow developpers to find employers who are more than \"recruiters\" -- ie, a bit technical too...\n\nWe currently can see that there are 12 Employers, but a few more informations might be useful, in my opinion.\n\nOne of the things I'm thinking about, in particular, is about the country/city employers are in : I'm french, I'm OK with speaking english and all (and I do every day on SO), but I'd like to know if any of the employers on CSO are from France -- if yes, there is an interest for me, but if no, even if those employers are great, they are not that interesting for me...\n\nSo, do you think it might be possible to get a few more informations about employers ? Maybe a simple thing like a Google Map indicating in which cities employers are, accessible even for users who didn't - yet - pay ?\nIt wouldn't give that much information, but I think it would be enough to get attention from users not in the US...\n\nThanks !"}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Oct 07, 2009", "message": "You understand that there's a but of a tension between this model and some of what Joel has written about finding good programmers, right?\n\nIn particular, this: \nhttp://www.joelonsoftware.com/articles/FindingGreatDevelopers.html\n\n\"The great software developers, indeed, the best people in every field, are quite simply never on the market\"\n\nThe site is built around people who are not only on the market, but are willing to pay to have themselves listed on a job board.  Which almost definitionally makes them not the best developers, according to the above.\n\nNow, the economy has changed a bit since then, but I'm still not sure the best software developers would be willing to pay to be listed on a job site.\n\nI guess we'll soon find out."}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Oct 07, 2009", "message": "Nice one! \n\nCan I have the Nostradamus badge on meta :P"}, {"author_name": "matt b", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Oct 07, 2009", "message": "So just to clarify, are the only people who can see my \"private CV\" on careers.stackoverflow.com those employers that have paid for access?"}, {"author_name": "jerryjvl", "gravatar_hash": "320dc2b3b003612d9879e1563e7a41ca", "author_url": "http://www.thenakedflame.com", "date": "Oct 07, 2009", "message": "Is there a way to turn this on and off? ... As much as I'm not in the market for a job *right now*, the initial sign-up price sounds tempting, and who knows what'll happen in the next 3 years? ... But I wouldn't want to disappoint hiring managers that are looking right now, nor would I want to have to deal with enquiries just at this time..."}, {"author_name": "JD Long", "gravatar_hash": "d2e5bf1cdb782a02ef30e41563702541", "author_url": "http://www.cerebralmastication.com/", "date": "Oct 07, 2009", "message": "I think this is a really interesting business model. Actually I think it's downright disruptive enough that I popped off a blog post about the topic immediately after seeing a tweet about this: http://www.cerebralmastication.com/?p=370\n\nGood luck and keep disrupting things!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 07, 2009", "message": "> Is there a way to turn this on and off?\n\nAbsolutely, there is a \"hide\" and \"make visible\" on the CV dashboard right up front. \n\nIt is a good idea to take advantage of the introductory rate and have a minimal hidden CV. You can come back at any time in that 3 year period and finish it up, then flip the switch to make it visible to hiring managers in a single click.\n\n> So just to clarify, are the only people who can see my “private CV” on careers.stackoverflow.com those employers that have paid for access?\n\nCorrect. No access to user info of any kind until the employers pay the (hefty!) subscription rates. Details:\n\nhttp://meta.stackoverflow.com/questions/24945/privacy-on-stackoverflow-careers/24951#24951\n\nIn general the careers tag on meta is shaping up to a be a solid resource for common Q&As:\n\nhttp://meta.stackoverflow.com/questions/tagged/careers"}, {"author_name": "David", "gravatar_hash": "8281b1bd2eaad90adfda7f9aefac1d24", "author_url": null, "date": "Oct 07, 2009", "message": "Sounds very interesting and the initial offer is tempting. However, I'm from Australia. Are there any Australia employers signed up yet? There doesn't seem to be much point in joining if there's no local (for me) employers."}, {"author_name": "Stephen Harrison", "gravatar_hash": "921d2427eb85ade7a28015b92ebf388e", "author_url": "http://www.AnalysisUK.com", "date": "Oct 07, 2009", "message": "Can I associate my SuperUser and ServerFault accounts to it as well? or is that already done because the StackOverflow account is associated with my SuperUser and ServerFaults accounts?"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Oct 07, 2009", "message": "@JohnMcG\nPeople aren't necessarily 'on the market' - but it never hurts to have offers coming in!\n\nIt's like having a blog to show off your rockstar status."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Oct 07, 2009", "message": "@mgb,\n\nIf I'm paying for it, I want more than \"never hurts.\""}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Oct 07, 2009", "message": "Do we use the typical meta.stackoverflow site to submit bugs?  Such as your percent complete algorithm says my resume is 245% complete."}, {"author_name": "Fabrizio", "gravatar_hash": "4720c6000a5b3a5c5cf59c3544ff9ab7", "author_url": "http://www.fhtino.it", "date": "Oct 07, 2009", "message": "What is your target?  Only US users or US and International users?   I'm writing from Italy. I can create my CV but are there any italian \"hiring managers\"? Have you any plan to push your service outside US?  Actually jobs.stackoverflow.com is quite  full of US only positions."}, {"author_name": "an0", "gravatar_hash": "a726de03bed3104ddaecca3fdcf59e19", "author_url": "http://wangling.me/", "date": "Oct 08, 2009", "message": "New wonderland for passionate programmers!"}, {"author_name": "Partario", "gravatar_hash": "8fbb73f29572e75c1a55b84838136a97", "author_url": "http://reveille.org.uk", "date": "Oct 08, 2009", "message": "This sounds great, but as Fabrizio says, is there going to be a massive US bias? I'm in the UK and I'd love to take advantage of this site."}, {"author_name": "Kevin Connolly", "gravatar_hash": "30d5456d1b71664feb5cda0233bf0d0d", "author_url": "http://www.kconnolly.net", "date": "Oct 08, 2009", "message": "My CV is 135% complete :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 08, 2009", "message": "> My CV is 135% complete :)\n\nThis is by design!\n\nhttp://meta.stackoverflow.com/questions/24964/why-is-my-cv-145-complete"}, {"author_name": "Kristof", "gravatar_hash": "d813e1a6fa1430f89c6508ab51743854", "author_url": null, "date": "Oct 08, 2009", "message": "I personally think that people who are on the top page of any trilogy site should have free access to the service. I believe they really deserve it."}, {"author_name": "Niyaz", "gravatar_hash": "75bbf2be38dfeec9edc6bdc3b87d3c4f", "author_url": "http://www.diovo.com/", "date": "Oct 08, 2009", "message": "I am thrilled. How do I pay?\n\n(I am really concerned about the viability of this model for the international audience though. I am from India and when I look at the number of jobs posted in India in the jobs forum, my heart sinks: http://jobs.joelonsoftware.co.in/  :( )\n\nBut anyway I will not pass on an opportunity to pay the awesome StackOverflow team!"}, {"author_name": "Grzes", "gravatar_hash": "37bb92ada54408e814ecedfcfa57da8a", "author_url": null, "date": "Oct 08, 2009", "message": "I am wondering how your model with people paying for uploading their CVs will work. If you look for a job in any other way, the hiring companies cover all the costs (either for using websites, agent fees, etc.). I will not upload my CV, just because I think its a bit strange."}, {"author_name": "wds", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Oct 08, 2009", "message": "&gt;“The great software developers, indeed, the best people in every field, are quite simply never on the market”\n\nMost of the people aren't the best in their field. Most people on stackoverflow definitely aren't. These people still need jobs and employers want a sort of fair assessment of their skills. I don't see the big deal.\n\nOh I include myself with \"these people\" of course. :-)"}, {"author_name": "pablasso", "gravatar_hash": "61bb1230a4328c0b260f2b7f1933eb23", "author_url": "http://www.pablasso.com", "date": "Oct 08, 2009", "message": "Using myopenid i just get: \"Unable to log in with your OpenID provider: The signature verification failed.\"\n\nBut i can login successfully in all the other sites."}, {"author_name": "Donal", "gravatar_hash": "8b2d39a59a961ef26440e9c1453d1939", "author_url": null, "date": "Oct 08, 2009", "message": "I already have a HTML version of my CV. Why not allow me to reuse it (either by uploading it, or providing a link), rather than copying and pasting it into your form. Now I have 2 copies of my CV that I need to maintain."}, {"author_name": "job site india", "gravatar_hash": "81e0bf907d7d6719e612923a1cc8a10e", "author_url": "http://www.jobsshell.com", "date": "Oct 08, 2009", "message": "I already have a DHTML version of my CV. Why not allow me to reuse it.I need to maintain."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Oct 08, 2009", "message": "Presumably the fee is either because of Joel's reluctance to leave money on the table (and he wants to buy a private volcano for his lair) or for the craigslist effect (to keep 1000s of rubbish CVs off the list)"}, {"author_name": "GmonC", "gravatar_hash": "0d8b6cec15377a2d4963587c0dd9484e", "author_url": null, "date": "Oct 08, 2009", "message": "According to FAQ:\n\n   1.  File your CV  with Stack Overflow Careers\n   2. Link your Stack Overflow account to your CV\n   3. ???\n   4. Get a fantastic job!\n\nROFL! Is this related to <a href=\"http://www.southparkstuff.com/images/stories/epiimgs/epi217/pics-217-6.jpg\" rel=\"nofollow\">South Park #217?</a> ?"}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Oct 08, 2009", "message": "@wds,\n\nThat's fine, but that's not the message Joel and Jeff have been sending us over the years, or indeed the message that Joel and Jeff have been sending  us over the years, and indeed the message in this post -- \"We believe that every professional programmer should have a job they love, and current sites like Monster, DICE, craigslist, and so forth do a woefully inadequate job of matching professional programmers with the type of employers who understand the true value of programmers who hit the high notes.\"\n\nBut those programmers should have to pay for the privilege of having a job they love?\n\nJoel has been writing for years about how programmers should have private offices, top-of-the line machinery, the best tools, etc.\n\nBut they should have to pay to find a job they like?\n\nSomething doesn't quite feel right."}, {"author_name": "Ortzinator", "gravatar_hash": "44770e6f2075241a21ab855de6838108", "author_url": "http://blog.ortz.org", "date": "Oct 08, 2009", "message": "Everyone goes job hunting, but I'm unfamiliar with the practice of jobs hunting you. Is this common? Or is this something that is reserved for the truly exceptional programmer?"}, {"author_name": "John Farrell", "gravatar_hash": "c9e49f4aaadc8a330f70a224a9ab1bfc", "author_url": "http://fizzbuzz.net", "date": "Oct 08, 2009", "message": "@JohnMcG\n\nYour language is too heavy for the price of admission.\n\nYou pay so the service is and stays useful rather than a messy keyword dump.\n\nheh, recaptcha: extorted selves"}, {"author_name": "pablasso", "gravatar_hash": "61bb1230a4328c0b260f2b7f1933eb23", "author_url": "http://www.pablasso.com", "date": "Oct 08, 2009", "message": "It works now with myopenid :)"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Oct 08, 2009", "message": "No real objection to paying at the $29 level. Looking for a job costs you a lot more than this in time and effort.\nI like the cost-up-front model rather than Linkedin's free - then they charge to send messages, then receive messages then to see a job offer you have been sent etc.\n\nBut will employers really search for people rather than advertise and have people come to them? I have received job (or at least interview) offers on Linkedin but these are mostly from recruitment agencies just trawling sites.\n\nIf the fee for employers is high enough to stop recruitment agencies doing this, will it be too high for potential employers? Do you even want to stop recruiters?\n\nAnd will this work outside a few USA tech concentrations? Are 100K users enough that it's worth it for a company outside NY,SF to post? \n(the fact that you apparently can't handle non-US credit cards doesn't help!)\n\nThe big advantage is that, as Joel says, you have a controlable internet presence without having to write a tedious blog"}, {"author_name": "leodip", "gravatar_hash": "b09fe92ca98af3ca8e8ca6dfde346a42", "author_url": null, "date": "Oct 08, 2009", "message": "This could be adapted to allow for freelancers to find work. How about a Rent-a-coder like service?"}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Oct 09, 2009", "message": "@nini, awesome thanks.\n\n@johnMcG - you pretty much hit the nail on the head.  In the American dollar we trust!"}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://www.ComicsInventory.com", "date": "Oct 09, 2009", "message": "I think I rather use this to find a job.\nhttp://freelancefolder.com/how-to-build-the-ultimate-job-finding-dashboard-with-igoogle/"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Oct 10, 2009", "message": "@JohnMcg,\n\nYou make an interesting point about Jeff and Joel's propaganda. I was wondering the same thing myself. But you have to admit the two have widely different standards. One's standard seems something like if you don't have a 4.0 from Yale, had a prestigous internship to a Fortune 100 by Junior year, have applied to more than 3 employers in your life (or rather ever had to apply in the first place), then you're probably a pretty bad or, at best, mediocre programmer. Oh, and somehow in this odd logic, if you have a PhD in computer science, you must have less knowledge of computer science than a Marketing major or something about how you couldn't possibily get anything done (despite that clearly you had to ... do a PhD). Then, the other one makes it seems useless and suspicious to know C and sets the bar of competency at \"If you know what the word \"refactor\" means and you visit blogs then you've already won.\"\n\nSo, I see your point. I also question whether many professionals would really want to put themselves out there so publically. But then again, some people in this industry think you should make everything you ever do public (presumably you should at least not actively post your credit card number on Twitter though ... or has that norm changed too?)\n\nBut, in reality, no one is putting a gun to anyone's head and making them use the service."}, {"author_name": "no one", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": null, "date": "Oct 12, 2009", "message": "Charging really seems like abuse of us SO users.  There's got to be a better way than charging users to show interest.  Charging is a dumb idea - but I guess this is how jeff and joel want to repay the users who put in all their time and content.  \n\nIf they charge users then they can charge EVEN more to the companies advertising.  They win on both sides.  Way to go guys, SO looks kind of like a hollow money shell now."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Oct 12, 2009", "message": "Kristof says:\n&gt; I personally think that people who are on the \n&gt; top page of any trilogy site should have free \n&gt; access to the service.  I believe they really \n&gt; deserve it.\n\nIt would be interesting - they are certainly adding more than $99 value per year to the various websites, so the cost would be justified, and it would encourage them to participate in the job engine when some of them otherwise wouldn't.\n\nOn the other hand, an employer must be careful they are getting a top-tier employee, and not someone who just loves to spend 2+ hours a day on SO and related sites.  Smart, but gets things done, or answers questions all day?\n\nStill, I think the top _two_ pages would be better...  :)\n\n-Adam"}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Oct 12, 2009", "message": "This does represent a shift in the relationship between Joel and Jeff and their readers.  I'm not sure they recognize it."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Oct 13, 2009", "message": "I don't mind paying a bit, and the $29 intro offer sounds great. But $99 a year normally just seems silly. It doesn't sound like a \"nominal fee\" to me.\n\nAnd yes, you could argue that it's only something like $9 a month, to which I say \"no, it isn't\". Because if I put up my CV because I'm looking for a job, and, after a week, I get the offer of my dreams, then I've paid $99 for a week on the site.\n\nIf I'd been able to pay $9 a month, then I'd have only had to hand over $9 for the same week. $99 up front is a pretty big number for something that, according to this blog post, is only intended as a \"nominal fee\", to \"avoid the keyword-spam-free-resume ghetto\".\n\nFor that matter, wouldn't the same \"ghetto\" be kept away just as easily just by allowing potential employers to filter by rep? If they can choose only to see candidates with rep &gt; 5000, say, then you've already gotten rid of all the \"free resume\" half-arsed entries.\n\nTo be honest, it seems more like an attempt to monetize SO than anything else. Which is fine, of course. The site has to be profitable to work. But jeez, you'd think it was possible to add a touch more honesty."}, {"author_name": "no one", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": null, "date": "Oct 13, 2009", "message": "\"To be honest, it seems more like an attempt to monetize SO than anything else. Which is fine, of course. The site has to be profitable to work. But jeez, you’d think it was possible to add a touch more honesty.\"\n\nYep.\n\nAt best they figured they push off the problem of \"qualifying\" the resumes to the users rather than to the hiring companies or to themselves.  \n\nSo, in order to charge more for resumes than other online places they are charging the users.  \n\nDisingenuous.  \n\nI'd have expected something a little better and frankly from Jeff's protestations about the money not being important and giving stuff to the community and living on in the code - well, it seems hollow...\n\nTo be fair, SO sure is a swell site, but, guys, come on, charging for resumes when we've already created the value of SO?  That is insulting.  \n\nYou could at least put in some threshold like 1000 hit points or something and another way to qualify resumes other than $29.\n\nAs you guys have pointed out in the past - putting a dollar amount on something like answering questions cheapens it and makes people feel dirty and used.  Placing a dollar amount in this manner also is the wrong way to go.\n\nI'd fix it if I were you."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Oct 13, 2009", "message": "In the spirit of \"monetizing\" the investment of time spent on SO, I am selling one of the two SO stickers I got from the Boston DevDays show.\n\nI figured that if I have to pay for my resume to be on SO and everyone else is doing a gold rush to make money on SO, I figured I might get back some of the investment I made.\n\nSo, highest bidder gets the sticker.  There's only one."}, {"author_name": "Dave", "gravatar_hash": "025e0d83259cac7105185efae94d8c9c", "author_url": null, "date": "Oct 14, 2009", "message": "I agree with some of the other posters here when I express frustration that we contributors are being charged for something that should be paid for by the recruitment company.\n\nIf you're worried about 'spammy' CVs being an issue, then limit the service to those with &gt;1000 rep or something similar. There's simply no need to charge. $99 is not a token fee.\n\nI find this especially frustrating when Coding Horror's latest blog refers to the developers of this feature being rewarded with expensive new SSDs for their troubles. It's not like Jeff and Joel are wonting for cash.\n\nAlso no one in their right mind is going to sign up for 12 months or 3 years or whatever. You only need the service when you're looking for a job - that's not going to take that long, especially if you're the sort of hotshot dev being targeted by the service.\n\nAnd no import facility? No indication of employer take-up? Yet you still want my money? Pull the other one, it's got bells on it.\n\nP.S. captcha = \"Flushing agency\" ;)"}, {"author_name": "Jason Rikard", "gravatar_hash": "dd99027df46a8ed5c07380f6bb263fb7", "author_url": "http://www.jsndev.net", "date": "Oct 14, 2009", "message": "I signed up for 3 years a few moments ago. I believe that the $99/year plan is asking a lot, especially if you're unemployed, however, I am willing to support SO at a reasonable cost of $29 for 3 years. Their current business model for careers has potential to do very well because of SO. I look forward to seeing how this plays out with employers!"}, {"author_name": "Stefan Kendall", "gravatar_hash": "cc39fb58e903e1377081c621c2f53c7c", "author_url": "http://progamonth.com", "date": "Oct 14, 2009", "message": "Joel and Jeff have proven to be sharks of the software development scene. I signed up almost immediately after discovering the service; in the worst case, you're supporting SO. In the best case, you're reaching out to employers who care for a minor fee."}, {"author_name": "Hgill", "gravatar_hash": "dca8916a6f4effe75d0dd685573b3171", "author_url": "https://twitter.com/hgill", "date": "Oct 15, 2009", "message": "@Jon – don't tell me you're only mildy interested. You don't fool me, you want to have the most stack* points here also."}, {"author_name": "Ryan Michela", "gravatar_hash": "f0c5cbb89945074b75182a8061b77ac8", "author_url": "http://www.ryanmichea.com", "date": "Oct 15, 2009", "message": "This couldn't have come at a better time. I am just entering into the job market and this service fits the bill perfectly. I created an account, filled in my profile, and paid my $29.\n\nI was wondering, could there be a feature to notify you when your CV is pulled as part of an employer's query? I'd hate to pay 99$ for a year, only to find out that nobody is looking for developers in Dunning, NE. If nothing else, getting that email will make me feel like I am getting my money's worth - even if I am never picked for an interview.\n\nEven better: can you list the cities that employers are looking for? That way someone from Dunning will know what they are getting into."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Oct 16, 2009", "message": "I can pretty much guarantee that no one is looking for developers in Dunning, NE.  Save your money.\n\n:-)"}, {"author_name": "Slava", "gravatar_hash": "db2cf3fe1e83bf3de26784ebd204b209", "author_url": "http://blog.agafonov.net.ua", "date": "Feb 26, 2011", "message": "Even better, now we have version 2.0 without any payments :) \nhttp://blog.stackoverflow.com/2011/02/careers-2-0-launches/"}]}