{"response": [{"author_name": "Marc Gravell", "gravatar_hash": "b4ae7f8b50a2c32287e456394570679e", "author_url": "http://marcgravell.blogspot.com/", "date": "Oct 15, 2009", "message": "Markdown is a godsend compared to trying to do formatting on many other forums; but I suspect (without any qualifying evidence) it is *mainly* useful on SO/SF (mainly SO). I wonder how much a stackexchange site will use it, other than via the buttons, and whether many of the things (like indents etc) will *add* confusion rather than aid expressiveness."}, {"author_name": "Tomas Sedovic", "gravatar_hash": "b1e07090d2ee7155a6d6f305331086bf", "author_url": "http://225tms.net", "date": "Oct 15, 2009", "message": "I'm all for dropping the \"last two spaces equal newline\" approach.\n\nWhat I like about Markdown and similar languages is that it's simple ASCII-based rich text. You have some tools to decorate the plaintext with and when you look at it, you can easily imagine how it will look rendered into something fancier, like HTML.\n\nAnd to me, the fact that a plain newline in the text is simply ignored breaks the metaphor."}, {"author_name": "Bill", "gravatar_hash": "e6f407d5c456c07416f427a66776de5b", "author_url": null, "date": "Oct 15, 2009", "message": "+1 for removing last two spaces equal newline\n\nIts just unintuitive"}, {"author_name": "Henrik Paul", "gravatar_hash": "33f7b52ddceb5ed2ffb12400a4cbceb8", "author_url": null, "date": "Oct 15, 2009", "message": "There's a PHP Markdown Extra project (http://michelf.com/projects/php-markdown/extra/) that I have been using that battles some of these problems.\n\nBut, since I was using that for systems documentation, and it wasn't expressive enough, I needed to expand that further with a fork of my own (http://github.com/wolfie/php-markdown).\n\nNeedless to say, Markdown is pretty awesome, but has some deficiencies."}, {"author_name": "alex", "gravatar_hash": "66d393811098e55c5a9d09b841607df8", "author_url": "http://superuser.com/users/7375/alex", "date": "Oct 15, 2009", "message": "Having linebreaks automatically work without having to type the extra 2 lines would be really nice."}, {"author_name": "Michael Kohne", "gravatar_hash": "267cfaf8c1f76da3d8b3c7576a903613", "author_url": null, "date": "Oct 15, 2009", "message": "Yes, fix the return thing. The return key is for ending lines, the fact that it generally doesn't is bloody annoying (in other words, it's a bug, not a feature)."}, {"author_name": "Sergio del Amo", "gravatar_hash": "30995fcc876f40073628b63ea5cfab59", "author_url": "http://moonsunweb.com", "date": "Oct 15, 2009", "message": "Automatic return-based linebreaks instead of “two spaces at end of line” linebreaks has been always being an issue. I've used Markown in serveral intranets and clients have always complained about it."}, {"author_name": "Bill P. Godfrey", "gravatar_hash": "760bfd359153d0682dbe113dc02f81ba", "author_url": "http://billpg.me.uk/", "date": "Oct 15, 2009", "message": "Call me Mr Malcontent, but I'd much prefer to edit inside the \"preview\" rather than deal with the special markdown codes. (Something like FCK editor.)"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Oct 15, 2009", "message": "I'm loving it and currently using it as the editor for my own blog."}, {"author_name": "George S", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Oct 15, 2009", "message": "Yes, the two spaces for return has got to go. It really is counter-intuitive, and I'm ashamed to say it took me about 8 months to realize it was even there. I used to just deal with two lines between sentences.\n\nAs far as the internal links; I think that's almost a 'must', with the proviso that you now have to add 'regular' links in when the data dump is done."}, {"author_name": "Rajkumar S", "gravatar_hash": "25cc4b4f00c2adcef7dd775576adad1e", "author_url": null, "date": "Oct 15, 2009", "message": "One thing that has annoyed most is the 4 space rule for posting code listing. When I need to post a code, it would be cut and paste from an editor. So I would have to go through every line and add 4 spaces in front. Tabs won't work because typing tab in text window moves focus to next field. I am not sure if there is <code> tag some where which I can enclose a program listing to avoid typing 4 space in front of every line."}, {"author_name": "Rajkumar S", "gravatar_hash": "25cc4b4f00c2adcef7dd775576adad1e", "author_url": null, "date": "Oct 15, 2009", "message": "I had typed ampersand lt; code ampersand gt; in between \"is\" and \"tag\" in comment above. pl read that along with the previous comment."}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Oct 15, 2009", "message": "I never noticed the two space thing, and I'm glad I didn't implement standard markdown because of it. There are too many people raised on the old typewriter mentality of two spaces after every period, and I'm sure that would drive them nuts.\n\nSad part is they never knew \"why\" you did that, and therefore they just do it - despite the fact that on a PC with a proportional font, its not necessary any more. But that's a rant for another day."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": "http://softhardsoft.com", "date": "Oct 15, 2009", "message": "I don't understand why 1 line break doesn't equal 1 line break. Since wordwrap is automatic in every text editor of the past 15ish years, is there ever some situation where you type a linefeed but mean it to continue the same line?"}, {"author_name": "brad dunbar", "gravatar_hash": "0168f51cd822a820c606c259b80e253f", "author_url": null, "date": "Oct 15, 2009", "message": "+1 for changing the \"two spaces\" rule.  I've been using Markdown at work for a year now and two spaces is completely counter-intuitive to the users."}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://www.twitter.com/patrick_mc", "date": "Oct 15, 2009", "message": "Here I go, being contrarian again, but I actually like the two spaces at the end of the line thing. \n\nI didn't know it existed until now. Before I was inserting br tags on the rare occasion where I actually wanted a return in the Markdown code to represent a physical line break.\n\nWith the proposed change, if you just want to type a paragraph with no breaks, you'll have to type the whole thing on one line, and you'll be constantly scrolling back and forth to read what you wrote."}, {"author_name": "developingchris", "gravatar_hash": "1ce04312daddc2060e9f6d87805cad2a", "author_url": null, "date": "Oct 15, 2009", "message": "+1 fix 2 spaces, its the most annoying thing in markdown that I have to remember when I've been away even for a day or two. Maybe I'm getting old, but its keeping me slower than most at answers."}, {"author_name": "David Hayes", "gravatar_hash": "57ecacb1c00a55c3d935e4076af923b1", "author_url": "http://www.spindriftpages.net/blog/dave", "date": "Oct 15, 2009", "message": "+1 for fixing the return problem, that really drives me mad.\nAlso performance is terrible if you're composing a long post. Maybe an option to toggle the preview on and off would be useful"}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://www.twitter.com/patrick_mc", "date": "Oct 15, 2009", "message": "@Dinah, the window in which you type doesn't have automatic wordwrap. That's the problem.\n\nI'm not familiar with many markup languages, but the ones I know (HTML and XML) work the same way. In most contexts, a line break is treated like a space."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "Oct 15, 2009", "message": "@Rajkumar S:\n\nNot 1 tag, but two of them will do it:\n\n<code> ... \n\nAlso, you can just highlight your snippet and hit ctrl-K or use the code toolbar button.\n\nOh, and +1 for fixing the extra spaces thing."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "Oct 15, 2009", "message": "Lol, it actually coded my example.  Trying again:\n\n&lt;pre&gt;&lt;code&gt; ... &lt;/pre&gt;&lt;/code&gt;"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "Oct 15, 2009", "message": "... one of these years I'll get it right.  Of course close the code tag before closing pre. :("}, {"author_name": "retracile", "gravatar_hash": "1ef10621a85769f9554cd0cbf67be94e", "author_url": "http://retracile.net", "date": "Oct 15, 2009", "message": "Markdown drives me nuts... not because it is bad, but because I am so used to Trac's wiki markup.  I keep typing my code inside {{{}}} blocks, and wondering why it isn't working. :)"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Oct 15, 2009", "message": "I'd like some type of support for tables.  Sometimes you need to post tabular data, and an actual html table would work better (and be easier) that putting everything in an ascii table in a pre block.  I think this has been suggested and shot down on MSO already, but I figure I'll mention it again here anyway..."}, {"author_name": "Brett", "gravatar_hash": "444c8d7844ba3aed548964c7524208bf", "author_url": "http://blog.brettski.com", "date": "Oct 15, 2009", "message": "It doesn't really matter what the newline method is as long as it's easily accessible when you need to know what it is.  Every wiki syntax uses something: markdown uses spaces, CREOLE uses &lt;&gt; or &lt;&gt;, can't remember textile's.  Whatever it us should be in the quick markdown instructions shown when editing a post.  It is something most people seem to be looking for when posting.  \n\nYes internal links are very useful, that would be a nice add."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Oct 15, 2009", "message": "@Patrick McElhaney: What browser are you using?? The text box absolutely wraps.  I type long paragraphs of text without manually entering a line break at the end of each line, and the text wraps around."}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://www.twitter.com/patrick_mc", "date": "Oct 15, 2009", "message": "Okay, it /does/ wrap, but it's a virtual wrap, so the automatic line breaks are sent to the server as spaces. \n\nIt should be changed so that it doesn't wrap at all (&lt;textarea wrap=\"off\"&gt;)."}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://www.twitter.com/patrick_mc", "date": "Oct 15, 2009", "message": "Correction: The automatic/virtual line breaks aren't sent to the server at all. The text moves to the next line in the editor, but no character is  inserted between the two lines."}, {"author_name": "dbr", "gravatar_hash": "edf857d71f672d8f411ef6b8376316b8", "author_url": null, "date": "Oct 15, 2009", "message": "Posted a meta.SO question on this. Seems a better place for such a discussion than these old fashioned \"comments\":\n\nhttp://meta.stackoverflow.com/questions/26011/should-the-markdown-renderer-treat-a-single-line-break-as-br"}, {"author_name": "Goyuix", "gravatar_hash": "846aeb3494a51fdd2af2bb0b99dc364c", "author_url": null, "date": "Oct 15, 2009", "message": "My vote: Merge the two codebases if possible and let EVERYONE benefit from a merged code base. Though I am not certain how to cleanly deal with the special link in case #4."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Oct 15, 2009", "message": "Why isn't markdown available for comments? I would also like to see the ability to edit comments. There are times I would just notice I have a spelling mistake."}, {"author_name": "VoiceOfUnreason", "gravatar_hash": "ea91774321962f70f19362f43568cda9", "author_url": null, "date": "Oct 15, 2009", "message": "Based on those gotchas, we quickly adjusted our Markdown support to fix a few obvious things:\n\n   1. Removed support for intra-word emphasis like_this_example \n\n\n\nThe fact that preview still does intra-word emphasis wasn't obvious?"}, {"author_name": "a paid nerd", "gravatar_hash": "611bf519f26e2b5f156e243d50b13aaa", "author_url": null, "date": "Oct 15, 2009", "message": "Hyperlinking is *painful*. I never remember if it's (like)[http://this] or [http://like](this) or [like](http://this) or (http://like)[this]. Why can't it be something simple [[like http://this]] ?"}, {"author_name": "Doug", "gravatar_hash": "bf96be7112ca1d4fd622a6fe9e46d298", "author_url": null, "date": "Oct 15, 2009", "message": "I would really like to hear your feedback on using ASP.NET MVC."}, {"author_name": "Frank", "gravatar_hash": "3eef89c1710742937cc74bf88da9dff8", "author_url": null, "date": "Oct 15, 2009", "message": "I've greatly enjoyed the Markdown experience on the site. I do however wonder if we all should have learned MediaWiki syntaxt instead - it seems to be used quite a bit out in the wild.\n\nEvery time I go on to Wikipedia to change the events of the past, I have to use the MediaWiki syntax sheet and curse them for not using Markdown."}, {"author_name": "BradC", "gravatar_hash": "c5c2165949f71bcd1fafbd8e694ab5f2", "author_url": "http://bradcorbin.net", "date": "Oct 15, 2009", "message": "I've never understood why forum software would default to converting returns into spaces. Drives me crazy. (I know, because HTML does, and features aren't free...)\n\nThe forum at www.thegreenbutton.com is far worse, at least StackOverflow lets a DOUBLE return stay like it is. Their forum took a long, nicely-formatted post with breaks, numbers, and bullets, and crammed it into a single huge, unreadable paragraph. Had to manually add a BR to the end of EVERY SINGLE LINE.\n\nPlease, please implement #3."}, {"author_name": "GollyJer", "gravatar_hash": "cf458a6960715c6015e5324ef18a9350", "author_url": "http://www.thegollys.com", "date": "Oct 15, 2009", "message": "+1 for removing last two spaces equal newline."}, {"author_name": "td", "gravatar_hash": "8cae3cbdaa4f81a83eaa0d5ddd88dc0b", "author_url": null, "date": "Oct 15, 2009", "message": "I agree the two-spaces-equals-br thing is unnatural and probably has to go, even though I didn't even know about it, but I'd advocate that the first line break always be ignored, a la TeX. Which means, a single line break is nothing, two consecutive line breaks are a br, more line breaks add blank lines if it makes sense.\n\nThat was an awful lot of text for something not really worth more than 2 cents, but meh ;)"}, {"author_name": "Jonathan Leffler", "gravatar_hash": "7d0d66b076e3bc70819e50f8a25af8df", "author_url": null, "date": "Oct 15, 2009", "message": "I have to confess to not noticing the 'double-space is break' trick - though it probably explains a few oddities I've found when editing other posts.\n\nThe one thing I've not found how to do in a year of trying is how to get back-ticks into code in running text.  This is of most relevance when trying to put fragments of shell script inline.  Even though '$(...)' is preferred, it would be useful to know how to do that.\n\nI also find that the extra space appearing at either end of back-ticked code is a bit jarring these days; I'd prefer to see that reduced or eliminated.\n\nOne other oddity: I've not found a way to get code as the first part of the answer - before any running text - without (perhaps) using explicit code or pre tags.\n\nOn the whole, Markdown has matured and is pretty usable.\n\n(Oh, is there some way of expanding tabs into spaces?)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Oct 16, 2009", "message": "I have one *huge* problem with Markdown... it's too addictive.\n\nI find myself trying to use it in emails, blog posts, blog comments etc. I wonder if there's a Wave Markdown robot yet? Hmm...\n\nI agree with \"a paid nerd\" though: the link format is hard to remember. I'm lost without Ctrl-L on that front, although I do the rest of markup manually for the most part.\n\nDistinct keyboard shortcuts for \"indent\" and \"unindent\" (rather than Ctrl-K's context-sensitive behaviour) would be welcome IMO (as per a recent Meta question, IIRC) - but that's not the format really, but the editor.\n\nI wonder how successful SO would have been without a decent formatting tool... it's *so* fundamental to the site, I can't imagine working without it."}, {"author_name": "Robert MacLean", "gravatar_hash": "bf2af16812228b5a54daeb30c96efaf2", "author_url": "http://www.sadev.co.za", "date": "Oct 16, 2009", "message": "For #4 what things would you link to in SO?\n\nWell, for me it is either searches, questions or people. \n\nFor people there is already a markdown, just not implemented that is @Username (thanks twitter). Why not just change those to links?\n\nFor searches and questions, not sure of a good syntax, but something similar to the current links would be good. \n\nFor questions maybe [][Q] for example: [Duplicate of this][Q776655]"}, {"author_name": "Jan Borsodi", "gravatar_hash": "39d7717d46e1b39aae9a2e0946b79a4e", "author_url": null, "date": "Oct 16, 2009", "message": "Agree with the line-break changes (#3). But how about also supporting multi-line paragraphs, one way to solve it would be to escape the line-break with a back-slash.\n\nThis is\\\none paragraph."}, {"author_name": "Jakub Narębski", "gravatar_hash": "672aa8b373071ef9f06db563d1c08d77", "author_url": null, "date": "Oct 16, 2009", "message": "What I have most problems with is trying to do ASCII-art diagrams (for version-control questions), as  does only some escaping of Markdown syntax (you still have to write &amp;lt; for &lt;); it preserves whitespace but do not use monospace font (I think)."}, {"author_name": "Jakub Narębski", "gravatar_hash": "672aa8b373071ef9f06db563d1c08d77", "author_url": null, "date": "Oct 16, 2009", "message": "The above is missing &lt;pre&gt; in what should be \"as &lt;pre&gt; does\"..."}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://www.twitter.com/patrick_mc", "date": "Oct 16, 2009", "message": "@ Jonathan, you can escape the backtick with a backslash: \\`"}, {"author_name": "Eduardo", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": "http://divisionsoftware.com", "date": "Oct 16, 2009", "message": "+1000 for removing last two spaces equal newline. It is totally ridiculous"}, {"author_name": "Matt", "gravatar_hash": "995cb429a774b22ad0e366db56175949", "author_url": "http://matthewkrieger.com", "date": "Oct 16, 2009", "message": "Jeff - What was the reasoning around using Markdown vs. providing a WYSIWYG editor?  I can't recall.  Was it to be more programmer friendly?"}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://www.twitter.com/patrick_mc", "date": "Oct 16, 2009", "message": "The Markdown docs explain why newlines work the way they do.\n\nhttp://meta.stackoverflow.com/questions/26011/should-the-markdown-renderer-treat-a-single-line-break-as-br/26170#26170"}, {"author_name": "Nathan", "gravatar_hash": "0a1a220854cb0e2a7d4d7a1e1bc638b8", "author_url": "http://notunto.us/", "date": "Oct 16, 2009", "message": "I absolutely *hate* the 2 space rule.  Please change that to take a regular return."}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://www.twitter.com/patrick_mc", "date": "Oct 16, 2009", "message": "I have a suggestion that might allow everyone to have their cake and eat it too. Leave the parser, but change the *editor* to add two spaces and a newline when the ENTER key is pressed.\n\nThat way code would remain standard Markdown and compatible with every other Markdown parser. Also new posts/edits would be compatible with existing posts."}, {"author_name": "Anthony Jones", "gravatar_hash": "91973b1bef91ee4f314cd95a37a45f2b", "author_url": null, "date": "Oct 17, 2009", "message": "One small change which I think would make things a little easier would be to the Code Sample (ctrl+K) tool.\n\nIt should replace all tab characters with spaces (I would prefer 2 but even 4 would be better).\n\nThis would eliminate the tendency for code to disappear to the right requiring scrolling due to 8 character indentations generated by tab characters."}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Oct 18, 2009", "message": "The thing about markup I dislike most is that I don't know of a way to enter unformatted text.  Like something that would render in Courier New with newlines and spaces exactly where I put them.  \n\nInteresting tip about double space at the end, it actually does part of that!\n\nOh yeah, I don't quite understand what \"blockquote\" is supposed to do."}, {"author_name": "Treb", "gravatar_hash": "22b28304599446b3d3aaaf123e7240ff", "author_url": null, "date": "Oct 20, 2009", "message": "The fact that a linebreak in the source is not represented as a lienbreak in rendered HTML is a feature, and an important one. The markdown approach of two spaces indicating a linebreak preserves this feature. \n \nIt's sort of a hidden feature. I discovered it after being more than six months on SO. Before that, I managed without it. Now that I know it, I use it quite often. Since it is hidden, it will not irritate anybody who does not use it. (No, I never heard of anybody putting two spaces after a dot.)\n\nDon't remove a feature that is helpful to many who know about it, and that does not bother those who don't know it. \n\nThere's no reason why you should."}, {"author_name": "Martin Woodward", "gravatar_hash": "2c248d27d0568a07410c43e09247d2b8", "author_url": "http://www.woodwardweb.com", "date": "Oct 21, 2009", "message": "I personally hate the use of Markdown. Would prefer a WYSIWYG editor for the majority of my posts - actually storing data in markdown if necessary.\n\nIt wouldn't be so bad if every system used the same markdown syntax, but they all vary just a little.  This means that you have to remember the particular editors particularities and so every time I use them I have to think about editing rather than thinking about my answer.\n\nI'd be a fan of an editor that has a \"source\" option.  The default for new users would be a WYSIWYG editor with the source option being what you have today for the power users.\n\nI think that style of editor would also work well in the StackExchange sites that are not all as programmer orientated.  It would also allow you to iteratively build on the functionality in the WYSIWYG version while allowing people to use the existing editor for the full features that they need.\n\nDon't get me wrong, I understand the amount of work required to do a decent WYSIWYG editor. But I personally would use it all the time."}, {"author_name": "Arjan van Bentem", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "Oct 22, 2009", "message": "I think using the two spaces should always be an exception.\n\nHence, I actually LOVE that two spaces. It will (should) make people use a blank line if they don't know the trick, thus enforcing the CSS whitespace formatting the site has defined for P paragraphs. As a user/visitor I think it's good to adhere to whatever layout is (currently) defined, and one should not try to use BRs to change that. Doing so will brake any future layout changes.\n\nAs an example: for a long time I thought the CSS formatting of inline code (the backtick) did not stand out, but I still used it. Nowadays all the old posts use the new CSS.\n\n(People who don't actually look at the preview can't be helped, I guess. The two spaces do not give any problem in the preview, and are not required in code or PREs. And the formatting help icon is clearly visible as well.)"}, {"author_name": "Bla", "gravatar_hash": "4716a0ebc58f3b7a0232f7193af16f6b", "author_url": null, "date": "Oct 22, 2009", "message": "So it goes ahead and convert an uppercase 'V' in violet into a lowercase 'v'?"}, {"author_name": "alwin", "gravatar_hash": "48adee2dd4be19e55eb7f950cfa8e4cb", "author_url": null, "date": "Oct 23, 2009", "message": "Please adopt adopt the GitHub linebreak approach."}, {"author_name": "Stephen", "gravatar_hash": "6400a9f2e6cc16639e2369612d984a61", "author_url": null, "date": "Oct 23, 2009", "message": "When I press return, I mean return.  Why would I enter it if I did not mean it?\n\nWhat is the point in frustrating me by ignoring me?  I have been using Stack Overflow for months and months.  I have a plus 1K score.  Up till now I have always used 'br' for my breaks.  I had no idea that the two space thing was there (and I would bet most SO users don't either).\n\nAgain, when I press return, I mean it.  If I did not mean it I would not press it (or undo it). \n\nDon't try to guess when I mean.  Just realize that I will type what I mean."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Oct 23, 2009", "message": "@Jon Skeet:\nNo, it means you use StackOverflow too much.  I suggest a vacation from the site.\n\nIncidentally, I like the StackOverflow editor and how Ctrl-L, Ctrl-K, Ctrl-B, etc... work, but hate MarkDown.  MarkDown has a few quirks, such as:\nA line break is not a line break in the output\nNumbered and bulleted lists require a blank line before them.\nThe comment box doesn't allow you to use quotes due to them being full line based.\n\nSurprisingly, none of these are problems in tag-based systems.\n\nPresumably proper separation of concerns are in place and the editor is not tied to MarkDown, so you could switch it out.  However, that would only serve to piss people off at this point (ex: Jon Skeet); maybe if you'd switched it, say, a year ago..."}, {"author_name": "eyelidlessness", "gravatar_hash": "af83d13281fbdd223b1d6ec8175c16a2", "author_url": null, "date": "Oct 25, 2009", "message": "I didn't read all the replies so maybe this was already addressed. Allowing line breaks to be ignored in some cases is a function of Markdown's roots as an attempt to interpret \"ASCII conventions\", which really should read \"plaintext email conventions\".\n\nUsing the \"two spaces\" rule for paragraph text is painful, and should be made an exception. But the utility of it becomes obvious in blockquotes (in particular) and list items (to a much lesser extent).\n\nI would say it would be a better design decision overall to *only* apply the \"two spaces\" rule in blockquotes, and to only apply it where new lines are prefixed with the `&gt;` character (that is, inter-paragraph new lines within a blockquote should still be treated as new lines unless they are followed by `&gt;`).\n\nThis problem really bit me when I deployed Markdown Extra (which I'd already customized extensively) for an arts site where the users were accustomed to BBCode. That was probably a mistake in the first place, and I overestimated the value of Markdown's \"ease\". But it's absolutely a mistake to tell a poet that each new line in a stanza must end in two spaces.\n\nMarkdown is brilliant, but the \"two lines\" rule is a design flaw, and it could definitely be removed for wider adoption. As much as \"rich text\" editors continue to improve, I much prefer the control Markdown allows (and I think more \"regular users\" would agree if it was more intuitive*, because it's almost always a lot easier to *type* your **emphasis** than to press buttons or remember potentially unavailable keyboard shortcuts).\n\n* Another change that would probably help would be image and link syntax. I don't really know what those changes would look like, but it sure would be helpful, as those throw even me off regularly."}, {"author_name": "eyelidlessness", "gravatar_hash": "af83d13281fbdd223b1d6ec8175c16a2", "author_url": null, "date": "Oct 25, 2009", "message": "Oh. Evidently the SO blog doesn't take Markdown syntax. Well."}, {"author_name": "Arjan van Bentem", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "Oct 26, 2009", "message": "I really think the formatting needs the whitespace one currently gets for a new paragraph. I never understood why a few people are using line breaks (the extra spaces, or a BR, but NOT a new paragraph) in text, which keeps the whitespace from appearing. I think BRs in the result should be an exception.\n\nSo, am I right to assume that (most) people who want to get rid of the double spaces, actually want something like the following?\n\nReturn: new paragraph (P)\nOne or more blank lines: ignored (ignored by a browser anyhow)\nDouble spaces, Return: line break (BR) without new paragraph\n\nThen what about other formats, like feeds and the data dumps? I like the blank lines in there..."}, {"author_name": "eyelidlessness", "gravatar_hash": "af83d13281fbdd223b1d6ec8175c16a2", "author_url": null, "date": "Oct 27, 2009", "message": "Arjan van Bentem,\n\nThere are plenty of reasons to use single line breaks instead of paragraphs. I presented one two comments above yours: lines in a stanza of poetry. Obviously that doesn't apply on SO, but it's something a general purpose text-to-markup translator should support with ease. Another obvious example would be physical addresses. Yet another would be the various content presented in the opening of a formal letter (name/address/subject).\n\nThere's no reason for Markdown to cling to a broken idea for a single use case (it's only really useful in blockquotes, and it's not difficult to imagine how that could be preserved while fixing the new line issue in the rest of the language)."}, {"author_name": "Refund", "gravatar_hash": "4ddf2c45c18edbe486544f813ec25da8", "author_url": "http://www.traveljournal.net", "date": "Oct 28, 2009", "message": "@Arjan van Bentem,\n\nHow would you keep blockquotes visually distinctive in combination (while editing) without the user suplying extra newlines?\n\nOutside of blockquotes, I see absolutely no reason for markdown not translating single newlines to html-breaks"}, {"author_name": "Arthur", "gravatar_hash": "acffeb885cc9cd2774e92fba4c0cff32", "author_url": null, "date": "Oct 28, 2009", "message": "Don't chuck the two-or-more space + newline = forced linebreak; two newlines =  new paragraph rules. The whitespace+newline rule is not so important on  site like this one or github, but *it is crucial for almost all other uses of markdown*; as a writer I use it 40 times a day.  So, github is *de facto* adding to the babel of seat-of-the-pants, one-for-each-site, one-for-each-application lightweight markup languages -- and you would be adding still more.  If you don't like this rule, the true path is to chuck markdown entirely, rather than muddying the waters by pretending to use it. *Otherwise you are injuring Markdown.*  You ought to be helping the world standardize around some version of Markdown; I had thought that hitherto you were aiding in that laudable task.  If you start thinking like this, the correct path is invent your own markup system, link the spec, call it Overflow, publish your ofl -&gt; html code, etc. \n\nIt is one thing to extend Markdown, as Markdown-Extended and Pandoc and Multimarkdown do.  This is defensible and right; disabling features is an injury to Markdown, which as users of it, you ought to be defending. \n\nAbove all, you should announce your plan on the markdown-discuss list.\n\nThe solution is simple:\n- Document the feature it more clearly;\n- Add a feature that shows the 'invisibles' (This may be harder than I am imagining.  It makes the employment of the rule completely transparent.  I use it in all editors. )\n- Best of all would be to announce that you support the full Markdown syntax, or that of one of the extensions that does not disfigure it, like M Extended or Pandoc, and link to Gruber's specification or theirs."}, {"author_name": "Arjan van Bentem", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "Oct 29, 2009", "message": "[Let me add \"at Stack Overflow et al\" to my \"I never understood why a few people are using line breaks (the extra spaces, or a BR, but NOT a new paragraph) in text\" above.]"}, {"author_name": "Scott Morrison", "gravatar_hash": "99056c7157a7301e3182ef99dd99a353", "author_url": "http://tqft.net/", "date": "Nov 05, 2009", "message": "I've noticed that certain MarkDown bugs have been fixed in the original implementation but have been merged over to the Trilogy's fork.\n\nIn particular, _'s and *'s inside the alt tag of an image cause all sorts of problems. We're running into this in a big way over at mathoverflow.net, where we want to use alt tags on automatically rendered LaTeX images to hold the original LaTeX code. (We want to keep the original code for both accessibility and editing reasons.) As it is, we've had to automatically escape the _'s and *'d instead alt tags, breaking the original LaTeX.\n\nThere's been a bug report on this at meta,\nhttp://meta.stackoverflow.com/questions/12123/bug-with-images-and-markdown but it seems for now this is \"a feature not a bug\", even though upstream it has been fixed."}, {"author_name": "Norman Ramsey", "gravatar_hash": "7dd45a27a5616b8a5608b84007e4e08f", "author_url": "http://www.cs.tufts.edu/~nr/", "date": "Dec 30, 2009", "message": "I *love* Markdown.  I wish we could use it for our local Wikis.  Yes, tables would be nice---but actually I resort to LaTeX and preprocess it into HTML tables.\n\nI see I'm in the minority, but years of using Emacs and TeX have put me firmly in the camp that newlines in the source code should be treated the same as spaces.  I'm not saying that it's right, but these are two of the most important tools in my world, and they've been doing things this way for thirty years.  I wouldn't like to see it changed just because upstart GUI widgets don't include newlines.\n\nWhat's wrong with &lt;br \\&gt; when you want a newline?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 31, 2009", "message": "Norman, I definitely tend to agree -- experienced, nay, <i>enlightened</i> folks like us understand the advantages of explicit newlines. :)\n\nBut, on a site like Super User (or even Stack Overflow) it is sometimes unreasonable to expect everyone to be experienced and/or enlightened. Particularly Super User."}, {"author_name": "Tom Barrella", "gravatar_hash": "4a55a3f99319e6f571fba0dba050d4ab", "author_url": null, "date": "Jan 24, 2010", "message": "Anyone know how I can force a space in type? I've read that all excess spaces are stripped out. What if I don't want them to be?"}, {"author_name": "Hamish Graham", "gravatar_hash": "d79d4a806dc0e9861ce7eff054e49af6", "author_url": null, "date": "Feb 19, 2010", "message": "Sooo - what do you think you will do Jeff? Are you thinking you might make the change to include the linebreak on a single enter or keep it the same? \n\nI noticed that your http://code.google.com/p/markdownsharp/ includes an option to do this but the wmd implementation currently not (http://github.com/derobins/wmd)."}, {"author_name": "Tiago Butzke", "gravatar_hash": "804866e97923d97c0a837664660ce917", "author_url": "http://www.tiagobutzke.com", "date": "Nov 03, 2011", "message": "I write a simple web editor of markdown with preview. \n\nLook in http://www.tiagobutzke.com/markdown"}]}