{"response": [{"author_name": "Ralph Rickenbach", "gravatar_hash": "09eb3720b1c9d33bedd35a3bd47ec1c9", "author_url": "http://www.rickenba.ch", "date": "Oct 30, 2009", "message": "In Switzerland, we use CV or the German translation \"Lebenslauf\", which literally means curriculum vitae or \"flow of life\".\n\nWhat we have in addition is a skills section where we add, in different categories, skills and products together with a skill level and years of experience, depending on job I'm looking for.\n\nJust like in the US we update the CV whenever looking for a job. It is unusual to have a CV available online.\n\nSometimes we have short resumées on the company website or intranet listing what I have done in prose and high level skill set, usually to show the companies experience more than my own."}, {"author_name": "Mike Woodhouse", "gravatar_hash": "5978e2ed3a31f1bd2361dbb919d92012", "author_url": "http://grumpyop/wordpress.com", "date": "Oct 30, 2009", "message": "Dear God, how many votes would he get for a picture of Tony?"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Oct 30, 2009", "message": "@Mike: Nice idea. Will add photo to my London DevDays review or some other question. I don't have a headshot of him to hand, but will take one at home (or crop one of the photos from the event)."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Oct 30, 2009", "message": "IVE BEEN WAITING SO LONG FOR THE SKEETCAST!!!!\n\n*head explodes*"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Oct 30, 2009", "message": "Wow, Jon, you sound nothing like the voice in my head.  Oddly, even though I knew you lived in London, but somehow I never imagined that you had a British accent."}, {"author_name": "matt b", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Oct 30, 2009", "message": "So psyched to listen to Jon Skeet"}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Oct 30, 2009", "message": "@joel spolsky,\n\nInteresting theory on Google being the best \"everything else\".  I thought it was confirmed by Schmidt that Google is trying to grab/maintain the stranglehold on mobile search and traffic."}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://www.ComicsInventory.com", "date": "Oct 30, 2009", "message": "Do you guys not have extra mics. It sounds like everyone is shareing 1 mic."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Oct 30, 2009", "message": "@Donny: Yup, we were all sharing one mic. Bear in mind Jeff and Joel had flown over (and I don't have anything appropriate).\n\n@theman/matt b: Prepare for some disappointment. I think I showed about as much insight as a toilet roll. A fun show to record, but I'm not sure I contributed much useful material :) Next time..."}, {"author_name": "Doug T", "gravatar_hash": "5e6a5609f06b0498d8b7b56fe2ba03ab", "author_url": null, "date": "Oct 30, 2009", "message": "I think the comparison between Android and Windows Mobile is invalid for a couple of reasons.\n\nFirst off Windows Mobile OS is terrible, second off it has 0 practical app support. Its a terrible user experience. Maybe this is due to the gazillion pieces of hardware that use Windows Mobile, but I understand that Google is trying to take tighter control of the hardware they run on. My MyTouch looks like a G1. The Droid looks like it has mostly the same buttons. I don't think these devices are radically different."}, {"author_name": "Håkan Bruce", "gravatar_hash": "5f854253c8335a8f3be78c9789f09c82", "author_url": "http://www.umotive.com", "date": "Oct 30, 2009", "message": "First of all - thanks for a really great day in London!\n\nI noticed some of the talks were filmed, will these be available online perhaps? Would love to show the \"Humanity: Epic Fail\"-talk to my colleagues here in Stockholm who couldn't join me to London."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Oct 30, 2009", "message": "@Håkan Bruce: We got all but the last couple of minutes of my talk, and bits of various others. (All of both of Joel's, I think.)\n\nI believe Carsonified are processing it all (and mixing the video I recorded and the audio they recorded, to get the best of both worlds) - I'm sure when it's up, it'll be well publicised."}, {"author_name": "Chris Kugler", "gravatar_hash": "1ae9c760cdfea22ac530b213b0d5ead8", "author_url": null, "date": "Oct 30, 2009", "message": "I'm still listening to the podcast, and you mentioned a worry about time sensitive questions, meaning questions where the answer may change after a number of months / years. Perhaps you should use a visible indicator to show that a question may be out of date, similar to how you indicate a response to a question was made by the original poster. If a question is older than a year, highlight the title yellow, older than 2 years make it red, or something similar to that. Just a thought in any case. Thanks for the great site, and good luck."}, {"author_name": "Hunter", "gravatar_hash": "fed6c543fa3473193cecf34d0ccb1b77", "author_url": "http://www.ratevegas.com/blog/", "date": "Oct 31, 2009", "message": "Joel-\n\nYes, an iPhone app can initiate a phone call."}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Nov 01, 2009", "message": "Joel's famous answer: http://stackoverflow.com/questions/871405/why-do-i-need-an-ioc-container-as-opposed-to-straightforward-di-code/871420#871420 is an example of an epic FAIL on quite a few fronts. \n\n- You can not really extrapolate \"typical\" from the use of a single framework a few years ago.\n\n- It was NEVER edited to clarify or expand even though it was massively controversial. \n\n- It is a reputation goldmine, it yielded Joel over 400 reputation points even though its scoring -28 at the moment. \n\nOf course reputation to Joel is kind of meaningless and this answer is a massive edge case, nonetheless it sends a bit weird vibes to community.  \n\nAlways fun listening to Jon speak. Jon is kind of the opposite to Joel, super careful with anything controversial.\n\nDon't get me wrong, I love opinionated dinosaur Joel, it makes for a very fun podcast."}, {"author_name": "Daniel", "gravatar_hash": "1c5255f8496fcade0244f12cb6ca6405", "author_url": null, "date": "Nov 01, 2009", "message": "Wow, thats a big turn around on android, \n\npreviously you didn't even think it worth mentioning in regard to mobile development, when questioned you compared it to Linux on the desktop. \n\nNow suddenly you say it will be second to iphone. Other commentators are saying it will overtake iphone by 2012. They cite running on multiple hardware/ multiple carriers as a advantage over the iphone, where as you state it is a disadvantage."}, {"author_name": "duff", "gravatar_hash": "69aa4b5b81a1d2120c98ceed09446489", "author_url": null, "date": "Nov 02, 2009", "message": "In regards to discussion on inserting LaTeX into SO, there's a pure Javascript implementation called jsMath[1].  No server-side images created.\n\n[1] http://www.math.union.edu/~dpvc/jsMath/"}, {"author_name": "Mike S", "gravatar_hash": "69739fc4bc58863ff835f4e929694342", "author_url": null, "date": "Nov 02, 2009", "message": "Great podcast. It washed the bad taste in my mouth from last week's, however, Joel's constant attempts to demonstrate how well he knows the British English dialect were a bit off-putting and insulting to Jon."}, {"author_name": "Jared", "gravatar_hash": "5ff1e1b35d1fc13baf08d807fb2097a7", "author_url": null, "date": "Nov 02, 2009", "message": "Perhaps it should be mentioned that MP3 decoding is totally well defined, deterministic, and not at all \"up to the programmer's interpretation\"; there is a notion of compliance and correct decoding.\n\n\"Decoding, ... is carefully defined in the standard. Most decoders are 'bitstream compliant', which means that the decompressed output - that they produce from a given MP3 file - will be the same, within a specified degree of rounding tolerance, as the output specified mathematically in the ISO/IEC standard document (ISO/IEC 11172-3). Therefore, comparison of decoders is usually based on how computationally efficient they are (i.e., how much memory or CPU time they use in the decoding process).\"\n\n(from http://en.wikipedia.org/wiki/MP3#Decoding_audio)\n\nEncoding, on the other hand, fits the description of being open for interpretation, as mentioned in the podcast:\n\n\"The MPEG-1 standard does not include a precise specification for an MP3 encoder...\"\n\n(from http://en.wikipedia.org/wiki/MP3#Encoding_audio)\n\nSo different encoders encode the same original raw audio data differently, but all compliant decoders produce the same output audio stream, within an error tolerance.\n\nAnd finally, ask any audiophile about audio hardware, and they will tell you that what comes out of your speakers will definitely vary widely, and they can recommend some gold plated cables to help with that. ;-)\n\n(captcha: grant agitates)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Nov 02, 2009", "message": "@Jared: Thanks for the correction. I'm not sure what gave me the impression that the decoding was implementation-dependent."}, {"author_name": "Repo Man", "gravatar_hash": "157014ad7f4e930d3917b31a88c448e5", "author_url": null, "date": "Nov 02, 2009", "message": "Jeff, please let the guests speak more! :) I was hoping to hear more technical jargon from the Skeet man. Otherwise, good podcast."}, {"author_name": "jason", "gravatar_hash": "431cc4a48bbc7ba3034130b5e94867a9", "author_url": null, "date": "Nov 03, 2009", "message": "I was looking forward to this podcast, but the sound quality made it unbearable to listen to. Disappointed."}, {"author_name": "Shaun Martin", "gravatar_hash": "bb7894531494fb7f62b4dd18e303f7b5", "author_url": "http://www.shaunmartin.com", "date": "Nov 03, 2009", "message": "Agree with Repo Man.  Here's the transcript for this episode:\n\nHi, we're in London.\n[half hour of Jeff and Joel talking over one another]\n[Jon finds a way to politely squeeze in a comment]\n[another half hour of Jeff and Joel talking over one another]\nSee you next week!\n\nBummer."}, {"author_name": "cowgod", "gravatar_hash": "17aea005905564dbd400858fef09cf06", "author_url": null, "date": "Nov 03, 2009", "message": "am i the only one that thought joel hardly let jon get a word in for the entire podcast?  everytime jon started speaking, joel interrupted and i was literally screaming at my music player for joel to shut up and let the man speak.  i know that's part of joel's personality, but it was really off putting.\n\ni'd really love it if you guys invited jon back on when he could be more prepared to interact and also had better audio quality."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Nov 03, 2009", "message": "Jon - don't worry about converting £ to $. It's simple for most electronic gadgets 1£=1$ !"}, {"author_name": "Gavin", "gravatar_hash": "15f546fcc3093e92c92df2593b57bbf8", "author_url": null, "date": "May 12, 2011", "message": "Amazing how wrong they were about the iPhone. Good fun!"}]}