{"response": [{"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 14, 2009", "message": "This podcast is VERY HEAVY on the careers front.\n\nSo if you have pending questions or concerns about http://careers.stackoverflow.com I strongly urge you to listen to this one.\n\nThe careers talk gets into full swing around <b>22 minutes in</b>."}, {"author_name": "Andrew", "gravatar_hash": "980fe8340a6d455c77c13ed357851476", "author_url": "http://www.andrewgjohnson.com/", "date": "Oct 14, 2009", "message": "I wanna hear about kiln!"}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Oct 14, 2009", "message": "I *love* moms4mom (even though I'm a dad)\n\n(captcha: betrays laren)"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Oct 14, 2009", "message": "I think you mean dissatisfied, not unsatisfied"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 14, 2009", "message": "> unsatisified - not satisfied, especially with the quantity of something\n\nen.wiktionary.org/wiki/unsatisfied\n\n>  unsatisfying - disappointing: not up to expectations; \"a disappointing performance from one who had seemed so promising\"\n\nwordnetweb.princeton.edu/perl/webwn"}, {"author_name": "Scott W.", "gravatar_hash": "7a03f436e9458527368e5eaa45f85d40", "author_url": "http://moms4mom.com/", "date": "Oct 14, 2009", "message": "Joel said the SO engine wouldn't work for a topic that didn't have absolutely correct answers, so we just had to prove him wrong.  Honestly, after a few weeks of watching moms4mom, it's obvious it's being used as much as a brainstorming platform than a strict Q&amp;A.  A lot of parents post questions along the lines of \"I have this problem and I need ideas.\"  The most helpful ideas get voted up.  It works great.\n\nThanks Jeff!  Please send @betsyphd back!  We promise we'll work on the usability issues..."}, {"author_name": "jjnguy", "gravatar_hash": "2e3bb9e76b9e5cd8f7eedc040d5ccd58", "author_url": null, "date": "Oct 14, 2009", "message": "As far as the land rush goes, I think it would be very nice if the early adapters (paid customers) get perhaps a day head start.  They have shown a certain level of trust in this new idea, and I feel they deserve a little reward.\n\n(Of course the awesome intro rate is pretty sweet...)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Oct 14, 2009", "message": "No, I don't play World of Warcraft. I do play both computer games and board games though, which is why I'm on smartergamer.com :)"}, {"author_name": "binOr", "gravatar_hash": "e41d1b1e777f94cb0c38dbd4bf0a3b68", "author_url": null, "date": "Oct 14, 2009", "message": "Thanks for mention moms4mom, very promising!"}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Oct 15, 2009", "message": "While I like StackOverflow, I do cringe a bit whenever Jeff or Joel refer to it as a community. Everything about the design and philosophy of StackOverflow is anti-community and the thing is, it's not something they can fix because the very things that make it better than phpBB-style forums for Q&amp;A activity are the exact things that make it bad at community building.\n\nStackOverflow is designed to stay sharply on-topic and people are encouraged to read as little of it as necessary to get their answers. \"Google is our user-interface\" as Jeff said.\n\nCompare that to every forum I've been a part of that has felt like a community: People are encouraged to be around for a while before they even post new threads with questions and they are encouraged to stick about afterwards. Also, every single community, even if it had an overall subject, also had off-topic sections because there are no people who only ever talk about programming/motor-sport/music/etc. If you want to get to know other people (which is what community is really about), you have to talk about other things. \n\nA sharp example of this recently was on meta, where even though this is supposedly a more relaxed place for stackoverflow users, a Google Wave invitations exchange thread was rapidly closed as being off-topic. Every other forum I use (technical and non-technical) has a Wave invite thread going at the moment and StackOverflow won't even allow it on it's discussion site.\n\nNow you can dismiss what I'm saying because you're happy with StackOverflow as an effective way for programmers to exchange programming knowledge, which it is. But a community it ain't."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Oct 15, 2009", "message": "I just wanted to kind of echo something I find odd and mentioned in other comment thread on the blog.\n\nHow do the founders of SO square this new careers piece with very conflicting views of what it means to be a worthwhile hire for programming? Again, on the one side, if you don't have a 4.0 undergrad from Yale, interned at a Fortune 100 by Junior year, ever had to apply at a company (certainly if you've ever applied to more than a couple employers) then you are probably little more than a mediocre programmer. Also, this view seems to hold that if you have a PhD in Computer Science then you probably know less about CS than a Marketing major. And, on the other side, all that competency requires is knowing a few terms and reading blogs (if you're doing that, then, \"you've already won\").\n\nIf these views are seriously held as argued for in published books and popular blogs, particularly the former view, how can SO promote the careers piece without, at best, a heavy dose of cynicism?"}, {"author_name": "no one", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": null, "date": "Oct 15, 2009", "message": "To continue with the pedantry:\n\nhttp://www.dailywritingtips.com/dissatisfied-unsatisfied/\n\n\nand\n\nhttp://thesaurus.reference.com/browse/dissatisfied"}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Oct 15, 2009", "message": "OK, I get that the charge to post resumes isn't a greedy cash grab by Joel and Jeff so they can retire and count their money and laugh at how they suckered a \"community\" of devleopers into paying them for something that was free, and that it is a response to the legitimate requriement that to add be a value for employers, it has to present high-quality candidates.\n\nStill, I question it.\n\nAs a provider of a career website, the problem of filtering resumes to truly interested candidates is *your* problem.  What you have essentially done is punt that problem back to us.  What you have said is that paying the fee is necessary (and perhaps sufficient) to establish oneself as a motivated job seeker.  You have turned your problem into our problem.\n\nJeff talked about feeling \"dirty\" posting his resume to unfiltered sites like Dice and Monster.  My response is (if I were still single) I would rather go to the seediest singles bar than patronize the classiest call girl service.  Paying for something that ought to be or was free crosses a line in people's minds, and it's going to take some work to overcome that.\n\nYou have built a culture over the past few years of telling us that we are great developers, and that we deserve to work in good jobs.  And now you are saying you want to help us do that, but we have to pay you for the privilege?  It feels like an insult.\n\nAnd it also, in my opinion, gets the relationship with the employer off on the wrong foot.  I have started it by establishing that I think I need to pay to find a job.  How will that position me in salary negotiations?"}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Oct 15, 2009", "message": "truth ^^"}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Oct 15, 2009", "message": "+1 JohnMcG \n\nI absolutely agree - this is not our probloem - (to figure out how to \"qualify\" us so that you can make more money from ads.\n\nI recall that Joel had posted a giddy blog entry a while back about how an intern netted him/FC over $1M by making a jobs board...\n\nNow it smacks of entitlement and greed."}, {"author_name": "Joel Spolsky", "gravatar_hash": "d77663c217e9d27b725338c06674c94b", "author_url": "http://www.joelonsoftware.com", "date": "Oct 15, 2009", "message": "Don't forget, the careers site is totally optional. If you don't want to pay, don't use it. I won't be offended. We're not \"entitled\" to your $29 bucks, we have to earn it by getting you a great job, and if we don't, we'll give you your money back."}, {"author_name": "meta mike", "gravatar_hash": "f553bdbfd6b175ddbfbd6503d28fa0d4", "author_url": null, "date": "Oct 16, 2009", "message": "I got a kick out of Jeff slamming Flickr for their \"no refunds ever\" policy and I agree with calling out companies who deserve it.\n\nI would like to add to Jeff's list two web hosting companies that take money from unsuspecting customers, fail to provide service, and then don't refund the money: M6.net and Digitalibiz.com.\n\n(By the way, I posted this meta.stackoverflow.com and some moderator closed it for being unrelated to meta. How can any discussion spawned from the podcast and tagged as conversation be unrelated? But I digress.)\n\nI'm curious what companies/experiences folks have to add to this list."}, {"author_name": "meta mike", "gravatar_hash": "f553bdbfd6b175ddbfbd6503d28fa0d4", "author_url": null, "date": "Oct 16, 2009", "message": "I should point out that while Jeff isn't too fond of Flickr.com, as am amateur photographer I love it... then again, I don't try to use it the way Jeff wanted to.  :-)"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Oct 16, 2009", "message": "Is this going to lead to some self-censorship on SO?\nSince questions are easier to search (there are less of them and they appear at the top of the profile page) the recruiter is going to look at your questions.\n\nI have asked some dumb questions - just because SO is easier than Google. Do I want to do that if SO is an interview?"}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Oct 16, 2009", "message": "One more note that's bothering me -- the prices ending in 9.\n\nTo me, this is a red flag, that someone's trying to put one over on me, trying to get the most out of me without passing some threshold.  I would never ask a friend to borrow $99.  I would ask for a hundred bucks.  Prices like $29 and $99 feed the notion that we're being spun, and our intelligence is not being respected.\n\nSecond, yes, Joel, I understand that this is optional, and I don't have to do it.  But you are asking for us to help you and support you.  I can ask a friend to borrow money, making clear that it is completely optional, but it would still change the nature of the relationship.  That's part of what has happened here.  We're not just together as a community of developers, we're dollar signs.  It's not the end of the world, or a crime that cries out for vengeance, but not all of us like it, either."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Oct 16, 2009", "message": "After listening to the podcast I understand a little more about the rationale, however, the point still is that SO has a problem with how to justify charging the buyer side (employer) that much money and the best they could come up with was to charge the other side. (job seekers) \n\nI agree with John - Joel and Jeff basically punted on this one.  What we'll have then is people who are willing to pay money - not necessarily the best candidates or the ones who are willing to take a new job.  \n\nThere is an endless supply of evidence that desperate people will spend money to get jobs or on get-rich-quick schemes so the premise that this somehow \"qualifies\" people is dead wrong.  It may sound good when you're selling a recruiter on paying you $1000 to do a search and you can point at some of the brilliant people on SO, but if your real pool of $29 candidates is the ones right out of college or the ones recently laid off is that what you really want?  \nAs of this writing the last two posts by people who support it are two college kids just entering the job market.  Is that really the pool of qualified candidates you want to be selling?  I don't think so.\n\nIf you're making the market you can choose the rules.  In this case using money as the qualifier for \"serious\" job hunters is a mistake. \n\nIMO all the CVs should be searchable if it was elected and the candidates should have a set of criteria that they can present to recruiters so that neither side wastes time.\n\nOne should be able to define things like geographic areas, minimum salary, vacation, office space, CPU speed, only green M&amp;Ms in the receptionists desk jar, etc.  And this, my friends, is truly something that I would pay for.\n\nIf I could \"qualify\" only \"serious\" employers then I would pay $29.99 for that.  (but I would rather it be free since it allows the employer to limit the time spent on the candidates.  They would know whether the candidate is interested in their environment or not."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Oct 16, 2009", "message": "But Joel, you have to admit there is some cynicism here. If one pays for a job, under the view that has been espoused, then one does not deserve or at least, is not good enough for a good programming job."}, {"author_name": "ctford", "gravatar_hash": "70fb78883a4548028fffe189762d5a85", "author_url": "http://literateprogrammer.blogspot.com", "date": "Oct 18, 2009", "message": "Joel and Jeff, do you intend to list short term contracts on the careers site?\n\nI personally value short term contracts because they give me a wide range of experience, but you might also take the view that they prevent programmers from developing a meaningful relationship with their employer.\n\nYou have strong ideas about what kind of positions should be on your site so I was curious about your take on contracting."}, {"author_name": "Jason", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": null, "date": "Oct 20, 2009", "message": "I read this\n“The Fog Creek Promise: If you’re not satisfied, for any reason, within 90 days you get a full refund, period, no questions asked. We don’t want your money if you’re not amazingly happy.”\n\nI think there are some grammatical errors.  I think there should be a comma, after the '90 days', or someone may interpret this to mean \"I'll get my refund within 90 days - between whatever day I ask for it, and a few months from now.\"  It should be more specific to say, \"If you are not satisfied, within 90 days, you can get your money back.\""}, {"author_name": "Ralph Rickenbach", "gravatar_hash": "09eb3720b1c9d33bedd35a3bd47ec1c9", "author_url": "http://www.rickenba.ch", "date": "Oct 21, 2009", "message": "@Jason: I do think that the refund will be done for the full contract time span, as Joel in his comment above said: \"We’re not “entitled” to your $29 bucks, we have to earn it by getting you a great job, and if we don’t, we’ll give you your money back.\"\n\nNow, how should I now after 90 days whether they will succeed? I will only know after the contract ended. No questions asked means you are making an investment of $29 now, and get them back in three years. Just keep a copy of the money back guarantee and Joel's comment."}, {"author_name": "Jason", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": null, "date": "Oct 21, 2009", "message": "@Ralph:  Wow, Gotcha - I thought they were referring to their software subscription service.  I can see this guarantee being reasonable for all parties, now."}, {"author_name": "Jeremy French", "gravatar_hash": "ce06772afa81dcbd4dbdd8273234152b", "author_url": "http://www.jeremyfrench.co.uk", "date": "Oct 21, 2009", "message": "I feel that they explained the rational behind the paying and the vanity site well. \n\nOne thing that made me chuckle was the idea of using “CV” instead of “resume” because of all the negative connotations of the word “resume” of course in the UK where CV is the standard it has all of the same negative connotations."}, {"author_name": "George", "gravatar_hash": "12253d48375c73fcfdda8688da6aa3a4", "author_url": null, "date": "Oct 23, 2009", "message": "I find the question of the week ironic, given my experience of the crappy wifi at yesterday's DevDay in Seattle. Almost every time I tried to get online, I failed to get a connection. It was the lowpoint for me of an otherwise pretty good conference."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Oct 23, 2009", "message": "for $99 you expect wifi?  With that many people?  I have a brigde to sell you."}]}