{"response": [{"author_name": "Stu Thompson", "gravatar_hash": "428344688dc21d72a3723d94bed66680", "author_url": "http://www.dietpizza.ch/geekomatic", "date": "Oct 21, 2009", "message": "Jon Skeet can post here.  Can I?  Yup."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Oct 22, 2009", "message": "Let's see if I can post now... it could have been something odd over 3G.\n\nAnyway, I just wanted to say how I loved Jeff's bit about natural communication being incredibly important. Everyone should write a *lot* - whether it's a blog, a book, SO answers, emails or whatever. Write, and take some care over it. Clarifying your communication helps you to clarify your own internal thought processes, in my experience.\n\nIt's amazing how much you find you don't know when you try to explain something in detail to someone else. It can start a whole new process of discovery.\n\nJon"}, {"author_name": "macbirdie", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Oct 22, 2009", "message": "Jeff, please, stop with this \"non-web-app development is so retro\" nonsense already. If you're so attached to the \"web-apps are the only way\" idea, be a man and move from Visual Studio to Bespin or something."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 22, 2009", "message": "Web-apps aren't the <i>only</i> way. There's also mobile apps. :)"}, {"author_name": "voyager", "gravatar_hash": "c658f5d2eae05b8e7cab26a40106cd7c", "author_url": null, "date": "Oct 22, 2009", "message": "@macbirdie: developers are something quite different to the common user. An \"80% long tail\" user doesn't need anything more that what Google Apps and Gmail have to offer.\n\nJust wait for HTML5 ;)"}, {"author_name": "Colonel Sponsz", "gravatar_hash": "cae93d12a6a39d5dc68eadf4cf45e526", "author_url": null, "date": "Oct 22, 2009", "message": "@Jon Skeet:  When one teaches two learn."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Oct 22, 2009", "message": "Im heading straight for the underground... FPGA and micro controllers here I come !!!!!!!!!!\n\nfk a web app!!"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Oct 22, 2009", "message": "I don't really see the point of the whole \"Web apps only (except mobile)\" craze. It seems to be sort of naive. All this time that has been spent improving clients has essentially been wasted if we stop using client applications altogether. There's not much need for gigs of memory or an increase in CPU power if all you're going to do is download and parse some HTML (ok, maybe you want the memory if you have poorly written browsers or Javascript, but performance is pointless anyway right?). I certainly don't see why these people would care about Windows 7 (and believe me, they *do*); aren't you baaically supposed to be using a dumb terminal that boots directly into a web browser?\n\nI guess I don't see the point in this view. Of course, there's this cliche that says \"people who don't see why everything should be done on the Web (or mobile, which seems sort of contradictory but all right) are just dumb dumbs that don't get social networking\" that we're all supposed to take as axiomatic at this point. \n\nHowever, I don't think this is really necessary. I see on Jeff's blog (but he is by no means the only one but stated some \"Atwood's Law\" or some such whatever) this idea that you can write any kind of app you want to be web based. Well, sure, I mean most of these languages are Turing complete, so you got me there. But what's the real motivation?\n\nThe primary party line is usually either 1) deployment and 2) portability. Deployment can be solved; in fact many have solved it. As for portability, if you're advocating Web centric dumb terminals then why would you care about OS portability anyway? But portability can be solved and has been solved by a few applications, not just using byte-code interpreted languages (although, that's really not a bad idea; you can't throw the baby out with early-Java's bathwater).\n\nEven further, the Internet is built on TCP/IP, which supports a lot more than just HTTP/HTTPS. It's just such a strange box to stay within. Does anyone think there might be some fundamental differences between an application and a hyperlinked document? It is not inconceivable to have an application delivery mechanism that is rich, portable, and supports a fairly simple deployment paradigm; actually there are some things like that - SecondLife, you can just ignore the \"Virtual World\" aspect of it and see that they have essentially achieved this without it even being the primary goal.\n\nIf in fifty years all we have in terms of software innovation is a couple new versions of HTML and a couple more \"rectangle\" plugins (as Joel and Jeff refer to them) then I think that would be somewhat sad and unnecessary, we certainly wouldn't be utilzing the vast computing power that we currently or will have."}, {"author_name": "steve", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Oct 22, 2009", "message": "Love the podcast as usual - today though... i wish it was a VIDEO podcast! ;-)"}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Oct 22, 2009", "message": "And this was the point I relised I don't need to listen to the Stackoverflow podcast any more..."}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Oct 22, 2009", "message": "The iPhone sounds like a nightmare to program for."}, {"author_name": "Robert", "gravatar_hash": "d538b5badf6dcba95f7b60a511104440", "author_url": "http://cubeantics.com", "date": "Oct 22, 2009", "message": "Nice!\n\nWhat did you guys use to record this audio?  I took some audio at the Austin conference but it sounds kind of amateurish at times.  Maybe because I don't have a super fancy recorder (maybe it's time to start investing in one).\n\nAlso, did you just have the recorder sitting out on a table, or did you hook it up to the actual PA system?\n\nIt's nice to be able to capture all of the knowledge at these events and not limit it to just those in attendance."}, {"author_name": "Andrew", "gravatar_hash": "980fe8340a6d455c77c13ed357851476", "author_url": "http://www.andrewgjohnson.com", "date": "Oct 22, 2009", "message": "I've only 8 minutes in but I feel like this is the first time I've listened to the SO podcast (I've listened since week 1) and wished it was available with video."}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Oct 22, 2009", "message": "@Robert\nWhen recording a live event you usually want to record\n2 sources. The speaker mic thats going through the PA and then a stereo mic out in the room. If you don't have a stereo mic then use 2 condenser mics in \"V\" formation.\n\nFor the best sound use a 96kHz/24-bit recorder."}, {"author_name": "Robert", "gravatar_hash": "d538b5badf6dcba95f7b60a511104440", "author_url": "http://cubeantics.com", "date": "Oct 22, 2009", "message": "@Donny Thanks for the info.  Do you have any recorders that you recommend?  \n\nI used the Olympus WS-510M to record the Austin presentations.\n\nIf I read the specs right, then I'm only recording with 44kHz."}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Oct 22, 2009", "message": "@Robert\nIf you want the best, Sony handheld recorders are usually the best, if you can afford it.\nhttp://pro-audio.musiciansfriend.com/product/Sony-PCMD50-Portable-Digital-Recorder?sku=241731\n\nOlympus makes a really nice recorder for a reasonable price.\nhttp://pro-audio.musiciansfriend.com/product/Olympus-LS10-Linear-PCM-Recorder?sku=245172"}, {"author_name": "Robert", "gravatar_hash": "d538b5badf6dcba95f7b60a511104440", "author_url": "http://cubeantics.com", "date": "Oct 22, 2009", "message": "@Donny\n\nThat's great, thanks for the info.  Looks like it's time to start saving my pennies."}, {"author_name": "pc1oad1etter", "gravatar_hash": "512b9b4b9d8c2ea040f690e1e44cf230", "author_url": null, "date": "Oct 22, 2009", "message": "Can we see some slides, Jeff?"}, {"author_name": "Austin", "gravatar_hash": "c5ca0194c4cfd38e4531ef115e9d5167", "author_url": null, "date": "Oct 22, 2009", "message": "Nice SoDak drop (both by name and the Laura Ingalls Wilder reference) in the podcast!\n\nI don't live there anymore but you have at least one South Dakotan listening and I still have the De Smet (Wilder's hometown for a few years) connections too.  They do have pretty decent internet there too... but very poor for the iPhones so I had to move.  ;-)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Oct 22, 2009", "message": "Just finished listening.\n\nOh what I would have given to be there for the var/dynamic discussion...\n\n(Ob pedant: named parameters are nothing new. If we couldn't name them, how could we refer to them in the method? It's named arguments which are new to C# 4 ;)"}, {"author_name": "Scott Hanselman", "gravatar_hash": "719c91f5c3013e43ee46ed2bdc67f883", "author_url": "http://www.hanselman.com", "date": "Oct 22, 2009", "message": "Thanks Jon, I misspoke. Glad you knew what I meant, though!"}, {"author_name": "Scott Hanselman", "gravatar_hash": "719c91f5c3013e43ee46ed2bdc67f883", "author_url": "http://www.hanselman.com", "date": "Oct 22, 2009", "message": "Oh, BTW, I'll have the video of this up in the new few hours."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Oct 22, 2009", "message": "@Scott: I always get it the wrong way round unless I'm consciously being pedantic. Heck one of my most popular pages is \"parameter passing\" which is a misnomer to start with :)\n\nGreat podcast btw..."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Oct 22, 2009", "message": "I hate duck-typing with a passion.\n\nOption Strict On!!!"}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Oct 22, 2009", "message": "The problem with iPhone programming is that if you're on Windows you have to get a Mac, pay $100 (yearly I think) to Apple for license to put apps on their store, get an iPhone (obviously), learn Objective C and after all your hard work, there's no guarantee your app will be accepted in the app store.\n\nAn interesting product is ComponentOne Studio for iPhone where you can create an asp.net web app which looks like an iPhone app. Obviously you have to be online to use the app and but iPhone users are connected all the time. This way you can create a web app very quickly and you're in total control because you don't have to use the app store. There's a free open source project on Google Code to get something similar."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Oct 22, 2009", "message": "addition to my post: I know about MonoTouch but I would rather use the latest full native apps which have all the features."}, {"author_name": "Chuck Conway", "gravatar_hash": "0ab90eee205edea2c0fd09f9e06cbaf3", "author_url": "http://www.cconway.com", "date": "Oct 22, 2009", "message": "Ha ha, best podcast ever!\n\nI attended the SF Dev Days. I thought it was great. For 100 bucks you couldn't ask for anything more.\n\nYa Wi-Fi would have been nice, but wasn't necessary for for a day long conference."}, {"author_name": "JS Bangs", "gravatar_hash": "26a6b978dd7b7f8ea7dd446cff12cf5c", "author_url": "http://jsbangs.wordpress.com", "date": "Oct 22, 2009", "message": "I was sort of appalled that no one other than Joel believed that type inference for function arguments could possibly work. The algorithms aren't hard to understand, and have existed for 20 years. http://en.wikipedia.org/wiki/Type_inference has a good overview."}, {"author_name": "Hank Sims", "gravatar_hash": "fdb62688f9e7db2f5ec0ba080975d106", "author_url": null, "date": "Oct 22, 2009", "message": "Why did you record this underwater."}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://www.pauldwaite.co.uk/", "date": "Oct 22, 2009", "message": "“There’s not much need for gigs of memory or an increase in CPU power if all you’re going to do is download and parse some HTML”\n\nSomebody still needs to make the web apps, and if you’re doing that you’ll need to run two VMs: one to test in IE 7, and one to test in IE 8. Then possibly another one to test in IE 6, if you’re feeling frisky.\n\nThis assumes you’re making your web apps on a Mac. If you’re not, best stick to Win32 programming, you’re definitely not cool enough to hang with the web crowd."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Oct 22, 2009", "message": "@Paul D. Waite\n\nI don't think any of that makes much sense at all to be honest. \n\nYour position here suggests that the only reason to have spent all this money and time developing these powerful personal computers is so that a small, small minority of users (programmers) can run some virtual machines to test their Web applications. That's kind of silly.\n\nFirst of all, clearly in that situation all that research, development, etc was not worth it; the population of users is too small. Anyway, the second bit of this that doesn't make sense is that in the world where only Web programming (and to be pedantic, mobile programming), why would you need these virtual machines and all of these high powered solutions when all you want to do is verify the appearance and behavior of a HTML document from browser to browser? Surely, 1/100,000,000 (if not less) of the resources used to build the aforementioned things could have been used to solve that Web programmers can keep programming on the same dumb terminals that the vast majority of the users in this version of the world would be using. Of course, in such a World building operating systems such as Windows XP/Vista/7 would not be *at all* justified in terms of cost, usefuleness, etc so I don't see why IE 6/7/8 even matter since you would just have some dumb terminal, very basic OS for which the sole purpose is to allow the browsing of Web sites over TCP/IP and perhaps take in input (from Video cameras, etc) to be use in those Web browsers through those \"Rectangles\" that Joel, Jeff, et al are not fond of anyway (i.e. Flash on YouTube etc).\n\nAs for all this jibber jabber about \"if a programmer is not on a Mac then they are not cool enough to hang out with the 'web crowd',\" I'm not sure that your point there is at all intelligible. If all you need is a dumb terminal to do Web browsing then why would you need some complicated OS like the Mac OS X family? What does this nonsense have to do with anything? This is not even relevant."}, {"author_name": "Frank", "gravatar_hash": "3eef89c1710742937cc74bf88da9dff8", "author_url": null, "date": "Oct 22, 2009", "message": "BEST Podcast so far. I couldn't stop laughing while Joel couldn't stop laughing. Oh my."}, {"author_name": "Scott Hanselman", "gravatar_hash": "719c91f5c3013e43ee46ed2bdc67f883", "author_url": "http://www.hanselman.com/blog/HanselminutesOn9SpolskyAtwoodBlythHanselmanCrazyDeliciousContentFree.aspx", "date": "Oct 23, 2009", "message": "Ok, the <a href=\"http://www.hanselman.com/blog/HanselminutesOn9SpolskyAtwoodBlythHanselmanCrazyDeliciousContentFree.aspx\" rel=\"nofollow\">video of this session is up at Channel9 now</a>."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Oct 23, 2009", "message": "It's a shame Jeff made the classic beginner mistake of not repeating the questions he was asked into his microphone. He even said he was going to do it and then didn't!"}, {"author_name": "Jörg W Mittag", "gravatar_hash": "0bfe384bf9dce3cc1fda1bb0ff5f4e0e", "author_url": null, "date": "Oct 23, 2009", "message": "@JS Bangs: I agree. I just researched this a little bit and it turns out it's not actually 20 years, it's more than 80! Apparently, type inference has been independently invented no less than 6 times between the 1920s (Tarski) and 1967 (Hindley).\n\nSo, hearing that apparantly nobody except Joel had ever heard of type-inference was extremely shocking."}, {"author_name": "Vladimir", "gravatar_hash": "25c35e90595b236da0fee29edb70db7f", "author_url": null, "date": "Oct 23, 2009", "message": "Two points I wish people making podcasts out of public talks knew:\n\n1. Those who are listening to the podcast don't see your slides, you know. Maybe you don't care, but otherwise you better keep that in mind next time you are about to say \"we had it there like this (burst of laughter in the audience)... but then we changed that piece over there (lol)... to this here (lol!!!)\" - those poor schmucks who weren't there have no idea what all the laughter is about.\n\n2. Microphones they use to take questions are usually far, far worse than the one you have - so, why not summarize the question before answering? Listen to 37:00 of this for an example. About 15 minutes of total silence, so complete that I reached for my mp3 player to check if it maybe ran out of battery and turned off, and then Jeff says: \"It's CPU.\" Or was that \"It's 42\"? Well, either way the question kinda hard to deduce..."}, {"author_name": "Vladimir", "gravatar_hash": "25c35e90595b236da0fee29edb70db7f", "author_url": null, "date": "Oct 23, 2009", "message": "* I meant, of course, \"15 SECONDS of total silence\"..."}, {"author_name": "Mike V", "gravatar_hash": "614d185ab7779bca1a8fae8ae2026305", "author_url": "http://silverbling.blogspot.com", "date": "Oct 24, 2009", "message": "FYI, I really liked the conversation about \"var\" and type inference, and it was frustrating to have you try to hurry it out of existence."}, {"author_name": "Jonik", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Oct 27, 2009", "message": "The gang of four discussion got at times quite interesting - but only after they finally started discussing stuff instead of fooling around and going on about how many microphones and other uninteresting pieces of equipment there are.\n\nSome of the presentation clips didn't work at all without seeing the slides that were being shown - e.g. the Python and ASP.NET MVC ones. (Should have been cut out as now the episode was too long overall.) Some clips were great though, like the one by Jeff. (I appreciated references to Coders at Work, what Josh Bloch said about Elements of Style, etc.) I only hope the talk at Cambridge won't be exactly the same, now that I've heard a big part of it!"}, {"author_name": "secretGeek", "gravatar_hash": "36f79355a0f99b6b033e479fcfffa51f", "author_url": "http://secretGeek.net", "date": "Oct 28, 2009", "message": "i like scott, but he did sound like a bit of a jerk in there. \n\ntype inference for args/params is not some wacky new idea that Joel came up with, and can be seen in many languages."}, {"author_name": "hungale", "gravatar_hash": "a629c4c9555beccc8b1225083007f28d", "author_url": "http://www.dailynoithat.com/", "date": "Aug 09, 2011", "message": "long time comback . you blog are live :D"}]}