{"response": [{"author_name": "Mark Freedman", "gravatar_hash": "2a63d82881d0ceb3149506c833f8f231", "author_url": "http://MarkFreedman.com", "date": "Dec 16, 2010", "message": "Despite my knee-jerk reaction to this (\"jerk\" being the key word for my reaction), I think this has great potential.  Best of luck to everyone involved."}, {"author_name": "Jonathan Hartley", "gravatar_hash": "b2507d479af955f05ee995b8d5daa6ac", "author_url": "http://tartley.com", "date": "Dec 17, 2010", "message": "I don't understand the benefit of splitting these questions off into their own site. Doesn't that just make it harder to find the answers you're looking for? Or does search search across both sites? Is the idea to mean browsing one site or the other will only find specific types of question? What's the benefit of that though? I think when I'm browsing or searching, I want to see all answers around the topic, not just a subset of them. I don't get it!"}, {"author_name": "raszi", "gravatar_hash": "bbfbca5273f9d020ef4ccfbadcecccba", "author_url": "http://raszi.hu/", "date": "Dec 17, 2010", "message": "I have to agree with Jonathan. No need to split."}, {"author_name": "kaiz.net", "gravatar_hash": "d17355578804711e49ee155284037a0e", "author_url": null, "date": "Dec 17, 2010", "message": "Agree. I would prefer to find those questions on stackoverflow.\nBut I search via Google anyway, so maybe it will not matter too much."}, {"author_name": "C. Ross", "gravatar_hash": "ec4b051825229c870b5b4c0c9a371558", "author_url": "http://stackoverflow.com/users/16487/c-ross", "date": "Dec 17, 2010", "message": "Hats off to Programmers!  These are great first steps to building a great community.\n\nNow for the great question migration ..."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": null, "date": "Dec 17, 2010", "message": "I also prefer to find these questions on Stack Overflow. This seems like needless at best and damaging at worst."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 17, 2010", "message": "> Or does search search across both sites? \n\nSee http://blog.stackoverflow.com/2010/10/search-all-stack-exchange-sites/\n\n> I would prefer to find those questions on stackoverflow\n\nThese types of questions generally do not fit on Stack Overflow. See: http://blog.stackoverflow.com/2009/04/the-stack-overflow-question-lifecycle/"}, {"author_name": "Gergely Orosz", "gravatar_hash": "4de0bd0d87ade9cac3a76609a80c9af3", "author_url": "http://gregdoesit.com", "date": "Dec 17, 2010", "message": "- Developer testing\n- Developer tools and techniques\n- Practical algorithms and data structures\n- Design patterns\n- Code golf &amp; programming puzzles\n\nAll of these types of questions seemed to fit in great with stackoverflow. I'd disagree with the need to move these questions off of it - it has been programmers asking programming relating questions IMO."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.systempuntoout.com", "date": "Dec 17, 2010", "message": "Programmers is a pretty cool community and I really like it; anyway I'd prefer to have those questions on Stack Overflow too. Soon Area51 will give birth to \"Databases\" that is going to predate a lot of topics/users from Stack Overflow. I don't like this sharding approach too much but it's just a personal opinion."}, {"author_name": "mario", "gravatar_hash": "87715121cf40fa51bd4e5c7779f1eedd", "author_url": null, "date": "Dec 17, 2010", "message": "Still don't get it. Why go to two sites for obviously related questions? Why can't a person just use one search box for software development questions? That's what tags are for. KISS."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 17, 2010", "message": "@mario by that logic, there should only be one \"website\" on the entire internet. \n\nCareful, because you're also advocating Yahoo Answers, where anything and everything is on topic all the time."}, {"author_name": "Ross", "gravatar_hash": "7b264437c3c5a8621765158cf4ef6b88", "author_url": null, "date": "Dec 17, 2010", "message": "Fantastic, this is something that has been missing with stackoverflow. Just looking at the type of questions being asked, there is a significant between the two. I have asked both specific programming questions and more general design questions on stackoverflow. The former questions worked out well, well the others were less then useful. While there is some overlap, there is a reasonable enough criteria to determine what goes where."}, {"author_name": "Trevor", "gravatar_hash": "90f41f7055e3984fcb0a7d790f8f24eb", "author_url": null, "date": "Dec 17, 2010", "message": "My initial thought - an unnecessary split; though I'm interested to see how this benefits both the people who ask questions and those who answer. From my point of view, I can't see it being a positive experience."}, {"author_name": "Shoban", "gravatar_hash": "cefea7db59f677c668a74699e49c1934", "author_url": "http://www.codegeeks.net", "date": "Dec 17, 2010", "message": "Even though the justifications seems okay!! but i still prefer SO alone... :-)"}, {"author_name": "Bill P. Godfrey", "gravatar_hash": "760bfd359153d0682dbe113dc02f81ba", "author_url": "http://billpg.com/", "date": "Dec 17, 2010", "message": "I wonder why this new one wasn't given the domain programmers.stackoverflow.com?"}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Dec 17, 2010", "message": "So why is this site a good idea again? Before it launched, we could ask the exact same questions on SO, no one would close them, and a huge audience would see them, discuss them and answer them.\n\nNow they're walled off with a much smaller audience, and programmers have to check two sites instead of one.\n\nAnd no, this has nothing to do with \"one website on the internet\" or Yahoo answers or other strawman arguments. It has to do with taking one site that worked well, and chopping 10% off it and putting those 10% on a different domain. It serves no purpose other than to hide information."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 17, 2010", "message": "> Before it launched, we could ask the exact same questions on SO, no one would close them\n\nIncorrect, almost all the questions that are on-topic on programmers get closed with the jackbooted heel of justice on SO.\n\n> It has to do with taking one site that worked well, and chopping 10% off it and putting those 10% on a different domain\n\nRead this closely Jalf\n\nhttp://scobleizer.com/2009/11/02/the-chat-roomforum-problem-an-apology-to-technosailor/\n\nIn other words, the people sitting in front of compilers and editors are kind of distracted by the people sitting in front of whiteboards.\n\nBoth are useful, but they're very different and kinda incompatible contexts."}, {"author_name": "Allov", "gravatar_hash": "e6445a2215fcc4df296bd7771fbce2ca", "author_url": "http://allovqc.blogger.com", "date": "Dec 17, 2010", "message": "The thing I hate about this is that stackexchange is starting to split more and more, and looking more like the messy news groups.\n\nWasn't it the goal of stackoverflow to prevent this kind of stuff?"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Dec 17, 2010", "message": "So programmers.so is where a question can be closed for being ontopic and NOT argumentative ?"}, {"author_name": "Frank Garrett", "gravatar_hash": "b7cdfb1ea2466ef265ae9fc11d67b63d", "author_url": null, "date": "Dec 18, 2010", "message": "I won't visit it in addition to SO, so there goes a set of questions I might just have had a good answer for that I'll never see."}, {"author_name": "Uwe", "gravatar_hash": "53a82f701ae492808834e621de2586eb", "author_url": "http://www.zeta-producer.com", "date": "Dec 18, 2010", "message": "Ha, I don't even get all those different *stack* sites. To be safe, I registered for all I could find in the footer, but honestly, I don't get the idea of _that_ many different sites.\n\nSeems like the stack network goes the way that the C# compiler goes; more and more features that fewer and fewer people can catch up with.\n\nThat said, I still think stackoverflow.com is the best support site in the Internet."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 18, 2010", "message": "> I don’t get the idea of _that_ many different sites.\n\nIs it really so hard to understand that people who love baseball want to hang out on the site about baseball, filled with other people who love baseball and are all experts on baseball?\n\nIf anything, I don't understand people who don't grok this. \"I want one site that does everything!\" Well, then hang out on Facebook (or, Yahoo Answers) and never leave. Done and ... done."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Dec 18, 2010", "message": "Yeah, but purely design questions (no source code) do occur and I think appropriately so on SO. I don't think it would be a good idea to tell SO users to go to another site to ask design questions. Now, if people want to use Programmers for a place to ask like \"Why are programmers so cool?\" or something like that, then that's fine, but ... I think to say SO is just for source code based questions is a bit much. Virtually everything in that list is appropriate for SO. This is my gripe with it. I think to suggest that what @mario argued is just to advance Yahoo Answers is a bit flippant and a strawman. @mario isn't talking about haviing \"How is babby formed\" type questions sorted by tagging. He's talking about questions about design patterns, etc. Those questions have always been *very* prevelant and accepted in the *real*, rather than \"ideal,\" SO, irrespective of any jackbooted heels or any of that kind of stuff.\n\nI think quoting Scoble for anything is probably never a good idea. I'm not sure the people in front of compilers are being distracted. If they get a compiler error and want to post a question, they don't have to browse those other questions. Why not have a separate site for C, C++, Java, RoR, Python, Django, etc? Python interpreter error related questions are usually not relevant to C# compiler error related questions.\nPersonally, I think other issues are things like despite SO being very popular, I try to tell many programmers about it that have never heard of SO (yes they do exist and they aren't all idiots) and tell them all the great things about it etc but if I have to preface it with \"Oh but if you have any architecture or design questions, go to this other site,\" I would probably rather not go there."}, {"author_name": "Jon", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Dec 18, 2010", "message": "Jeff you should be careful about telling people to leave your beloved kids, the stack exchange sites, otherwise it may just happen.  A lot of these people are making great points and I agree with jalf 100%.  If you don't like criticism don't post it on the blog sites.\n\nI used to really like the concept of stack overflow, used to be on it a lot.  I find myself using it less and less because of all these little site split ups.  I also find it strange that the same people who made stack overflow such a big success are told to leave the site.  Your wishes may come true Jeff be careful."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 18, 2010", "message": ">  I try to tell many programmers about it that have never heard of SO (yes they do exist and they aren’t all idiots) and tell them all the great things about it etc but if I have to preface it with “Oh but if you have any architecture or design questions, go to this other site,” I would probably rather not go there.\n\nNo need to tell them anything; they'll either end up on the sites -- ANY of the sites -- organically via a Google search, or they won't. Either way is fine by me.\n\n> He’s talking about questions about design patterns, etc. Those questions have always been *very* prevelant and accepted in the *real*, rather than “ideal,” SO, irrespective of any jackbooted heels or any of that kind of stuff.\n\nNo, they haven't. Questions about opinions and feelings and hand-wavy what-ifs have always gotten a frosty reception *at best* on Stack Overflow. But throw some code in there with a practical real world example, and sure.\n\nHave you ALREADY forgotten the subjective tag? This was a top 20 tag!\n\nhttp://blog.stackoverflow.com/2010/08/the-death-of-meta-tags/\n\n> A lot of these people are making great points and I agree with jalf 100%. If you don’t like criticism don’t post it on the blog sites.\n\nI think the people posting these 'your site should be about any question that ever might pop into a programmer's head' opinions have no clue how toxic that is in practice. My advice to them is to start their own community site for programmers with that goal and observe what happens. As the Smash TV announcer once said, \"Good luck. You're gonna need it.\""}, {"author_name": "John S.", "gravatar_hash": "8b6794beba00d820d31ea6ce9be9236b", "author_url": null, "date": "Dec 19, 2010", "message": "I know it's something you've given a lot of thought to, and probably still are, but basically it comes down to the dreaded email problem:\n\nTons of stuff, a fraction of it interests you, how to sort through it?\nRight now, you have two answers: Different sites, different tags.\n\nHonestly, speaking as someone who doesn't do C#/.Net (since about 4 years ago), StackOverflow is kindof a chore. I mainly do it because I know answering stuff is a good way to learn.\n\nI put ignore tags on the TONS of stuff that's not at all in my scope (.net/C#, etc), throw in some interesting tags, and take a look at the \"Interesting\" page...\n\nAll of my interesting tags are at the bottom of 50+ results, with one or two in the middle maybe.\n\nWhatever, I'll just stick with the interesting tags then. Answer an easy question...\n\nOh yay, someone voted me up... sneaks a glance at an equally simple C# Q/A... oh look, if I answer something in that language, I can get 10 times the reputation for FREE!\n\nMy ramble has two points:\nOne: http://www.codinghorror.com/blog/2007/04/an-initiate-of-the-bayesian-conspiracy.html\nIf it can filter junk away from me, it can certainly filter treasure towards me... get with your program.\n\nTwo: Splitting StackOverflow would be stupid, but I can definitely understand the motivation behind splitting sites up. I'm in a site that caters to what I want, but I don't feel in on the community of it at all, since I'm in a minority."}, {"author_name": "Corey", "gravatar_hash": "57f033736831a5e374f1ae69cd9d032a", "author_url": null, "date": "Dec 19, 2010", "message": "I, for one, welcome the separation. I see Stack Overflow as, \"I'm in a bind and need technical expertise right away,\" which is exactly what you will get with a near immediate response. \n\nProgrammers.SE is a little different from Stack Overflow in the sense that you can ask questions that don't need immediate response, and the atmosphere of it is a little more social. The questions and answers don't need to be rapid-fire like Stack Overflow's. It invites humor and personal stories, something you can't get on a purely technical Q&amp;A site.\n\nI think the part I like most is that people aren't getting badges and thousands of rep on a -technical- site for posting an xkcd comic in a [subjective] question."}, {"author_name": "Adam", "gravatar_hash": "207958aa5ac1c42448070dbab3f2dd87", "author_url": "http://stackoverflow.com/users/284685/adam", "date": "Dec 19, 2010", "message": "I think Programmers.SE is fine as its own site. The questions on it would not be good questions for SO. However, I wish you could share rep between the two sites. A good user of one of the sites tends to be a good user of the other. I realize this is a special case within SE, where the sites are different but the community of users is nearly the same."}, {"author_name": "John S.", "gravatar_hash": "8b6794beba00d820d31ea6ce9be9236b", "author_url": null, "date": "Dec 19, 2010", "message": "Corey says:\n\"I think the part I like most is that people aren’t getting badges and thousands of rep on a -technical- site for posting an xkcd comic in a [subjective] question.\"\n\n++++"}, {"author_name": "Shog9", "gravatar_hash": "4f0af2dc52e6ff228e4d69f7e1e8aa5a", "author_url": null, "date": "Dec 19, 2010", "message": "I think it's worth remembering, at least when lamenting the \"splitting\" of Stack Overflow, that Programmers.SE was originally proposed to house the questions that were NOT welcome on SO itself...\n\nWhen SO was young, VERY young, a few months old and only a few thousand members young, questions on topics like \"career advice\", \"language flaws\" and \"favorite breakfast cereals\" were seen as somewhat tolerable: they weren't necessarily a good fit, but there weren't that many of them either, so... Meh.\n\nAs the site grew, they developed into a bit of a cancer. Some were allowed, some weren't, many ended up stuck in bitter close wars... Compromise solutions like Community Wiki and [subjective] tagging were tried and toppled... And the longer it drew on, the more confusing it became to new users, who saw scores then hundreds of questions like their own already on the site as they were shut down.\n\nDon't ask me *why* so many people are determined to make these questions a part of SO/SE - there must be thousands of sites already on the 'Net better suited for sharing programmer war-stories and fighting holy wars... Sites that aren't shackled with the SE notions of reputation and minimal discussion. But... I can't deny that such questions are often engaging and... *fun*.\n\nAnd that, if nothing else, is reason enough for Programmers to exist. Even if the hopes and plans for something more than \"watercooler nonsense\" never fully materialize, the site provides a much-needed outlet for questions that have never and will never be fully accepted on SO-proper, stripped of the pointless bickering about how much subjectivity is \"too subjective\". \n\nBest of luck to all involved..."}, {"author_name": "Shog9", "gravatar_hash": "4f0af2dc52e6ff228e4d69f7e1e8aa5a", "author_url": null, "date": "Dec 19, 2010", "message": "Adam wrote:\n&gt; A good user of one of the sites tends to be a good user of the other.\n\nI heartily disagree with this. While there are most certainly SO users who've thrived in both the technical and \"softer\" questions, there are plenty of folks who have no interest in one or the other; indeed, P.SE has already succeeded in attracting a fair number of users who had little or no SE presence prior to its establishment. \n\nMore importantly though, voting patterns tend to be entirely different between technical and non-technical questions: one of the big complains about [subjective] questions on SO has always been the ease by which one can accumulate reputation merely by sounding good / wallowing in controversy / quoting liberally from Joel on Software... and Programmers is no different. \n\nAnd I rather suspect you wouldn't want someone who garnered a large amount of reputation on P.SE by answering [vb]-bashing questions to then sidle over to SO for some [vb] tag-wiki editing..."}, {"author_name": "Josh Einstein", "gravatar_hash": "8f5dc1cfbfb55f306a3ae937bb3d8b84", "author_url": "http://josheinstein.com", "date": "Dec 20, 2010", "message": "Once again, Jeff is right and everyone else is wrong. And if you don't like it \"Well, then hang out on Facebook (or, Yahoo Answers) and never leave.\"\n\nThere's a lot of arrogance here. The idea that you (and Joel) created Stack Overflow by your heavenly hand with a destiny to succeed ignores the fact that the reason your site tops Google results is strictly because of the content your users generated. Just blowing off their concerns with such advice as 'go away' or 'fine don't tell people about the site, they'll find it anyway' is offensive to someone who has put an ass ton of hours into generating content for you."}, {"author_name": "Shoban", "gravatar_hash": "cefea7db59f677c668a74699e49c1934", "author_url": "http://www.codegeeks.net", "date": "Dec 20, 2010", "message": "+1 for Josh Einstein... 32 Comments(including Jeff's) and almost 20 people who don't like the split up. now this is what \\Community\\ wants. Anyway since this site is up I think there is little the community can do now. I also dont prefer visint both these sites.. I am happy with SO"}, {"author_name": "Shog9", "gravatar_hash": "4f0af2dc52e6ff228e4d69f7e1e8aa5a", "author_url": null, "date": "Dec 20, 2010", "message": "@Shoban: then stay on SO! It's not going away... I'd wager the majority of Stack Overflow users have NO good reason to ever visit Programmers. The last thing either site needs is people asking perfectly good programming questions on a site explicitly created for non-programming questions.\n\nBut if you do get the urge to ask (or answer...) a question that ISN'T strictly programming-related, now you have a place to do so."}, {"author_name": "Corey", "gravatar_hash": "57f033736831a5e374f1ae69cd9d032a", "author_url": null, "date": "Dec 20, 2010", "message": "@Shoban: 20 people do not a community make. \n\nI would wager that out of the hundreds of thousands of users on SO/P.SE, the vast majority of them simply don't care. They'll use one or the other, or both. I'm sure that many of the users on SO don't even know what the hell a Stack Exchange is -- I believe something like 88% of their traffic comes directly from Google."}, {"author_name": "Shoban", "gravatar_hash": "cefea7db59f677c668a74699e49c1934", "author_url": "http://www.codegeeks.net", "date": "Dec 20, 2010", "message": "@shog9\nYeah I am happy with SO but I might miss few good questions which may be posted in pragrammers site.\n\n@corey\nEverything depends on samples ;-) I was just pointing to the sample we have here. Yeah true 80% or more comes from Google but like someone commented the content was added by the community."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Dec 20, 2010", "message": "@Shoban: I wouldn't bet cash monies on it, but even if you do, that's a risk you run on SO itself. The sheer VOLUME of questions being posted now-a-days is enough to remove any realistic hope of seeing EVERYTHING.\n\nWhich is another good reason to formally separate the stuff that isn't really on-topic..."}, {"author_name": "bit", "gravatar_hash": "bf98593dad36ad5bea45420ccc121e46", "author_url": null, "date": "Dec 31, 2010", "message": "When I first found Programmers.se I too had a hard time seeing the need for two. However, use it for a bit and the divide becomes VERY clear. It's like saying designing and coding are the same skill set. Yah, there is overlap but you don't give either justice if you muddy the waters by saying they are the same.\n\nSorry guys, on this one Jeff IS right and everyone else IS wrong. You are going to miss out if you get all pissy and don't visit because you didn't like the idea of it."}, {"author_name": "PaulG", "gravatar_hash": "72cccd80601236495e6accf66eac3689", "author_url": null, "date": "Jan 14, 2011", "message": "If I was being cynical I would suggest that the revenue being generated from users could be boosted by segregating the site, so that users visit multiple sites (different ads, more page views).\n\nAfter all, you need us users to keep giving you free content so that you can generate profit from us.\n\nBut that would just be my cynical head.\n\nYep, I've been against this split since the beta. There are a lot of Q&amp;A's on the other site that I'd be interested in, but there are only so many hours in a day."}, {"author_name": "Ryan W", "gravatar_hash": "f81281c11185cb99e7b782c17677373c", "author_url": null, "date": "Feb 07, 2011", "message": "I got my first introduction to the programmers site today when a question I asked on SO, that you had closed (despite its now 15 upvotes), was finally re-opened and then yanked to the programmers SE.  Let me say I'm firmly in the \"no need for a separate site\" camp.  The audience/community is the same for both and it only serves to confuse those that come through every now and again.  Plus, in my case, they migrated the question before it even had much of a chance to get answers which could very well have code."}, {"author_name": "Radim Cernej", "gravatar_hash": "278dab29c8f56dc70e0bf513aa17c1f6", "author_url": null, "date": "Feb 27, 2011", "message": "Borrowing from Ryan W: Let me say I’m firmly in the “no need for a separate site” camp. There are too many sites now: stackoverflow, programmers, serverfault, superuser - some questions could belong to any of these.  Furthermore, there are tags.\n\nMy recommendation: Merge Programmers into SO and improve the search engine so that one can more easily narrow-down one's searches."}, {"author_name": "Webveloper", "gravatar_hash": "375984fc07390ba89503e4451481d153", "author_url": null, "date": "Aug 10, 2011", "message": "So... the one with \"flow\" in the name is NOT the one related to flowcharts and whiteboards?  And the one with \"program\" in the name is NOT the one about code?  Got it.  And instead of one perfectly good site, I now have to search two?  Great.  And no privileges earned on the first have carried over to the second?  Encouraging.  And this is all good news?  Yes.  You didn't happen to hire anyone who worked on Google Instant, did you?  You know, someone capable of making a great site shoot itself in the foot?"}, {"author_name": "SSteve", "gravatar_hash": "66bc542765c1079e1dfb89dcf3b5348c", "author_url": "http://theuniversalsteve.com", "date": "Aug 23, 2011", "message": "I'm just starting to get into SO. I've been using it daily for the past month+ and have learned a lot by answering questions for others. Then I ran across Programmers. My initial reaction was that this is an unnecessary split from SO. But I decided to keep an open mind. \n\nToday I had a question about Git. I figured this would be a perfect question for Programmers, right? I'm not in front of my compiler or editor and there's no source code involved. This isn't a question about coding, it's a higher-level question about software development. \n\nSo I ask my question on Programmers (http://programmers.stackexchange.com/questions/103171). And what happens? It gets moved to SO.\n\nNow I'm thinking my initial reaction was right. The split between the two seems rather artificial and unnecessary. I can see splitting off SuperUser and ServerFault, but the SO/Programmers split doesn't make sense to me. I guess it's way too late to merge them back together, but I don't imagine I'll be visiting Programmers again in the foreseeable future."}, {"author_name": "Travis Dtfsu Crum", "gravatar_hash": "312f1a262d02730f008b366a396e2cac", "author_url": null, "date": "Oct 08, 2012", "message": "I think I understand the difference, but then this would just draw away from both stackoverflow and superuser, At least with how I understand it. I see the differences between both, but then if these minor details are what separates the two, then the rules really do need to be \"hard and fast\" as they described it"}, {"author_name": "Joe", "gravatar_hash": "7e4ba819afcc2b556847bf7e2dbed272", "author_url": null, "date": "Oct 28, 2012", "message": "Given this long discussion, it seems that the decision to split the sites, driven by Jeff's aversion to subjective questions, is itself subjective.\n\nI'm guessing that the site divide is the reason that the following incredibly useful question, found via Google, was not only closed, but locked:\nhttp://stackoverflow.com/questions/35837/what-is-the-difference-between-mercurial-and-git\n\n(I say 'guess' because I can't completely figure out the rationale for whether a question belongs on SO or programmers, other than, presumably, subjectivity?)\n\nLocking such a question is toxic: it prevents answers from being edited/commented in the future. Things change, and in time, the best answer can become incorrect without edits. If you have separate sites for 'subjective' questions, perhaps it would be better to migrate such questions rather than closing and locking them.\n\nAnd there *is* such a thing as a correct answer to a subjective question: it's the one that best sticks to the facts and, if there's a debate, mentions both sides with NPOV. See Wikipedia. Many subjective SO questions have actually been answered in this way."}]}