{"response": [{"author_name": "Steve", "gravatar_hash": "e24f82e7d3db571b680837784ccc3377", "author_url": "http://stevedower.id.au/", "date": "Dec 22, 2010", "message": "What would be interesting is how many AI experts never heard about the site compared to those who did and decided it wasn't for them. I certainly hadn't heard about it until the first day of the public beta.\n\nIt's also a very niche field. Even if every single expert in the world got on board, there'd be more visits to Stack Overflow PER-DAY. To make things worse, there are a huge range of sub-fields (\"cliques\" is not actually a bad word for them), with separate \"experts\" and many declaring that they are unique compared to all the rest.\n\nI guess the real question to ask is how is the clone (http://metaoptimize.com/qa/) surviving?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 22, 2010", "message": "well, based on the description of metaoptimize:\n\n> machine learning and natural language processing, predictive analytics and business intelligence, (especially for large data sets) by Joseph Turian and colleagues\n\nI'd say that even on *that* site, AI is a niche.\n\nhttp://stats.stackexchange.com is actually what that site overlaps with most, and it's doing fine with 3x the number of questions, etc."}, {"author_name": "Joe", "gravatar_hash": "35b5e9e9ccf3bfe5ff8d22b64a5234d3", "author_url": null, "date": "Dec 22, 2010", "message": "I still can't figure out what AI was defined as. Was that ever decided? Some argued that ML shouldn't be allowed or stats shouldn't be allowed. What a mess."}, {"author_name": "Fishtoaster", "gravatar_hash": "7011e600de4f055b5657e4d8a77894c9", "author_url": "http://kevinkuchta.com", "date": "Dec 23, 2010", "message": "I'll admit, I was one of the pedestrian committers, and you  hit the nail on the head.  I saw \"AI\", thought \"Oh, I took a couple courses on that in college- I'll commit, as I'd like to see there be a forum for that sort of thing\", despite the fact that I'm not really able to make serious contributions to it."}, {"author_name": "Chris", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.shrinkrays.net", "date": "Dec 23, 2010", "message": "I've just finished a degree course on AI so was looking forward to asking GA and neural network related questions on it, so it closing is a bit of a dissapointment. Having said that I haven't checked the site for a week.\n\nThe problem is the cstheory site is a clone of mathoverflow but for masters/PHD students, there doesn't seem to be a midway site. There's only a handful of sites out there for AI - maybe with a bit of advertising for the site it could pick up with another try?"}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Dec 23, 2010", "message": "I've never been entirely convinced by the StackExchange strategy of dividing everything up into completely separate sites because these kind of topics have a big overlap with other sites in the network (in the case of AI, it didn't really cover anything that would have been considered off-topic for the AI tag on StackOverflow).\n\nHaving said that, as somebody who committed to the AI proposal, encouraged other people to, and started to contribute to it, I was a bit disappointed that the plug was pulled so soon.  Yes it was a slow start, but I think it might have been worth letting it run a little while longer to see whether it could have attracted more interest with a bit of promotion.  12 days is nothing."}, {"author_name": "moberley", "gravatar_hash": "297c8649d7bf3722b331469315dcc665", "author_url": null, "date": "Dec 23, 2010", "message": "I hope that any ageing criteria will take into account the proposals that are drawing large numbers of new users to the network. For example, the Libraries proposal had a lot of people sign-up early but has since levelled off (in fact I think some individuals have already uncommitted) trying to attract users with higher reputation on the network.\n\nSince that proposal is based on a StackExchange 1.0 antecedent, I did try to encourage users from that site to join some of the existing sites. Unfortunately, I only recently began participating there and don't think my appeal was particularly effective."}, {"author_name": "Robert Cartaino", "gravatar_hash": "9dfd656461a1d0a2db33f3ed4183f4c0", "author_url": "http://stackoverflow.com/users/98786/robert-cartaino", "date": "Dec 23, 2010", "message": "@Dan: \n\n&gt; ... I think it might have been worth letting it run a little while longer ...\n\nI would be inclined to agree with you if it was simply a matter of getting off to a slow start: Generally we allow for  <a href=\"http://blog.stackoverflow.com/2010/10/when-will-my-site-graduate/\" rel=\"nofollow\">it takes as long as it takes</a>. But the AI proposal was the perfect storm of low participation <i>and</i> poor content. It was simply felt that AI had quickly slipped into an unrecoverable, downward spiral. \n\nBut — I say this to everyone — when a proposal is closed or a site is closed down, users are always welcome to try again... but they should have good reason to believe they have the resources to launch it to a much stronger start than the first time around."}, {"author_name": "Mike S", "gravatar_hash": "e22f1ef6287286a3893ace3d023c8550", "author_url": "http://mikesearcy.com", "date": "Dec 23, 2010", "message": "\"Top blogs, best books, buying recommendations: those are not the hallmarks of expertise. \"\n\nTrue.. But these are still very important things! You (Jeff) should know, after-all isn't that how coding horror got it's start? I suggest that these types of things be left off of the page, but that they should still have some area where people can find this information.  As a matter of fact I think each members profile could have an optional area, where they can post their favorite blog, book, tools, or products (ide for SO and other tools like cookware for a cooking flavor of SE for example).  People could post reviews (+ or -) and rankings for things and the \"dashboard\" view of these preferences could be shown with some type of sorting that would incorporate things like expertise (SE rep), or date since modified, and recent trends (like a new book gaining momentum for example).  \n\nThis would be a great place for the curious and aspiring visitor to find solid mentor-level resources, while keeping the main part of the site for real questions."}, {"author_name": "Rong W", "gravatar_hash": "46520d686bf3a8d42e2e43cc5d0f44e1", "author_url": null, "date": "Dec 24, 2010", "message": "Practitioners do not like the word \"Artificial Intelligence\". It has become a taboo word.\n\nIf the majority of practitioners in a particular field are sensitive to some kind of taboo (or mingling of concepts), then it shouldn't be surprising that a site gets sidelined because it broke that taboo.\n\nTo help understand the conflict, I give an example of something that practitioners will frown upon: Imagine a short introduction video that describes a machine learning scientist as someone who gives toasters and televisions the ability to think. (That video example came from a huge multi-national corporation, not SE.) Why the negative reaction? The video tries to equate smart appliances with machine learning; whereas smart appliances is considered the low-hanging fruit in the field of machine learning.\n\nLet's take a look at metaoptimize QA: \n\n&gt; machine learning, natural language processing, artificial intelligence, text analysis, information retrieval, search, data mining, statistical modeling, and data visualization, as well as adjacent topics.\n\nPractitioners will agree that the site's objectives are clear and appropriate.\n\nLet's look at Jeff's response:\n\n&gt; I’d say that even on *that* site, AI is a niche. http://stats.stackexchange.com is actually what that site overlaps with most, and it’s doing fine with 3x the number of questions, etc.\n\nThis response mingled two concepts, broke one taboo, and was closed with a tone of arrogance.\n\nTo summarize: machine learning is an endangered species. It requires the community cultivators to be experts themselves."}, {"author_name": "Dn_Ab", "gravatar_hash": "a2f44252e1aaae34c548789ec3684a1b", "author_url": null, "date": "Dec 25, 2010", "message": "Wait. So you decide alone to close and no appeals? That doesn't seem like a very good model. \n\nI also agree with Rong above. metaoptimize is much more useful from a machine learning erm AI perspective than stats exchange."}, {"author_name": "Rong W", "gravatar_hash": "46520d686bf3a8d42e2e43cc5d0f44e1", "author_url": null, "date": "Dec 25, 2010", "message": "(I would like to apologize to Jeff Atwood regarding my comment on his attitude. I recognize that he is merely quoting a comparison on site traffic, something which I had mis-interpreted and taken personally.)\n\n(That said, a comparison on traffic volume of two sites does not make the two sites equivalent, and does not imply that one can be a total substitute of another. This is from the point of view of the users. On the business side, things like server software stack and business models are surely interchangable.)"}]}