{"response": [{"author_name": "grega_g", "gravatar_hash": "49de45ee082f76270296eb529ba156f9", "author_url": null, "date": "Dec 13, 2010", "message": "If I click OData on any page I get yellow screen of death. It helpfully suggests to change customErrors in web.config. I 2nd that. :D"}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Dec 13, 2010", "message": "@greg\n\nI removed odata for the time being, we will add it back soon"}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://coderjournal.com", "date": "Dec 13, 2010", "message": "Is there still a list of OData references.  I loved the ability to use LINQPad to browse your data.\n\nhttp://coderjournal.com/2010/06/using-linqpad-to-query-stack-overflow/"}, {"author_name": "Tshepang Lekhonkhobe", "gravatar_hash": "88e60659e997d36af3ff348b3251e1a6", "author_url": "http://tshepang.tumblr.com", "date": "Dec 13, 2010", "message": "Thanks for taking the pain to give such a full explanation. I love this openness."}, {"author_name": "Steven Livingstone", "gravatar_hash": "b0aa6cf00f2999f50523587300f90390", "author_url": "http://livz.org", "date": "Dec 13, 2010", "message": "You can avoid the 30 mins deployment time by RDPing to the server. Course you folks never had that at your decision to move time.\n\nShame because knowing some startup folks who are on a self managed model (the way i always did things), and having done lots on Azure myself, i'd now *always* take the Azure route.\n\nStill, when you're doing as well as you folks and running a top product on an evolving platform you don't have the time to wait."}, {"author_name": "Bill Karwin", "gravatar_hash": "05845ddff9dbf10e3d47edce7032bae7", "author_url": "http://karwin.blogspot.com", "date": "Dec 13, 2010", "message": "Yes, thanks for the nice explanation.\n\nI guess PAAS makes most sense if your bottleneck is the time to provision new instances in a server farm, and tuning of any given server doesn't matter that much.\n\nAzure might be a legitimate scale-out solution, but StackExchange uses an architecture that benefits more on a scale-up solution.  That is, fewer servers, with greater optimization and tuning."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.systempuntoout.com", "date": "Dec 13, 2010", "message": "Thanks for sharing your experience.\n \nTo be fair, the Google App Engine link is a little bit outdated (october 2008)."}, {"author_name": "Russ", "gravatar_hash": "fb8f14461d037d601087c32f9fa9fea5", "author_url": "http://tinisles.com", "date": "Dec 13, 2010", "message": "My understanding is that SQL azure can be an odata provider.. Were u using this feature of SQL azure? If so - how will you be doing odata now?"}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Dec 13, 2010", "message": "@Nick, it will probably be back - was giving me YSODs, if you feel like submitting a patch that brings it back to life I would be more than happy to pull it in. \n\n@Russ, we tried it but it was crippled in so many ways, we just ended up writing our own."}, {"author_name": "Karl", "gravatar_hash": "144a08cebe2b14854717bbad9010992f", "author_url": "http://www.openmymind.net/", "date": "Dec 13, 2010", "message": "I think this is a great post, except for the part where you sweep every other provider along for the ride\n. Have you used Heroku? I'll agree that you'll end up with some tradeoff, but nothing remotely in the same multiverse as what you guys seem to have run into with Azure."}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Dec 13, 2010", "message": "@Karl \n\nI agree that Heroku is much more polished and flexible than Azure, but at the end of the day you do not have access to the bare metal or even the OS. You give up a certain level of control. By-design. You are giving up more control then you are with say engine yard or amazon ec2.  \n\nI agree it is a bit unfair to put Heroku in the same ball park as Azure, Heroku is a much more polished product and probably the best PAAS example out there. \n\nNonetheless, there is no arguing that http://www.engineyard.com/products/appcloud/pricing is more flexible."}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Dec 14, 2010", "message": "@Karl,\n\nTo expand on the Heroku limitations. Say I want to run full-text, I am stuck running solr or ferret. Eventually they will probably add sphinx support, but say I want some cutting edge feature in sphinx or solr, its very unlikely that will be there as it will at best be on the latest stable release. \n\nTake file uploads, every connection to the rails app consumes a dyno, if I want to track huge downloads or add ACLs to them using x-sendfile, well no dice. I have no control over the Apache or nginx server running this whole kaboodle. \n\nTake node.js ... sure there is experimental support, embedding node in a Rails app takes some hairy nginx proxy rules, unlikely you will easily have access. Also unlikely you will be allowed to run bleeding edge stuff. \n\nSure for trivial and straight forward apps this works, stray from the path and you will hit lots of road blocks."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Dec 14, 2010", "message": "@Sam, why would you have the expectation of being able to run bleeding edge stuff on Heroku at all? That's not the value proposition a managed platform offers. The whole point is that it makes deploying your application to a production environment easier by removing most of the fiddly configuration. If you are able to embrace the limitations then you get the easy ride.\n\nIf you need control down to the nth degree then of course you're going to run your own servers, which is what this post is about."}, {"author_name": "Brian Lambert", "gravatar_hash": "9f6167ea532e5ce23721fc47ef39bc74", "author_url": null, "date": "Dec 14, 2010", "message": "I think it’s interesting that you say:\n\nAt Stack Overflow we take pride in our servers. We spend weeks tweaking our hardware and software to ensure we get the best performance and in turn you, the end user, get the most awesome experience.\n\nYou’re missing the whole point of the Cloud and PaaS. Tweaking servers is something hobbyists do. If you’re running a service at Internet scale, who has time to “Tweak the servers” every day?\n\nI would love to hear more about the hardware that you moved to. How many servers / cores?"}, {"author_name": "Trufa", "gravatar_hash": "b685494fc3e6341655360971b1178e0d", "author_url": null, "date": "Dec 14, 2010", "message": "This is fantastic! absolutely. Jeff said on the interview on hansel minutes that (we) developers love the option tab in our software, that he was sold the first time he tried that on chrome... well im sold now."}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Dec 14, 2010", "message": "@John\n\nRe: @Sam, why would you have the expectation of being able to run bleeding edge stuff on Heroku at all?\n\nI don't have any of those expectation, I was just illustrating ways in which Heroku is restricted, by-design. It's a great fit for some projects, not a great fit for others"}, {"author_name": "Craig", "gravatar_hash": "a57213474d99e1a4f59d73ec074c3f88", "author_url": null, "date": "Dec 15, 2010", "message": "Brian, I tend to agree with you. When StackOverflow has 100 servers will they still be tweaking? They will have more sysadmins than developers!"}, {"author_name": "Eric", "gravatar_hash": "5b748cdecf93d60a192b98695b340046", "author_url": null, "date": "Dec 17, 2010", "message": "\"When StackOverflow has 100 servers will they still be tweaking? They will have more sysadmins than developers!\" are you from the moon? Check out numbers first. 2 servers, 3 if they will expand to many services.\n\n\"You’re missing the whole point of the Cloud and PaaS. Tweaking servers is something hobbyists do. If you’re running a service at Internet scale, who has time to “Tweak the servers” every day?\" BigTable is FAST, working with google or their services might be a good thing to think about. \n\n\"Did I mention we are control freaks?\" That's why and nothing else. For stackoverfloew's scale they could save few thousand dollars on saving themselves from buying servers."}, {"author_name": "Greg", "gravatar_hash": "b0d98734d95fa6d3fed729b2a919855d", "author_url": "http://askubuntu.com", "date": "Dec 17, 2010", "message": "Visiting http://data.stackexchange.com/ tells me \"Couldn't find data.stackexchange.com The Q&amp;A site data.stackexchange.com doesn't seem to exist…yet.\""}, {"author_name": "Paul", "gravatar_hash": "4090c46d8ef320d1579f69ab0424a4ba", "author_url": null, "date": "Dec 27, 2010", "message": "One reason for adopting a cloud/PAAS deployment approach is to have options in the event that your app goes viral. If StackOverflow experiences a spike in site-usage overnight, in exponential orders of magnitude , they would definitely rethink their anti-cloud policy ."}, {"author_name": "peter", "gravatar_hash": "08246082c92c89bb256bf463b32bdc92", "author_url": null, "date": "Dec 29, 2010", "message": "The link to Aral's criticisms of app engine is way out of date.  Many of the things he complains about are no longer issues.  (of course they weren't necessarily issues at all for some apps)"}, {"author_name": "Steve", "gravatar_hash": "d5001dcbd6c54595ade7860bd2d55750", "author_url": null, "date": "Jan 10, 2011", "message": "What's up with the OData feed. When will it be back online?"}]}