{"response": [{"author_name": "Rubens Mariuzzo", "gravatar_hash": "c1201849caa3693e9b41824351c9dc3d", "author_url": "http://mariuzzo.com/", "date": "Dec 02, 2010", "message": "Democratic elections are good. It make you different."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Dec 02, 2010", "message": "I'm assuming that the moderators Pro Tempore must also nominate themselves, seeing as how they were temporarily appointed?\n\nNot to put too fine a point on it, but at least one mod on one of the SE sites I use seems to have made... questionable decisions with their mod powers, and the sooner we can vote them out of office, the better."}, {"author_name": "Joshua Frank", "gravatar_hash": "beba73a336e49804c2e11c8621202d00", "author_url": "http://www.archimetrics.com", "date": "Dec 02, 2010", "message": "When you say \"All votes are private...[then] the election data file will be freely and permanently downloadable by anyone\", that suggests to me that people's votes will be public too, which is surely a very bad idea, since we wouldn't want the winning moderators to know who hadn't voted for them.  And if people even **think** that their votes will be public, it might have a discouraging effect on voter turnout."}, {"author_name": "mmyers", "gravatar_hash": "49f3a2065659f5b4efa05ae29bd0856a", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Dec 02, 2010", "message": "@Joshua Frank:\n\nThe election data file has the vote totals for all the candidates, but there is no identification of who voted for whom.\n\nSee the file from the last Stack Overflow election:\nhttp://blog.stackoverflow.com/2010/02/stack-overflow-2010-moderator-election-results/"}, {"author_name": "Joshua Frank", "gravatar_hash": "beba73a336e49804c2e11c8621202d00", "author_url": "http://www.archimetrics.com", "date": "Dec 02, 2010", "message": "Okay, whew, that makes sense.  Thanks.  Perhaps the post should be edited a bit to clarify this for anyone else who might get the same wrong impression."}, {"author_name": "Michael Mrozek", "gravatar_hash": "dd7e03fbbfcabd4675844173ec5390d2", "author_url": "http://mrozekma.com", "date": "Dec 02, 2010", "message": "@R.Bemrose You might want to bring that up on the site's meta, if you haven't already; you don't have to wait till elections roll around"}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": "http://careers.stackoverflow.com/kyle", "date": "Dec 02, 2010", "message": "What happens if there are 10 or fewer self-nominations, does it go directly to the election phase? What about 3 or fewer? Are the volunteers automatically made mods?"}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Dec 02, 2010", "message": "I find it strange that people can only nominate themselves.  Why can't I nominate Jon Skeet for every site he's ever visited? &gt;:/"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 02, 2010", "message": "> I find it strange that people can only nominate themselves. Why can’t I nominate Jon Skeet for every site he’s ever visited? >:/\n\nI think you just answered your own question :)"}, {"author_name": "Ian Ringrose", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Dec 03, 2010", "message": "Why have the Primary stage?  I don't see what it gains as STV can cope with letting the voter put all canidates in order of perference.\n\nI could see the value if the \\commenting\\ phace was restarted after the primary stage to allow people to investigate the leading canidates."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Dec 03, 2010", "message": "R. Bemrose,\nI think \"nominate themselves\" should probably really be \"volunteer.\"  Several people (including Jon Skeet) opted out when nominated in the first moderator election.\n\nJoshua Frank,\n&gt; since we wouldn’t want the winning moderators to know who hadn’t voted for them.\n\nThat's probably going to be so many people that it wouldn't be worth remembering.  Hopefully the people with the most votes are the kind of people who don't hold a grudge anyway.  Hint, hint...  ;)"}, {"author_name": "Jeff O'Neill", "gravatar_hash": "13451d2fb1dcbc64ad4e8bd0d0bf40d4", "author_url": "http://www.openstv.org", "date": "Dec 05, 2010", "message": "@Ian, I think there is value in having a primary phase to limit the pool to ten candidates.  When there are too many candidates, it is difficult for voters to be able to evaluate them all.  I don't have time to consider the relative merits of 100 candidates.\n\nI do think, however, that voters should be able to rank 10 candidates instead of just three.  This helps ensure that everyone's vote goes toward an eventual winner."}, {"author_name": "matt wilkie", "gravatar_hash": "875b592087c435ab4a8d533cda9b69c1", "author_url": "http://www.maphew.com", "date": "Jan 11, 2011", "message": "I second the term \"volunteer\" instead of \"nominate\" for phase 1.\n\nI also think people should be able to rank all 10 candidates, or at least the top five. Sooner or later a moderator or two will bow out or become inactive and it would be good to have a solid list of next-in-line.\n\nHow long is the term of office? (when is the next election?)"}, {"author_name": "Neal McBurnett", "gravatar_hash": "f9a6dbf7c76bfc2ddb25b951af35ea38", "author_url": "http://neal.mcburnett.org/", "date": "Feb 04, 2011", "message": "Jeff O'Neill is right, along with matt - we should be able to rank more than 3, or else our choices might not count (the well-known problem of \"ballot exhaustion\").  (And it looks like Jeff should know.  If you check out the OpenSTV software that is being used to tally these elections, you'll see \"Copyright 2003-2009 Jeffrey O'Neill\"....)\n\nCan you add at least a few more rankings?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 04, 2011", "message": "@neal it's not *that* common for elections to have the full slate of 10 candidates, though."}, {"author_name": "Fohsap", "gravatar_hash": "b9097cd6b8c2ebb313fbcb899087b7d6", "author_url": null, "date": "Jun 26, 2011", "message": "Down with Jeff, the dirty politician.  Down with Jeff.  Oust the villain."}, {"author_name": "John vermont", "gravatar_hash": "ac7b231c7ad5ef4da59d84cde36a90e3", "author_url": null, "date": "Apr 14, 2012", "message": "It seems as a system that favors elections only among the established users since once having opted in as a candidate he will be ranked by reputation this leads to subgroup of about 100 people of less that can nominate themselves. Not really democracy as advertised."}]}