{"response": [{"author_name": "Jon Galloway", "gravatar_hash": "1c494896dd56e0e27253156c28f1dfb9", "author_url": "http://weblogs.asp.net/jgalloway", "date": "Dec 24, 2010", "message": "When you donate to WikiMedia, the Jimmy Wales banner smiles just a little more."}, {"author_name": "Beth", "gravatar_hash": "0bbbb27615b7e5a0e722d609b07f7e13", "author_url": "http://www.bethmassi.com", "date": "Dec 24, 2010", "message": "Merry Christmas, Jeff!"}, {"author_name": "Nitish", "gravatar_hash": "2ff62ce4120fba75903decc672dcd88b", "author_url": null, "date": "Dec 25, 2010", "message": "Awesome! Keep it up!"}, {"author_name": "Rolf", "gravatar_hash": "1c13eac0931a8095e04bcfeaaed371e8", "author_url": "http://www.rolfje.com", "date": "Dec 25, 2010", "message": "Thanks for building stackoverflow, and thanks for giving back to the communities you mentioned. Stellar.\n\nI'm a firm believer that Google only works when the internet is filled with information. For me, Stackoverflow is a major contributor to what makes Google work.\n\nEnjoy the hollidays with all your friends, near or far. All the best,\nRolf (1713 rep, and counting ;-)"}, {"author_name": "Mehdi Mousavi", "gravatar_hash": "160955b49537a6550a357e77e9682166", "author_url": "http://blog.mehdi.biz", "date": "Dec 25, 2010", "message": "Well done Jeff! Keep up the good work :)"}, {"author_name": "Stefan Plattner", "gravatar_hash": "7847006dbf49f1722b07c8da396f1275", "author_url": "https://twitter.com/splattne", "date": "Dec 25, 2010", "message": "Thank you! I think this is a great way to honor our modest work (actually it's more fun than work)."}, {"author_name": "ram", "gravatar_hash": "5b1914eacb91d0cf219a6f615f63c5b2", "author_url": "http://rd1089.wordpress.com/", "date": "Dec 25, 2010", "message": "Keep up the good work!"}, {"author_name": "UncleZeiv", "gravatar_hash": "bd24dab59beada36b501670cd01b8e2c", "author_url": "http://unclezeiv.kerid.org", "date": "Dec 25, 2010", "message": "You guys are awesome! I really like this \"give back\" things you do.\n\nWhat you managed to accomplish in 2010 is just unbelievable, I'm really looking forward your next steps."}, {"author_name": "Buggabill", "gravatar_hash": "722117a5bb31bd02bc3bc369ab194fd5", "author_url": null, "date": "Dec 25, 2010", "message": "Thank you guys so much for the work that you have done on the SE sites. They make my life easier. I am looking forward to 2011!"}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.systempuntoout.com", "date": "Dec 25, 2010", "message": "Thank you guys for all, really; your project is simply awesome http://tinyurl.com/2vcx7jg. Stack Overflow is the perfect place to learn with just one minor flaw: too addictive! Greetings from Italy."}, {"author_name": "samil", "gravatar_hash": "462cf304e4a8d50f7796cfbc40524690", "author_url": "http://samilkorkmaz.blogspot.com/", "date": "Dec 25, 2010", "message": "I salute you. I will use your list as inspiration for my own donations."}, {"author_name": "Trufa", "gravatar_hash": "b685494fc3e6341655360971b1178e0d", "author_url": "http://stackoverflow.com/users/463065/akinator", "date": "Dec 25, 2010", "message": "Thank you, It´s been a great ride so far and I guess it´s just starting!! Merry Xmas and a Happy New Year!"}, {"author_name": "Nivas", "gravatar_hash": "eff3175735075d38c6e8f7542c776914", "author_url": null, "date": "Dec 26, 2010", "message": "The StackOverflow initiative has created wonders, with the structure, the fan following and content. And it is awesome that you give back periodically - the ads open source projects initiative, and donations. The Internet is definitely a better place with SO, and I sincerely hope that both you and us - the crowd in SO don't lose focus and make the internet a lot more better place.\nHappy Holidays."}, {"author_name": "Gregory Kohs", "gravatar_hash": "1a3563334291ae1e0fa93f88ee47dc47", "author_url": "http://www.mywikibiz.com/Top_10_Reasons_Not_to_Donate_to_Wikipedia", "date": "Dec 26, 2010", "message": "Amazing that Stack Overflow has 26 moderators who either don't know or don't give a crap that the Wikimedia Foundation spends only 41 cents of every received dollar on the program services that support its mission.  That earns them one star (out of four!) from Charity Navigator on the important measure of organizational efficiency.\n\nMeanwhile kids in Haiti hope for a new school with running water, if they can dodge the cholera before then.\n\nGreat choice, nerds!"}, {"author_name": "Tshepang Lekhonkhobe", "gravatar_hash": "88e60659e997d36af3ff348b3251e1a6", "author_url": "http://tshepang.tumblr.com", "date": "Dec 26, 2010", "message": "I'm curious about the Canonical donation. What tech do they provide that you guys use? Also, isn't Shuttleworth rich enough, such that the money could be used elsewhere?"}, {"author_name": "Shoban", "gravatar_hash": "cefea7db59f677c668a74699e49c1934", "author_url": "http://www.codegeeks.net", "date": "Dec 27, 2010", "message": "Awesome!!!"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jan 01, 2011", "message": "&gt;Tshepang - they use a Linux based load balancer, they are mostly Windows based and so pay a lot more to Bill Gates."}, {"author_name": "Mahesh", "gravatar_hash": "2e9b610808325815733603ce1bef16b8", "author_url": "http://onecore.net", "date": "Jan 01, 2011", "message": "OpenID foundation definitely deserves donation from around the world. It solved issues of registration over multiple sites for me. I'm not facebook connect so have to praise for openid :)"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jan 02, 2011", "message": "@Gregory Kohs you're not mentioning that you have quite a history with Wikipedia: http://en.wikipedia.org/wiki/MyWikiBiz and said Charity Navigator is still giving Wikipedia a 3 out of 4 stars overall. This is surely an interesting topic, but I'd like to see some more neutral opinions on this."}, {"author_name": "Dave", "gravatar_hash": "6fffbf547f0efa568396d6e21631884d", "author_url": null, "date": "Jan 05, 2011", "message": "For 2011, it would be nice to get rid of the \"subjective\" flag on Stackoverflow.com.  Forums are meant to ask a broad range of code questions in a broad range of ways.  Individuals might ask a question even if it appears in 100 other threads because they have their own twist or goal for the question in order to benefit from user replies.\n\nAlso, subjective is in the eye of the beholder.  Why the heck are people flagging posts with the reason of \"general, subjective, etc.\".  If it's not clear enough, then the poster is to modify and add and explain.  Otherwise, if there is enough context and reason for the post \"I want to ping up some experts to help guide me to the right areas of study/resources\", what's the problem with that type of forum thread or even \"Hey how can I improve performance in my code snippet here\".  Anything can be subjective to anyone.  It's lame that StackOverflow even makes that an issue.  One person might think something is subjective and unanswerable and another person might think a question is a great one.  Who cares.  As long as the poster is getting a benefit from the responses that's all that matters.\n\nPeople need to chill on stackoverflow and let people post their freakin questions without people wining (moderators and whistler blowers).\n\nIf someone is being rude that's one thing but to flag so many questions due to \"subjectivity\" is stupid because we may at times not know what we're looking for and the whole point to post subjective is to gain a lot of ideas, even conflictive viewpoints in order to consume that and take it for what it is in order to gain knowledge and learn."}, {"author_name": "Tshepang Lekhonkhobe", "gravatar_hash": "88e60659e997d36af3ff348b3251e1a6", "author_url": "http://tshepang.tumblr.com", "date": "Jan 05, 2011", "message": "@mgb That would only make sense if that load-balancer is developed by Canonical. But like I say, Mark Shuttleworth is rich. Surely there's better places one can donate money to?"}, {"author_name": "Manish Sinha", "gravatar_hash": "ef30eec6f6b215b1b9d37fb9682f537e", "author_url": "http://journal.manishsinha.net", "date": "Dec 08, 2011", "message": "I think that \"Canonical\" should be replaced with \"Ubuntu\". That donation page is for donating to Ubuntu project. It is just Canonical which acts as a medium to receive the donations."}]}