{"response": [{"author_name": "Trond Andersen", "gravatar_hash": "7eaceff9c4cfd81226a94c55345c29f1", "author_url": null, "date": "Dec 20, 2010", "message": "One option I would like to add is a checkbox for \"Only questions with non-accepted answers\".\n\nThis would be valuable if you only receive once a day."}, {"author_name": "4rk", "gravatar_hash": "60fec2454b16f5fd5ec243fa98d71351", "author_url": null, "date": "Dec 20, 2010", "message": "For #2 it seems to me a similar summary on a single webpage could also be useful."}, {"author_name": "Patrick", "gravatar_hash": "c8c37f5eb50ef18fab670a88b9345d29", "author_url": "http://www.cleverhumans.com", "date": "Dec 20, 2010", "message": "For the next feature, adding the ability to answer questions just by replying to the email would be great! (more of a mailing list style interface)"}, {"author_name": "Alexandre Jasmin", "gravatar_hash": "ebb42d2495567b4d80d528b06d5f3097", "author_url": "https://twitter.com/ajasmin", "date": "Dec 20, 2010", "message": "I'm already using an RSS to email service to get updates on a tag on Stackoverflow.\n\nI will try using this new Stackexchange feature instead."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 20, 2010", "message": "@4rk yes, this is already possible by visiting the Tag Set page on SE\n\n@Patrick it's unlikely we will ever implement that"}, {"author_name": "Dan", "gravatar_hash": "c5355f878186f8cc7feade633022683d", "author_url": "http://u2tech.wordpress.com/", "date": "Dec 21, 2010", "message": "Thank you.\n\nAlthough I love using SO in general, it is the niche topics that I have always found the least user-friendly aspect on the site. This solves that problem for me."}, {"author_name": "Marjolein Katsma", "gravatar_hash": "b992344ab8c933cb2fe7d54e97dc42ae", "author_url": "http://marjoleink.photoshelter.com/", "date": "Dec 21, 2010", "message": "I tried three or four different ways to navigate to the 'jquery' tag on stackoverflow - each time I arrive at the same page and each time there is nothing like a 'subscribe' link anywhere.\nhttp://stackoverflow.com/questions/tagged/jquery\n\nI see a feed link at the bottom right, but no 'subscribe by email' link at all. What am I missing?"}, {"author_name": "Alexandre Jasmin", "gravatar_hash": "ebb42d2495567b4d80d528b06d5f3097", "author_url": "https://twitter.com/ajasmin", "date": "Dec 21, 2010", "message": "@Katsma It seems that feature is only accessible from  stackexchange.com\n\nI figured how it works after reading the blog post but it would be nice to have it directly accessible from stackoverflow.com as well."}, {"author_name": "Marjolein Katsma", "gravatar_hash": "b992344ab8c933cb2fe7d54e97dc42ae", "author_url": "http://marjoleink.photoshelter.com/", "date": "Dec 22, 2010", "message": "@Alexandre, thanks. Since this post suggests subscription would be possible for a single tag, I kept clicking through on 'jquery' (which I'm particularly interested in) and ending up on stackoverflow.com - and no subscribe link. Now I found a tag set which also includes a few  related subjects like CSS and HTML but isn't too wide. So I'll try that. :)\n\nBut I still would prefer only jQuery since that is what I'm concentrating on at the moment!"}, {"author_name": "Marjolein Katsma", "gravatar_hash": "b992344ab8c933cb2fe7d54e97dc42ae", "author_url": "http://marjoleink.photoshelter.com/", "date": "Dec 22, 2010", "message": "Oh drat - now I'm trying to log in with my OpenID and it seems the site doesn't understand delegation. Needs a little work then, ;)"}, {"author_name": "Alexandre Jasmin", "gravatar_hash": "ebb42d2495567b4d80d528b06d5f3097", "author_url": "https://twitter.com/ajasmin", "date": "Dec 23, 2010", "message": "@Marjolein You should be able to create your own tagset. I just created a tagset containing only the jquery question on Stackoverflow http://stackexchange.com/tagsets/1299/jquery-on-so\n\nStill a lot of work for getting updates on only one tag. But it works."}, {"author_name": "Nicolas Delsaux", "gravatar_hash": "2f169a510b7cba5a57e86d520b268447", "author_url": "http://riduidel.posterous.com", "date": "Dec 28, 2010", "message": "Oh man, you really should consider creating a Jabber interface (like the excellent StackGuru - http://stackapps.com/questions/345/stackguru-a-near-realtime-bot-for-all-stackexchange-sites - provides), as I consider people interested by this type of interactivity would prefer near-real-time informations.\nBesides, don't you see that kind of feature makes Stack Overflow more and more like the descendant of Usenet ?"}, {"author_name": "Phil Nash", "gravatar_hash": "67437f2e924866ba2c508cb727373474", "author_url": "http://www.levelofindirection.com", "date": "Dec 31, 2010", "message": "As far as I can see tags in tag sets are ORed (A B matches everything tagged A *or* B (or both)).\nIs it possible to define ANDed tag sets? (A &amp; B matches only those things tagged A *and* B)?"}, {"author_name": "Adrian", "gravatar_hash": "aa7bb44b3a19839f95ad068bceda10b4", "author_url": "http://www.orionhealth.com", "date": "Jan 03, 2011", "message": "&gt;We’re thinking of adding a simple one click “subscribe” option on the websites proper to make it easier to subscribe to a tag or set of tags.\n\nYou really should do this. It's a good feature, but it's too obscure to configure. All I want to do is check a box when looking at a tag to say \"email me new questions with this tag\".\n\nInstead I had to find these instructions, go to a different site (stackexchange), create an account there, and create a tag set."}, {"author_name": "calavera", "gravatar_hash": "68a4eaf8b48b10303ca0cc2d6764c5f7", "author_url": null, "date": "Jan 03, 2011", "message": "Hey, that's my tagset!  (*powershell*) \n\n:)"}]}