{"response": [{"author_name": "Sklivvz", "gravatar_hash": "3fd9e5b2c59170ec3d74dde30d233fa4", "author_url": "http://skeptics.stackexchange.com/users/96/sklivvz", "date": "Sep 26, 2012", "message": "WHat has this got to do with Stack Overflow? This is pure marketing spam. :-("}, {"author_name": "Nathan White", "gravatar_hash": "b968b9b19b4c12e18ed3b2a12ec9b82c", "author_url": null, "date": "Sep 26, 2012", "message": "They're sponsoring the event... And it's not 'marketing spam': the whole point of SO is to help programmers, so what better than to show programmers a competition for programmers? Simple, really."}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Sep 26, 2012", "message": "StackExchange can probably run a great peer reviewed app competition!  It's great if Microsoft lets you run one for them.\n\nThe demand side for Win8 apps might be a bit of a problem.  I really do not know anyone with a Win8 machine _and_ a touchscreen."}, {"author_name": "Pierre-Alain Vigeant", "gravatar_hash": "3c4e7c07a17da199c1ebcec55d3dcc35", "author_url": null, "date": "Sep 26, 2012", "message": "I need to know if I can participate. Most of the time in Quebec, Canada, we can't participate due to law (loto-quebec) concerning prizes in cash.\n\nI have trouble understanding the statement of the full rule\n\n    Legal residents of the U.S. will qualify for one Grand Prize, and legal residents of all other eligible countries will qualify for a second Grand Prize."}, {"author_name": "Stefan", "gravatar_hash": "3f1b897ab923ba0f6824e2f3ae948305", "author_url": null, "date": "Sep 26, 2012", "message": "It would be great to have an RSS feed for newly submitted apps."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Sep 26, 2012", "message": "I have trouble understanding that rule as well. Does it mean that US residents can win only one prize, and the rest of the world two? Or that only US residents can win first prize? Why?"}, {"author_name": "Lauren Gundrum", "gravatar_hash": "5114f4806122259270d5da20a3039960", "author_url": null, "date": "Sep 26, 2012", "message": "@Pierre-Alain Vigeant - look at the Rules, Terms, and Conditions for a list of countries/territories that are specifically excluded, and for guidance on following contest laws of your country/territory (http://apptivate.ms/contest#rules-terms-conditions point 1). \n\nTo explain the Grand Prize a little better - There are two Grand Prizes being offered: one for US residents, and one for international Stack Overflow users. All the other prizes are in one prize pool for everyone. The Stack Overflow community will select the top 3 apps in each Group (Knowledge, Games, Interest, Work, and Social), and from those 15 finalists, judges will select one Grand Prize winner (US resident) and one Grand Prize winner (non-US resident). \n\nMicrosoft wanted to divide up the prizes this way, and we are happy that they were able to offer prizes to international users. Hopefully this helps clarify it a little bit."}, {"author_name": "Clay Shannon", "gravatar_hash": "317f4b62da2b0186feac9b6209793505", "author_url": "http://montereyscenics.posterous.com/", "date": "Sep 26, 2012", "message": "What about an app that is tied to a Windows Phone 8 (they will work in tandem). I assume that since the WP8 app will not be ready by 12/6, there's no use submitting the Windows 8 app, either?\n\nThe Windows 8 app could \"work\" with some fake data I could provide, but will be like beans without cornbread (or cornbread without beans) until the companion/complementary WP8 app is released..."}, {"author_name": "uhsarp", "gravatar_hash": "9e8196fdc6e4f1ddac34df73c0a10ef1", "author_url": null, "date": "Sep 26, 2012", "message": "can I write an app that bring back the start button to life for windows 8?"}, {"author_name": "Clay Shannon", "gravatar_hash": "317f4b62da2b0186feac9b6209793505", "author_url": "http://montereyscenics.posterous.com/", "date": "Sep 26, 2012", "message": "uhsarp, the opening screen is one giant start button."}, {"author_name": "Garrett", "gravatar_hash": "643923d5f19a1588d49597d12a404a7d", "author_url": null, "date": "Sep 26, 2012", "message": "cerThose prizes suck!"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Sep 26, 2012", "message": "@Garrett: I know, right? They're all related to either <b>Windows</b> or <b>cash</b>! Who uses <i>those things?!</i>"}, {"author_name": "zzzzBov", "gravatar_hash": "248d820c4cc1b6eb7924c658c45443b5", "author_url": null, "date": "Sep 26, 2012", "message": "What good is winning Windows 8 when you've built an app for Windows 8?"}, {"author_name": "Ladislav Mrnka", "gravatar_hash": "f330cbdca0d0f3ca2328f9bd14d86afb", "author_url": "http://www.ladislavmrnka.com", "date": "Sep 26, 2012", "message": "This is great contest! I really like the idea. \n\nI wonder why Microsoft-metro tag is used for questions in the contest? This tag should be deprecated because even Microsoft is working hard to remove \"Metro\" from any reference materials. The new naming is based around \"Windows Store apps\" instead of \"Metro apps\". Next year half of Stack Overflow audience will not know what Microsoft-metro means. \n\nWindows-Store-Apps tag should be added to contest as well and IMHO Microsoft-metro should be made synonym of this tag."}, {"author_name": "Mamta Dalal", "gravatar_hash": "339c124dc3beb5778e2e601618d0c377", "author_url": null, "date": "Sep 27, 2012", "message": "Do I need to have access to the Windows Store just to be a reviewer?"}, {"author_name": "ThaRude", "gravatar_hash": "301d4bfca466f5571850d578472a0d81", "author_url": null, "date": "Sep 27, 2012", "message": "@zzzboc I had the same reaction. Just like in the good old days of 'Funniest Home Videos' shows, where you could win.... a video camera!! (like you didn't have one already?)\n\nIMHO: to build a great Win8 app(lication), you will need to have (access to) a Win 8 tablet, or at least a multi touch screen. In order to review a Win 8 app(lication) you will need... eh... Windows 8. And if you really want to be a gold reviewer, you'll need to be able to test it on say, a Win 8 tablet? Or are they only looking to judge the type of application?\n\nSo yet another appathon-like contest... sigh! MS has been spamming us with these all summer long.\nAll these efforts and contests only provide us a huge number of apps. Most of them build in an amateur fashion or way to fast (just to meed the contest deadline), and having a really small user base. But I hardly see any official application that is build for Windows 8 compared to the official apps for iPad, iPhone and Android. \n\nIt is the same story as for WP7...\n\nMicrosoft needs to deliver Win8 and convince CTO's and CEO to build Win8 apps. Not the developers!"}, {"author_name": "Janne", "gravatar_hash": "cc269462556d3faafd1ce55f43cf06f1", "author_url": "http://janne.rautiola.fi/portfolio/", "date": "Sep 27, 2012", "message": "Great competition! I'll be participating, that's for sure (if all the legal stuff doesn't get in the way, didn't pay attention to that yet). I already have one application ready but it's mainly for Finnish people to use so I think I'll do another one for this competition. But that other app will be my backup plan. Can we submit multiple apps or just one?\n\n@zzzzBov: I developed my app on Windows 8 RC, which I'm still running on my PC, so winning Windows 8 would save me some money which I would otherwise have to spend on it.\n\n@TheRude: Your comments on Win 8 tablet is a spot on. In case to fully utilize and test the features of WinRT, a tablet is a must (sensors and the already mentioned multi-touch for example)."}, {"author_name": "Lauren Gundrum", "gravatar_hash": "5114f4806122259270d5da20a3039960", "author_url": null, "date": "Sep 27, 2012", "message": "@Clay you're welcome to submit the Windows 8 app, and just explain in the Description what is going on.\n\n@Mamta All you need to do to vote on an app is watch the demo video, read the description, check out the screenshots, etc - all of which happens on Apptivate.ms. The other part is participating in chat and asking questions, which happens on Stack Overflow. So no, you don't need access to the store."}, {"author_name": "TrekStir", "gravatar_hash": "cd12652b089955a8407cad84eae6acc9", "author_url": "http://trekstir.com/", "date": "Sep 27, 2012", "message": "What a great contest. We are all very excited to be a part of it!\n\nOur upcoming app TrekStir Lite Children's Book for Windows Store is under production. Check out more about it here and please vote - http://apptivate.ms/apps/9/trekstir-lite-childrens-book"}, {"author_name": "Disappointed!", "gravatar_hash": "7befa0fe0ce9f971c5865b173424d633", "author_url": null, "date": "Sep 27, 2012", "message": "Its sad that family members of those working at MS are not eligible to participate! How does that matter really??"}, {"author_name": "Lauren Gundrum", "gravatar_hash": "5114f4806122259270d5da20a3039960", "author_url": null, "date": "Sep 28, 2012", "message": "@Janne - you can submit as many apps as you'd like, as long as they all comply with the rules. Glad you have a couple in mind already!"}, {"author_name": "TrekStir", "gravatar_hash": "cd12652b089955a8407cad84eae6acc9", "author_url": "http://trekstir.com/", "date": "Sep 28, 2012", "message": "We just found out our app was removed due to being a prior windows phone app. Our app was published on the windows phone platform as a Free LITE version. The app hasn't been published on Windows app store and there's lots of work involved making it work on Windows 8.\n\nIn fact we were so excited to make the app much cooler with the larger screen size and finally make it the way we had originally thought.\nPlus I don't see anywhere in the rules that says app that's being ported from different mobile platforms(WP, android or iphone) aren't eligible.\n\nPlease let us know if we can resubmit our app. It would make programming this app more exciting through the holiday season.\n\nThanks for your time."}, {"author_name": "minitech", "gravatar_hash": "ad70e2494769b308240329977c19adae", "author_url": null, "date": "Sep 28, 2012", "message": "Open to ages 18 and older. Why am I not surprised?"}, {"author_name": "mewse", "gravatar_hash": "2e78f14950c5fc2977759d38a047e308", "author_url": null, "date": "Sep 29, 2012", "message": "From the terms and conditions:  \"Without limiting the generality of these Official Rules, winner shall irrevocably grant, transfer, convey and assign to Sponsor the entirety of the rights in and to the Submission and all renewals and extensions of copyright, and the right to secure copyright registrations thereto in perpetuity including, without limitation, the rights to use the Submission for any and all purposes in any and all media whether now known or hereafter developed, on a worldwide basis, in perpetuity.\"\n\nWhy wasn't this little tidbit included in the contest announcement?  If you win, you have to hand over all the rights to whatever you made.  Did the people running this contest think that maybe this wasn't an important point that entrants might want to know before deciding whether or not to take part?"}, {"author_name": "Bryan Dunsmore", "gravatar_hash": "90a1e75998085d4270b41bc7192886dc", "author_url": null, "date": "Sep 29, 2012", "message": "@mewse I have say that I'm also shocked by this little tidbit. I was planning on entering, but I don't know anymore. If I'm going to go through the trouble to make Microsoft an app then that prize better be bigger than it is now. =/"}, {"author_name": "Phone App Developer", "gravatar_hash": "75ed16d8513ec58a9ebeb973a08af23c", "author_url": "http://www.phoneappdeveloper.com.au/", "date": "Oct 01, 2012", "message": "Not working :("}, {"author_name": "Lauren Gundrum", "gravatar_hash": "5114f4806122259270d5da20a3039960", "author_url": null, "date": "Oct 01, 2012", "message": "@mewse (and everyone else concerned about granting Microsoft rights) - just emailed the ePrize rep dealing with the T&amp;C and here is what she said:\n\n\"the actual Submission is the \"demo video that showcases an original app you have created, the name and a description of your app, and up to eight (8) optional screenshots and/or mockups of your app.\"  By uploading that Submission, the entrant is giving the Sponsor the rights to that material, not the app itself.\"\n\nSo, you're not handing over rights to whatever you made, just the screenshots and mockups. Hope that helps."}, {"author_name": "Lauren Gundrum", "gravatar_hash": "5114f4806122259270d5da20a3039960", "author_url": null, "date": "Oct 02, 2012", "message": "There have been a lot of questions about app eligibility (ports from other platforms, apps that were started at hackathons, etc), so wanted to clarify. Basically:\n\n(1) If the app has been submitted to the Store already, it's ineligible.\n(2) If the Submission has been previously displayed or exhibited, it's ineligible.\n\nNote that (2) refers to the Submission, not the app. The Submission is defined as the demo video and screenshots (see the comment above). So, if you have entered another contest and used the same exact demo and screenshots, you may not enter this contest. However, if you started developing your app before this contest and it has been displayed publicly, that doesn't automatically disqualify it - I think this was a concern for more people, so hopefully this is good news.\n\nNote that these are not the only eligibility rules (you must also consider other guidelines/restrictions spelled out in the Rules, Terms, and Conditions), but they are a good summary of how eligibility works for apps that have been displayed publicly before."}, {"author_name": "Mamta Dalal", "gravatar_hash": "339c124dc3beb5778e2e601618d0c377", "author_url": null, "date": "Oct 02, 2012", "message": "Can a person enter the contest as both reviewer and entrant (ie, submitting apps)?"}, {"author_name": "Lauren Gundrum", "gravatar_hash": "5114f4806122259270d5da20a3039960", "author_url": null, "date": "Oct 03, 2012", "message": "@Mamta - yep! You can win prizes in both categories."}, {"author_name": "Chris Newman", "gravatar_hash": "42c0aad968c6066d2fdc4e5f8eab2780", "author_url": "http://www.lightwoodgames.com", "date": "Oct 04, 2012", "message": "\"If the app has been submitted to the Store already, it’s ineligible\".\n\nI submitted to the Store yesterday, intending to enter the contest once I could provide a link for reviewers to download and use the app - and given that there's a field for the Store URL in the submission form!\n\nBut now you're saying that I've just disqualified myself?"}, {"author_name": "Katherine Gordon", "gravatar_hash": "1e75d2775a59b6f1dbaafd2832cc28cc", "author_url": "http://www.lightwoodgames.com", "date": "Oct 04, 2012", "message": "\"If the app has been submitted to the Store already, it’s ineligible.\"\n\nReally?  Windows 8 isn't even released yet, but if I've got my app in ready for launch, I've disqualified myself?  That seems a little ridiculous!  It's still a new app!"}, {"author_name": "om", "gravatar_hash": "1ffa3139ef313d2f51219d1103fbd1f8", "author_url": null, "date": "Oct 04, 2012", "message": "@Chris,\nI think you are eligible as the guidelines(http://apptivate.ms/apps/guidelines) say:\n\n\"Apps previously submitted to the Windows Store (before the start of this contest) are not eligible to win.\""}, {"author_name": "Katherine Gordon", "gravatar_hash": "1e75d2775a59b6f1dbaafd2832cc28cc", "author_url": "http://www.lightwoodgames.com", "date": "Oct 07, 2012", "message": "I'm a little confused by the voting system on the apps - there appears to only be a thumbs up button?  So in order to vote for apps I have to really like them?  This gives no indication as to whether the apps with low numbers of votes have not been seen or have been actively disliked.  It seems a little weird.  Surely a voting system which gives users the ability to say more would be better?"}, {"author_name": "Alex", "gravatar_hash": "777d09fac2a4dbf48b25487f72a06ff8", "author_url": "http://www.wic.co.in", "date": "Oct 22, 2012", "message": "This is great contest! I really like the idea."}, {"author_name": "Beth Worthy", "gravatar_hash": "2c9e217824b5dde9f279d9bf63ea62ff", "author_url": null, "date": "Nov 07, 2012", "message": "Hi, \nNice post. Thank you for sharing this post with us.\nThe contest mentioned sounds quite interesting and innovative for the readers of the blog post. Keep up the posting.\n\n\nThank you once again..:)"}, {"author_name": "vinay", "gravatar_hash": "bd5c8bae45871454eef214384f252598", "author_url": "http://nowebsite", "date": "Nov 21, 2012", "message": "how can i win windows 8"}, {"author_name": "James Sandberg", "gravatar_hash": "16210457361a53599324188de72c2a2f", "author_url": "http://www.eurekaengine.com", "date": "Nov 24, 2012", "message": "Nice initiative. Good to see Microsoft taking the dev community closer in this time."}, {"author_name": "dayana", "gravatar_hash": "c8739b866093c0f3bc99aeb47bec27f5", "author_url": "http://www.urgamingzone.com", "date": "Dec 02, 2012", "message": "Hi,\n   \n   Its really nice post.You include two parts in this contest.Its helpful to both developer and reviewer.I really like idea."}, {"author_name": "Application Development", "gravatar_hash": "59957435f8d3559c38b7ee798930aa73", "author_url": "http://dmss.co.in/", "date": "Dec 10, 2012", "message": "Hi,\nthanks for the share of this article and i bookmarked this article and i will review it later."}, {"author_name": "David Wilson", "gravatar_hash": "ce198896f66dc5dde42de00111001470", "author_url": "http://www.weappmobile.com/", "date": "Dec 12, 2012", "message": "really wonderful post... All the required information provided in the blog are useful and appropriate."}, {"author_name": "bill", "gravatar_hash": "7eafbec68f83e55ee849a15d0fb7d85a", "author_url": "http://www.m2cash.com", "date": "Jan 15, 2013", "message": "I remember windows mobile from the beginning \nwhat a painful and expensive process millions wasted on a garbage program \nseriously how many people r buying windows mobile plauged with problems always has and always will be a waste of time and money\n\nlook at the competition here 5k for the winner how many wasted hrs would you need to get a zero return\n\nI build apps  in financial services would never consider windows anything \n\nMicrosoft is a walking Zombie ( They are dead but dont know it )"}]}