{"response": [{"author_name": "Louis", "gravatar_hash": "bbdef61ada8a28c3e3f689b18faea3c2", "author_url": null, "date": "Sep 20, 2012", "message": "It's a joke, right?\n\nThis patent war begs for one thing: abolish it entirely, make it illegal to patent trivial stuff. It slows progress down.\nIf you do something hard enough that people can't copy it trivially, you get leadership in the market.\n\nJust the other day I was reading a question on programmers about a dev who was wondering if he could add an \"overscroll\" feature to one of his views, or if Apple would be able to sue him.\nHe was advised not to!!\n\nThis new site is just a clever move that transforms the problem of \"this should not be tolerated, but it is\" to \"how can we make better patents so that they aren't redundant/not based on new ideas\".\n\n*puke*"}, {"author_name": "Dave Land", "gravatar_hash": "961f41c5a0c3314d5a1b58c6323a5f68", "author_url": "https://twitter.com/dland", "date": "Sep 20, 2012", "message": "A step — but only a step — in the right direction. Congratulations to StackExchange for being selected. Nice to see The Best Tech Support Communities on the Web getting the recognition you deserve. Maybe you should patent it ;-)."}, {"author_name": "SRS", "gravatar_hash": "c248479fbcb94e0da61e8eeb4dfc55e5", "author_url": null, "date": "Sep 20, 2012", "message": "Great job guys. I love Stack Exchange, and love you guys even more now that Ask Patents is up! This will be a great resource, and is a very positive development."}, {"author_name": "Paul Morriss", "gravatar_hash": "8691b744cb9151e4a173a23eb44eab3b", "author_url": "http://paulmorriss.com", "date": "Sep 20, 2012", "message": "I knew this was coming and I still read it as \"askparents.com\" when I saw this blog post!"}, {"author_name": "Richard Freytag", "gravatar_hash": "91ca8ff5d93d148363f7f52acb8ffad9", "author_url": "http://$59M.pliatesC", "date": "Sep 20, 2012", "message": "Excellent idea - both reduce the pain of spurious patents and narrow the patents that (for now) must be awarded.  \n\nIt is a good start.  Maybe it will make patents harder to get, raise their cost, and so limit the number that need review."}, {"author_name": "Otto", "gravatar_hash": "9de874a10d8e92bb3624eeeac2cae872", "author_url": null, "date": "Sep 20, 2012", "message": "Louis - patenting obvious things is, and has always been, illegal. The technolegal term for this is \"obvious\". If it's obvious, it's not patentable."}, {"author_name": "Howell2010", "gravatar_hash": "b3f8e03bf21ca99e897529096eb4460e", "author_url": null, "date": "Sep 20, 2012", "message": "@Louis\nThe problem with that is people will contest exactly what \"Trivial stuff\" is.\n\nPeople will claim their little thing isn't trivial and will fight tooth and nail to prove it.\n\nThere is also a problem with no patents at all. Anyone could invent something and be a bad marketer, while someone who is good at marketing sees it and claims he did it first, and makes all the money from it.\n\nLike the story of Microsoft, or Thomas Edison with most of \"his\" inventions, or really any super big and famous thing/company.\n\n(and if anyone thinks this was a pointless comment, I at least contributed to the reCaptcha efforts of transcribing old books onto the internet)"}, {"author_name": "just_in_time", "gravatar_hash": "473f81c878a993406608f625b946c281", "author_url": null, "date": "Sep 20, 2012", "message": "@Louis\n\nReally missing the down vote button here. \n\n&gt; how can we make better patents so that they aren't redundant\n\nHow is this a bad thing?\n\n&gt; how can we make better patents so that they are not based on new ideas\n\nLogic fail! How does this follow from what is mentioned in the blog?\n\nYou are obviously a troll."}, {"author_name": "Matt", "gravatar_hash": "702421acbcc8a345b3aaf090f6878814", "author_url": null, "date": "Sep 20, 2012", "message": "Why, only the other day I was browsing recent patents and came across: \"A system for collaborative submission of prior art\" I do hope this won't be an issue."}, {"author_name": "Paul B", "gravatar_hash": "d20c9b94e08963eba85ff57aa177ac14", "author_url": "http://www.mikadosoftware.com", "date": "Sep 20, 2012", "message": "Louis,\n\nI understand you may feel frustrated that the \"obvious\" thing is not being done by Congress, but perhaps we will be better off fixing this ourselves.\n\nI believe you are right - there are some things in this world that simply should not be tolerated, but abolished, for they are so destructive, so inimicable to basic human values.  Slavery, despite 150 years of abolition, should be fought implacably.\n\nHowever, some things do not cause horror and destruction, they just hold us back from a better future.  I feel bad patent law is in this camp.  \n\nThis site allows all of us to make the patent world more useful to society, and gives us time to force, persuade, vote for government to fix really big problems.  \n\nAfter all, its better we fix the problems we can fix on our own, and put the government on notice to fix the worst ones we cannot.\n\nIf it does not work, come back, we can try 'obvious' again"}, {"author_name": "Jan de Vos", "gravatar_hash": "7d23cb97e16de66cdabe540e85dc39e0", "author_url": null, "date": "Sep 20, 2012", "message": "This is probably a good thing, but it will still not help with things that are obvious but for which no prior art exists -- i.e., solutions to new problems. I believe very strongly that those kinds of patents should not exist.\n\nI'm worried that working on sites like this will increase the apparent validity of the patent system, while we should actually be working harder to abolish it completely."}, {"author_name": "Brian", "gravatar_hash": "16a02d887075587fa0c6b1691e97452a", "author_url": null, "date": "Sep 20, 2012", "message": "What would prevent a company from monitoring askpatents.com and suggesting/commenting/voting on questions that pertain to patents they filed?"}, {"author_name": "Cade Roux", "gravatar_hash": "d45ef03e9450599588bf733662f792e5", "author_url": "http://www.semicolon.net", "date": "Sep 20, 2012", "message": "Before you cheer on Kappos and IBM, I think you should subscribe to Greg Aharonian's Patent News email list.\n\nThe idea that USPTO examiners will be given the time (or even access) to use this site when they don't even use/aren't encouraged to fully use the resources already available to them, may be misguided.\n\nI applaud the effory.  There's a lot more to this than technology and manpower.  There are big political forces and financial forces from patent law firms and firms like IBM which are going to hinder this effort (success of which by definition would cut down on number of patents awarded and/or increase rate of invalidation post-award).\n\nGood luck!"}, {"author_name": "JS", "gravatar_hash": "52886431d357ee7a5dcc4bb88adb5abe", "author_url": null, "date": "Sep 20, 2012", "message": "I'm not convinced the patent system does more good than harm, but I don't think throwing the whole system out the window is feasible either.  This is a very good step, though.  The only other thing I'd like to see is _proactive_ invalidation of bad patents.  Crowd-sourced invalidation of bad patents _before_ they're used to sue somebody.\n\nI'm listed as an inventor on two patents, applied for by a former employer, and I would be thrilled to see those patents invalidated.  The second one was granted just last week, but it wasn't novel in 1980."}, {"author_name": "steven", "gravatar_hash": "8ccc2915dc948f7130cb08844741ad3f", "author_url": null, "date": "Sep 20, 2012", "message": "How will this stop Amazon from getting a patent for \"Buy now with 1-Click\". There is no prior art, it just shouldn't be patented."}, {"author_name": "dwatson", "gravatar_hash": "aba560a9b2c4e2563a501637909f947d", "author_url": null, "date": "Sep 20, 2012", "message": "Reminds me of this:\n\n  http://pyvideo.org/video/425/pycon-2011--how-to-kill-a-patent-with-python\n\nHe describes a sort of prior art search using latent semantic indexing to flush out the patents gist then looking for earlier patents (or academic papers) with the same gist not referenced in the citations.  \n\nIt's a great presentation if you are interested in open source or patents.  Also, this is GREAT idea to crowd source the business of knocking down the ridiculous patent situation."}, {"author_name": "Andrew Hallock", "gravatar_hash": "328655ee0c0ccefbd557e8a306fc6c92", "author_url": null, "date": "Sep 20, 2012", "message": "Patents are just another example of the State using force to solve supposed problems. How can one entity have the exclusive right to grant patents? In what reality is that considered sane? It's complete nonsense.\n\nI know some will argue that x, y, z won't get created without patents, but I'd rather deal with that problem than the current debacle."}, {"author_name": "Sean Palmer", "gravatar_hash": "4bab68ac38923868a17473aee9049873", "author_url": null, "date": "Sep 20, 2012", "message": "@Cade I think since the director of the USPTO came to them and asked them to set this up, it will probably be used!"}, {"author_name": "Anthony", "gravatar_hash": "bd09d8b8ba29412fdc00e2e6647a132f", "author_url": null, "date": "Sep 20, 2012", "message": "There is a simple solution to all of this- back in the day, and I mean BACK in the day, patents had a life of 7 years. After 7 years the patent in question became public domain and anyone could use it and no one could patent it or anything like it again. You had to have a working, proven, model to get a patent; a idea on a napkin or a sketch of something that could, in theory, do something was not valid. The idea had to be something new and 100% original, you couldn't patent/copyright a common word, shape (I look in disgust at you, apple) or a common color. Unless you could prove the word, shape, color was 100% new.\n\nIn all this there was still some common sense. Really, how many ways can you make a book or a wheel? Regardless of the patent it would enter the public domain, the patent holder lost all their rights to it and anyone could pick it up and use it. This system worked very well! It stopped many crap patents and even the crap ones that wiggled through only got 7 years before becoming public domain. It also helped drive innovation. No one could patent something, sit on it for years doing nothing, and wait  to sue anyone that tried to use it. The 7 year limit also pushed people and companies to invent 100% new things and make as much profit as they could off of it in the next 7 years. This system worked for close to 400 years! \n\nSo what happened? Greed mostly. Companies like Disney that didn't want Mickey falling into public domain, the movie and music industry trying to keep control over what you hear and see, and Monsanto killing small time farmers with genetic patents on grains that they didn't invent but happened to be the first to patent. In reality, most products only have about  7 years of real value anyway. How many of us are still using 7 year old phones, computers, operating systems or other items?  \n \nHere's a simple thought- go back to what worked and let innovation back into the invention process!"}, {"author_name": "Neowizard", "gravatar_hash": "3c29baddd50856a673e476a8f8091a2d", "author_url": null, "date": "Sep 20, 2012", "message": "@Anthony\n\nNothing more to add..."}, {"author_name": "rdm", "gravatar_hash": "a59951e9c438c4631cdb23340ff0c640", "author_url": null, "date": "Sep 20, 2012", "message": "I spent a few minutes on the new site.\n\nIt's... a bit painful to use, right now.\n\nOne thing that I think would really help is: whenever a patent number is mentioned, if that could be autolinked to the official description of that patent.  Otherwise, ever time someone needs to look at a patent, they'll have to search for it.\n\nSomething similar should probably be done for patent applications.\n\nThat said, I am also intimidated by the sheer volume of noise patents."}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://robspages.net", "date": "Sep 20, 2012", "message": "@Anthony, I think you are confusing patents with trademarks and copyright."}, {"author_name": "Jerry Coffin", "gravatar_hash": "d8962238339d771f0348967be6f97b1b", "author_url": null, "date": "Sep 20, 2012", "message": "@Anthony: Actually, there's a *lot* more to add -- mostly that you're just plain wrong. The first patent act in the United States was passed in 1790, and it granted a life of up to 14 years, starting from when the patent was granted. That was eventually extended out to 17 years. The current law changes that to 20 years, but starting from when the patent was file, not when it was granted1. It typically takes *around* three years for a patent to be granted, so in most cases it adds little (and for patents that take longer to be granted, may reduce the life somewhat).\n\nThe Disney extensions were to copyrights, not patents.\n\n---\n\n1 This plugged a whole previously used by the government. The NSA (among others) would file a patent, then classify it so the examiner couldn't look at it. It would sit until they decided to de-classify it. Some patents filed this way sat for decades, until somebody else invented essentially the same thing."}, {"author_name": "Richard Peterson", "gravatar_hash": "64c8f2d450799d4a9b7cd80641a6a4cb", "author_url": null, "date": "Sep 20, 2012", "message": "While I think that Anthony was referring to the minimum time for design patents, the game for utility patents has changed from an exclusive right for 17 years from the date of issuance to 20 years from the date of filing.\n\nThat said, the scope of what is considered enabling prior art has changed from a limited search of prior U.S. patents to world wide patents to world wide publications.\n\nBut, how does one grade the prior art and its impact to invalidate patents?  \n\nPatents are useful in that an issued patent at least survived a certain certification stage.  Issued patents are only presumed valid.\n\nTypically, an inventor spends $1000 on a pre-examination search, and a defense litigation team spends about $100,000 to invalidate a patent. (Google apparently spent $3,000,000 to invalidate Oracle's copyright and patent claims.)  \n\nCrowd sourcing is an old idea and has great value in referencing prior art.  But, like any wiki-type evaluation, the credentials of the evaluators (and their motive) needs to be taken into account, otherwise we again devolve to chaos.  \n\nIn addition to crowd sourcing, gamification techniques need to be deployed to grade and present the analytical material in a unified format.  \n\nThe reliance of examiners on word searches has led sophisticated companies to patent essentially the same thing, but change the words to describe the invention.  The peer review process at the USPTO has largely been a failure.\n\nHowever, the peg on which the author of this blog hangs his hat, on public citations, has been around for a long time.  The data has just not been collected, collated and presented in a user friendly form. Let's make it a game."}, {"author_name": "Marklittlewood", "gravatar_hash": "38c84da0c05225c270151d337fca43ab", "author_url": "http://thebln.com", "date": "Sep 20, 2012", "message": "I patented this whole crowd-sourced prior-art detector thingummy-jigger. Please send me $1,000,000,000 and we will say no more about it."}, {"author_name": "Ben Bradley", "gravatar_hash": "86dc0296c2e22e699ecccb57e397af4f", "author_url": "http://plus.google.com/114600403373706855890/about", "date": "Sep 20, 2012", "message": "This looks like progress for the validity of future patents, but is there anything to be done for the many already-issued patents that are trivial and/or for which there was prior art (short of suing and paying four-digit-and-up attorney fees for each such patent)?"}, {"author_name": "Rudolf Olah", "gravatar_hash": "0fc5485611721e78b1583657212a046a", "author_url": "http://patentabsurdity.com/", "date": "Sep 20, 2012", "message": "This is a stupid idea. Software patents shouldn't exist AT ALL.\n\nhttps://www.eff.org/deeplinks/2012/06/want-abolish-software-patents-tell-us\n\nhttp://endsoftpatents.org/"}, {"author_name": "Robin Hood", "gravatar_hash": "39294fd155fa3fc92bfc7dc014735651", "author_url": null, "date": "Sep 20, 2012", "message": "I'm so glad I don't live in the US but very far away. No patent trolls in here. Free breathing.\n\nIt was gangsters in the earlier Amreican history. Nowadays it's patent trolls. What's the difference anyway?"}, {"author_name": "Alex Maurin", "gravatar_hash": "d9cc9b181d36e834dbb334fa34844a40", "author_url": null, "date": "Sep 20, 2012", "message": "Although I would much prefer patents of any kind being abolished entirely, along with many government institutions and agencies and offices, I think that allowing people with more time on their hands and a direct stake in the patenting process to have input is a tiny step in the right direction, which is allowing the market and/or the people to decide."}, {"author_name": "Jeremy", "gravatar_hash": "e0f502a6b3a7c216b85ed88d3d0b2799", "author_url": null, "date": "Sep 20, 2012", "message": "Originally Patents were a gazette to help inventors market their idea's.\n\nI've read some of the Q &amp; A's and it looks like AskPatents is bringing back some of the original goodness, well done!"}, {"author_name": "BNeutral", "gravatar_hash": "ac9324f9bbea8dac4594572d8423c5a1", "author_url": null, "date": "Sep 20, 2012", "message": "Patents shouldn't even exist, under absolutely no circumstance should ideas and knowledge be made into a business. We have many great inventions/discoveries from the 19th century that still haven't made it into daily life because of these ridiculous barriers."}, {"author_name": "BNeutral", "gravatar_hash": "ac9324f9bbea8dac4594572d8423c5a1", "author_url": null, "date": "Sep 20, 2012", "message": "PS: That 19 should obviously be a 20, but my mind slipped."}, {"author_name": "Rolurkeu", "gravatar_hash": "44bb6a46673612adb15e60aa7eff8cc6", "author_url": null, "date": "Sep 20, 2012", "message": "Let me suggest another approach: Lobby your representatives to abbolish software patents. This worked very well in most parts of Europe."}, {"author_name": "Yury Kapoyko", "gravatar_hash": "e0bf6ed2e399e8134799efd58644b606", "author_url": null, "date": "Sep 21, 2012", "message": "Have a luck, good job! Here, in Russia, software patents are invalid, I'm sure, this is the best case at all."}, {"author_name": "Reelix", "gravatar_hash": "8bcc2e2a2c3e1626f9575ecaded40b2b", "author_url": null, "date": "Sep 21, 2012", "message": "This site has a List of \"Topics\" on the right. Apple has a patent on \"Lists of items\" - This site is in a violation of one of Apples patents.\n\n;D"}, {"author_name": "Curt", "gravatar_hash": "15a556c8b58e8aefa727088885925a12", "author_url": "http://www.curtistimson.net", "date": "Sep 21, 2012", "message": "@Louis: Do you have a link to the question regarding \"overscroll\" on programmers? I think its a terrible shame that developers feel worried about implementing features in case they get sued. It slows down progression of web technology.\n\nAs you say, if you are the first to think of an idea, you have an advantage over the rest of the market. And if someone thinks of a better way of doing something based on your original idea, then thats fair game.\n\nIf Ford starting sueing people over the use of a steering wheel, and rubber tyres, where would we be now..."}, {"author_name": "A disgruntled developer", "gravatar_hash": "db7d5af806fa5298f408d20a0f248059", "author_url": null, "date": "Sep 21, 2012", "message": "For every person arguing that this is a good idea, I strongly suggest that you read the following paper: http://levine.sscnet.ucla.edu/papers/anew.all.pdf\n\nThere is a wealth of evidence that patents in ANY form hinder progress. To play along with this game is disingenuous at best on our part. The only rational approach to the problem is to apply political pressure to abolish patents entirely, in all forms, without exception.\n\nThe fact of the matter is that this site will only serve to legitimise the patent system and waste even more peoples' time. You are doing the world a disservice by creating this site. I didn't exactly have a lot of respect for StackOverflow previously but I now consider you to be at the bottom of the barrel."}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Sep 21, 2012", "message": "It seems the stats are messed up on the http://stackexchange.com/sites page. For example, the patent site has age of 2011y8m, and an average of 4 questions a day."}, {"author_name": "SamP", "gravatar_hash": "f69345950e93858733172dd1fdeec4b2", "author_url": null, "date": "Sep 21, 2012", "message": "Don't put too much faith in the new director of USPTO.  IBM is a very large part of the problem with their 'patent it first, ask questions later' philosophy.  IBM has virtually cornered the market on patenting processes.  You might be washing your hair according to a process IBM now owns.  Pay some royalties on that!"}, {"author_name": "John Parkes", "gravatar_hash": "be8e17a401bdf0109a55b4e608992603", "author_url": "http://nil", "date": "Sep 21, 2012", "message": "John Parkes \n\nPersonally I have found to my cost patents both in the USA and the UK to be a complete waste of time - especially when you are up against a plagiariser with more money than yourself! In the UK when you do challenge a plagiariser you are the one who ultimately ends up in trouble.    \n\nJudges can and do strike out claims so what is the point of paying a Government Agency to grant and upkeep ones patent/s in the first place when a Judge - influenced by glib talking dishonest patent lawyers - simply strike out one or more of your claims under the rule of obviousness. \n\nThe whole issue of patents is a legal minefield and as usual controlled by those with money and mercenary Lawyers.\n\nI am afraid I have no suggestions on this other than publish and be damned."}, {"author_name": "Louis", "gravatar_hash": "bbdef61ada8a28c3e3f689b18faea3c2", "author_url": null, "date": "Sep 21, 2012", "message": "I stand by everything I said, this site makes people thing it's ok to patent things, when it's really not, I don't want progress to be held hostage of big ass companies who patent anything they can think of and then proceed to sit on it and shoot at anyone coming near.\n\nIf you fail at promoting an original idea you had, either you shouted it too loud and people copied it, or you failed at hiring a decent marketing team.\n\nIt needs to stop right now, good or bad patent is all the same, there should not be patents at all."}, {"author_name": "Laura", "gravatar_hash": "5028fddccddf5610dac7383b00da7619", "author_url": "http://stackexchange.com/users/463263/laura", "date": "Sep 21, 2012", "message": "@rdm If a question is tagged with a patent number, there is a link to the patent description (in Google Patent Search) on the right sidebar. You may have to scroll to see it, and it might be easy to miss, but it's there. We can probably do a better job of calling that out."}, {"author_name": "Me", "gravatar_hash": "8a74eb39ee732df0661ae4a5c8244172", "author_url": null, "date": "Sep 21, 2012", "message": "I wish someone had patented software bugs, shame there's so much prior art"}, {"author_name": "Doc Merlin", "gravatar_hash": "687359a2ed8d0926ce653d9bc384cc5b", "author_url": null, "date": "Sep 21, 2012", "message": "\"make it illegal to patent trivial stuff\"\nJust because you ban something doesn't mean it doesn't happen!  \nYou already can't by law patent trivial stuff.  This doesn't mean that trivial things don't get patented."}, {"author_name": "Xerxes", "gravatar_hash": "21bdb345b30364b22a67e4c134aa5ee8", "author_url": null, "date": "Sep 21, 2012", "message": "Very nice idea! I really hope that this site help stop some greedy and non-innovative companies like apple, who patents shapes!"}, {"author_name": "A. Nony Mouse", "gravatar_hash": "bbcb1f7aeb2a5b45432d21f3f9961c69", "author_url": null, "date": "Sep 21, 2012", "message": "Look, this is a nice effort but it's not going to result in software developers having to worry one iota less about patent trolls, and isn't that the goal? \n\nThe issue is best expressed as a negation, so I'll give it its own sentence:\n\nIt is NOT the case that the USPTO is issuing scads of bad patents by the CAFC's (patent court of appeals) interpretation of patent law.\n\nThe CAFC is issuing rulings which are making the case law  driving the patenting. Those patents are ridiculous, it's true, but they're not at odds with law. \n\nThe fact that we-all programmers feel strongly that they're ridiculous is completely immaterial. You need to show prior art. You need to deal with the fictional person \"having ordinary skill in the art\". \n\nFor most things, actually, there is no prior art as the CAFC and the ever-ready jurors in Marshall, Texas define that to be. If Bezeos wants  to patent one-click, well, has anyone ever done exactly THAT before? No? Patent issued. \n\nDitto the near-billion dollar lawsuit that Hoovered all the dollars earmarked for R and D by Blackberry.  Not enough people who hate software patents actually read that patent. I did. You know what it was? It was a patent on putting some data into a database at time one, then taking it out of the database at time two and using it to determine something. Don't believe me? Read it. \n\nHow would this crowd-sourced process have helped Blackberry? Do you suppose the patent in question escaped analysis for prior art and obviousness by Blackberry's lawyers? O.K. then.  This \"big hive effort\" is a feel good measure that's going to help the situation only at the fringes. \n\nThe solution is to ban software patents. The EU did it. New Zealand did it. Distinguishing software patents from other types  in law not some Gordian Knot that no mind can unravel. \n\nAllegedly, and this is alleged by lawyers if you see what I mean, it would put the US in violation of TRIPS. Sorry, but determining the original 101-ness - the patentable subject matter - of human-crfeated artifacts  is not something legislated by TRIPS. It's adjudicated by Congress.  \n\nIf we want to all get together and make a group effort, then there are more effective ways. \n\nIf software companies simply decided to stop selling into the US market, that would get Congress's attention. In fact, many software companies do decide to do this, but that fact is not widely publicized, not least of all because who wants to be made an example of by vindictive lawyers who sense a threat to their gravy train? Still, it's a aggregate statistic  worth quantifying by motivated researchers. \n\nA real group effort that might make a difference would be for developers to form and join an organization dedicated to obtaining patents from the USPTO and using them to sue Microsoft and Apple and IBM and the other major software-patent-pushers. \n\nEssentially he idea is to form a hive troll organization where members and contributors give away their patent rights to the organization who in turn only uses proceeds from licensing and lawsuit to acquire more patents. \n\nIf academic researchers and the majority of programmers contributed their ideas and we could get enough funding to pay for lawyers until such time as we become self-supporting, then we, and not Microsoft or IBM or Apple would be the most feared patent-wielding organization. \n\nThe accumulated IP- as the CAFC has chosen to define IP- would be enormous. We'd have no reason to sign any kind of \"patent truce\" with any of our targets, since our goal is to kill software patents.\n\nAnd how would this lead to an end of software patents? First, think of the media optics.   How do you think it's going to  play to Congress when the VAST MAJORITY or professional programmers and researchers are all foregoing billions(!)  of dollars in order to try to motivate Congress to do the right thing? Is that a story you think would sell? \n\nSecondly, once Apple / Micorsoft / IBM faced it's upteenth infringement lawsuit from us with no end in site, think their shareholders would start to demand a rethinking of their resistance  to banning software? Think they will be able to sustain the fiction that they're \"creating value\" by software patenting ? \n\n\nThere is nothing pie in the sky about this, as slightly madcap as it might seem.  This can be done; it's what patent trolls do do now in the real world. All that is needed is the organizational and contractual / lawyering skills and some seed money. And a little publicity."}, {"author_name": "hjghjk", "gravatar_hash": "66da23d6b350f34bcc03cf39c8a2e663", "author_url": null, "date": "Sep 21, 2012", "message": "Do you imagine how boring is to read someone's *patent rant* written out of boredom?"}, {"author_name": "Bryan", "gravatar_hash": "78018a4bbe5d38ec16ffaf74dc2b6049", "author_url": null, "date": "Sep 21, 2012", "message": "This is an intriguing idea, lads. I'm for anything that fights overlawyering of any sort."}, {"author_name": "Nikola Tesla", "gravatar_hash": "545ddcc84323f9d2fff4f568553eb921", "author_url": null, "date": "Sep 21, 2012", "message": "These proposals won't really help much (since \"obviousness\" is still very subjective and a pretty easy hurtle to get over). Also, how much time will busy people want to spend on this (for free) and how much time will examiners want to spend looking at all this stuff (much of which won't be applicable to specific claims).\n\nMost of the problems with the current patent system could be solved if we just replaced the astronomically expensive judicial review process for patent validity and infringement, with \"binding arbitration\" of all patent disputes (limited to a maximum cost of $10K per party). This would allow even small players to have equal rights with the biggest companies and allow real (impartial) experts, in all the various fields, to fairly decide which patents are valid and/or infringed and which are not (using much more information than examiners have available). Each dispute could then be settled within a few weeks or months, at the most. Parties could still sue for actual damages (if they can't come to a financial settlement agreement), but the decision about patent validity and infringement will have been pre-decided by such an expert panel. Simple, efficient and fast! Also, this should be Constitutional, at least under the commerce clause (since the Constitution doesn't mandate judicial review of patent disputes, just that \"authors\" have the right to get a patent). \n\nI'll be proposing this to the patent commissioner and members of Congress (along with other methods to greatly improve our patent system). Seems like a much better way to go and will put most patent trolls out of business real quick, since almost any company could then afford to fight absurd claims."}, {"author_name": "Nikola Tesla", "gravatar_hash": "545ddcc84323f9d2fff4f568553eb921", "author_url": null, "date": "Sep 21, 2012", "message": "The America Invents Act poses many, many problems for small inventors and entrepreneurs that haven't yet been appreciated or closely examined. Chief among these is IP theft and security (since how can an inventor prove their idea may have been stolen a few months prior to someone else's filing?). Inventors will have to file provisionals (or publish details) every few weeks, or months, to guarantee nothing can be stolen through, say, anonymous cyber attacks, or employee theft. This will become a very tedious and expensive process (at least for smaller firms and individuals). In this respect, AIA is VERY bad for independent inventors."}, {"author_name": "roger", "gravatar_hash": "9887130ab70f6e66b50f2c5e19272c67", "author_url": "http://freeldssheetmusic.org", "date": "Sep 21, 2012", "message": "Ask Parents what? :)"}, {"author_name": "AhHatem", "gravatar_hash": "ffe19b9bdcc2773be24ae387dff182ff", "author_url": null, "date": "Sep 21, 2012", "message": "bothThe patent system has proved to only be useful for larger companies who can actually afford a software patent trial against someone who sole their idea, since most small companies and individuals cannot normally afford a multi-year multi-million dollar law suite."}, {"author_name": "Baboon", "gravatar_hash": "4d1795fc22c16e533fd1d11fae39fef8", "author_url": "http://baboon.eu", "date": "Sep 21, 2012", "message": "@Curt here is the link about the overscrolling feature: http://programmers.stackexchange.com/questions/165321/is-it-allowed-to-create-a-app-with-overscroll-feature"}, {"author_name": "Nikola Tesla", "gravatar_hash": "545ddcc84323f9d2fff4f568553eb921", "author_url": null, "date": "Sep 21, 2012", "message": "@AhHatem\n\nThat's why I am proposing \"binding arbitration\" (by experts) to settle all patent related disputes. If necessary this would be subsidized by the government (if it exceeds $10K/party - which it shouldn't). Whole process could be completed in less than one week. Could settle 1000-2000 disputes/year. If patent trolls find they lose most of these, they will just go out of business (and into something else)."}, {"author_name": "rdm", "gravatar_hash": "a59951e9c438c4631cdb23340ff0c640", "author_url": null, "date": "Sep 21, 2012", "message": "@Nony Mouse -- I do not think it's relevant that \"It is NOT the case that the USPTO is issuing scads of bad patents by the CAFC’s (patent court of appeals) interpretation of patent law.\"\n\nHere's the problem: legal decisions are based on law and on fact. But the only facts they are based on are those which are presented to the court.\n\nMeanwhile, we are now a highly specialized society, where many people -- especially those building out new technology -- have highly specialized focus.\n\nIn other words, unless the relevant kinds of specialists are brought, it's quite likely that facts which are relevant in the context of any new product are not being presented to the court.\n\nPut differently, the patent system is not being a useful mechanism for disseminating new techniques, for reasons which any expert in library science can probably expound on at great depths (lack of proper indexing). Or, really, anyone in social media (it's boring). Or, economics (it's not in the interest of the patent filer to have anyone else understand the proposal).\n\nOn the \"positive\" side, this means you probably can find prior art for claims which are broad enough to include something you have designed, if you research broadly enough."}, {"author_name": "A. Nony Mouse", "gravatar_hash": "bbcb1f7aeb2a5b45432d21f3f9961c69", "author_url": null, "date": "Sep 21, 2012", "message": "rdm,\n That's a good point I left out- that the whole idea of \"one of ordinary skill in the art\" is archaic in the extreme given that a lot of software is naturally understood only by a small number, a subculture of specialists, it is those people who rightly constitute the fictitious \"one of ordinary skill in the art\". \n\n\nBut to tell the truth, it rarely comes down to what such a person or group of people could or could not be hypothesized to know (the Oracle v. Google case being a refreshing exception where the judge himself was a programmer and rightly all but sneered at some of Oracle's claims). \n\n\nInstead it's just assumed that if it isn't published somewhere (yes another archaic idea about how knowledge is passed between practitioners) then it's sufficiently novel for 101ness.  \n\nExcellent point."}, {"author_name": "Steve", "gravatar_hash": "cf5eaa30cb6989d3fc8ba3201fed2514", "author_url": null, "date": "Sep 21, 2012", "message": "I hope it's in the cards to anonymize the patent submissions by removing company names, inventory names, etc. Otherwise I fear people with a bone to pick with Apple or Microsoft or whoever will have their opinions colored.\n\nThen again, in theory the StackExchange methodology should prevent that…perhaps I've been reading the comments on too many gadget blogs."}, {"author_name": "Bob C.", "gravatar_hash": "a266b2a9a85fa580676f5c72cbf15f28", "author_url": null, "date": "Sep 21, 2012", "message": "AskPatents.com: A Stack Exchange To Prevent Bad Patents\n09-20-12 by Joel Spolsky. 57 comments \n\nhttp://blog.stackoverflow.com/2012/09/askpatents-com-a-stack-exchange-to-prevent-bad-patents/\n\nI can't believe how many are in favor of S/W patents. Louis had it right as well as a couple of others. First, S/W patents were not allowed until the 1980s. This was after the first PCs hit the market (not necessarily talking IBM PC - Apple, Radio Shack and other had PCs out in the market before the IBM PC). Second, it wasn't until the 70s that S/W could even be \"Copyright\"ed. Prior to that, S/W was considered to be a series of mathematical algorithms, which were not allowed to be patented (and still aren't). Also, in the 50s and 60s, much of the source code was made freely available. \n\nIf you stop and think about it, very, very little falls into the categories of \"novel\" and \"non-obvious\" as the computer, in general, is nothing more than an extension of solving a problem (or performing a function) on paper. While there have been a lot of significant S/W advances made over the years, it has primarily been due to advances in H/W. Back in the 50s and 60s, the H/W was insufficient to allow the S/W to perform as it can on today's H/W. Much of the processing back then was done with a combination of H/W, S/W and manual effort. As soon as the H/W became more capable, it becomes \"obvious\" that what was done manually can now be done on a computer and all that is needed is the S/W to make it happen. The argument of not being \"novel\" also follows along those lines. A good case in point is Microsoft Office. Essentially, it is nothing more than automating the typewriter, filing cabinet and sending letters through mail Likewise with Excel - spread sheets used to be done manually. With the advent of the computer, it was one of the first things automated. Flip Charts became \"Presentation\" charts. Data bases have been around since the beginning of commercial use of computers. Different approaches had been developed as a means for storing and accessing data. SQL is one instance that was in the public domain before S/W patents were allowed. \n\nBack in the 70s, the company, for which I worked, had us write \"technical disclosures\" on anything of significance - due the then recent ruling that S/W could be Copyrighted. I wrote a disclosure dealing with Client/Server processing - over a network or within the same H/W. I could probably make a safe guess that there are a few patents based on my ideas from back then, however, it is very unlikely they would be invalidated - 1) I don't have the time to \"thoroughly\" scan the thousands of S/W patents to see if they incorporated my ideas and 2) even if I found one, I do not have the resources to file a suit against the patent holder. One last clarification on my disclosure, not every idea in it was solely my own. It was based on prior art. I was simply advancing the state of the art back then. \n\nOne last point. S/W was allowed to be Copyrighted because it could be made analogous to writing a novel. That made sense, since prior to extending Copyright law to S/W, some companies were taking \"free\" S/W, making a few minor modifications and then selling it (at the expense of the originator). In the 50s and 60s, it was rare for S/W to be sold. Much of it became \"public domain\". Only those companies who wrote their own may have, or not, kept the source out of the public domain for competitive advantage. However, there were many who had no problem sharing their efforts. This was even truer in the early years of the PC. A lot of \"freeware\", \"shareware\" and the like was written back then. The freeware source was always available and. typically, did not even include a Copyright statement. Most shareware, that I viewed, usually had a Copyright statement, but more often than not, it was never filed as \"Copyrighted\". \n\nUnfortunately, too many \"youngsters\" grew up in the PC era and are not aware of the history of computers and S/W development. \n\nPatents NO, Copyrights YES\n\nFor some interesting read on the topic, check out the following: \n\nMark A. Lemley is the director of the Stanford University program in Law, Science &amp; Technology.[1] He teaches intellectual property, computer and Internet patent and antitrust law. He is a widely cited expert on the impact of patents on innovation[2] and what the appropriate requirements for granting a patent should be. - http://www.law.stanford.edu/news/closing-the-software-patent-loophole-professor-lemleys-new-proposal\n\nFrom OpenSource - recap of the above with comments from your peers, which you may find of interest. - http://opensource.com/law/12/9/closing-software-patent-loophole-professor-lemleys-new-proposal \n\nFrom an Infoworld article - http://www.infoworld.com/d/open-source-software/the-software-patent-solution-has-been-right-here-all-along-202299?page=0,0\n\nFrom Ars techmica - http://arstechnica.com/tech-policy/2012/07/top-patent-court-struggles-to-decide-when-software-is-patentable/?comments=1#comments-bar\n\nThe comments of the readers may be of interest in the last two sites above."}, {"author_name": "Lee Goddard", "gravatar_hash": "4e6ea6eda1ac602bde5b282216ae331f", "author_url": "http://www.leegoddard.net", "date": "Sep 22, 2012", "message": "Prevent bad parents doing what?\nThe problem with 'bad' parents is generally that they do not care - certainly not enough to check your website.\nYour market will be parents who do care, which make them good parents, driven to your site by frustration.\nFire your PR and hire me.5"}, {"author_name": "butlar", "gravatar_hash": "7c7ea71f5ae6026c3f098268c1611fdd", "author_url": null, "date": "Sep 22, 2012", "message": "I'm going to suggest that the biggest issue with a stack exchange patent, as opposed to of something like programming, is that it's boring.  Patents are written to be wordy and hard to read, not really to be insightful and provide answers.  It tells you a lot when engineers are usually ordered away from patents (that are, in theory, supposed to communicate useful information to them).\n\nIt'd take a relatively rare person to get a kick out of reading and cross-referencing such things and, while I do hope this stack exchange succeeds, I don't see it really taking off."}, {"author_name": "Ewan", "gravatar_hash": "3e2cc7b120705cf613cb794e126c96bd", "author_url": null, "date": "Sep 22, 2012", "message": "This is a great step, but at least one problem stands in the way: best practices in industry is to not look at any patents at all since awareness of a patent which is infringed trebles damages. Hence I expect reading Ask Patents about patents will imply awareness of patents which may be infringed and therefore best practices in industry will be to avoid it as well.\n\nSurely with this best industrial practice demanding we have no awareness of patents, the entire concept becomes moot and has no hand in advancing society at all. \n\nA new approach to intellectual property is needed and Ask Patent is a good step in the right direction."}, {"author_name": "SteveB", "gravatar_hash": "de4815859413afbc1b01907f3a766fb3", "author_url": null, "date": "Sep 22, 2012", "message": "Although this sounds like a very good idea I am a little concerned that an organisation (Google) which is very active a patent disputes is a collaborator within this project.\n\nCan the US Patent Office confirm that data or information that is submitted buy individuals or organisations is not being monitored, stored or utilised (even for future use) by partner organisations, that could possible provide a possibly unfair advantage for partner organisations with seeking, defending or acquiring  patents?\n\nShould not a project like this be funded, managed and maintained completely independently?"}, {"author_name": "Steven Fisher", "gravatar_hash": "488c2dcaa43806d49cac768901604ab5", "author_url": null, "date": "Sep 22, 2012", "message": "This is going to amount to just another troll-filled mess without the ability and requirement to downvote soapboxy comments. (Indeed, each question I checked already has.)"}, {"author_name": "Yves Rausch", "gravatar_hash": "37241a7a2b550bf42842f2d021e3f711", "author_url": null, "date": "Sep 23, 2012", "message": "Nice idea indeed and I am curious if bigger companies join this as well. We all know that this patent war is killing innovation lately, so this can only be a start while the governments of the worls realize this has to be stopped (hopefully)."}, {"author_name": "Eleonore", "gravatar_hash": "3413b87ea9f101adeb45075e015f3319", "author_url": "http://cheaproadbikes.biz", "date": "Sep 23, 2012", "message": "Congratulations to StackExchange for being selected. Nice to see The Best Tech Support Communities on the Web getting the recognition you deserve."}, {"author_name": "Larry", "gravatar_hash": "01eadc88d6ff24e892fffca2ae300b9b", "author_url": null, "date": "Sep 23, 2012", "message": "I'm concerned about this statement: \"a collaborative effort, supported by Stack Exchange, the US Patent and Trademark Office, and the Google Patent Search team\"\nWhen I worked for a hitech company, we were told NOT to use Google or Yahoo (But especially Google) to do patent research as they log and assimilate the info from these searches for their own internal use.\nIs this going to happen with this new service?\n\nWho watches the watchmen?"}, {"author_name": "Nikola Tesla", "gravatar_hash": "545ddcc84323f9d2fff4f568553eb921", "author_url": null, "date": "Sep 23, 2012", "message": "What's the matter with just \"binding arbitration\" (by experts) of all patent disputes (for maximum $10K cost)???"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Sep 24, 2012", "message": "Whoever wants or needs to, @Larry. Like all Stack Exchange sites, the contents of Ask Patents is freely available under <a href=\"http://creativecommons.org/licenses/by-sa/3.0/\" rel=\"nofollow\">a Creative Commons</a> license, with no walls (paid or otherwise) to prevent examination, analysis and re-use. \n\nSunlight is said to be the best of disinfectants..."}, {"author_name": "A Nony Mouse", "gravatar_hash": "bbcb1f7aeb2a5b45432d21f3f9961c69", "author_url": null, "date": "Sep 25, 2012", "message": "re:\nhttp://blog.stackoverflow.com/2012/09/askpatents-com-a-stack-exchange-to-prevent-bad-patents/#comment-70220\n\n\nThe difference between the forces that push and profit from software patents and the forces who see how destructive to value they are want to eliminate them  is that amongst those people with means, the forces who want software patents are willing to roll up their sleeves and do real work in order to obtain their ends."}, {"author_name": "Kingsley Quartey", "gravatar_hash": "1e34224e06f8a0203e387a88c39a0f50", "author_url": null, "date": "Sep 26, 2012", "message": "Yes i suspect someone is trying to Patent My \"Original idea\".\n\nI have worked on it since 2003, and I did a Patent search on Google and by the time I know someone is trying to get a Patent for it.\n\nI am not sure if Some Companies 'troll\" Seacrh Engines looking for \"free ideas\" to patent, but this is Patently unfair and almost Criminal.\n\nAs far back as 2007 I tried to sell the Idea and I am 100% those companies I tried to sell the idea to will back me up - though I did not tel them exactly what \"compounds' I had in my Invention..\nHow can i stop the other guy from getting a patent for something that is mine ?"}, {"author_name": "Richard M Stallman", "gravatar_hash": "ed5214d4b49154ba0dc397a28ee90eb7", "author_url": "http://www.stallman.org/", "date": "Sep 26, 2012", "message": "\"Reforming\" the patent system to make it function \"properly\" is\nnot enough to eliminate the danger of software patents.  See\nhttp://www.gnu.org/philosophy/patent-reform-is-not-enough.html.\n\nSoftware patents are like land mines for software development.\nRemoving the ones that are legally invalid is like removing\nsome fraction of the mines in a field.  It's a step forward,\nbut the field remains dangerous until the rest of the mines\nare removed."}, {"author_name": "Concerned Citizen", "gravatar_hash": "80ae8ec34e9e3e66c5be50733afaa44e", "author_url": null, "date": "Sep 26, 2012", "message": "Mm, askpatents.com is blocked where I work... That's weird."}, {"author_name": "heringgull", "gravatar_hash": "fe574d0430673eda576a380b1986216e", "author_url": null, "date": "Sep 30, 2012", "message": "a  very well kmown german car company told me that they would not alert the  patent office(s) to prior art ,so as not to show their hand before it really mattered\n\nso , did the USPTO  take that into account"}, {"author_name": "Laurence Gonsalves", "gravatar_hash": "fe40b570b44ed39f4a06ac913af1ec2b", "author_url": "http://xenomachina.com/", "date": "Sep 30, 2012", "message": "@ Howell2010, you say \"\"There is also a problem with no patents at all. Anyone could invent something and be a bad marketer, while someone who is good at marketing sees it and claims he did it first, and makes all the money from it.\"\n\nContrast that with what we have today, where anyone could invent something and be a \"bad patenter\" (ie: unable/unwilling to spend the time and money on lawyers), while someone who is good at patenting can claim he did it first, make all the money from it, and sue the other guy for damages to boot.\n\nAs an independent inventor, I'd much rather have a world with no patents. I don't have the time or money to spend on patent lawyers, and I certainly don't have an enormous portfolio to compete with the \"big guys\". (And even if I did, it'd be useless against patent trolls.)\n\nIf you can reimplement my idea better than me, then so be it. With no patents, worst case is I lose my R&amp;D costs. With patents, worst case is I get sued for far more in addition to losing my R&amp;D costs."}, {"author_name": "Karthikh Venkat", "gravatar_hash": "667eb1b6ee7855110a3767aaba38887d", "author_url": "http://students3k.com", "date": "Oct 03, 2012", "message": "Excellent idea guys!\nIt is a good start."}]}