{"response": [{"author_name": "SeanJA", "gravatar_hash": "74cc83022ea14b42b49ea487b95d5f1e", "author_url": "http://blog.seanja.com", "date": "Sep 17, 2009", "message": "I was wondering what happened to the colour of the accepted answers just now... I thought it was broken in chrome or something."}, {"author_name": "jtbandes", "gravatar_hash": "7e9f543f0ffdb7c9a899e628fe76e7f3", "author_url": "http://bandes-storch.net/", "date": "Sep 17, 2009", "message": "Public and web-friendly is relatively easy: create a website repository of themes (maybe \"Swatch Exchange\"? \"Color Clash\"?). It'd have a simple list of schemes with screenshots (or live previews).\n\nTo get the community involved and bring the good designs up, it could have an up/down rating feature, where anyone (or anyone with an account from the Trilogy, or maybe MSO) can rate a color scheme. In addition, people could submit and create color schemes right on the website, and the backend would take the user-generated colors and generate CSS. The CSS from each theme could be downloaded and used on any Stack Exchange site.\n\nLayouts are harder. I'll leave that to the rest of the internet."}, {"author_name": "Greg Laws", "gravatar_hash": "3ddfd1b5d1c482f89fbd8f1416177d0d", "author_url": "http://www.wikidlabs.com/blog", "date": "Sep 17, 2009", "message": "You are absolutely right that there needs to be some preset color schemes available for stackexchange users to choose from.  The creator of each site should be able to focus more on the community they are trying to create than the color scheme that identifies it. Sure, it's great to let those that can great a great unique color scheme do so, but otherwise defaults should be provided to save programmer designers from themselves.\n\nI have two suggestions:\n\n1) Post a question on a designer stackexchange site and ask for users to submit color schemes and let the community vote up the best ones and declare the top 5 or so to be the winners and use those as defaults.\n\n2) Create a system where the user creating the stackexchange site picks ONE color and have software calculate the remaining colors that are necessary. That way the user can pick one color that matches their logo and the rest is handled for them. Tweaking is allowed from this starting point."}, {"author_name": "Alan Storm", "gravatar_hash": "121e5abbf36778568a0f8de2a761d94d", "author_url": "http://alanstorm.com", "date": "Sep 17, 2009", "message": "With respect, if you want better colors schemes and better design for your product you could (get ready for the crazy) hire a professional designer."}, {"author_name": "Ivan", "gravatar_hash": "fadf50b647fa1fb23c793ad5bd4fb6a3", "author_url": "http://ivanyvenian.com/", "date": "Sep 17, 2009", "message": "There are several good sites with color palettes, like Adobe Kuler (kuler.adobe.com) and COLOURlovers (www.colourlovers.com), so why not pick some from there?\n\nAs for community collaboration, it would be great to see what crazy stuff designers can do with something like the CSS Zen Garden (www.csszengarden.com).\n\nI'd say don't try to create a custom template language. Just have someone structure your HTML/CSS in a semantic way which can be creatively adjusted via pure CSS.\n\nNow that I'm here, please hurry with my beta account,  as I can't wait to get started... I have cash!"}, {"author_name": "Michael", "gravatar_hash": "002d975b8303c0747aab3bc39bb3c70f", "author_url": null, "date": "Sep 17, 2009", "message": "Totally agree with Alan. I'm at a loss why you would do it this way (and why Joel went to 99 designs for a logo redesign). Stuff like this screams \"We don't give a shit about design(ers)\" If you want good work, don't farm it out to whoever will do it for free, pay someone to do it well. If there was a code bug on stack overflow would you handle it in the same way or would you make sure you had the correct resources on staff to take care of it? I'm a coder, but this kind of thinking builds an us and them wall between coders and designers."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 17, 2009", "message": "> With respect, if you want better colors schemes and better design for your product you could (get ready for the crazy) hire a professional designer.\n\nIndeed, if I personally had control over that aspect of it, I surely would!  (And you may notice designers are in fact listed on /about pages in the trilogy. Or, maybe you didn't.)\n\nThe fact that I'm writing this blog post might be a hint that I don't."}, {"author_name": "Humberto Oliveira", "gravatar_hash": "f13378b101d807e85c09531dd68ce4a7", "author_url": "http://Holiveira.com", "date": "Sep 17, 2009", "message": "Do the same thing Google did when it bought Blogger and redesigned it. \n\nHire some freelance designers to design the first batch of templates, including not only the color scheme but also proper typography settings.\n\nAfter that create a detailed spec demonstrating how to style the Html using pure CSS (assuming of course it's well defined)."}, {"author_name": "Vijay Santhanam", "gravatar_hash": "640b48a0bf5e3cc984bcef7b8db9a0dd", "author_url": "http://vijay.screamingpens.com", "date": "Sep 17, 2009", "message": "\"Indeed, if I personally had control over that aspect of it, I surely would! (And you may notice designers are in fact listed on /about pages in the trilogy. Or, maybe you didn’t.)\n\nThe fact that I’m writing this blog post might be a hint that I don’t.\"\n\nMaybe demand that every stack exchange install requires the use of a designer that SExchange pays for. That sounds worth it to maintain your brand... \n\nmight cost about a grand to get a professionally designed scheme, but you'd recoupe that cost pretty quickly."}, {"author_name": "Lucas Aardvark", "gravatar_hash": "2083165026d11a172ce52453237d294c", "author_url": "http://stackoverflow.com/users/56555/lucas-aardvark", "date": "Sep 17, 2009", "message": "This are the worst color schemes ever (with the exception of Biz Travel (it actually didn't look that bad))."}, {"author_name": "Michael", "gravatar_hash": "002d975b8303c0747aab3bc39bb3c70f", "author_url": null, "date": "Sep 17, 2009", "message": "I'm sorry Jeff, I don't get how you don't have control over this. You want a handful of preset schemes designed for your product.... and your response isn't to pay a designer to do it? Seems like this should be a really easy problem to fix."}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Sep 17, 2009", "message": "http://www.codinghorror.com/blog/archives/001190.html"}, {"author_name": "Alan", "gravatar_hash": "121e5abbf36778568a0f8de2a761d94d", "author_url": "http://alanstorm.com", "date": "Sep 17, 2009", "message": "&gt; Indeed, if I personally had control over \n&gt; that aspect of it, I surely would! \n\nWith the caveat that this is your business/project/whatever and you're free to run it however you see fit --- really? If you don't have control over this, why are you asking your readers to come up with ideas for better color schemes? From the outside looking in it seems like your business partner made a strategic decision that you don't agree with and you're sicking the hordes on him."}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Sep 17, 2009", "message": "Back when Stack Overflow first started, it looked pretty terrible too. I used the \"Stylish\" Firefox extension to do some overrides on the CSS to make it look better. Then I took some screenshots, and threw them up in a question (which was deleted a long time ago) along with my input to Stylish.\n\nWhy not make a question on Meta as a request for proposals for CSS changes? That way, designers show off a screenshot and their CSS overrides, and everyone can vote on which ones they like. They could even adopt the changes for themselves, if they really liked them.\n\n(If you want to be really friendly to the designers, you could publish a list of the classes/ids that you use so that they don't need to go digging through the HTML as much.)"}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Sep 17, 2009", "message": "Forgot to mention that when I put up my proposed changes in that question, most of them were actually implemented."}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Sep 17, 2009", "message": "Also: http://www.popsci.com/scitech/article/2009-09/colorblind-monkeys-recover-sight-gene-therapy"}, {"author_name": "Dave Ward", "gravatar_hash": "755e1277329df9e6b7e6685b21108ee6", "author_url": "http://encosia.com", "date": "Sep 17, 2009", "message": "How about grabbing a few color schemes from something like Kuler (http://kuler.adobe.com/) to use as presets?"}, {"author_name": "macbirdie", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Sep 17, 2009", "message": "Second and fourth color scheme is almost good, but the contrasting colors for unanswered and accepted(?) answers are, frankly, eyeball-poke-out-with-the-pen hideous.\n\nMaybe at least http://www.colorschemedesigner.com/ ? \nThis can give a monochromatic as well as a contrasting color theme."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Sep 17, 2009", "message": "If I was paying from $129 a month to $2500 a month for Stack Exchange then I would expect Fog Creek to stop being such cheapskates and to hire a professional designer to create a decent selection of precanned styles. Somehow 37signals manage to have about three designers on their payroll..."}, {"author_name": "Nick Pierpoint", "gravatar_hash": "6a6e7d806c4445cb14a33e25cdb1163f", "author_url": null, "date": "Sep 18, 2009", "message": "Adobe Kuler is excellent for this sort of thing.\n\nhttp://kuler.adobe.com\n\nIt at least a good starting point that doesn't jar the senses, which would be no end of an improvement on what's there at the moment."}, {"author_name": "Treb", "gravatar_hash": "22b28304599446b3d3aaaf123e7240ff", "author_url": null, "date": "Sep 18, 2009", "message": "While I agree that the colour schemes are horrible (in particular, the violet is rather violent), I think you are all overreacting. \n\nI don't think it's a question of whether or not to hire a professional designer if you want to sell a professional product. It's about priorities, and since most of the people who know about StackExchange are from the community, we can assume that the priorities of potential customers are the same as for most techies: Functionality First, Design Second.\n\nI'm confident that FogCreek will get around to have some nice default colour schemes designed eventually. But right now they have other priorities: Getting the thing to work correctly first. Which I completely agree with."}, {"author_name": "Colonel Sponsz", "gravatar_hash": "cae93d12a6a39d5dc68eadf4cf45e526", "author_url": null, "date": "Sep 18, 2009", "message": "Hire a professional designer.  Any of the good ones I've worked with would be able to do you half a dozen good colour swatches in a week of freelance work, most would be able to write the CSS for them as well."}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Sep 18, 2009", "message": "jQuery UI, ThemeRoller, and a choice of fixed and customizable themes.  Let each user pick their own color scheme."}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Sep 18, 2009", "message": "Note -- I'm not suggesting that you use the jQuery UI code, but rather use their classes, assigned appropriately, which will let you use ThemeRoller themes, making it trivial to get various looks for the web sites and to easily change between them."}, {"author_name": "Aaron Maenpaa", "gravatar_hash": "634329486bd326c395c8b3539c035139", "author_url": "http://crimzon.ath.cx/~aaron", "date": "Sep 18, 2009", "message": "I'm well aware that the default color schemes are a point of contention... but as Treb says it's a matter of priorities. \n\nThe vibe I'm getting is that people who are serious about their StackExchange sites have color schemes in mind. So while, getting to a point where people stop saying \"Arg! The default themes make me want to scratch my eyes out with a fork!\" is on the list, making sure there's chrome so you can change \"What's your programming question?\" to \"What's your question about programming kittens?\" everywhere that you need to is more important.\n\nI kind of agree with the some of the other commenters that I'm not sure a contest is the way to go. We will revisit the default color schemes, how precisely we do that has not been decided. \n\nDon't go start preparing swatches."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Sep 18, 2009", "message": "The BizTalk scheme is good.  Better than MSO and SF schemes, IMHO."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Sep 18, 2009", "message": "by which i mean BizTravel, not BizTalk, of course..."}, {"author_name": "no one", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": null, "date": "Sep 18, 2009", "message": "And SuperUser is better?  wow."}, {"author_name": "Josh Nurczyk", "gravatar_hash": "3020b35c4f9ec8eec59d060626ebf5d2", "author_url": null, "date": "Sep 18, 2009", "message": "I have a very strange idea. How about if you have an HTML mock-up for all the basic colors you have, add a CSS that can be changed to fix the coloring, and make it a contest like the logo design contests?\n\nThe winner gets mentioned as one of the developers in whatever way you do that. Or maybe, pick a top 3 or top 5 and list them all.\n\nI think contests are the best way to do this sort of thing, personally, short of hiring a single designer who may not have the \"vision\" you're looking for."}, {"author_name": "Anon", "gravatar_hash": "28bdd5298558caad2744c8b32ad913c9", "author_url": null, "date": "Sep 18, 2009", "message": "@Dennis:\n\nI'm thinking this: http://www.codinghorror.com/blog/archives/001295.html"}, {"author_name": "John Sheehan", "gravatar_hash": "54b75f6fbf4434162bfcda6b0cb9b86b", "author_url": "https://twitter.com/johnsheehan", "date": "Sep 18, 2009", "message": "@Treb: \"Functionality First, Design Second\" From a UI standpoint, these are the same."}, {"author_name": "Bob", "gravatar_hash": "9b9a000ea1b4f9f9a083a32a3bdd1a0a", "author_url": null, "date": "Sep 18, 2009", "message": "I think the accepted answer check mark should be highlighted much like an upvote is."}, {"author_name": "erickson", "gravatar_hash": "ffbf4e85b8ffbae4e9039b9c0cf07bc8", "author_url": null, "date": "Sep 18, 2009", "message": "Just a note: When I visit meta, I feel like I'm going blind. I'm totally serious. \n\nI spend a lot of time on StackOverflow and I guess that has actually conditioned my brain somewhat. When I see the monochrome, I have this super-weird feeling---I think it's actually a physical sensation---that something something horrible has happened to my vision. I can't wait to get out of there.\n\nI haven't had that sensation on serverfault or superuser. Just the ashen wasteland of meta."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Sep 18, 2009", "message": "ah, just got caught by the \"accepted is not green anymore\" thing. Overall looking at it, it is a good choice though.\n\nI am not a branding or graphics expert, but AFAIK you should reduce the colors as much as possible.\n\nLook at the BizTravel site: You have Orange and Blue as the \"Design Colors\" and White as the background to offset them against. It looks really nice, and then there is that green that just destroys it. I don't know if it's just one color too much or if it's because red/orange and green are at the opposite edges of the spectrum, but i'd use a design which uses either shades of orange or shades of blue as status colors. That way, the design becomes less \"loud\"."}, {"author_name": "Martin", "gravatar_hash": "903d1f6eb1dc53cc0810d9fcec0f3b8a", "author_url": null, "date": "Sep 18, 2009", "message": "Zen Garden style sounds like a good way to go. I agree with those who suggest you maybe pay for a designer to do some templates."}, {"author_name": "Darius A Monsef IV", "gravatar_hash": "073ae21b6a4f50aaff88788f2e9f474e", "author_url": "http://www.COLOURlovers.com", "date": "Sep 18, 2009", "message": "How about we partner up on a fun creative contest?  Have people use COLOURlovers to help create great styles?\n\nWe also have a public API that you might be able to build into your theme settings and let people import palettes right in to work from.\n\nhttp://www.colourlovers.com/api\n\n\nCheers,\n+D\n----\nDarius A Monsef IV\nFounder | www.COLOURlovers.com\ntw: @dariusmonsef\n----"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Sep 18, 2009", "message": "Ugh, I need to go find that posting and fix it: my grammar needs work.\n\nAnyway, to my mind, the lack of willingness to hire a designer signifies a lack of confidence in the product. It really looks like there's some doubt they'll be able to sell many of these."}, {"author_name": "Brad Gilbert", "gravatar_hash": "6a81b9b2f0280da70b19d2dddcd8dc03", "author_url": "http://b2gills.blogspot.com", "date": "Sep 18, 2009", "message": "Do you want a radiator with that manifold? ( I think you meant many-fold )"}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Sep 19, 2009", "message": "@Anon: I think the positive side of the digital sharecropper idea fits the question and answer aspect of SO, etc., but not the design of SE (which would fit the negative side of digital sharecropping).\n\nOff-topic: I want a captcha system that only allows posting if you *are* a bot. ;-)"}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Sep 19, 2009", "message": "@Brad Gilbert : Better off an air filter :P"}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Sep 19, 2009", "message": "@Brad Gilbert:\n\nhttp://www.google.com/search?q=define%3Amanifold says:\n\n&gt; many and varied; having many features or forms; \"manifold reasons\"; \"our manifold failings\"; \"manifold intelligence\"\n\nNormally I wouldn't jump in, but I hate seeing people falsely accused of crimes against the language. :P"}, {"author_name": "Tony", "gravatar_hash": "886427a445a180eb6618d77ee4ec4894", "author_url": "http://Freehostingwithsitebuilder.com", "date": "Sep 19, 2009", "message": "- Put up some good color themes on the stackexchange site so the \"color blind\" user can choose one.\n\n- Users can user a color wheel or one of the color suggestion site."}, {"author_name": "Scott W.", "gravatar_hash": "7a03f436e9458527368e5eaa45f85d40", "author_url": "http://moms4mom.com/", "date": "Sep 20, 2009", "message": "I guess Tammy and I are glad that our StackExchange site (http://moms4mom.com/) didn't get put on this list.  She did a good job picking the colors I guess.\n\nI suggest that everyone check out two websites for help (if you're color-blind like me):\n\n - http://kuler.adobe.com/\n - http://colorschemedesigner.com/"}, {"author_name": "Kost", "gravatar_hash": "335fc20f7203bda8fdcd109410ad1683", "author_url": null, "date": "Sep 21, 2009", "message": "Maybe it's just me, but I think for that price, you can afford a designer that will work with the client when building their site."}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Sep 21, 2009", "message": "To add to the list of options, http://www.colorschemer.com/schemes/ is worth browsing through for some color schemes.\n\nBut, to add to the chorus, hiring one or two designers to deal with that part of StackExchange would probably resolve a lot of those issues. Or at the very least, hire a couple freelancers to create the initial template pack and let those who have a particular scheme in mind implement what they want."}, {"author_name": "Scott W.", "gravatar_hash": "7a03f436e9458527368e5eaa45f85d40", "author_url": "http://moms4mom.com/", "date": "Sep 21, 2009", "message": "@AnonJr: we had the benefit of my sister, who is a recent design graduate.  She was able to help us tweak the colors.  I definitely recommend hiring a designer as well (or calling in a favor)."}, {"author_name": "warren", "gravatar_hash": "236948f12dbe8789edb8238298c61593", "author_url": "http://antipaucity.com", "date": "Sep 21, 2009", "message": "Curious - why don't you let the account holder select their own colors in a control panel where they can edit foreground, background, accepted, favorite, upvote, downvote, and bounty questions?\n\nI mean, storing 7 hex values in a table somewhere and loading them souldn't be *that* hard :)"}, {"author_name": "Scott W.", "gravatar_hash": "7a03f436e9458527368e5eaa45f85d40", "author_url": "http://moms4mom.com/", "date": "Sep 22, 2009", "message": "@warren: Actually, there is a \"custom\" style that lets you do exactly that.  We did that for moms4mom, but then we still had to mess with some CSS to really get it to look \"right\".  The software takes those 6 colors and actually takes variations of them for different things (darker or lighter variations).  Sometimes the contrast was wrong, or the choice just didn't work right."}, {"author_name": "Martin", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Sep 22, 2009", "message": "\"Now, I’m not saying that our trilogy color schemes are perfect — far from it\"\n\nVery far from it.\n\nAnd the decision to remove the 'green for accepted' - the mind boggles.  Yeah it may be more minimalist now.  However, usability has suffered."}, {"author_name": "gamecat", "gravatar_hash": "0b4b433679e1fb52f7e2ef4ea492496d", "author_url": null, "date": "Sep 28, 2009", "message": "Just FYI: http://tech.slashdot.org/story/09/09/27/2127259/StackOverflow-For-Any-Topic.\n\nAlways fun to read what other people think."}, {"author_name": "eyelidlessness", "gravatar_hash": "af83d13281fbdd223b1d6ec8175c16a2", "author_url": null, "date": "Oct 01, 2009", "message": "lcars"}]}