{"response": [{"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 04, 2009", "message": "OK, seems to be up and working -- there is balance in the server force!"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Sep 04, 2009", "message": "Your service seems to be able to transfer bits up to a volcanic island."}, {"author_name": "d03boy", "gravatar_hash": "f22989906d98bcccf76f16fcf33d7c08", "author_url": "http://codertips.com", "date": "Sep 04, 2009", "message": "Is this comment balanced or is it only the non blog. stuff."}, {"author_name": "Willy Tarreau", "gravatar_hash": "270fc727ce4a5ba24d9710504615b3f8", "author_url": "http://haproxy.1wt.eu/", "date": "Sep 04, 2009", "message": "It's not optimal to load-balance on the source IP. Either you don't need the user to always hit the same server, and you should use round-robin which does a better job, or you want a user to stay on the same server and you should enable persistence cookies, because source IP is only stable for most users, not all (many people browse through load-balanced proxy farms)."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Sep 05, 2009", "message": "@Willy: I guess the benefit is if you don't *have* to go back to the same server, but it's *preferable*. So for the majority case, you get whatever benefit it is you derive from being on the same server, and in the minority case you still work."}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Sep 05, 2009", "message": "Does this mean there's a Linux or BSD machine in the stackoverflow cluster now?"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Sep 05, 2009", "message": "To follow up on what Jon Skeet said: From the last podcast, because SO no longer relies on the session state for anything, so there is now no *need* to go back to the same server.  However, caching issues make it preferable to go back to the same server if possible for performance reasons.  My guess is that the performance hit from having users browsing from behind a proxy isn't significant enough to justify any more complicated methods for keeping these users on the same server."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 05, 2009", "message": "> Does this mean there’s a Linux or BSD machine in the stackoverflow cluster now?\n\nWe have several Linux VMs, absolutely!\n\n> However, caching issues make it preferable to go back to the same server if possible for performance reasons\n\nThat's right -- say you're browsing questions tagged [java] [swing] [jpanel]. That id list is cached on the first server you hit. If your subsequent hit went to a <i>different</i> server, it would have to run the query again to get the id list and then cache it there.\n\nThis is a (relatively minor, in our case) problem that's solved with stuff like Velocity and memcached but we're not there yet."}, {"author_name": "Willy Tarreau", "gravatar_hash": "270fc727ce4a5ba24d9710504615b3f8", "author_url": "http://haproxy.1wt.eu/", "date": "Sep 06, 2009", "message": "@Chris: OK I get it, but rest assured that enabling cookie-based persistence has nothing complicated. You just have to add a line \"cookie SID insert indirect\" in your config and you're done. But as long as source-hash is well\nbalanced enough, you don't need to change."}, {"author_name": "Stu Thompson", "gravatar_hash": "428344688dc21d72a3723d94bed66680", "author_url": "http://www.dietpizza.ch/geekomatic", "date": "Sep 07, 2009", "message": "No MSO for me, at the moment.  Not sure if it is related to all of this.  The IP pings, rest of sites work."}, {"author_name": "himanshu", "gravatar_hash": "f776b291530526ab14bc3d31575eb311", "author_url": null, "date": "Sep 07, 2009", "message": "Hi guys,\n  I loved this site. It is unbelievable that whenever I asked a question, the answer is ready in couple of hours. Sometimes many answers with great explanation. \n\nThanks"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Sep 07, 2009", "message": "@himanshu: You have to wait a couple of hours? I do apologise. We'll try harder :)\n\n(Seriously, look at http://hewgill.com/~greg/stackoverflow/stats.html - the \"time to best answer\" graph shows that most questions are answered \"well\" extremely quickly.)\n\nJon"}, {"author_name": "Sam", "gravatar_hash": "fe24cd0eaa2ff78a42b265fafec55565", "author_url": null, "date": "Sep 07, 2009", "message": "meta is down for me as of 8:30 EST, Monday morning."}, {"author_name": "Stu Thompson", "gravatar_hash": "428344688dc21d72a3723d94bed66680", "author_url": "http://www.dietpizza.ch/geekomatic", "date": "Sep 07, 2009", "message": "Back up for me"}, {"author_name": "Alistair", "gravatar_hash": "438c91736f20d0821c7a358ee8b00790", "author_url": "http://stackoverflow.com/users/379/geocoin", "date": "Sep 07, 2009", "message": "I have all sites *except* meta... so a little hard to report to meta..."}, {"author_name": "Sam", "gravatar_hash": "fe24cd0eaa2ff78a42b265fafec55565", "author_url": null, "date": "Sep 07, 2009", "message": "Yeah, back up for me, too.\n\n(captcha: jumbo president)"}, {"author_name": "Jesse Hartwick", "gravatar_hash": "cfd1684ea3df74d506f58377b6da5a72", "author_url": "http://www,appscanadian.ca", "date": "Sep 07, 2009", "message": "@JonSkeet\n\nThe 'time to best answer' graph is interesting, but I think it would be more accurate if it went based on highest voted answer instead (perhaps only in the circumstance that there is no accepted answer).\n\nAs it stands right now, it seems a bit like a biased sample. I would assume that a lot of people closely monitor their questions nearer to the time they ask the question, and so they are more likely to accept an answer if it's offered quickly. There could be many questions that aren't answered 'well' (according to the questioner's criteria) until much later, but the questioner has long since stopped following the question.\n\nI know you didn't make the graph, I'm just offering an opinion."}, {"author_name": "Tom Kamin", "gravatar_hash": "8a17d0d0d8bdf6a8d527bbc943a17cf8", "author_url": null, "date": "Sep 08, 2009", "message": "@Sam: Taft?"}, {"author_name": "Frank", "gravatar_hash": "edc65c843784b9007cec4da502a74bed", "author_url": null, "date": "Sep 14, 2009", "message": "On the subject of load balancing, why not get the highest availability while not getting caught in high prices? Kemp’s got some great load balancers that are low priced and high in quality:\n\nhttp://www.kemptechnologies.com/?utm_source=blog&amp;utm_medium=pv&amp;utm_content=zs&amp;utm_campaign=home"}, {"author_name": "Malcolm", "gravatar_hash": "fa9bbf569885af2c9098ea007e78a94b", "author_url": "http://www.loadbalancer.org/", "date": "Oct 03, 2009", "message": "Glad to see someone else using HAProxy for <a href=\"http://www.loadbalancing.org/\" rel=\"nofollow\">load balancing</a>, Willy has done a great job. Just out of interest how do you make your application stateless? Are both servers connected to a single backend database or backend file store?\nPs. You may want to remove the spam from Kemp Technologies, he says even though I snuck in a link to my own site ;-)."}]}