{"response": [{"author_name": "Itay Maman", "gravatar_hash": "9420b13f41ea0c28b268d819209069a9", "author_url": "http://javadots.blogspot.com/", "date": "Sep 18, 2009", "message": "\"If I'm programming, the chances that I actually know how to do what I have to do are just becoming slimmer and slimmer the more times go on\" - I think this is a very true, and sad, statement.\n\nI believe that despite all the great libraries/technologies we can use today, ultimately, when we need to adapt it to our app we still use the same old tools as the old days: loops, ifs, function calls, etc. (or the equivalent of these in functional programming or whatever other paradigm)\n\nThus, most of the developer's effort goes into these decades old technique and thus we are still not programming any faster (and in most cases: slower, because we have to learn the new technologies)."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Sep 18, 2009", "message": "Jeff, yo dawgg, I heard you got the flu, hope you get better soon!"}, {"author_name": "17 of 26", "gravatar_hash": "76492f656f71a17775b368e87395b15b", "author_url": "http://17of26.com", "date": "Sep 18, 2009", "message": "The auto-assigned IP on Windows that Joel was talking about is 169.*.*.*"}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Sep 18, 2009", "message": "Rock Band: Beatles may not have Charles Manson in it, but if Joel really wants to have an inappropriate Music Game/Person coupling, get Guitar Hero 5, featuring Kurt Cobain."}, {"author_name": "Nathan", "gravatar_hash": "ec2b04ac1bad14fea8244a78ef0f2133", "author_url": null, "date": "Sep 18, 2009", "message": "Matthew Podwysocki wrote a post about the \n\"Anti For Loop Campaign\" I thought it was super interesting, and realized how much cleaner my code could be using LINQ syntax instead of a foreach.\n\n\nhttp://codebetter.com/blogs/matthew.podwysocki/archive/2009/06/26/the-anti-for-campaign.aspx"}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Sep 18, 2009", "message": "Pointers and registers are not ancient technology. Not all programming is targeted at the web browser.\n\nSome of us still write operating systems and compilers so that the rest of you don't hurt your brains."}, {"author_name": "Murali Suriar", "gravatar_hash": "085bfa9c259fb798a61d72c5e5a9989a", "author_url": null, "date": "Sep 18, 2009", "message": "17 of 16: not quite. The IP address range reserved for auto-assigned link-local IPv4 addresses is 169.254.*.* (or 169.254/16). See RFC 3927 (http://www.faqs.org/rfcs/rfc3927.html) for details.\n\nRegarding Joel's question as to why it's useful - automatic address assignment was useful for the 'home' use case, where someone would put a bunch of Windows machines together on a LAN and would like them to simply discover eachother and work, without requiring any configuration or DHCP/DNS infrastructure. Automatically assigned addressing combined with NetBIOS discovery would allow this to happen. Zeroconf (a.k.a. Bonjour/Avahi) is the extension of this concept from machine discovery to service discovery: http://en.wikipedia.org/wiki/Zeroconf\n\nI'm confused by the problem Joel described with multiple NICs being registered in Active Directory's DNS structure. As he mentioned, in order for a NIC to 'choose' a link-local address, it must have attempted to obtain a dynamic address and failed. Why would this have happened in the case that your second NIC was unused? If left disconnected, the OS would never have considered the interface live or tried to obtain a dynamic address. Was the unused NIC plugged into a switch/hub that wasn't connected to the rest of the network?"}, {"author_name": "romandas", "gravatar_hash": "812cac3d389b39d59bab4d75f02c73f0", "author_url": null, "date": "Sep 18, 2009", "message": "This may have been asked before, but Jeff, is it possible to have an additional RSS feed that contains ALL the podcast episodes instead of the latest 10? I was offline for awhile, so I've missed out on some of the episodes, unless I go and download them separately -- and iTunes doesn't handle importing them (into the proper podcast) very well.\n\nPlease? :)"}, {"author_name": "Conchubhar", "gravatar_hash": "6846cd06346578e42de7fbb4dbace064", "author_url": null, "date": "Sep 19, 2009", "message": "Way better than DNSStuff is:\n\nhttp://www.intodns.com/stackoverflow.com"}, {"author_name": "RickMeasham", "gravatar_hash": "a2b6201ff4b1b6cd94114b733a0c2977", "author_url": "http://geek-herding.com/", "date": "Sep 19, 2009", "message": "I finally got sick of yelling at my radio when I'm listening to the podcast and put my thoughts into words. Hope it's not bad form to post this as a comment to the podcast post.\n\n\n    Dear Joel and Jeff,\n\n    You lauched Server Fault for SysAdmins, but you admit to not knowing that crowd as well as you know the programming crowd. That’s fine. But you need to find someone who does understand that crowd — and preferably already has the credibility you two have with programmers. Then you need to get him (or her) to co-host the podcast.\n\n    At the moment, your podcast does you no favours in promoting Server Fault: You constantly show little understanding of such things. The entire argument on hosting your own DNS on the most recent podcast is a perfect example.\n\n    I’m sure nobody minds if you don’t know everything, but to gain credibility for Server Fault, it needs a ’sponsor’ that can join your team — at least on the podcast.\n\n    Cheers!\n    Rick Measham"}, {"author_name": "Mattias Lundmark", "gravatar_hash": "5d91fbab8aaae05f648ab9c60ebf215b", "author_url": "http://www.webusability.se/blog/", "date": "Sep 19, 2009", "message": "Is it just me that thinks that \"one-handed programming\" sounds a little... suspect? ;) I get all kinds of weird images in my head. Oh, it was just me then? Nevermind."}, {"author_name": "russ", "gravatar_hash": "fb8f14461d037d601087c32f9fa9fea5", "author_url": "http://tinisles.blogspot.com", "date": "Sep 20, 2009", "message": "@JeffAtwood - out of curiosity: which SMTP server are you using for the notification emails coming from stackoverflow?"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Sep 20, 2009", "message": "\"and meta is running on that machine, so we have a lot of junk running on there\"\n\nMeta is not junk!! :P"}, {"author_name": "Kyle York", "gravatar_hash": "344a0b4a55e96886cf71985a7df1396b", "author_url": "http://dyn.com", "date": "Sep 24, 2009", "message": "Thanks for talking about the importance of DNS and choosing our Dynect Platform. Check out the troubleshooting site the people at Dyn Inc. built over a weekend! http://dnscog.com"}]}