{"response": [{"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "Sep 30, 2009", "message": "I really need to get a podcast-capable music player."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Sep 30, 2009", "message": "I think one of the ways web programming is special is that it's massively concurrent."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Sep 30, 2009", "message": "On \"fat\" computer books... this certainly does happen, but there's a backlash against it as well. I've had loads of people who like the fact that C# in Depth is slim, and have even said that they won't buy the second edition if it goes over 500 pages.\n\nI'm like that myself, too - I really don't like starting a massive tome. Apart from anything else, it's hugely daunting."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Sep 30, 2009", "message": "I agree with that guy who has a lot of rep, all the best computer books I have are relatively skinny:\n\nk&amp;r\njavascript: TGP\nlittle schemer\npragprog\n\nI would much rather re-read a concise book (where each and every word is there for a reason), rather then read a book with tons of fluff."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Sep 30, 2009", "message": "C++ in a Nutshell = 704 pages, ok C++ is a complex language but SQL in a Nutshell is 600pages!\nProgramming python is now so big (1600pages) that even a python can't swallow it!\n\nK+R C is &lt;250 pages so well done Jon."}, {"author_name": "TJB", "gravatar_hash": "20e04754409abe97cca30b5cda369fcc", "author_url": "http://stackoverflow.com/users/37207/tjb", "date": "Sep 30, 2009", "message": "@Joel\nMy preferred coding environment is EXACTLY THE SAME.  If I can queue up a re-run of a TV show on the TV while I'm coding @ home, its about the perfect ambiance.  I'll take that as a sign that I'll end up as an industry leader in the future."}, {"author_name": "Dave", "gravatar_hash": "5e7f3786880324d07be3bb7e42d516ef", "author_url": null, "date": "Sep 30, 2009", "message": "I wish Coders at Work was offered as an audio book. Imagine hearing the actual interviews (edited of course). I would gladly pay the book price for the audio version to be able to listen to it many times in the car."}, {"author_name": "Amadiere", "gravatar_hash": "6c0b8eb63403dade08c2446febdf88f5", "author_url": "http://www.amadiere.com/blog", "date": "Sep 30, 2009", "message": "Side topic. What's the process for blogs appearing on iTunes? Is it an XML feed that apple follow so I can subscribe to it? I'm basically asking because #69 on there. It's ideal for listening to on my iPhone that route. :)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Oct 01, 2009", "message": "@Amadiere: I've subscribed to the podcast in iTunes via ITConversations:\n\nhttp://rss.conversationsnetwork.org/series/stackoverflow.xml\n\n(Or go to http://itc.conversationsnetwork.org/shows/detail4253.html and click on the iTunes link.)"}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Oct 01, 2009", "message": "@Jon Skeet, for me it's not the size of the book that's important but the ratio of usefull information to pages.\n\nI like densly packed books that contain allot of to the point info, if they can be slim and comprehensive that's a bonus, but if they can't be slim and comprehensive at the same time, I prefer comprehensibe (I guess that pretty much rulles out starter books)\n\n@Jeff and Joel,\n\nConcurent programing brings back programing at the level it should be (not anyone that can paint applications all day in a designer can do it), it brings it back to the hard level that requires mental effort and dedication.\n\nSingle threaded programing in any language is the VB programing of new age (simple and anyone can do it), multi threaded programing is where the programmers are set apart nowadays."}, {"author_name": "Roboprog", "gravatar_hash": "1bc2471f5a97b66082c3522697078ef7", "author_url": "http://roboprogs.com", "date": "Oct 01, 2009", "message": "@Pop:\n\nWow, that's harsh (and I thought I was tough).  Why can't programming be a \"ramp\" instead of a \"cliff\"?\n\nLike I feel about job request forms, if your programming environment takes 3 to 5 years to learn, something is wrong with it (or you hire really dumb programmers:-))."}, {"author_name": "Amadiere", "gravatar_hash": "6c0b8eb63403dade08c2446febdf88f5", "author_url": "http://www.amadiere.com/blog/", "date": "Oct 01, 2009", "message": "@JonSkeet - thanks for that! Hopefully that'll be around much quicker than the normal one. I do feel a touch silly for not heeding the words \"a great front end for iTunes\". :P"}, {"author_name": "Chris Barry", "gravatar_hash": "475ad7c536c1b9d3cd48825ec1b2cd42", "author_url": "http://noneasyet", "date": "Oct 02, 2009", "message": "Hey,\n\nI would say that it is quite important to choose music that will be productive to your own mind.\n\nPersonally I have found these albums to be productive to work to, kind of ranked in order of effectiveness, although this may just be the way my mind is wired.\n\nIt would be interesting to find out if there was an album of music that could be compile which was considered \"programming friendly\". In fact, if there was any interest in such a think I would be personally up for \"compiling\" it.\n\n1. Selected Ambient Works, Vol 1 - Aphex Twin\n2. Moon Safari - Air + others\n3. Rounds - Four Tet\n4. Parts of the Amelie Soundtrack - Yann Tiersen\n\nIf anyone thinks there could be an interesting play list put together, write back here.\n\nIf you don't know this music I highly recommend it.\n\nCB"}, {"author_name": "Doug T", "gravatar_hash": "5e6a5609f06b0498d8b7b56fe2ba03ab", "author_url": null, "date": "Oct 02, 2009", "message": "I disagree with Joel and Jeff's mindset of the \"all programming is web programming\" and \"we don't have technical problems, we have social problems\". Its a narrow view based upon the idea that the distributor of the software ultimately can control, and change at any time, the target hardware running that software. Sure this is almost always true in web programming, but for a very large set of software this is not the case.\n\nThe exception stated in the podcast of \"games programming\" is only one of dozens of exceptions. Anytime you distribute some piece of software that has to run on hardware you don't control, the assertion that you can just \"throw more hardware\" at the problem and can therefore think less about technical issues is incorrect. Examples of these situations includes (1) the infrastructure of your web server and everyone's PC/gizmo/whatever (operating system, web server, database, interpreters/compilers, etc) (2) product/embedded development -- your code you write now has to work on customer equipment sold to them years ago (sometimes decades ago). No one is going to fly an F16 using a web app. (3) desktop software -- still alive-and-well. You need to run on an acceptable set of the PC's out there in the world.\n\nOf these cases, cases (1) and (2) have not shrunk due to the introduction of the web. If anything, we have more gizmos than ever. I'd be willing to assert that we have more kinds of platforms than ever. Maybe (3) has lost some ground due to the web, but I'm certain I have at least as many desktop programs installed on my PC now as I did in 1999.\n\nI think its more accurate to say that programming has much more variety than at any time in the past. You have people making a very good living at every level of abstraction (from assembly up to php) each person doing something very different and interesting. I think this is exciting, and it seems to only get more varied and interesting."}, {"author_name": "sheepsimulator", "gravatar_hash": "751c02390a5ff96c759e6a386180616b", "author_url": null, "date": "Oct 02, 2009", "message": "@Doug T - Embedded programming (eg, microcontrollers in toasters) works the same way.    (Virtually) All toasters are not web-enabled  Embedded programming has a lot to do with the hardware platform too, and limitations placed upon it to meet a price point.\n\nIt's very easy to become accustomed to thinking that the type of software product you produce = all software that everyone produces.  If we find ourselves with that tunnel vision, it would probably be beneficial to talk with programmers that do other lines of work. :)"}, {"author_name": "Doug T", "gravatar_hash": "5e6a5609f06b0498d8b7b56fe2ba03ab", "author_url": null, "date": "Oct 02, 2009", "message": "@sheepsimulator \n\nI think that's part of it. I think also Jeff/Joel often state things without qualifiers that should be qualified. Stating \"much more programming is social programming\" may be accurate. Stating \"all programming is now social programming\" means that the guy writing software for my Garmin is no longer a programmer and gets people like me excited.\n\nBut maybe reading the \"qualified\" Joel on Software wouldn't be as good :)"}, {"author_name": "Phenwoods", "gravatar_hash": "a451360b0491f2d36d975f703e95c9a9", "author_url": null, "date": "Oct 04, 2009", "message": "So this is where the F16 quote came from. Why does Jeff reply to it on Twitter, but not here?\n\nAnyway, I have not listened to the podcast yet, but if it's anything like the recent Coding Horror: \"All Programming is Web Programming\", I'd have to agree with Doug T. \n\nI think the problem is that embedded software is effectively invisible to most users, including it would seem Jeff &amp; Joel, so it's a case of out of sight out of mind. Hence there dismissed as \"minority and specialty applications.\". I suspect the reality is that desktop / web apps are the minority."}, {"author_name": "Rytmis", "gravatar_hash": "3606c9163c6842aff3827a609fa4e217", "author_url": "http://blog.rytmis.net", "date": "Oct 05, 2009", "message": "IIRC, the Peopleware study had the test subjects implementing a piece of code that did a bunch of calculations given an input number. According to the book, everybody got the program right, but the ones that didn't listen to music were more likely to notice, that all the operations canceled out -- an equally valid program would have just returned the input number."}, {"author_name": "Brandon", "gravatar_hash": "628e4da24367a0e53891218aeef58a14", "author_url": null, "date": "Oct 07, 2009", "message": "This interview was awful. I don't know if Mr. Seibel was nervous or something but the halting speech combined with the fact that I'm pretty sure he's drinking a Slurpee throughout the podcast made this really difficult to listen to."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 07, 2009", "message": "I agree that the audio quality was seriously problematic. Network connection issues to Joel. :("}, {"author_name": "TomA", "gravatar_hash": "d6fb3e436ce94206550908d76931e121", "author_url": "http://www.catnapgames.com", "date": "Oct 13, 2009", "message": "Another interview with famous programmers:\n\nhttp://www.stifflog.com/2006/10/16/stiff-asks-great-programmers-answer/\n\nAnswers from Linus Torvalds, Dave Thomas, David Heinemeier Hansson, Steve Yegge, Peter Norvig, Guido Van Rossum, Bjarne Stroustrup, James Gosling, Tim Bray."}, {"author_name": "Rohan Cragg", "gravatar_hash": "6004e8992a77c769a60c79f7aa6415aa", "author_url": "http://rohancragg.co.uk", "date": "Oct 15, 2009", "message": "In the chapter \"Get in your Right Mind: Cultivating Rich-mode processes\" of the book \"Pragmatic Thinking and Learning: Refactor Your Wetware\", Andy Hunt summarizes the congitive science surrouding how you need to 'distract' the L-mode of you brain in order to enable the R-mode of your brain to work best (or at least let you more easily tap into it's functioning).\n\nCould be related to the whole 'music while programming' topic?\n\nhttp://www.pragprog.com/titles/ahptl/pragmatic-thinking-and-learning"}, {"author_name": "Stu", "gravatar_hash": "1b72849488a30c948c2e3fa42f56216e", "author_url": null, "date": "Oct 20, 2009", "message": "On the topic of listening to music and general distractions while programming, this article talks about a recent study on multi-tasking from Stanford:\n\nhttp://www.news.com.au/story/0,23599,25983490-2,00.html"}, {"author_name": "Tarek Demiati", "gravatar_hash": "ac4d7d7c9f09a4256242946b98facce6", "author_url": null, "date": "Oct 23, 2009", "message": "\"...A routine...\", last time I've heard this word instead of function must have been two decades ago, during the golden era of the Commodore 64 demo scene :-)\n\nWhen we were all spoty cocky teenagers boasting stuffs like : \"My plot routine is 3 cycles less than yours!\"\n\nI will check out Coders at Work for programming history sake so I can feel a bit nostalgic about the olden days where you were cutting code close to the metal in machine language, the closest stuffs we had to modern API were \"ROM Routine\" that you would call to do certain stuffs, such as clearing the screen, initializing the disk drive ..."}, {"author_name": "Steve Wortham", "gravatar_hash": "7c4d1e4f8701946b8391d009d8d85221", "author_url": "http://regexhero.net/", "date": "Jan 15, 2010", "message": "More thoughts on music:\n\nI'm pretty much forced to drown out chatter somehow so I too listen to music while programming.  However, I've definitely found that lyrics are distracting for me (almost as distracting as office chatter).  So if I listen to instrumental music or music in another language then it's not so distracting."}]}