{"response": [{"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Sep 10, 2009", "message": "I don't often disagree with Joel, but in this case I think that he was way off the mark in his criticism of Craigslist. The reason why Craigslist is so dominant is precisely because it's free - if they start charging not only will they drive away 95% of the posters, but there will be massive growth of online classifieds that provide the same service and undercut Craigslist on price.\n\nIn other words, the existence of free online classifieds isn't due to Craigslist's generosity so much as a byproduct of the ubiquity of the internet. Fifty years ago you had to have a printing press (which the newspapers had) to publish classifieds. Now all you need is a website which can be set up, run, and maintained for a fraction of the cost.\n\nAnd why is it so hard to find people willing to pay the actual cost of a newspaper? Public radio and television seem to be able to finance their operations on donations alone, why can't newspapers do the same?"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Sep 10, 2009", "message": "I think Jeff and Joel radically underestimate how much useful information one can type in 30 seconds... and how occasionally it's useful to be able to respond to multiple answers with one comment each in quick succession.\n\nI get bitten by the 30 second comment limit most days :("}, {"author_name": "Espen Herseth Halvorsen", "gravatar_hash": "ebd2c5e2b2e583b6934435f5f648dc30", "author_url": "http://espenhh.com", "date": "Sep 10, 2009", "message": "Hey jeff,\n\nI just wanted to mention that a friend from a company that i hope to join (I am currently a student) mentioned yout site in a presentation about how companies should do \\enterprice 2.0\\ =)\n\nLove the overflow, lots of quesions of mine answered =)\n\nThanks :)"}, {"author_name": "Mike Stone", "gravatar_hash": "c8ba7ccacc70a7b826184e8d717bfcd7", "author_url": "http://smellsblue.blogspot.com", "date": "Sep 10, 2009", "message": "My response to the Craig's List affair: http://smellsblue.blogspot.com/2009/09/why-newspapers-can-go-away.html"}, {"author_name": "Sam Howley", "gravatar_hash": "9d3aaf576df27743d3abc7f3a7537c49", "author_url": "http://www.querycell.com", "date": "Sep 10, 2009", "message": "You might want to continue with your first inclination and use the name Burma not Myanmar.\n\nThe name change was a marketing ploy by the illegitimate military rulers.  Many governments and opposition leaders don't recognise the name change.\n\nIf 'Burma' springs to mind, stick with it."}, {"author_name": "Brooks Moses", "gravatar_hash": "361baa67583dc1033f2f3b3c97761c2c", "author_url": "http://notes.dpdx.net", "date": "Sep 10, 2009", "message": "The idea of an app for starting sessions on time reminds me of how the American Physical Society (APS) runs their large conferences -- which are an entertaining madhouse of about 20 programming tracks, in which talks last ten minutes, followed by two minutes for questions, and one minute breaks for people to change rooms.  The way they make this all work is to take over a channel of the hotel's closed-circuit television system to show a synchronized timer on TVs in each conference room.  It's just a single-color screen -- green for the first eight minutes of the talk, yellow for the last two, red for the question period, and gray for the changeover -- with a MM:SS display of the time remaining in large white Helvetica on top of it.\n\nI don't really know what sort of thing you're looking for, but it seems to work pretty well for that use-case.  The bright red screen is, in particular, rather effective for getting the audience to side with the moderator when someone's running overtime and needs to be pulled off the stage."}, {"author_name": "Ilari", "gravatar_hash": "91158719fabe7385df1f177f1bd79b91", "author_url": "http://iki.fi/ilari.kajaste", "date": "Sep 11, 2009", "message": "Joel, whoa, way to take capitalism to the heart - and then some! There's something seriously twisted in thinking that providing a free service might actually be misusing its \"potential value\".\n\nNote that I'm not saying the concept is not valid. Even if I disagree with how much effect craigslist has had on reducing the commercial potential of newspapers, the logic Joel presented is, in a sense, quite solid. Of course even a free service does, in theory, have \"potential value\". But to talk about that potential being misused when not monetized and used for charity to help humankind... Well, at least from my viewpoint, that whole argument is twisted in so many dimensions it actually manages to open a quantum hole into a parallel world, where there's only abstractions of different dependence values floating around, where all concepts are reducded only to their potential for adjusting the international currency trade, and the ways in which it can be used to affect the world. And that place is a really, really ugly place to look at.\n\nOf course, as beauty, so is ugliness in the eye of the beholder. Joel might well disagree with me - maybe that world has some strange abstract beauty to him. But I do hope he at least acknowledges that there are other world views - even those that value trade and making profit and whatnot - where his logic simply breaks right in the beginning with a segmentation fault."}, {"author_name": "ps", "gravatar_hash": "26e416687afebf2f58f72b2fcd7e9761", "author_url": null, "date": "Sep 11, 2009", "message": "It's weird that Joel went after Craig Newmark for not monetizing Craigslist because of the destruction of newspapers, and now the US has no way of exposing corruption in our government.  Craig is actually on the board of the Sunlight Foundation (http://www.sunlightfoundation.com/) whose goal is to increase transparency in government through tracking and \"watchdogging.\" \n\nI agree spam is a huge problem on CL, though.  I think someone will come along and make a site that charges a nominal amount and as a result has less spam.  There's no guarantee that that person will be a philanthropist. \n\nThere's something to be said for having a \"lifestyle\" business.  If Craig monetized CL, his company might become someplace he didn't like anymore."}, {"author_name": "David", "gravatar_hash": "7750878f37a0217d92c9a9f794d8d83a", "author_url": null, "date": "Sep 11, 2009", "message": "Jeff - to remove the confusion in my question.. so HAproxy just distributes the requests, whereas if you used varnish/squid it would distribute the requests AND cache the content, before the requests ever hit the backend servers. Obviously now you have 2 servers, having one cache server in front would avoid you having to cache twice (once on each machine). If you use something like varnish you can easily invalidate the cache when something changes and just set the cache time to something really high (I use 6 hours on doctype!). As we have a logical object model it's quite easy to invalidate the cache, question changes? - wipe the cache. \n\nI guess that was more my question, varnish/squid can cache everything once and load balance, haproxy just load balances and then each machine has to cache. \n\nAlso, Facebook use shared caching heavily - they are the worlds biggest users of memcached! http://www.facebook.com/note.php?note_id=39391378919"}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://pro.robspages.net", "date": "Sep 11, 2009", "message": "This is the second week in a row that the podcast has touched on a Business of Software site. Just do it already\nhttp://meta.stackoverflow.com/questions/19501/new-hero-for-the-league-of-justice-business-of-software-man"}, {"author_name": "Jon Smock", "gravatar_hash": "7cf5af9e0f94976adae00ce7dfdd467b", "author_url": "http://jonsmock.com", "date": "Sep 11, 2009", "message": "Joel's thought is very provoking, but there definitely needs to be pushback.\n\nI would definitely like to see millions (or more) go to curing diseases, fighting poverty, etc.  It really needs to happen, and we need to take responsibility for it.\n\nBut, to say Craigslist needs to do it or to say that their \"cause\" is a lesser cause might be a little hasty.  I don't think the value is completely disappearing here.  Rather, I think it's dissipated across the entire economy, and everyone benefits.\n\n1) There is less waste.  Some things that aren't worth money can be exchanged on Craigslist precisely because it's free to do so.  Otherwise it wouldn't be worth the classified ad and would be tossed into a landfill.\n\n2) The money saved on each classified ad goes into *someone's* pocket (the individuals who exchange goods).  That money disseminates through the economy and boosts our overall productivity as a nation.  This is very macro-level thinking, but it's got to be true, right?\n\nAnd more.  But, thinking about the potential to charge and use that revenue for more focused good is definitely a necessary decision to make (don't just default by inaction)."}, {"author_name": "aka", "gravatar_hash": "89ac58224f2110214cf4d83b679c1a34", "author_url": "http://thedruid.co.uk", "date": "Sep 11, 2009", "message": "The spam *is* the cost of doing business with craigslist.  I think you'll find it will take a surprising amount of spam for people to stop using craigslist.\n\nIt's like email in that regard.  And replacing it with a for-pay version will be as effective as replacing email with a for-pay version."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Sep 11, 2009", "message": "Wow, for once I think Jeff is 100% right and Joel is 100% wrong on one of their arguments.  That doesn't usually happen.  The newspaper business model continues to make less and less sense in an internet-based society.  To say that newspapers were in the business of selling the news is wrong.  Newspapers were in the business of selling eyeballs to advertisers.  If their business was really to sell the news, then the loss of classified ads wouldn't matter.  And lets just throw out the argument that we need newspapers for investigative reporting; investigative reporting can still be done by people other than newspaper reporters."}, {"author_name": "Chris", "gravatar_hash": "9a37d9b3cc386418966c2d1bfd104374", "author_url": "http://www.reconinsight.com", "date": "Sep 11, 2009", "message": "Thanks for the discussion concerning on-site software installations. I have an ISV for medium size businesses and we have had to decide between 1) we install software on their machines, 2) SaaS, or 3) appliance model where we provide server with pre-installed software.\n\nCurrently we are with #1 but are probably moving towards #3 as we grow. #2 SaaS is not an option because our application stores customer data.\n\nYou had concerns about deploying StackExchange for the enterprise because of the following two reasons. \n\nFirst, you mentioned backups. This is a problem but what we've determined is that enterprise back office systems already have a robust backup strategy in place. Leave this to them. Whether they perform hot backups or cold backups or no backups, work with their admins initially for them to back up your appliance drives. They also might want you to store your DB files on their SAN or other storage device. \n\nSecond, you mentioned remote access. I disagree with the FogBugz server admin that says the company will not let you in. They have a robust remote access infrastructure in place -- that is how their own employees and other vendors access servers. They can set you up with a VPN profile (most likely a Cisco VPN) that only allows access to your box. This gives them tight control over your access to their back office. \n\nJeff mentioned that working with each enterprise customer in such a manner being a nightmare and this is true to an extent. Being an enterprise ISV versus other models is certainly a fundamental difference. When we first set out we wanted to sell hundreds of licenses. Now we find that slowly growing our customer base -- while at the same time nurturing each relationship with hands-on work -- works for us just fine.  Enterprise customers want their hands held more but they will pay for it and they are grateful, which gives us good job satisfaction. \n\nAs far as StackExchange for the enterprise goes I recommend treating it as a different business unit much like you have split StackOverflow and StackExchange. This type of work requires resources but can be quite fruitful. Breaking it off into a different business unit would isolate it nicely Remember some engineers love the solutions/support job description but some do not care for it. Here are some options:\n\nOne, create a FogBugz StackExchange services team that only supports the enterprise customer installations. This team would handle solutions work.\n\nTwo, partner with a company that specializes in enterprise software solutions. There are plenty.\n\nThree, sell this business unit to an company that would be the sole distributor for the enterprise business segment. It could be arranged so you would still get license revenue for their StackExchange installments. This completely hands it off to someone else for enterprise work.\n\nThere are just some ideas. Thanks again for discussing enterprise software development issues... there are a lot of us out here :-)"}, {"author_name": "Will Sullivan", "gravatar_hash": "b32a129ace0693b2455d0ffc43e4235d", "author_url": "http://statestreetgang.net", "date": "Sep 11, 2009", "message": "BRB, designing a brand of evil, aka a FOSS version of FogBugz.\n\nAlso, professional journalism has been doing a perfectly fine job destroying themselves by destroying their credibility."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Sep 11, 2009", "message": "Just leaving a comment here while I wait for 30 seconds to pass...\n\n(Two short comments on http://stackoverflow.com/questions/1411312)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Sep 11, 2009", "message": "Ah - by the time the 30 seconds had passed, the answer I was going to comment on had been deleted. I guess that *happens* to be a win this time..."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Sep 11, 2009", "message": "Call it an appliance, not a server.\n\nIT organizations are getting push-back, both for budgetary and \"green\" reasons\" to minmize the number of servers they have and virtualize as much as possible.  It will be hard to justify adding a server whos sole purpose is to support an internal knowledge base.\n\nIt might be an easier sell if what you're installing isn't a server, but a specialized hardware appliance optimized to perfrom this single special function, even if we all know that isn't really the case."}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://www.ComicsInventory.com", "date": "Sep 11, 2009", "message": "I agree with Joel where Craiglist is cutting into the revenue stream of newspapers. In effect minimizing or removing investigative journalism. Now if you follow this logic I would say then that Google ad-sense is even a bigger threat because Google ad-sense is taking away the bigger revenue generating ads like Macys,JCPennys and other big companies and moving them to the web."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Sep 11, 2009", "message": "As far as the Craigslist stuff goes, here's what I think Joel is saying.\n\nImagine I won the lottery tomorrow, and I said, \"I don't really need the money; instead I'm going to use it to subsidize advertising for real estate agents, pimps, employers, and ticket agents.\"  It would be within my rights to do it, but some might question whether that was the optimal use for those funds.\n\nJoel thinks that what Craig Newmark is essentially doing.  Through his own efforts, he has become the steward of a large amount of resources, and Joel is questioning whether Craig's decision on how to use those resources (or perhaps more precisely, his lack of a decision on how to use those resources) is socially optimal for anyone except pimps and real estate agents.\n\nA further complication is that the resources Newmark is now the steward of came from the newpaper industry, which used those resources to deliver a public social good.  So the impact of Craigslist is a transfer of resources from investigative journalism to real estate agents and employers, which Joel sees as a bad thing.\n\nNote what Joel is not saying -- he is not saying that Craigslist should be shut down, and he holds out hope that it can turnaround.  He is just saying that right now, he doesn't see it as a net social positive.\n\n---\n\nNow, I don't think the implicit agreement funding journalism was sustainable, and we're going to have to find a new way to fund it.  But I can't disagree with Joel's argument that those who either through their own hard work or luck find themselves in charge of a large amount of resources should be intentional about how those are used."}, {"author_name": "Ryan", "gravatar_hash": "cbbc31b73a7bdea8587d563701ae5d16", "author_url": "http://lucydebate.blogspot.com", "date": "Sep 11, 2009", "message": "Joel, \n\nI get your point, but if you think the world would be a better place if Craiglist made money, why not go make your own (presumably, better) site and charge money for it?\n\nHell, host it on Stack Exchange."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Sep 11, 2009", "message": "@Ryan,\n\ncraigslist isn't going to be displaced by someone doing the same thing a little better; it's going to be displaced by a new model.  Just like newspaper's weren't displaced by doing the same thing a little better, they were displaced by new models of consuming news and advertising.\n\nUntil that new model emerges, which I don't see happening any time real soon, craigslist is going to be pretty firmly entrenched in its dominant position.  \n\nWhether that confers on it special responsibilities is a matter of debate."}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Sep 11, 2009", "message": "@Jon Skeet - I agree... I hit the 30 second timeout all the time, and find it mildly annoying."}, {"author_name": "MH", "gravatar_hash": "e041260c3cc217b5d4d531d79a152cf1", "author_url": null, "date": "Sep 11, 2009", "message": "Why is it Craig's responsibility to gather up all the money that is being \"left on the table\" and redistribute it to charities? That is, why should it be his responsibility and not the real-estate brokers' and HR departments' responsibility to redistribute their savings?"}, {"author_name": "MH", "gravatar_hash": "e041260c3cc217b5d4d531d79a152cf1", "author_url": null, "date": "Sep 11, 2009", "message": "Oh, and under Joel's logical argument, it would seem that H&amp;R Block also owes quite a LOT of money to the public good, since they routinely assist people in saving money that they would have otherwise paid into the public coffers."}, {"author_name": "kevin", "gravatar_hash": "fe23485aa59ae4ab41428cee72a1d55b", "author_url": null, "date": "Sep 11, 2009", "message": "Jeff,\n\nCraigslist's part in the demise of investigtive journalisim has been an active part of academic research. Fresh Air recently interviewed an author on the subject. You might be surprised how Joel's argument is nearly a carbon copy of what is discussed on this inteview:\n\nhttp://podcastdownload.npr.org/anon.npr-podcasts/podcast/13/112010978/npr_112010978.mp3\n\nlinks to freshair interview shownotes:\n\nhttp://freshair.npr.org/?ft=2&amp;f=13"}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Sep 11, 2009", "message": "MH,\n\nMaybe it is.  That doesn't change the fact that these resources are, in a sense, under Craiglist's control, and they are therefore somewhat accountable for what they do with them.\n\nWhat they have done is \"pass the savings on to you,\" execpt \"you\" is mostly real estate agents and big companies.\n\nBTW, for H&amp;R Block, the resources are never theirs, as they are for Craigslist."}, {"author_name": "MH", "gravatar_hash": "e041260c3cc217b5d4d531d79a152cf1", "author_url": null, "date": "Sep 11, 2009", "message": "JohnMcG,\n\n\"for H&amp;R Block, the resources are never theirs, as they are for Craigslist\"\n\nUsing Joel's argument, there is no difference between the two. H&amp;R Block is leaving money on the table because they /could/ charge more for their services. They only need to charge less than the customer would have spent otherwise. They are therefore immoral because they are not taking that money and redirecting it to the public good.\n\nTrue, the money being saved was not really owed to the government in the first place. But then your contrast implies that a real-estate broker somehow does owe money to a newspaper in the first place?\n\nBoth Craigslist and H&amp;R Block provide services that help people from overspending."}, {"author_name": "Chris Haseman", "gravatar_hash": "f9a5993eb8c8e165870533567c5ef653", "author_url": "http://hasemanonmobile.com", "date": "Sep 11, 2009", "message": "Check out TalkingPointsMemo.com\nFurther, Andrew Sullivan and his stuff does occasionally call people about stories.\n\nStick to tech stories Joel :-)"}, {"author_name": "Jason Hutchens", "gravatar_hash": "1ca3a0180e953e56d528a3b5ddb3d6b3", "author_url": null, "date": "Sep 11, 2009", "message": "I loved the whole Craigslist discussion - really interesting and thought-provoking, and I reckon there should be more of it.\n\nMy problem with what Joel said is that, although I largely agree with the sentiment, he's being incredibly hypocritical. Joel runs a paid-for job board (http://jobs.joelonsoftware.com/) which he claims rakes in a cool $1m per annum (http://www.inc.com/magazine/20090101/how-hard-could-it-be-thanks-or-no-thanks.html). By his own logic, he's at least partly responsible for the downfall of quality investigative journalism.\n\nSo I challenge Joel: take 25% of what you make on the job board and use it to hire one very good investigative journalist. Pay their expenses, and then turn them loose, asking them to produce one well-written, in-depth article every two months, which you then publish on your web site. Market this as \"helping to save quality journalism\" or something. Encourage others to do the same. It could be awesome."}, {"author_name": "Tim", "gravatar_hash": "cd50e92b520156d94c8b35e56e099c8f", "author_url": null, "date": "Sep 11, 2009", "message": "So Craigslist is MILLITANT? I didn't know they had an army."}, {"author_name": "Philip Durbin", "gravatar_hash": "6b686fe7f07115890ca63099d088948d", "author_url": "http://stackoverflow.com/users/19464/philip-durbin", "date": "Sep 11, 2009", "message": "It's somehow refreshing to mostly agree with Joel rather than Jeff for a change when it comes to the issue of newspapers' commitment to the public good.\n\nJeff doesn't have a rose-tinted view of newspapers, saying they are motivated primarily by \"financial incentive\" but Joel asserts \"something was very strange about the newspapers. . . they always did it this way. . . they felt an obligation to do journalism to support democracy.\"  In the article linked above, Clay Shirky invokes \"ancient social bargains.\"\n\nIn a recent Fresh Air interview, Alex Jones, a fourth generation member of the kind of social-minded newspaper family that Joel describes, tells of a covenant:\n\n\"Nonetheless, those chain owners were, in most respects, willing to abide by the covenant that was really made back in the 19th century when newspapers became a real business, which was that newspapers would be successful economic enterprises and make profits, but they would in turn take on a public service role, which was mainly in the form of doing the kind of serious news that's expensive and that a lot of the people who bought the newspaper didn't even really care that much about. They bought it for the sports or for the crossword or for the comics, but they got the news nonetheless.\"\n\nFrom Alex Jones On 'Losing The News,' And Why It Matters\nhttp://www.npr.org/templates/transcript/transcript.php?storyId=111985662\n\nDon't get me wrong.  I agree with Shirky: \"Society doesn’t need newspapers. What we need is journalism.\"  But who now will make this covenant?  Who will bring serious news to the public?"}, {"author_name": "Jim B.", "gravatar_hash": "ba4b8d93ccf2fa7834bb6ba94b7088f3", "author_url": null, "date": "Sep 12, 2009", "message": "Gotta disagree with Joel, I'd say newspapers dug their own grave.\n\nDuring the 1990s it became fashionable for investors to buy up newspapers and essentially min-max their operations: trim the fat, and make content changes they felt would increase circulation.  In all cases, this resulted in less hard journalism (expensive) and more soft news (more appealing - theoretically).\n\nThese changes were taking place long before Craigslist began chewing away at their revenue; it was still contained to the bay area at this point.  As it turned out, content changes did not improve circulation, but staffing and assignment cutbacks did improve the bottom line, so it was assumed newspapers had found the right model to maximize their profitability.  In the short term, you could get away with your circulation being down if your profits were up.  The nasty declining circulation trend continued as content quality dropped. \n\nAs Internet began to proliferate into people's lives, newspapers made, at best, a half-hearted attempt at capitalizing on this new technology.  This usually involved putting the content online, with near-useless search functions (thus people's reliance on search engines like google), hosted on slow overloaded web servers, on slow overloaded pipes, feeding readers stories littered with obnoxious internet advertisements that went through no screening process; neither automated to match with the reader, nor manual to recognize that flashing banner ads were terrible and annoyed users.  This occurred not because newspaper's IT departments were incompetent, but because they were forced to operate on shoe-string budgets, and had management that saw the Internet as merely a sideshow to physical paper.\n\nBy the time Craigslist spread to all major US cities, it was already too late for newspapers: they eroded their value by patronized their readers with soft journalism, annoyed them with crappy websites, and shoveled people their content free of charge setting dumb expectations because they were too lazy to develop an Internet business model other than \"banner ads!\""}, {"author_name": "Kevin Nisbet", "gravatar_hash": "87cfa8041378dfcf2d4467c5bce08ee6", "author_url": null, "date": "Sep 12, 2009", "message": "Software as an appliance is common in the wireless carrier space (where I work), and we're all setup for vendors to VPN into our network. Security is limited to only be able to access the appliance, and it is expected that if we cannot solve our problems, support can log in and recover the system for us. \n\nThe problem you guy's might run into with something like this, is us huge companies expect 24 hour support, and SLA's, and one company will want you to manage backups, where as another will want you to connect to their backup network. Even with appliances, there are often little tweaks that they want.\n\nHowever, this is a very good way to break into the large enterprise customer space, since the directors love to put the burden of maintaining the system onto another company, that they can try and slap around when things go wrong, and shift responsibility from themselves to you're company."}, {"author_name": "Brian Duffy", "gravatar_hash": "974938b8250a08cf9e22714aff1f9fcc", "author_url": null, "date": "Sep 13, 2009", "message": "I agree with the sentiment about Craigslist, but for a different reason. Newspapers have been dying for decades -- once upon a time even small cities had multiple papers and the standard of journalism was higher. Craiglist is a opportunistic disease attacking someone with a terminal illness.\n\nThe problem with Craiglist is that you have this institution that is essentially a cult of personality. Peace, love, everythings free, blah blah man. The problem is that there's a real darkside to craigslist -- like it or not, the site is a hub for prostitution, spam is out of control and will remain out of control due to some philosophical position that Craig holds.\n\nAll cults of personality have a single point of failure. What happens when Craig decides that manually sifting through spam every day isn't fun anymore? Since the entire site is an expression of a single individual's whim, you're going to have the national resource for classified ads go poof someday."}, {"author_name": "PhantomTypist", "gravatar_hash": "bb54d41013255a7697a412d3e586c890", "author_url": null, "date": "Sep 13, 2009", "message": "Pandincus and I have created a DevDays countdown app.  We have posted it as an answer to Joel's question over at Meta Stack Overflow.  Check it out:\n\nhttp://meta.stackoverflow.com/questions/20420/countdown-app-for-devdays/21558#21558\n\n\nWe are anxiously awaiting your feedback!\n\n-- PhantomTypist and Pandincus"}, {"author_name": "Michal Talaga", "gravatar_hash": "cb7a0912afbd6edc12db454d694da9ff", "author_url": null, "date": "Sep 13, 2009", "message": "With all due respect for Joel, but his comments on \"destroying value\" is just ridiculous! I don't expect a developer to have a deep level of understanding of economics, but this is BASIC stuff! Joel says that if I don't spend my money to pay for an add then this money vanishes from my pocket. Well I don't agree with that at all! On the contratry, I still have this money and I can spend it on something that has more value to me.\nAs a self punishment I expect Joel to publically appologize in the next podcast and get basic understanding of ecomonics for free from mises.org.\n\nAs for him glorifying democracy - come on man, how can you beliece a system where majority says you shouldn't have the right to live and suddenly it becomes the law and I'm put in a gas chamber, to be THE system? Nuff said, facts are facts, all democracies suck big time. You people should be happy you started out with republic, but you will soon learn what democracy leads to.\nOther than that keep up the good work."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Sep 13, 2009", "message": "So people like Randolhp Hearst, Lord Rothermere and today presumably Rupert Murdoch published newspapers for the public good!\n\nBill Gates charges for Windows in order to raise money for charity and Linux is stealing from starving Africans? \n\nObviously Stackoverflow shouldn't be on the free internet it should be on Lexus-Nexus than the $1000/month access can go toward good works."}, {"author_name": "Mark Hall", "gravatar_hash": "153d67f5439248be2ccb83df515da8d9", "author_url": null, "date": "Sep 14, 2009", "message": "A stackexchange appliance is a good idea, but it needs to be virtual.  I have worked for several fortune 100 companies, all of which would have / could benefit from a in-house stackoverflow.  BUT vendor supplied appliances have always been the bane of IT management.\n\nI agree wth JohnMcG's comments that the IT world is going \"green\", but the reason that the enterprises that I work with are going down this road is not to save money on power, cooling and space (although that is a big benefit); it is because most application stacks can not drive the hardware enough (specifically the processor.) Therefore, CIO are complaining about wasted resources, and IT is turning to virtualization to make them happy.\n\nWhat has working in the past is, A) a vendor supplied VM with all the goo in there (pre-configured) except for their outside dependancies, B) requirements documented for the database and a schema that can be installed, and C) a simple utility to configure the outside dependancies (database, SMTP, etc.)  This allows the IT organization the chance to use their SQL farms, managed by professionals, to host the critical part, and allows the IT orginization to follow their time-tested procedures and tools for things like backup / recovery, high availability and disaster recovery.\n\nJust my $.02"}, {"author_name": "Andrew", "gravatar_hash": "73a4e5331d141ee3a2221f3176981333", "author_url": null, "date": "Sep 14, 2009", "message": "Does anyone have more info about what Joel said about Exchange needing to be installed on its own machine?"}, {"author_name": "Ralph Rickenbach", "gravatar_hash": "09eb3720b1c9d33bedd35a3bd47ec1c9", "author_url": "http://www.rickenba.ch", "date": "Sep 15, 2009", "message": "About not monetizing Craig's list: James 4:17 - http://bible.logos.com/passage/nasb/james 4.17"}, {"author_name": "Ralph Rickenbach", "gravatar_hash": "09eb3720b1c9d33bedd35a3bd47ec1c9", "author_url": "http://www.rickenba.ch", "date": "Sep 15, 2009", "message": "How I miss the edit function of SO. As the link in my previous comment is broken (includes a blank), here the verse:\n\n James 4:17 Remember, it is sin to know what you ought to do and then not do it."}, {"author_name": "John Brayton", "gravatar_hash": "51f1b1f187f3d1453e8ebc823258f7b5", "author_url": "http://blog.virtualsanity.com/", "date": "Sep 15, 2009", "message": "A few thoughts about a StackExchange appliance:\n\n* I think a subscription/rental model for an appliance would be a tough sell.  A customer would more likely be willing to buy the appliance for a one-time cost, perhaps also paying a nominal monthly or annual cost for a service agreement.\n\n* I completely agree that obtaining remote access to a customer's server would not fly in most organizations, especially since the appliance is intended to target customers unwilling to entrust their data with a hosted service.\n\n* If you can swap SQL Server out for an open source database engine you might save a lot of money in licensing costs."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Sep 15, 2009", "message": "@John Brayton\nNot necessarily, enterprises love leasing. It doesn't matter if the monthly rent is more than the purchase cost. They were all taught in business school that if it \"flies, floats or f***s - rent it\"\n\nSwapping out to an FOSS database probably doesn't make sense:\nSO relies heavily on using SQLserver's full text search - swapping in a 3rd party search engine would be a pain. for SO and the hosted version the license cost isn't a problem - you are only paying one license per box not per site/customer.\nBut once you get enough sales of appliances it might be worthwhile to do this work once and then pocket the $8k license for each sale!"}, {"author_name": "Daniel Kelly", "gravatar_hash": "4aff635fd57945432c0a84fbe0a32713", "author_url": "http://www.eloquentspace.com/blog", "date": "Sep 18, 2009", "message": "Hey, great podcast. I never even thought of Craigslist in this way, but I agree with you. Now I know what it was about them that had always subconsciously irritated the crap out of me about that site (aside from the 1990's html 2.0/cgi look).\n\nAlso, as a courtesy I paraphrased your ideas and linked to you in my blog in a post about the Amazon Kindle and the Sony Reader. The post is at: http://www.eloquentspace.net/blog/amazon-kindle-free-press-2-0/\n\nMy hope is that the free press will become better as this transition from hard-copy to the web continues. I think bloggers will become better journalists, and hopefully some of the bias in the press dies off. On that note, I found it funny that you guys acted as if our press was so great right now, or even ten years ago! It's had a lot of problems for a long, long time. There's also some very aggressive bloggers out there posting their findings on all things political.\n\nIf anyone wants to drop me a line, feel free to do so. This whole set of newsmedia/publishing industry controversies gets me going, especially as a college student paying $200 for a book I'm going to use for 12 weeks, then getting paid like $15 for the buyback. What a racket."}, {"author_name": "Merus", "gravatar_hash": "b7e35651f25986c1c6f61ffca814b640", "author_url": null, "date": "Sep 19, 2009", "message": "I used to be on Joel's side regarding investigative journalism, but then I found some: http://www.thesmokinggun.com/archive/years/2009/0803091pranknet1.html\n\nSo I think I'm on Jeff's side these days. There might not be a lot of citizen journalism, but it'll happen, and people will find ways to encourage it. (I imagine a prize, like an unholy cross between the Webbys and the Pulitzer, will crop up at some point.)"}, {"author_name": "Bob", "gravatar_hash": "0b99033319a7f46661aaf0324c47f335", "author_url": null, "date": "Sep 20, 2009", "message": "Sorry Jeff and these guys largely miss your point re. Craigslist Joel.  This is what's wrong with the world, not bad intent but lack of depth of thought.\n\nBTW, Public TV and Radio accept massive corporate funding due to machinations dating to the Reagan Administration.  Just look at how quickly so much of \"public\" broadcasting has changed to sports (pap for the masses) and support of big-biz agendas (calling illegal aliens \"immigrants\" plays right into corporate interests, from agribusiness and construction to banking)."}, {"author_name": "Skilldrick", "gravatar_hash": "2b0a93dc132be4bf3b15b50c8a7e8089", "author_url": "http://www.skilldrick.co.uk", "date": "Oct 01, 2009", "message": "I didn't agree with Joel and his rant, but I don't mind that. What I did mind was the amount of time on this podcast dedicated to the ethics of Craigslist. I care about ethics, and I care about tech, but this was just tedious!"}, {"author_name": "eadman", "gravatar_hash": "2fe0f335a4762ae4134a8e7242899d72", "author_url": null, "date": "Apr 05, 2011", "message": "Can you be any crazier?!?!  These stickers are more valuable than gold.  I sent in money and an SASE envolop, and bada bing bada bom.   I got the stickers and someone had put $25,410 in cold hard cash in mail box!   don't think the cash came from you all, but since I don't know who did this, .... Thank you!!!!!!"}]}