{"response": [{"author_name": "Josh Nussbaum", "gravatar_hash": "60888d58de3bf08cbc0c73e67fd6fd86", "author_url": null, "date": "Sep 02, 2009", "message": "Jeff &amp; Joel,\n\nYour sitemap should contain all URLs on the site, not just the changed URLs. That is the purpose of the &lt;lastmod&gt; element, it tells google when the data was last changed so that google can ignore spidering unchanged content.\n\nYou can also use a lower &lt;changefreq&gt; for older content that hasnt changed. Old questions that havent changed in a month dont need to be spidered ‘daily’, consider using ‘weekly’ changefreq instead.\n\nAnother idea would to use E-tags"}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Sep 02, 2009", "message": "I too, have a sick pleasure in deleting code :P I mean deleting code and keeping the same functionality :)"}, {"author_name": "Martin", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Sep 03, 2009", "message": "Just to confirm,\n\nYes Monday was a bank holiday in the UK.  Your comments about the queen could have been considered a bit crass as the date is also, by many, considered the commemoration of the death of the late Princess Diana who died on the 31st August 1997.\n\nJust saying.  Off to listen to the remainder of the (long overdue) podcast :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 03, 2009", "message": "So, nothing involving crumpets, then?"}, {"author_name": "Mike Woodhouse", "gravatar_hash": "5978e2ed3a31f1bd2361dbb919d92012", "author_url": "http://grumpyop/wordpress.com", "date": "Sep 03, 2009", "message": "Excellent. Get yourself over here. We may offer some (reserved) clapping in recognition. Oh, and these days we seldom indulge in cannibalism on weekdays, so you shouldn't worry too much about that one. We let Joel get home after the British Library gig, after all."}, {"author_name": "paul binns", "gravatar_hash": "da05d7fad9811c553b747c2d7861d18d", "author_url": "http://server1.servegame.org", "date": "Sep 03, 2009", "message": "That would be a bank holiday ;p we all get the day off &lt;3"}, {"author_name": "Colonel Sponsz", "gravatar_hash": "cae93d12a6a39d5dc68eadf4cf45e526", "author_url": null, "date": "Sep 03, 2009", "message": "You Americans have a holiday this weekend?  Does it involve eating hamburgers?"}, {"author_name": "moron", "gravatar_hash": "da99e7ca457fb13427f536dd7cbd81a2", "author_url": null, "date": "Sep 03, 2009", "message": "Oh gawd, so there's a Diana day now...."}, {"author_name": "Martin", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Sep 03, 2009", "message": "Not offiially, it's just a summer bank holiday but those who worship the ground she walked on would no doubt like to hijack it."}, {"author_name": "Pietro Polsinelli", "gravatar_hash": "5198744cd329b6dfdb9e39b4f9794cd1", "author_url": "http://polsinelli.wordpress.com", "date": "Sep 03, 2009", "message": "Every question deserves exposure: http://en.wikipedia.org/wiki/15_minutes_of_fame"}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Sep 03, 2009", "message": "I good reverse proxy is http://urlrewriter.codeplex.com, but I am a little bias."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Sep 03, 2009", "message": "Colonel Sponsz,\nWe don't need a holiday to eat hamburgers.  They're every day food over here."}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Sep 03, 2009", "message": "For over a day I have been unable to view stackoverflow.com or the others in the trilogy.  Firefox and Chrome give me a blank screen with no error message.  IE gives me HTTP 403 Forbidden.\n\nAny ideas?  (I'd ask this on SuperUser, but . . .)"}, {"author_name": "tasc", "gravatar_hash": "4750823ebcbef9e0e3b26b790cc0874a", "author_url": null, "date": "Sep 03, 2009", "message": "I cannot access meta at all today. The error message is *Unable to determine IP address from host name for meta.stackoverflow.com* :("}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Sep 03, 2009", "message": "@tasc:\n\nNo idea what the problem is, but the IP for Meta is 69.59.196.213 if you want to add it to your /etc/hosts file."}, {"author_name": "tasc", "gravatar_hash": "4750823ebcbef9e0e3b26b790cc0874a", "author_url": null, "date": "Sep 03, 2009", "message": "@Kyle: it's back somehow. but thanks anyway, it's good to know the IP."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 03, 2009", "message": "@eric send email to team@stackoverflow.com"}, {"author_name": "Frank Rizzo", "gravatar_hash": "9b2c958dfe7eed7002b55d7715613d0f", "author_url": null, "date": "Sep 03, 2009", "message": "I have to second @tasc.  StackOverflow and others have been inaccessible here and there, but not too often.\n\nServerFault and SuperUser were being blocked by a Sonic Wall firewall (at one of the places I contract) last week, this week, it seemed ok."}, {"author_name": "Itay Maman", "gravatar_hash": "9420b13f41ea0c28b268d819209069a9", "author_url": "http://javadots.blogspot.com/", "date": "Sep 04, 2009", "message": "Quoting Jeff: \".. this wasn't like some secret plan I had. I was just looking  at the code and realized how easy it would be to have a random secondary sort, this has literally never occurred to me before\"\n\nOh I know the feeling. So often the code itself gives me excellent hints on what to do next."}, {"author_name": "Dan", "gravatar_hash": "88a93460e93e2c37a277caf48c405220", "author_url": null, "date": "Sep 04, 2009", "message": "I love the podcast, and would kowtow to you guys on most things, but you both really know zilch about scaling across multiple servers. \n\nSimply put your session state in memcached (or similar) and all worries about IPs changing instantly disappears.\n\nMemcached really is scaling 101, and the fact you guys don't even remember the name of it is way weird."}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Sep 04, 2009", "message": "I love the podcast and listen every week. But after 66 episodes, you guys are starting to repeat yourselves. A lot. Joel, in particular, has a collection of canned five minutes speeches that I feel like I've heard a million times. In this episode, we had: (a) the IP hopping thing, AOL, and the airline satellite network, (b) the true meaning of beta and the psychology of beta testers, and (c) the magnificence of Microsoft's developer support. All of these things have been discussed before, at length, on the podcast."}, {"author_name": "dean nolan", "gravatar_hash": "268787c7ffe5c47829ff7d6866afe22b", "author_url": "http://www.deannolan.co.uk", "date": "Sep 04, 2009", "message": "Jeff, in the UK we have monday bank holidays quite a lot. This means a lot of people are off work so if you get the same results in future check if it is a bank holiday. It feels to me we have one every 3 weeks!"}, {"author_name": "Colin", "gravatar_hash": "ebd797c67fc48fa5c8f1ab5d06e2196f", "author_url": null, "date": "Sep 04, 2009", "message": "It wasn't a holiday in all of the UK - just England, Wales and Northern Ireland. Wasn't a holiday in Scotland"}, {"author_name": "Donal", "gravatar_hash": "2d927115d3eda8c02c44b306a847c95b", "author_url": null, "date": "Sep 05, 2009", "message": "@Chris - have to agree with your comments about Joel repeating himself. If I'd a dollar for every time I've heard his sermon about how people's incentive to do something (they were previously doing for free) can reduce if you start paying them......"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 05, 2009", "message": "@Donal @Chris\n\nas usual, I blame Joel"}, {"author_name": "Nic Wise", "gravatar_hash": "08ff8b09ff4b88caafd4435ba297ebb1", "author_url": "http://www.fastchicken.co.nz", "date": "Sep 05, 2009", "message": "@jeff\n\nWhy not do an index with Stack Exchange? So a new SE site can (optionally) list in the index, so if I make a great photography SE site, users can find me by looking in the index under \"photography\" etc.\n\nNot sure how to build the taxonomy, maybe let people list their own at first, then tighten is up later.\n\nWould make it nice and easy for people in group A to find group B, C and D easily, assuming they like the SE/SO format."}, {"author_name": "Alistair", "gravatar_hash": "438c91736f20d0821c7a358ee8b00790", "author_url": "http://stackoverflow.com/users/379/geocoin", "date": "Sep 07, 2009", "message": "just a warning Jeff, the UK border peeps are starting to get as hostile to Americans as US border types are to anyone not from the US (or simply knowing someone from outside the US... i think it's going to be a new question on the landing card... \"do you intend to commit any acts of terrorism or have relations with anyone not of US origin\")\n\nas a USAican living in the UK for over 20 years, in the last few years of entry I have had some the hassles my (british) wife gets whenever we land in JFK or BOS..."}, {"author_name": "Daniel Magliola", "gravatar_hash": "867d273117f85687ebe25eb04779aafd", "author_url": "http://www.crystalgears.com", "date": "Sep 07, 2009", "message": "Hey guys, I have one quick question. You mentioned that you're not using Session anymore, and are only storing Session State in the database for some edge cases.\n\nNow, how are you dealing with people logged in?\nMy main use for session is to store a \"UserID\" value, so that when you make a new request I now you're logged in. How do you do this without using Session? Are you sending the UserID encrypted in the cookie?\n\nIs that safe?\n\nThanks!\nDaniel"}, {"author_name": "Ryan", "gravatar_hash": "cbbc31b73a7bdea8587d563701ae5d16", "author_url": "http://lucydebate.blogspot.com", "date": "Sep 09, 2009", "message": "Come on guys, don't tease. Now you've got me wondering why *does* a waiter pour water out of the side of the pitcher instead of the center?\n\nI can't seem to find the wikiAnswer that Joel mentions via google."}, {"author_name": "Bremen", "gravatar_hash": "9a45de8df0c5c3f6e137c785e71557b8", "author_url": null, "date": "Sep 12, 2009", "message": "@Ryan: http://wiki.answers.com/Q/Why_do_waitresses_pour_from_the_side_of_a_pitcher_instead_of_the_front_where_the_spout_is\n\n@Jeff: The whole time I was listening to your discussion about Google's crazy-aggressive spidering while you argued with Joel about your sitemap, I just kept thinking \"Wow, wouldn't it be ironic if this turns out to be Yet Another time that you're not listening to Joel and all your Google bandwidth problems are just because you're not using Sitemap properly?\""}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Sep 17, 2009", "message": "Re: water pouring\n\nIt's the ice. Water pitchers are designed for pouring water, not ice water. Pouring from the side results in more ice in the glass, and is faster. Pouring from the spout results in a jam of ice which results in only water going into the glass, slowly, though if the ice jam spontaneously breaks, unexpectedly fast. It takes only a little observation to figure this out."}]}