{"response": [{"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Sep 02, 2009", "message": "Congratulations! :)"}, {"author_name": "Barry Kelly", "gravatar_hash": "4a7b08fcb7e3d9a52ae473613b71bc3d", "author_url": "http://blog.barrkel.com/", "date": "Sep 02, 2009", "message": "Actually, it's not surprising that he's young - people who have less-involving jobs, or a lot of free time on their hands, are those who are most free to put time into sites like SO, SU etc. It's one of the reasons that reputation is a double-edged sword; on one hand, it indicates that the owner is knowledgeable enough, and on the other hand, it indicates that they are underemployed."}, {"author_name": "Dav", "gravatar_hash": "de7dbc4926b9f582258631c2c28c0f13", "author_url": null, "date": "Sep 02, 2009", "message": "@Barry Kelly: Underemployed, just like Jon Skeet. SCNR. ;)"}, {"author_name": "Entity", "gravatar_hash": "344c9a5b1361224d3396f00592faf413", "author_url": "http://www.google.com", "date": "Sep 02, 2009", "message": "I have no problem if people are working for me for free well I earn money off their knowledge.\n\nSeems like a good trade, they get experience and reconition via the tocken economey that is just virtual and only valued via the users of the system. Where by I on the other hand, just use it to make money."}, {"author_name": "Chealion", "gravatar_hash": "7c08fef7eb80784161013a4003cca497", "author_url": "http://chealion.ca", "date": "Sep 02, 2009", "message": "0 questions. 0 votes. Impressive. (This is meant in a positive manner)"}, {"author_name": "Jonathan Sampson", "gravatar_hash": "a84a8714fd33f6676743f9734a824feb", "author_url": "http://www.sampsonresume.com", "date": "Sep 02, 2009", "message": "Congrats, John! Here's to the next 10k!"}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Sep 02, 2009", "message": "@Chealion -- actually I'm not impressed by 0 votes.  It means one is not fully participating in the site.  It's at least as important to vote up good answers on questions you don't answer (or even if you do) so that good answers are acknowledged.  This is especially important for knowledgeable people.\n\nlustrated cuss"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Sep 02, 2009", "message": "Zero votes? There is no I in Team.... there's a Me though if you jumble it up.\n\nNot cool!"}, {"author_name": "Chealion", "gravatar_hash": "7c08fef7eb80784161013a4003cca497", "author_url": "http://chealion.ca", "date": "Sep 02, 2009", "message": "@tvanfosson: I should clarify - I'm impressed that he's gone for that long and received that much reputation without voting. I don't agree with it however. For myself all the sites is all about getting good answers to the top. (I think I'm among the highest for amount of votes on SU)"}, {"author_name": "Jonathan Sampson", "gravatar_hash": "a84a8714fd33f6676743f9734a824feb", "author_url": "http://www.sampsonresume.com", "date": "Sep 02, 2009", "message": "@Olafur: I wanted to up-vote that last comment. I'm so spoiled by SO. I need some arrows!"}, {"author_name": "James Luman", "gravatar_hash": "976c4240097e4be5c668984f2b3965f4", "author_url": null, "date": "Sep 02, 2009", "message": "With 11K of rep and zero (0!) votes, it's like a black hole of participation."}, {"author_name": "Bremen", "gravatar_hash": "9a45de8df0c5c3f6e137c785e71557b8", "author_url": null, "date": "Sep 02, 2009", "message": "I agree with others about the lack of engagement, but as a means of playing devil's advocate: would the site be better off without him (and his contributions)? I find it hard to believe that, so he's certainly contributing to the core of the site, just not to the community? \n\nCaptcha: John occluded (lol)"}, {"author_name": "Jeffrey", "gravatar_hash": "879dd6f59d2157684a47554670782977", "author_url": null, "date": "Sep 04, 2009", "message": "If someone is going to provide 300+ quality answers to the site, I could care less if he votes."}, {"author_name": "Ether", "gravatar_hash": "43722cb1e955874a8eb721e9dfe101d1", "author_url": null, "date": "Sep 05, 2009", "message": "There's no need to bash Canadians."}, {"author_name": "John T", "gravatar_hash": "25329493f47777dd84619b6b5c14fde4", "author_url": "http://superuser.com", "date": "Sep 11, 2009", "message": "@Barry Kelly, not only am I a full time student, but I also work 2 jobs while balancing out an active lifestyle. Hardly unemployed, I have my regular job and I also work for my school as a peer tutor. If there's any statistics Jeff can provide you, I'm not on the site for long periods of time, I check it quite a few times a day though.\n\nAs for the voting, it sort of started on StackOverflow. I have around 8k rep there and like 1 or 2 votes. I didn't notice until I had a few thousand rep that I haven't even been voting it sort of shocked me, now I find the account sort of unique and don't want to spoil it (talk about OCD, I don't know why though to be honest). There's over 10,000 other users on superuser though, I'm sure the community can pick out good answers without 1 persons help, there's enough people that sign up daily to cover my part tenfold at least."}]}