{"response": [{"author_name": "David McGraw", "gravatar_hash": "4e0d0da7c9066cddef0987e9dc8d8194", "author_url": "http://www.david-mcgraw.com", "date": "Feb 21, 2009", "message": "This was a pretty fun experience in the end... \n\nAnd, yeah... What a way to spend your Friday. Assisting in the development/protection of SO."}, {"author_name": "bobby borszich", "gravatar_hash": "8df133fdb1e33c3ea184c7b4fa4b0dfa", "author_url": "http://evilbobby.com", "date": "Feb 21, 2009", "message": "short live tupac - he died in my home city"}, {"author_name": "Biggie", "gravatar_hash": "d71e6f29b4a15b0a2038f28ee913a293", "author_url": null, "date": "Feb 21, 2009", "message": "Wasn't UncleBob in Aus at the time?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 21, 2009", "message": "<i>why I oughta...</i>"}, {"author_name": "Adrian", "gravatar_hash": "4f4ed4162127ebda697ddce5da85edfb", "author_url": null, "date": "Feb 21, 2009", "message": "Is Australia really so bad for spam?\nI guess it was a lazy Saturday here but I'm suprised you see our ip's behind so much spam. I wonder are we malicios \nor unpatched."}, {"author_name": "Rolf", "gravatar_hash": "74970796a2224f447a8775ff05f83bd0", "author_url": "http://www.rolfje.com", "date": "Feb 21, 2009", "message": "So let me get this straight; A guy from Australia is bored and posts some bogus questions. Combined with the statistics that a lot of flac is coming from Australian IP addresses, you find that enough to piss off a whole country AND the Tupac Shakur fans? Wow.\n\nYour time restrictions are nice, don't get me wrong. But I'd be thinkig twice before pissing off a whole country with a silly YouTube video because of some little kid that spams your system from his dad's laptop.\n\nI wonder what this post does for Australians using your website."}, {"author_name": "John", "gravatar_hash": "36266269d477a10e9e34d6c32756d255", "author_url": "http://obviouscode.com", "date": "Feb 21, 2009", "message": "Hey, you guys gave us Dubya for 2 terms, and I didn't once lash out at the whole US, so please don't dump on Australia for one single 1337 tosser."}, {"author_name": "John", "gravatar_hash": "36266269d477a10e9e34d6c32756d255", "author_url": "http://obviouscode.com", "date": "Feb 21, 2009", "message": "And why do you need another reason to hate Kangaroos and Koalas?"}, {"author_name": "Nathan", "gravatar_hash": "258bd43900b53e5ab73401f07dc3c22e", "author_url": null, "date": "Feb 21, 2009", "message": "I was going to reply...\n\n\"Meh, its ok, most Australians think that most Americans are a bunch of loud arrogant tossers. I think based on this we can say the point is anecdotally proven.\"\n\nBut i'm too polite so i won't :D"}, {"author_name": "Stefan", "gravatar_hash": "7847006dbf49f1722b07c8da396f1275", "author_url": null, "date": "Feb 21, 2009", "message": "Rolf, the Australians I know have a good sense of humor and will not pissed off... http://www.swammelstein.nl/fenneke/prednat.htm"}, {"author_name": "Evan", "gravatar_hash": "1aee470f3d4d3e9c81141387db5cfcee", "author_url": null, "date": "Feb 21, 2009", "message": "Given the amount of US TV we get in Australia, and various other sources, I've noticed lately that Americans are really not shy at all when it comes to putting down other countries.  Then again, most other countries are not shy in putting down the USA, so I guess it evens out...\n\nAh America.  I land of wide open spaces, mostly surrounded by teeth.\n    -- Charles Luckman (paraphrased)"}, {"author_name": "Xerxes", "gravatar_hash": "4542833c109b143eeadf55450590da4a", "author_url": "http://www.xerxesb.com", "date": "Feb 21, 2009", "message": "i'm Australian. I'm not offended.\n\nI'm just pissed off that some guy is clogging the tube between Australia and the USA, slowing down my connection to RedTube ;)"}, {"author_name": "chrissie1", "gravatar_hash": "70e155e88e0ead5e2bdcb3e1c57506b4", "author_url": "http://blogs.lessthandot.com", "date": "Feb 21, 2009", "message": "Woohoo I can still spam you from work, since we are behind a proxy with hundreds of IP's and they change for every request. \n\nNot that I will, just to point out that the system is not fool proof (at least not if the spammer works for the government)."}, {"author_name": "ceejayoz", "gravatar_hash": "ba4b3762bd032c36f0a648c5f3f75f50", "author_url": "http://ceejayoz.com/", "date": "Feb 21, 2009", "message": "@ Rolf, February 21st, 2009 at 4:52 am \n\nAustralian citizen here... asking you to stop being such a humourless twit."}, {"author_name": "ricky", "gravatar_hash": "e3d7f073397c4beb994ed8e264ae73e5", "author_url": null, "date": "Feb 21, 2009", "message": "Coincidence?\nTwo of the blogs that I follow have similar complaints within 2 months http://www.lhotka.net/weblog/IdiotSpammer.aspx .\n\nSee, this is the problem when porn sites and gambling sites are blocked. ;)"}, {"author_name": "jn", "gravatar_hash": "c3ae6a1b8d708b79b6b85ecc365266a4", "author_url": null, "date": "Feb 21, 2009", "message": "Jeff, re the \"too-fast-to-be-human triggered CAPTCHA\", is there perhaps a bug in that code that makes the timing decision?\n\nI've been forced to deal with CAPTCHAs a few times over the past several weeks, and it's always been when I take TOO LONG to answer a question, never when I answer quickly. E.g. start coffee pot, begin browsing SO, start to answer a question, coffee pot beeps (a high-priority interrupt), go make coffee for self and wife, return to answering question,  deal with CAPTCHA.\n\nOr is there different logic/timing for posting questions than for posting answers?"}, {"author_name": "this mat", "gravatar_hash": "11615d3f6cd75d23b0760cebdf5cd5b8", "author_url": "http://tomuse.org", "date": "Feb 21, 2009", "message": "Jeff, let's focus on the positive here, that this hasn't been a big problem before, and is a sign of success for the site."}, {"author_name": "coonj", "gravatar_hash": "3142149e70f7e11e86905a8b0f5311ec", "author_url": null, "date": "Feb 21, 2009", "message": "Jeff, in terms of multiple users from the same IP... will the block be based on the highest-ranked user from that IP?  So if a company has 5 SO users, and one of them is a 200 rank, then none of them will be blocked?"}, {"author_name": "Paul", "gravatar_hash": "84cfa7d0edf170035763d6bb6825722b", "author_url": null, "date": "Feb 21, 2009", "message": "Being an New Zealander (the same nationality as the guys flipping the bird in the video) I am used to people not liking Australians, but doing it on the basis of one spammer seems a little harsh, especially when the rapper concerned was inflicted on the world by the US in the first place.\n\nIs blaming SO for the crap music coming out of the US more unfair than blaming all Australia for 1 idiot, after all there have been heaps of crap rappers come out of the US, and only 1 spammer.\n\nWow, I don't usually stick up for Australians ;-)."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 21, 2009", "message": "Guys, guys, guys -- in case it wasn't clear from the post, I am *kidding*!\n\nI have nothing against Australians -- or Tupac Shakur -- and it's honestly impossible to be absolutely sure the malicious user was even from AUS in the first place (though it is likely).\n\nAt any rate, I was just trying to make light of a very annoying and disruptive situation."}, {"author_name": "Paul", "gravatar_hash": "84cfa7d0edf170035763d6bb6825722b", "author_url": null, "date": "Feb 21, 2009", "message": "lol, my apologies,  I should re-read the article before wading in and putting both feet firmly in my mouth."}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Feb 21, 2009", "message": "Yesss! Down with the Austrollians..... what?.. you were kidding?... erhmm  \n\nWell :\") \n\nYou know there are people who thinks that behind a cruel joke there is some true laying behind?\n\nIs like if I go with my mother in law and tell her she's the worst person I have ever met and ask her to stop getting in my life, and just after she start crying ( or throwing dishes in the head ) I go... Heeyyyy!!! Just Kidding!!!.. who loves you, who loves you.. \n\nNot precisely the best thing to do.\n\n\nAnyway,  I knew this was a real hum... well it was not a robot. I posted a question and he immediately bite it. \n\n\nJust another suggestion, increase the \"offensive\" votes, at least for users with  higher reputation ( let's say unlimited for  10k users ) Yesterday, we had two attacks and most of us ran out of votes to face the troll in the first one. For the second we did't had any other thing at hand than editing the posts.\n\n\nBy the way, I love the way SO listen to their users. Thats something unique!!!"}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Feb 21, 2009", "message": "While I'm sure this is necessary, the IP level rate limits are going to make things annoying here at my University.\n\nWe probably have around ~20 fairly avid SO users and when we are accessing the internet from our three major buildings we always have the same outward facing IP.\n\nSo, if someone posts a question from my school I'm going to have to time my question right or be forced to wait 10 or 20 minutes."}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Feb 21, 2009", "message": "The 10 minute and and 2 minute wait limits are arbitrary, but I think lowering the question limit to even 1/2 of that, 5 minutes, and you would still have your desired effect.\n\nYou basically wan't to sap the fun and effectiveness out of attempting to spam.  Being able to only post a question every 5 minutes would hardly be effective (or fun), they would get caught by the regular users in seconds and you would never have multiple messages up at once.\n\nI want you to consider lowing the question limit for those of us who are either behind a large school network, or even those people in a large company with a single outward facing IP."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Feb 21, 2009", "message": "@Simucal, maybe a clarification is in order. As I understand, it is also based on the user's reputation as well as IP address. Although, it does appear that new user would be stopped from asking/answer a question because another user behind the same IP address has high reputation and just asked/answered a question. Probably the logic should be more like that a user with &gt; 100 reputation will be *ignored* by the counter. You still have the issue of users sub 100 being blocked but this is sort of the issue trying to be solved."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 21, 2009", "message": "> probably the logic should be more like that a user with > 100 reputation will be *ignored* by the counter\n\nThat is already how it works: if your rep is > 100 you are totally immune to this rate limiter."}, {"author_name": "Chris", "gravatar_hash": "f89b5f030e5a8a254249d477f88b24f4", "author_url": null, "date": "Feb 21, 2009", "message": "Is that Flight of the Concordes?  I love Flight of the Concordes!"}, {"author_name": "Doekman", "gravatar_hash": "b83de2466ffbd28e6493ee2fcd796978", "author_url": null, "date": "Feb 21, 2009", "message": "With this scheme, you probably enforce users from their work to be registered, because you are behind a proxy (I don't mind)."}, {"author_name": "Edward", "gravatar_hash": "2c6276462696b307d9767a19aeec0dfa", "author_url": null, "date": "Feb 21, 2009", "message": "Think this was a real non-topic. That \"guy\" has gotten way much focus than he deserves.\n\n\"Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the Universe trying to produce bigger and better idiots. So far, the Universe is winning.\" -- Rich Cook"}, {"author_name": "Ch00k", "gravatar_hash": "421047fb267c76e6c848698f7a6bf161", "author_url": null, "date": "Feb 21, 2009", "message": "The fact that it was an Australian could have been assumed merely from the time it happened, even without an IP lookup.\n\nI'm sure you'd find that most of the offensive flags came from Aussies too.. i know I used up my 5 very quickly."}, {"author_name": "Grom", "gravatar_hash": "a14537020ec5b11fea3b956353724860", "author_url": "http://grom.zeminvaders.net", "date": "Feb 21, 2009", "message": "&gt; As if I needed another reason to hate Kangaroos and Koalas.\n\nThis post shows your ignorance of Australia. As if I needed another reason to hate buffalo.\n\n:P"}, {"author_name": "2pac", "gravatar_hash": "975052ff814f29c1144bcdfc059a3da8", "author_url": null, "date": "Feb 21, 2009", "message": "Hey guys,\n\nIt was only a bit of fun, I didn't mean any harm to the actual site or the users. I knew it would be handled pretty soon anyways so I figured I'd exploit it while it was available ;)\n\nOne correction, I wasn't copying and pasting the text, if you click back twice the text is kept intact by the browser and then you just type in the captcha and its posted (LOL)\n\nDon't hate me or all aussies for it (and especially not 2pac)!\n\nCheers."}, {"author_name": "Aaron Seet", "gravatar_hash": "3c4fe77ab5bf8851c0dd7da1b3d3960c", "author_url": "http://icelava.net", "date": "Feb 22, 2009", "message": "I'd bet the offended Australians won't be making noise if you were blaming Canada instead.\n\nGet a beer, mate! Less time getting angry at small matters, more time getting drunk and merry!"}, {"author_name": "lb", "gravatar_hash": "36f79355a0f99b6b033e479fcfffa51f", "author_url": "http://secretGeek.net", "date": "Feb 22, 2009", "message": "@Jeff et al\nAs an aussie, i'm not offended."}, {"author_name": "John", "gravatar_hash": "36266269d477a10e9e34d6c32756d255", "author_url": "http://obviouscode.com", "date": "Feb 22, 2009", "message": "I was pissed off for a day, largely at the inclusion of the video, which I still feel in unnecessary, but I'm over it now.\n\nJeff, you might like to keep in mind that sarcasm sometimes doesn't translate in text. You might like to look up something called 'emoticons' on wikipedia."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Feb 22, 2009", "message": "@John, no worries. You might get some criticism for your earlier response; however, I'd caution any U.S. participants to think I'd they'd feel if there was a similar video posted directed at the U.S. Many people would get very, very upset. :)"}, {"author_name": "David", "gravatar_hash": "1390df8051dd4455a02939d2ec3c6d55", "author_url": "http://davesquared.blogspot.com", "date": "Feb 22, 2009", "message": "Seriously, what do you expect from a nation of convicts???\n\nKind regards,\nAn Aussie :)"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Feb 22, 2009", "message": "Increasing the protection only creates an arms war, real spammers will use bot nets to generate different IP/users while you might find the whole of China/some some small country is proxied by a single IP.\n\nWhy not use the community to fight this? Increase the limits on number of closing/offensive votes (or perhaps for rep&gt;5000 or 10000 users)\n\nps. how do you associate these posts with your stackoverflow i?"}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Feb 22, 2009", "message": "Man, what is up with some of the Aussies getting pissed in this thread?\n\nI thought you guys were supposed to be laid back and have senses of humor?\n\nI immediately knew that Jeff was joking. He was trying to make light of a breach of security to his site with a little humor! Did you even watch that video?  It was hilarious!"}, {"author_name": "tupca.caput();", "gravatar_hash": "138b0a12c1e72df36f32db11737d04c8", "author_url": "http://espand.es/Media/curro.gif", "date": "Feb 22, 2009", "message": "Hey guys, It's nice with some anti noob restrictions.\n\nBut I think if someone's definition of having fun on friday night is to be hiphop gangster, pimping wine and trolling on a programmer forum, posting crazy posts all night long, like it was 1996!! \nThen you can't stop them.. they become CyberNinjaTrolls\nand will post more and more from the http://www.secretninjaproxy.info/proxy.php?q=aHR0cDovL3N0YWNrb3ZlcmZsb3cuY29t&amp;hl=3ed till their fingers bleed and disapear -&gt; http://espand.es/Media/curro.gif &lt;- the spammer in action!"}, {"author_name": "António Farinha", "gravatar_hash": "7ef637bfe1467faf361c768e9e6894f5", "author_url": "http://antoniofarinha.com", "date": "Feb 22, 2009", "message": "And what about people posting from a university or a company network?\nLimiting the activity based on IP may prevent some legitimate users from using the site."}, {"author_name": "Rolf", "gravatar_hash": "4e05ce4d768632d4dcdddf08d4ec5830", "author_url": null, "date": "Feb 22, 2009", "message": "\"In case it wasn't clear from the post.\"\n\nIt wasn't. Be careful what you post, Jeff. People can see it. It's the Internet."}, {"author_name": "Mike Thompson", "gravatar_hash": "42b52ea41d27140ff4405795e9e83e61", "author_url": null, "date": "Feb 22, 2009", "message": "And exactly what is the problem with Kangaroos &amp; Koalas?"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Feb 22, 2009", "message": "&gt;And exactly what is the problem with Kangaroos &amp; Koalas?\nJeff was young and needed the money, they said it was going to be artistic - you really don't want to know the details......"}, {"author_name": "lucasbfr", "gravatar_hash": "400e387db6de9e9870789adc387d6c21", "author_url": "http://en.wikipedia.org/wiki/User:Lucasbfr", "date": "Feb 23, 2009", "message": "Well, good luck it seems you got your first \"bored kid troll\"\n\nThey are such a nuisance (expect rotating IPs and cookie flushing next time, then it's open proxies and 4chan vandals ;)\n\nuse the ban hammer with extreme prejudice, and don't give them recognition :)"}, {"author_name": "Paul Annesley", "gravatar_hash": "f0b6cad84e199bbd863bf7459ff98870", "author_url": "http://paul.annesley.cc/", "date": "Feb 23, 2009", "message": "Easy on the Aussies, Jeff ... it was probably a Kiwi tunneling via Australia ;)"}, {"author_name": "nils", "gravatar_hash": "029097226fa97e7337231ca49025aa3e", "author_url": "http://www.pastelincheck.co.za", "date": "Feb 23, 2009", "message": "I've just run into a bug with this new rule - I have a rep of 71 and tried to ask a question - it had a validation error (because I'm not allowed to create new tags) - the form reladed and then wouldn't let me post the question. I'm waiting 10minutes now before being able to repost the question.\n\nI guess that's a hidden incentive to answer some questions to try to get above 100 rep points :)\n\n\nThanks"}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Feb 23, 2009", "message": "100 reputations can be gain in about 10 minutes, I really do not see any protection here. The spammer just need to answer 1 question (with something that make sense) that he will get 5 votes up easy... I guess Jeff is kidding us about the whole post... not only the Australian dissing or the 2Pac dissing. Is it 1 april? :D"}, {"author_name": "Dillie-O", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Feb 23, 2009", "message": "I've been around since the beta, and I'm no Jon Skeet either. But for me, I've found that getting 100 can often take me a week, and that includes all of my back posts that occasionally get upvoted.\n\nDo you think those limits will cause some kind of push back to the \"minimal friction\" required to participate in the site? \n\nI'd agree with Simucal and cut those values in half."}, {"author_name": "theman_on_vista", "gravatar_hash": "535397b708dc316389dd4041a2797496", "author_url": null, "date": "Feb 23, 2009", "message": "that puts my trolling to shame!!"}, {"author_name": "cow orker", "gravatar_hash": "7627b10c2f7d146bd7fe7ca2b14a25b6", "author_url": null, "date": "Feb 23, 2009", "message": "\"Is like if I go with my mother in law and tell her she’s the worst person I have ever met and ask her to stop getting in my life\"\n\nSo YOU'RE the guy who married my ex-wife!"}, {"author_name": "`Josh", "gravatar_hash": "495a64d940303ee6d0dcbede05c7f6aa", "author_url": null, "date": "Feb 23, 2009", "message": "Oh come on guys. I'm from Australia and I found that post hilarious! That video is a cracker. Get the pole from up outta yer..."}, {"author_name": "seanb", "gravatar_hash": "64d81504200a513c38baedc942468b85", "author_url": null, "date": "Feb 23, 2009", "message": "From Australia and not offended, it was probably a New Zealander over here collecting unemployment - no - joking really - I have in-laws who are Kiwis :)  \n\nIf only you could come up with a limiter based on IQ rather than IP.... maybe throw in the dastardly \"any\" key challenge?"}, {"author_name": "Tom", "gravatar_hash": "7eb23e7bdf1998556dcd368125dbe48e", "author_url": null, "date": "Feb 24, 2009", "message": "The responses seem to be divided into 4 main categories\n1) Australians who find the post funny.\n2) Australians who resent American TV, and thus America in general.\n3) Those fragile, delicate Tupac fans. \"Well perhaps you'd understand if you'd suffered like me and my friend Mr. Shakur...\"\n4) People who like Edge conditions."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 24, 2009", "message": "@tom \n\n#4 would seem to include \"all programmers ever born..\" :)"}, {"author_name": "dirkgently", "gravatar_hash": "19d1ce956fb43cea6297a63b30737575", "author_url": null, "date": "Feb 26, 2009", "message": "Reputation bug again: Sorry about that. But right now (26 Feb 2009) my Recent Activity &gt; Summary &gt; Rep count shows 183. OTOH, Recent Activity &gt; Reputatation shows only 183 counted, and no points for the 3 recent most up voted answers. Am I missing something -- a limit or somthing? Should I file this over at uservoices?"}, {"author_name": "Gamecat", "gravatar_hash": "0b4b433679e1fb52f7e2ef4ea492496d", "author_url": null, "date": "Mar 01, 2009", "message": "Great, anything that kills trolls rocks!\n\n@dirkgently, not a bug, the reputation period is in a different timezone (UTC) then the summary timezone (your local timezone). It got me confused for a while but this is how it works."}, {"author_name": "dirkgently", "gravatar_hash": "19d1ce956fb43cea6297a63b30737575", "author_url": null, "date": "Mar 04, 2009", "message": "@Gamecat: Thanks for the tip!"}, {"author_name": "J. Albert Bowden II", "gravatar_hash": "b805558f5db9300807f0865d59d238e3", "author_url": "http://bowdenweb.com/", "date": "Jan 02, 2010", "message": "i think the most disturbing thing about all of this is your hatred of kangaroos and koala bears. they is cool. so is you. quit hating playa."}, {"author_name": "Caue Rego", "gravatar_hash": "c6768f8be92fe851f2a5502fb9845778", "author_url": "http://www.cregox.info", "date": "Mar 02, 2010", "message": "Jeff, as a newcomer to the whole SO and meta community I may say the spam prevention system as a whole seems a bit off to me. While this rate limit sounds fine, and I have no complaints about it, the limited number of hyperlinks and the possibility, at least on meta, to get so easily downvoted have made the experience as a newbie to me quite frustrating. Not because of the reputation, but because having 1 rep won't allow those basic features.\n\nI'm pretty sure, just like in this case, those things were implemented with some good reason backing them up. I'm asking here to either reconsider that or give better explanation on why it works like this. At least on my case I'd feel much better if I could agree with the reason behind it.\n\nMy idea would be that, maybe, instead of having to HAVE the current reputation limit to not be considered a spammer, just achieving it could suffice. And, of course, at any time some moderator could revoke that from a user if it becomes clear the user started to behave as wrong as the one in this post. Just an idea, probably not the best, but I still feel something could be made better in that spam prevention system.\n\nAnd thanks for helping on developing such a great tool for us!"}, {"author_name": "Evan", "gravatar_hash": "1c4355386e6ccd2ad6622c55e69f698f", "author_url": null, "date": "Aug 21, 2010", "message": "Hello,\nI've just registered, never posted a single question, and I see the 20mn message that keeps me from posting. It has been 30min now since I registered, I still can't post. Bug ?\nThank you."}, {"author_name": "Ferret", "gravatar_hash": "c3b286f39f88af0f779bd8dd88b49077", "author_url": null, "date": "Oct 24, 2010", "message": "As an Australian who admits we aren't exactly the most inspiring body of people these days, I have to object to the singling out of Australia as the point of difference of the spammer. If anything it's more indicative of the mentality of the kind of person who idolises dead 'gangsta' rappers.\n\nSo take your fury out on the slums that breed that kind of fool and LAY OFF OUR KOALAS!"}, {"author_name": "Ferret", "gravatar_hash": "c3b286f39f88af0f779bd8dd88b49077", "author_url": null, "date": "Oct 24, 2010", "message": "As an Australian who just noticed the timestamp of the original post, I blame our geographical isolation and the difference in time zone."}, {"author_name": "mike", "gravatar_hash": "9dc4b5388a745145943d1b752174313c", "author_url": null, "date": "Sep 16, 2011", "message": "Hey, sounds good to me.  On my site I block not only 100% of Austrailia but 100% of China, India, Russia and most of Germay - soon to be all of Germany as well.  Too bad for them."}, {"author_name": "Gerry", "gravatar_hash": "8b4a1d7c40bc848c7ef34db4233ef540", "author_url": "http://gerard.caulfield.me", "date": "Jul 01, 2012", "message": "| The responses seem to be divided into 4 main categories\n| 1) Australians who find the post funny.\n| 2) Australians who resent American TV, and thus America in general.\n| 3) Those fragile, delicate Tupac fans. “Well perhaps you’d understand if you’d suffered like me and my friend Mr. Shakur…”\n| 4) People who like Edge conditions.\n\nUmmm I'm Australian and found the post funny, but I hate most American (and Australian) TV and I love Gangstas Paradise. Also, couldn't you just set up a bunch of accounts and have them all post through tor?\n\nSo yeah what does it mean if you fit into all 4?\n\nBTW, having designed creative spam captcha's in the past, I love your too quick to be human filter."}]}