{"response": [{"author_name": "marco.ragogna", "gravatar_hash": "b152453e24627505b5889e888585e55f", "author_url": null, "date": "Feb 13, 2009", "message": "Thanks a lot for improving the user experience of StackOverflow so often and so well!"}, {"author_name": "Tom", "gravatar_hash": "1f723dfb9076b9ecd32d191306b31d30", "author_url": null, "date": "Feb 13, 2009", "message": "I raised one question that is still very popular that relates to comments in code (yes, one of those questions).\n\nUnfortunately it generates a lot of answers (noise) that overwhelm the answers to the other questions that I would like to see (signal).\n\nIs there some way of putting a question or rather its answers into 'quiet mode'?\n\nThanks :)"}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Feb 13, 2009", "message": "This will very useful for when I go on my Honeymoon!"}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Feb 13, 2009", "message": "jeff - u ice cold, playa"}, {"author_name": "Rory Becker", "gravatar_hash": "9067207fa8d7277b738696bf506744cf", "author_url": "http://RoryBecker.blogspot.com", "date": "Feb 13, 2009", "message": "Great stuff... Roll on advances in this area.... Feel free to barrage me with any activity on my questions or comments as and when it happens :)"}, {"author_name": "John", "gravatar_hash": "500eed9baf68f3cb5eb9baa461b72247", "author_url": null, "date": "Feb 13, 2009", "message": "I'm still getting the following in google chrome when accessing stackoverflow.com:\nStack Overflow server has moved to: 69.59.196.211 - New server will be available soon!\n\nI've tried purging my cache and it's still giving that message to me."}, {"author_name": "William Brendel", "gravatar_hash": "18b6b068f92ee1b5408be98e7ecd4a9b", "author_url": null, "date": "Feb 13, 2009", "message": "@John\n\nThe DNS entry for stackoverflow.com might be cached by your ISP's DNS server, which would mean clearing your local cache won't help. Try pointing your computer at OpenDNS's servers.\n\nOpenDNS\nhttp://www.opendns.com\n\nQuick Setup Guide\nhttps://www.opendns.com/homenetwork/start/computer/"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Feb 13, 2009", "message": "While checking out this feature, I noticed another check box labeled: \"I'm open to employers (not recruiters) contacting me\".  Sounds like a great new feature.  Thankfully I have no use for it at the moment.  \n\nHow does it work and what's the story behind it?  How do employers get involved?"}, {"author_name": "Rahul", "gravatar_hash": "1374b43b692ccd9ed477697a8fa2a0e9", "author_url": null, "date": "Feb 13, 2009", "message": "This seems to be broken. I am http://stackoverflow.com/users/24424/rahul but got email for someone else's stackoverflow account."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Feb 13, 2009", "message": "There nice new features are very appreciated.\n\nBut, guys, never, never never ever, opt-in for your users to receive emails they did not expect. The mental switch between \"honest company\" and \"spammer\" takes a millisecond and that's often how much consideration the user is going to give the matter. The correct approach is to err on the side of politeness and inform the user about the ability to get notifications the next time he logs on.\n\nSo, now a user who didn't quite get into SO for some reason is going to start getting emails once a week as long as there's action in the questions he touched? If _that's_ the case, then it's pure spam, no two ways about it."}, {"author_name": "no", "gravatar_hash": "c98e55c606549bb438e83439e36bc96a", "author_url": null, "date": "Feb 14, 2009", "message": "\"We have taken the liberty of turning on the 'opt-in' email flag\"\n\nThis word, \"opt-in,\" I don't think it means what you think it means.\n\n\"We don’t spam\"\n\nThis one either.\n\nYou're not being a nice guy here, pointing out all the awesome stuff your old customers are missing after they stopped being your customers.  You're being a spammer."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 14, 2009", "message": "Rahul, forward the email to us.\n\nWell, this is modelled after what FriendFeed does. I don't recall opting in to email there, but I don't mind getting emailed a summary of people's replies to my posts, either.\n\nRemember -- this isn't a marketing email about how great SO is, it's a direct copy of people's responses to you. And not in the coy Facebook.com/Reunions.com way of \"ooh, there's an attractive member of the opposite sex interested in you, go to our site to see them\", either. We echo the actual responses* so you don't have to visit us at all to get the information.\n\n* well, first 300 chars, otherwise the email would be absurdly large"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://cznp.com/", "date": "Feb 14, 2009", "message": "\"Spam is the abuse of electronic messaging systems to indiscriminately send unsolicited bulk messages.\"\n\nI wouldn't count it spam since its not bulk, but its still walking the line pretty finely.\n\nAlso what's the deal with the \"I’m open to employers (not recruiters) contacting me\" if you could elaborate."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Feb 16, 2009", "message": "I don't think I'd call it spam, but I also wouldn't call it \"opt-in\" if the user hasn't explicitly taken an action.\n\n\"Automatic opt-in with one-click unsubscribe\" has another name: opt-out. (I know it's only for a subset of users, but even so, I think it's worth only using the term \"opt-in\" if that's what's *really* meant.)"}, {"author_name": "Dave", "gravatar_hash": "1c290dcb35805ebbee2ffb22a70ca9f5", "author_url": null, "date": "Feb 16, 2009", "message": "Jeff - bad decision to \"opt-in\" those people. To me spam is getting e-mails I don't expect or never signed up for.  Who cares if other sites do the same. Where are your principles?"}, {"author_name": "Ant P", "gravatar_hash": "9cdc90442db35b14a5007b737a516039", "author_url": null, "date": "Feb 16, 2009", "message": "Unexpected email, even legitimate ones, are a touchy subject for a lot of people.\n\nI remember one occasion when the admins of a fairly large site screwed up a third-party survey form mailer, and as a result about 50000 users got sent what seemed to be a phishing scam (I wonder if I've still got it saved somewhere...). The backlash was pretty nasty."}, {"author_name": "Andrew", "gravatar_hash": "e4dfe93cde31c450e5a5fc101e0b565c", "author_url": null, "date": "Feb 16, 2009", "message": "Being some who manages email infrastructure (among other systems), I cringed hearing in the latest podcast that you will be implementing email notification. This is simply because I know first hand the issues that you will (probably) encounter.\n\nIn order to minimize some of these problems, might I suggest that you implement two simple, light-weight and easy to implement techniques: VERP[1] and SPF[2]?\n\nVERP allows you to more simply trace email bounces and who they were originally meant for by encoding the destination email address within the 'Return-Path' mail header. This tries to eliminate the problem when someone is forwarding their email (or have it forwarded for them) to different accounts. Since you are already generating custom emails per person the major drawback of implementing VERP is negated.\n\nSPF, while I'm not a huge fan, should help reduce the chances of your messages from being flagged as spam. This works simply by adding specially formatted TXT record in your DNS zone file.\n\nI look forward to hearing your triumphant successes, bitching about your failures (and your lessons learnt) in a future podcast covering this subject.\n\n[1] http://en.wikipedia.org/wiki/VERP\n[2] http://en.wikipedia.org/wiki/Sender_Policy_Framework"}, {"author_name": "Will", "gravatar_hash": "7a0492b3fd266c7ebd65f3cfce437ebc", "author_url": null, "date": "Feb 17, 2009", "message": "I also want to put in a word for the \"don't be a spammer\" party.  \n\nEverytime someone does what you're saying you've done here (start spamming people against their expectations), it pisses in the email pool a little more.\n\nPeople who haven't visited it your site for 60 days might have decided they don't like it.   Why confirm  their dislike by spamming them?"}, {"author_name": "Jared", "gravatar_hash": "df2295610c6940e95160ce80b7b4e283", "author_url": null, "date": "Feb 18, 2009", "message": "I have to chime in with my agreement towards the criticism of your \"auto-opt-in\" policy.  For those 3000 people, it is certainly \"opt-out\" and not \"opt-in.\"\n\nSeth Godin, one of the original thinkers in this area, says this about 'permission based contact':\n\n\"Permission is like dating. You don't start by asking for the sale at first impression. You earn the right, over time, bit by bit.\"\n\nIf I were one of those 3000, I wouldn't mind getting a very personal-sounding note from you saying, \"Hey, we see that you haven't been around much, and we kindof miss you.  We thought that you might be interested in knowing that we can keep you updated on your questions and answers without making you come all the way out to our website and stare at the ads on the right side of our page.  If you're interested in getting weekly emails from us, follow this link.  Otherwise, we promise to leave you alone.\"\n\nIf I were one of those 3000 and you hit me with any other email, I would assume that you are evil, and be quite likely to never speak to you again.\n\nUseful, meaningful permission is hard to obtain and easy to lose permanently."}]}