{"response": [{"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Feb 12, 2009", "message": "YES!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"author_name": "Stewart Johnson", "gravatar_hash": "9f367b07b33be399fc8c13226d54adc2", "author_url": "http://bolidian.com/", "date": "Feb 12, 2009", "message": "I think you meant \"ad-homiNem\"."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Feb 12, 2009", "message": "Mostly irrelevant, but the filename should end with 2009.02.10.mp3, not 2009.01.10.mp3."}, {"author_name": "Robert C. Barth", "gravatar_hash": "c23ef823ae0ba03daf7675991deb3083", "author_url": "http://www.norimek.com/blog/", "date": "Feb 12, 2009", "message": "Jeff mentioned adding e-mailing capability to the site (or else I misunderstood what you were talking about wrt: SMTP, in which case ignore this comment)... you'll probably want to stick a queueing mechanism between the e-mail drop and the send e-mail code because the mail server is going to be too slow to handle the load of e-mails that'll be generated. You'll probably also want the e-mail server to be a different server than the web server."}, {"author_name": "Esteban", "gravatar_hash": "1a94125025af7fa5ab127175c2e6733d", "author_url": "http://adotnetdude.blogspot.com", "date": "Feb 12, 2009", "message": "Thank for bringing Uncle Bob in. \n\nEven though no one takes what you guys say 100% seriously, it is true that you should be a little more careful about what you do say."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 12, 2009", "message": "Who would possibly want to be taken 100% seriously? Policemen? Judges? Tax accountants?"}, {"author_name": "Steve", "gravatar_hash": "767934a648524da57388558217ad9c2d", "author_url": null, "date": "Feb 12, 2009", "message": "To be honest, Bob didn't address your main point, which was:  he doesn't write much code.\n\nAnd you're dead on about this:  most of the code he writes is snippets for his books and articles, so it's not surprising to see that he strayed into a world where software wisdom can be captured by oneliners (for example, he's also famous for advocating the fact that anyone who ships code that is not tested should be fired from their job...).\n\nI find it hard to pay attention to someone who keeps preaching extreme views while claiming to be \"agile\"."}, {"author_name": "Hyramgraff", "gravatar_hash": "23d82ea2162e72a5d0fd124d88141d2a", "author_url": null, "date": "Feb 12, 2009", "message": "Thanks for the shout out to my suggestion: http://stackoverflow.uservoice.com/pages/general/suggestions/114689-add-questions-with-an-open-bounty-to-the-unanswered-page-\n\nHopefully you'll get around to implementing it soon."}, {"author_name": "Kevin Lamb", "gravatar_hash": "819f7cf37b465094670a91979065f7da", "author_url": null, "date": "Feb 12, 2009", "message": "I think the issue I had was the comparison between large open source projects and internal corporate projects. I would agree that the \"quality\" may be better, but are the open source projects on any kind of deadline or pressure? If an open source project is not delivered on time, are the clients actually affected?"}, {"author_name": "Esteban", "gravatar_hash": "1a94125025af7fa5ab127175c2e6733d", "author_url": "http://adotnetdude.blogspot.com", "date": "Feb 12, 2009", "message": "@Jeff,\n\nWell, I found this podcast to be much better because Joel felt like he had to justify his words to be taken a bit more seriously. One of the best podcasts so far. \n\nAlso, just of the record: I'm still on you guys' side of the argument, but it was nice to hear the justification for your beliefs.\n\nThanks,\nEsteban"}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Feb 12, 2009", "message": "GUI Testing is hard. The \"let's just take a screenshot and make sure it's equal\" approach leads to some funny results when using Aero Glass :-)"}, {"author_name": "Kevin Dente", "gravatar_hash": "23c1e2063688620b75b248e08c0d5c24", "author_url": "http://weblogs.asp.net/kdente", "date": "Feb 12, 2009", "message": "&gt;Who would possibly want to be taken 100% seriously? \n\nClearly shooting for anything beyond being taken 90% seriously is a waste of effort and not really achievable. :P"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://cznp.com/", "date": "Feb 12, 2009", "message": "I was caught off guard by the fact that people took that quote so literaly. Were they only reading the text version of the podcast or what? Since i clearly understood its context and got where Jeff was going.\n\nI think sometimes people listen to you guys looking for flaws and then point them out to you... which is clearly a waste of time and energy."}, {"author_name": "Esteban", "gravatar_hash": "1a94125025af7fa5ab127175c2e6733d", "author_url": "http://adotnetdude.blogspot.com", "date": "Feb 12, 2009", "message": "@Olafur,\n\nI disagree: It's not a waste of time and energy to think about what Jeff &amp; Joel are saying and then talk about it.\n\nIf anything, it builds upon what their thoughts."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Feb 12, 2009", "message": "\"If an open source project is not delivered on time, are the clients actually affected?\"\n\nI'd say that the folks who use that project and depend on it are certainly affected.  They don't have as many direct ways to express their disappointment with the developers as customers of commercial software do (it's hard to vote with your wallet when the software is free).  There can be consequences though.  The Emacs/XEmacs fork occurred in part because a company that used Emacs as part of it's IDE wasn't satisfied with the speed at which certain features were being added to the next version (there was some disagreement about which features and their architecture too, but schedule played a role)."}, {"author_name": "David Schmitt", "gravatar_hash": "f41b1342c973956dba590327908cb349", "author_url": "http://stackoverflow.com/users/4918/david-schmitt", "date": "Feb 13, 2009", "message": "\" “If an open source project is not delivered on time, are the clients actually affected?”\n\nI’d say that the folks who use that project and depend on it are certainly affected. \"\n\nAnd in what way would this differ from schedule slippages in closed source software?"}, {"author_name": "Jeremy Anderson", "gravatar_hash": "611c688725819bb23742a714a9c33dfe", "author_url": "http://blog.code-adept.com", "date": "Feb 13, 2009", "message": "@Steve\nWhat do you mean Bob doesn't write much code.  Have you ever heard of FitNesse?  \n\nWhile it may be true that his day to day job may not be writing code these days, I believe he still knows much more than many of us about writing code."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Feb 13, 2009", "message": "\"Quality is Free\" is as relevant today as it ever was...\n\nhttp://www.amazon.com/Quality-Still-Free-Certain-Uncertain/dp/0070145326/\n\nhttp://www.amazon.com/Quality-Free-Philip-B-Crosby/dp/0451625854"}, {"author_name": "Shawn Swaner", "gravatar_hash": "6a7e8240d06204865718d3979120ccc0", "author_url": "http://www.shawnswaner.com", "date": "Feb 13, 2009", "message": "I have to say that I was a bit disappointed by this podcast.   First, Bob made two points about setting goals that are never meant to be reached, one about SOLID, the other about reaching 100% test coverage.  I don't like the idea of a goal that is never meant to be reached.\n\nSecond, while Bob has earned the respect to say whatever he wants, I am really disappointed that Jeff ad Joel did not stick up for themselves better.   I know that they had to do a little groveling after their comments in #38, but they have done something that I don't think Bob has done recently:  Build Great Software.   Stack Overflow rocks, it is fast and functional and the time to market was very short.   It sounds like Jeff didn't use TDD, didn't use SOLID and still made great software.   Listening to Bob's examples and comments I was left with two impressions: 1- this guy's points are more valid for 80's era C programming than for today's MVC pattern or webforms web development.  2- His examples seemed more textbook than real world.\n\nJeff has the coolest software on the block, and Joel is successful enough to have the coolest office on the block.   In my book that gives them more credibility than Bob's principles that seem more idealistic than real."}, {"author_name": "Ben", "gravatar_hash": "8fb95bde97cca5563771aafb7eeeab01", "author_url": "http://bensdeveloperblog.blogspot.com", "date": "Feb 13, 2009", "message": "I'm still shocked at how the entire Uncle Bob fiasco has turned out.\n\nAnd I'm not sure if this episode as changed anything.\n\nI've been programming for 6 years.  With each new project I work on, I strive to improve my code just a little bit more than the previous project.\n\nI'm not saying that I only write code that follows the SOLID principles.  I'm saying that do try to think about ideas like this (and many other ideas) while I write my code.\n\nMaybe I heard it incorrectly, but Joel and Jeff still seemed to think the SOLID principles were a waste of time.\n\nI think this episode was more confusing than helpful to the listeners."}, {"author_name": "MichalT", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl", "date": "Feb 13, 2009", "message": "May I know what is the source Jeff's hate for PHP? :) I'm referring to \"Wordpress is written in PHP which is a problem in itself.\" \n\nI don't see how using the most popular scripting language with a huge programmer base, easy and cheap deployment, great speed etc. is a bad thing, especially for this type of software. How would it be better if it was written in Java, C#, Ruby, x86 assembler, or whatever you consider a \"good\" language?\n\nOf course, PHP has its weak sides (for example, lack of consistency in base libraries' function names), but generally speaking I don't see it as inferior to other scripting languages, especially in the light of new features of PHP5.\n\nI think that one of the biggest reasons for the large amount of really bad PHP code out there is because PHP is so easy to start programming with. Did you know, that PHP lets you write a shortest possible (12 bytes) Hello World program? Just create a .php file, write \"Hello World!\" inside it, and run it with a web server :D\n\nOk, end of rant. And btw thanks for the podcast, I'm a big fan :)"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Feb 13, 2009", "message": "\"May I know what is the source Jeff’s hate for PHP?\"\n\nJeff has written a blog post on this topic called \"PHP Sucks, But It Doesn't Matter\"\nhttp://www.codinghorror.com/blog/archives/001119.html"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Feb 13, 2009", "message": "I have to say that Joel delivered quite a rejoinder to the people who have accused him of carelessly writing unmaintainable code when he said that they rewrote the compiler to get rid of a repeated switch statement.  By far the best line in the podcast!"}, {"author_name": "Andy", "gravatar_hash": "5c538989a286e442dfbc056bfaba6b0d", "author_url": "http://structured-solutions.net", "date": "Feb 14, 2009", "message": "Bob, \"That social security text field does not need to live in the UI and can be tested separately.\"\n\nWhat?"}, {"author_name": "Andy", "gravatar_hash": "5c538989a286e442dfbc056bfaba6b0d", "author_url": "http://structured-solutions.net", "date": "Feb 14, 2009", "message": "Bob claimed that the unit tests are a perfect spec, and anything else (his example was a written spec) is much less useful.\n\nAlthough \"perfect\" is probably overstating the point, I'm not convinced that investing in unit tests is worth the cost in every or even most real cases. Bob gave an anecdotal sample. Has anyone ever done a study of say 1000 projects with and without unit tests over the life of the product?"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Feb 15, 2009", "message": "@Esteban, taking things out of context and pointing it out to the person saying it, is a waste of time and energy.\n\nBut if they were to say stupid things within a correct context, then of course its fine to point it out to that person."}, {"author_name": "MichalT", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl", "date": "Feb 15, 2009", "message": "I've read Jeff's article on why PHP sucks, but the only actual example of said suckiness he gave was a list of functions and classes starting with an 'a' (that included functions from rarely-used modules like apache_*, apd_* and aspell_*.)\n\nIt's a bit like saying that Windows API sucks because it's backwards-compatibile and therefor has lots of extra calls available. For example, in PHP you can use the old style mysql_connect() type of database API, or you can just use the PDO objects (which are database-agnostic.)\n\nBut whatever, I'm just surprised that an experienced programmer didn't yet know that it's not the language, it's how you use it."}, {"author_name": "lb", "gravatar_hash": "36f79355a0f99b6b033e479fcfffa51f", "author_url": "http://secretGeek.net", "date": "Feb 16, 2009", "message": "Joel said in this podcast that he spent some time trying to find what Uncle Bob had said about 100% unit test coverage -- and that this was one of the things that sent Joel off on on a rant.\n\nActually -- Joel is mixed up. Joel went off on a separate rant, in episode 39, about the 100% unit test coverage thing. And that rant was inspired by a different hanselminutes episode. It was inspired by the episode where Scott Hanselman interviewed Scott Bellware. It was Mr Bellware who responded to Scott H's story about the OCD-colleague who strove for 100% -- and it was Mr Bellware who argued that 100% is a good thing to shoot for.\n\nVery good podcast -- I've listened to it twice (which is something I never do). \n\nI really hoped Bob was gonna thrash you guys, but actually you had him on the ropes once or twice. \n\nDo three more episodes like this plz."}, {"author_name": "Ant", "gravatar_hash": "125ef859d8914a657e420365c47d78c5", "author_url": null, "date": "Feb 16, 2009", "message": "Enjoyed the podcast, interesting points on both sides (apart from Jeff who sounds a bit junior to me, but hey ho)\n\nI'm personally an advocate of TDD and striving for losely coupled extensible code but that's based on personal experience of how it's helped me and I've definitely not always got it right but I always try to learn from my mistakes and improve in the future .. why anyone would deliberately make their own working life more problematic by leaving things in a mess all the time is beyond me"}, {"author_name": "bradtgmurray", "gravatar_hash": "e45a5c9fd07e92a412df56345d466146", "author_url": null, "date": "Feb 16, 2009", "message": "Minor nitpick, in the blog post you stated you answered one listener's question, but you have two listed.\n\nEnjoyed the podcast, as always."}, {"author_name": "lucas", "gravatar_hash": "9febd1080df5809007169389520e67a3", "author_url": "http://www.codingbliss.com", "date": "Feb 17, 2009", "message": "I think switch statements are evil, and you should consider a polymorphic switch (via Vistor Pattern) which encapsulates behavior within the objects it may make the concepts more advanced but it makes your life easier."}, {"author_name": "don", "gravatar_hash": "d9d90bf7139a56efb706b04631ae5cb6", "author_url": null, "date": "Feb 17, 2009", "message": "\"Bob’s SOLID principles are based on some well known conventions. I talked about the first one, the Single Responsibility Principle, in Curly’s Law: Do One Thing. You may have heard this before as Don’t Repeat Yourself (DRY), Once and Only Once, or Single Point of Truth.\"\n\nSRP is not the same as DRY or the others mentioned at all, at least as far as I understand it. DRY denotes not replicating the same code/logic multiple times (ie. avoid code duplication). SRP denotes having an entity implement one and only one thing (ie. very high internal cohesion)."}, {"author_name": "uhhuh", "gravatar_hash": "39e2ecd5b84aeadbe2fd7a2b419245e5", "author_url": null, "date": "Feb 18, 2009", "message": "\"You can always fix code quality — but fixing “nobody gives a crap about our product” is far more difficult.\"\n\nTwo words. Ashton Tate."}, {"author_name": "Andy Lee", "gravatar_hash": "760f982a2ae6de6835d23e98fe68c69f", "author_url": null, "date": "Feb 18, 2009", "message": "I like how Jeff skipped right over Joel's joke about files transferring faster because of all the zeroes.  :)"}, {"author_name": "Andy Lee", "gravatar_hash": "760f982a2ae6de6835d23e98fe68c69f", "author_url": null, "date": "Feb 18, 2009", "message": "I also liked Joel's offer to memorize any bit you want for a dollar."}, {"author_name": "David Worsham", "gravatar_hash": "90b89e0374962beaa1ac3148b5a94cc8", "author_url": null, "date": "Feb 19, 2009", "message": "Both podcasts and articles were an unfortunate lapse of professionalism on both Joel's and Jeff's parts.  I never have taken Joel all that seriously.  His innate arrogance makes it too difficult (though he is often an entertaining light read).  \n\nI did have more respect for Jeff before listening to his approach on developing Stack Overflow and his feeble arguments against software craftsmanship principles.  Seriously?  Quality doesn't matter?  We shouldn't come up with principles because they might get applied dogmatically or because they don't get understood by bad developers?  It seems that Joel and Jeff focus on designing metholodogies around bad developers and Uncle Bob focuses on developers who care about the craft."}, {"author_name": "MagicOPromotion", "gravatar_hash": "a160833d834e2b553591b7822c4e00e7", "author_url": "http://www.google.com/search?q=XRumer&lr=lang_en&aq=f", "date": "May 01, 2009", "message": "Well! I want to get software pack XRUMER 5.07 PALLADIUM for FREE. Any url???\nI'm so need this magic program! It's can break captchas automatically! Activate accounts via email automatically too! Absolutely great software! Help me!\nAnd did you hear news - price for XRumer 5.0 Palladium will grow up to $540 after 15 may 2009... And XRumer 2.9 and 3.0 - too old versions, it's cant break modern catpchas and cant break modern anti-bot protections. But XRumer 5.0 Palladium CAN!!!!\nSo help me for download this great program for free! Thanks!"}, {"author_name": "Cobus", "gravatar_hash": "49ac95dab91c2e3875c7ee986ec016ff", "author_url": null, "date": "Jul 09, 2009", "message": "This article might put SOLID into perspective.  I’ve read this before I knew who uncle Bob was.\nThree Sources of a Solid Object-Oriented Design (http://java.sys-con.com/node/84633).\n Better quality code might not shorten the initial roll out time, but it increase maintainability."}, {"author_name": "flatmate finders", "gravatar_hash": "aa3002ef7633f8d6df32a42751c5320b", "author_url": "http://clipartweb.info/", "date": "Apr 14, 2012", "message": "This is fantastic blog that delivers us something to laugh. Personally i think really fresh after every post to suit your needs. Keep providing us such posts."}]}