{"response": [{"author_name": "Chad Moran", "gravatar_hash": "14993d37dce5c8195458d3f6d6e47da6", "author_url": "http://www.chadmoran.com", "date": "Feb 25, 2009", "message": "Glad to see you guys got this episode done tonight.\n\nI agree with you it's worth it for \"technical debt,\" to go back and re-write a few things rather than piling crap on top of ... crap (aka polishing the tird)."}, {"author_name": "Steve", "gravatar_hash": "d607f119e8d6ce52f35aa24424a9c5a9", "author_url": null, "date": "Feb 25, 2009", "message": "I thought the ruler phone was some scam whereby people take photos of their credit card so someone could then view their credit card details and make lots of dubious payments. I guess this one isn't, but I'm not going to rush and buy it...basically because I don't have an iPhone anyway :) and probably won't have a credit for long either :-\\"}, {"author_name": "Mike", "gravatar_hash": "bc1e553159e545bdeefd61c6f2579e23", "author_url": null, "date": "Feb 25, 2009", "message": "There is a horrible misuse of \\Begs the Question\\ in an ad by Continental Airlines which appears regularly on some of my podcasts. It is like fingernails on a chalkboard."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Feb 26, 2009", "message": "Well beggers of questions cant be choosers of them :P"}, {"author_name": "mark hesketh", "gravatar_hash": "aa0c016460be0808931f0035356a6f9a", "author_url": null, "date": "Feb 26, 2009", "message": "Topical stuff - programmers and what you're worth - check out this intriguing post to techcrunch on leaked posts to a google group by fmr employees complaining of how disappointed they were with conditions/pay/etc..\n\nhttp://www.techcrunch.com/2009/01/18/why-google-employees-quit/"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Feb 26, 2009", "message": "I have an open item on uservoice, concerning the required 50-rep to leave a comment.  If anyone wants to add a few votes, it's here: http://stackoverflow.uservoice.com/pages/general/suggestions/86257-noobs-should-be-able-to-comment-on-answers-to-own-question"}, {"author_name": "matt b", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Feb 26, 2009", "message": "Joel seemed to be having a pretty bad experience at his hotel.\n\nCan he name which \"supposedly five star hotel\" he was staying at, so the rest of us can avoid having a potentially-equally-as-bad experience in the future?"}, {"author_name": "Brendan Erwin", "gravatar_hash": "5db5f7d4f5844f5aaa474b328d9269e2", "author_url": null, "date": "Feb 26, 2009", "message": "RE: Comments vs. Answered:\n\nIf a comment is left by a newbie user you should have the question owner/asker moderate the comment. That way they could leave the comment (instead of a bogus answer) but the asker of the question can protect his question from spam."}, {"author_name": "Nathan", "gravatar_hash": "ec2b04ac1bad14fea8244a78ef0f2133", "author_url": null, "date": "Feb 26, 2009", "message": "Note: the proverb is \"The love of money is the root of all evil\", it is different from money being evil."}, {"author_name": "LKM", "gravatar_hash": "9a200fdf4654e87050a992e7981de91c", "author_url": null, "date": "Feb 26, 2009", "message": "Your comments on Atlas were hilariously uninformed. It's basically Xcode and Interface Builder for Cappuccino/Objective-J. It has nothing to with and is not particularly similar to Visual Studio, and it has nothing to do with Objective-C, other than the fact that Objective-J is basically Objective-C in JS."}, {"author_name": "TorgoGuy", "gravatar_hash": "75a18d19362b3c207483389772ac664f", "author_url": null, "date": "Feb 26, 2009", "message": "Re: Salaries\n\nMy wife works for a bank and discussing your salary with others is grounds for termination. I work for a public university and my salary is available to anyone with an Internet connection.\n\nI prefer the university's policy to the bank's policy. The secrecy around salaries exist to benefit employers, not employees. It can benefit employers by 1) making it more difficult for competitors to figure out your compensation to deter \"poaching\" of employees, and 2) as a method of being able to pay employees as little as possible if someone is a poor negotiator. I think that's the primary reason they are a secret. \n\nAll heck *would* break lose in many companies if the \"salary excel file\" suddenly was discovered by the employees. The thing to keep in mind those is that that would be the employer's fault--if there was an objective, equitable compensation system in place then the employer would have nothing to fear.\n\nIf somehow things were reversed and it was customary for people to know each other's salaries then any employer who withheld that information would be looked at as being an employer hostile to its employees (in that regard).\n\nJoel's solution--i.e., 1) your salary is computed in as objective manner as possible, with no negotiating involved or allowed, and 2) you can derive what your peers in the company are paid by your own salary, seems to be a nice balance between openness and keeping some secrets for competitive reasons. Overall, an enlightened system I think. Kudos!"}, {"author_name": "Edward", "gravatar_hash": "2c6276462696b307d9767a19aeec0dfa", "author_url": null, "date": "Feb 26, 2009", "message": "Sounded like Jeff should read some about NVC \nhttp://www.cnvc.org/\nhttp://www.yesmagazine.org/article.asp?ID=837\nhttp://tinyurl.com/aft5zf"}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Feb 26, 2009", "message": "Joel's antihistamine buzz certainly mellowed him out. There should be a new rule that one of you will be stoned and/or sleep-deprived for every podcast, just to keep things interesting."}, {"author_name": "Doug Withau", "gravatar_hash": "a81a108522f894bbe6c6d14d0d90739b", "author_url": null, "date": "Feb 26, 2009", "message": "I will answer Matt Rogish's question. Yes, sometimes bad developers indicate a sickness in the organization. Sometimes they just happen.\nI've been there as a manager and had to let engineers go because they can not program. The problem I have see is that some software people can code, but can not write a whole program.\n\nI am assuming you are this person's manager.\nFirst, talk to HR. Don't mince words. Tell them this person is failing and you are moving them out the door. They will help with the legal side.\nSecond, talk to the person. Again, tell them they are not doing the job and if they don't change, they will be fired for cause. Put them on a performance improvement program. If it fails they are gone. Make that crystal clear.\n\nThe performance improvement program goes like this. This will require some patience as the manager.\nDivide all their tasks into 1-2 week chunks. No more than four tasks at a time. Talk to them about progress every day. Write it all down, give a copy to the developer and HR.\nThe first time through they will be trying to please, so all four tasks will get done. The second time something will slip, the third they are usually back to their old bad ways. That is why you must be patient.\nGo through Code Complete one chapter per week. Talk to them about it and how they can use it on there current task. \nStart having them schedule how long the tasks should take. If the estimates start to grow to crazy long forever times, this is a failure, note it with HR.\n\nBy the end of this, they have either improved and are contributing, or you have a fully documented list of failings. Problem is solved. Keep them or fire them.\n\nDon't put it off. Joel was right saying they are probably not happy. Don't let guilt or being a nice guy get in the way of the ax. They will be happier in time, so no guilt."}, {"author_name": "romandas", "gravatar_hash": "812cac3d389b39d59bab4d75f02c73f0", "author_url": null, "date": "Feb 26, 2009", "message": "Regarding incompetent programmers and finding ways to use them.. We had a guy who swore he was a web developer, but he couldn't seem to complete the simplest tasks (update a link, for example). He was very frustrated and stressed out most of the time as well; nice guy but in a bad position for him.\n\nWe switched him off development and into asset management.. and him and his trusty barcode scanner were the happiest team after that. He just needed to be in a position he could excel in. Development wasn't it."}, {"author_name": "Liam McLennan", "gravatar_hash": "8d683ec7f3beb00be43e72b17dd32560", "author_url": "http:hackingon.net", "date": "Feb 26, 2009", "message": "Lots of people died in those bushfires; not just koalas. Hilarious."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Feb 26, 2009", "message": "Let's see, a couple high points from the show ...\n\n(Paraphrasing)\n\n\"Money isn't a big deal ...\"\n\n\"Maybe you should fire yourself ...\"\n\nSo on and so forth. I think you guys should listen to yourselves sometime. :)"}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Feb 27, 2009", "message": "&gt; Joel’s antihistamine buzz certainly mellowed him out\n\nDefinitely. I’m listening to the theme from ‘Flash Gordon’ now, but it’s nowhere near as good as Joel singing it whilst hopped up on Sudafed."}, {"author_name": "wds", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Feb 27, 2009", "message": "The question about firing people was kind of shady, since this guy seemed to be suggesting not only firing someone but keeping him from getting a job at other companies as well. This is illegal in most western countries and for good reason. It's not because someone doesn't excel at your company that he won't be perfectly fine at another position at another company. And this kind of employers banding together to keep \"bad\" employees from getting hired is sooo industrial revolution.\n\nSeriously, nobody picked up on that?"}, {"author_name": "Matt Rogish", "gravatar_hash": "7ada38e9a6ef3216363a7e17880d0137", "author_url": null, "date": "Feb 27, 2009", "message": "wds:\n\nI didn't mean to imply that -- nor is this going on in my current company. \n\nIn previous companies, I'd see bad programmers being passed from team to team with disastrous results. I am not sure why, but no one wanted to fire them or tell the other teams \"You really shouldn't take this guy\". That's what I was wondering about -- how to do that. \n\nI like the general advice to not hire them in the first place but sometimes you inherit a team that isn't so great to begin with."}, {"author_name": "Robert C. Barth", "gravatar_hash": "c23ef823ae0ba03daf7675991deb3083", "author_url": "http://www.norimek.com/blog/", "date": "Feb 27, 2009", "message": "Begs the question explanation:\n\nhttp://www.wsu.edu/~brians/errors/begs.html"}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Feb 27, 2009", "message": "<em>In previous companies, I’d see bad programmers being passed from team to team with disastrous results.</em>\n\nI thought this is what you were getting at, and Joel and Jeff didn't really address this angle. Usually, the easiest way to get rid of an employee is to transfer him to a new department or give him a glowing recommendation for a new job at an unsuspecting employer. This is ethically questionable.\n\nOTOH, as wds says, \"spreading the word\" about a bad employee could be defamatory, and there's a legitimate ethical question whether you have sufficient information from your experience to, in effect, try to deprive him of a livelihood."}, {"author_name": "tracy", "gravatar_hash": "94e1c9619eb40db0d16de51f4d919bb4", "author_url": null, "date": "Feb 27, 2009", "message": "I have to second Joel's concern about the comments.  I've seen quite a few \"answers\" where people were trying to say why answer x was wrong but didn't provide an answer themselves.  Due to the way answers are displayed, it means trying to read answers gets really hard pretty quickly in these instances.  There have also been times where I couldn't provide a better answer but I could say that answer x was incorrect or missing a vital piece of content."}, {"author_name": "Joe Ganley", "gravatar_hash": "d86f7f0f4a01c0289f9ba65b023f243b", "author_url": "http://joeganley.com/", "date": "Feb 27, 2009", "message": "I started writing a comment about migrating database schemas, but it got so long that I turned it into a blog post: http://joeganley.com/2009/02/big-mistake.html"}, {"author_name": "Matias Nino", "gravatar_hash": "7a53888c3d36599e2d8d823269126957", "author_url": null, "date": "Feb 27, 2009", "message": "The \"learning Latin\" analogy to \"learning C\" applies!\n\nLearning Latin makes better commanders of the english language. \n\nhttp://ancienthistory.about.com/cs/whystudyclassics/a/whystudylatin.htm"}, {"author_name": "Bill Forster", "gravatar_hash": "47a91705f4c08e216cd9c23e51fdf9e2", "author_url": "http://triplehappy.com", "date": "Feb 27, 2009", "message": "Jeff uses 'Flight of the Conchords' to lightheartedly make fun of Australia(ns). Joel totally misses the point and assumes Jeff is confused about the difference between Australia and NZ. Jeff protests, but eventually gets steamrollered by Joel and gives up. Somehow I find this sort of thing amusing."}, {"author_name": "BCS", "gravatar_hash": "d68f8d8798ee2da0d94cda6d7a544c23", "author_url": null, "date": "Feb 27, 2009", "message": "Regarding getting rid of incompetents and nice managers:\n\nhttp://firesomeonetoday.com/"}, {"author_name": "Simon", "gravatar_hash": "31929daa6b7badf3573a41a8be340d19", "author_url": null, "date": "Mar 01, 2009", "message": "\"Money is the root of all evil\" is a misquote. The real quote is \"The love of money is the root of all evil\". Its about greed, which is exactly what you are talking about. If you shift the focus from quality of work to how much the programmer is being paid you are encouraging \"the love of money\""}, {"author_name": "aj", "gravatar_hash": "d81eddac7beb1f735484b0d5e0174257", "author_url": null, "date": "Mar 02, 2009", "message": "\"210+ and still counting\", that's how many koalas died in the recent bush fires near Melbourne, Australia.\n\nWhoops, sorry, that should be \"human beings\"!\n\nJoel / Jeff, it was in terrible taste to use the worst fire disaster in Australias history in one of your \"jokes\".  \n\nPathetic, just pathetic!"}, {"author_name": "Robert C. Barth", "gravatar_hash": "c23ef823ae0ba03daf7675991deb3083", "author_url": "http://www.norimek.com/blog/", "date": "Mar 02, 2009", "message": "The salary talk was interesting, however, many (greedy/cheap?) employers use information such as that to justify paying their developers sub-par salaries (gee, good developers do good work regardless of the pay they make. So that means I should be able to pay good developers near-nothing and save costs).\n\nPeople who talk about money motivation forget to mention (and encourage the above-mentioned behavior) that many (most?) people have a threshold at which they feel like they're being paid what they're worth. Pay less and they feel unappreciated. Pay more, and it really doesn't add to their level of satisfaction with that job (Maslow; Herzberg). The greedy/cheap employers never get this, at least in my experience."}, {"author_name": "PWills", "gravatar_hash": "57dcebe24f9d0359c214d21c8844c849", "author_url": "http://www.gratisinternet.com/careers/", "date": "Mar 02, 2009", "message": "RE: Compensation\n\nAll Joel did was punt the question. He more or less said \"everyone makes the same base but a substantial portion of employee compensation is in the form of profit sharing\".\n\nSo Joel... is the profit sharing formula public? Do all the employees know what percentage you and Michael get vis-a-vis the nonfounding employees? \n\nI'm interested in this topic, so I may have to dig up a telephone and actually RECORD A QUESTION (oh the horror!)."}, {"author_name": "Greg", "gravatar_hash": "5f6e3d553a8e81d64f1b64d21e240fc7", "author_url": null, "date": "Mar 03, 2009", "message": "Just to echo aj &amp; Liam above - the quip about the Australian bush fires was very poor taste. Over 200 people died - somewhat more serious than a few homeless koalas.\nComing on top of Jeff's Australia comments in his blog, it makes you wonder if he is trying to piss off a whole continent.\nThis just reinforces the stereotype that Americans know bugger all about what is happening outside of the USA."}, {"author_name": "Bill Forster", "gravatar_hash": "47a91705f4c08e216cd9c23e51fdf9e2", "author_url": "http://triplehappy.com", "date": "Mar 03, 2009", "message": "Jeff's Australia comments in his blog were entirely innocent and good natured. Anybody with a sense of humour can see that. Sheesh, I had a US co-worker once who would always add \"I'm kidding\" everytime he was being ironic and I would always counsel him \"Dude, you don't need to say I'm kidding, we get irony in this part of the world\". Maybe I got that wrong and everyone needs to say I'm kidding whenever they're not being serious? That would be a tragedy.\n\nHaving said all that, the bush fire thing was certainly in bad taste. Although I think that was surely down to Joel. Coverage of overseas news is often not much of a priority in the US and maybe we should give him the benefit of the doubt that he didn't realise how tragic the bush fires have been."}, {"author_name": "Marcus Booster", "gravatar_hash": "b7050cb8f45b952e892876bcef439457", "author_url": null, "date": "Mar 03, 2009", "message": "I went to Miami once and got deathly ill with food poisoning. Haven't been back because of fear."}]}