{"response": [{"author_name": "William Brendel", "gravatar_hash": "18b6b068f92ee1b5408be98e7ecd4a9b", "author_url": null, "date": "Feb 19, 2009", "message": "Can you give us the approximate monthly cost of underwriting? I'm just trying to decide whether I should bother pitching this at my company. $100s? $1,000s? $10,000s? ...\n\nIf that fails, you could support the show through sales of a novelty SO drinking game gift set. Perhaps a board game, with Scotch. \"Unhandled Exception: Take Two Shots\". That sort of thing."}, {"author_name": "William Brendel", "gravatar_hash": "18b6b068f92ee1b5408be98e7ecd4a9b", "author_url": null, "date": "Feb 19, 2009", "message": "And just to be clear, I only asked about a ballpark figure publicly because I assumed other listeners will have the same question. Even if the exact figures are semi-private, someone had to be the first to ask :-)"}, {"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Feb 19, 2009", "message": "@William I like the idea of SO Swag, much like the uservoice request...\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/102591-t-shirts-that-say-"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Feb 19, 2009", "message": "Nice podcast, I'd be very interested in a top 10 list for each tag in the system as you guys discussed.\n\nRegarding the older scripter co worker question. One thing i did to show an older co worker was to setup a scenario where i could show how some good coding principle would solve the issue.\n\nA simple example was OO where he had written a lot of functions that did basically the same thing but with a slight difference."}, {"author_name": "theman_on_vista", "gravatar_hash": "535397b708dc316389dd4041a2797496", "author_url": null, "date": "Feb 19, 2009", "message": "YES!! REJOICE!!!!! Its going to be a good day!!"}, {"author_name": "justlistening", "gravatar_hash": "1d1c24206c807b2c41d9d1a2736ac02c", "author_url": null, "date": "Feb 19, 2009", "message": "Haven't you guys seen office space - the older programmer dude is management material!!!!  Isn't that what companies do ?"}, {"author_name": "Bartek", "gravatar_hash": "81a7b5102336c191c73935c30ec45689", "author_url": "http://www.tatkowski.com", "date": "Feb 19, 2009", "message": "The last two minutes were comedy gold. You jovial laughs gave me a energy boost I sorely needed."}, {"author_name": "YHVH", "gravatar_hash": "6181a733c7c10b13387f123d604f31e6", "author_url": null, "date": "Feb 19, 2009", "message": "Joel suggests RAID 12, where you have half the data to prove you once had the data. A 20byte SHA would accomplish the same thing."}, {"author_name": "Greg H", "gravatar_hash": "910fc5bc3cc038f6539579ee6c9cea31", "author_url": null, "date": "Feb 19, 2009", "message": "Jeff,\n\"Begs the question\" does not mean what you think it does.\n\nBriefly, if you say something \"begs the question\" and then follow it with a question, you are using it wrong."}, {"author_name": "Kurt Leucht", "gravatar_hash": "a83572382e18c7f160bb1c0ea43f98ee", "author_url": "http://www.leucht.com", "date": "Feb 19, 2009", "message": "Congratulations, you guys apparently Slashdotted the Structure and Interpretation of Computer Programs\nVideo Lectures website.  When you click on a video, it says \"Due to heavy load the content you are looking for is temporarily unavailable. We are working on other means of providing this content\""}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Feb 19, 2009", "message": "@ greg h:\n\nhttp://en.wikipedia.org/wiki/Begging_the_question\n\nYou are correct, but the common colloquial use now seems to show jeff as using it in the more common, though historically incorrect, way.  \n\nnit picking jeff on that term seems to be a waste of time.  there are many other issues I would take up with him before that one..."}, {"author_name": "Kurt Leucht", "gravatar_hash": "a83572382e18c7f160bb1c0ea43f98ee", "author_url": "http://www.leucht.com", "date": "Feb 19, 2009", "message": "Nice podcast, guys.  You should always put bloopers or similar at the end of the podcast.  That's very funny!"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Feb 19, 2009", "message": "Jeff gave a mild criticism of Martin Fowler's Refactoring, saying it was a bunch of stuff good developers already know (I'm wildly paraphrasing, so don't misquote Jeff as saying that).  You could say the same thing about Code Complete 2, Desing Patterns, or The Pragmatic Programmer.  I think that's the point of these books.  They distill the knowledge one gains from years of programming experience into a book you can comfortably read in two weeks.  I think these are great books for new graduates and programmers with just a year or two of experience, as they help the newbies catch up with more experienced developers.\n\nBy the way, could you have the Community 'bot just automatically recommend those books in any question tagged 'book'?  They seem to get recommended approximately 200% of the time anyway (if you count duplicate answers), and this would be a good way to get some badges for the Community user.\n\nJoel, the phone number is on the podcast blog.  Why are you looking for a piece of paper? :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 19, 2009", "message": "Bill, I disagree. I found Refactoring to be overly prescriptive and tightly bound to the particulars of Java.\n\nCan't say that about Code Complete or TPP."}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Feb 19, 2009", "message": "In theory, I agree with Joel about Haskell. But I have to admit that in my case I think my experience with functional languages has made me a <em>worse</em> Java programmer. I spend a lot of time wishing I had closures, or trying to reinvent them."}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Feb 19, 2009", "message": "<em>You are correct, but the common colloquial use now seems to show jeff as using it in the more common, though historically incorrect, way.</em>\n\n\"Begging the question\" has literally jumped the shark."}, {"author_name": "Gwyn", "gravatar_hash": "acc637690f49e2b5a2146deb17874d6f", "author_url": null, "date": "Feb 19, 2009", "message": "Those last two minutes were awesome. Anyone playing the drinking game probably got alcohol poisoning though so sucks to be them."}, {"author_name": "Greg W", "gravatar_hash": "6ffe033e9c6b63e357c80c3133c847fc", "author_url": null, "date": "Feb 19, 2009", "message": "A thought occurred to me when the appeal went out for sponsors. I get that IT Conversations is non-profit and so needs funding, but StackOverflow is (a) a commercial venture and (b) gets a lot of free publicity on the podcast. So isn't Jeff kind of morally obliged to be the sponsor - at least when there are no other offers?"}, {"author_name": "Adam", "gravatar_hash": "e01d4fc7adb3dcd3101e13dc195c91ba", "author_url": "http://koldfront.dk/", "date": "Feb 19, 2009", "message": "Kudos to Joel for recommending Haskell - it makes a lot of sense to learn a functional language if you've never dug into one before, instead of learning yet another imperative more or less object oriented language."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Feb 19, 2009", "message": "You guys should probably read some of the classic papers on RAID, particularly by Patterson in order to really understand this stuff. The primary point of RAID 6 is not about \"it's slow to restore a large RAID 5 array.\" It is to tolerate to two simulataneous failures. As disks become very large, the probability of bits flipping on more than one disk goes on dramatically. If you want to know more there are some great papers available from the various FAST (File and Storage) conferences:\n\nhttp://www.usenix.org/events/fast08/"}, {"author_name": "Adam from PA", "gravatar_hash": "bc684f759c8823c66db152d9a00c087f", "author_url": null, "date": "Feb 19, 2009", "message": "Thanks for answering my question guys. I actually did just what you guys said. I learned a lot more about one of the things we are using, which another project down the road I am going to be using. A little late, but I appreciate it all the same!"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Feb 19, 2009", "message": "\"The primary point of RAID 6 is not about “it’s slow to restore a large RAID 5 array.” It is to tolerate to two simulataneous failures.\"\n\nI think he mentioned the slowness of restoring a large RAID 5 array because the primary scenario for two simultnaeous drive failures is when you have one failure, do the hot swap, then have a second failure before you're finished rebuilding the array."}, {"author_name": "BCS", "gravatar_hash": "d68f8d8798ee2da0d94cda6d7a544c23", "author_url": null, "date": "Feb 19, 2009", "message": "That bit at the end was \"da bomb\" :) OTOH only do it if you actually have something funny to put in. It would be lame if it was put in \"because you have to\"."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Feb 19, 2009", "message": "@Chris, I see but that still isn't the primary scenario. With larger and larger disks, the probabilities of more than one fault increase greatly, that's the biger problem. But definitely, I agree that can be issue as well.\n\nAnyway, this was the worst video game ever! :)"}, {"author_name": "Sorin", "gravatar_hash": "7a55a40c6b627da764abfcb852beb5b3", "author_url": "http://webpro.mocanu.net/www/", "date": "Feb 20, 2009", "message": "FWIW, RAID 10 is not \"RAID ten\" but rather \"RAID one-zero\". It's not necessarily the 10th revision, but a combination of RAID 1 and RAID 0.\n\nIs there any study for RAID 10 vs RAID 6 when you have 4 drives?"}, {"author_name": "Mwanji Ezana", "gravatar_hash": "ae8715093d8d4219507146ed34f0ed16", "author_url": null, "date": "Feb 20, 2009", "message": "I actually started learning Haskell a few days before listening to the podcast. Real World Haskell is a great book and is available online for free: http://book.realworldhaskell.org/read/"}, {"author_name": "brad dunbar", "gravatar_hash": "0168f51cd822a820c606c259b80e253f", "author_url": "http://beedii.com", "date": "Feb 20, 2009", "message": "+1 for Haskell!  I love functional programming, and I'm glad other people are starting to as well."}, {"author_name": "Mr. Shiny &amp; New", "gravatar_hash": "d78a43ac94c1c0d6cf5740efd7574928", "author_url": "http://eternalephemeron.blogspot.com", "date": "Feb 20, 2009", "message": "Joel, in the podcast, says that Linus Torvalds doesn't do object-oriented programming.  Actually he does, the Linux kernel is very OO.  It just doesn't use C++.  There are many OO principles applied and lots of structures with polymorphic behaviour and similar.  Take a look at the device drivers or filesystem drivers and you'll see what I mean."}, {"author_name": "Jörg W Mittag", "gravatar_hash": "1f1d81bc927dd67f05ea41f4c8a61e9f", "author_url": "http://StackOverflow.Com/users/2988/", "date": "Feb 20, 2009", "message": "I don't mean to stir up the whole TDD/SOLID debate again, but I couldn't help but post these few quotes from Podcasts #38 and #42. They are just for amusement only, no judgment is implied.\n\nHere is Joel Spolsky in Podcast #42: \"I think it is fundamentally not a correct argument to make, to say: 'your opinion is invalid because you do not have experience with this thing.'\"\n\nAnd here is Joel Spolsky in Podcast #38: \"And, when I was listening to them, they all sounded to me like extremely bureaucratic programming that came from the mind of somebody that has not written a lot of code, frankly.\"\n\nAlso Joel from #38: \"People that say things like this have just never written a heck of a lot of code.\"\n\nAnd again: \"[...] I don't think these people write very much code if they're coming up with these principles [...]\""}, {"author_name": "Sea Cat", "gravatar_hash": "2abd38ddac19147e8a180e970f09d9e7", "author_url": "http://sea-cat.info", "date": "Feb 20, 2009", "message": "Jeff, you ignorant slut! \n\nPrior to getting into computer programming I took high-school and college level Latin, as well as Aristotelian logic/philosophy. I cannot think of a better course of study for prospective computer scientists than Latin and Philosophy. Between the two courses a student learns more about linguistics and syntax (Latin) and how to think logically and coherently (philosophy) than any other tandem of academic disciplines.\n\nAnd speaking of languages: it true both in human and computer languages that certain concepts are only possible in certain languages. Think of the words that exist in only one language (or the languages from which they were borrowed). Prior to inventing the term \"eccentric\" there was no middle ground, conceptually, between \"insane\" and \"socially acceptable\" (and it says something about the Brits that they invented this word first). Likewise, the German concept of \"schadenfreude\" couldn't have come from any other culture, and outside of Italy there is little appreciation for, or any compelling need to invent a word like \"spretzatura\" to express the idea it represents. And since you mentioned Latin, it's interesting to note that there aren't the words \"yes\" and \"no\" as we understand them in English: they go about communicating affirmative and negative answers differently.\n\nThe point being -- and I agree with Joel on this -- the purpose for learning a new language is to learn the way of thinking, or the world-view that goes with it. Whether it's Haskell or Koine Greek, there is much to be learned from obscure languages that can be applied to every-day usage and thinking, even if you never apply those concepts directly in the given language."}, {"author_name": "Sea Cat", "gravatar_hash": "2abd38ddac19147e8a180e970f09d9e7", "author_url": "http://sea-cat.info", "date": "Feb 20, 2009", "message": "If I had proof-read that more thoroughly before hitting the submit button, I would have spelled Sprezzatura correctly: two Zs."}, {"author_name": "CrashCodes", "gravatar_hash": "49f2a40f1920e1b1168e91540106f5f8", "author_url": "http://crashcodes.com", "date": "Feb 20, 2009", "message": "Dear Jeff, please review critical thinking / logical fallacy concepts. Attacking the experience of the arguer does not invalidate an argument. \n\nSaying you suck at Math would never invalidate your argument of \"2 + 2 = 4\". The fact that \"2 + 2 = 4\" has nothing to do with the topic may invalidate it, but your Math skill wouldn't."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Feb 20, 2009", "message": "Greg H:\n\n\"Jeff,\n“Begs the question” does not mean what you think it does.\n\nBriefly, if you say something “begs the question” and then follow it with a question, you are using it wrong.\"\n\nWell, I was going to say something about a few of these things but since you opened the door. The concept of \"validity\" is a bit different also:\n\nhttp://www.philosophypages.com/dy/v.htm#valid\n\n:)"}, {"author_name": "Toby", "gravatar_hash": "96740d60ab3cbb8ec65ddbbf5b45afba", "author_url": "http://toobstar.wordpress.com", "date": "Feb 22, 2009", "message": "I agree with Joel's comments on whether experience is necessary (or not) in order to have a valid opinion on something but I'm not sure that you could say arguing about whether someone's opinion is valid based on their experience is 'ad hominem'.  Many examples here of what's in or out.. \n\nhttp://plover.net/~bonds/adhominem.html\n\nWould be glad to hear an experts opinion on this though.  :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 23, 2009", "message": "> Saying you suck at Math would never invalidate your argument of “2 + 2 = 4″. The fact that “2 + 2 = 4″ has nothing to do with the topic may invalidate it\n\nI'm saying if you have *no idea what math is*, and *have never done it*, is your opinion that 2 + 2 = 4 (or isn't 4) still valid?"}, {"author_name": "Sajal Dutta {Saj}", "gravatar_hash": "04625e9362d332cc1dad3efa6a2a4328", "author_url": null, "date": "Feb 23, 2009", "message": "Joel's thought on learning a new language is beautiful. That's how new programmers should start. They should not start with Java/C#, rather they should start with C/C++. The lower, the better. The base should be strong which is hard to find in new developers.\n\nThanks Joel!"}, {"author_name": "Tim Ring", "gravatar_hash": "34b59e4c2e2e6499db0a3e246cb54964", "author_url": null, "date": "Feb 24, 2009", "message": "Long ago (in the time of 300b modems, also known as ye olde days of yore) we needed to send a approx 4 MB of data to the States (from Ireland). We contemplated sending it via modem but it was considerably cheaper and actually faster to send it on three floppies by FedEx."}, {"author_name": "Martin", "gravatar_hash": "aa3657dc1c20c8ea33264155f8555f87", "author_url": null, "date": "Feb 24, 2009", "message": "I think the name of the Polish gentleman who left a question was Michał Tataranowicz. Just in case you want to update that show notes."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Feb 25, 2009", "message": "@JeffAtwood: \"I’m saying if you have *no idea what math is*, and *have never done it*, is your opinion that 2 + 2 = 4 (or isn’t 4) still valid?\"\n\nIt depends on what you mean by opinion. Validity doesn't rely apply to \"opinions.\" Anyway, if someone uttered the statement \"2+2=4,\" that person would have uttered a correct statement, regardless of whether or not that person knew what it meant. It's very odd and I'm not sure what your point is to bring up someone who has \"no idea what math is;\" there may be an interesting epistemic discussion about whether that person could be said to \"know\" that \"2+2=4\" is true or not. You are sort of, in a round about way, getting toward the Gettier Problem. However, that only applies to knowledge, not whether one's utterances are true or not. \n\nAnyway, to determine the validity of arguments, you necessarily do not need any information other than the argument itself. Incidentally, validity does not imply soundness. However, soundness is another property that does not depend on any qualities on the one making an argument. If what you proposed was true, logic would be a very strange thing indeed."}, {"author_name": "Alex Daman", "gravatar_hash": "d00740499b09c1387a121b41f1f8317e", "author_url": null, "date": "Feb 26, 2009", "message": "Joel and Jeff's argument about whether not having experience factors into credibility of your position reminds me of Spock and McCoy's argument in Star Trek IV--it went something like:\n\nSpock:  It would be impossible to discuss the subject without a common frame of reference--\nMcCoy:  You mean I have to -die- to discuss your insights on death?"}, {"author_name": "Jason Punyon", "gravatar_hash": "44302dd1c18f747ba4fff5f689c475ba", "author_url": null, "date": "Feb 26, 2009", "message": "Joel, \n\nA few podcasts ago you talked about how you now require that someone sign their name when they make a non-trivial statement on your discussion boards, so that you can hold them accountable and evaluate their statements in the context of their reputation (paraphrasing).\n\nThis is diametrically opposed to the statements you made in this episode about ad hominem arguments.  If you're using someone's reputation or experience at all in any evaluations of their arguments, you're engaged in the very ad hominemism you're rallying against."}]}