{"response": [{"author_name": "lubos", "gravatar_hash": "c4924ce2b51b9a550e3baafce3af25b9", "author_url": null, "date": "Feb 05, 2009", "message": "awkward beginning but it turned out to be pretty good once jeff jumped into conversation. sorry, but joel is not really good moderator :)"}, {"author_name": "SeeR", "gravatar_hash": "906d6f175b55fc3fec15e00c3cc6c8e7", "author_url": "http://seermindflow.blogspot.com/", "date": "Feb 05, 2009", "message": "UUU, Am I hearing correctly - Uncle Bob in next episode\n\nA little smackdown is coming :-)"}, {"author_name": "Gishu", "gravatar_hash": "69772f0246d5013d72703967b8761e89", "author_url": "http://madcoderspeak.blogspot.com", "date": "Feb 05, 2009", "message": "Term for the day : http://en.wikipedia.org/wiki/Kayfabe\nUncle Bob vs Joel - no holds barred. Bring it on! :D\n\nHonestly can't wait for #41"}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Feb 05, 2009", "message": "thank you\nthank you\nthank you\nthank you\nthank you\nthank you\nthank you\nthank you\nthank you\nthank you\nthank you\nthank you\nthank you\nthank you\nthank you\nthank you"}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://pro.robspages.net", "date": "Feb 05, 2009", "message": "A Bit off topic but does anyone else have trouble getting the podcast to play (popout or direct) in Goggle Chrome on Vista?"}, {"author_name": "Dave", "gravatar_hash": "6ec6d5eec001b5bd0bcf93ff01f6c553", "author_url": null, "date": "Feb 05, 2009", "message": "Great podcast. How come you didn't ask him why he calls himself Rands?"}, {"author_name": "Nick", "gravatar_hash": "fc8d4185fa3b625094482ef462159f57", "author_url": null, "date": "Feb 05, 2009", "message": "I'm looking forward to listening to this one.\n\nAs for using Stack Overflow as a hiring tool: If I was interviewing someone who had a large SO reputation, I'd wonder how they found the time to do it, what their motivation was for doing it and why they felt the need to tell me. I'll admit that I'm biased though - I just don't get the obsession with collecting reputation/badges, especially when it's for the purposes of showing the world how great one is.\n\nKeep up the good work."}, {"author_name": "Erin", "gravatar_hash": "33f9658cbf25c3374c926a49ebba55b1", "author_url": null, "date": "Feb 05, 2009", "message": "I think that a little understanding of personality types goes a long way in knowing how to manage people.  I'd suggest checking out Linda Berens work specifically on temperament and interaction styles.\n\nhttp://www.interstrength.com/curriculum/interactionstyles.html\n\nhttp://www.interstrength.com/curriculum/temperament.html"}, {"author_name": "Markus", "gravatar_hash": "9b6a57e0d920fe7ae5ae946106dd7147", "author_url": null, "date": "Feb 05, 2009", "message": "Regarding managing difficult people: Joel should take a look at Adrenaline Junkies and Template Zombies from Tom De Marco."}, {"author_name": "David", "gravatar_hash": "323b4cf7a4bc57da978df02e433ec91a", "author_url": null, "date": "Feb 06, 2009", "message": "I must say, Joel and Jeff, your guys' podcast really makes my day."}, {"author_name": "Adam", "gravatar_hash": "573fbee92f89bedf849872526354e363", "author_url": "http://rumandcode.com", "date": "Feb 06, 2009", "message": "re. your view on telecommuting in software teams, I think spending some time on (forgive me) an open source project with a fairly large team and scope would be a benefit.\n\nI was lucky enough to spend a few years working on a 20+ dev team to build a game server emulator and together we built a really impressive piece of software without ever having met in person or even spoken on the phone."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Feb 06, 2009", "message": "\"A Bit off topic but does anyone else have trouble getting the podcast to play (popout or direct) in Goggle Chrome on Vista?\"\n\nI'm running Chrome on Vista and don't have any problems doing either."}, {"author_name": "Grom", "gravatar_hash": "a14537020ec5b11fea3b956353724860", "author_url": "http://grom.zeminvaders.net", "date": "Feb 06, 2009", "message": "On the topic of math: http://www.maa.org/devlin/LockhartsLament.pdf"}, {"author_name": "Ian Varley", "gravatar_hash": "f671bc1d0b48c1b03402cd6fe2c369c6", "author_url": "http://www.ianvarley.com/", "date": "Feb 07, 2009", "message": "On the local vs. remote debate: what about the idea of being \"partially remote\"? I.e., you work part of your time together, and part alone. I think that's a great model for programmers, because while you're right that having face time and the ability to walk up and chat with someone is invaluable, so are large stretches of quiet and concentration. Even if you have your own office, it's just damn hard to get some difficult things done unless you can lock yourself in a room for n hours.\n\nSo why not decide on interleaved stretches of in person and remote time? It could be daily (we're all here from 10-2, outside of those hours you can be at home) or weekly (everybody is in the office on Wednesday and Thursday, and works from home other days) or monthly (we're all together one week a month). I do something like that in my job today, and it works quite well (for me, anyway). That solves the commute thing (less rush hour traffic), and will probably make awesome people happier."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Feb 07, 2009", "message": "In t he topic of outsourcing and non US shrink wrapped software.\n\nDevelopers from Eastern Europe, Russia and Israel produce software which is innovative. Software that make me ponder \"How did they do that?\" or \" I wish I can peek at the source code\". These are code crafters and masters.\n\nDevelopers from India, sorry to say, are what I call \"Code Donkeys\". They do crud, boring, repetitive nothing innovative business applications and in many occasions they need blue prints and directions on how to start. I have never seen any shrinkwrap software made in India. \n\nI have been outsourcing some of my personal programming needs to developers from Eastern Europe, Latin America and India. The ones from India give me the hardest time. They might be the cheapest but that also could very well mean low quality!"}, {"author_name": "Nathan Fellman", "gravatar_hash": "898c2217a5457bdef0a0ed58283010dc", "author_url": null, "date": "Feb 09, 2009", "message": "Another off-topic, but relevant to the podcast in general.  Have you guys considered moving the transcript wiki out of the fogbugz domain into the stackoverflow one?  It makes sense that if the blog is at blog.stackoverflow.com and I can send questions to podcast@stackoverflow.com, that the transcript wiki should be at transcript.stackoverflow.com or something similar."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Feb 09, 2009", "message": "I am interested in hearing the news behind Joel's two (or more) references to getting sued or getting the the smackdown about some comments he made.  I assume it was the \"these guys must not code\" comment in the prior episode about Bob Martin and his \"make an interface for every method you call on an object\" stuff."}, {"author_name": "Dean", "gravatar_hash": "03c41a555b6a47d38fbb0b5554732e7d", "author_url": null, "date": "Apr 21, 2010", "message": "@Abdu: Sorry for your troubled experience with people from India but unless you have actually worked with all the billion or so of them and have received all bad results your generalization is just that ... generalization.\n\nI have done a lot of business with people from Israel,  Eastern Europe, India and China and have had both good and bad experiences with all of them.\n\nLet's hope people won't take your one comment and generalize the whole stackoverflow site as idiotic."}, {"author_name": "Wakjob", "gravatar_hash": "d47dc87c33a9c260cc5999b4a59bb190", "author_url": null, "date": "Oct 06, 2010", "message": "Companies ruined or almost ruined by India, Inc.:\n\nPeopleSoft\nAirBus (Qantas plane plunged 650 feet injuring passengers when its computer system written by India disengaged the auto-pilot).\nSun Micro\nBell Labs (Arun Netravalli - head, closed, turned into a shopping mall)\nQuark (Alukah Kamar CEO, fired)\nSkype (Madhu Yarlagadda fired)\nMIT Media Lab Asia (canceled)\nIntel Whitefield processor project (cancelled, Indian staff canned)\nApple R&amp;D CLOSED in India in 2006\nComAir reservation system\nBoeing Dreamliner ILS and collision detection software (written by HCL)\nLehman (Spectramind software bought by Wipro, ruined, trashed by slumdog programmers)\nDell, United, Delta call centers (closed in India because Premji's conmen don't even know how to use telephones, let alone computers)\nHSBC ATMs (software taken over by Indians, failed in 2006)\nAIG (signed outsourcing deal in 2007 in Europe with Accenture Indian frauds, collapsed in 2009)\nQantas - See AirBus above\nState of Indiana $867 billion FAILED IBM project\nWorld Bank (Indian fraudsters BANNED for 3 years because they stole data).\n\nI could post the whole list here but I don't want to crash any servers."}]}