{"response": [{"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Feb 17, 2009", "message": "Is there a plan for the Generalist badge? I'm not entirely sure it makes sense any more...\n\nNice work on the specialist badges though :)\n\nAre these badges \"hard-coded\" somewhere, or does it apply organically for *any* tag?"}, {"author_name": "Cd-MaN", "gravatar_hash": "1227b1bc14e774be69b4c4bdea24d3a9", "author_url": "http://hype-free.blogspot.com/", "date": "Feb 17, 2009", "message": "Very cool. I immediately went to my badges page to check it out. However, something seems wrong:\n\nEven though my badges page shows 9 gold badges, they aren't shown besides my nick (in the header area of the page). It only shows the number of silver and bronze badges (and I'm not entirely sure that their count is correct)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 17, 2009", "message": "check again"}, {"author_name": "Reto Meier", "gravatar_hash": "4fb837e697c4142468b05c8f34e1cc49", "author_url": "http://blog.radioactiveyak.com", "date": "Feb 17, 2009", "message": "One unfortunate effect of how these badges are allocated is that they don't show 'specialist' so much as 'person who is very active in a popular subject'. \n\nI had hoped specialist tags would be based on the percentage of answers / upvotes for a particular tag. The current system rewards people for being active in popular areas, rather than answering a lot of the questions in a particular area.\n\nThe numbers (400/1000) are normalized based on the most popular tags (Java, .NET, Python, etc.) so people who are active in less popular groups (Android, iPhone, etc.) will never see them."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 17, 2009", "message": "> so people who are active in less popular groups (Android, iPhone, etc.) will never see them.\n\nyes, but over a period of 12 months, I would expect those to materialize. Old posts can continue to get votes forever.. until the question itself reaches 30 answers and becomes community wiki."}, {"author_name": "Cd-MaN", "gravatar_hash": "1227b1bc14e774be69b4c4bdea24d3a9", "author_url": "http://hype-free.blogspot.com/", "date": "Feb 17, 2009", "message": "@Jeff: ok, my bad. I mistook the \"global\" badges for my badges page. I, of course, don't have any gold badges :-).\n\nSorry for yelling fire."}, {"author_name": "Reto Meier", "gravatar_hash": "4fb837e697c4142468b05c8f34e1cc49", "author_url": "http://blog.radioactiveyak.com", "date": "Feb 17, 2009", "message": "&gt; over a period of 12 months, I would expect \n&gt; those to materialize. \n\nMaybe, but over the same period there will be a significantly larger number of silver and gold in the popular groups. Given that it's a set number, rather than a proportion, it's always going to be much easier to get votes / specialist badges in the 'big' topics. \n\nThen again, maybe that's not a bad thing - to get a specialist badge in a less popular group might be a more impressive as they'll be so uncommon."}, {"author_name": "Juzn Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Feb 17, 2009", "message": "I don't think it would be a bad Idea for people to get subjective, off-topic, not-programming-related badges... I believe nobody would want them so they would refrain from participating/creating this type of questions"}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Feb 17, 2009", "message": "There are 3 people with subjective silver badges :) ... waiting for the gold one ..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 17, 2009", "message": "Well, I would argue that this says more about the irrelevance and abuse of the \"subjective\" tag than anything else..\n\nBut for fun, you can try to imagine how many \"subjective\" badges there would be if the calculation included community wiki answers (hint: A LOT)"}, {"author_name": "Mac Gravell", "gravatar_hash": "b4ae7f8b50a2c32287e456394570679e", "author_url": "http://marcgravell.blogspot.com/", "date": "Feb 17, 2009", "message": "Out of interest, is it correct that I show 2 gold \\tag\\ badges on my details page, but only 1 gold on my avatar/summary?"}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Feb 17, 2009", "message": "I'd say about 8000"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Feb 17, 2009", "message": "If the calculation included the community wiki answers, I'd nearly have a jon-skeet silver badge :)\n\n@Marc: I noticed that. Odd."}, {"author_name": "Mike Woodhouse", "gravatar_hash": "5978e2ed3a31f1bd2361dbb919d92012", "author_url": "http://grumpyop.wordpress.com", "date": "Feb 17, 2009", "message": "What, Ruby doesn't get a badge? No fair. And what about Delphi, Cobol, APL, PL/1 (actually I'm not sure about the last 3...)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Feb 17, 2009", "message": "@Mike Woodhouse: My guess is that Ruby etc will get badges as soon as someone gets 400 upvotes in those tags. I'd hope so, anyway."}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Feb 17, 2009", "message": "Disappointed about the exclusion of CW answers.  I would be a \"not-programming-related\" specialist, a \"fun\" specialist and well on my way to being a \"jon-skeet\" specialist.\n\nNow I'm going to have achieve specialist badges via proper answers."}, {"author_name": "Reto Meier", "gravatar_hash": "4fb837e697c4142468b05c8f34e1cc49", "author_url": "http://blog.radioactiveyak.com", "date": "Feb 17, 2009", "message": "@Mike Woodhouse: See my earlier comment - the less 'popular' categories aren't going to see any specialist badges for a while yet."}, {"author_name": "JaredPar", "gravatar_hash": "215d7677cc03d242839c9f89d89e1e23", "author_url": "http://blogs.msdn.com/jaredpar/archive/2009/02/11/why-are-thread-safe-collections-so-hard.aspx", "date": "Feb 17, 2009", "message": "Are these strictly for up votes irregardless of whether or not the user already was at reputation cap limit at the time of the vote?"}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Feb 17, 2009", "message": "When you say that Community Wiki posts do not count towards the badges, do you mean that none of the upvotes to a Wiki question count, or just those after the question went Wiki? Something tells me it's the former, as calculating the latter would involve rerunning the vote tally."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Feb 17, 2009", "message": "@Jared: I strongly suspect it's for all upvotes, otherwise I doubt that I'd have 3 golds. (There's overlap admittedly, but not enough to really explain that.)"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Feb 17, 2009", "message": "I'm hanging my head in shame over receiving the silver subjective badge.  I don't know if it's better or worse that I also got the java silver.  :)"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Feb 17, 2009", "message": "Reto Meier said:\n&gt; I had hoped specialist tags would be based on the percentage of answers / upvotes for a particular tag.\n\nThat would mean you could easily earn a gold badge on relatively few answers to relatively inactive tags.  That isn't so much a problem by itself, but what happens when that tag becomes more popular and you drop below the percentage threshhold?  Do you lose the badge?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 17, 2009", "message": "> Ruby doesn’t get a badge? No fair.\n\n*Any* tag gets a badge dynamically created when it reaches the threshold of 400 by at least one user."}, {"author_name": "shoosh", "gravatar_hash": "749b73007119baf94fc077c50bcc58e8", "author_url": null, "date": "Feb 17, 2009", "message": "This could have been done better. What about topics which are not popular enough to ever reach that number of votes? The fact that a topic is not popular doesn't mean there aren't specialists in it."}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "Feb 17, 2009", "message": "Very nice! An additional improvement might be a \"top 10\" users per tag, so we can keep track of all those obscure tags and how close they are to issuing badges."}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309", "date": "Feb 17, 2009", "message": "How about tags that are synonymous ?\n\nIn short, what about the uservoice entry:\n\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/30510-merge-tags-rename-tags ?\n\nSomeone (not me ;-) )active in: \nj2ee - 194 questions\njavaee - 55\njee - 45 \n\nmay have to wait much longer to achieve a 'J2EE' badge even though he/she has (in total) way more than the required 400 votes"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Feb 17, 2009", "message": "@VonC: Each of the last two weeks they've retired the high-est voted uservoice suggestion.  Merging tags is now at the top of the list, so given recent history I would guess that they will address it over the next couple weeks.  I'm not sure what the implementation will look like, since there are some real problems with making it too easy to merge tags, but I expect they'll do something."}, {"author_name": "Matt Hamilton", "gravatar_hash": "2bd5f782c135ff7ed12a95bf209eb973", "author_url": "http://www.madprops.org", "date": "Feb 17, 2009", "message": "Jeff,\n\nIs there a way to quickly tell how many upvotes I've had against a particular tag? It'd be nice to know how close I am to achieving certain badges."}, {"author_name": "Oliver Giesen", "gravatar_hash": "13c44ef2d9d79dcca761a584be868def", "author_url": null, "date": "Feb 17, 2009", "message": "I second Greg's notion of having a top 10 users list per tag."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Feb 17, 2009", "message": "Crazy idea which I'll probably hate immediately after I post it: I suggest Jeff and the team temporarily ignore all the user voice issues which are aimed at regular users.\n\nYes, regular users are necessary for the success of the system - but let's face it, we're hooked already. We're not going to defect en masse if we don't get even more ways of competing with each other. And yes, I've encouraged the latter with the monthly league suggestion. I'm not saying we should be ignored, but...\n\nI think at this stage it's even more important to focus on new users who may get turned off by the smallest thing, and the very occasional users who could become regular users.\n\nThe regular users have the loudest voices, almost by definition. It's very hard to hear the voice of a user who searches for an answer without even aiming at Stack Overflow, but happens to find a page. How can SO serve *that* user better? There are far, *far* more of them than there are regular users. Heck, just look at the user list: after only 100 pages (out of *1207* pages of users who bothered to make an impression at all) we're down to rep scores of 570 or so. Do you think they care about top 10s within a tag? A few might - people like me who recognise that they're *going* to be regulars pretty  early on. The vast majority would be better served by tiny, tiny improvements in the UI though.\n\nI suspect I can't even make those UI suggestions - my perspective is skewed by my use of the site. Jeff has the data points here (I hope!) - all kinds of stuff from analytics etc.\n\nSo Jeff: ignore me and the loud-mouthed regulars who already love SO. It's great, and we're not going anywhere. Feel very free to concentrate on the folks who are just dipping their toes in the water.\n\nOkay, rant over. Feel free to say I'm crazy.\n\nJon"}, {"author_name": "SCdF", "gravatar_hash": "d23c43fed180ee2eebef1c3efd75965d", "author_url": "http://blog.mylittlepwnage.com", "date": "Feb 17, 2009", "message": "Cool. I can imagine it will start to pollute the badge page after awhile. Perhaps have two line items showing the aggregate 'specialist' gold and silver badges and then an JS-expandable section showing in detail the tag-based badges.\n\nI.e:\n\n[s] Specialist x 20\n[g] Specialist x 5\n... expand ...\n\nWith the expand link showing a subsection containing what you currently show."}, {"author_name": "MichalT", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl", "date": "Feb 17, 2009", "message": "Very good idea. Have you considered making that process automatic? The more popular the tag, the more likely it is for it to be a good badge."}, {"author_name": "MichalT", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl", "date": "Feb 17, 2009", "message": "How about a tab on the homepage that shows all questions tagged with my Interesting Tags?"}, {"author_name": "EnocNRoll", "gravatar_hash": "ea8d2d7aa5cfadd9396e660a1e00e537", "author_url": "http://stackoverflow.com/users/54289/enocnroll", "date": "Feb 17, 2009", "message": "@Jon Skeet: it's not a crazy idea, it's a sane one, really.  More specifically, I'm not entirely sure that I like the idea of anonymous membership in practice (counting when you don't really exist).  It is a free site.  I am not altogether convinced or satisfied that these anonymous contributors are really providing much value to the site.  I think we should drive programmers to get a taste of what it feels like to be a part of a rewarding and fun community.  Therefore, any work that can be done to enhance the likelihood that participants will actually sign up, would be grand.  Once we have the XBox-like gamer tags and include some other mechanisms to drive adoption, perhaps more anonymous people will join.  Perhaps we can integrate random p*rn ads for members over 18, based on daily page views. Just kidding - but seriously, maybe there can be some way to cap anonymous participation from an IP within a certain time window.  On a competing website that I have since abandoned once I found SO, I joined specifically because I wanted to post an answer and help somebody out.  I could not participate otherwise.  To me, it's a quality control issue.  People who take the time to join are bound to be adding higher quality content to the site."}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309", "date": "Feb 17, 2009", "message": "@Joel: (regarding synonymous tags)\nHey, no problem. Actually I believe they have already begun at the backend level (regexp has been purged, only ‘regex’ tag remains , or c# as you yourself mentioned it in this uservoice entry: http://stackoverflow.uservoice.com/pages/general/suggestions/39283-allow-tag-synonyms )\nPlus, it may not be always that simple (for instance, do we consider questions ‘eclipse-3.2′ the same as ‘eclipse-3.4′, since the product has evolved between those two versions ? Do we group the all thing under ‘eclipse’ tag ?)\n\n@Jon Skeet:\nYou are not crazy ;) \nConsider my rant against bounty:\n- multiple comments in http://blog.stackoverflow.com/2009/01/reputation-bounty-for-unanswered-questions/comment-page-2#comment-13940 : ignored\n- BUG in bounty auto-select: http://stackoverflow.uservoice.com/pages/general/suggestions/115548-bug-bounty-points-incorrectly-attributed-to-my-answer : ignored and declined\n- suggestion to fix bounty: http://stackoverflow.uservoice.com/pages/general/suggestions/117165-fix-the-bounty-system : declined\n- illustration of said failure : http://stackoverflow.com/questions/359727 : DELETED (!? the *all* question, not just my posts in it! LOCKED-deleted at that)\nSince you are above 10K rep, you can see it for yourself: Neat.\n\n\"ignore me and the loud-mouthed regulars who already love SO\" ?\nThey are waaay ahead of you."}, {"author_name": "VonC2", "gravatar_hash": "163257488ef41dd2e97488c0dafb2ffe", "author_url": "http://stackoverflow.com/users/6309", "date": "Feb 17, 2009", "message": "Sorry for the VonC2 without my usual gravatar, but since my first comment in this thread, all my further posts were displayed as...\n\nWait for it...\n\n\"Your comment is awaiting moderation\" :)\n\nHow delicately put.\n\nAs a was saying on the \"ignore loud-mouthed\" front:\nway-way-waaay ahead of you."}, {"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309", "date": "Feb 18, 2009", "message": "And... http://stackoverflow.com/questions/359727 is no more deleted. (my rant it it is off course locked-deleted)\n\nThere. That was not so hard, wasn't it ?\n\nMay be all this SNAFU leaning towards FUBAR may have been averted in the first place if http://stackoverflow.uservoice.com/pages/general/suggestions/115548-bug-bounty-points-incorrectly-attributed-to-my-answer has been addressed properly.\n\nBut like Jon said, \"just ignore us\" (not my vision to lead a community, but if it works for you...)"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Feb 18, 2009", "message": "@VonC, you should probably just get over the bounty stuff. Several people in the original comment thread regarding bounties brought up the \"rep as currency\" and other such objections and no one cares. As for the contradiction bounties create over the oft-sung mantra of \"the system learns to trust you through reputation,\" no one cares about that either. Love it or leave it! Quit worrying and get with the program. :)"}, {"author_name": "Jeff Szczepanski", "gravatar_hash": "3c7db1077ce759e22c54d235054182dc", "author_url": null, "date": "Feb 18, 2009", "message": "I am a huge fan of SO and think nearly everything about this site is pretty darn clean and elegant. I see why the \"Specialist\" badge implementation directly ties to the tags, but IMHO the actual definition of the the tags themselves as a new type of separate possible badges is by far and away the least elegant thing I have seen in the design of this site.\n\nThe reasoning behind my dislike of this is that over time, in particular, there is going to be a whole slew of new \"badge pairs\" associated with a bunch of tags.....a big fat tomato splat of tag badges that in my opinion devalues the notion of a badge encouragement in the first place.\n\nI do think the qualifying rules for the \"Specialist\" badges against tags makes sense, but why not just issue multiple \"Specialist\" badges rather a whole new splat of badge types. As a minimum, if there are going to remain individual badge types, group them as \"Specialist: tag name\" to make it more clear what they are really about....but again, I think there should only be the one badge type for this....maybe two cover both the silver and gold classes of this."}, {"author_name": "Diodeus", "gravatar_hash": "969b153010f69ec07458fa1d9e8a413b", "author_url": null, "date": "Feb 19, 2009", "message": "Generalist suggestion: collect 20 different specialist tags."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Feb 20, 2009", "message": "@Diodeus: I don't think it makes sense to require 20 different specialist badges, but perhaps something *similar* at a lower level: 20 tags with 100 upvotes in each?"}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Feb 21, 2009", "message": "Two questions/suggestions:\n\n1. We can see how many answers we have per tags but there doesn't seem to be a view where we can see how many votes we have per tag (which this now relates to).  Any chance of adding that?\n\n2. Also, community wiki is ignored.  Fair enough.  But does that mean ANYTHING tagged CW or just questions tagged CW.  IMHO it should be answers to questions that are tagged CW.  After all if you edit an answer 5+ times it goes CW but the upvotes should still count for the tags IMHO."}, {"author_name": "litb", "gravatar_hash": "31a1c40a45079decc7f5525d2a873481", "author_url": null, "date": "Feb 22, 2009", "message": "I would love when certain tags are grouped together. For example C#2, c#3 and so on should be accounted to \"c#\" tag-reps imho. One could create them as sub-tags into the c# tag. Or C99 and C89 into C (i'm afraid i wanted to put the \"C\" tag in addition to some question, but 5 tags were already used in that one :))\n\nAnyway, good work guys!"}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://www.twitter.com/patrick_mc", "date": "Feb 25, 2009", "message": "I like Greg's top 10 users per tag suggestion. I couldn't find it on Uservoice, so I opened a ticket here.\n\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/129140-tag-leaderboard"}, {"author_name": "vartec", "gravatar_hash": "0b4fa970be41e2286c39f5b0167e6d9d", "author_url": null, "date": "Mar 20, 2009", "message": "The problem I see with these badges is the fact, that some tags aren't unified. For example IMHO, answers to questions tagged 'php5' or 'zend-framework' should count to php specialist badge."}, {"author_name": "vartec", "gravatar_hash": "0b4fa970be41e2286c39f5b0167e6d9d", "author_url": null, "date": "Mar 20, 2009", "message": "Using some LSA engine to cluster tags could give some interesting results."}, {"author_name": "Ben Dewey", "gravatar_hash": "1db8aa9f1900591e1831faf210a8dafb", "author_url": "http://www.bendewey.com", "date": "Mar 27, 2009", "message": "Can we get a jQuery speciality badge or at least a javascript speciality badge?"}, {"author_name": "Stu Thompson", "gravatar_hash": "428344688dc21d72a3723d94bed66680", "author_url": "http://www.dietpizza.ch/geekomatic", "date": "May 11, 2009", "message": "What happened to these badges?  One day I saw them in the badges tab/page but now they are gone.  I've lost a major life goal!  Sob....\n\nStu"}, {"author_name": "Jon Galloway", "gravatar_hash": "63c32b4489d13b17d23fd9db1505bdf9", "author_url": "http://weblogs.asp.net/jgalloway", "date": "Sep 08, 2009", "message": "Why no Silverlight badge? There's about 5x as activity on Silverlight as for F#. Also, as \"string\" specialist badge? Really?"}]}