{"response": [{"author_name": "Philip Reynolds", "gravatar_hash": "f090725d6eccf41624185526a5c4d1f9", "author_url": "http://www.brassy.net/", "date": "Feb 16, 2009", "message": "Quick 2c on the second last paragraph: More abandoned registered accounts than unregistered might suggest that people are not used to or aware of the process of asking questions anonymously."}, {"author_name": "Michael Haren", "gravatar_hash": "f4f4b5a6f27f72b32d42463b1a25e0df", "author_url": null, "date": "Feb 16, 2009", "message": "What is the reasoning for account deletion? Your last paragraph seems to suggest that you're keeping the user data (however little is there) anyway so it doesn't seem like a privacy, space, or cleanliness issue...\n\nI'm just curious.\n\nI do like that it seems the process is reversible in the unlikely event that an accidental deletion occurs against an active user. Then again, perhaps it's *not* reversible."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 16, 2009", "message": "It's not really reversible.\n\nPersonally, I see no point in retaining information on such lightweight accounts. If the user hasn't been to the site in four months, and has never contributed anything of significance -- why do they *need* an account? Just browse anonymously!"}, {"author_name": "Rob Boek", "gravatar_hash": "4a4b041b66245393da81f3eed53c209e", "author_url": "http://robboek.com", "date": "Feb 16, 2009", "message": "Jeff, from your comment, it appears that you are saying that for an account to be deleted both 1 AND 2 must be true. Is that correct?\n\nWill accounts with over 100 reputation points be deleted if they haven't visited for 4 months?"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Feb 16, 2009", "message": "For cookie-based accounts, I suggest that reputation is 100% irrelevant.  If you haven't seen a cookie user in four months odds are they've lost their cookie.  This is true  whether they have 10 rep or 10,000.  And if they have 10,000, odds are that in four months they've either asked about account restoration or just don't care."}, {"author_name": "Daniel J. Pritchett", "gravatar_hash": "ecf792f5ade8ad4d0aa192dbb3e3514f", "author_url": "http://www.sharingatwork.com", "date": "Feb 16, 2009", "message": "I haven't been active in months because my WordPress OpenID plugin hasn't worked since November.  I'd like to get back in, but it hasn't ruined my life yet.  Please don't delete me!"}, {"author_name": "Bob", "gravatar_hash": "c9427dbf017b2b5436780d5512d7191c", "author_url": null, "date": "Feb 16, 2009", "message": "I don't really care for this.  I set up an account early on, but haven't used it much since, but figured it would be there when I needed it.  Now I'm sure it's been deleted along with my original-user badge.  Wonderful.  Maybe it's stupid, but this really annoys me, and I'm guessing it will really annoy other users.  I think a good rule of thumb is you don't want to annoy your users, so it's amazing to me that your reason for even doing this in the first place is...well...nothing really.\n\nHow did you even settle on four months?  I might work on projects for six months or a year where I'm in a realm that I know very well and so have no questions.  Then I might be on a project with a lot of new stuff and have tons of questions and also be on the site and more likely to be giving answers.  Under your great plan my account would be deleted.\n\nI've contributed substantially but sporadically to one of your models, Wikipedia, and they haven't deleted my account for no good reason."}, {"author_name": "Brad Barker", "gravatar_hash": "f1bf5b6fbe43b29d5646f90b9eb06a0f", "author_url": "http://www.solutionsetsoftware.com", "date": "Feb 16, 2009", "message": "Are you having some space or performance issue with accounts?"}, {"author_name": "Bob", "gravatar_hash": "c9427dbf017b2b5436780d5512d7191c", "author_url": null, "date": "Feb 16, 2009", "message": "Yep, my account is gone, and my badge is gone.  Thanks, Jeff, I appreciate it, especially how the first announcement of this that I saw was \"we're deleting accounts\" instead of \"we're going to start deleting accounts\".\n\nClassic anal-retentive behavior (\"We have to clear out these unused account!\" \"Why?\" \"I don't know; we just do!\")."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Feb 16, 2009", "message": "It does seem silly to delete accounts for no reason. I can understand the cookie-based ones (and as said above, if they don't log in over a span of 4 months, they've lost their cookie and can be deleted no matter how much rep they had).\n\nBut I think you should retain any and every OpenID-based account. True, they might never be coming back, but what if they do? I can just imagine spending a lot of time trying to figure out why I can't log in to SO, only to realize that *they deleted my account*. Obviously, that's not what you expect. You expect that you probably messed up your password, or maybe used another OpenID, or some other simple \"I screwed up\" explanation.\n\nI know I'm not in the danger zone for getting deleted, but I'd definitely be annoyed if my account did get deleted, no matter how inactive it was. If I signed up, it meant that I wanted an account. It means that I expect my account to be there when I next log in, whether that's tomorrow or next year.\n\nThis seems to betray the user's trust as well as the principle of least surprise, and there doesn't even seem to be a reason for it.\n\nI highly doubt the number of OpenID-based accounts are threatening to overwhelm your database, so why delete them?"}, {"author_name": "jchris", "gravatar_hash": "a79f915a547889879add527acf7f82df", "author_url": null, "date": "Feb 16, 2009", "message": "Jeff,\n\nWith such lightweight accounts, what's the virtue in deleting accounts at all?  Is there a significant storage or performance gain to be obtained?\n\nj.c"}, {"author_name": "Rob", "gravatar_hash": "29d4625b3e15ecef1ff05565fbfacd58", "author_url": null, "date": "Feb 16, 2009", "message": "I'm inclined to agree with everyone else in regards to the OpenID based accounts, they really shouldn't be deleted unless there is literally nothing relevant (e.g. questions and answers) associated with the account. However, I could see situations where someone might ask one or two questions, get the answer, and not come back to the site for a couple months. To me, it would seem unfair for these users to lose their account association with those questions just because they don't use the site very often."}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Feb 16, 2009", "message": "Where I live, there was some 20 yrs ago ( and still exists, it is just not that popular ) a table game named \"Maratón\", it was a classic quiz game. When none of the participants answer the question, an additional character called \"The ignorance\" won the dropped points. The \"the ignorance\" it self could won the game.\n\nIt would be sort of interesting to add all the dropped points in \"abandoned\" accounts to a \"SO Community\" character or \"SO abandoned\" or something like that, even just for the sake of recording and to know what's the reputation of the sum of the abandoned accounts. \n\n\nWell just and idea.\nCould it beat us all?\nCould it beat JSkeet?\n\n:)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 16, 2009", "message": "> I set up an account early on, but haven’t used it much since, but figured it would be there when I needed it.\n\nYAGNI.\n\nIf you haven't used the account, there's no reason for it to exist. Just create an account when you *do* need to use the site!\n\nRemember, abandoned OpenID accounts are only removed if they have **ONE REP POINT**. This means, by definition, that user..\n\n1) hasn't been to the site in four months\n2) never posted a question or answer, or..\n3) never received a SINGLE upvote on anything you've ever posted. One lousy upvote!\n\nI question what badges you could have of any possible meaning under these circumstances. (Autobiographer?)"}, {"author_name": "Chris Emery", "gravatar_hash": "6d7223e4505bbb8bdde6fb64f9c3271e", "author_url": "http://tryveganpdx.com", "date": "Feb 16, 2009", "message": "The most obvious badge that somebody could have is the beta badge. Since this can not be gotten anymore, it's something that would make me sad to lose."}, {"author_name": "Thomas", "gravatar_hash": "200d035ac17bdf04856b7dde5a1d1fbb", "author_url": "http://www.nybergh.net", "date": "Feb 16, 2009", "message": "OK, so I wrote this comment without realizing.\n\n<blockquote>Remember, abandoned OpenID accounts are only removed if they have **ONE REP POINT**. This means, by definition, that user..\n\n1) hasn’t been to the site in four months\n2) never posted a question or answer, or..\n3) never received a SINGLE upvote on anything you’ve ever posted. One lousy upvote!</blockquote>.\n\n...which of course makes me silly and illiterate, but I'll post this anyway, just to point out my (<strong>and in the case of SO, apparently not applicable</strong>) distaste for user account deletion!\n----\n\nI think SO is a beautiful work of engineering, but must say that I don't understand how account inactivity deletion fits in with a good user experience, at all.\n\nI have in some instances used forums or other web services once or twice a year, or even less and still enjoyed having an identity set up, with a silly icon/avatar and a profile linking back to my home page and all that. My accounts on different language versions of Wikipedia and other wikis are great examples of this. \n\nAnd as an infrequent user of a service, I might need an activity history even more than a frequent user, perhaps to find communications I've had with people, years ago.\n\nYou may also want to consider that a few people want to or have to put stuff in their lives aside for some periods of time: they may get sick or get children, travel, stressed out at work or school... These instances may be rare, but why risk giving people an even small feeling of completely unnecessary loss, even in such seemingly insignificant stuff as owning one or two cool questions on a Q&amp;A site?\n\nYou've said it yourselves, systems like SO enhance the warm and fuzzy feeling one gets from helping each other out, by being a tad manipulative with reputation points and stuff, and your target audience is described as being prone to obsess over things... \n\nAt least send out expiration warnings by e-mail.\n\nThe relationship one has with a web service is not really \"Real Life human\", obviously. Why require commitment instead of always welcoming people back? :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 16, 2009", "message": "> The most obvious badge that somebody could have is the beta badge. \n\nYou get the beta badge by having at least three bronze badges and an account start date prior to 9/16/08. It would be very difficult to achieve the beta badge and stay at 1 rep.\n\n> even in such seemingly insignificant stuff as owning one or two cool questions on a Q&A site?\n\nFirst, we are not Facebook or Friendster. This isn't a place to hang out and send Zombie Pokes to each other. The unit of participation on a Q&A site is -- you guessed it -- QUESTIONS AND ANSWERS.\n\nAgain -- all it takes is one upvote, ever, in the history of all recorded time, to ensure your registered account stays around. If you can't muster that, I don't see any point in having an account at all. Just browse the site anonymously, because there's no difference.\n\nAlso, I don't think you guys appreciate how many orphaned OpenID accounts we have in practice; it's trivially easy to \"create an account\" on Stack Overflow by doing almost nothing at all. Can you even name one other site that, like Stack Overflow, *doesn't require a valid email address to register*? I'm not sure I can.\n\nWhen we say lightweight, unlike all those other sites, we mean it.\n\nThe downside to ultra-lightweight accounts is that you have to *do something* for them to stick around. I don't think requiring a single upvote is such a tough bar to pass."}, {"author_name": "Thomas", "gravatar_hash": "200d035ac17bdf04856b7dde5a1d1fbb", "author_url": "http://www.nybergh.net", "date": "Feb 16, 2009", "message": "Jeff: just to clarify, yes, I got the thing about one upvote for OpenID, accounts. Just before I was about to post the <a href=\"http://blog.stackoverflow.com/2009/02/when-is-an-account-abandoned/comment-page-1/#comment-14704\" rel=\"nofollow\">asshat rant above</a>. I blame low blood sugar.\n\nRequiring one, or even a few more upvotes/xp point thingies for new OpenID accounts before months of inactivity seems perfectly reasonable."}, {"author_name": "dbkk", "gravatar_hash": "ba33c43bdedd605ad7b57bbd09702bfc", "author_url": null, "date": "Feb 16, 2009", "message": "Jeff, you brought convincing arguments on why deleting accounts is NOT WRONG and does not do much damage. However, I fail to see any positive argument, what are the benefits? \n\nDoes it improve performance or disk usage in any significant way? What did you gain by doing it?\n\nYAGNI / KISS apply in case of the deletion feature as well."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Feb 16, 2009", "message": "\"If you haven’t used the account, there’s no reason for it to exist. Just create an account when you *do* need to use the site!\"\nSure there is a reason. The reason is simply \"the user WANTED an account\". I think you just undermined your claim of lightweight accounts. They're not lightweight. They have to go through some kind of \"approval process\" before they're allowed to stay. There is nothing lightweight about that.\n\n\"I question what badges you could have of any possible meaning under these circumstances. (Autobiographer?)\"\nI question the relevance.\nYou've tried pretty hard to make SO easy to use and welcoming. And then you do something like this, literally saying \"Your account is not good enough for us. Come back when you're serious\".\n\nOnce again, this will never affect me, but I think it's a terrible idea still. If I sign up on a site, I expect my signup to be valid the next time I try to use it. I can pretty much guarantee that if I came back to a deleted account, no matter how inactive it was, I would *NOT* bother to sign up a second time. I would feel badly treated, and either stick with a cookie-based account, or just ditch the site entirely.\n\nBut you're right, I don't know how many abandoned OpenID accounts you have. Why don't you tell us? ;)\nHowever, unless you're up in the billions, I highly doubt it's a problem for you to keep track of these accounts. Is disk space a problem? Are account-related DB queries becoming a bottleneck?\nOtherwise I fail to see what it is you hope to gain.\n\nYAGNI is a fine principle, but you're applying it the wrong way around. You can't second-guess your users and make decisions for them about what they're going to need. Instead, it should be applied to the question \"do we need to do anything about abandoned accounts?\" \n\nIf my account was deleted, I wouldn't care about the rep or the badges (since I probably wouldn't have any of either). Instead, it's the simple fact \"this site apparently doesn't want me as a user. This site wants me to register again and again for absolutely no reason.\" \"This site tries to undo any effort I put into it\"."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Feb 16, 2009", "message": "&gt; You get the beta badge by having at least three bronze badges and an account start date prior to 9/16/08. It would be very difficult to achieve the beta badge and stay at 1 rep.\n\nIt's possible for someone that started their account before that time to earn those three bronze badges any time and still get the Beta badge. If their account were deleted, they wouldn't necessarily lose the Beta badge, but they would lose the ability to earn it in the future.\n\nNow, should such people be awarded the Beta badge? Probably not, considering their lack of activity during the beta period. However, the way the rules currently work, they do lose the potential to earn it if their account is deleted."}, {"author_name": "David HAust", "gravatar_hash": "42c6731377cc670ecc89cbf64e0a780c", "author_url": null, "date": "Feb 16, 2009", "message": "I think you are being pretty parsimonious with you DB space and a bit biased against casual users.  Because someone doesn't actively participate regularly doesn't mean they are any 'less worthy' or should be punished.  Push the 'not visited' out to 1 year and rep points to 1 (for both cookie and openID)."}, {"author_name": "Oliver Giesen", "gravatar_hash": "13c44ef2d9d79dcca761a584be868def", "author_url": null, "date": "Feb 16, 2009", "message": "Jeff, you should make it much clearer that there's an AND implied with the conditions for deletion. I also didn't read it that way on my first pass over the blog entry and was ready to rant the hell out of you for even so much as considering to delete any account with four months of inactivity before I got to the end of the comments and reread the original entry one more time.\n\nIf the 1 rep *requirement* had been clearer from the start there probably wouldn't have been any flames at all on this comment thread..."}, {"author_name": "Andrew Grimm", "gravatar_hash": "b8e3670b31423747deb173731e4af83d", "author_url": "http://andrewjgrimm.wordpress.com/", "date": "Feb 16, 2009", "message": "Ultimately, it's your web site. You could delete Jon Skeet if you wanted. (Actually, deleting such a \"short-head\" user would be the least worrisome for me)\n\nIf a person's account is deleted, will it still be possible to navigate between questions or answers by that person? And to questions or answers made by that person after (s)he's been deleted?\n\nOne scenario where deletion may not be good is if the person asks sensible, but obscure (long-tail), questions and only does so every few months because they mainly RTFM.\n\nIf I asked a question about bioruby, it might not get any votes because most people don't use it. Half a year later, I ask another bioruby question, and this time someone notices it and wonders if there are any other bioruby questions I've asked. Tags won't help, as I didn't have the rep to tag it \"bioruby\". Would the person be able to find my other question?"}, {"author_name": "ansate", "gravatar_hash": "867b1e342eb61922294d317d6efb2ef9", "author_url": null, "date": "Feb 16, 2009", "message": "It seems kind of mean to the non-power users. I program for work and school, but I seldom run into something so complicated that I need to ask a question. I do browse through the questions in the areas I know about when I have a few minutes, but so far they all have better answers than I can knock out in those few minutes.  I guess now that I \"know\" that you can answer anonymously I don't need an account. You seem to be saying that you don't want people like me who'll only answer something once in a great while to be part of the community."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Feb 16, 2009", "message": "I think people are overthinking this and arguing just to argue. If Jeff rolled out these changes without mentioning them, nobody would notice or care.\n\nI am nominally pretty strongly anti-deletion, but I think the specific rules being created here are reasonable. Note carefully the distinctions in the rules. If you spent the time to register an account and have received even one solitary lonesome upvote on any answer or question, ever, your account will not be deleted. No useful data is lost, no posts are deleted, no real user accounts that are actually used are deleted."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Feb 16, 2009", "message": "@Wedge\n\nYou're right, of course, there's very little lost by deleting non-active accounts with no rep. What I think everyone is confused about is what exactly is gained by doing this - I doubt there's much of a speed or space advantage to removing these users, and there's no other detriment to leaving the inactive users still in the system that I can see. It's just an issue of little to lose, nothing to gain."}, {"author_name": "Tim", "gravatar_hash": "655be2100f2922f30dff0a73d53917c8", "author_url": "http://blog.stackoverthrow.com/", "date": "Feb 16, 2009", "message": "How does one voluntarily surrender an account?"}, {"author_name": "Jeffrey", "gravatar_hash": "2886583fab3929c95a68e339e73d61d8", "author_url": null, "date": "Feb 16, 2009", "message": "I'll second dbkk's question: \"What did you gain by doing it?\"\n\nI can't fathom that you'll see much performance gain or disk savings. What's the point of this deletion? How is it no micro-optimization theatre? (Or \"theater\" if you're in the US of A.)"}, {"author_name": "Dana", "gravatar_hash": "48b293567484edc02cd70efa8bf3f9cc", "author_url": null, "date": "Feb 17, 2009", "message": "Truly, what was gained by doing this?\n\nI would have left account deletion alone until it became a problem.  I think it definitely makes the site feel less friendly."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 17, 2009", "message": "> what exactly is gained by doing this\n\nFor one thing, the 3-4 emails I get every day about \"my OpenID is in use!\" and \"my Email is in use!\" -- users who accidentally logged in as a different OpenID, created a new account.. and can no longer associate that OpenID or email with their existing account, because another \"user\" has claimed it.\n\nAutomatically culling unused accounts means those OpenIDs and emails are no longer being squatted on by abandoned accounts.\n\nIt's fun to argue about this, I guess, but in practice, this has been a total non-issue. \n\nUsers who:\n\n1) have not been to the site in FOUR MONTHS\n2) have not contributed anything significant as measured by rep thresholds (1 for registered, 100 for unregistered cookie-based)\n\ncertainly don't *care* if their accounts are removed.\n\nMeaningless arguments like this are, honestly, why sometimes I resist even providing the information at all. How many of you would be up in arms about this if you had never read this blog post? How does it affect you?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 17, 2009", "message": "> Once again, this will never affect me, but I think it’s a terrible idea still.\n\nIf we're arguing about things that will never affect us, what are we doing, again?"}, {"author_name": "Mac Gravell", "gravatar_hash": "b4ae7f8b50a2c32287e456394570679e", "author_url": "http://marcgravell.blogspot.com/", "date": "Feb 17, 2009", "message": "Re \"Users who: (snip)\" - is that \"and\" or \"or\"?\n\nI can think of a range of reasons why a person might be offline for an extended period - I'd hate to lose my identity because I went on an extended tour of Australia etc..."}, {"author_name": "Kristof", "gravatar_hash": "8ce50f6d1249cf47eacc204340eecefc", "author_url": null, "date": "Feb 17, 2009", "message": "What about people that fall into deletion category \nand have in their profile some questions added to favorites? \nI believe that is not an issue at present because if I remember correctly that feature was introduced less then  4 months ago - but perhaps that is something to take into account in the future"}, {"author_name": "purslane", "gravatar_hash": "2acda5365ade04b5964de0502116a037", "author_url": null, "date": "Feb 17, 2009", "message": "I recently registered an account. I saw an interesting question and thought I'd upvote a very useful answer. Upon registering, I noticed that I need reputation to upvote, so I might just as well not have registered. Now that I have an account anyway, I started marking some favorites. It is also good to know that I can participate in the site now when I do see a question that I can contribute to, or when I have a question myself. I now realise that I can apparently do those things without an Open-ID account, but I now like my account. I thought it would just be there whenever I wanted to start participating more actively. I am surprised that it will not be. I think four months of not logging in is not that much, for someone who might be mostly lurking at the time. It is not a super big deal, you are right that with a reputation of 1 I am not super invested in the site and I can always register again. But like other people say, I also do not see what it costs you to just keep my account around. (Cookie based accounts are a different issue, in my opinion).\n\nIt is interesting to me that you think your accounts are so super lightweight. I thought it was quite a hassle to get an open-ID (it was not a lot of work, but I did not have an open-ID account already, so I had to research which provider would be best, had to register (and choose a good username, because this is not just for my account here, but possibly on many places) and fill out quite a bit of information there, etc. In constrast, most services I sign up for only ask for a username and e-mail address. For someone who does not yet have an open ID account, that is much easier and it feels much more lightweight."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 17, 2009", "message": "> I did not have an open-ID account already, so I had to research which provider would be best, had to register\n\nYou don't have a Yahoo or GMail account? If so, you already have an OpenID; no need to create anything at all. Just click the button with that logo on the login page.\n\n> Re “Users who: (snip)” - is that “and” or “or”?\n\nI updated the post using the h2 tag to make this clear."}, {"author_name": "purslane", "gravatar_hash": "2acda5365ade04b5964de0502116a037", "author_url": null, "date": "Feb 17, 2009", "message": "&gt; You don’t have a Yahoo or GMail account? \nNo. No Flickr, Smugmug and all the other accounts that were mentioned on the login page either. I understand that that is really strange to some people, but I also cannot imagine that I am the only one."}, {"author_name": "Techboy", "gravatar_hash": "ef52171c0f3d2660411baca982c68561", "author_url": "http://www.techboy.co.uk", "date": "Feb 17, 2009", "message": "Kudos to the SO team for being pro-active in clearing the user account data (makes the site a little faster for the rest of us) :-)\n\nThe number of people with user accounts that don't meet the criteria for deletion (and who want to retain the account) will be a very small percentage.\n\nHowever I think an e-mail should have gone out to all users whose accounts are going to be deleted (and should in future go out to all users whose accounts are to be deleted). This would give some benefits:\n\na) Negates the possibility for any bad press\nb) Reminds the user about the site, in case they had forgotten about it\nc) Prompts the user to use the site again"}, {"author_name": "Kristof", "gravatar_hash": "8ce50f6d1249cf47eacc204340eecefc", "author_url": null, "date": "Feb 17, 2009", "message": "\"I was, however, surprised to discover there are a lot more abandoned registered accounts than abandoned unregistered, cookie-based accounts.\"\n\nI think that some of those account were created by accident. For example I registered to the site with the open ID @myopenId.org and i think that i logged in once as .myopenID.org. It seems that that created an extra account on SO."}, {"author_name": "Richard Campbell", "gravatar_hash": "b7fd1496cebed0a3c286549e52d49cfa", "author_url": null, "date": "Feb 17, 2009", "message": "\"I think that some of those account were created by accident.\"\n\n\nYes.  I think I may have 3 different stack overflow accounts based on the different open id providers, since I was having trouble getting them to work originally."}, {"author_name": "Andrew Grimm", "gravatar_hash": "b8e3670b31423747deb173731e4af83d", "author_url": "http://andrewjgrimm.wordpress.com/", "date": "Feb 17, 2009", "message": "Ok, I re-read the second last paragraph. I guess I'd better just hope the bioruby question asker isn't named John Smith and uses AOL as an ISP. (While searching for John Smith, I came across <a href=\"http://stackoverflow.com/questions/2824/stackoverflow-why-arent-people-rating-questions/13138#13138\" rel=\"nofollow\">this question by Jeff</a> last year where he noted that half of all questions had no or 1 vote)"}, {"author_name": "MichalT", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl", "date": "Feb 17, 2009", "message": "Don't advertise new features before they're ready, it's bad luck ;)"}, {"author_name": "anonymous", "gravatar_hash": "432b14624c692e7a24b7ce1c1ec8db50", "author_url": null, "date": "Feb 18, 2009", "message": "I have a cookie-based account (not registered).  The cookie is still visible on my PC.  I visit SO several times a week.  Starting this week, SO calls me a new user, reminds me that commenting needs 50 reputation, and asks if I want to see the FAQ.\n\nSince the same bug occured before (maybe was it 4 months ago?) and was fixed before, I've been patiently waiting for it to be fixed this time.\n\nBut maybe my account was deleted instead?"}, {"author_name": "gamecat", "gravatar_hash": "0b4b433679e1fb52f7e2ef4ea492496d", "author_url": null, "date": "Feb 20, 2009", "message": "Based on trolling day,\n\nWhat about, an account with 1 rep and at least 2 or more entries that are deleted due to offensive marks.\n\nI think these can be deleted right away. With luck you can also fry their HDD, paint their monitor black and feed their mouse to a hungry tiger.\n\n(Sorry but I really hate this kind of trolling)"}, {"author_name": "Andrew", "gravatar_hash": "f32a6cda65f1b9a0cf69bd8192f13b30", "author_url": null, "date": "Feb 23, 2009", "message": "Hello, Jeff\n\nI'm one of those users with OpenID based account and 1 rep. The thing is that I did posted a question AND I got an upvote. I have 2 badges: Teacher and Student.\n\nIn your comment above you've said it's impossible. But here I am!\n\nI've never checked whether I'm logged in or not and I switch browsers all the time. Now it seems like I'll have to :(\n\nI'm a casual user. I mean I visit SO about once a week or even once a month.\n\nWhy I haven't answered other people questions? Well, most of the time I use Opera and your rich text editor was completely messed up until recently. Because of that I usually type my answer in a separate window (MS Word or OO Writer). When I switch back to the question I _reload_ the page and find a couple of new answers similar to mine. This has happened about 6 times for me! You know, I would rather just upvote their answers instead of posting and keep the number of similar answers low. Otherwise the answer page becomes messed up \ntoo much.\n\nWhy I haven't asked more questions? Because I _search_ before asking and there was only 1 (one!) case when I haven't found the answer and had to ask!\n\nMy question was not an easy-points-generator (What's you code editor of choice, hah?). It's very specific and technical and I still haven't received an acceptable answer. All the answers I received do not seem to be comprehensive and low-level enough to me to really understand what's going on under the hood. \n\nSo if other people are typing faster than me and your search field works better for me than Google why do you blame _me_? At least I sent feedback over at UserVoice a couple of times.\n\nI'm not a DBA and my SQL knowledge are very basic (Hibernate!). But I think that instead of removing accounts from your DB you can partition your users table into active and abandoned according to a criteria you mentioned above. Thus you would make a query for active users only first. Most likely this query would be successful and it would be much faster than it's now.\n\nBut if it failed then you could make a second query for abandoned users. That's how memory caching works in computers. I think you can do the same thing in a DB. \n\nAs I remember you use Microsoft SQL Server which is pretty advanced. I'm sure there's something for table partitioning in it. May be there's a method to pack the data inside the DB if it's rarely used, too.\n\nSo, that's probably it. At least I do not take much space in your database because I don't have an Autobiographer badge :)\n\nTo put it strait: I do not care about all those repPoints, badges, karma, scores, stars and other _social_ garbage. \n\nIt's a Q&amp;A site.\nWhen I have a question I search.\nIf I haven't found anything I ask.\nWhen I see an unanswered question I answer if I can. \nIf I want to socialize I go out with my friends and have a good time.\nKarma? 4*** karma!\n\nJeff, just let me if you're about to delete my account so I could ask some high-karmic retarded question like 'What Eclipse features you would like to see in Visual Studio?'.\n\nGuys, to be honest this is a b***S*** question and has nothing to do with StackOverflow. StackOverflow is about solving problems, not about unproductive noise. If the question above sounds like an interesting to you then go to programming.reddit.com and ask there!\n\nI mean, seriously, you do not post you drunk photos on LinkedIn, you do it on FaceBook. So why do you put so much garbage in SO instead of other web sites?\n\nIf you're curious my question is http://stackoverflow.com/questions/134791 and it was viewed 321 times (nice looking number, imho)."}, {"author_name": "Terry", "gravatar_hash": "4554da4556390e28c7edd02721ab0c64", "author_url": null, "date": "Feb 24, 2009", "message": "Thanks jeff for deleting my account; with your overzealous account management \"feature\". I'll just browse anonymously from now on. I'm not setting up another friggin' openid account again for this crap."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 25, 2009", "message": "> I’m one of those users with OpenID based account and 1 rep. The thing is that I did posted a question AND I got an upvote. I have 2 badges: Teacher and Student. In your comment above you’ve said it’s impossible. But here I am!\n\n   1. The user has not visited Stack Overflow in four months\n      AND\n   2. The user has only 1 reputation \n\nAs long as you visit once every 4 months, your account will be retained, even with 1 rep.\n\n> I have a cookie-based account (not registered). The cookie is still visible on my PC. I visit SO several times a week.\n\nCookies are pretty fragile; they're browser and computer specific. As long as you visit every 4 months, it won't be deleted -- see post, above.\n\n> I’m not setting up another friggin’ openid account again for this crap.\n\nThe intent is for people to browse anonymously until such time as they actively need to participate."}, {"author_name": "Rory Becker", "gravatar_hash": "9067207fa8d7277b738696bf506744cf", "author_url": "http://RoryBecker.blogspot.com", "date": "Feb 26, 2009", "message": "&gt; I’m not setting up another friggin’ openid for this crap.\n\nErm .... Why don't you sign in with one of your already existing OpenID Accounts. Nobody said you had to create a new OpenID account for every single site... That kinda defeats the purpose... No wonder you're not keen if that's what you think you need to do."}, {"author_name": "lindylou vargas", "gravatar_hash": "2851dd44c5160a2def8ab56769f408f3", "author_url": null, "date": "Apr 06, 2009", "message": "i want to delete my friendster account because i have no time for it and some people keep on giving comments. thanks."}, {"author_name": "Dave", "gravatar_hash": "3f3e868f61d0ca93c4da3c11649e5f7f", "author_url": null, "date": "Jul 07, 2009", "message": "Hi Jeff,\n\nI answered a question to try out the site as a\nunregistered user 2 weeks ago and got a whooping reputation of 26 !\n\nit seems that i'm no longer recognized already,\nmay be cause i'm using chrome and the way it handled the cookie.\n\ndoes that mean i can't transform my account to a registered one anymore ?"}, {"author_name": "FarmBoy", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Oct 02, 2009", "message": "Jeff,\n\nThere is a simple reason that people hate the idea that an account is ever deleted.\n\nOur culture hates authority.  SO has promoted itself as being owned by the community, as if there is not an authority structure.\n\nBut authority is a good and necessary thing, and us free-thinkers, not faced with the practical challenges of managing millions of users, don't want any part of it.\n\nSo whenever you post about decisions that describe how you invoke your authority, you are going to need to carefully present the problem faced, and explain how this use of authority is actually for the good of the community.\n\nEven then, people will complain, of course.  But it may help."}, {"author_name": "Harald-René Flasch", "gravatar_hash": "317b59d815ae5b8ac4a0cec1bb64af94", "author_url": "http://www.hfrmobile.com", "date": "Jan 20, 2010", "message": "I agree that Stackoverflow is \"unusual\" ...\n\n\".. their accounts are effectively abandoned. We don’t believe those users are ever coming back.\" --&gt; Well, I am back ... (thanks to Dr. Google!)\n\nBut I think in days of OpenID it should not be necessary to delete user accounts without asking the user before ... :-/"}]}