{"response": [{"author_name": "Paul Tomblin", "gravatar_hash": "99660662e89949a4b53cd97bc199ead1", "author_url": "http://blog.xcski.com/", "date": "Mar 21, 2009", "message": "Wow - the sof.modos reputation tracker shows 15 questions where I went +2 (I'm guessing you nullified some downvotes?) but a net loss of 289 rep.  That's sigificant!\n\nHow am I ever going to catch Jon Skeet this way (providing, of course, that he takes an extended vacation away from SO)?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2009", "message": "> but a net loss of 289 rep. That’s sigificant!\n\nIf you were a target, this triggers a reputation recalc which causes any repuation from deleted posts to be lost. That'd be my guess."}, {"author_name": "Paul Tomblin", "gravatar_hash": "99660662e89949a4b53cd97bc199ead1", "author_url": "http://blog.xcski.com/", "date": "Mar 21, 2009", "message": "Not a problem - like you say, I can gain that back in a few days.\n\nBTW: Is there an RSS feed for the comments on a blog article?  The main site has RSS feeds on everything, but I can't find them for the blog site other than the one for posts."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Mar 21, 2009", "message": "I lost a few hundred points too. It seems a colleague committed some kind of sin by voting for me on the same IP address. Nevermind the free or cheap Web proxies out there that could be used if vote fraud was really the intent.\n\nWhat really disturbs me though is the loss of rep from deleted posts, which seems to have been a significant portion of that. I frequently delete my own posts for a number of reasons:\n\n- Misreading or misunderstanding the question;\n- Just plain making a mistake; and\n- Someone posts a better answer in which case my post just becomes noise.\n\nJon Skeet mentioned this and does it too. So from a pure rep point of view I'm being told by SO \"don't delete your own posts because we might run a rep recalc and you'll lose the points\".\n\nI thought reducing the noise was a more useful outcome but OK, whatever..."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Mar 21, 2009", "message": "Oh and the rules for this sort of check are pretty easy to discern I would imagine. The approach would be similar to that use to detect fraud in financial institutions and the like, basically by using some kind of backward-scanning rules engine that would check for some weighted combination of:\n\n- IP address\n- Low rep and/or few questions/answers\n- Determine the mean and standard distribution of votes per user, possibly excluding certain outliers) and then looking for votes per user too far from the mean (eg 1 standard distribution);\n\nThe problem with the last point is that new users won't (necessarily) yet have statistically meaningful voting patterns so instead of that (or in addition to it) you could do essentially the same check in reverse:\n\n- Look at the votes per user someone has *received*, work out the mean and standard distribution and then look for outliers (checking those users against the above criteria).\n\nI am a little concerned about the reversal of the original policy of not looking at IP address (eg I share an IP address for Web purposes with about 30 other users for reasons I won't bore you with).\n\nBut the deleted post thing is the one I'm most concerned about."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 21, 2009", "message": "Simple answer: Don't delete your posts unless they garner negative reputation."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Mar 21, 2009", "message": "I refer you to http://msmvps.com/blogs/jon_skeet/archive/2009/02/17/answering-technical-questions-helpfully.aspx\n\n\"Don't be afraid to delete (or edit heavily) useless answers\n\n\"It's almost inevitable that if you post enough answers, one of them will be less than helpful. It may start off being a good one, but if a later answer includes all the information from your answer and more, or explains it in a better way, it's just clutter.\n\n\"Likewise if you make a wild stab in the dark about the cause of a problem, and that guess turns out to be wrong, your answer could become actively unhelpful. Usually the community will let you know this in comments or voting, but sometimes you have to recognise it on your own.\"\n\nA philosophy I concur with. But I guess I'm better off just leaving my noise there now. Or, better yet, undeleting any such posts I have and waiting for the next recalc."}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Mar 21, 2009", "message": "Wow... I got a 400 rep lost... I don't think the statistical detection algorithm works very well, how can I have that much anomalous rep?"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Mar 21, 2009", "message": "@cletus: It really depends on what you care about more - the benefit of the community or a reputation number.\n\nI'll admit it's easy for me to say that. Even with a post with a few upvotes, deleting the post is unlikely to cost me rep - because I'll still hit the 200 rep limit, and it's really only the timing and number of accepted answers which affects my daily rep gain. Removing a post may cause a delay to hitting the limit, thus potentially making an accepted answer \"not count\" (in terms of pushing past the limit) but there probably wouldn't be much loss, even if the answer had 10 upvotes. (I think the most popular answer I've deleted had about 4 upvotes, presumably from others who'd misread the question too.)\n\nSo yes, this is \"easier\" for me than for most people - but even so I'd urge you to put the benefit of posterity above the benefit of rep. I'd be the first to admit that rep doesn't really mean much in concrete terms - it's an indicator of time spent, quick fingers and a persuasive communication style as much as anything else. On the other hand, having a more focused set of answers *does* have a concrete benefit to the world, IMO.\n\nThe more I think about it, the more I wonder if I shouldn't be a bit more ruthless with my own answers.\n\nJon"}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Mar 21, 2009", "message": "This time I have not loss any reputation. People who think losing 200 or 400 reps is a lot must go read the blog entry about the reputation adjustment of the 24 december 2008... I know *few* people who have lost more than 3000 reputations ;)"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "61d2a0f034915fa9d2acd6f6b145bba8", "author_url": null, "date": "Mar 21, 2009", "message": "I think if anything I gained some rep, but I don't really remember my exact number from yesterday."}, {"author_name": "Pat", "gravatar_hash": "5039fc1eda008e308420cfd001acc5d5", "author_url": null, "date": "Mar 21, 2009", "message": "Jeff,\nI think now you can remove the restriction that votes cannot be undone.\n\nSince you are recalculating rep often the exploit of freezing another user's rep will not work anymore right? When you recalculate the rep, all the \"missing votes\" should be counted again."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Mar 21, 2009", "message": "Out of curiousity, do reopen votes get reset when you rerun the voting record? Do they expire? I ask because I'd been hoping to reopen a question of mine and it had 2 reopen votes a few days ago (one mine, one someone else's) and when I checked today there were none.\n\n(yes, I know this probably belongs more on UserVoice than here so I created a ticket for it: http://stackoverflow.uservoice.com/pages/general/suggestions/144498-reopen-votes-were-reset)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 21, 2009", "message": "open, close, and offensive votes all expire automatically if they don't reach the threshold. Totally unrelated.\n\nOpen/close votes expire after 4 days.\noffensive votes expire after 2 days."}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Mar 21, 2009", "message": "by making a complete blog post you are just making a challenge to those already gaming their reputation. heck, you could rent 45 minutes of a botnet and get 10k and wouldn't be able to track it."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Mar 21, 2009", "message": "@Darren Kopp, well that's true but I don't think it is gives much more of a \"call to action\" than is already there. I think the price of not disclosing is a lot of confusion as to why someone's reputation dropped."}, {"author_name": "Arron a.k.a unkwntech", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Mar 22, 2009", "message": "@bobbyShaftoe I have to agree the only reason I checked the blog that day was because my rep dropped, if there hadn't been a post I would have been a bit frustrated, to have lost almost 300 rep with no indication why."}, {"author_name": "friol", "gravatar_hash": "6b1453411bcd242378a7e7cc392cb40e", "author_url": null, "date": "Mar 23, 2009", "message": "Last time you did this (around the 5th of jan 2009), I've lost 185 points for some kind of \"algorithm\".\n\nThis time I hope you send every user a report of\n\n1) what was subtracted\n2) why\n\nThanks."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Mar 23, 2009", "message": "Darren Kopp:\n\"by making a complete blog post you are just making a challenge to those already gaming their reputation. heck, you could rent 45 minutes of a botnet and get 10k and wouldn’t be able to track it.\"\n\nYes you could, all the vote patterns that qualify as anomalous are taken into consideration as being an attempt to gamble the system.\n\nWhat can you do so that the voting patterns are not considered voting anomalies ? \n\nYou could pretty much compute the average ratios of votes a user gives to the same users, you can compute the average ratios of questions/answers/votes users have, you could find out what's the average number of votes a question not being on the front page receives ... \n\nTo gamble the system, you basically have to simulate a statistically valid human interaction with the site, taking into consideration a ton of variables, like ratios, vote counts, vote distribution, vote patterns, average page requests between votes, average times between page requests, ratio of page requests to votes given etc ... \n\ngood luck doing that!\n\nAnd besides even if you do manage to gamble the system for a while, Jeff just needs to add another detection pattern to the system, one that was not used previously to track gambling attempts ... and you're busted!\n\nCheaters never win !!! (Even if they can get away with it at first ...)"}, {"author_name": "lucasbfr", "gravatar_hash": "400e387db6de9e9870789adc387d6c21", "author_url": "http://en.wikipedia.org/wiki/User:Lucasbfr", "date": "Mar 23, 2009", "message": "\"That said, we believe in discouraging behaviors rather than the user. Nobody will be banned or penalized. Just refrain from engaging in these behaviors unless you want them undone every day, like clockwork.\"\n\nI so hope you are right :(\n\nSome people got a _lot_ of free time."}, {"author_name": "StormTAG", "gravatar_hash": "f95c0f59cb9cef293c54bffd193a2652", "author_url": null, "date": "Mar 24, 2009", "message": "I'd rent a bot-net for 45 minutes to upvote every answer on the site, twice. :D"}, {"author_name": "theman_on_vista", "gravatar_hash": "776fc61036a84f03601589ed7fba87b2", "author_url": null, "date": "Mar 24, 2009", "message": "still not sure why everyone gets up in arms over SO rep.  Isnt the intrinsic value of helping others enough?  besides, SO rep is worth less then google stock"}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Mar 24, 2009", "message": "@theman_on_vista: I agree, why worry about rep, especially when we have all of these other good things to obsess about http://stackoverflow.com/questions/292619/whats-the-incentive-to-answer-questions/292623#292623"}, {"author_name": "dirkgently", "gravatar_hash": "19d1ce956fb43cea6297a63b30737575", "author_url": null, "date": "Mar 29, 2009", "message": "I've now have had 3 accepted answers taken out on 3 consecutive days. When I logged out for the day, the answer was accepted, when I logged in the next morning, it was gone. And then, there has been rampant down voting of valid answers. A valid down vote is usually followed by an explanation, or such has been my experience and I am happy with it. \n\nBut this is disturbing, any ideas?"}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Mar 29, 2009", "message": "@dirk: sounds more like a uservoice issue. It might also be of interest to post the relevant questions."}, {"author_name": "Eric Johnson", "gravatar_hash": "4d2fa36db4bfac7edbb19f45064e6a76", "author_url": "http://www.lostbearlabs.com", "date": "Apr 04, 2009", "message": "\"Wow… I got a 400 rep lost… I don’t think the statistical detection algorithm works very well, how can I have that much anomalous rep?\"\n\nI agree.  I use the site only intermittently, and I primarily ask and answer technical questions.  My reputation grows slowly.  So for 25% of it suddenly to disappear with no detailed explanation seems unlikely (who would have been gaming my answers?).  It also makes me less willing to hang around on the site looking for questions to answer and more likely only to use the site for asking questions."}]}