{"response": [{"author_name": "Joel Spolsky", "gravatar_hash": "d77663c217e9d27b725338c06674c94b", "author_url": "http://www.joelonsoftware.com/", "date": "Mar 12, 2009", "message": "Two quick announcements!\n\n(1) Next week's StackOverflow will be live from Las Vegas. It'll be Tuesday, 6:30PM, from the \"Third Place\" at MIX 09 in the Venetian, 4th Floor, Marcelo 4403. You need a MIX badge. See you there!\n\n(2) Congratulations to Jeff and Betsy on the birth of Henry Burton Atwood (about 3 hours ago). https://twitter.com/rockhardawesome"}, {"author_name": "Chris Boe", "gravatar_hash": "5eb94371298a7247d55d8296d861d8cf", "author_url": null, "date": "Mar 12, 2009", "message": "congratulations Jeff and Betsy!\nI want that my friends call me rockhard awesome too, but I guess that name is already taken."}, {"author_name": "DrJokepu", "gravatar_hash": "973c6e2cf1ae9f6615dd883eb14597b1", "author_url": null, "date": "Mar 12, 2009", "message": "Wow that Greg Whitten e-mail is fabulous! You have made my day, thanks for posting it!"}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Mar 12, 2009", "message": "\"Hello World\"\n\nNever better used"}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl", "date": "Mar 12, 2009", "message": "1) Rewards have diminishing returns, whereas punishments usually don't, and a person's response varies with personality, confidence, mood, etc., so I don't think you should use an arbitrary rewards/punishments ratio.\n\n2) Over long periods of time we tend to assume the average is the baseline, i.e. if you get 1 hate mail and a 100 nice responses on average to each article, once you get 50 nice messages and 2 hate mails for an article, you're going to feel bad about it, even though the ratio is still ridiculously positive."}, {"author_name": "Tony", "gravatar_hash": "58ef1d5589ae9e97b96ef294700bee5b", "author_url": null, "date": "Mar 12, 2009", "message": "The \"game\" Joel is talking about with SQL server is not just limited to SQL server. SQL optimizers are really really fun... There are a lot of hidden \"Features\" in them... \n\nCrap now I am going to have nightmares about optimizers."}, {"author_name": "theman_on_vista", "gravatar_hash": "776fc61036a84f03601589ed7fba87b2", "author_url": null, "date": "Mar 12, 2009", "message": "im so sick right now but yay new podcast.."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 12, 2009", "message": "Thanks for ripping into Myst Joel. That's my least favorite \"game\". Especially since once you know the answer you can beat the game within 5 or 10 minutes."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Mar 12, 2009", "message": "Can't say I agree with the whole vision statement thing. To me, a vision statement should only be specific enough to validate or invalidate future feature design.\n\nFor example, here's my vision statement for MiniBench:\n\n\"Minibench makes it easy for developers to write and share tests to investigate and measure code performance.\"\n\nOh noes! It uses \"easy\" - so clearly it's bad. It doesn't say *how* it's going to make it easy - so clearly it's bad. It's not specific about how you're going to share the tests - so clearly it's bad.\n\nNope. It's great because with that one big idea (which is a really simple elevator pitch as a *starting* point) you can think of as many new features as you like, and say, \"Does that contribute to the vision statement?\" It *encourages* brainstorming sessions, wacky ideas which may or may not go anywhere.\n\nIf your vision statement just goes into all the details of the things you can think of *now* (\"it's going to be heavily multi-threaded and do everything in memory\") that leaves very little room to grow later.\n\nThe vision statement shouldn't be where the design ends, of course, but it doesn't need to be so prescriptive that it stifles innovation. What's wrong with adjectives, anyway? If my goal is \"fast\" then I can experiment with exactly what's going to *make* it fast later. That may well change over time, but the vision statement doesn't have to."}, {"author_name": "Eric Z. Beard", "gravatar_hash": "62cc585b9fd3ee7182dadbd09a7f4b47", "author_url": null, "date": "Mar 12, 2009", "message": "OPTIMIZE FOR UNKNOWN!  That's it, I'm upgrading from Sql Server 2005 to 2008.  This parameter sniffing issue has been driving me nuts with 2005 for years."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Mar 12, 2009", "message": "On discussion groups and threading models: again, I disagree thoroughly.\n\nSuppose a single answer on Stack Overflow effectively causes two conversations, between two pairs of people. In a threaded system, the context of that would be obvious - you'd basically have two branches in the notional tree (however that's represented - see later).\n\nWith the \"flat\" version you've got both conversations interspersed, which makes it *really* hard to tell what's going on, particularly if you happen to be a fifth person who's interested in the conversations. It's even worse if one person (A) has two separate conversations with two separate people (B and C) - so both B and C are referring to person A, but not to the last thing A wrote. They're referring to the last thing A wrote *to them*. Ick.\n\nNow, in terms of *presenting* that, you're absolutely right - the normal tree view leaves a lot to be desired. I rather liked trn's way of presenting Usenet - ironically it painted a better \"picture\" than most modern forums, despite being limited to text. You could really easily tell the branch points, where the topic title changed etc.\n\nFlat comments aren't too bad for a Q&amp;A site like Stack Overflow, but they'd be severely limiting for a genuine *discussion* site. If Stack Overflow ever decided it wanted to engage in detailed discussions, it would absolutely have to have a better threading model. I suspect that a tree is a reasonable *model* for discussions - we just need to find a great way to present it. (Giving the option of saying, \"This comment actually responds to more than one previous post\" would be neat too, at which point it's not a strict tree, but that's a different matter.)\n\n(On a slightly separate note, since joining Stack Overflow I've pretty much abandoned C#/.NET newsgroups. The one thing I *do* miss - although it sucked up a lot of time - was the discussion aspect of things. Hmm.)"}, {"author_name": "Erin", "gravatar_hash": "d4b590f51d3197f6b49165ff59de8836", "author_url": null, "date": "Mar 12, 2009", "message": "That positive feedback conversation applies well to all people management - including parenting.\n\nI know I'm slightly off topic but still a little on topic for Jeff at the moment. - Congrats"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Mar 12, 2009", "message": "@Jon Skeet:\n\"If my goal is “fast” then I can experiment with exactly what’s going to *make* it fast later. That may well change over time, but the vision statement doesn’t have to.\"\n\nWhy this reluctance to change your vision statement?  The whole point of having an elevator pitch/mockups/functional spec is that they're easy to change.  If your vision statement was more specific it would give you a starting point, but there's no reason for that to limit how you go about achieving your objective."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Mar 12, 2009", "message": "@Chris: Yes, you can change your vision statement. But I think it's more useful to have a grand long term vision that can be achieved in small stages.\n\nLook at Google's mission statement: \"to organize the world's information and make it universally accessible and useful.\" I think that's a *fabulous* mission statement (and not just because I work there). It's a long term goal, but projects can contribute to it all over the place.\n\nIf Google's mission statement had been: \"to be the best search engine by using the quality of pages linking to a  site to judge its own quality\" then it wouldn't be nearly so effective (as a mission statement), IMO.\n\nTo put it another way: if you don't have the detail in the mission statement, you have it in feature design docs etc. There's a good space for it. If you don't have a long term goal in a mission statement, where else are you going to put it?"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://stackoverflow.com/questions/539451/are-you-compelled-to-eliminate-syntactic-cruft/539471#539471", "date": "Mar 12, 2009", "message": "As a Usenet refugee, I find the lack of threads a huge waste of time.  While it can be confusing to follow, good threading allows one to skip entire lines of conversation that are uninteresting.  Some news readers had a feature of killing all replies to certain posts.  \n\nThe implied argument that non-programmers don't know how to thread properly is clearly irrelevant to Stack Overflow.  Maybe we go overboard thinking in hierarchies, but what's the harm in letting the inmates have the illusion they are sane?\n\n(SQL Server sounds like a disaster!  Are you sure updating the statistics doesn't help?  Because the optimize for unknown solution sounds cargo-cultic.)"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Mar 12, 2009", "message": "@Jon Skeet\n\nI think part of the problem here may be terminology.  Jeff and Joel (and I) are talking about an elevator pitch type vision statement.  “To organize the world’s information and make it universally accessible and useful” is a fine mission statement, but it is not an elevator pitch.  Like a mission statement, an elevator pitch describes the goal, but it also needs to describe how you are going to get there.  That VC you cornered in the elevator isn't going to give you money just because of what your company wants to do, he needs to know something about how you plan to do it."}, {"author_name": "Sprague D", "gravatar_hash": "2e631426dadcebf7a8d2898dd13a2ecf", "author_url": "http://www.ratdiary.com", "date": "Mar 12, 2009", "message": "Great show. Your enthusiasm is... contagious. Keep hitting on the need for specs -- this discipline is under serious threat in the Web 2.0 era (\"Damn kids with their music...\")"}, {"author_name": "Eric", "gravatar_hash": "66b77f5bc499fb9bec78d9657a6753e8", "author_url": null, "date": "Mar 12, 2009", "message": "That link to the \"article in question\" should probably link to http://www.joelonsoftware.com/articles/TwoStories.html, which tells the story of Joel's conflict with Greg Whitten, rather than http://www.joelonsoftware.com/articles/fog0000000018.html, which is just about Architecture Astronauts in general."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Mar 13, 2009", "message": "@Chris: I agree that it's a terminology clash, but I think the phrase \"vision statement\" conjures up a bigger picture than \"the first features I plan to implement\". We don't call people \"visionaries\" if they're able to see what's in front of their faces. Given the results of the search define:\"vision statement\" I suspect that my understanding of the phrase is more common than J&amp;J's.\n\nAs for the elevator pitch, I'd do it in two parts: give the long term vision statement, and then follow up (still briefly, of course) with \"and our first steps towards this goal are...\"\n\nThe vision statements that Joel was disparaging sound like their written by people who understand the phrase \"vision statement\" in my sense - which means that criticising them for not being the *other* sort of statement is a bit pointless, IMO."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Mar 13, 2009", "message": "I love your Podcasts !!!&lt;3&lt;3&lt;3!!!, keep them coming, SOP is *the* best podcast in the industry: it's entertaining, never know what to expect from you guys, I love Joel's pragmatism, and your nonconformist ways of writing software and anti crowd mentality Jeff.\n\nCheers."}, {"author_name": "Pietro Polsinelli", "gravatar_hash": "5198744cd329b6dfdb9e39b4f9794cd1", "author_url": "http://polsinelli.wordpress.com", "date": "Mar 13, 2009", "message": "For the guy who wants so much to punish: read this \"Discipline &amp; Punish\" by Michel Foucault http://www.amazon.com/Discipline-Punish-Prison-Michel-Foucault/dp/0679752552/ref=sr_1_1?ie=UTF8&amp;qid=1236945651&amp;sr=8-1 to understand the logic of it :-)"}, {"author_name": "Kevin", "gravatar_hash": "b56fa324ae52977792fca24ccb247ced", "author_url": null, "date": "Mar 13, 2009", "message": "On rewards and punishment.  Studies have shown that to shape behavior, punishment isn't necessary.  Rewarding positive behaviors and ignoring negative ones has enough of an effect to shape an animal's (human) behavior into a desired outcome without the unexpected (read negative) consequences.  \n\nThis is a common technique used for preschool children where teachers are advised to not discipline (spank, yell, timeout etc.) children as punishment will have a secondary effect which is undesirable. This goes into the theory that punishment is still getting attention which is still more desirable than not attention at all. \n\nIn adults the secondary effect is different as instead of continuing the undesirable behavior for attention, they will most likely either not do anything at all (which could become learned helplessness) or they could quit to avoid an undesirable situation.  Either way it's not the desired outcome."}, {"author_name": "mattd", "gravatar_hash": "3f98095544c3d23253de85432181f686", "author_url": null, "date": "Mar 13, 2009", "message": "@[5:05] Joel speaks of a GUI interface; isn't that what the 'I' in GUI stands for? Graphical User Interface Interface?"}, {"author_name": "MrTomahawk", "gravatar_hash": "cf855db26f72a03af1c4d31fc4ad5a78", "author_url": null, "date": "Mar 13, 2009", "message": "You guys gave a good update of what's going on with the It version of StackOverflow and what the challenges were, but you guys still didn't tell us what the site will be called.  I know you posted the question a while back and that there were many ideas thrown at you, but I never heard of the final outcome from that.  You guys also mentioned that you were looking for some people to be the moderators for the site once it came live...and I don't think you ever mentioned if you locked in those positions or whatever came out of that either.  I love your guys site and your podcasts...I'm an IT guy and it's definetly opened my eyes more to the developers world and I look forward to whatever is to come."}, {"author_name": "BCS", "gravatar_hash": "6757caf55de0413ae0994293e001d465", "author_url": null, "date": "Mar 13, 2009", "message": "Ditto Jon Skeet Re threads.\n\nThe only thing I will add is that what is really needed to make threads work is a thick client. Something like a e-mail client and I'm not talking a web mail thing. SO is the only remotely forum like thing I regularly look at. Most of my other interactions on line are via newsgroups using a real NNTP client.\n\nPersonally I'm not sure there is a way to do discussions well on a web page. If nothing else needing to hit refresh is a pain."}, {"author_name": "Jason Punyon", "gravatar_hash": "44302dd1c18f747ba4fff5f689c475ba", "author_url": "http://jasonium.com", "date": "Mar 13, 2009", "message": "Guys,\n\nOf the episodes I've heard so far (I only started at 34), I've enjoyed this one the most.  I wish I could be there live in Vegas, good luck.\n\n-Jason"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Mar 14, 2009", "message": "@BCS: I'm not convinced that a thick client is necessary to make threading work. It just needs a good deal of thought, and trying to break out of the current tree view way of doing things.\n\nThe web can be pretty rich these days. It just needs innovation in this area. (Don't look at me - I'm not a UI guy - but I'm sure it can be done.)"}, {"author_name": "naked russian women videos", "gravatar_hash": "e9791d2b1267db715b4ca4e2d0f64fb0", "author_url": "http://sexyrussianwomen.blogspot.com/", "date": "Apr 23, 2009", "message": "Very Nice Post. I love it. Have a Great day."}, {"author_name": "mig forex", "gravatar_hash": "59ee31dc3a19353fa16fb386501eb4fc", "author_url": "http://nfnceeo.biz.vi/", "date": "Apr 30, 2009", "message": "Unconventional good stuff here. I normally don't find nothing but junk but when I get something I know my people will like I link back. This is good stuff and I hope you don't mind if I add a link back to you from my website"}]}