{"response": [{"author_name": "Jon Cram", "gravatar_hash": "28d3858fd164c191d05954e114adeb9a", "author_url": "http://webignition.net", "date": "Mar 26, 2009", "message": "Joel mentioned the Crucial memory analysing tool.\n\nI ran it a few months back to see if my machine can support more than 4GB. Amusingly, it reported that my machine supports up to 8 terabytes, which I suspect might be a little off."}, {"author_name": "lubos", "gravatar_hash": "c4924ce2b51b9a550e3baafce3af25b9", "author_url": null, "date": "Mar 26, 2009", "message": "when joel says within the first minute of podcast that Eclipse is \"some kind of weirdo editor\", you know this is gonna be interesting."}, {"author_name": "Dave", "gravatar_hash": "020c00d049666defb205a54b324933db", "author_url": null, "date": "Mar 26, 2009", "message": "Would just like to point out that in regards to Eclipse and what Jeff said about it now finally catching up with Visual Studio, it's actually more like the other way arround. Eclipse has, and still has, a much more competitive edge on Visual Studio in terms of developer orientated features. For example, Eclipse was full of (good) Refactoring suppport which Visual Studio didn't really get until 2005, and then it was kind of half-baked. Don't get me wrong, Visual Studio is great, I just don't think its fair to say it was ever beyond Eclipse."}, {"author_name": "macbirdie", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Mar 26, 2009", "message": "FYI, Frontpage is now Sharepoint Designer."}, {"author_name": "Brendan", "gravatar_hash": "4c34af319f5b137438bad65e2a25bf37", "author_url": "http://bjkeefe.blogspot.com/", "date": "Mar 26, 2009", "message": "Joel mentioned early in this podcast that he would have no problem with ads if only he could stop \"flashing.\"  I feel the same way, so I use the Firefox plugin Flashblock:\n\nhttp://flashblock.mozdev.org/\n\nIt works really well.  The only thing that will move on a web page after installing it (that you don't want to be moving) are animated GIFs, but so far, I find those rare enough that I am not driven to install Adblock.  (I do like free web sites, and I understand ads are part of the price, so I haven't installed that plugin.)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Mar 26, 2009", "message": "+1 for Dave's comment. As well as refactoring, why did it take until 2008 for VS to get unit testing built in? Why is it still only for MS Test? Why is it not in the Express editions? Integrated unit testing with all the really common frameworks for the platform should be something developers can just take for granted.\n\nI tend to think that Visual Studio + ReSharper ~= Eclipse. As I blogged a while ago, I'm somewhat surprised that Microsoft hasn't just bought JetBrains and slapped ReSharper into Visual Studio.\n\n(Note that I'm not really into GUI designers etc - I haven't even looked at what Eclipse has in terms of designers these days. I spend most of my time in an editor, so I want the editor to rock - which it does in Eclipse. I hear even better things about Intellij IDEA, but the times I've tried it I've been underwhelmed. I think I need to pair with a regular user.)\n\nJon"}, {"author_name": "Jason", "gravatar_hash": "b1bbbe4b037d3188280af7b44c89996a", "author_url": null, "date": "Mar 26, 2009", "message": "Totally agree with Jon about VS + ReSharper.  Without ReSharper VS doesn't even compare to Eclipse's capabilities.  Microsoft really should buy ReSharper.\n\nWhat's unfortunate about the VS + ReSharper comparison to Eclipse is price:\n\nVS + ReSharper = $1150\nEclipse = $0\n\nThis is the biggest reason to avoid the MS development stack as an independent software developer, IMO."}, {"author_name": "Brendan", "gravatar_hash": "4c34af319f5b137438bad65e2a25bf37", "author_url": "http://bjkeefe.blogspot.com/", "date": "Mar 26, 2009", "message": "Also, @Jeff:  You used the word <em>sow</em> in the sense of <em>sowing seeds</em> or <em>sowing discontent</em>, but pronounced it as though you were speaking of a female hog; i.e., as though it rhymed with <em>cow</em>.  The correct pronunciation is like Dick Cheney's famous answer: <em>so</em>.\n\nHum the old blues <a href=\"http://www.youtube.com/watch?v=5ZBeerUD-zc\" rel=\"nofollow\">tune</a>, \"You're gonna reap just what you sow/That old saying is true.\"\n\nI now claim the record for the most picayune correction on any part of this site, and maybe any part of the Internet anywhere."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl", "date": "Mar 26, 2009", "message": "The Crucial memory tool has shown that while my mobo can support up to 4GB RAM, I currently have exactly zero.\n\nIt still shown me what type and speed of memory my mobo supports, so it seems useful, but now I have trouble trusting it."}, {"author_name": "Chris Bartow", "gravatar_hash": "61d6e530d4e432132c5039a88e793979", "author_url": "http://www.chrisbartow.com/", "date": "Mar 26, 2009", "message": "A car version of the site would be amazing, especially right now when people are holding on to cars longer and trying to fix themselves.\n\nRight now, there seems to be a popular site (phpbb) for each manufacture where you can try to get answers and tutorials to common problems."}, {"author_name": "Steve", "gravatar_hash": "28fdca798e4129cc895ac8123f0a4fc7", "author_url": null, "date": "Mar 26, 2009", "message": "Jon,\n\nCheck out the IntelliJ blog http://blogs.jetbrains.com/idea/, it's a great source for some of IntelliJ's great features.\n\nThey also provide some nice web casts showing off IntelliJ's features. http://www.jetbrains.com/idea/training/demos/refactorings8.html\n\nIntelliJ is a wonderful Java IDE.  It does cost money, but so far - it's been worth it."}, {"author_name": "matt b", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Mar 26, 2009", "message": "I feel bad for the developers who only really know the \"Microsoft stack\" - you're missing a TON of great stuff with Eclipse!"}, {"author_name": "Charles Graham", "gravatar_hash": "9475e7d0a30de531c27abcc24cd833c4", "author_url": null, "date": "Mar 26, 2009", "message": "You guys mixed up Expression Web and Expression Blend.  Blend is used for designing for WPF and Silverlight.  Frontpage was replaced by Expression Web and Sharepoint Designer."}, {"author_name": "wds", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Mar 26, 2009", "message": "Honestly, after using eclipse for a pretty long time now I'm really leaning over to just going back to my editor and command window (esp. since we're building with maven). All IDE's I've used so far eventually tend to get in your way more than they help you get actual work done. Especially if you're trying to follow best practices (contract-first WS design with netbeans? hah!)."}, {"author_name": "Jim", "gravatar_hash": "25a04fa0165251a32035468156f2de65", "author_url": null, "date": "Mar 26, 2009", "message": "The difference between a new StackOverflow for gearheads and for system builders is that most questions for gearheads have a correct answer that will be true a year from now, similar to programming questions.  A site for system builders is a different animal because the question \"What is the best SSD?\" has an answer that is at best only good for a couple of months.  As the questions find their way into search engines, they just provide noise because 99% tell you the answer at a point in time and are not really conceptual in nature.  It is difficult to differentiate the questions when the only real difference is what month and year it was asked or answered.  That makes it difficult to build a solid bank of content since it expires so quickly."}, {"author_name": "Joel Spolsky", "gravatar_hash": "d77663c217e9d27b725338c06674c94b", "author_url": "http://www.joelonsoftware.com/", "date": "Mar 26, 2009", "message": "@Jim, that's why StackOverflow has editing."}, {"author_name": "Harry", "gravatar_hash": "30a1c558937eb0619bf2549603278307", "author_url": "http://hackprogrammer.blogspot.com", "date": "Mar 26, 2009", "message": "I notice jeff loves to rave about Google's Chrome browser,  @Jeff - have you tried the new Apple Safari browser?  it is in beta - but seriously this totally kicks butt!"}, {"author_name": "Gwyn", "gravatar_hash": "acc637690f49e2b5a2146deb17874d6f", "author_url": null, "date": "Mar 26, 2009", "message": "Things I noticed in this podcast:\n\n1. Joel narrates his use of the computer - \"They are now known as we heart gossip, what is that? Open link in new tab, we heart gossip\"\n2. The kuro5hin website runs on the scoop engine, not on slashcode\n3. Totally random conversation span\n4. Joel hadn't known about the reputation graph and Jeff mocks him"}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Mar 27, 2009", "message": "The odd thing is that I don't really like Eclipse and I'm a Java developer.  I tolerated it because it was the work standard for versions 2.1 and 3.0. Netbeans I've used recently and just plain hate. I actually found Oracle JDeveloper to have a better editor than those two.\n\nAll three of them however pale in comparison to IntelliJ. Whereas I find the Eclipse perspective system unintuitive and annoying and it has the (fairly) maligned \"plugin hell\" problem, IntelliJ just works out of the box and I rarely even add any plugins to it. There's no need.\n\nIntelliJ I think excels in the one area that's really important: the editor. It's auto-completion just tops everything else I've used. Whereas NetBeans will do things like just get brackets and quotes wrong, IntelliJ is just subtly more intelligent but it makes a big big difference."}, {"author_name": "Dave Webb", "gravatar_hash": "a780bab849bc39176f044f5effbba7da", "author_url": null, "date": "Mar 27, 2009", "message": "You mention how a pure architecture realise would be \"suicide\" but I work a lot with IBM products and since they do most of their development via acquisition they have something worse.\n\nUsually the first release of a product after the IBM purchase is the \"blue rinse\" release.  This changes neither functionality nor architecture.  Instead just the names of everything change and a few IBM logos appear here and there.  You can imagine how popular this use of 3-6 months of development time is with users."}, {"author_name": "Christian", "gravatar_hash": "b9712b3a496340ff7492ac3c40f5d3b4", "author_url": null, "date": "Mar 27, 2009", "message": "@Joel, You said that there were no Americans on the 'The jewels of the Caribbean' discussion. Last time I checked Chile was in America :S"}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Mar 27, 2009", "message": "Having used both Eclipse and VS extensively -- and not having built much in the way of GUI stuff -- for my use Eclipse is far, far ahead of VS, although less so since VS2008 came out.  Seriously, the refactoring support in VS is so far behind Eclipse that it should be a bit embarrassing.\n\nI expect that GUI builders in VS are way ahead of Eclipse, and for people who are building GUI stuff, I can see why someone would complain.  I use MyEclipse which includes the same GUI builder that NetBeans has, and it's OK.  It's not great.\n\nBut for building server apps or for being applications that don't have any GUI, Eclipse is way ahead of VS."}, {"author_name": "Pietro Polsinelli", "gravatar_hash": "5198744cd329b6dfdb9e39b4f9794cd1", "author_url": "http://polsinelli.wordpress.com", "date": "Mar 28, 2009", "message": "@Jon Skeet: About your remark on Jetbrains Intellij, it is an amazing IDE, has always been way ahead of Eclipse, from the point of view of \"typing help\" (autocomplete etc.), refactoring, provided tools, web development; Eclipse regularly slowly catching up with an Intellij version 2 releases older than the current; I've been using Intellij for years, and is now an integral part of my \"development life\".\nFollowing Joel's advice of \"the best tools for developers\", you should get Intellij for your developers, even if it isn't \"free\" as Eclipse (no, I'm not affiliated with Jetbrains). Visual Studio? When I last looked at it, it was just stone age in comparison with Intellij :-D"}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Mar 28, 2009", "message": "+1 Pietro and at ~$600 per developer that'll typically cover you for 1-3 major versions, I think IntelliJ is pretty cheap and well worth the money.\n\nMy only bad experience with IntelliJ was version 6. 5 was good, 7 was great, 6 just sucked.\n\nIf only like Netbeans IntelliJ had a PHP editor I'd be a happy man (still haven't found a good IDE for PHP I like).\n\nIt's interesting they're adding Flex support to (they have since version 8) but it still has a way to go."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Mar 30, 2009", "message": "I'm curious which language(s) the people who prefer Eclipse have in mind. Are you claiming that Eclipse beats VS in *Every* language? C#? C++? Java? (How much overlap is there even between which languages the two IDEs support?)\n\nIt's been a few years since I used Eclipse (or Java, for that matter), but back then, I wasn't super impressed."}, {"author_name": "David Citron", "gravatar_hash": "754b8ed66da14fbbae4e5970186a93d8", "author_url": null, "date": "Mar 30, 2009", "message": "My experience:\n\nEclipse:\n - Java: rocks\n - Python: very good with http://pydev.sourceforge.net/\n - HTML/CSS: pretty excellent\n - JavaScript: never really worked correctly for me, but I use it anyway\n - PHP (gasp): Quite good with the PDE\n - SQL: Acceptable with the database features, and database browsing is pretty well-done\n - C/C++: barely tolerable in any environment\n - Win32 resource files: Win3what?\n\nVS:\n - C/C++: very good, especially the debugger\n - Win32 resource editing: the only way to fly\n - C#: gold standard?\n\nThat's about the extent of my IDE usage of late, so consider this more of a $0.02 kinda post."}, {"author_name": "Kevin Dente", "gravatar_hash": "23c1e2063688620b75b248e08c0d5c24", "author_url": "http://weblogs.asp.net/kdente", "date": "Mar 30, 2009", "message": "The biggest reason why the Visual Studio plug-in ecosystem isn't as rich as Eclipse is because it's SO EFFING PAINFUL to build an addin. Still too much COM based goop, obtuse APIs, etc."}, {"author_name": "Dominik", "gravatar_hash": "a9ff706566705fb0a0882915bcabb790", "author_url": "http://blog.deobald.org/", "date": "Mar 31, 2009", "message": "Is there something like the crucial.com tool for linux?\n\nWe'd like to update our (Debian Linux) servers but currently have no idea what type of memory we currently have in there. To check that out we'd need to take them out of the rack and look inside, i.e. downtime."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Mar 31, 2009", "message": "How do those solid state SATA drives compare to 10000 RPM SATA or 15000 RPM SCSI drives?\n\nhttp://www.newegg.com/Product/Productcompare.aspx?CompareItemList=N82E16822136296,N82E16820167005,N82E16822116057\n\nNewegg is not much help."}, {"author_name": "David Seruyange", "gravatar_hash": "880fe2226a83569aa89f46da05268fc8", "author_url": "http://metadeveloper.blogspot.com", "date": "Apr 02, 2009", "message": "It should be noted that Bill Buxton's book actually came out in early 2007, so while it does emphasize a lot of iPod design in the early narrative, it was done long before it was as much of a cliche."}, {"author_name": "Dustin", "gravatar_hash": "a17e4617884e20b1bf3abdb7e9a1232a", "author_url": "http://www.devdustin.com", "date": "Apr 03, 2009", "message": "@Jeff and Joel, regarding when the compatibility view button doesn't show up:\n\n- If you're viewing an internal-to-Internet Explorer page (such as about:InPrivate) \n- If you're viewing a page that has declared it's \"ready\" for Internet Explorer 8 through use of the versioning  tag / HTTP header (it doesn’t matter if this tag triggers Quirks, IE7 Standards, or IE8 Standards, the button won’t be displayed) \n- If you're viewing an intranet page and you have the 'Display intranet sites in Compatibility View' checkbox selected \n- If you're viewing any webpage and you have the 'Display all websites in Compatibility View' checkbox selected \n- If you're viewing a webpage that is included on the Microsoft-supplied compatibility view updates list and you have the 'Include updated website lists from Microsoft' checkbox selected \n- If you've toggled either the 'Document Mode' or 'Browser Mode' settings via the Developer Tools\n\n(see http://blogs.msdn.com/ie/archive/2009/02/16/just-the-facts-recap-of-compatibility-view.aspx)\n\nThe last point I think is especially interesting for web developers, and Jeff hints at how convenient this is.  Hitting F12 will bring up IE8's Developer Tools (also accessible via the Tools menu).  There you can change the Document mode and Browser mode settings:\n\nBrowser Mode: How IE reports UA string, Version vector, and Document mode.\n\nDocument Mode: Change between Quirks, IE 7, and IE 8 document modes.\n\n(see http://msdn.microsoft.com/en-us/library/dd565624(VS.85).aspx)"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Apr 24, 2009", "message": "Hard drive performance comparisons: http://www.extremetech.com/article2/0,2845,2326348,00.asp"}, {"author_name": "Andrew", "gravatar_hash": "314c68904153558f77a68628bec810fe", "author_url": null, "date": "Aug 20, 2009", "message": "Joel mentions that for every month early that they are able to ship FogBugz, there is an extra 200k profit for FogCreek. How exactly does shipping early increase profit so drastically?"}]}