{"response": [{"author_name": "Jarrod Dixon", "gravatar_hash": "2dfa19bf5dc5826c1fe54c2c049a1ff1", "author_url": "http://stackoverflow.com/users/3", "date": "Mar 25, 2009", "message": "I'm so sick of cabbage soup - gonna have some steak tonight!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 25, 2009", "message": "well, we have earned $1.16 so far. I think I will go buy a twix, and we can share it."}, {"author_name": "lomaxx", "gravatar_hash": "77e47d73607b14b75b4cd3d6e5f12a5d", "author_url": "http://blog.pnbconsulting.com.au", "date": "Mar 25, 2009", "message": "will you have an option in the user profiles to allow people to enable ads? I have over 200 rep but have no problem with having the inline google ads at the top of my page, to, as you say, support a fellow programmer?"}, {"author_name": "Itay Moav", "gravatar_hash": "ada681281032e89d41010e7533e7fe69", "author_url": "http://www.linkedin.com/in/itaymoav", "date": "Mar 25, 2009", "message": "As my fellow, I don't care if you enable the adds for me too.\nIt is something I expect, and do on my sites."}, {"author_name": "Mike Geise", "gravatar_hash": "c00b1751d611a54f9b2be78bc67d860d", "author_url": "http://www.nfscars.net", "date": "Mar 25, 2009", "message": "You should just enable it for everyone. Google ad's are not like the regular banner (annoying) ad's most people know. \n\nMost are text based and relevant to the content."}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Mar 25, 2009", "message": "I like the idea of having an option to enable ads to support the site... I don't promise I won't turn it off if it's too annoying though, so please leave this option =)\n\nI want to pitch in to buy Jarrod a steak!"}, {"author_name": "Chad Moran", "gravatar_hash": "14993d37dce5c8195458d3f6d6e47da6", "author_url": "http://www.chadmoran.com", "date": "Mar 25, 2009", "message": "I help out when I can by checking out products that appear in ads that intrigue me.  All on my own will of course."}, {"author_name": "Adam", "gravatar_hash": "072abdb5a6787505e87044eda654a49b", "author_url": null, "date": "Mar 25, 2009", "message": "Can we have it in the original Google colorscheme for ads? That heavy dark-gray colorscheme just jumps out too much. I'd rather have the muted blues and greens of the original scheme."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Mar 25, 2009", "message": "@Mike Geise, I disagree. I think Google ad's are aesthetically some of the ugliest stuff I have seen on the Web besides the obvious animated ads. But that's a decision Jeff and Joel will have to make. I don't have a problem with it showing up for new users; I do wonder if it would be more profitable to have a large image based ad much like the leaderboard style ads currently on the site, rather than Google's ads; but I'm not an expert on advertising."}, {"author_name": "Paul Stovell", "gravatar_hash": "2094bc37f443e885894612df3464afe8", "author_url": "http://www.paulstovell.com", "date": "Mar 25, 2009", "message": "I opened a question titled \"How do you prevent IDisposable from spreading to all your classes?\" (661815). The three google ads that appeared were \"Cure Herpes\", \"New cure for herpies?\" and \"Herpes No More\". :)\n\nWhat about something more guaranteed to be IT, like dailywtf's job board or even Spolsky's job board?"}, {"author_name": "Adam", "gravatar_hash": "072abdb5a6787505e87044eda654a49b", "author_url": null, "date": "Mar 25, 2009", "message": "Also-- \"Ads by Goo\"? What? Looks like something got cut off. :-)"}, {"author_name": "lomaxx", "gravatar_hash": "77e47d73607b14b75b4cd3d6e5f12a5d", "author_url": "http://blog.pnbconsulting.com.au", "date": "Mar 25, 2009", "message": "Also, I know ads are the lowest hanging fruit, but what about just allowing people to donate? It doesn't cost much to implement and it might not make you rich, but why not give people an extra way to give you money? Maybe have a badge for donations or disable ads for people that donate a minimum of $5 or something?"}, {"author_name": "vmarquez", "gravatar_hash": "98732b3a10b3bf2c5d28977676774e61", "author_url": null, "date": "Mar 25, 2009", "message": "My vote also to the profile option to enable/disable ads.\n\nI do not mind seeing those ads at SO. I'd even click some of those from time to time of you earn more per clicks ;)"}, {"author_name": "daftviking", "gravatar_hash": "adcc2602aab290f6f5a24bda66c2e79b", "author_url": null, "date": "Mar 25, 2009", "message": "First reaction: \"Oh great, there's more incentive for people to try to game the system to get the ads blocked.\"\n\nSecond thought: \"Oh wait, it would be a lot easier to just install AdBlock Plus.\"\n\n[glida_radner]Never mind[/glida_radner]"}, {"author_name": "Geoff Dalgas", "gravatar_hash": "b437f461b3fd27387c5d8ab47a293d35", "author_url": "http://www.stackoverfow.com", "date": "Mar 25, 2009", "message": "I'd love earn a decent living!  These ads are part of the Stack Overflow stimulus package.  Help us help you!"}, {"author_name": "Ian Tebbutt", "gravatar_hash": "60cefbe6efe3057c31e60ae892d6880b", "author_url": "http://roocube.blogspot.com", "date": "Mar 25, 2009", "message": "I'm also more than happy to opt in for adverts, but I do have an interesting idea. Many of us on StackOverflow are running our own businesses, can we get ads onto StackOverflow at a reduced rate - I'd love to be able to target that closely."}, {"author_name": "Bert JW Regeer", "gravatar_hash": "6185de14423c18ab236dbf73ca46b86f", "author_url": "http://personal.x-istence.com/", "date": "Mar 25, 2009", "message": "I would absolutely love to able to donate money to the further development of StackOverflow. I can't tell you how many countless hours I have spent on the site looking for questions I can answer, and reading new things that made me go \"ah hah\" or something along those lines.\n\nThe website is absolutely amazing. That being said, Google ads can be changed in terms of colours and the default colours are not required. It can blend into the site as much as you would want it to blend in. Instead or right below the title for the post, I would prefer to have them above it, below the standard Stackoverflow header. It seems to interrupt the flow of reading where it is currently positioned!"}, {"author_name": "Luke Duff", "gravatar_hash": "f4b5bb1a1068d68f7621006430d3202b", "author_url": "http://www.woot.com", "date": "Mar 25, 2009", "message": "StackOverflow is going to be a big target for advertisers. I have no doubt you'll do well with them, especially with the new IT site.\n\nGoogle Ad revenue takes a while to tick up, so be patient with it, and don't hesitate to call them with issues. We've always had great service from them."}, {"author_name": "Alex Kwiatkowski", "gravatar_hash": "34acb7ab77903e694bf1f0b692556ee6", "author_url": null, "date": "Mar 25, 2009", "message": "+1 for enabling the ad's in my profile. I probably wouldn't click on that many but it would increase your CPM and I have no problem with them being there.\n\nThat said I think the colour scheme for the ad looks ugly as hell :) It sticks out way to much. You should just have a white background with coloured links."}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Mar 26, 2009", "message": "@Adam : Maybe it was a typo (Goo). It should have been Gu (Scott Guthrie) :P"}, {"author_name": "Mark Pim", "gravatar_hash": "6e31653cea54a189885f2109ccb34aaa", "author_url": null, "date": "Mar 26, 2009", "message": "I'm with lomaxx on the donations. I believe some hack of a blogger ( ;) ) talked about just this point a while ago: http://www.codinghorror.com/blog/archives/000735.html\n\nI recently donated a bit to TortoiseSVN because I use it everyday and it works great - and I can say the same thing about SO. I have followed an online ad link maybe three or four times IN MY LIFE and have never subsequently bought anything."}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Mar 26, 2009", "message": "@lomaxx : The donate badge would probably degenerate into a pissing contest (like \"I donated more than you...\")"}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 26, 2009", "message": "I'd be happy with a pay-to-hide ads donation system or even a pay-to-choose the ad type. For example a pay more, hide more ads system?\n\nI don't mind the discrete ads down the RHS - I may not have clicked through and bought Regex Buddy had they not been there. Also they're pretty well targetted which is a refreshing change.\n\n\nKev"}, {"author_name": "lomaxx", "gravatar_hash": "77e47d73607b14b75b4cd3d6e5f12a5d", "author_url": "http://blog.pnbconsulting.com.au", "date": "Mar 26, 2009", "message": "@Andrei: I don't think Jeff would really mind people trying to outdo each other in giving money to him and his team, do you?"}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Mar 26, 2009", "message": "As many have already stated, I don't have a problem with the ads per se. I do want to help support SO, but I'm just not that likely to click on an ad... but that may just be me.\n\nWhy not borrow the sponsorship idea that UserFriendly.org uses?\n\n- Ads get displayed for those that don't sponsor anything\n- [minimum amt] and you get no ads for a year\n- [2nd tier] you get no ads for a year and [cool prize]\n\nGraduated upwards and so forth. At the very least contact Illiad and see how well its working and if its worth borrowing the idea.\n\nI've already bought more than the minimum because I wanted to sponsor him and because I really wanted the signed book. ;)"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "61d2a0f034915fa9d2acd6f6b145bba8", "author_url": null, "date": "Mar 26, 2009", "message": "I hate to say this, Jeff, but in the long run I really doubt ads alone will pay for this site.  You _really_ need to start considering how else you can generate some revenue out of this thing.  Some ideas:\n\n* Sponsored questions\n* Put the Joel on Software jobs board up on SO\n* License a version of the code base for use in large software shops"}, {"author_name": "Eduardo", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": null, "date": "Mar 26, 2009", "message": "I think that you say \"In The 7 Levels of Revenue for your Blog, Google AdSense is the absolute bottom of the barrel, a choice of last resort\"\nhttp://www.codinghorror.com/blog/archives/000893.html\n\nThat's no the case any more?"}, {"author_name": "Chris Boe", "gravatar_hash": "5eb94371298a7247d55d8296d861d8cf", "author_url": null, "date": "Mar 26, 2009", "message": "Sometimes I just love AdSense.\nI looked at a question I asked about search a string in JavaScript and since I'm from germany we use String==G-String so I get this advertisments of the lingerie sellers :-), just great"}, {"author_name": "zach", "gravatar_hash": "9d9e2c61e61356c777c563570722af76", "author_url": null, "date": "Mar 26, 2009", "message": "As Alex and others have said:\n\n+1 for opting in to the ads in my profile.\n\nAlso +1 for enabling donations. I wouldn't mind contributing to the health and welfare of the site (and it's programmers!)"}, {"author_name": "Prakash", "gravatar_hash": "f1623049a1ce2d0b6d21a840c49829e1", "author_url": "http://stackoverflow.com/users/123/prakash", "date": "Mar 26, 2009", "message": "As soon as i read this post in google reader, i felt there should be an option to opt-in for having the ads.\n\nCame to post here, and very happy to see many has the same idea.\n\nI think its a good idea to have this. No one would get hurt by this.\n\nCheers - Prakash"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Mar 26, 2009", "message": "+1 for opting for ads\n+1 for donations\n\nI wouldn't mind ads in other places as well as long the ads do no evil.\n\nBut id have to agree with Joel, i don't think ads alone will sponsor this the full run."}, {"author_name": "Steve Armstrong", "gravatar_hash": "56f9b48c5923891a50d682611be2d764", "author_url": null, "date": "Mar 26, 2009", "message": "With Google introducing behaviour tracking, there's apparently an option for sites offering AdSense ads to turn off this extra info gathering. Will you be leaving it on or turning it off?\n\nhttp://blogoscoped.com/archive/2009-03-24-n62.html\nhttp://blogoscoped.com/archive/2009-03-25-n61.html"}, {"author_name": "Randolpho", "gravatar_hash": "09117ac8e2599741ee9191777848b598", "author_url": "http://geekswithblogs.net/LessonsLearned", "date": "Mar 26, 2009", "message": "Advertise all you want. I have only one request:\n\nDon't ever, *ever* become like the hated Experts Exchange."}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Mar 26, 2009", "message": "lol silverlight ads? really? you actually took the time to type that? i could care less about ads. but since google ads started i think i have ONLY been served a relevant ad that interested me enough to click on it twice. not even kidding here, and the last time was a couple of weeks ago and i found myself kind of shocked."}, {"author_name": "John Christensen", "gravatar_hash": "e64bc5b4da778a113559e21aa91da44e", "author_url": null, "date": "Mar 26, 2009", "message": "Here's a wild and crazy idea - you guys can see when you render a case if they're coming from google, or (presumably) if they're coming from a search on your site. What if, under certain criteria (user came from a search on google, user came from a search on your site, user is the person who originally asked the question) you offered a donate link in-line with the answer to the question. When a user donates, two things will happen:\n\n1. A donation will be made to stackoverflow, possible enabling you guys to eat food and not shoes.\n\n2. Provide a reputation bonus to the person who provided the accepted answer to the question, as well as (possibly) dropping them an email to let them know this happened."}, {"author_name": "Goyuix", "gravatar_hash": "846aeb3494a51fdd2af2bb0b99dc364c", "author_url": null, "date": "Mar 26, 2009", "message": "So what about a user pref to enable the google adwords for those of us that have a reputation over 200 and actually want to ensure a few pennies are sent your way each time we go spelunking on SO?"}, {"author_name": "Ben Dewey", "gravatar_hash": "1db8aa9f1900591e1831faf210a8dafb", "author_url": "http://www.bendewey.com", "date": "Mar 26, 2009", "message": "If you want to support SO and enable ads even if you have a rep of 200+ vote for the feature on uservoice\n\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/148076-enable-the-ability-to-opt-in-to-the-google-ads"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 26, 2009", "message": "> In The 7 Levels of Revenue for your Blog, Google AdSense is the absolute bottom of the barrel, a choice of last resort\n\nThis is true, but it's also the path of least resistance. Also, one of the few ways to get (theoretically) *contextual* ads on posts, which I wanted to experiment with.\n\n> Also, I know ads are the lowest hanging fruit, but what about just allowing people to donate? It doesn’t cost much to implement and it might not make you rich, but why not give people an extra way to give you money?\n\nWe appreciate the sentiment, for sure, but you guys and gals are already contributing the most valuable thing of all -- your time! We will *never* ask you for more than that, you've already been extremely generous!"}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Mar 27, 2009", "message": "I would say add advertisments for everyone by default and just give people the option to opt out in there profiles. I think you would be surprised that most users on here would just keep the advertisments to support the site.\n\nWe understand nothing is free and time is expensive."}, {"author_name": "Eduardo", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": null, "date": "Mar 28, 2009", "message": "-1 to opt in for ads. \n\nThe people that are saying that is the people that will never click in ads.\n\nRemember that we are in PPC world now."}, {"author_name": "Mike Sickler", "gravatar_hash": "69739fc4bc58863ff835f4e929694342", "author_url": null, "date": "Mar 29, 2009", "message": "I suppose that Jeff is betting that if 90% of the traffic is coming from Google, then those Googlers are more likely to click on an ad than we SO blog readers. That is a safe bet, I'm sure. \n\nPersonally, I am don't mind the NY Times (and others') model of periodically showing an ad before redirecting to the article. I don't mind it for two reasons: 1) I want to support the service that the NY Times provides, and 2) it's easy to skip the ad.\n\nGood luck with your monetization experiments, Jeff!"}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://pro.robspages.net", "date": "Mar 30, 2009", "message": "Can we add a profile option so Rich.B can edit the ads?"}, {"author_name": "Arron a.k.a Unkwntech", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Mar 30, 2009", "message": "Jeff if you remember in the private beta I asked about being allowed to make donations, and I still think that it is a good idea.\n\nI also support allowing me to enable seeing additional ads to support the site and the developers who we all know are working hard."}, {"author_name": "Michael Kohne", "gravatar_hash": "267cfaf8c1f76da3d8b3c7576a903613", "author_url": null, "date": "Mar 31, 2009", "message": "I think that as long as you don't allow flashing, Flash or Silverlight ads, that most folks won't care much where you put them on the page. I certainly don't. \n\nI think that the idea of using higher rep to disable ads may be a good one - the folks with higher rep are probably the same sorts of people who have ad blockers installed any way, so you might as well just not bother serving up the ad, and keep your rating higher for the ads you do serve."}, {"author_name": "Pablo Santa Cruz", "gravatar_hash": "8bfe11db2bc539a6f339f3a044946153", "author_url": "http://pablo.tocorre.com", "date": "Mar 31, 2009", "message": "Excellent Jeff.\n\nAs lomaxx mentioned earlier, I wouldn't mind seeing ads on the site too. Whatever we need to do to keep StackOverflow alive and growing.\n\nCongratulations on the great site."}, {"author_name": "Lasse V. Karlsen", "gravatar_hash": "1b11262da6d1cd26b1b0bc99a2620cee", "author_url": null, "date": "Apr 01, 2009", "message": "Why exactly will you never accept animated gifs or flash for ads? Is it because they provide a constant moving distraction out of the corner of your eye?\n\nIf that is so, why did you change the StackOverflow logo to be an animated gif? I don't see how that is any better."}, {"author_name": "Lasse V. Karlsen", "gravatar_hash": "1b11262da6d1cd26b1b0bc99a2620cee", "author_url": null, "date": "Apr 01, 2009", "message": "Or perhaps it's april fools joke :)"}, {"author_name": "Jason Short", "gravatar_hash": "3c1bff5eb67356026c394db8597f0cd0", "author_url": "http://vistadb.net/blog", "date": "Apr 21, 2009", "message": "lol - silverlight ads.  I can't find more than a dozen sites using it period, let alone for ad servers.  That made me laugh.\n\nAnd I agree about not accepting strobe flashing or annoying \"dancing\" ads.  They are the single reason why I no longer visit certain sites."}, {"author_name": "Sebastjan", "gravatar_hash": "a94b04abadb5fc282fd17eb8813139a6", "author_url": "http://blog.trepca.si", "date": "May 24, 2009", "message": "If 90% of your traffic comes from Google, then it would be even better to use Chitika (http://chitika.com/publishers.php) for advertising. It will grab the keywords used in google search that led to  the question and show ads based on that. Those ads should be much more effective and are also shown only if user came from a search engine."}, {"author_name": "Satya Prakash", "gravatar_hash": "982393a6cd5920abde07b05333a904e5", "author_url": "http://www.satya-weblog.com", "date": "Jan 17, 2010", "message": "I also support you having ads. After there should be some way to get money for website running"}, {"author_name": "tasha", "gravatar_hash": "d374619e7b6183e5b60645f27d3e6b2c", "author_url": null, "date": "Aug 03, 2011", "message": "Help please! Am a web developer and I am looking for job. Advise,please, sites place an advertisement.\n\nThant's"}]}