{"response": [{"author_name": "Bill Weiss", "gravatar_hash": "a04c189299e924249012b83fd06593ad", "author_url": "http://houdini-cs.livejournal.com/", "date": "Mar 15, 2009", "message": "I'm not actually hating on Microsoft right now, I promise.\n\nSo, if your company gets to 3 years old and is still around but not making gobs of money, where are you left?  Owing over $10k by your math.  There are a lot of business that that would make a huge difference for.\n\nHey, if what you know is Microsoft, that's what you use.  There's just a cost to be paid, now or later."}, {"author_name": "Julien", "gravatar_hash": "05b4a1e9c815fec65c64aa2656a7ab48", "author_url": "http://codorniou.wordpress.com", "date": "Mar 15, 2009", "message": "Hello i am the guy in charge of BizSpark at MS.\nBill, after 3 years, you don't owe 10K, you get to keep the dev tools and you only pay for the server licences, based on your activity. if you re still a small web startups, you don t pay much. after 3 years, the software cost in your P&amp;L is really not significant.\nregards"}, {"author_name": "Chris", "gravatar_hash": "f89b5f030e5a8a254249d477f88b24f4", "author_url": null, "date": "Mar 16, 2009", "message": "\"The options before BizSpark were pretty dismal — Piracy? Grey market licenses? Co-opted MSDN keys?\"\n\nLAMP? Free software as in beer? Free software as in beer with instructions on exactly what they did to brew it?\n\nThis is just another vendor lock in move.  Good luck changing to LAMP anyway after 3 years if you aren't big enough to afford it."}, {"author_name": "Mike Stone", "gravatar_hash": "c8ba7ccacc70a7b826184e8d717bfcd7", "author_url": "http://smellsblue.blogspot.com", "date": "Mar 16, 2009", "message": "If you like the Microsoft stack and are starting a business, this is perfect.  For everyone else (people that prefer Linux, or have tried both long enough to be comfortable in both), I don't think free for 3 years is really that much of an incentive.\n\nFree for 3 years, or free forever... why go on the assumption that your business will be successful enough in 3 years to take on sudden costs that you could have avoided from the beginning?  And if the costs are really insignificant at the end, why not evaluate them on their technical qualities alone?\n\nFrom a technical standpoint, it's not as if Microsoft has any real advantage over the alternatives.  C# is admittedly making language advances where Java is crawling, but Rails provides a very rich and easy to use MVC framework with a fully dynamic language to support it (and there are plenty of other languages and tools that will work fine on a non-Microsoft stack).\n\nAs for the actual server hosting... apache has been an industry standard for years, and Linux provides such a rich command line toolset that Microsoft can't begin to compete with (for the time being).  I would be lost without ssh, sftp, emacs, grep, locate, and the host of other useful utilities that makes dealing with a remote server (heck, even a local machine) a breeze on Linux.  There is a steep learning curve associated with them, but having hit that curve for over a year now, I would quickly say it was worth it.  I'm STILL learning new tricks that you won't find on Windows.\n\nI have to agree with Jeff that what you build is far more important than what you build it with, but I don't feel that this BizSpark thing is really anything to get worked up about, unless you live and breath Microsoft.\n\nActually, I would even urge all people that live and breath Microsoft to give Linux a try for a few months... once you get past the pain of not knowing what you are doing, the other end of the tunnel is full of freedom and excitement and new realms of development pleasure you didn't know existed... which is why I personally will never return to the Microsoft stack willingly."}, {"author_name": "Jan Fabry", "gravatar_hash": "91354ef2eccac3d92ab21b03dd0eab80", "author_url": null, "date": "Mar 16, 2009", "message": "Before this, you could use \"Microsoft Empower for ISVs\" [ https://partner.microsoft.com/global/40011351 ], which costs $375 per year, and can be renewed once. I believe you got five licenses for internal development, and once license for Windows, SQL Server and other \"public-facing\" server software.\nJoel wrote about it in 2003 [ http://www.joelonsoftware.com/items/2003/10/17.html ], when it was $750 per year.\nOf course, this offer is even better, if you want to go (or at least try) the Microsoft Way. Or even if your main product is platform-agnostic, but you need to test it on Microsoft products."}, {"author_name": "Eric", "gravatar_hash": "cb09e4a9a7850fd670f59b2018b146c7", "author_url": "http://www.bluesware.com", "date": "Mar 16, 2009", "message": "I'm a \"startup\" since more than 8 years and perfectly happy with the MS stack.\nLong time around there are packages like MAPS (https://partner.microsoft.com/US/40016455) for USD 300 with full range of MS software (recently including some Dev tools). For developping buy a MSDN license, including some support calls.\nI don't understand why I should loose my time in a Open Source Space where nobody (or everybody) has reponsibility.\nAnd I was never missing command line tools like ssh, emacs, grep, etc because on Windows there's always a nice GUI Swiss Army tool like 'Altap Salamander'."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Mar 16, 2009", "message": "I guess if Jeff would have chosen another stack, he would never been able to give a 3 to 6 week estimation for the project :)\n\n10K $ is a fraction of a developers salary for a year.\n\nIf the MS stack gave them a productivity boost of only 20%, and also the fact that the ASP.Net and SQL Server scalability probably saved them from buying another one or two servers, they pretty much have the costs covered already.\n\nP.S. MySQL doesn't scale nowhere near as good as SQL Server to the amount of traffic SO has, they would have been screwed by this long time ago. I've seen that happen too many times, while sites running on SQL server pretty much are able to serve tens of thousands up to hundreds of thousands users per day with a single database machine."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl", "date": "Mar 16, 2009", "message": "\"It’s OK to be proud of your stack if you aren’t a jerk or a bigot about it.\"\n\nI guess it's nice that you think so, but the difficult part is not having a motto, but living up to it, Mr. PHP-Is-Useless :D\n\nBut obviously I couldn't agree more. The users and the servers don't care what particular software you use."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl", "date": "Mar 16, 2009", "message": "@Pop Catalin: I'm quite sure Craigslist, Facebook, Digg and a few other sites (http://www.mysql.com/customers/) would disagree about the MySQL scaling :)"}, {"author_name": "Eric", "gravatar_hash": "cb09e4a9a7850fd670f59b2018b146c7", "author_url": "http://www.bluesware.com", "date": "Mar 16, 2009", "message": "It's always like that:\nThe software stack doesn't matter, it's always the people. With every software/technology, you can write bad software."}, {"author_name": "Bill Weiss", "gravatar_hash": "a04c189299e924249012b83fd06593ad", "author_url": "http://houdini-cs.livejournal.com/", "date": "Mar 16, 2009", "message": "@Julien: That figure (the $10+k) came from Jeff's figure about how much the server licenses would cost.  I know it's not a fee at the end of the program, but it's effectively a required cost.  If your startup has been going along for 3 years on the Microsoft stack, there's no way you're going to uproot and redo everything on LAMP, right?\n\nLet me clarify: I think this is a cool program for Microsoft shops.  I just don't think it's going to convert anyone over to that stack, and I think it's only saving real money for startups that fail in the first three years (which reduces the cost of an attempt, which is awesome)."}, {"author_name": "Chad Moran", "gravatar_hash": "14993d37dce5c8195458d3f6d6e47da6", "author_url": "http://www.chadmoran.com", "date": "Mar 16, 2009", "message": "Actually you don't need to find a \"Network sponsor.\"\n\nIf you go to http://www.microsoft.com/BizSpark/FindNetworkPartner.aspx and scroll to the very bottom you'll see a form that says \"Having trouble finding a network partner?\"\n\nAfter filling out that form you'll get an e-mail directly from Microsoft within a day or two."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Mar 16, 2009", "message": "\"have I [Jeff] mentioned that Stack Overflow was mostly funded out of my pocket?\"\n\nSo.. what did Joel provide?  I always assumed his role was to be the deep pockets, since it seems he's not doing any of the coding.."}, {"author_name": "julien", "gravatar_hash": "05b4a1e9c815fec65c64aa2656a7ab48", "author_url": "http://codorniou.wordpress.com", "date": "Mar 16, 2009", "message": "Bill,\n10K is a lot, this would be for a successful startup.\nwe see a lot of startups coming from competitive background joining Bizspark, because they want to try their app on windows, for the sake of interoperability.\n(especially for enterprise software startups). \nthey can try it,  leave it.... or keep it.there are no commitments."}, {"author_name": "Stephen", "gravatar_hash": "cbc8e2240caacb5300ad2869487be5e0", "author_url": "http://meandmycode.com", "date": "Mar 16, 2009", "message": "What about a startup supporting a free service, doesn't expect to make profit.. should these simply be looking for sector specific sponsoring? is bizspark still applicable?"}, {"author_name": "DrJokepu", "gravatar_hash": "973c6e2cf1ae9f6615dd883eb14597b1", "author_url": null, "date": "Mar 16, 2009", "message": "\"We feel that building cool stuff is way more important the brand of screwdriver you used to build it.\"\n\nI think this is a bit of hippyism. I had to work in the past with programming environments that totally lack any debugging capabilities (even the good olde' printf or a logfile or a serial port). Now that's a pain in the back. Using you metaphor, it's quite hard to build something with a screwdriver that just simply sucks."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 16, 2009", "message": "> Using you metaphor, it’s quite hard to build something with a screwdriver that just simply sucks\n\nWell, assuming non-suckiness. Most of the dev stacks that form communities and advocates are certainly good *enough*. I don't see any COBOL-rules trolls out there anywhere..\n\n> I guess it’s nice that you think so, but the difficult part is not having a motto, but living up to it, Mr. PHP-Is-Useless\n\nPHP Sucks, But It Doesn't Matter\nhttp://www.codinghorror.com/blog/archives/001119.html\n\nAs above, it's good *enough*. That said, I think PHP is easily the worst designed \"language\" to achieve mass popularity. As Alan Kay ( http://queue.acm.org/detail.cfm?id=1039523 ) said:\n\n---\nLet's say the adoption of programming languages has very often been somewhat accidental, and the emphasis has very often been on how easy it is to implement the programming language rather than on its actual merits and features. For instance, Basic would never have surfaced because there was always a language better than Basic for that purpose. That language was Joss, which predated Basic and was beautiful. But Basic happened to be on a GE timesharing system that was done by Dartmouth, and when GE decided to franchise that, it started spreading Basic around just because it was there, not because it had any intrinsic merits whatsoever.\n\nThis happens over and over again. The languages of Niklaus Wirth have spread wildly and widely because he has been one of the most conscientious documenters of languages and one of the earlier ones to do algorithmic languages using p-codes (pseudocodes)—the same kinds of things that we use. The idea of using those things has a common origin in the hardware of a machine called the Burroughs B5000 from the early 1960s, which the establishment hated."}, {"author_name": "wds", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Mar 17, 2009", "message": "I think it's funny Jeff said \"It’s OK to be proud of your stack if you aren’t a jerk or a bigot about it.\" and people on both sides of the fence started railing about the other stack being crap. Lighten up people, Jeff is right, most of the web dev environments work well however you approach it."}, {"author_name": "NotAmused", "gravatar_hash": "0c28f8994677a87afa83f14ba427c148", "author_url": null, "date": "Mar 17, 2009", "message": "@wds, that's interesting. Maybe Jeff should take his own advice too. Jeff wrote some pretty bigoted and ridiculous stuff about IMVU recently:\n\nhttp://www.egometry.com/tech/imvu-is-3d-avatar-chat-its-also-a-pride-inducing-piece-of-software-engineering/\n\n\nPretty ridiculous stuff, mocking an application, regardless of what you think of the audience, that is developed by a very technically capable team. StackOverflow isn't curing cancer either. And last time I checked Phil Haack implemented about 5% of SO in about 5 minutes and there have been several knockoffs of SO pop up in quick succession. SO can be useful and is popular, but is mostly popular due to Jeff and Joel's audience. There's not much that requires a very technically savvy developer in SO. Even knowing C or knowing anything about Computer Science is derided on the podcast and Jeff's blog, yet Jeff thinks the IMVU developers should be embarrassed. Ridiculous!"}, {"author_name": "roy", "gravatar_hash": "f3fb9c7757f76ec82dd1c03245c197ae", "author_url": null, "date": "Mar 18, 2009", "message": "I used to use  Microsoft Actionpack, $400 year for 2 server licenses, 10 windows xp licenses and 10 ms office license.   additionally, you got a license for windows CRM software, mappoint, exchange, SQL server, infopath (basically anything needed for small bizness) it was great.   This was geared torward shops that were microsoft development shops, which meant the software also came with kits to give away to your customers.   I think M$ still has this program, tho it's very hard to find on their site, you have to sign up as a m$ partner, and they just made it where u have to pass a test to qualify for the program."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 20, 2009", "message": "> yet Jeff thinks the IMVU developers should be embarrassed\n\nDifferent topic altogether, but I stand by my statements. IMVU is basically softcore porn.\n\nhttp://avatars.imvu.com/hottiepie4life\n\nJust sayin'."}, {"author_name": "WasNotWas", "gravatar_hash": "4006d89f4992c1a08583b3829545f91a", "author_url": null, "date": "May 20, 2010", "message": "Does the MS BizSpark (ala the MSDN downloads) contact Mac Development tools?  I ask, specifically, regarding Office For Mac.  Can we develop Office solutions for the Mac with this BizSpark thing?   Thanks."}, {"author_name": "Zeke", "gravatar_hash": "c4c571ac0fa44abdc972b372fff02735", "author_url": null, "date": "Oct 29, 2010", "message": "I like the use of the moxie tattoo picture...thats my tattoo!"}]}