{"response": [{"author_name": "John Sheehan", "gravatar_hash": "54b75f6fbf4434162bfcda6b0cb9b86b", "author_url": "http://john-sheehan.com/blog", "date": "Mar 08, 2009", "message": "There are downvotes, but they are limited. You must have a certain level of rep, the comment must be relatively new (I don't recall the specifics on the time limit) and you can't downvote comments on your own submissions. You cannot downvote a submission. \n\nThere are two ways to effectively downvote a submission: submit something better and vote other submissions up. Since they use a floating ranking system, voting another submission up has the same effect as voting others down.\n\n(Also in the last paragraph you say 'disallowing upvotes' when I think you mean 'disallowing downvotes')"}, {"author_name": "John Sheehan", "gravatar_hash": "54b75f6fbf4434162bfcda6b0cb9b86b", "author_url": "http://john-sheehan.com/blog", "date": "Mar 08, 2009", "message": "More info: \"We've also doubled the karma threshold for downvoting comments (to 100), and capped the minimum score of a comment at -8.\" from http://ycombinator.com/newsnews.html"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 08, 2009", "message": "from the faq:\nhttp://ycombinator.com/newsfaq.html\n\n--\nWhy don't I see down arrows?\n\nThere are no down arrows on submissions. They only appear on comments after users reach a certain karma threshold. \n--\n\nSo apparently the (new?) threshold to downvote is 100, which means 100 users would have to upvote you first. That's equivalent to us making our downvote required rep 1,000!"}, {"author_name": "John Sheehan", "gravatar_hash": "54b75f6fbf4434162bfcda6b0cb9b86b", "author_url": "http://john-sheehan.com/blog", "date": "Mar 08, 2009", "message": "Yeah it's a little high. It does force new users to hang around long enough to absorb the culture before they start downvoting all willy-nilly. I think it also works as an incentive to keep users around, like post editing on SO."}, {"author_name": "John Sheehan", "gravatar_hash": "54b75f6fbf4434162bfcda6b0cb9b86b", "author_url": "http://john-sheehan.com/blog", "date": "Mar 08, 2009", "message": "Also, one last thing (as I monopolize your comment thread)...writing 20 opinions that are agreed with 5 times each isn't nearly as much work as writing 20 definitive and helpful answers that get 5 votes.\n\nAlso, you get rep from submissions so you can get to 100 pretty quickly submitting popular posts before others (I made most of my initial rep gains from posting DHH blog posts).\n\nFrom my experience, getting to 100 on HN was way easier than 1K on SO. Getting to 1000 on HN was much harder than 10K on SO. YMMV"}, {"author_name": "Anon", "gravatar_hash": "55502f40dc8b7c769880b10874abc9d0", "author_url": null, "date": "Mar 08, 2009", "message": "Wow, there's some analysis fail if I've ever seen it. Granted, I think I was in the 1400s before I left. Anyway, only letting well-vetted users downmod is a very good idea."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 08, 2009", "message": "Anon, I do feel like a doofus for not realizing that downvotes are possible on HN. But I swear I have never seen a single downvoted post any time I've visited. To be fair, the current top-rated thread:\n\nhttp://news.ycombinator.com/item?id=507509\n\n(OK, first of all, how is \"how to stop the drug war\" related to news of hacking? But I digress..)\n\nHas 108 comments, and a few of them are negative. That's literally the first time I've ever seen it. I'm a very occasional user of HN (my karma is 6, I think?) though.\n\nIn my defense:\n\n1) There's definitely an element of \"if the user can't find it, the feature doesn't exist\" here\n\n2) In practical terms, downvotes are so extraordinarily rare on HN that they almost don't exist."}, {"author_name": "Steve Sheldon", "gravatar_hash": "23a28f6ede358f8ac229a652b0b13d51", "author_url": null, "date": "Mar 08, 2009", "message": "Every community I have been involved in, the process of downvoting has caused such destruction, it is not clear to me how anyone would treat it so casually.  By destruction, I mean rating wars.\n\nYour attitude is interesting considering in one of the stackoverflow podcasts you talk about the process of banning users, and how banning a user will result in them fighting back.  But if you instead just hide their content from everyone else, the banned user will be oblivious and just think he is being ignored by everyone else.\n\nHow could someone who had such an intelligent observation on banning not understand ratings wars?"}, {"author_name": "John Sheehan", "gravatar_hash": "54b75f6fbf4434162bfcda6b0cb9b86b", "author_url": "http://john-sheehan.com/blog", "date": "Mar 08, 2009", "message": "This might explain the low level of downvotes: http://news.ycombinator.com/item?id=507970\n\nHN was not designed to be user-friendly per se. They want to attract a user of a certain expertise level, so hiding the down arrow until the requirements are met doesn't matter as much.\n\nAs a very regular HN user (with a rep of 1567), I frequently see downvoted items.\n\nStories like the drug war one are frequently killed. Stories do not need to be specifically about hacking, but interesting to hackers."}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Mar 08, 2009", "message": "I see commonality with \"friend\" counts on social networks and especially feedback scores on eBay. Over time these will be and have been (respectively) devalued. Considering the probability that in the future more and more of our interactions will incorporate reputation-as-currency (as opposed to actual interpersonal reputation), it's vitally important that we get it right. It's a big leap to go from a pig in a poke (the more tangible) to Bernie Madoff (the much less tangible). We need to find a way to flatten that curve."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Mar 08, 2009", "message": "You should invite Paul on your podcast sometime! I'm sure you three have wonderfully unique perspectives on community building and software startups!\n\nAlso, why is this filed under ASP.NET?"}, {"author_name": "BJ Clark", "gravatar_hash": "a40808433170b81d6cbc22d5565e0b61", "author_url": "http://www.markedaspertinent.com", "date": "Mar 08, 2009", "message": "http://img.skitch.com/20090309-rusue7pix87swxhnk1d2x57nei.jpg\n\nYou can definitely have negative scores. Maybe they are auto-hidden to people below a certain karma?"}, {"author_name": "Kevin", "gravatar_hash": "a869694df68528dd2af08e880dea83de", "author_url": "http://lacker.info", "date": "Mar 09, 2009", "message": "On Hacker News once comments get voted negative, they are dimmed out in grey, and a lighter shade of grey the lower it goes. That's probably why you didn't notice.\n\nAnyways, a bit ironic that you say you \"studied it closely\" when building Stack Overflow and yet got the fundamental claim of this post wrong. No big deal, I love Stack Overflow anyways ;-)"}, {"author_name": "Peter Hickman", "gravatar_hash": "0bfcd61fc289de2e441929ecfd00b0ed", "author_url": null, "date": "Mar 09, 2009", "message": "\"I can’t recall ever seeing a single negative voted comment in all the times I’ve visited Hacker News! \" My karma has gone negative twice so far, some people are a little sensitive :)\n\nOne idea I've had though was to age karma or have it only be effective for a certain time period, say 30, 60 or 90 days. If you stop being insightful or entertaining then you start to slide."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 09, 2009", "message": "> Anyways, a bit ironic that you say you “studied it closely” when building Stack Overflow and yet got the fundamental claim of this post wrong.\n\nWe did! I swear! It's just that negative comments are really rare on Hacker News for casual users like me, apparently.\n\nThat is a good thing by the way, testament to the quality of the community."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Mar 09, 2009", "message": "I find this bit of the post very interesting:\n\n\"The advantage of this system is that nobody gets downvoted, but at a steep cost: we've lost half the potential information. If a post has zero upvotes, does that mean it's bad? incorrect? uninteresting? mediocre? There's no way to tell, because zero has multiple meanings.\"\n\nZero has multiple meanings on StackOverflow too: it can mean no votes, or +1 and -1, or +2 and -2 etc. That can make a big difference, IMO.\n\nThere's a really easy solution to this though, just by showing both up and down votes, potentially on hover to avoid being distracting? Indeed, there have been a few UserVoice suggestions to roughly this effect - but the only ones I've found in a quick search have been declined.\n\nI'd be very interested to see an update to this blog post addressing why you believe this information should be hidden, given the \"steep cost\" of multiple meanings for a single number. (Interestingly enough, with the new 10K rep tools, we do get to see *some* downvote information.)"}, {"author_name": "chmike", "gravatar_hash": "404fabbcb3e36bac8da7d1904d260ec0", "author_url": null, "date": "Mar 09, 2009", "message": "By only considering the sum of up votes and down votes one loose one information. A subject with a low vote value can be such because there was very few votes or because the subject is very controversial. There is no way to distinguish the two when only the sum is retained. \n\nSo instead of adding a negative arrow, add an orthogonal arrow. One for up votes and one for negative votes. You'll add a new dimension and four zone will clearly appear. One with significant positive support, one with negative support, one with no support and one for controversial subject. \n\n\nThere is another suggestion regarding votes. The current model relies on the assumption that popularity \"up votes\" is an indicator of pertinence and validity. But this depends on the competence and quality of judgment of the voters. Weighting the votes by the voter's recognized \"competence\" will yield a more valid estimation of the true value of the subject. \n\nThis is how it works in the scientific domain. It is worth to take in consideration because it has been validated through a century old darwinian selection process. Note also that google's search result ranking is apparently directly inspired by the scientific article ranking principle. \n\nI'm working on an electronic journal web service and consider using voter weighting as well as preserving the two dimensional information of up and down votes."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Mar 09, 2009", "message": "Btw, I think this is the second time that Jeff has said that \"the math\" suggests there will be 5 times as many upvotes as downvotes. Jeff, could you elaborate on why you think that should be true? It certainly takes 5 *downvotes* to counteract one *upvote* but why \"should\" that affect the actual voting ratios? What theory are you actually applying here?"}, {"author_name": "Ralph Corderoy", "gravatar_hash": "f8fc75437fbd60391b013a8e9ca256ed", "author_url": null, "date": "Mar 09, 2009", "message": "You can't downvote comments on news.yc if they're more than a couple of days old either.  pg removed the ability because one person went around downvoting all old posts by another user they fell out with.\n\nUnfortunately, as I visit the site only every couple of days as I read it through RSS, it means I can't fully participate in the site.  I can upvote comments, but not downvote most of them;  they're too old."}, {"author_name": "Max", "gravatar_hash": "e251c59f1adb27310b93c87298bb545a", "author_url": "http://blog.brokenfunction.com/", "date": "Mar 09, 2009", "message": "The problem with downvotes is it allows people who disagree to suppress the opinions of others. The whole upvote/downvote isn't a measure of quality, it's a measure of differences between the post and the person reading it.\n\nI'm not saying only upvoting is the right way either, but it's not as if people aren't justified in trying to find a better way for their audience. Perhaps different alternatives work better in different situations."}, {"author_name": "Zardos", "gravatar_hash": "907a809554c75900babdff170e26406c", "author_url": null, "date": "Mar 09, 2009", "message": "I prefer up-voting only like Hacker News.\n\nBut I still visit http://www.reddit.com/r/programming/ much more frequently!\n\nWhy? \n\nBecause of the web-design! The small font on the gray background is plain ugly.\n\nreddit, digg, slashdot are all easy on the eye.\nBut hackernews? No thanks!\n\nConclusion: You can write many words about a theory like up-down voting is better to up-voting only. But sometimes there may be a completely different reason why people prefer on thing over another."}, {"author_name": "Pesto", "gravatar_hash": "350bd142172dc399ef6928001591544a", "author_url": null, "date": "Mar 09, 2009", "message": "Given that there have been 122,141 downvotes (and counting), and that Rich B has made 1226 of them on his own, that means that Rich B accounts for over 1% of the downvotes on this site.  Which just goes to show that he's a pivotal part of the \"critical community feedback loop from the system\".  Or maybe it just means he's a big, smelly troll.  I report, you decide."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Mar 09, 2009", "message": "&gt; On average, there are 10x as many upvotes cast as downvotes. That’s even more optimistic than math would predict (10 / 2 = 5x).\n\nI would think that any predictive models would be based on the cost to the person casting the vote, rather than the benefit/penalty to the person receiving it."}, {"author_name": "Ken", "gravatar_hash": "97d540da0aee796ba07e9420099552b4", "author_url": null, "date": "Mar 09, 2009", "message": "It's not that hard to find negative-rated comments on HN.  I googled for \"fuck\" on that site, and found  pretty easily.\n\nIt's also open-source, and its own source has been posted on itself several times.  When I'm wondering how something works on HN, I just read it.  When I'm wondering how something works on SO, I have to ask an \"off-topic\" metaquestion.  This isn't a ding at closed-source in general; simply that it's rather strange to see a closed-source community making comments about \"hidden\" features of an open-source one!\n\n\"If you add back in the negatives, suddenly the range is doubled.\"\n\nTime to go back to math class?  :-)  The integers and the nonnegative integers have exactly the same number of elements: countably infinite.  (Though I guess if you're using C# + SQL then you're stuck with fixnums so it is doubled, but HN is Lisp + files so it won't fall over at 2^31.)\n\nIn any event, \"0\" under the HN system is no more ambiguous than \"+3\" under the SO system: is that +50-47, or +3-0?\n\nIn any event, it's completely safe for me to say whatever I like here because, despite your claims that these voting features are necessary for the community, this SO blog has no voting at all.  :-)"}, {"author_name": "dan paluska", "gravatar_hash": "8e5a669ae4b58fab715b960833cc5dcd", "author_url": "http://plainfront.com", "date": "Mar 09, 2009", "message": "What can animal training tell us about community building? Maybe nothing... But this discussion reminded me of this article.\nHow do you teach animals new tricks? With positive rewards only. You ignore bad behavior.\nhttp://www.nytimes.com/2006/06/25/fashion/25love.html\nA great article. A snippet that summarizes pretty well.\n[snip]\n    I listened, rapt, as professional trainers explained how they taught dolphins to flip and elephants to paint. Eventually it hit me that the same techniques might work on that stubborn but lovable species, the American husband.\n\n    The central lesson I learned from exotic animal trainers is that I should reward behavior I like and ignore behavior I don't. After all, you don't get a sea lion to balance a ball on the end of its nose by nagging. The same goes for the American husband.\n\n    ...\n\n    I was using what trainers call \"approximations,\" rewarding the small steps toward learning a whole new behavior. You can't expect a baboon to learn to flip on command in one session, just as you can't expect an American husband to begin regularly picking up his dirty socks by praising him once for picking up a single sock. With the baboon you first reward a hop, then a bigger hop, then an even bigger hop. With Scott the husband, I began to praise every small act every time: if he drove just a mile an hour slower, tossed one pair of shorts into the hamper, or was on time for anything.\n[end snip]\n\nAlso, should we be wary of \"experts\" and the idea of downmods coming only from the top? Doesn't that lead to towers rather than broad based systems?"}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": "http://www.titlech.net", "date": "Mar 09, 2009", "message": "One thing I've noticed in my limited use of SO is that the community seems forgiving.  I've had a small portion of my rep gained by someone down voting me, and someone else countering it.  My answer stayed at 0 total, but I netted 8 Rep.  I've done the same.  I'll upvote something I don't think deserves a -2 rating.\n\nI like the system"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Mar 09, 2009", "message": "\"Also, should we be wary of “experts” and the idea of downmods coming only from the top?\"\n\nYes. If a downvote from me becomes more of a penalty than a downvote from someone else, I'll stop downvoting. I'll keep *commenting* of course - it's important to *explain* why you think someone is wrong - but I shouldn't have more voting power than anyone else (other than the relatively low bars required to vote at all).\n\nIf I want lots of people to stomp on an answer because it's wrong or dangerous, it's up to me to convince people of my reasoning via comments. I *hope* others near the top feel the same."}, {"author_name": "Andrew", "gravatar_hash": "0163290b3bd95a0dfb748d844792765b", "author_url": null, "date": "Mar 09, 2009", "message": "Personally I feel questions should be up-vote-only with answers being both up/down.\n\nOnly allowing up votes for questions provides more of an incentive for people to highlight posts they feel are interesting, insightful or deserving of a good answer.\n\nIf you look at the frontpage of stackoverflow.com the majority of questions have 0 votes. Many of these are good questions and have a number of answers, but still have zero votes.\n\nWith the ability to vote-close posts that are offensive, unrelated, or just dumb I'm not sure what the point is in allowing questions to be down-voted. This negative-half of information is redundant."}, {"author_name": "David HAust", "gravatar_hash": "42c6731377cc670ecc89cbf64e0a780c", "author_url": null, "date": "Mar 09, 2009", "message": "+1 Jon Skeet for \"showing both up and down votes\" to remove the confusion of the +2/-2 = 0 votes.  And yes, I have voted for this on UserVoice ;b"}, {"author_name": "bob", "gravatar_hash": "820d0e4ee14e986a44d33782ca852f51", "author_url": null, "date": "Mar 09, 2009", "message": "90 percent of programming articles are either copy-cat spam of something that might actually be worthwhile, or complete and utter horseshit or both.\n\nIf any site shows upvotes for all content then it is a lie and showing that the sites editorial decisions or lack thereof is a big problem.\n\nIm sorry but 90 % of everything is pure unadulterated bullshit."}, {"author_name": "btmorex", "gravatar_hash": "05633a0959f2617318fc204a1cf469c4", "author_url": "http://blog.shadypixel.com/", "date": "Mar 09, 2009", "message": "I think you've ignored the best reason to disallow down votes:\n\nIt allows minority opinion to be seen/heard.\n\nIf you're only looking for consensus, sure, add down votes. For a site like stackoverflow, that might work really well. For a more discussion oriented site though, it has a negative effect to encourage only like-minded community. This is epitomized in slashdot. Read any article involving Apple at +4 and you will never see anything even remotely negative.\n\nNo matter what you say, up/down votes will be treated as I agree/disagree by your users. If that's the goal, then great, but it definitely homogenizes the community."}, {"author_name": "Manni", "gravatar_hash": "aa6a7a12f4cd03bc8c98fa8e9af9ad41", "author_url": null, "date": "Mar 10, 2009", "message": "Jon beat me to it, but I just have to bring this up again:\n\n\"If a post has zero upvotes, does that mean it’s bad? incorrect? uninteresting? mediocre? There’s no way to tell, because zero has multiple meanings.\"\n\nThis is a good point; unfortunately it also pertains to SO. If an answer is listed as 0, does that mean that there were no votes on it? 100 up-votes and 100-downvotes? \"There’s no way to tell, because zero has multiple meanings.\""}, {"author_name": "Andrew Grimm", "gravatar_hash": "b8e3670b31423747deb173731e4af83d", "author_url": "http://andrewjgrimm.wordpress.com/", "date": "Mar 10, 2009", "message": "I don't use Digg myself, but I've heard of the \"Bury Brigade\" phenomenon, where articles (and comments?) are buried because of their point of view rather than the article's merit (or lack thereof)."}, {"author_name": "DrJokepu", "gravatar_hash": "973c6e2cf1ae9f6615dd883eb14597b1", "author_url": null, "date": "Mar 11, 2009", "message": "@Andrew Grimm: The point of the Bury Brigade on Digg that it is coordinated. There is such a thing on Stackoverflow too, although it is not as well-organized as on Digg. Still, gathering five people is enough on Stackoverflow to close a question or delete it with offensive votes so the bar is much lower."}, {"author_name": "Jordan", "gravatar_hash": "7c2c75e70c1d5fcdaf847bc28fba9ce6", "author_url": null, "date": "Mar 11, 2009", "message": "@DrJokepu:\nIt his happening as we speak. The Utopian Programming Knowledge Base site that SO strives to be, is sinking. Soon there will only be the trolls, the \"elite\" and the band playing on the background."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Mar 11, 2009", "message": "@Jordan: I beg to differ.  There are some problems and some conflicts, as will occur in any venue where human beings are present.  No-one is going to say this is a utopia.  But I still see a lot of good questions and good answers.  The overwhelming bulk of activity is positive."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Mar 12, 2009", "message": "I have to say, this is a bit too much self-congratulating. I don't think downvoting is this great check-and-balance, arbiter, equalizer, set-things-right-with-the-world, magical critical feedbackloop phenomena. I think @Pesto makes a great point. Most posts that I see downvoted appear to be just noise. Usually, if there is any humor or mention of a product, it will just be downvoted because people a) don't like humor or b) don't like that product. There are many downvotes. @Btmorex makes a great point in that the minority is downvoted. If anyone says anything negative regarding whatever the current fad is, be it TDD, MDD, DDD, Agile this or that, and so forth, it is downvoted out of hand. Don't dare cross the ALT.NET/NHibernate Mafia. :) Most of it is just silly. A lot of downvotes are also just noise; people will get downvoted because they posted an answer to a question but when the inquirer edited the question, the answer was no longer relevant; this seems like an odd downvote. I don't want to belabour this, but if you are going to hold downvoting up as this magical amulet to right the ship of community, be ready for criticism. :)\n\nOh yeah, as far as the whole number line thing, ya that's a bit wrong too! :)"}, {"author_name": "cdonner", "gravatar_hash": "d22866cc1cf344f256ae12a92392c36a", "author_url": "http://cdonner.com/more-synology-rackstation-network-tests.htm", "date": "Mar 13, 2009", "message": "\"This isn’t about points. It’s about participation. Downvoting should be reserved for nasty/offensive/stupid/poorly-thought-out/totally-off-base comments.\"\n\nI could not disagree with this citation more. This is not about participation - it is about content. You can only grow participation, if you have good content to offer, and a lot of questions and answers are not good because they are wrong or not relevant. \n\nI am very much in favor of keeping down-votes as a QA tool of sorts. I write crap sometimes after a long day myself and I will gladly take a down-vote if it was deserved - in the interest of making Stackoverflow a better resource."}, {"author_name": "junio b 10", "gravatar_hash": "c1170e825797a411760a6b826f2640d8", "author_url": "http://talesofpirates", "date": "Mar 19, 2009", "message": "trade value tales of pirates money!!!!!help"}]}