{"response": [{"author_name": "Mark Biek", "gravatar_hash": "040ffc7f3327b05f01c54a8bef3ba60a", "author_url": null, "date": "Mar 03, 2009", "message": "Nice clarification.\n\nThat post today was a doozy."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 03, 2009", "message": "@Mark Biek: Heh, you should have seen the four that preceded this one.  Quite Ironically, I had posted a question 'back in the day', titled: \"Wiki Rules for Stack Overflow\" (That was closed by one user and subsequently deleted by Jeff for reasons unknown) that brought up this specific potential issue.  The question was meant to hash out this specific issue: How to handle editing, especially under adverse conditions.  While I applaud Jeff's post, I'm quite sure it'll be used by both sides in this 'war' to their advantage.\n\nObviously, since I'm one of the participants, I can hardly be considered objective, but it bears noting that Stack Overflow editors (at least the ones that I see making edits day in and day out) want to differentiate Stack Overflow from the nauseating forums out there where you can view plenty of reasons why community post editing should have happened far sooner than now."}, {"author_name": "Simon Hartcher", "gravatar_hash": "fa091d3f90f1743a2e1bf0ec12433ec2", "author_url": null, "date": "Mar 03, 2009", "message": "Pavlova is the bomb. Since I'm Australian, I think I'll go edit that wiki entry."}, {"author_name": "Simon Buchan", "gravatar_hash": "ea6872cf5f32040741eabf1e7e089416", "author_url": null, "date": "Mar 03, 2009", "message": "@Simon Hartcher: Dammit! And now you're stealing our names, too!"}, {"author_name": "Andrew", "gravatar_hash": "a547170d17a674dcf7f06d2478b1db87", "author_url": null, "date": "Mar 03, 2009", "message": "There seems to be a few people (well, two) who spend their time incessantly editing and rewriting post and frankly it's getting a little old.\n\nPersonally I enjoy writing a lot and try to frame any SO questions in a humorous way that are both relevant and enjoyable to read. If someone wishes to correct typos, spelling, add links or clarify something then please please do so! \n\nHowever seeing a question butchered because an \"editor\" (is that an official SO role now?) deems it to be non-neutral, or (heh!) 'bullying' is a little much.\n\nI really think that editing by others should be subject to the same style of daily limits as voting is. It'd really help restrict edits to meaningful changes and not some mission to purify SO."}, {"author_name": "hellonearthis", "gravatar_hash": "baee665fa43c8ccd087517467fe7c04e", "author_url": null, "date": "Mar 03, 2009", "message": "Why so hung up on who invented the pav. Its just a giant meringue and they 1st appeared in François Massialot's cookbook of 1692"}, {"author_name": "JaredPar", "gravatar_hash": "215d7677cc03d242839c9f89d89e1e23", "author_url": "http://blogs.msdn.com/jaredpar/archive/2009/02/11/why-are-thread-safe-collections-so-hard.aspx", "date": "Mar 04, 2009", "message": "That post was a great example of why we should be able to give feedback on people based on their questions.  In particular, have the ability to flag a comment as offensive."}, {"author_name": "JaredPar", "gravatar_hash": "215d7677cc03d242839c9f89d89e1e23", "author_url": "http://blogs.msdn.com/jaredpar/archive/2009/02/11/why-are-thread-safe-collections-so-hard.aspx", "date": "Mar 04, 2009", "message": "(repost to correct late night typo)\n\nThat post was a great example of why we should be able to give feedback on people based on their comments. In particular, have the ability to flag a comment as offensive."}, {"author_name": "Brian", "gravatar_hash": "f05e3b9aa180fbacdff713e300a7c5f2", "author_url": null, "date": "Mar 04, 2009", "message": "@Andrew said \"I really think that editing by others should be subject to the same style of daily limits as voting is. It’d really help restrict edits to meaningful changes and not some mission to purify SO.\"\n\nI agree and this makes sense for the reason your pointed out. Voting has a limit and in the same way so should the number of edits one person is allowed per day. This will also allow others who want to edit but are always a bit too late, diversifying the edits."}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Mar 04, 2009", "message": "Sorry Jeff :("}, {"author_name": "theman_on_vista", "gravatar_hash": "535397b708dc316389dd4041a2797496", "author_url": null, "date": "Mar 04, 2009", "message": "the robots are winning"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Mar 04, 2009", "message": "Awesome.  Just awesome.  It was amazing to watch the panties get all wadded up.\n\nI note that based on the FAQ some particular class of editings should be dropped."}, {"author_name": "Dillie-O", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Mar 04, 2009", "message": "Good to hear you're bringing this up Jeff. There definitely seem to be some \"meta\" discussions about SO that tend to creep up through the questions, like how many \"funny\" or \"non-programming\" questions can we actually tolerate and still be considered a \"respectable\" site. By putting in some blog posts, you are providing a \"this is how the creators intended things to go\" and also gives a medium to discuss it.\n\nKeep up the good work and I LOVED the nod to Rabbit Fire, but how does Elmer Season fit into the SO scheme? 8^D"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Mar 04, 2009", "message": "Though its sad to see the site explode in flames like that, it was pretty fun to watch."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@Andrew: And of course you really help things by going in and rolling back standard edits that do not pertain to you at all. \n\nAs Jeff says, perhaps it is not a good fit if editing bothers you so much?"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Mar 04, 2009", "message": "@Rich - just a comment - no where in the FAQ above did I see justification for removing greetings/salutations or thanks.\n\nIf that comment is no applicable, then my apologies."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@RichB: Jeff basically told you to stop your Holy Crusade. Look, it's right there in the post:\n\n\"Always respect the original author. \n\nHowever, if the author of the post is resistant to your editing changes, even a perfectly legitimate edit based on the above rules, be the bigger man (or woman) and let them have it their way. Our goal here is not to cause friction between users.\"\n\nYou are causing friction. Which is far more damaging than \"teh\", or casual language. Remember the name of the site isn't \"RichBOverflow\", it doesn't have to conform to _your_ standard."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Mar 04, 2009", "message": "@Jeff A, where is the link/pic of Mr. Dirty Dancing saying \"Be Nice\" from this movie:\n\nhttp://www.imdb.com/title/tt0098206/\n\n\"I want you to be nice until it's time to not be nice. \""}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@Tim: they picked that up because Atwood himself was seen making revisions in the very same way. I believe Gortok has the links to show. \n\nGortok and Rich have both said repeatedly that they base their edit standards off of what the admins and other mods have done in the past. That's why we call them standards. Once a precedent has been set, you follow that precedent so that the content can remain orderly and easy to read."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@Toast: I would argue people who are simply trying to 'fight the man' and rolling back standard edits and starting flamewars about them are the ones 'causing friction'."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Mar 04, 2009", "message": "Thanks for the clarification.  I am not sure which event takes the cake for making me sad and gleeful at the same time - this trainwreck or the one about all the hitpoints being lost when jeff investigated unusual voting habits...\n\nIn any case, it looks like the \"official\" editing rules are out of whack with the ones in practice.\n\nMe, I don;t have time to sit and edit 100s of questions.  \n\nTime to get back to work"}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@Brian:\n\n\"I agree and this makes sense for the reason your pointed out. Voting has a limit and in the same way so should the number of edits one person is allowed per day. This will also allow others who want to edit but are always a bit too late, diversifying the edits.\"\n\nIf you start limiting the amount of editing users can do, suddenly you're going to find that those who actually spend their time editing and cleaning up the website won't be able to fix all the posts that end up looking like absolute garbage. I have editing capability now, but I'm not going to spend my time editing a whole lot of posts at the same rate someone like Gortok or RichB might. Expecting the rest of the community to \"pick up the slack\" once you bench your primary editors is asking for a lot of garbage to skip over the best filter you have."}, {"author_name": "Roj", "gravatar_hash": "22f29d8ccc491817dd1200619ae68aee", "author_url": null, "date": "Mar 04, 2009", "message": "It takes two to friction."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@Roj: Very simple and to the point. I applaud you."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 04, 2009", "message": "TheTXI is correct: I base my edits on what other high rep users (Simulcal and Jeff Atwood, to name two) do.  None of my edits are 'cowboy' edits; and I generally only retain tags from deletion that are used by other users.  You're more than welcome to follow me around and question every edit I make, and I'd be happy to defend them; but I'm sure you have better things to do with your time. As evidence: http://stackoverflow.com/revisions/606365/list . Among many, many others. You can follow that discussion here: http://stackoverflow.uservoice.com/pages/general/suggestions/132962-impose-cool-down-when-a-rollback-war-erupts"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Mar 04, 2009", "message": "If you're going to base your edits on what Jeff does then take a look at this recent edit where he moves a salutation without removing it: http://stackoverflow.com/revisions/589689/list"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@RichB: That's the problem: \"[You] would argue\". It honestly looks as if you achieved enough rep to edit, then made it your personal mission to bring StackOverflow to the standard of RichB.\n\nAnd, yes, while it does indeed take two objects to cause friction, only one has to do the rubbing."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@toast: As it has been explained here and elsewhere, nowhere am I using a 'personal standard'. \n\nDon't just keep spouting the same tired, useless argument with no evidence."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@toast:\n\nHe accumulated well more than enough rep to just go about editing posts. \n\nAlso, I don't think it is really any of your business how Rich B decides to use the site. If he feels that he could better serve the community through editing the garbage that gets fed into the SO hopper instead of answering questions, that's entirely his choice."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "I actually thought it was pretty nice and decent of me to not just be a rep whore and to stay where I am comfortable and dedicate my time to improving the signal and reducing the noise on the site."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@RichB: I don't really care if you've adopted an arbitrary standard (but even still, if you have adopted it, it more than likely conforms to what you find acceptable), my problem is that you are treating it like a mission from the divine.\n\nWhen your only edit involves removing \"Hey\" and \"Thanks\" from a question, you've added nothing to the question, made nothing clearer, and just waggled your edit stick, to waggle your edit stick.\n\nFor example, it took 16 edits before someone even touched the title of the question, which was pretty awkward. The first 15 were all about the inclusion of about 10 characters. The next 15 were also all about the same characters.\n\nThat is when you should just back away, let them have their salutation, and be the bigger person.\nhttp://stackoverflow.com/revisions/608034/list"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "While I am here, I will direct you all to a user who is rolling back and arguing with edits just to be difficult. \n\nhttp://stackoverflow.com/questions/611433/weird-issue-comparing-object-instances-on-iis-7\n\nMake sure you check the edit history regarding my edits before believing his words over mine though."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@RichB:\nBTW, love how you correct the spelling in his code sample. How could you know.\nhttp://stackoverflow.com/revisions/611003/list"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@Toast: Your argument basically adds up to: \"Who made you the one to follow standard?\" and you seem to argue against said standard. Who made you the community liaison to argue /against/ that standard?\n\nIrony is a wonderful thing. \n\nUnless you have something to actually say where I somehow abused anyone, I am not going to continue this argument with you, it is not fair to other readers."}, {"author_name": "M.", "gravatar_hash": "264f4763794955ff0dd44841b858215b", "author_url": null, "date": "Mar 04, 2009", "message": "@RichB: Regarding your example, Jeff was very direct with this specific point: \"However, if the author of the post is resistant to your editing changes, even a perfectly legitimate edit based on the above rules, be the bigger man (or woman) and let them have it their way\"\n\n\nStupid edit wars like this lower the quality of this site a lot more than the occasional \"Hey\" or \"Thanks\".  It makes it looks like the site is populated with childish martinets who must have their way.  The way things look to be heading, this will just be another pointless website filled with a bunch of trolls rather than actually helping people get the answers they're looking for."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@Toast: \n\nHe corrected a spelling mistake in someone's answer. A spelling mistake in actual code which would have made the answer wrong. Did you bother to look at the original question or even all of the other answers there to see that it was supposed to be view-all and not veiew-all?"}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@M: \n\nIt can be said there are childish a-holes on both sides of the argument. The editors can tend to be childish and overreact when the original poster continues to roll-back to their non-modified form, but on the same token it can be just as childish for someone to get offended and throw a tantrum when someone comes and edits their post for the better (and thereby giving them a bump back up to the top of the page, more exposure, and higher chance of getting an answer or rep).\n\nI don't understand why we need to be operating as a community which coddles and rewards someone for throwing a tantrum so that they can get their way. When I threw a tantrum, it sure as hell didn't work on my parents. If they want to act like a child, treat them like one (and not by giving in to their screaming)."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 04, 2009", "message": "I hate having this argument in three places, but for those of you that are against removing salutations, remember:\n\nIf you look at a post on the front page, it shows the title and a few lines (I think 2-3) of the post.  If 'Hi' or \"Could you please help me with this problem I'm having\" is one of those lines, and you have a poorly written title (which is the norm, it seems), then a potential helper may skip over your post.  If, on the other hand, someone takes the time to make it better, you win twice: 1) Your post gets pushed back to the front page, and 2) It gets more chances for upvotes.  \n\nIt's what the suits call a 'Win/Win'; but never let reason get in the way of a good ideological fight about 'mine' and 'yours'."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@M: I am not arguing for edit wars. They are rather rare and usually happen with users who have been misinformed or are being directly fed with misinformation."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@RichB: I'm not arguing against having a standard, I'm asking you why you feel it necessary to make edits with nothing more than removing spaces from \"one / two\" or removing \"Thanks for the help\".\n\nIs capitalization important? Sure. Is it absolutely vital that all questions properly capitalize all proper nouns and product names in a way that is approved by said product vendors? No. What's next? Proper acknowledgment of trademark on all terms where applicable? Using the vendor approved names? Because vista is just as wrong as Vista when discussing Microsoft Windows Vista &reg;\n\nIs it absolutely necessary for all questions to conform to a question like title? Not really. If people understand what is being asked then \"Determining if a JavaScript variable is empty\" is just as good as \"How to determine if a JavaScript variable is empty?\" Yet you make that edit. And if someone reverts your edit, you swoop in like a hawk and revert the revert. Because damnit, the standard that RichB has decided upon is the final standard.\n\nIt's not standards I have problems with. It's not editing to clean up \"wut r teh codez to maek babby?\". It's the mindless, tedious, dogmatic way in which you force your opinion of what the site should look like upon others. Because even if you base your standard on what other high rep users are doing, it is still your opinion that that is the correct way a question should look. An opinion isn't any more valid just because it comes from Jon Skeet (no offense to Jon Skeet of course)."}, {"author_name": "Code Slave", "gravatar_hash": "0a638176c7349e10fe82e6e65f2b069f", "author_url": null, "date": "Mar 04, 2009", "message": "*sniff* Brimstone!\n\nAnyone wanna' take bets on how long it will be until we get to demonstrate Godwin's Law ( http://en.wikipedia.org/wiki/Godwin%27s_law )?"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "To be fair, and in the interest of full disclosure, the link I posted previously:\n\nhttp://stackoverflow.com/questions/611433/weird-issue-comparing-object-instances-on-iis-7\n\nThe user has admitted fault in the rollback war being accidental. I commend him on that and everything is good now. If only more people could get over their egos and be like him, we would really be moving forward."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "http://stackoverflow.com/questions/611433/weird-issue-comparing-object-instances-on-iis-7\n\nWhat was wrong with the original title? Obviously he wants people to consider why comparing object instances on IIS7 seems to have a weird issue. What does Jeopardifying the title add to that?\n\nOne could almost see it as extra junk taking up valuable title space (the thing I look at the most when deciding to view a question). It seems at odds with your quest to remove any sense of pleasantry from the body of the question."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Mar 04, 2009", "message": "@Code Slave i believe that was achieved on the IRC channel a while back :)"}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@Code Slave:\n\nI think Godwin's Law was invoked like...three weeks ago when the first shouts of \"Topic/Edit NAZI!\" first started to be heard."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@Toast:\n\nWhen the original poster says Rich is right and apologizes, I don't think you have a very firm foothold to jump in and start crying all over again."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Mar 04, 2009", "message": "@toast The argument was about fixing the code which he blamed RichB for but actually Gortok did. The user didn't seem to mind the title change"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@TXI: Painting me as a whiner is not constructive either.\n\nPlus, I was writing my response in the time that Rich posted his addendum, so \"to be fair\", I'm not even bringing it up all over again, but our posts crossed paths.\n\nAlso, doesn't mean the question isn't valid. What is wrong with the original title?"}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@Toast: \n\nWhy does it matter to you what is wrong with the title? All you are doing is trying to collect \"evidence\" of Rich being abusive, even when it is apparent no actual abuse has taken place.\n\nYou've basically declared a jihad against Rich B's supposed holy war."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@TheTXI: Please let him bang his pots and pans until he tires himself out. Arguing with someone who has clearly abandoned logic, reason and common sense is not productive. \n\nI would hope that there is still hope for something good to come out of this discussion."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "I kind of want to know why he's doing what he's doing. I'm not really vested in the title being one way or the other, I'm vested in why it is such a huge deal to RichB.\n\nIf we understand why, we can start to maybe come to a conclusion that works for both the authors who feel wronged and RichB-style editors. So far all RichB and you have shown me is a sort of righteous zeal that you are doing the important work of policing StackOverflow from the unwashed masses.\n\nI would like the rampant useless editing to die down. Maybe edit half as much as he already does, and question whether his edits are necessary a bit more.\n\nhttp://stackoverflow.com/users/5640/rich-b\nEven considering that not even his own questions always follow his chosen guidelines."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@toast:\n\nThose who seem to think it is such a \"huge deal\" as to why Rich does anything he does seems to be in a very sparse minority."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Mar 04, 2009", "message": "@toast \"I would like the rampant useless editing to die down. Maybe edit half as much as he already does, and question whether his edits are necessary a bit more.\"\n\n\"if you aren’t comfortable with the community editing your posts, Stack Overflow may not be the right website for you\"\n\nStates nothing about usability of edits."}, {"author_name": "EpochWolf", "gravatar_hash": "c27f158e95e252c8c9c4eab473f6b60e", "author_url": null, "date": "Mar 04, 2009", "message": "I find it amusing that a block about edit wars spread the edit war into the blog comments."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@Epochwolf: Especially when most of the 'edit wars' are just random people trying to put me on a cross for one edit that is similar to the hundreds of others I do each day. The posts are nothing more than me defending myself against senseless bashing in most cases.\n\nBut that is ok, I do what I think is right, and so far most of these bashers make fools of themselves in public.\n\nI just hope as we continue into the future we can zero in more on the real problems in these situations."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Mar 04, 2009", "message": "Hi, \n\nIt is apparent to me that RichB  (and possibly others)\n\n1. needs a haircut (or at least his avatar does)\n2. likes to find fault (note his upvote/downvote)\n3. Loves to edit\n4. Has plenty of free time to engage in editing and online sparring\n\nI find all the editing odd, but if that's what floats his boat, be my guest.\n\n"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@tim: I will give you an example and you can tell me what you would have preferred I do, since you have engaged in this sparring for seemingly no reason at various times.\n\nhttp://stackoverflow.com/questions/611824/\n\nWas my edit a good thing or a bad thing? Would you rather I let it be voted off the site?"}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": null, "date": "Mar 04, 2009", "message": "My thoughts on the subject:\n\nFor wiki questions, I don't think the author has much (if any) right to complain about edits. Therefore, I'll just go ahead and fix anything I see wrong.\n\nFor non-wiki questions, I will edit a post only if \n a. there are obvious typos or syntax errors,\n b. the formatting needs to be improved, or\n c. the question needs to be reworded or retagged.\n\nIf the post was made less than five minutes ago, I'll wait to see if they catch things before I do it myself. And if it's a question that hasn't had activity for some time, it takes quite a bit more to get me to edit it.\n\nIf I am already editing a post for one of these reasons, I will generally go ahead and take out any greeting/salutation at the beginning. Similarly, if it's not too awkward, I'll try to make the title into a question (and perhaps shorten it if it's two lines). I rarely remove a \"Thanks\" at the end unless it's long and apologetic -- if they want to be polite, and it's not going to make less information visible on the questions page, why should I stop them? -- but I will remove a signature.\n\nI do not think that any of these minor quibbles is reason enough for me to edit the post (unless it's mine, of course).\n\nIf the poster reverts my edits, I'll let the subject drop (as Jeff mentioned in this post). At least I think I would. But strangely enough, no one has ever reverted my edits."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": null, "date": "Mar 04, 2009", "message": "Another point brought up in the comments: \"Expecting the rest of the community to 'pick up the slack' once you bench your primary editors is asking for a lot of garbage to skip over the best filter you have.\"\n\nI don't know about other parts of SO, but the only reason I don't edit more \"java\" questions is that Rich B gets to them first (especially if my lunch is in one hand). I'm sure there are people like me who stay in a particular tag, and others (besides Rich B) who stay on the main page. It's true that Rich B is often the first to get to a new question, but that doesn't mean no one else would have edited it.\n\nI don't think edit limits are a good idea, though, unless they're set pretty high (like maybe 100)."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Mar 04, 2009", "message": "@RichB\n\nIt really doesn't bother me (or excite me) one way or the other - I am just commenting on what I see.  You are free to do whatever you choose.  The only thing that raised my eyebrow was the removal of personal greetings, thanks, etc.\n\nFor some reason I ran with that.  \n\nI had one bad experience with an edit or two that changed the meaning of a question, but in general the edits I see usually add value.\n\nhappy overflowing."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": null, "date": "Mar 04, 2009", "message": "I'll also second JaredPar's request to be able to flag a comment as offensive. One particular user has been making a habit of spouting obscenities, and the best we can do right now is ignore him. But he hasn't gone away."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "On the flipside\nhttp://stackoverflow.com/revisions/611932/list\n\nWas this edit necessary? Cherry picking examples is fun.\n\nNot to mention, you accuse other people of doing the exact things you are. You've ridiculed me, turned my arguments into strawmen, declared yourself victor without actually addressing my questions, and tried to paint yourself as the victim.\n\nAt every point in this debate you have chosen to focus on your opponents and ignore the questions posed to you. At most, I have called you overzealous. But mostly I have been questioning your actions.\n\nAnd so far, I have yet to receive a response."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "BTW, humor:\nhttp://stackoverflow.com/questions/603374/why-does-visual-studio-2008-crash\n\nMy ironic remark calls forth the man himself."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 04, 2009", "message": "<blockquote>\nIf I am already editing a post for one of these reasons, I will generally go ahead and take out any greeting/salutation at the beginning. Similarly, if it’s not too awkward, I’ll try to make the title into a question (and perhaps shorten it if it’s two lines). I rarely remove a “Thanks” at the end unless it’s long and apologetic — if they want to be polite, and it’s not going to make less information visible on the questions page, why should I stop them? — but I will remove a signature.\n\nI do not think that any of these minor quibbles is reason enough for me to edit the post (unless it’s mine, of course).\n</blockquote>\n\nI agree with this. The salutation *alone* is not a good reason to edit the post -- however, if you are already editing to improve the title, correct spelling, etc, then removing salutations is a perfectly legitimate edit.\n\nI know I've done this [removed salutations] many times. But I would draw the line at editing solely to remove salutations, unless they're unusually excessive."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@Jeff: I feel I have to clarify something though. The beginning salutations at the top of posts are removed for a valid reason, they take up valuable space in the question previews on the question lists. The more that shows more of the question in the preview, the better the attention and signal to the question.\n\nI don't think I have ever edited to remove something like this in a question that wasn't a) pointed out to me or b) seen from the question list.\n\nAlso, usually Hi, Hey, Hello, Thanks, Bye are used by non-english speakers who need other help on their questions. So it is safe to 'target' those questions. Usually the salutation in the question preview is an indicator that more will needed editing than meets the eye."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "I think the two biggest tells in this case are your Upvote/Downvote ratio and your recent activity list.\n\nYou aren't asking/answering questions. You are policing the site, having appointed yourself Judge Judy Executioner."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Mar 04, 2009", "message": "\"Judge Judy Executioner\"\n\nThanks.  I am glad I was not drinking when I read that Homer quote."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@Toast:\n\nThis was said before...who are you to tell Rich B how he should be using the website? If he feels that he can better serve the community by editing posts so that they are overall better, that is his prerogative. Are you some how saying that unless you maintain a certain X/Y ration on StackOverflow you are somehow doing it wrong?"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Mar 04, 2009", "message": "@toast To be fair - editing questions does have value."}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Mar 04, 2009", "message": "First of all, I want to apologize to anyone I may have offended in the past week. I don't know why I let myself get drawn into these edit wars. I am sorry and it won't happen again.\n\nRich, I'm amazed that even after Jeff has said:\n\n\"I would draw the line at editing solely to remove salutations, unless they’re unusually excessive.\"\n\nYou still stand by your standards and argue with him. We all understand your point about salutations being on the homepage; however, perhaps you should add a comment to the question politely asking the user to remove them.\n\nFinally, I really don't mind have a debate with you on the web but what I do object have my website attacked by StackOverflow users because you have an agenda. Not cool.\n\nJeff, keep up the good work. I hope you can forgive my sins.\n\nStephen"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@TXI: The site is for asking and answering questions, yes?\n\nAnd I said his up/down ratio is a tell. And it is, it is indicative of a certain type of behavior. Now, there could be some good reasons for 1:2 up/down ratio.\n\nStackOverflow does have a purpose, it is directed towards a very specific goal. In the context of that goal, is Rich B actually serving the community? Because you seem to be taking that for granted.\n\n@tim: Yes, editing questions does have value. However it is not the only thing that has value and editing for the sake of making a question out of a title or removing a greeting has far far less."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@GK:\n\n1) I am allowed to debate things with Jeff. Jeff is calm, reasonable person who likes to engage with reasoning and common sense. His word is not law, as he points out many times in the FAQ, and he encourages constructive criticism.\n\n2) I certainly hope you are not accusing me of 'attacking' your site or being connected in any way. If I did something like that (I didn't) I would put it all over your site that I did it, and you would know it. But I wouldn't do that, nor would I endorse it. I can tell you though that you have pissed a lot of people off with you behavior in purposely rolling back valid edits and trolling the site. So I don't think you can really hold anyone accountable any more than yourself.\n\n3) I look forward to you working with us or staying out of editing affairs altogether. Stackoverflow is a great place, I hope it stays that way."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 04, 2009", "message": "There are no rules, only guidelines that are subject to interpretation.\n\nI'd say the only \"rule\" that makes sense, is not creating a disturbance on the site that spills over to the average user. And if I'm getting multiple emails about it, that's not good, either."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 04, 2009", "message": "@Gatekiller: \"Finally, I really don’t mind have a debate with you on the web but what I do object have my website attacked by StackOverflow users because you have an agenda. Not cool.\" &lt;-- Who 'attacked' your website?"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "What's funny is that in the middle of this Rich B hasn't stopped editing out salutations and Jeopardifying titles.\n\nAlso:\n\"@Muerte: Appealing to common practice is a logical fallacy – Rich B (47 mins ago)\"\n\nExcept when common practice validates your opinion?"}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Mar 04, 2009", "message": "@George,\n\nTBO honest, I have no idea. Perhaps it was wrong of me to say SO users but it started very late last night until several minutes ago when I noticed the homepage had been accessed over 24,000 times from the same two IP addresses:\n\n208.49.187.229 and 209.149.62.101\n\nHowever, It could simple be coincidence. I guess only the SO Team would be able to confirm this.\n\nSte"}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 04, 2009", "message": "Good luck with finding out who it was. FWIW, I live in NC. :-)"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "And I live in CT. The IPs are out of GA and FL if it helps."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "It's much more likely your website got hammered by bots/spiders due to having the link on your user profile and other detectable areas."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@TheTXI: Bots and spiders? SOUNDS TERRIFYING."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "I have arachnophobia and a sarah connor complex."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "Easy way to rate limit edits: Make it cost 1 point per character changed."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@Toast:\n\nYou have taken the plunge into sheer idiocy now."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://cznp.com/", "date": "Mar 04, 2009", "message": "@toast You must be joking."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "What is wrong with that suggestion?\n\nBy making the edit cost we exert a pressure upon the editor to consider their actions. Is it worth it to change a period to a question mark? Is it worth it to slightly modify a title to look like a question?\n\nAnd if they do think it is and they do nothing but editing for days on end, eventually they will have to stop because they will go under the rep needed to edit.\n\nThen they must start asking and answering questions and participating more fully in the site rather than become known as Rich B is known.\n\nBTW, love the attacks minus actual discourse. It makes you that much more convincing."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 04, 2009", "message": "@toast: Ah yes, penalize people for making a question better. How about this question, should I have been penalized for making it better? http://stackoverflow.com/revisions/612229/list"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://cznp.com/", "date": "Mar 04, 2009", "message": "@toast Are you suggesting that for a helpful action (not all edits are negative as you might suggest), that user will lose some of his reputation, the points he gets for being helpful in answers and questions?"}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "You will make it more expensive to edit posts which obviously need it (i.e. needs more than just minor edits). Those that don't need much editing at all theoretically (the salutations, etc.) won't take hardly any rep at all.\n\nYour logic is backwards. And I won't apologize for saying you are stepping off the gangplank into the Stupid Sea when you make the mods (more specifically your jihadist man-crush on Rich B) to a level more extreme than I could have first imagined."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Mar 04, 2009", "message": "Wow, not only is editing almost totally thankless (at least there's a badge), but now you want it to cost reputation as well?  The majority of edits improve the site.  Clarifying a question or fixing the grammar should not cost reputation.  That would actively obstruct all kinds edits.  Not the best solution.\n\nPersonally, I think that if you make an edit to someone's question and they roll it back you should just leave it.  Their question may go unanswered because it lacks clarity, but at least you tried to help them."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "Really. In light of crap like this. If there was some sort of cost to editing, do you think this would go on.\nhttp://stackoverflow.com/revisions/612258/list\n\nThey are arguing over a letter. Editing, reverting, editing the reverts.\n\nEach question, each answer, each upvote, each downvote, each edit has a very real cost for the servers hosting the site. We are literally filling the database with garbage because stuff doesn't look like we like it. The comments go back and forth about proper this and proper that. More edits, more reverts.\n\nThe prolific useless editing is proof enough that there needs to be some sort of limiting factor on it. And why not rep? It is the currency of StackOverflow."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@Jeff: Please make this blog a CW question. We can take care of it for you from there.\n\nThanks,\nThe Great Edit Nazi"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Mar 04, 2009", "message": "Good questions and answers are the currency on Stack Overflow.  Don't limit people's ability to improve them."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 04, 2009", "message": "Rich B: I'd upvote your comment if I could."}, {"author_name": "t00lkit", "gravatar_hash": "86c2fc4bb34d85ec8174f67fd21f256c", "author_url": null, "date": "Mar 04, 2009", "message": "Couldn't edit Rich B's comment to remove the salutation! Damn!"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@Bill: How would it limit actual improvements? Most of these edits improve nothing about the question. Since editing is free, people do it without thinking.\n\nAnd if you are asking good questions and giving good answers, rep shouldn't be a problem anyway. Although waiving the cost in the case of self-edit is probably a good idea."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@toast:\n\nYou are incredibly ignorant if you believe that the majority of the edits don't serve a positive function for the site and community as a whole."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://cznp.com/", "date": "Mar 04, 2009", "message": "@toast: Since editing is free, people do it without thinking.\n\nIt's just incredible how wrong that actually is.\n\nWriting a good question (or answer) is very very hard and more often than not can be improved in some way.\n\nYou keep looking at the negative side of editing instead of how it can and does benefit many questions."}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Mar 04, 2009", "message": "@Toast,\n\nI think throttling edit/rollbacks is the best method. In the same way comment replies are throttled to 1 comment per minute."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "http://stackoverflow.com/revisions/612468/list\n\nSuper Effective!\n\nRemoved a couple of characters that would've shown in the byline. Removed a sentence at the end. No attempt to actually help the person.\n\nNo, those bits weren't necessary to the question, but they weren't exactly detrimental either. The actual question was left in tact, not even the title drawing the ire of Rich B.\n\nWhat positive function does that edit serve? And seeing as how that is the bulk of Rich B's edits, what would be lost from the temporary removal of Rich B's editorial capacity?"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@Olafur: I'm not basing my words on an ideal, but actual usage."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Mar 04, 2009", "message": "@toast: If editing costs reputation, then I'm assuming you mean to make it cost rep for all (non-self) edits.  I think the vast majority of these edits are improvements, with only a very few that degenerate into edit wars.  Making someone pay (in any currency) to try and improve someone else's question will only dissuade them from it.\n\nThe system can obviously count rollbacks (as we've seen), so maybe it should start charging rep on the 3rd (or other arbitrarily chosen) rollback per question?"}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 04, 2009", "message": "@toast: I'm starting to doubt the altruistic part of me that says you're just trying to have a discussion, and not trolling.  After reading your blog, however, I get the distinct impression that you aren't interested in discussion."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://cznp.com/", "date": "Mar 04, 2009", "message": "@toast Again you look at the negative side of editing. \n\nhttp://stackoverflow.com/revisions/609965/list\n\nSo should i get a -50 rep for this edit?"}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 04, 2009", "message": "FWIW, anyone who wants to join the regular Stack Overflow crowd (and features such celebrities as Rich B) feel free to join us on irc.freenode.net #stackoverflow ."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@George:\n\nYou forgot to mention the ponies."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@Gortok: Wonderful. Like I need more of my fan club in real time.\n\nI spend enough time trying to avoid these little man crushes."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@George: I haven't implemented commenting, true. Ya got me. Or to be honest, I haven't fully implemented it. It looks like I have comments, but I don't. My personal projects have managed to fall way to wayside since starting my current job.\n\n@Olafur: First, would it matter that much to you if you did? Is the point of the site reputation, or getting answers to your questions?\n\nLastly, maybe 1 rep per character change is excessive. Maybe instead it could have a larger ratio like 1 rep for every 5 characters, or you get so many characters for free every day, then it begins to cost.\n\nThere is a balance to be struck here. It doesn't have to be all one way or the other."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "It's become quite apparent that there is an imbalance going on, but it's not with StackOverflow or RichB."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@TXI: Thank you for contributing to the discussion in a meaningful and constructive way."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "I would have thought for sure the pots and pans would have been banged into non-existence by now. \n\nI guess he must be wearing the large pot on his head so he cannot hear anyone telling him to 'knock it off'."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://cznp.com/", "date": "Mar 04, 2009", "message": "@toast\n\nThere is incentive to answer and to ask questions. You get points. For those points you get more privileges. So i partake in helping others in answering questions as best as i can so others will give me those points.\n\nWith out them the community wouldn't be the half of what it is now.\n\nAnd you suggest taking away those incentive points for another form of helping? Just does not make sense."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@Toast:\n\nWhen the discussion becomes a big circle with you in the middle crying Edit Nazi, there comes a point when there is nothing constructive left to add. \n\nYou've devolved to the point where now you want to penalize people for actually cleaning up the website. I'm just waiting for you to start suggesting oldies but goodies such as users voting to suspend/ban/castrate people who they think are being unfair. \n\nEither that or you are going to completely lose it and take your jihad to new levels by performing the SO equivalent of a suicide bombing."}, {"author_name": "Roj", "gravatar_hash": "22f29d8ccc491817dd1200619ae68aee", "author_url": null, "date": "Mar 04, 2009", "message": "@Olafur Waage: Downvoting is a form of helping, yet you lose points for doing so."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@Roj: Downvoting lowers another user's rep as well. Editing a post will not affect rep one way or another."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@Olafur: True. And I do enjoy the \"ding\" when I come to the site and see that I have rewarded for providing a good answer or asking a good question.\n\nBut getting that number to climb isn't the reason for the site. And I'm not just grabbing onto this idea because of the edits. There has been some discussion on the podcast about rep inflation and ways to prevent everyone from having ridiculous amounts of rep. I think this could be an area which serves to limit rep in some fashion.\n\nYou already spend rep points for bounties (a contested issue itself), downvoting, and a few other activities. What makes editing special?"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@TheTXI: Actually, in most cases, it significantly /raises/ their rep."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 04, 2009", "message": "@RichB: Now you're just being blasphemous."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@Rich B: I highly doubt that the difference between a low vote and a high vote is the removal of the word \"Hello\"."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://cznp.com/", "date": "Mar 04, 2009", "message": "@toast controlling how much rep is gained for upvotes, accepted answers and bounty is all possible. \n\nBut don't suggest adding a negative aspect to an helpful act.\n\nYou get -1 for down votes due to the fact that you are doing a negative act. Simple as that."}, {"author_name": "Code Slave", "gravatar_hash": "0a638176c7349e10fe82e6e65f2b069f", "author_url": null, "date": "Mar 04, 2009", "message": "@TheTXI,\n\nFor a second there, I thought we might have demonstrate Godwin's Law. Don't tease me like that :-)\n\n&gt; the SO equivalent of a suicide bombing.\n\nWould that be what the Aussie did last Sunday?"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "But as we have seen with actual usage, editing in and of itself is not a positive act. Neither is it a negative act. The act itself is neutral. When people edit to make sentences out of stream of conscience rambling, that is a good edit. When people simply trawl the site to remove salutations, that is not a good edit.\n\nTechnically, downvoting is not a negative act either. It is a way to suppress bad questions (bad in that they don't belong) or answers (in that they are blatantly wrong and don't consider the question at all)."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://cznp.com/", "date": "Mar 04, 2009", "message": "@toast\n\nIt's possible to change actions by having clear rules or guidelines, but to change a system because the actions don't fit the desired outcome is a crutch.\n\nAlso suppressing isn't a negative action? That's it, I'm out."}, {"author_name": "Andy", "gravatar_hash": "8f8ff21a67437febebc70afd19364e95", "author_url": null, "date": "Mar 04, 2009", "message": "It seems there's an easy solution.\n\nIf you object to the actions of an editor who is nit-picking over minor salutations or a missing colon then just downvote some of their posts. Eventually their reputation will drop to the point they can no longer edit.\n\nFor example, 700 downvotes (which isn't a lot) would remove editing privileges for Rich B.\n\nhttp://stackoverflow.com/users/5640?sort=reputationhistory#sort-top"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@Olafur: Rules don't change actions, consequences do. \n\nExample: Telling people to \"be nice\" is all well and good, but without the consequence of being downvoted to oblivion for being a jerk, I doubt the rule would hold.\n\nSuppression isn't an inherently negative thing either. You want to suppress bad behaviors. This is a positive thing.\n\nIt's exactly how Rich B is defending his upvote to downvote ratio, but saying all of his downvotes improve the site and cause a positive outcome. By your current logic, Rich B is a negative user since he has engaged in more negative behavior than positive (based on voting alone)."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 04, 2009", "message": "@Andy: Despite what Rich B + posse believe, I don't have a grudge against the guy. While I could sit there and randomly downvote his questions and answers until his rep dipped below editorial status, I wouldn't get that far because (in order of relevance):\n\nA) It's juvenile and would validate all of the things they have said about me here (and on the IRC channel) (way to attack me where I can't respond guys)).\nB) I don't like Rich B's useless edits, this says nothing about the quality of the answers and questions he has submitted before becoming High Lord Editor Supreme of StackOverflow.\nC) It would more than likely cause a backlash swing of upvotes for all of those same question/answers resulting in a net gain for him.\nD) It would also probably cause a retaliatory strike against me and as there are more in Rich B's posse than me, I would lose voting privileges rather quickly.\nE) It's douchebag tactics and would probably get me banned from the site."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Mar 04, 2009", "message": "On the topic of editing (and having skipped most of the fairly predictable comments), I think it takes a lot of chutzpa to edit Stack Overflow questions.  (Not the formatting, obviously, but the content itself.)  The trouble is sometimes the edits invalidate some of the answers and make them look wrong or stupid.  For instance, if there's a bit of code and you fix an \"obvious\" bug in an edit, the poor guy who addressed the bug in an answer looks like a trouble-maker.  Even worse, it can make the questioner look like a dolt for asking a non-question.\n\nI don't have a solution, but I sometimes wish there was a method for giving feedback on specific edits.  Currently, the best location is comments on the post itself, which tend to become confused quickly.  Perhaps voting on edits would help.  If nothing else, it might allow good editors to get a bit of reputation for making the site a better place."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 04, 2009", "message": "@Andy: Feel free, if this is what users would like to do, that is their prerogative. \n\nIt certainly wouldn't be the first (or the last) time. \n\nAnd besides, watching my rep get refunded and you banned due to the anti-gaming measures would be entertaining.\n\nSeriously, grow up."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Mar 04, 2009", "message": "@Jeff Atwood:\n\n&gt; The salutation *alone* is not a good reason to edit the post — however, if you are already editing to improve the title, correct spelling, etc, then removing salutations is a perfectly legitimate edit.\n\nThat sounds familiar: \n\nGreat minds think alike, I guess. ;-)"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://stackoverflow.com/questions/539451/are-you-compelled-to-eliminate-syntactic-cruft/539471#539471", "date": "Mar 04, 2009", "message": "Sigh.  My link got deleted.  The Stack Overflow blog != Stack Overflow.  See my \"Website\" in this comment."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 04, 2009", "message": "One of the reasons I've pretty much given up on SO is because (amongst other things) of morons like RichB and the pointless edits (where in the faq's does it mention you can't have polite pre- and post-amble in a question). \n\nRichB doesn't contribute anything of value to the site, check his activity history, he doesn't really answer any questions and has spent more time voting down questions than up. I can only conclude that SO is some kind of penis enhancement for him or peculiar power trip to make up for some other inadequacy in his life other than the size of his manhood. Add to that he's an insulting, condescending and arrogant little prick in the way he handles himself on the site, he has all the diplomatic skills of a steaming turd.\n\nSO started out good then the trolls and control freaks arrived.\n\nIt's just a fucking forum guys and you forget that it's a business for Jeff et al to make money out of all your *free* contributions, what do you get back for all the edit-war agro other than wasting hours of your life rolling back comments/edits because they don't fit your outlook on life - which RichB and his irrational-edit-gang clearly don't have.\n\nAnyway that's all I have to say on the matter and I really couldn't care less if my colourful language has me banned from SO or this blog forever, it was fun while it lasted but I have a real life unlike the RichB's of this world."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Mar 04, 2009", "message": "The comments here make me sad. \n\nI've spent plenty of time over the years in programming forums, message boards, newsgroups...\n\nTime enough to see how the same questions get asked over and over again, until even the most dedicated give up answering them.\n\nTime enough to see the knowledgeable driven out before the vast hordes of lazy and rude. \n\nI've seen FAQs and etiquette guidelines drawn up and posted full of hope and naive optimism, metaphorical arms opened wide to the world of newbies outside... only to be trampled, abused, kicked aside to gather dust. \n\nAnd i've watched harried moderators dig in and refuse to allow anything even slightly blemished to pass by, as decay set in behind them.\n\nSO should have been so much more than this. When Atwood first wrote about this strange chimera, part forum part wiki, i was excited... a collaborative site where individual contributions are recognized but do not dominate? Brilliant! A system where the thousand little cuts born of laziness and trolling can be healed rather than decried... could such a thing be realized?\n\nPerhaps not. Hurt pride tirelessly seeks vengeance. It may be that a site such as SO, stroking egos even as it provides the tools which will inevitably bruise them, is nothing but a powder-keg, containing within the seeds of its own destruction. \n\nI'd like to hope for better. But when users such as Andrew cry out for editors to be constrained rather than restrained, given shoddy tools instead of guidance... How long can it be before we see this strange creation neutered and shackled, a sad little footnote in the history of the 'Net..."}, {"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Mar 05, 2009", "message": "When SO started I think people had that new car mindset where they didn't want to scratch the paint, or spill anything on the carpet.  But then as time inevitably went one, there was a small spill or a small ding then as there started to be more and more of these dings you started to care less about weather it happened again.\n\nNow, people are just comfortable saying whatever on the site, back in the private beta, and for a short while afterwards even basic questions received quality answers, and the overall system seemed to be working well, now if a question that someone sees as to easy is asked the first responses are invariably \"RTFM\", this trend has been fairly consistent and shows no signs of stopping.\n\nWeather or not the edit wars are the cause of this I don't know but I know that personally I've gone back to spending more times on the forums then I have on SO, for the simple fact that I can't stand when someone is rude, to someone looking for some help.  Oh, and I'm tired of \"use jQuery\" as the defacto answer or every JS question."}, {"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Mar 05, 2009", "message": "Sorry for the Car analogy I just came from /."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 05, 2009", "message": "> It’s just a fucking forum guys \n\n\"Fear leads to anger; anger leads to hate; hate leads to suffering.\"\n\n> Oh, and I’m tired of “use jQuery” as the defacto answer or every JS question.\n\nyes, but jQuery is awesome. Resistance to jQuery is like resistance to.. awesomeness. What's <i>that</i> about?\n\n> What makes editing special?\n\nEditing is the backbone of the site, and probably (along with rep) one of the single most important distinctions between SO and \"just another forum\". You might as well ask what's so special about editing on Wikipedia? Uh.. everything?\n\n> but to change a system because the actions don’t fit the desired outcome is a crutch.\n\nWe will have an automatic \"cooldown period\" on posts with too much editing. This is coming.\n\n"}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Arron: I agree, and I constantly have arguments with people who do this 'RTFM' or 'GIYF' stuff in their posts. \n\nOne such 'roll back war' was exactly this. An individual decided to make a very condescending post telling a question asker he should google first and then answering the question. \n\nSolution? Edit his answer to remove the GIYF part and only include the answer. This post ended up needing to be locked because of the constant rollbacks by the user and other moderators (believe it or not, I am not the only one with my opinion, and I consult the other mods when I feel I could be wrong). The user displayed foul language and ridiculous grand standing as well causing far more of a scene than was required.\n\nDo I regret this? Yes. But should we allow this type of behavior on our site? I don't think so. We don't need another Q&amp;A site where new people are told to RTFM and GIYF and discouraged from participating.\n\nOh well, hopefully these things will work themselves out."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Kev: Thank you for doing far more than I ever could to discredit you and your accusations (if I would have even bothered).\n\nI have never used this kind of language on the site or abused a member like you are abusing this audience.\n\nWhatever your differences are with someone, I invite you to handle them like an adult instead of spreading vile language on someone's blog."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@Jeff: It's not the posts, it's the people. Throwing a timer on the posts turns it into another fastest gun in the west problem. The person with the first edit will probably win.\n\nPlus in the case of edit warring, it'll just lock a random version of the page for the period time. Since this site is based upon Wikipedia, here are some articles I think are relevant.\n\nhttp://en.wikipedia.org/wiki/Wikipedia:Editing_policy#Perfection_is_not_required\nhttp://en.wikipedia.org/wiki/Wikipedia:Please_do_not_bite_the_newcomers\nhttp://en.wikipedia.org/wiki/Wikipedia:Wikilawyering\nhttp://en.wikipedia.org/wiki/Wikipedia:Gaming_the_system\nhttp://en.wikipedia.org/wiki/Wikipedia:Policy_shopping"}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "@Rich aka The Great Edit Nazi:\n\nApparently your use of the downvote more than the upvote is indicative of you being a bad person. You should not down vote so much, or even at all, because it is very mean. Forget the fact that you have been given the ability to down vote just like everyone else has.\n\nPlease do the community a favor and act exactly like us and have a Up/Down ratio in the positive numbers. We all understand that it does take rep to cast down votes and that's your choice, but we don't want you to have that choice. We want you to be like all of us who are more often than not too concerned about our reputation to spend a point downvoting something which deserves it. \n\nPlease, see the light. Do what we do. Join the collective. Groupthink isn't so bad once you're in the group. We know you'll come around.\n\nYours Truly,\nYour concerned friends at StackOverflow.com\n\nP.S.\n\nPlease use your maximum number of votes to upvote as many of us possible. It is not fair that downvoting has an affect on our reputation."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "So, we've moved on to debate tactic #42: bizarre absolutes?\n\nCertain patterns can indicate certain behaviors. As with everything, you have to consider the whole. And considering his voting distribution and editing \"style\", I'd have to say that Rich B isn't really adding much to the site.\n\nAt least not anymore. Clearly there was a point in time when Rich B cared enough to at least answer some questions."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "@toast:\n\n\"Rich B doesn't use the site the same way I use the site, therefore he is doing it wrong. I am now going to spend a lot of time complaining about it.\"\n\nTFTFY"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@TXI: You do realize that condones just about any behavior."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "If a user has X amount of votes that he or she can use in a day, I do not see how using all those votes for upvoting has any better effect on the community than downvoting everything. \n\nI can just as easily waste all of my votes upvoting the most retarded answers possible and that would not be doing the community a service. In fact it would have less punishment applied to it since upvoting doesn't even require rep.\n\nRich has the ability to downvote just like everyone else and he willingly takes the -1 loss of rep every time he downvotes something. You trying to come in like some holier-than-thou crybaby and say he's doing it wrong is absurd. RichB operates well within the rules for the site and there has yet to be any real proof or substantive argument (\"Waah he's doing it differently than I want!\" is not substantive) that he is abusive.\n\nRun along Napoleon, your pony's getting away."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@TXI: Never said it was wrong. You keep putting those words in my mouth, but I never said it.\n\nYou keep trying to steer the argument to the issue of downvoting, when the issue is the inane amount of petty, useless editing Rich B engages in.\n\nNow, you can actually discuss this, or you can continue with your attacks."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "@toast:\n\nYou keep steering the argument towards downvoting when you (and others such as Kev) come in here and cry \"LOOK AT HIS RATIO! LOOK AT HIS RATIO!\"\n\nThere isn't anything left to discuss concerning Rich's editing. You're beating a dead pony. Rich (and Gortok, another mod who gets the Nazi label applied to him unfairly) have both been able to justify all of the edits that have been shoved in their face. \n\nAnd you trying to take some sort of high-road about \"attacks\" when all you have done is come in and bitch, cry, complain, and accuse certain editors of being mean people who are abusing the system is just as much of an attack on their character as me calling you a big baby with a grudge."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@TXI: I haven't called him mean. I've called his actions useless. And the only justifications I've heard so far are: \"It's not useless\", \"You're mean\".\n\nDeclaring the opposite is not making an argument, it's stating your position. And calling me mean doesn't mean I'm wrong, just that I'm a jackass in the way I handle it (which I don't think I've been abusive, so that's another thing entirely).\n\nI'm not even saying he's abusing the system. Mainly because there is precious little system to abuse there.\n\nI'm questioning the usefulness of his edits and remarking that his edits are mostly about making himself feel important than any grand mission to clean up the site.\n\nYes, I use his editing patterns and voting history to lend credence to my arguments. His prior actions give insight to current behaviors. However, I'm not calling for his head on a stick, I don't want him banned, I don't want a lot of the things you are ascribing to me. I simply want him to be more conservative in his approach to editing.\n\nThere's nothing wrong with a little casualness in the questions. If someone likes to trail off with elipses rather than a colon (something Rich is actually inconsistent on, sometimes he puts a colon, sometimes he removes the colon entirely), that's a stylistic choice on the part of the original author.\n\nIll formed markdown, fine. Do the solid and correct it for them. Leave a comment letting the author know the proper way to form the markdown for future reference.\nHorrible grammar, mmmaybe: If the original intent of the question is clear, then it is probably ok. However, don't guess in the name of making the site conform. Let the user know his question looks like ass (politely of course) and that he should rephrase it for better results.\n\nYou keep accusing of trying to get Rich to use the site like I want him to, when all of Rich's edits fall in the exact same category: He wants everyone to structure a question the way he likes it. Except he is using his editorial power to force his opinion on people whether they agree or not.\n\nI expect your next attack forthwith."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "@Toast:\n\nStop telling Rich B how to use his moderator abilities. \n\nIf you believe he is abusive, send an email to @Wood or whoever else is in charge of it. \n\nYou keep running around in a circle crying about the same thing over and over, taking the occasional break to make ridiculous \"suggestions\" like punishing those who actually edit posts. \n\nPony."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "@Toast:\n\nNo, I am not calling you a pony. I like ponies way too much to denigrate them in such a fashion."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@TXI: When you go to the store and pay money to receive goods, do you berate the cashier for punishing you for trying to survive?\n\nBecause that's what my suggestion is. About adding a cost to an action that is being used just to be used. Not much different than the bounty system currently in place.\n\nAnd if do seem to keep repeating myself, it is because people like you keep repeating the same mantra \"Stop being mean! Stop calling Rich mean! Don't you tell him how to use the site. He's justified.\"\n\nBut you never provide any real arguments to back up your claims. You just keep repeating them and claim the noise as proof.\n\nSee prior post as to what I'm actual asking."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 05, 2009", "message": "@toast: Without getting sucked in to the arguments you're making (this is not the place for that, but if you care to join and debate it on irc.freenode.net #stackoverflow , we'd be glad to have you); recognize that the singular difference between SO and other 'forums' is that posts can be prettified, and made to look better.  One result of this is that it's easier for Googler's to 1) Figure out what the heck the question poster was asking 2) get the answer they need.\n\nAs far as correcting grammar and formatting, it's absolutely useful: What's easier to read, This? http://social.msdn.microsoft.com/forums/en-US/wpf/thread/731a7691-9ebc-4d29-b4c4-49902d717506 Or this? http://stackoverflow.com/questions/583689/dictionaryt-of-listt-and-listviews-in-asp-net  They both ask the same question, remember.  Granted, that's my own question so I made sure it was easy to read, but I do the same thing for other questions when they need it. You call it 'useless', but if it makes it easier for one Google'r to get the information he needs a little faster, it was well worth it."}, {"author_name": "Pesto", "gravatar_hash": "350bd142172dc399ef6928001591544a", "author_url": null, "date": "Mar 05, 2009", "message": "While we're on the subject, what's the deal with the orange envelope?  Clicking on it doesn't give you any idea what's new or different or noteworthy.  It's completely pointless, like Rich B's abusive edits.  No doubt it's part of his plot to ruin SO for everyone.  I propose that we kill him and perform violence upon his lifeless corpse, lest his demon soul get any ideas about resurrecting it as a zombie warrior."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "If you own a store, do you make your janitor pay you for the privilege of cleaning up your floors?\n\nTap-dancing ponies make more sense than that latest spiel."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Gortok: Don't forget the increased attention it is likely to receive from potential answerers and readers. Editing almost always results in more upvotes and increased signal for questions and answers.\n\nNot sure why anyone would continue to bang their pots and pans about this when the site's creators advocate the wiki aspect of the site here, on the site, in the FAQ and on their podcast.\n\nEditing is not the issue, the zealots on their holy war to 'fight the man' are the problem. You can tell because they have yet to find a single edit that was done in an abusive manner that is against the site's TOS or FAQ, r the spirit of the community. They cannot find an edit that caused a person harm. \n\nEvery example posted in the comments here has been a justified edit, and the zealots can only fall back to \"yeah, well I feel it was useless\". \n\nIf the edits/editors are so useless, then what is all the shouting/crying/whining/pot banging about?\n\nI know it is a great feeling to try and stand up against someone you are trying to make into a villain, but when you haven't had a valid example, point or argument in the &gt; 130 comments on a blog post, you would think at some point you would just ride off into the sunset and stop bothering the community with your ego trip.\n\nWhatever though, I am enjoying watching the pot banging and general silliness in the complete lack of logic being displayed by the handful of people making fools of themselves by waging this holy war against editors.\n\nSO is a community site that encourages editing. If you have a problem with it, this is likely not the site for you. Jeff has said, the community has repeated ad infinitum. Maybe it is time to take that advice and move on."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@George: I'm not asking for that to stop. But that is not what Rich is doing for the most part. He claims all his edits are justified, but his justification is that he claims it's justified.\n\nThe only thing I really don't like is when he edits a post to remove \"Hi\", or change \"...\" to \":\" or on the subtleties of the usage of \"and\".\n\nAnd that will be the only change.\n\nAre those edits necessary? No one has tried to defend them. They have defended the concept of editing in general, but have never made a case for the style of edits I'm against.\n\nOut of version 2 and 3 which of these is easier to read:\nhttp://stackoverflow.com/revisions/560329/list\n\nIf you didn't catch it, the only edit Rich made was to remove \"Hi\" from the question. How does that improve the question?"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@Rich: BTW, Jeff also said: \"I agree with this. The salutation *alone* is not a good reason to edit the post\"\n\nBut you continue to not listen to him either."}, {"author_name": "Andrew", "gravatar_hash": "0163290b3bd95a0dfb748d844792765b", "author_url": null, "date": "Mar 05, 2009", "message": "This is the sort of edit that is pissing people off. One utterly pointless change to remove a sad smiley.\n\nThere is absolutely zero justification for this edit, other than it's counter to RichB's fanatical ideological desires for SO purity. \n\nIf I spend 5 minutes writing an answer to someones question, let me put a smiley in it if I want to.\n\nhttp://stackoverflow.com/revisions/609277/list"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Andrew: I find it very humorous that you are upset about something so trivial and seem to think that rolling back an edit like that is somehow of more value than making the edit in the first place. \n\nEspecially when you are well known for rolling back any edits to your posts no matter how valuable they might be.\n\nLet me once again reiterate: \n\\If you aren’t comfortable with the community editing your posts, Stack Overflow may not be the right website for you.\\"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "I must say...\n\nThe troll has a point, and actually makes more sense than most of the rest of the arguments going on here."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "Let me once again reiterate by quoting Jeff:\n\n“I agree with this. The salutation *alone* is not a good reason to edit the post”\n\n\"I’d say the only “rule” that makes sense, is not creating a disturbance on the site that spills over to the average user. And if I’m getting multiple emails about it, that’s not good, either.\"\n\nYou seem to be real eager for people to follow the word of Jeff, except when it conflicts with what you want to do."}, {"author_name": "Andrew", "gravatar_hash": "0163290b3bd95a0dfb748d844792765b", "author_url": null, "date": "Mar 05, 2009", "message": "@Rich \n\nI'm actually not upset at all, if anything I find it a little weird there are people whose spend so much of their lives monitoring a messageboard to remove smileys and \"thanks\" from the posts. I'm sure your life is rich and fulfilling in many other ways though.\n\nYou can constantly reiterate that by posting on SO people must respect the right of the community to edit them all you like. Infact I totally agree. Equally so you must respect that I have the right to edit your edits in a way that I see fit.\n\nThe fact is many of your changes add absolutely nothing to the conversation and are basically just editing for the sake of editing. They're also against the justifications that Jeff posted for an edit, but that's something you conveniently ignore.\n\nAnyhow, feel free to have the last word.\n\n(PS - claiming I'm known for rollingback edits is an extremely disingenuous statement, if not an outright lie. Out of 250 answers/posts I've rolled back around five edits, all of which I felt negatively affected the message or tone that the answer was intended to convey)."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Andrew: Thank you for being so genuinely concerned about my time and how I spend it. I truly appreciate it.\n\nAnd as far as your rollbacks, feel free to justify all the ones you did to this question: http://stackoverflow.com/questions/579651/\n\nThe edits I see looked like they were genuinely beneficial to you and your question.\n\nI am not going to argue these with you, but I have to say I don't understand your position on these edits, and I think your not being honest in saying you don't roll back valid edits."}, {"author_name": "theman_on_vista", "gravatar_hash": "535397b708dc316389dd4041a2797496", "author_url": null, "date": "Mar 05, 2009", "message": "seriously, where is the podcast :-(.. it must still be wednesday"}, {"author_name": "Dillie-O", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Mar 05, 2009", "message": "Hmm, so after all of this, does the whole jist of this discussion boil down to this?\n\nQuestioner Yugi posts a question, and includes \"Sup-a-Dillie-O SO Crew!!\" as the first line of their question.\n\nEditor Kaiba decides to remove the opening line of the question, believing that the salutation has no place in asking a question.\n\nQuestioner Yugi OR Editor Joey rolls back the question to the orginal, feeling that the salutation is harmless and adds a little flair to the question, maybe even in a desperate attempt to get folks to actually read the question since they are desperate.\n\nNow what?! It seems to me that Editor Kaiba, or poentially an Editor Tristan jumping into the situtation should just let this one go and move on to other questions that need editing, such as those questions that forgot to make use of the code tag when posting some sample code.\n\nOr am I missing something here?"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@Rich B: The Strunk and White badge is tongue in cheek, not the holy law of the land.\n\nAnd to be fair to Andrew, there was a lot more Paul Natahen/Rich B flipping than anything else.\n\nI don't see where the edits made a difference in the post. If someone wants a bit of grumpiness in their tone, let them have it. It is a community, not a collection of man pages.\n\nYou are just as guilty as those you accuse of warring and needlessly rolling back edits."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@Dillie-O: That's pretty much my stance on the situation. With the addition of just letting it slide in the first place. If that's the only thing you can find wrong with the post, then there is nothing really wrong with it.\n\nThe byline is pretty large and the characters occupied by \"Hi\" or \"Hello\" never make a difference in whether or not I can understand the post from that blurb.\n\nIf anything they should be paying more attention to titles like \"IIS Problem. Need Help\" than adding question marks and removing salutations."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Dillie-O: You will not find many situations where the case is this simple. You have to dig a lot deeper into the issue than the cherry picking being done here. Most of the example cherry picked here are wrong about not having other edits. Look at the markup(down) in those edits and the titles, etc. \n\nVery rarely do people just remove salutations. But even if that is all they remove, the answer is not to rollback or scream \"Mod abuse\". And I have only seen one standard situation of a salutation being removed and a rollback war being initiated by the OP."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "http://stackoverflow.com/questions/560329/barplot-with-sorted-x-axis\n\nAsked on the 18th, answered on the 21st, first edit by you 13 hours ago.\n\nFor over a week, the question was good enough to get a response. You deleted 12 characters \"Hi,\" and two line breaks (depending on how line breaks are encoded in the database that could be 2, 4, 8, or 10 characters (\\n, \\n\\r, or the line break tag in either HTML or XHTML)).\n\nWhat other edits did you make to that question?\nWhat value did you provide that didn't exist before?\nWhy is it necessary to continuously roll back the roll backs?\n\nOf course, no one is going to answer these questions. I'm going to get more pithy comments about pots and pans or told to shut and let Rich B do whatever he wants."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@RichB: Since you are monitoring anyway\nhttp://stackoverflow.com/questions/613626/how-do-i-display-an-uiimageview-while-a-sound-is-playing\n\nI'll repeat what I said in the comments. The initial dash is part of Objective C's syntax. It denotes an instance method as opposed to a class method (denoted by a +).\nSo if you could just correct the code, that would be great."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "Congratulations RichB, you now have a full blown stalker on your hands."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 05, 2009", "message": "@toast to be fair to RichB (which you don't appear to be in this case) the original pasted code (if you 'view source') was such that it'd be quite hard to tell that was the case just by looking at it. To get on him publicly for missing a dash in a post (out of hundreds he's edited this week alone) is a bit childish, and only serves to be a witch hunt, and nothing more.  If you have issues with Rich B or his posts, leave a comment in the thread detailing your issues, or revert and leave your comment in the 'Edit Summary Section'.  Either way, continually trying to stir up a hornet's nest by questioning edits here doesn't serve the Stack Overflow Community; it just serves your quest for righteousness.\n\nI'll repeat a statement I made before:  We have an irc channel on irc.freenode.net #stackoverflow.  RichB, SamHasler, myself, the TheTXI, and many other SO users frequent that channel. Come and join us!"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@TheTXI: I have had a fan club for a long time, this is nothing new. At least the other ones were a little more creative and at least /tried/ to come up with valid points. It is boring to have to ignore the same monotonous broken logic being drummed over and over again.\n\nYou know me, I like debates, but a great man once said:\n\n\"Don't argue with idiots, people from a distance can't tell who is who.\""}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@George: First, the level of immaturity and attacks in this thread alone from Rich B and TXI tells me that joining the IRC channel would be an exercise in seeing how much pointless abuse I could take. They are not interested in having a discussion, they are interested in forcing their opinions on others.\n\nSecond, it's exactly the reason he should leave as much of the post alone as possible. It's obvious that Rich B doesn't know Objective C, or else he wouldn't have made that mistake. By being conservative in what he does, he could avoid those mistakes. Not to mention that his attitude towards fixing it is deplorable, and it probably wouldn't have gotten fixed had I not mentioned it.\n\nSo, I guess you could say this is positively contributing to the quality of StackOverflow. At least as much as the edits Rich B makes on a habitual basis."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "Define: Stalking\n\nStalking is the obsessive following, observing, or contacting of another person, or the obsessive attempt to engage in any of these activities. ...\n\nhttp://en.wikipedia.org/wiki/Stalking"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "Case in point"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "Also, I'm supposed to show that Rich B is making useless edits but I'm not supposed to actually look at Rich B's editing history to make that determination.\n\nI fail to see how that makes sense.\n\nOf course, I could just keep shouting \"Is too, you get off the site\" in response to his \"Am not, you get off the site\". But really, that would be silly."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@TheTXI: It is ok, I am flattered honestly. Stalkers rarely cause any harm, and usually tire themselves out.\n\nYou know unless you ask Jodie Foster about her stalker...\n\nSomeone call the White House!"}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "If Jodie Foster's stalker ended up shooting the President, I think someone stalking you has a better chance of shooting their dog groomer."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@Rich B: Are you even going to try and answer my questions?\nhttp://blog.stackoverflow.com/2009/03/the-great-edit-wars/#comment-16000\n\nOr are you going to prove me right and just sit there making pithy remarks?"}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "@theman_on_vista:\n\nDo you like ponies?"}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "While I can appreciate the ability to edit posts, I also appreciate the differences in dialect, spelling, etc.  IMHO the OP should be the ultimate authority on their particular question or answer.  The problem that I have with RichB's edits, are that he seems to believe that his edits outweigh what the original poster intended or wanted.  For instance, in this particular post, he edited out \"hi\".  The OP rolled back his edit and RichB rolled back the OPs rollback with this explanation, \"Removed unnecessary rollback. This extra content does nothing but clutters the preview on the comments list. In the future, address your concerns on my edits in a productive way please.\"  This gives a sense of inequality and is a bit off putting.  I have to ask, how are RichB's edits without explanations, any more important than an OP rolling back edits and not explaining him or herself?\n\nI feel as if I've become a fairly good user of SO, but at this rate, I'm probably not going to continue participating.  I come here because, for me, it's supposed to be a collaborative effort with language differences, salutations, the occasional swear words, etc.  I don't want to come here if it's RichB's StackOverflow"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD: The example you mention is not the OP rolling back. It is Kev rolling back after he threw a tantrum."}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "My apologies for not getting the sordid cast of characters right.  Regardless, I don't see your edits as anymore important than anyone else's.  Whatever your justifications are, you're making how I'd like to use SO, more and more difficult each day."}, {"author_name": "belgariontheking", "gravatar_hash": "2a2f9018942bf8e582faff47eb169fdf", "author_url": null, "date": "Mar 05, 2009", "message": "Oh wow.  Stop whining everyone.  \n\nFace it: Rich is better at this than all of you."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "GregD: Describe how any edit I make makes your experience 'more difficult'. That makes no sense at all.\n\nAlso, do you feel that Kev is somehow justified in rolling back an edit made by someone else that has no negative effect (in fact it has a positive one, like I mention in my edit note)?\n\nExplain to me why rolling back an edit that has nothing to do with you is ok, but making the edit is the problem?"}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "RichB:  I don't really have to explain that to you nor do I have to have it make sense to you.  Sorry.\n\nIMHO Kev adding \"hi\" back into the post is no different than you removing it.  The \"hi\" is what the OP intended since s/he put it there originally.  And this is the least edited thing I could find that you'd done.\n\nI will only say this.  Your condescending attitude is insane.  I have to justify what I'm saying to you, I have to \"explain\" it to you in a way that makes sense to YOU.  Others have to justify their rollbacks to YOU.\n\nI truly can appreciate the time and energy that you put into SO, I just happen to feel that your edits are out of control."}, {"author_name": "JonG", "gravatar_hash": "8f8ff21a67437febebc70afd19364e95", "author_url": null, "date": "Mar 05, 2009", "message": "Rich B should be a politician. \n\nHe's a master at ignoring the real complaint people have: removing 'hi' or 'thanks', or ':)' is petty and no justification for an edit.\n\nInstead he frames things into a childish debate about pointless later rollbacks and how SO is a community site where people should expect their content to be edited. All of which is true, except that's not why people are displeased."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "So...Rich has to justify every edit he makes to stalkers like toaster, but greg doesn't have to justify anything to anybody at anytime, especially not Rich. \n\nSo basically Greg just hopped on to spout off about how his user experience is getting negatively effected without actually showing how it is being done, aside from \"Rich B is an asshole\"\n\nRight."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD: Well ok then. I guess what you said makes no sense to you either, I think it was a valid question how my edits make your experience more difficult. I cannot start to understand your side of things if you are unwilling to explain them, so ok, I have no idea why you mentioned them to start with."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@JonG: I have explained many times why I edit these things. I don't feel they are ridiculous and that is not at all representative of my edits anyway. \n\nThe problem comes in where people want to roll these edits back, and claim 'mod abuse', 'edit nazi' and such with no justification for why those edits are bad.\n\nI have justified my removal of fluff from the beginning of questions with a real world value. Have you seen anyone show a benefit of that edit being rolled back?"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "But you are also are unwilling to understand the other side of things even when they are explained."}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "And TXI just hopped on to spout off about how GregD is hopping on to spout off...ad infinitum\n\nI didn't call RichB any names."}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "\"Have you seen anyone show a benefit of that edit being rolled back?\"\n\nI liked the hi as the original OP intended.  That enough justification for you?"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD: You told me I was making your experience difficult. I asked you how. That is just throwing out negative accusations without justifying them at all. \n\nI agree with TheTXI, you spouted off and now you are just going to claim victim when people ask you to explain your feelings on a subject you felt strong enough to make accusations about."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "I like ponies, but (despite all my best efforts) this has not yet become http://www.PonyOverflow.com"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD: And it doesn't bother you at all that the OP never actually complained at all about my edit?\n\nIt is noise and fluff that takes away from the limited preview scope on the question page. \n\nI did ask for a real world value after all..."}, {"author_name": "belgariontheking", "gravatar_hash": "2a2f9018942bf8e582faff47eb169fdf", "author_url": null, "date": "Mar 05, 2009", "message": "@Greg: It's clear that the OP was an idiot, though.  OPs usually are, and Rich cleans up their posts."}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "@RichB. Again your condescending attitude is poking through.  I don't particularly care to explain it anymore than I already have.  Especially in light of the fact that these discussions that are critical of your edits, end up where they do.  If I had any inkling that you could truly hear me, then I would move forward in explaing myself to you.\n\nAll this being said, I'll search elsewhere for questions and answers about coding questions that I may have.  Knock yourself out with your edits"}, {"author_name": "Roj", "gravatar_hash": "22f29d8ccc491817dd1200619ae68aee", "author_url": null, "date": "Mar 05, 2009", "message": "It's never been the edits that bother me - I'm usually in agreement with them - so much as the negative attitude that is present with many edits.\n\nThere are ways to edit someone's post in a negative and a positive manner.  Typically the negative manner involves edit wars, which then spill into the comments with people arguing.  The positive method would be to give up the edit war quickly, leave a polite comment as to why you think they should change their mind, and then leave.\n\nI know what the counter-argument to my positive method is, as it's been said many times in this comment thread: leaving a bad revision will lead to a lower quality site.  I'm not convinced it's that simple; these edit wars get people really worked up, distract those involved from helping others, and can (at the worst) alienate productive users enough to leave the site.\n\nOne could say, \"good riddance, we don't want people on the site who can't handle the heat,\" but I think we'll end up with a more homogeneous site as a result.  I consider that a bad thing, as I believe that a heterogeneous, diverse userbase will be best for any site in the long run."}, {"author_name": "JonG", "gravatar_hash": "8f8ff21a67437febebc70afd19364e95", "author_url": null, "date": "Mar 05, 2009", "message": "@RichB,\n\nBut many OP's ARE complaining about your edits, both here any by rolling back your changes.\n\nYour argument is basically: \"I feel that changing things I feel objectionable is valid, but people objecting to my changes is not\"."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@JonG: What OPs? I don't think I have ever edited toast's posts before. What OPs?"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD: Great communication skills then, thank you."}, {"author_name": "JonG", "gravatar_hash": "8f8ff21a67437febebc70afd19364e95", "author_url": null, "date": "Mar 05, 2009", "message": "Roj,\n\nI agree 100%, thank you for your reasoned and well thought out comment.\n\nMany edits are indeed positive and help to make SO a better and more concise place. However if the original poster of a question or answer dislikes an edit, particularly one that offers no correction/clarity, then this should be respected.\n\nClaiming that people unhappy with their posts being edited is really just a straw man argument."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@roj: I agree with a lot of your points, but remember, in most cases if an OP rolls back an insignificant edit I would never even know it. These types of edits do not typically turn into edit wars from what I see. \n\nI am actively trying to avoid rollback wars, but I do disagree emotionally biased mods rolling back edits with no justification at all.\n\nVery good points though."}, {"author_name": "Pesto", "gravatar_hash": "350bd142172dc399ef6928001591544a", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD: Good God, man, aren't you laying the melodrama on a little thick?  \"I like questions with greetings in them, I guess this isn't the site for me.  I'll just wander back into the desert, lost and alone, with nary a site to guide me when I have a programming question.  No, no, don't try and stop me!\"  I can't imagine the sort of mental rigidity necessary to be driven from a site due to arguments about whether or not questions should have saluations."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@RichB: I don't see how engaging in rollback wars with users is \"actively trying to avoid rollback wars\".\n\nYour rollbacks are just as emotionally charged and just as unjustified. You just won't admit to it."}, {"author_name": "belgariontheking", "gravatar_hash": "2a2f9018942bf8e582faff47eb169fdf", "author_url": null, "date": "Mar 05, 2009", "message": "@toast: Oh Jesus, get your head out of your ass.  They are NOT emotionally charged.  He doesn't end up crying like a little bitch with a skinned knee and shit because of rollbacks."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "Technically, neither does the other side. They just keep reverting back and forth."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@btk: Especially when I don't typically even notice their rollbacks, nevermind rolling back myself."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 05, 2009", "message": "@Rich B: The database would tell a different story."}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "@Pesto - I don't believe you actually read my posts.  Because I specifically mentioned that my example was the least edited thing that RichB had done.  I'm not being melodramatic.  I'm merely stating that RichB's editing zeal is potentially driving otherwise good SO users, away, me included.\n\nRichB edited one of my answers (I was the OP) in which I made the whole sentence the link to another website.  Not 5 minutes had gone by when RichB had gone into my answer and edited it, so that the link was just the first word of the sentence.  I rolled it back because I happened to like my answer better, with the whole sentence as the link.  He commented and asked me to justify the rollback (the comment has since been deleted).\n\nAll I'm saying, is that if you look over RichB's editing activity, there is a bit too much zeal in it.  He's editing out what makes each and every post unique in my view (inflections, apologies, thanks, hello's, language differences, etc.)  It's a bit like going to ColdStone Creamery and ordering Coffee ice cream, with bananas, nuts, M&amp;M's, and drizzled with dark chocolate.  You go to pay and RichB comes out of the back room removes the bananas, the nuts, the M&amp;Ms, removes the dark chocolate and replaces your coffee ice cream with vanilla.\n\nPart of what made SO unique in my view, was the culture differences in the way questions, and answers, were posted and the different ways in which all of us viewed things.  When you have a zealot like RichB taking that away (with incessant editing, rollbacks, justifications) it's driving some people away."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD: You are not posting the whole truth again. In your example, I justified my edit, and asked you why you had rolled back. You replied \"To get my badge\". And you rolled back. \n\nCome on now, don't try and pull wool over eyes here...\n\nHere is the answer complete with edit history:\nhttp://stackoverflow.com/questions/613561/how-can-i-read-a-microsoft-money-data-file-using-net/613617#613617\n\nI deleted my comment simply because you rolled back, and my comment was no longer relevant."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://stackoverflow.com/questions/539451/are-you-compelled-to-eliminate-syntactic-cruft/539471#539471", "date": "Mar 05, 2009", "message": "@Rich B: I don't really care about the detailed history of question 613617, but I would like to know how you respond to GregD's main point.\n\nCorrect me if I'm wrong, but I believe his main issue was that some of your edits do nothing but remove personality (or to put in another way, the original author's voice).\n\nI don't accept the rhetorical tactic of distracting with trivia rather than addressing with reason.  I must assume your reason for using the tactic is that you have no answer.  Please prove me wrong.\n\nThank you."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Jon Ericson: I don't believe there is much 'personality' stored in the following that these people are making an issue of:\n\nGreetings.\nThanks for reading, etc.\nSmilies.\nLinks that span complete sentences.\n\nTherefore, I do not feel that the personality of the post is being changed.\n\nIn addition, I do not hold the same reverence for the 'personality' of a post. This site is for asking questions and getting answers. The most direct language is the best to achieve this.\n\nGreetings clutter the previews making it less easy to read whether you might be interested in the question.\n\nSmilies make posts difficult to read, and we are adults here and should be able to convey our thoughts without pictures.\n\nThanks for reading and your name at the bottom is useless, redundant fluff. Your name is already below your post, and we all expect you to be thankful anyway or we wouldn't be helping you.\n\nAnd links that span entire sentences? I think we should all know why that is not preferred on the internet. I liken it to typing all in caps. Should we not edit a post that is all in caps? Surely that is removing the OP's personality from the post, right?\n\nThink higher purpose..."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 05, 2009", "message": "To add on to what Rich said...I should make it a note to stress that he doesn't remove humor and personality from a post. I've seen plenty of examples where he has made edits to post that had sarcasm or other humorous quips interspersed in the text that never got touched.\n\nSalutations don't do a whole heck of a lot in terms of adding personality to anything."}, {"author_name": "Stone", "gravatar_hash": "03cdad7329f1a13d2b2f3d9c8a08813d", "author_url": null, "date": "Mar 05, 2009", "message": "Hello all,\n\nRich B is right: Toast's eagerness to argue this point is very caustic and leads to trouble just as much as anything else, and I don't understand why he's still trying to carry it on right now beyond simply to aggravate people.\n\nToast is right: Rich B's editing is sometimes overly aggressive (as when he changed the syntax of a language he didn't know and refused to correct his mistake), and his willingness to carry on an edit war over minor issues of style is disappointing.\n\nMaybe everybody should just quit being so combative and try to practice a little humility. I think that would work out quite well.\n\nThanks"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Mar 05, 2009", "message": "@TheTXI: http://i-want-a-pony.com/"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 05, 2009", "message": "@Stone: Agreed for the most part.\n\n@Sam: My hatred for you burns with the awesome fury of a thousand suns."}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "Thank you @Jon Ericson.  No matter how many different ways I tried to approach my point, RichB decided to focus on everything but the message.  You got it and I thank you for that."}, {"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "Mar 05, 2009", "message": "@Jeff\n&gt;yes, but jQuery is awesome. Resistance to jQuery is like resistance to.. awesomeness. What’s that about?\n\nWell, thats just fine, and I do use and love jQuery.\n\nHowever I don't think one should use a library until they understand at least the language basics, so when a question is asked about how to do x in JS, I think it's better to answer the question, and provide the jQuery method.   I strongly believe that developers need to know the language they are using, and not rely to much on the library's magic."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Stone: I did not refuse to edit it. We discussed it in the IRC chat and Alex Fort volunteered to edit it. After all this whole argument of toast's is that I make too many small edits, right?"}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD: I don't feel I need to answer the questions of someone who themselves will make accusatory statements and not answer simple discussion point he made.\n\nI also have no respect for dishonesty."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://stackoverflow.com/questions/539451/are-you-compelled-to-eliminate-syntactic-cruft/539471#539471", "date": "Mar 05, 2009", "message": "@Rich B: Let me summarize what you said:\n\n1) Minor edits (removing a smiley, for instance) do not alter the personality of a post.\n\n2) Personality should be a small consideration when editing a post in any case.\n\nTo address #1: People sometimes consciously write in a way that self-identifies their personality.  Someone who uses a smiley in their post self-identifies themselves as the sort of person who uses smilies.  Often the minor or nuanced portions of a person's writing are the parts that an author most identifies with and is most attracted to.  Like it or not, \"fluff\" carries information about the author as much, if not more than, actual content. \n\nAs for #2, that must be determined by an editorial policy.  Some editorial policies would agree and others disagree.  I think the editorial policy Jeff has stated is that content overrides personality, but that personality counts for something.  On one particular issue, he's been even more clear: \"I know I’ve done this [removed salutations] many times. But I would draw the line at editing solely to remove salutations, unless they’re unusually excessive.\"\n\nI respectfully submit that because of the shear number of edits, you have established an editorial precedent and that it differs from the editorial policy of the Stack Overflow creators."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Jon Ericson: I find no reference to the creators of the  site being against making edits that include removing 'personality'. In fact, the post you quote indicates much the opposite to me.\n\nAs has been show here before, if you want to make the creators argument:\n\nJeff making edits that are very similar to edits I make all the time:\nhttp://stackoverflow.com/revisions/606365/list\nAnd him saying it explicitly:\nhttp://stackoverflow.com/questions/468303/are-taglines-signatures-disallowed-on-stackoverflow/468725#468725\n\nI agree completely with not making these edits alone, and this is a rare occurrence for me and other editors in my experience. \n\nI also agree with not rolling back when an OP doesn't like your edit. \n\nThese combined incidents (salutation removal with a rollback war started by the OP) have happened once as far as I can recall, and there were definitely extenuating circumstances. \n\nTherefore if I seem uncaring about the issue, it is because I don't feel there is one."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "I should point out that this kind of stuff is not just the will of the creators, but the community as well: \n\nhttp://stackoverflow.com/questions/277128"}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "@RichB - You really are the master of the ad hominem argument.  And once again, you're throwing another one out there by implying that I'm a liar?  Nice one.\n\nI've tried to give you specific examples of how I thought you were making it more difficult for me to use SO.  I'd cough up more but you'll reply by calling me \"dishonest\" or some such nonsense.  \n\nRegardless, as Jon Ericson just mentioned, the editorial precedent that you're setting is really something I want no part of.  As I've stated before, you're turning SO into RichFlow, which is not what I believe, editing powers were meant for."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD: I am not implying anything. I told you that you were being dishonest and proved it. You have not retracted your accusations. \n\nThat is not ad hominem. I am not attacking 'the man' I am attacking your argument. Your argument that I edited your post and you didn't like it is dishonest (if not an outright lie) and the evidence I posted proves it.\n\nSpeaking of dodging the argument, how is editing with the standards given to me in the FAQ, blog, podcasts, sofaq community votes, and by the site creator making this site into 'RichFlow'?"}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "@RichB - Now I see it.  You remind me of my neighbor.  The guy that calls the cops for EVERY infraction that he can set out to find.  He studies the county and city ordinances so that everything he calls about, is well within his right to call about.  Does this make the cops happy?  No.  Does this make the other neighbors happy?  No.  Does it make me want to move?  Yes.\n\nWhile it's well within his \"standard\" to do so (calling the cops), it's the spirit of the law that he doesn't have a clue about..."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://stackoverflow.com/questions/539451/are-you-compelled-to-eliminate-syntactic-cruft/539471#539471", "date": "Mar 05, 2009", "message": "&gt; I agree completely with not making these edits alone, and this is a rare occurrence for me and other editors in my experience.\n\nObviously you know better than I do.  I would point out that Jeff's edit in the first example added a tag, which I'd argue is a content change.  Removing the salutations seemed to be a by product.\n\nI don't see you as \"uncaring about the issue\".  (In fact the opposite seems to be the case to me.)  I stand amazed at the volume of edits you've made.  It stands to reason that a subset of edits would rub someone the wrong way if you make enough of them.  I think you have a bit of a PR problem because instead of taking that subset in stride and moving on, you've sometimes dug in your heels on principle.  Even if you are 100% correct and justified, the perception is, um, negative.\n\n(I know you don't care about how others perceive you, so this response is unlikely to persuade you.  I'm not sure what else to say.)"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://stackoverflow.com/questions/539451/are-you-compelled-to-eliminate-syntactic-cruft/539471#539471", "date": "Mar 05, 2009", "message": "@RichB: Calling someone a liar the epitome of ad hominem.  \n\nThe events surrounding question 613617 had absolutely no bearing on GregD's main point.  Rather they were an illustration.  You may say the illustration is irrelevant, but to call the man dishonest is crossing the line.\n\nIn addition, the question is not whether the edits were justified, but whether the edits had a specific effect on a specific user.  You may say that the effect is not a concern for the Stack Overflow community, but you are not qualified to judge whether that effect exists.  If the user says it exists, we must take them at their word."}, {"author_name": "The great edit nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@jon: His post was very dishonest. How his argument's dishonest nature  reflects on his character is not my problem, but his."}, {"author_name": "The great edit nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@jon: Also, I don't think the evidence supports your idea that I make a significant number of edits that should piss people off.\n\nAttack the real issue where people are offended by edits when they shouldn't be.\n\nI do not 'dig my heels in' in principle during small edits contested by the OP very often. You stating I do while providing no evidence is not helpful to anyone. As you said, I have a very volume of edits pointing out one or two you feel are questionable seems like a silly argument to me."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 05, 2009", "message": "Hi Folks,\n---------\n\n@Jeff: “Fear leads to anger; anger leads to hate; hate leads to suffering.”, oh noes the dark, it's all around me!!\n\n@RichB (and the rest of The Ministry of Silly Edits): It's not often I feel the urge to scratch one of my own itches and serve up some online fruity abusive language, then hit the submit button without pressing the \"do I want to keep my job\" button, but boy it did feel good. The last time I felt this motivated to do so was in a newsgroup post back around 2000-2001 replying to a not too dissimilar baw-heed like yourself. I'm pretty happy with my earlier post, it's pretty much accurate/justified. You're just a nuisance to other SO users, plain and simple and I don't mind using the strongest language available to make that point. \n\n\"Thank you for doing far more than I ever could to discredit you and your accusations (if I would have even bothered).\" - thank you, I'm quite good at this kind of thing. I don't really give a crap about my credit or other self centering/self importance bullshit like that. I prefer speak my mind.\n\n\"I have never used this kind of language on the site or abused a member like you are abusing this audience.\" - aw get off your high horse, you only say that just because you wish you had the balls to do it first. \n\nI await your oh so predictable and imaginative \"your so thick you can only trade insults, your so vile, blah blah blah\" repost. \n\n@Andrew: I agree with you, it's precisely that kind of edit that isn't justifiable or necessary - grammar, spelling, improving the layout, putting a question into a better context etc I have no problem with, but these interfering edits are just self-ego stroking/control freakery. \n\nHis 4:46pm post just proves this point even more, who is he to decide that he alone should change the authors tone by removing harmless greetings and the like?:\n\n@RichB: \"This site is for asking questions and getting answers. The most direct language is the best to achieve this.\" Rich, you've already accepted SO is a community, people in communities like to introduce themselves, hell when I go to my Alcohol and Drugs Anon meetings we all start with \"Hi my name is...\", yet they all know my name from weeks past. It's all part of the conversational protocol of communities like these. Yes the questions are maintained in a wiki-style, but SO isn't a wiki or a strict format knowledgebase. The two key words banded about here are 'community' and 'questions', and community participants, regardless of topic, like to have pre- and post- amble to their utterances. It doesn't make the posts any harder to read, or maybe you read real slow or something and big words like 'Hello' confuse you.\n\n@TheTXI: \"I’ve seen plenty of examples where he has made edits to post that had sarcasm or other humorous quips interspersed in the text that never got touched.\" - this is most likely because RichB didn't comprehend the humour (see below) or wasn't smart enough to understand sarcasm. Nuff said.\n\n@Stone: \"humility\" - a quality sorely missing from a couple of these twits.\n\nRemoving the odd smiley or 'Hi Folks' does de-personalise SO and can also change the initial impact of a question when scan reading. This is especially important if the poster doesn't use English as a first language or maybe has poor grammar skills. Asking a question clearly and concisely, especially technical questions, can be hard for some folks, so some leeway should be allowed. You know, we're not writing PHD thesis papers or technical manuals on SO, it's a community (not RichB) driven technical content self-help site.\n\nA 'Hi', 'Thanks' or a smiley breaks the ice on what could at first glance appear to be a flamish looking demand for an answer rather than a casual/polite request (due to translation mistakes; an OP's language structure for asking a question may not necessarily map easily to English for that individual). It's subtle language nuance stuff like that RichB doesn't seem to get. By all means fix the glaring language errors, but leave the OP's personality and convivial tone alone.\n\nEven in quality discussion services such as DISCUSS.DEVELOP.COM, which were once the cream of .NET Q&amp;A back in the early days, no-one complained about greetings and signoffs and it was even considered rude not to do so. So I don't see why SO/RichB should force posters to ditch traditional polite pre/post amble.\n\nIn this post: http://stackoverflow.com/questions/613626/\n\nChanging - \"This is the code I have:\" to \"My code:\", WTF? What was wrong with the original sentence, at least document your reasoning on that one rather than an arbitrary edit? The edit just dumbed down the language in the question and could influence how a new reader forms an opinion of the poster (\"oh look this guy is a monosyllabic dolt\") without first seeing the 60 round edit war that went on behind the scenes over something so daft. Why not \"Here is my code:\" or \"Please see my code below:\", or just leave the original the hell alone!? \n\nAs I said, editing out these personal nuances and tones in the questions starts to de-personalise and alter the community persona of SO, and if it continues according to RichB's rulebook, SO will turn into a sterile, dull, dry, boring destination and about as interesting as a stack of lawyers documents. \n\nAs an aside, and as a casual observation, there seems to be a lot of devs of RichB's age group who a) have ego's the size of planets needing continual stroking, b) take themselves awfully seriously, ooh I'm a developer, I'm special, c) appear to have had their humour and personality glands ripped out at birth. They've all flocked to SO because their \"bozo bit\" has been flipped elsewhere no doubt. It's quite sad to see such seriousness and aloofness with this little crowd. \n\nSo onwards....Let me put SO in perspective, the bottom line is that SO is a business, it's there to make money. Jeff, because of his reputation as a popular blogger, and partnering with another popular blogger (Joel), has managed to tap into us, a large pool of expensive, technically savvy, experienced devs (what's your billing rate? mine is GBP1500/day), to spend *OUR* time for *FREE* contributing some pretty high-quality content to SO. \n\nTo give an example: Two answers I contributed took a few hours of spelunking the .NET FW source code to understand some behaviour in the FW. After a couple of months I had a grand total of two upvotes and a correct answer, not much for spending half a day of my time producing fairly decent technical content complete with example code (albeit voluntarily and selflessly). But SO gained more good free technical content to place next to ads on the RHS of the page should someone read it....$$$. This is not sour grapes, this is how this works and you buy in or you don't.\n\nSo obviously SO has to pay for itself and Jeff from advertising revenue (to maintain his favoured lifestyle of being a tier 1(?) tech blogger and swanning around not actually having a real day job :P). Companies will happily pay for said advertising because the content is good and it's a target-audience rich advert delivery environment - but he gets all the content for free - look, cake and eat it!. All he did at the end of the day was assemble a slick ad delivery mechanism driven by our great content - and it works too, because I clicked through an ad to the RegexBuddy guys and bought a copy. I salute the man for his vision and the fact that it will no doubt be very successful for Jeff, the Sponsors and the users (in that order).\n\nSo what do we get for all our efforts? We get the magical mystical rep number indicating how large our technical members are, and maybe some help at some time in the future solving a problem we run into. Not much in return to be honest for furthering Jeff's lifestyle/career/business ambitions, especially when I can use google pretty effectively and the interest shelf life of any question that you do ask which has any non-obvious/difficult to produce solution (i.e. the fastest gun types) is fairly short, even with bounties.\n\nAnyway my point being, why are you pissing away all your free time on quite frankly daft and pointless edit wars when there's nothing in it for you, you're not a stakeholder and you're not getting a financial kickback and you certainly don't own exclusivity to the content (even though you seem to think you do)? Christ on a bike, you hardly even ask any questions to get some kind of return? So why waste hours rolling back some shitty little smiley 60 times that does no harm at all in the great scheme of things? Hell, your type of behaviour could even possibly affect SO's ability to maximise ad revenue because I'm sure the sponsors who stumble across your petty edit wars and must think \"jeez, is this the quality of dev we really want to advertise to, mmm mmm?\". \n\nSo RichB edit-goons, lighten up dudes and stop being knobs, suck it up and maybe admit that your smiley removal edit was wrong after you've had the urge to stamp your inviolable authority/ego for the 60th time on the same sodding article. It's not winning any Pulitzer prizes and I don't think there's an MVP award for SO Stupid Edits. \n\nI bet if messrs Skeet/Gravel/Hewghill/Atwood stuck a smiley in their questions, or a 'Hi Folks', you wouldn't dare touch that, because RichB you're plainly a bully and a first class muppet that preys on the noobs who know no better, or experienced SO folks who just can't be arsed wasting their lives fighting your self-assumed editing authority; and to re-iterate, your edits *are* second rate zero/negative value contributions. \n\nI've seen your kind a-plenty in the office place, clubs, organisations, wherever, and you always claim whatever it is you're trying to pull off is for the benefit of the 'community' when in fact it's all about being in control and 'oh look at me and how I run this so well, I'm so shiny, smart and clever so I am'. Meh.\n\nAnyway, I'm bored with this now and you.\n\nkthxbai. ;)\nKev\n\nps: @Jon Ericson 6:24pm - nice post. Further to your 7:04pm post, RichB has a major PR problem and that's part of his problem. There was a question by a poster around xmas time that was more or less a dup of the OP's original. He was doing a chase up with a second question and I guess genuinly didn't understand the mechanics of the site and how that's a no-no. The first comment from RichB was to tell the noob to \"stop whining\" about not getting an answer. I suggested to RichB that a little politeness goes a long way and predictably we ended up with the usual RichB \"everyone else is wrong I am right, you're all crybabies\" tossfests he usually ends up doing. Sadly the question and comments have now been removed. He really is the most obnoxious forum crackpot I've ever stumbled upon for a long time."}, {"author_name": "The great edit nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@gregd: What amuses me is that you don't seem to understand that your analogy is backwards.\n\nYou see, I don't generate noise (calling the cops) by editing.\n\nYou generate the noise with rollbacks, complaints and dishonest accusations.\n\nYou are the neighbor here, and I am the innocent guy getting the cops (Jeff and team) called on him.\n\nNo wonder why you have relationship problems with your neighbors though!"}, {"author_name": "The great edit nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@kev: it sounds like you have a lot of personal issues and opinions that conflict with the SO community. I hope you work out your issues and that you adapt your prepubescent attitude to achieve a goal to help the community and not just serve your own needs. \n\nAfter all, my behavior and expressed feelings align with the community's opinion so far, and your behavior and expressed feelings are like an enraged teenager who just realized he cannot have his way.\n\nGood luck with wherever life leads you, but I think it is time to move on until you can express yourself like an adult."}, {"author_name": "The great edit nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "Just for humor, I will post a link to an Atwood post I did edit earlier. Just because people who cluelessly run their mouths crack me up.\n\nI would post now, but I am at the bar on my phone and SO isn't /that/ great on the iPhone.\n\nTrolls and crybabies crack me up though."}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "\"You generate the noise with rollbacks, complaints and dishonest accusations.\"\n\nTo my recollection, I've done one rollback, my only complaint is with your editing zealotry and I'm not being dishonest.  So, if I could edit your comment, I would remove the plural (s) on rollback and complaint and completely remove \"dishonest accusations\".\n\nRegardless if Jeff Atwood and company really had you in mind when they doled out editing powers, then SO is really not a place that I belong."}, {"author_name": "The great edit nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@gregd: Regardless of how many rollbacks you engaged in, you have used those rollbacks dishonestly to make unfair accusations.\n\nThat is dishonest no matter how you want to spin it. \n\nThe fact that that is your evidence of my 'zealotry' makes your argument ridiculous and somewhat comical.\n\nI agree with you though that this is likely not the right place for. Although it was the community who 'doled out' my privileges. Not Jeff. \n\nGods thing you got your badge though. A man has to have his priorities. I chose trying to contribute to the site over badge whoring though."}, {"author_name": "The great edit nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "*for you\n\n*good thing \n\niPhone keyboard, ftw"}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 05, 2009", "message": "\"I chose trying to contribute to the site over badge whoring though.\" - that's the thing though RichB, you don't contribute. You remove 30 characters here, 20 characters there then whine (your favourite word) about how your edit got rolled back. \n\nNot only that you just tarred the rest of the community with rep whoring just because they take the time to answer/ask questions which is what the site is for. If people weren't \"badge whoring\" then there'd be nothing for you to edit - oh no, whatever will you do then!\n\nKev"}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "I told you I rolled back your revision to get my badge because it was shortly after I did that, the orange bar at the top went off for my \"cleanup\" badge.  I initially rolled back your revision because I liked my way better and frankly I thought you were just being an ass for changing it in the first place.  Which is why I wrote \"to earn my cleanup badge\". Because I was joking and pissed at the same time.\n\nThat being said, I would have put a smiley at the end of \"to earn my cleanup badge.\" but it was unnecessary clutter right?  Not necessary for questions and answers.  Much like \"hello\" or \"thanks\" or smileys.."}, {"author_name": "The great edit nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@kev: Your definition of contribution is extremely skewed.\n\nNot sure what to tell you there.\n\nI am sorry if I (or someone) hurt you emotionally, but this is not the venue for your therapy."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD:  What I don't understand is why a conflict with *any* small number of people on a site as large as SO would actually drive you away from the site.\n\nI can understand if you are so frustrated with any one person of your choice that you don't feel the need to answer to *that person* about anything. That's obviously your prerogative.  But remember that there's a large group of people reading this discussion, probably most of whom aren't posting, who see intense complaints from you (\"This is so unbearable that it's driving me away\") without much to back it up.  You understand the context of your complaint, but the rest of us won't unless you provide more information.\n\nThe one data point you've given us -- the one post of yours that you mentioned RichB editing -- you rolled back to your original version (for the badge, as you yourself said) and you then rolled it back to his edit almost immediately.  That doesn't make a case for this being so offensive as to drive you away.\n\nPeople, not just Rich B, are genuinely interested to know what is so offensive, because if you can make a case and persuade the community then I believe that change will occur.  No-one that I've spoken to is interested in driving any productive person away from SO.  Quite the opposite.  Anyone who invests significant time of any sort on the site is clearly interested in the site being useful and successful.\n\nSo please, share with the *rest of us* what is so offensive about Rich B and/or others' edits that you find so unbearable that you are contemplating abandoning SO.\n\n@toast: I am stunned that you appear to think that a majority of edits on SO are not helpful. (Or perhaps you are speaking from frustration and you only believe that a significant minority of edits are not helpful?)  That you would penalize editing ... just makes me speechless.  You would throw out the baby with the bathwater.\n\nI seem to make a lot of the kind of edits that you don't like -- grammatical fixes, capitalization, changing an unclear question statement title into a clear *question* title, and so on.  I feel these edits bring true value.  English is not the native language for everyone.  It's my native language, and I am proficient with it.  If I can clean up another person's grammar so that their question is clear and unambiguous, they are much more likely to get an answer.  Were I asking questions in a Polish forum, I hope that someone would clean up my grammar, as trochę mówię po polsku.  (I am not Polish; I married someone who is Polish.)  I feel strongly that edits correcting even small grammatical mistakes bring value, or I wouldn't waste my time doing it.\n\nAnd you seem to measure one's value by whether or not they answer or ask questions, more than by any other measure.  That's your choice and you're welcome to it. I don't share that opinion.  Also, note that RichB has *thousands* of rep points, which he can't get by editing alone.  I edit more questions than I answer.  I feel that I bring value to SO by doing so.  I hope that others agree, but clearly, not everyone will agree.\n\nA small number of very vocal people are clearly tweaked by RichB and Gortok's edits.  To try to solve this by punishing all editing is trying to solve a social problem (disagreement over community standards and over how and when and with how much zeal they should be enforced) with a technical fix.  That is, it won't be successful even if it succeeds.\n\nIf we can come up with stronger community guidelines (stronger in terms of strong *consensus*, not in terms of strong *enforcement* or *absoluteness*), I think many of these other disagreements will become less important."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD: So your failure at communication and your own failure to make fact agree with your statements here is somehow my fault? \n\nNice try. \n\nI posted the truth and the evidence. It conflicted your accusation. Get over it. \n\nHow bothered can someone be when they roll back to your edit and comment that they needed a badge?"}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Eddie: I 100% agree with your points. \n\nI wish I could summarize this anywhere near as concisely as you did, but I cannot.\n\nFrom your post, I think you will be/are a valuable asset to the community through your edits and you will provide a huge return to the community.\n\nWhatever happens to me (as I seem to be the scapegoat at the moment), I hope you have a long and satisfying experience with editing posts and engaging the community in thought.\n\nThank you for your summary, I wouldn't change a word if I could."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 05, 2009", "message": "\"@kev: Your definition of contribution is extremely skewed.\n\nNot sure what to tell you there.\" - wow lost for words, that's a first.\n\n\"I am sorry if I (or someone) hurt you emotionally, but this is not the venue for your therapy.\" - I didn't see any therapy/mental illness related matter when I pointed out your lack of contribution and the fact you tarred SO folks with being rep-whores. Explain?\n\nAnyway, it's your usual avoid the argument tactic, accuse some of being mentally ill or too fragile to use SO. It's boring now, surely you have something better than that? \n\n\nKev"}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "@Eddie - If you can't see how RichB could be offensive and piss people off by his messages here, and his edit history, then I can't explain it anymore than I already have.\n\nRichB seems to have taken it upon himself to be the editor of all editors on SO and makes people like myself a bit reluctant to contribute.\n\nConcerning my comment that he edited:  The ink hadn't even dried on my comment.  I had no sooner clicked submit and refreshed to see if any other answers were added, when I'd noticed that RichB had already edited it.  Quite frankly, I feel as if my answer should have been left as I intended.  Rather than argue with RichB because I've seen his behavior in the past, I simply quipped that I did it to get my badge.  That was me being a sarcastic smart ass, something RichB wants to edit out of questions and answers anyway.  And when he doesn't get that, he calls me names.\n\nIf you don't get that it's RichB's flippant attitude about his editing and his general garishness and that he's the only one that's right because he's got the support of the community behind him, then I really can't explain it any better than I already have."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD, before you respond, I started my previous post a few hours ago and thus, obviously, didn't see your later post where you clarify that you were joking and angry when you said \"to earn a badge.\"\n\nI stand by my point that if you truly want to change something about SO, the best way (IMO) to do that is to find a way to help the group reach a strong consensus.  In this case, obviously a strong consensus around \"what is a good and productive edit?\"  To do this, please remember that you're not talking privately to RichB. You're talking to a whole community."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@kev: I am not sure what you would like me to answer to your argument which consists of \"WAHHHH Stackoverflow is not what I would like it to be! The community decided, but I will hold one person responsible!\"\n\nI am ok with you not liking the direction the site has taken (it took this direction during the beta, but whatever). You do not seem ok. \n\nYou keep telling everyone you want to leave and that this site is not a good fit for you. You tell everyone that you plan to move on. I am encouraging you to achieve your goal.\n\nWhat is holding you back? It seems to be the ability to argue with me. If I stop arguing with you and tell you that you are right will you finally spread your wings? \n\nI am ok with that. I can do that for you."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD: 'The editors of all editors' huh? I know quite a few people who would not like to hear that I somehow control their thoughts or actions. Luckily they are intelligent enough to form their own life opinions and not listen to the trolling of one man.\n\nIf you didn't like my edit, perhaps you would like to explain to everyone why you rolled back /to/ my edit and told us all that you only rolled back to your edit for the badge?\n\nPerhaps you would like to explain to everyone how the web standard of how the smallest link possible is preferred is garbage and you are making your own standard?\n\nNo one has called you names by the way. You are the only one making dishonest attacks on people. I back up everything I say with fact. You have already proven here that you cannot say the same."}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 05, 2009", "message": "Ah I get it RichB.  YOU have the community of SO so proudly behind you.  If YOU have the SO community behind you, like you keep professing, where does that leave us mere mortals?  Like a big ole  on your chest.  Does it come with a blue cape?\n\n@Eddie I appreciate you attempting to glean more information from me about what I mean.  I've exhausted myself.  I think my posts and RichB's posts speak for themselves at this point."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Mar 05, 2009", "message": "@GregD, whoops, you were faster than I was!  Ah, so it goes.  But anyway, I never asked you to explain \"how RichB could be offensive and piss people off.\"  No-one is saying that RichB will win \"The Nicest Guy On SO\" award, nor would he suggest he is vying for or would care about such a thing.\n\nWhat I hoped you would explain is why a small number of active editors (one or two or at most three, I assume) can so offend you that you would abandon the whole site and the many thousands of people who are active here.\n\nAnd look, the first time one of my posts was edited very quickly after I had posted it, my first reaction was outrage.  *Minor* outrage to be sure, but still outrage.  Then I looked at the edit, realized it was constructive, and got over it.  I do fully understand that part of this conflict is over whether or not all of RichB's edits are constructive, and that there is strong disagreement from different sides on this point.\n\nAlthough RichB is getting tarred with the brush, \"All of his edits are harmful,\" which is not fair, nor reasonable.  Yes, some of his edits are trivial edits, but don't forget that the history doesn't always show all edits made in an obvious way.  An edit that *all* would defend that happens to include removing a \"Hello\" may *appear* to only remove the \"Hello\" unless you examine the history very, very carefully.\n\nAnd I *still* think the best solution and the quickest solution to this conflict is to drive toward a strong community consensus on what function editing plays.  I am supremely confident that if the community at large reaches a strong consensus about what edits are constructive, that RichB and others will modify their behavior to fit that new, strong, community consensus.\n\nI understand completely when one comes from frustration or outrage.  Any large enough community is going to have its share of gruff individuals.  But ultimately, do we try to fix the conflict as a community, or do we just vent at each other and make no progress in any direction?  As someone I used to work with would ask, paraphrasing, \"Do we only contribute to the heat death of the universe, or do we solve a problem?\"\n\nNow that so much frustration has been vented ... can we all try to reach a consensus?\n\nHow about this ... for starters ... just to try to find a middle ground where I think all reasonable people can agree, based on emotional reactions to past edits.  This is a *proposal*.  A starting point, not a finished product.  This is not meant to tar anyone with \"you broke these rules,\" nor with \"why do you whine about this,\" but is instead an attempt to find a productive middle ground:\n\n- Generally avoid editing *solely* to remove salutations and signatures, unless offensive or huge.\n- Generally avoid editing *solely* to change a non-question but very clear question title into a question-structured question title.  (Of course, one's definition of \"very clear\" will differ.)\n- Grammatical fixes and typo corrections are always OK.\n- Changing a non-question title to a question title is just fine if you also make the title more specific or more clear or more direct.\n- When a question is unreadable (usually from someone very new to SO, obviously), large edits are expected and are justified.  Yes, the definition of \"unreadable\" will vary, but a question that's difficult or just non-obvious for a native English speaker to figure out the meaning of may be impossible for a non-native speaker to figure out.\n- When editing for formatting or grammar or typos, it's acceptable to remove small salutations and signatures and \"Thanks in advance,\" as in general these don't add a lot of personality to a post.\n- If someone strongly objects to an edit that meets these guidelines, well, everyone has an ego.  OK.  The smaller the edit, the larger the chance we let the OP keep their version.  Or maybe the editor re-edits in a way that keeps the edits a larger group would agree with and abandons the edits that the OP objected to the most.  Or maybe some 3rd option?\n- What else?\n\nWhen I've edited http://stackoverflow.com/questions/14593/what-is-the-etiquette-for-modifying-posts I make every attempt to go only by evidence for what appears to be the current community consensus (giving extra, but not controlling, weight to those who own the medium).\n\nRather than verbally stabbing each other repeatedly, let's solve the problem.  For those who have seen \"A Night At The Museum\" ... remember the pointed question, \"Who's evolved?\""}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "I agree with Eddie again. This is what the editors and the community as a whole have been striving for I believe. \n\nThese witch hunts full of emotion accomplish nothing."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 05, 2009", "message": "Hi RichB,\n\nWhere did I say “WAHHHH Stackoverflow is not what I would like it to be! The community decided, but I will hold one person responsible!” - please quote me? I also note that this is another of your stock \"make the dissenter look like whiny baby\" responses. Yawn.\n\n\"You keep telling everyone you want to leave and that this site is not a good fit for you. You tell everyone that you plan to move on. I am encouraging you to achieve your goal.\" - I think you're now confusing me with someone else - got a quote?\n\nI have stated that there is a small hardcore of miserable, aloof and jumped up individuals such as yourself who seem to have taken it upon themselves to be the SO policemen. This has somewhat reduced my enjoyment and involvement in SO. The purpose of SO and it's goals from day one I have fully embraced and fully support. Nowhere have I suggested that I disagree with SO's direction. \n\nMy profile text says - \"Tries but fails to inject some humour and life into SO which has become the abode of so many serious and humourless young men. Bored of SO now.\" It's a comment on a noisy minority of which you are a member, not StackOverflow.\n\nWhilst it's sad to see the likes of you assume you're the defacto authoritative uber-editors (reminds me of the way wikipedia went), this particular blog post touched on the aspect of SO which I find disappointing and got me a tad interested again. Perhaps, from the lively discussion here, something will be done to prevent the type of edit abuse you're so keen on accusing everyone else of doing when in actuality you're the main culprit.\n\nSo RichB I won't be going away any time soon, but thanks for the offer of help. \n\nI await your reply.\n\n@Eddie - common sense at last.\n\nThe problem with RichB is that he doesn't back down, no matter how wrong he is. Fifty to sixty rollbacks on a post must surely give him some clue that a poster, or 'occasional' editor feels strongly enough that his version is the right one and that 'Hi' at the start of the post was what the OP really wanted. But no, he always has to have his way and then predictably the comment spam starts. Like an obvious software bug, it's completely reproducable. \n\nSome of us are just fed up with it.\n\n;)\n\nCheers\nKev"}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Kev: Now you sound dishonest like Greg. \n\nShow us all the post where I removed 'Hi' and rolled back 'fifty to sixty' times please."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 05, 2009", "message": "@RichB - \"These witch hunts full of emotion accomplish nothing.\" - how colourful. No RichB it's your intransigent attitude in the face of wrong that accomplishes nothing."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Kev: When I have been proven wrong here, or had a single piece of evidence of abuse brought against me, I would be happy to concede defeat.\n\nTrying to crucify me for contributing justifiable edits is a whole different issue though."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 05, 2009", "message": "@RichB - man you are so literal. That was a metaphor for your behaviour. \n\nKev"}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Kev: Right. So it would be a metaphor for your behavior if I called you a drama queen who commonly embellishes on 'fact' to suit your own needs in fighting emotional wars."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 05, 2009", "message": "@RichB - \n\n1. many of the posts where you've been on your high horse have been deleted/removed from view and sadly I don't have copies a but - edit 3 here http://stackoverflow.com/revisions/560329/list was abuse of privilge and then predictably you start the comment spam. It's a repeatable pattern.\n\n2. justifiable edits do not include removing salutions and signoffs - which you do."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@Kev: I see, so never mind that other people went in and included my changes in their edits as well, and you /only/ went there to rollback right?\n\nThat is rich man. Seriously. Hurry up and take that one back before I really start to think that reality is this far away from your grasp."}, {"author_name": "Stephen Thorne", "gravatar_hash": "84965d0d894b45875d8045bc5762ba57", "author_url": null, "date": "Mar 05, 2009", "message": "No edit that improves the readability and consistency of stackoverflow is not justifiable.\n\nThrowing away crappy wording, improving spelling, rephrasing unclear sentences, using punctuation properly, removing unnecessary cruft (salutations, thanks in advance, conversational guff), these are all positive things.\n\nThe fact that we have people who care about the site and the community enough to consistently improve it is also a good thing.\n\nThat we have critics who just want to undo improvements is disappointing. Why does anyone want to undermine improvement of the site?"}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 05, 2009", "message": "@RichB - \"@Kev: Right. So it would be a metaphor for your behavior if I called you a drama queen who commonly embellishes on ‘fact’ to suit your own needs in fighting emotional wars.\"\n\nNo that would just be you scrabbling for new weasel words to avoid dealing with the fact that you fail understand that there are times when you have to back down and admit you're wrong.\n\nRegarding http://stackoverflow.com/revisions/560329/list you were the one that did the unjustifiable edit. I rolled it back. Then your partners in crime (Eddie and Gortok) saw fit to re-instate the edit. At that point I had better things to do, such as now where I need to get my beauty sleep.\n\n\"That is rich man. Seriously. Hurry up and take that one back before I really start to think that reality is this far away from your grasp.\" - wow another classic from your repertoire. Must do better.\n\nSo nitey nite, don't stay up too late micro managing SO, I'm sure it can look after itself.\n\n\n\nCheers\nKev"}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@kev: You can continue with your emotional crusade, but there was nothing wrong with my edit. It did not hurt the community at all. And I did not engage in /any/ roll backs contrary to your accusations, the edit history proves that as well.\n\nSo, you posting that link really only strengthens my argument. You can call anyone who agrees with me my 'partners in crime' or my 'posse' or anything else. But we all know that is a cheap cop-out."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 05, 2009", "message": "This crap has gone on for so long that someone forgot to feed my pony...and now he is crying.\n\nCan't you see? The pony? He's crying."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "As I promised before:\nhttp://stackoverflow.com/revisions/9/list\n\nI only prey on and edit the posts of the weak. The weak like Jeff Atwood."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 05, 2009", "message": "Blasphemy!"}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "The weak and defenseless like Adam Davis:\n\nhttp://stackoverflow.com/questions/209015\nhttp://stackoverflow.com/questions/47882\nhttp://stackoverflow.com/questions/60509\nhttp://stackoverflow.com/questions/315911\nhttp://stackoverflow.com/questions/335293"}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Mar 05, 2009", "message": "Wow - 269 posts and climbing! Jeff, if you're paying attention, we NEED a message board for meta-discussions like this - it gets harder to follow as the number of posts grows! A phpBB (or similar) board would be sufficient as long as it's at least semi-official.\n\nWith regard to the matter at hand, I do think that, as a whole, the open editing of posts has been a net positive on SO. Allowing other people to correct spelling and grammar errors, as well as awkward or unclear phrasing, has the potential to vastly improve the quality of the questions and answers on the site. From what I've gathered from this discussion, the contention seems to be primarily focused on what content and edits are appropriate for the site (i.e. keeping/removing salutations, etc).\n\nWithout giving examples or pointing fingers (as I have none of either) I will instead say that this blog post is (or, at least, was) about edit wars, which are a different issue altogether. With an edit war, you have at least two people rolling back each other's changes to a post, each with their own preferred content. With a normal wiki, such users would be on equal footing, and therefore it's difficult to say which party is right. However, with SO's concept of content ownership, such edits can (perhaps inadvertently) change the form or meaning of the post, essentially putting words in the author's mouth.\n\nIn my opinion, anyone that can may edit any post for any reason, but if the owner of the post reverts the changes, immediately drop the issue. If a post owner does not like the changes made to a post, why force it upon them with an edit war? If a post is unclear it won't be answered or voted up. If it contains offensive content, it will be removed as such. A possible exception to this rule can be allowed for Community Wiki posts, as the ownership of such posts is, by design, much looser than that of regular posts.\n\nDoes this sound doable?"}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Mar 05, 2009", "message": "I should clarify a bit about my last post - I still have all my fingers (thankfully!). I meant that I wasn't attempting to single out any specific user."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@nobody: Sounds like a good plan, similar to Eddie's to me. I have already agreed to these ideas a few times now."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Mar 05, 2009", "message": "@Rich B / The Great Edit Nazi\n\nIn rereading the main post, it sounds like I pretty much said the same thing Jeff did. Still, this discussion had become a runaway train and it's important to get a reminder about what the actual problem was.\n\nI am concerned about what might happen when two editors get into an edit war over a post neither of them own. I'm still not sure how that case should be handled."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 05, 2009", "message": "@nobody: My question in that case is why would someone be rolling back changes on a post they didn't own unless it was blatant abuse? \n\nIf it were blatant abuse, they could also surely report it as such to the SO team or on UV if the abusive party was persistent."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Mar 05, 2009", "message": "@Kev, I didn't know that I was a partner in crime.  Cool, now I have a title.  That means you can dismiss what I say without having to listen to me, because you've decide what \"side\" I'm on.\n\nSince you labeled me, are you suggesting that my edit was a bad edit or that I harmed the meaning of the OP or that I harmed the OP?  I believe I improved the clarity of the title significantly and that I also improved the clarity of the body of the post.  I also made a few formatting improvements that don't show in the edit history at all.\n\nYes, I also removed the \"Hi,\" when I did so.  The OP edited the post after my edit, only changing the case of a character in the title.  (I've seen everyone refer to the language as \"r\" so that's what I used.  The author, as a user of this language, gets final say and gets to call it \"R\".)  If the OP was upset about the edits, he or she said nothing.  I believe that by improving the question title and by improving the readability of the content, I was directly helping both the OP and future people with a similar problem.\n\nAnd why would you ever revert *any* minor edit to which the OP did not object?  As much as you suggest RichB is on a crusade, if you are going through his edit history so that you can revert his edits that you object to, you are doing what you are accusing him of doing.\n\nWhat is your opinion of my edit in http://stackoverflow.com/revisions/612258/list where I corrected the grammar of the title?  It's one of the most minor edits I've made, but I believe it's a worthwhile edit.\n\n@TheTXI:  Here's some food for your pony.\n\n@nobody:  If the OP reverts, depending on the size and reasoning for the edit, I wouldn't necessarily immediately drop it.  I would try to communicate via comment with the author, or if their revert comment specified what they objected to, I would probably re-edit without the \"offensive\" part of the edit. Incremental improvement is better than no improvement. While someone who objects in an absolute sense to having their posts edited by other people probably doesn't belong on SO, it's not my job to police that.  After a few attempts at communication, I would drop it.\n\nAlso, yes, I heartily agree that some forum area for these sorts of communication and meta-conversation is essential.  It would take a *lot* of noise off of SO, where it doesn't belong, and it would reduce the noise on UV.  At a minimum, we need something that serves the same purpose as the \"discuss\" or \"talk\" pages on Wikipedia.  Short of this, these meta-discussions will spill onto SO and UV and here."}, {"author_name": "Code Slave", "gravatar_hash": "0a638176c7349e10fe82e6e65f2b069f", "author_url": null, "date": "Mar 05, 2009", "message": "Hello Kev,\n\nGreat manifesto! I feel your pain. :-)\n\nYou know, since my first run in with RichB (and the rest of the howler monkeys, it’s not just RichB – he’s just a good straw man) I’ve had less and less desire to do anything with SO (and I think it is the same for others). Maybe that pleases RichB, maybe not. Any way the result is the same, and that’s sad.\n\nOne of the first things said in the main FAQ is “Be nice” (along with the explanation that follows – sorry Jeff, I’ve got to bend that rule this time). RichB seems to have missed that bit; because he’s not being nice. He’s nasty, condescending, and insulting... even when he pretends that he’s being supportive. He gets into the old well worn tactic ad holmium attacks.\n\n(And yes I do know what it means – you attack the character of the man, not the ideas. And really, that’s sort of what I’m doing here. I don’t care whether the edits he makes are making are good or bad. It is the holier than thou attitude that is the problem)\n\nHe’s skilled at flame-warring (http://www.petrescue.com/library/flame-guide.htm). You have to be if you are going to survive on IRC. \n\nHe’s one of those people who in real life you get angrier and angrier at the longer you have a conversation with them. And you don’t know why. The truth is no one thing is enough to be angry over... but put together it is death by a thousand paper cuts.\n\n(This is where you or one of the howler monkeys tells me I’m a whiny sucky baby. Come on, you can do it.)\n\nThe problem is that we have within our community (that being technical people) a significant portion who are on the Aspergers/Autism spectrum. It’s nothing to be ashamed of... it is what makes us good at what we do. Attention to detail, adherence to rules, and fanaticism. And typically, some difficulty with social interaction. How does this manifest it self on SO (or any other forum populated by tech)?\n\n(yup, I’m playing armchair psychologist)\n\nYou get a portion of participants who get to a sweet spot and have “figured out the rules”, (or what they “should be” in an ideal world) and then decide that they must enforce them. And they have the power to. RULES ABOVE ALL ELSE. BAN HIM FOR POSTING WITHOUT READING THE FAQ. RAPE HIS NOSTRILS FOR HAVING 47 SPELLING MISTAKES IN A 50 WORD POST. BURN THE HOBBIT!!!\n\nThese were the same people who went into the priesthood and became members of the Spanish Inquisition. They knew the word of God, and they were going to save you if it killed you.\n\n(yah, I know, this is almost like calling them NAZIs, but I think we are still free of Godwin)\n\nOn Usenet they were the ones who would scream “RTFM” at any newbie question and decided the “noob” was an insult (forgetting that even they were once a noob). They were the ones who chased people off the internet for having the gall to reply “Me to.”  I know, I was one of those... I was already a seasoned net’er when AOL got connected... but I grew out of it.\n\n(Now is where the howler monkeys tell me I’m old and tired, and to get a walker)\n\nAnd finally, what would a good old fashioned flame be without some cutting personal and completely irrelevant remarks. Rich B\n\n(yes, now I’m being childish)\n\n1) Get a hair cut. Really, a fro... a fro!!! The only think worse would be a mullet.\n2) Get some new glasses (without the Photochromic birth-control lenses). Get one pair for working inside, and swap them out with a nice pair of prescription sunglasses for when you have to go to that place we call “outside”. It might get you a woman.\n3) While I think of it, get a woman (or a man, not that there is anything wrong with it). Most women act as a civilization force on the men around them. They’ll even tell you when you are being a jerk. Yes Dear... delete-delete-delete\n4) Get laid... seriously (see #3).\n5) Get a job, if you have time to do this much editing and this much flaming – you’ve got to be unemployed (no mater what website you link to in your profile).\n6) Learn to see the shades of grey in the world – this has nothing to do with sunglasses.\n7) Consider, seriously consider, that you might not be right all the time. Imagine RichB and Gortok getting into an edit war with each other (it would being the Jeff’s new server to its knees :) ).\n8) Get Jeff’s the point about being “the bigger man”. It’s not being the biggest bully, or the baddest rollbacker. It’s about making SO a pleasant place to be. The edit wars make it a not so nice place to be (more so than not making your improvements); Especially for newbies who see them and don’t want to get singed. When you are in an edit war you are HALF of the problem (even if you ARE right).\n\nIn the mean time, if I’m inclined to contribute any further questions or answers SO I’ll do my best to remember to include Hi, Thanks, smileys, ellipsis , and anything else I can think of just to piss off the editing police and make them was time fixing them. I probably won’t roll them back, but I might. Otherwise, I’ll do my best to ignore the editing police otherwise.\n\nThankyou, come again."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 06, 2009", "message": "@Code-Slave: \n\nRich B's Avatar is not Rich B, it is another StackOverflow user, although it was pretty amusing."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@CodeSlave: I have never been \"nasty, condescending, and insulting\" on SO. I invite you to find an example that conflicts with my statement.\n\nYou either have me confused with someone else or you are being as honest as GregD with your accusations.\n\nAs for the rest? I think we could do without another troll who spends his time using teenage mannerisms and throwing accusations he doesn't even understand.\n\nThanks anyway."}, {"author_name": "Drew Gibson", "gravatar_hash": "dc5e4e4387374e20efffa31eb7608ef9", "author_url": null, "date": "Mar 06, 2009", "message": "\"Rich B’s Avatar is not Rich B, it is another StackOverflow user, although it was pretty amusing.\"\n\nNo, it isn't really.  And it has led to personal remarks in this thread based on that users physical appearance, due entirely to Rich B's combative attitude.\n\nI'm shaking my head here.  I suspect that there are a number of old-fashioned internet trolls here, just doing an old thing in a new way.  I remember similar stuff on Usenet, maybe 15 years ago.  *Yawn*.\n\nI don't know if Rich B really works for the company he or she says they do in their profile, but if I was running that company, I'd be apoplectic about the negative image being portrayed on SO and here by that employee."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@Drew: Why would I be concerned about fairy tale accusations?\n\nDo you commonly take the word of people over the internet with no type of fact checking?"}, {"author_name": "Drew Gibson", "gravatar_hash": "dc5e4e4387374e20efffa31eb7608ef9", "author_url": null, "date": "Mar 06, 2009", "message": "I made no assertion that you are concerned about fairy tale accusations.\n\nYour other question to me doesn't even merit a reply.  Here we see the true nature of your intent - you sir / madam, are a troll, with no other goal than to suck others into a flamewar for the hell of it."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@Drew: You stated I should should be 'apoplectic about the negative image being portrayed on SO'. \n\nI am telling you that you are wrong, since I have never once in my life worried about false statements made on the internet.\n\nYou jumped in this argument. I am not /trying/ to draw you in or anything else. You are a free man with free will. You had a choice to not reply and to not be involved. You chose to get involved.\n\nYour comments add nothing that might help the community reach a resolution, and their only purpose seems to be to be for a reaction.\n\nOTOH, I have no concern about whether you reply (react) or not. I would actually rather you didn't since you only add to the noise here."}, {"author_name": "Pesto", "gravatar_hash": "350bd142172dc399ef6928001591544a", "author_url": null, "date": "Mar 06, 2009", "message": "I find it fascinating that there can be such vociferous debate on such a minor issue.  That this happens time and time again on the Internet makes me wonder if we are subconsciously railing against the homogenizing effect of a universal medium.  *contemplative stroking of chin*\n\nWith that said, let me take a moment to be anti-homogenization.  On the practical front, I think merely removing salutations isn't going far enough.  I believe a brief overview of the question ought to be the first thing in order to improve the previews in listings.  Take, for example, this one: http://stackoverflow.com/questions/618570/problem-with-tab-selecting-in-jquery  In that example, the preview on listing is \"Hello all, (sorry for the seccond post, something went wrong in the first one!) I have the following problem: I want to create a webpage in which I can use the JQuey tabs both b … \"  This provides almost no information about the question.  What good, then, is the preview?\n\nI'm also opposed to salutations on a more stylistic level.  They strike me as terribly sophomoric; they remind me of the way my wife's 8th grade students write essays.  \"Hi!  My name is X and I have a problem.  Here is my problem: .  Thanks for your help!  Your friend, X\"  That's an awful signal-to-noise ratio when compared to \"\".  Granted, I'm not a machine and I fully capable of ignoring all that cruft.  But by the same token, shouldn't all of you be just as capable of assuming that the question-asker is appreciative of your help and that (s)he wishes you a good day if all that cruft is taken away?\n\nAt the end of the day, I really don't care either way.  My life will be no better or worse regardless of the outcome.  But if we're breaking out our opinions and complaints, then you'd better believe I'm on board.  And my opinion is that this is a technical site, not a support group for sufferers of autism spectrum disorders, not a forum, and not a cultural exchange."}, {"author_name": "belgariontheking", "gravatar_hash": "2a2f9018942bf8e582faff47eb169fdf", "author_url": null, "date": "Mar 06, 2009", "message": "Wow, the amount that you people are willing to write just to disagree with Rich is astounding, but you're still wrong from the start.  You may have a logical line of reasoning, but it starts from pure bullshit.\n\nNoone wants to rape anybody.  Nobody wants to ban anybody.  We just want to fix your poor spelling and English.  What about that do you not understand?\n\nThis website is not important enough to flame on into the night over.  Think of it like work.  Once you leave, it's behind you, and you can to OTHER THINGS until the morning.  Posting in the comments late into the night just proves how butthurt you are over simple, helpful edits.\n\nAs far as the avatar, yes it is hilarious.  As far as the company, he owns that company, and is its sole employee AFAIK."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "/me waits for the inevitable XKCD link."}, {"author_name": "Drew Gibson", "gravatar_hash": "dc5e4e4387374e20efffa31eb7608ef9", "author_url": null, "date": "Mar 06, 2009", "message": "\"@Drew: You stated I should should be ‘apoplectic about the negative image being portrayed on SO’.\" No I didn't, you'll need to read what I wrote.\n\n\"You jumped in this argument.\"  Not really, since the argument is around the editing of posts, and as you suggest, I didn't comment on that.  I'm merely forwarding my belief that you are trolling, and quite successfully, and by doing so, possibly pointing out to others that they may be indulging you in your little flamefest.\n\n\"I would actually rather you didn’t since you only add to the noise here.\"  Typical troll behaviour - trying to suck me in yet again.\n\nI replied to this thread after I came into it quite late, and have read the thread from start to end without being involved.  The fact is that as far as I can see, your behaviours are consistent with you trolling - either you are or you aren't and I care neither way.  If your intent is to troll, well done.  If not, then a gentle word of advice would be to consider what you are writing before you type in that Captcha and click 'submit'.\n\nBut don't worry, I have work to do, so I'll stop adding to the noise now :)  And hey... that way, you get the last word !"}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@pesto: I agree about your example, and I have edited it in my standard fashion. \n\nI am sure certain people won't want to, but it should certainly become an example of a normal 'Rich B edit'. This is what I look for, and this is what I edit. My edits cannot always be perfect, but I find it hard to imagine how anyone cannot see the difference in the before and after of that post."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@Drew: \"No I didn’t, you’ll need to read what I wrote.\" I did, and that is what it said. Since I know the circumstances better than you, I think I know better what that sentence means in context.\n\nYou can write me off as a troll, but remember that I did not start this discussion, nor did I cast any first stone, nor am I continuing to attack anyone else. I do have a right to defend myself against deceitful accusations in public record though."}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Mar 06, 2009", "message": "Hi,\n\nIt's just taken my about an hour to read through the above discussion and will probably take me another few hours to read the below discussion and I've asked myself:\n\n\"Why am I bothering to read through what seems to be an argument between Richard Burgess and the rest of the Stack Overflow community?\"\n\n\nIt's because we care for Stack Overflow!\n\n\nI'm happy to admit, as a man, that I did partake in some of these rollback wars and that I was wrong to do it. \n\nNot because my reasoning was wrong, but because I was damaging the image of Stack Overflow.\n\nInstead of further slander, I would like to offer to Jeff and the rest of the team some suggestions to help combat edit wars and unnecessary edit:\n\n- Increase the amount of Reputation required to edit post.\n- Remove the rollback feature, only allow edits.\n- Fine users who activate the question cool down feature.\n\nAnd finally, I would like the Stack Overflow team to Seriously consider banning Richard Burgess: Rich B.\n\nIt’s not the first time he has been banned from a tech site for trolling and generally being rude to the community:\n\nhttp://forums.thedailywtf.com/forums/p/9618/176576.aspx\n\nThank you"}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 06, 2009", "message": "XKCD's Law: As any internet discussion gets longer, the probability of linking an XKCD comic approaches one.\n\nAnd now to prove it: http://xkcd.com/386/"}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Mar 06, 2009", "message": "@George\n\nOne of my favourites! I have it stuck on my office wall :)\n\nSte"}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Mar 06, 2009", "message": "Rich B disagrees! Ban him! Pitchforks and torches at dusk!\n\nI lost count of how many times this discussion has jumped the shark."}, {"author_name": "TheTXI", "gravatar_hash": "0ee8a78594e3680a280f7b74741cbfb9", "author_url": null, "date": "Mar 06, 2009", "message": "We can bind him and drag him behind a pony in the town square!"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 06, 2009", "message": "Onward!"}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 06, 2009", "message": "@Gatekiller, it's one of my favorites as well. I was hoping Jeff and company would link it whenever a thread hit 'locked' mode.  \n\nRegarding your proposal to ban RichB.  I'm not really sure that can be done without also banning me as well.  If anything, I'm not only guilty of removing trivialities from posts, but also re-writing them from passive to active voice; and am most certainly guilty of requesting that a user explain their rollback. \n\nIs RichB 'harsh' in his language? Absolutely, but I haven't yet found an instance where he was *wrong*.  He won't win the 'nicest guy of the year' award by any means; but he isn't incorrect. \n\nI handle RichB just fine: Instead of looking at the words he writes, I look at his edits. if I can't justify them, I roll them back or edit them further. I don't associate that with his words: there's no need to.  I think people in this blog post are getting too caught up in the personal of RichB and not his actual edits.  For JAPF (Just another Programmer Forum), smilies, salutations, and taglines are fine: For a community editable Q&amp;A site? Not so much. Regardless of the 'personality' it adds, it's simply fluff that the guy searching for your question on Google doesn't care about.  \n\nI guess that is what it boils down to. On this site, I don't care if you're grateful, I don't care if you're cute with your words. All I care about is a clear and concise explanation of what's wrong, and the question you have regarding that.  Everything else is superfluous to a Search engine, and is superfluous to me as well."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 06, 2009", "message": "@Eddie: It's not the majority of edits. It's the majority of Rich B's edits, which consist of mainly removing \"Hi!\" from the beginning. His justification of which is that it clutters the bylines. But he'll also remove \"Cheers\" from the end, with no justification. He's had one edit where the only change he's made is to change a period into a question mark.\n\nAs I've asked multiple times: Is this really necessary?\n\nI've pointed to specific examples, but he never tries to actually justify his edits. He just makes a pithy remark at my expense. But he never engages in ad hominem. Well, except when he does.\n\n@Rich B: You keep saying you understand and that such is reasonable (unless I'm the one asking that is), but you never change your behavior. So clearly you don't.\n\n\nBTW, wasn't participating last night because I went out of town to watch a midnight showing of Watchmen with a friend."}, {"author_name": "Pesto", "gravatar_hash": "350bd142172dc399ef6928001591544a", "author_url": null, "date": "Mar 06, 2009", "message": "I find that the rep system has some similarities to the Peter Principle, in that we assume that because somebody has knowledgeable answers about, say, C#'s list implementation (or simply enough time to provide hundreds of marginal answers), this somehow empowers them as an editor, a moderator, and an organizer.  I'm not judging Rich B or anyone else in particular, but clearly there isn't any evidence to support that somebody who makes a good question answerer also makes a good editor.\n\n@toast: Though it may be petty or tedious to change a period into a question mark, it's not your time Rich B is wasting; it's his own.  And really, is changing a period into a question mark actually unnecessary?  Heaven forbid we should encourage proper grammar.\n\nAlso -- not that I necessarily value your opinion -- was Watchmen any good?  I'm getting trepidatious about it."}, {"author_name": "Eric", "gravatar_hash": "ad00086684fbe3e0dca19a866408b84d", "author_url": "http://ericdotnet.wordpress.com", "date": "Mar 06, 2009", "message": "Someone kept editing one of my questions on stackoverflow, changing the tags. Not only were they not appropriate in my view, but he kept doing it as soon as I changed them back.\n\nHighly annoying ! As long as it's grammar or other similar changes I think it's ok, but that's about it."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 06, 2009", "message": "@Eric: \n\nRetagging is a common practice on StackOverflow. Unless you have a specific example to show us, we can't really say whether or not there was any abuse."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@Eric: Show us the post you are referring to so we can see these 'inappropriate' tags. That is the only way we can help you."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@GateKiller: I like your logic. Not a single valid case of abuse has been shown about me, so I should be banned.\n\nYou, on the other hand, admit to abusing, have been consistently abusive in your rollbacks and edits, and have even had your posts locked by admins because of this abuse.\n\nYou are still partaking in this abuse despite the obvious community opinion that disagree with your edits, and the OP not even agreeing with you apparently:\n\nhttp://stackoverflow.com/revisions/560329/list\n\nSo yes, I like your logic. Ban me. GK is obviously a better contributor to this site."}, {"author_name": "Bruce Banner", "gravatar_hash": "997a33b95a3e1d50021fd682d43779a4", "author_url": null, "date": "Mar 06, 2009", "message": "Just ban RichB. That will be the smartest course of action. \nHe is a troublemaker. Even though his intentions seem to actually improve SO, his ways just do the opposite. \n\nMay the almighty Banhammer fall upon those who ruin the interwebs for everyone else"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 06, 2009", "message": "While we're at it, let's just ban everyone we don't like. \n\nTheTXI's ban list - GateKiller, GregD, Toast, Kev, Hitler, Stalin, Mussolini, Mao, Kim Jong Il, Chris Brown, Kevin Federline, and Taylor Swift."}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Mar 06, 2009", "message": "Lets of some fun stats:\n\n* 25%(76) of comments on this page are by RichB\n* The @ Symbol has been used 196 times\n* I have posted 7 times\n* XKCD has only been referenced 5 times inclusive\n* The word \"shit\" has only been used by Kev and belgariontheking\n* Godwin's Law occured on March 4th, 2009 at 10:39 am\n* Jeff Atwood has responded 3 times"}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Mar 06, 2009", "message": "@George (aka Gortok): well said.  If RichB made the exact edits he does, but defended them differently, I think there's a big chance we wouldn't be having this discussion.\n\n@toast: Yes, editing a single character to change a '.' to '?' is entirely appropriate if it is more grammatically correct.  This is not a simple Q&amp;A site.  If the goal were for the OP to get an answer, and that's it, then there would be little reason to edit posts unless they were very unclear.  However, each question and answer will be read many, many times, long after the OP has benefited from the answer.  Rewriting things in strong, clear English prose is a positive.\n\n@toast: And yes, RichB has attempted to justify removing salutations and signatures.  He has explained why he feels this adds value.  You clearly disagree with him on this, and that's OK.  We don't all have to agree.  But that doesn't mean he hasn't tried to explain himself. And I get your point that Jeff Atwood explicitly said, way above, that just removing \"hi\" and \"cheers\" is generally not justification for an edit.\n\nOn the other hand, I agree and take to heart what @nobody said, above.  This is not a pure wiki.  The OP's name is associated with the post and we don't want to put words into that person's mouth that don't fit.  I try, in my edits, to always respect the tone and character of the OP, even when I change passive to active voice and make other large editorial changes.\n\n@all:  I've tried three times now to start a *productive* discussion on solving the problem by reaching a community consensus.  RichB agrees with my proposal and the anti-RichB crowd has so far entirely ignored my suggestions.  Do we need a \"RichB sux\" page so you can vent all of your spleen, or are you just not interested in solving this conflict?  Banning any one user will not solve this problem. Nor will simple limit changes, unfortunately.  Perhaps meta-moderation tools are needed.  I definitely agree that it's a good idea to penalize (-10 rep? -20 rep? Loss of edit priv for 1 day?) *anyone* who is not the OP who causes a rollback/edit cooldown period by doing *many* (not just one) edits/rollbacks.  And if the OP insists on being incorrect or unreadable ... oh well.  They will then contribute more to \"noise\" than to \"signal.\"  We can't fix every problem.\n\nAnd hey, my captcha phrase was \"tempers\" plus some digits and stuff.  Pretty funny."}, {"author_name": "Pesto", "gravatar_hash": "350bd142172dc399ef6928001591544a", "author_url": null, "date": "Mar 06, 2009", "message": "@Stephen Hill: Shit, I was going to use the word \"shit\" earlier, but I took it out.  I didn't realize there was going to be someone counting shits, otherwise I'd have spread shit all over my posts!"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 06, 2009", "message": "How can you have a list of fun states without listing how many pony references?"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 06, 2009", "message": "Stats...shutup!"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@eddie: I could set up a site about me like I setup for this guy:\n\nhttp://www.thestupidestmanonearth.com\n\nI have no problem with people using me as a punching bag. I bet it would be very entertaining. If only I thought that would quench the blood thirst of the lynch mob..."}, {"author_name": "GregD", "gravatar_hash": "ff50e3e60a54cff46de589d03b031657", "author_url": null, "date": "Mar 06, 2009", "message": "@eddie I appreciate your attempts at trying to make this productive.  For what it's worth, I have not and am not advocating for the banning of anyone.\n\nMy belief is that the spirit of editing is to edit egregious things:  adding dupe links when a question is a dupe, removing argumentative statements after giving the OP a chance to remove them.\n\nTo those with editing powers, please just remember that that is some great power.  With that great power comes a responsibility to act professionally.  All I ask is if you're going to edit something, pause for a moment to reflect on if it's really necessary.\n\nSO is a new community.  There isn't a reason to force it into a particular funnel just yet."}, {"author_name": "belgariontheking", "gravatar_hash": "2a2f9018942bf8e582faff47eb169fdf", "author_url": null, "date": "Mar 06, 2009", "message": "Damn straight, shitter!"}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 06, 2009", "message": "Hi,\n\n@GateKiller - you also missed all the other naughty words I used.\n\n@TheTXI - yep, once I get done with this post I'm off to polish my jack boots, drown a bag of kittens, shoot some ponies and roll back all your edits. Mwaah, mwaa I'm so evil.\n\nI think we need a new badge on SO especially for RichB - the \"Hubris Syndrome\" badge.\n\n\n\n;)\n\n\nLuv\nKev"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 06, 2009", "message": "Only if we can also have a \"Big Blubbering Vagina of a Crybaby\" badge as well."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Mar 06, 2009", "message": "Hey, come on, make fun of the guy with ridiculous hair and beard.\n\nI'll be your Lightning Rod of Hate."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 06, 2009", "message": "Hi,\n\n@TheTXI - \"Big Blubbering Vagina of a Crybaby\" - woo, I see you've been to the same school of internet trolling as RichB, call everyone crybabies when you've reached the limit of your ability to debate sensibly. The inclusion of the 'vagina' was a creative addition though, but have you ever seen a vagina in real life? Looks nothing like a crybaby, also did you know that babies come from vaginas? \n\n:)\n\nLuv\nKev"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@kev: Why do you continue to troll this discussion? So far you haven't provided anything to the discussion. \n\nYou are just noise. The saddest part is that you are the only one who seems to not understand that."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 06, 2009", "message": "Hi,\n\n@RichB - \"far you haven’t provided anything to the discussion.\" - seeing as you're a stickler for fact and accuracy, prove it....\n\nKev"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Mar 06, 2009", "message": "Hey Rich B?  Don't you know the rule for dealing with trolls?  Just checking."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@Jon Ericson: Indeed I do. I have been ignoring toast for a long time after all..."}, {"author_name": "Jordan", "gravatar_hash": "7c2c75e70c1d5fcdaf847bc28fba9ce6", "author_url": null, "date": "Mar 06, 2009", "message": "This discussion is ridiculous. The trolls have won this time. Good work fellows!"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 06, 2009", "message": "@Jordan:\n\nWho are the trolls?"}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": null, "date": "Mar 06, 2009", "message": "@TheTXI: Sorry, you responded to name-calling with your own name-calling. That makes you one of them.\n\nBut I don't think anyone has been actually disagreeing with each other for quite a while, have they?"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@mmyers: It has been said, and I believe it is accurate, that I have stated a few times that I agree with the ideas Jeff and Eddie and others (sorry if I forget who) have suggested. \n\nThe opposing side does not seem to be ok with agreeing so far, and they want my head on a stick because I have edited a few posts and taken out 'Hi'.\n\nThey have to agree to stop this nonsense and move on before the community can truly move forward.\n\n\nAlso, I just have to mention that if you believe TheTXI is a troll for returning insults, then you do not understand what 'troll' means. Sorry."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 06, 2009", "message": "I cannot be a troll because I like ponies."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "Indeed, trolls typically eat ponies."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 06, 2009", "message": "That would make me cry."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": null, "date": "Mar 06, 2009", "message": "@Rich B: \"It has been said, and I believe it is accurate, that I have stated a few times that I agree with the ideas Jeff and Eddie and others (sorry if I forget who) have suggested. \n\n\"The opposing side does not seem to be ok with agreeing so far, and they want my head on a stick because I have edited a few posts and taken out ‘Hi’.\"\n\nEarlier, you also said: \"I agree completely with not making these edits alone, and this is a rare occurrence for me and other editors in my experience.\"\n\nI think as long as it is a rare occurrence, people will be fine with it. I also think that the definition of \"rare\" is somewhat debatable.\n\nAnd I am happy to see that for whatever reason, there haven't been any major wars this week, only a couple of minor ones. And no, I don't really want you to explain why. I don't care why.\n\n\n\"Also, I just have to mention that if you believe TheTXI is a troll for returning insults, then you do not understand what ‘troll’ means. Sorry.\"\n\nWikipedia says: \"An Internet troll, or simply troll in Internet slang, is someone who posts controversial, inflammatory, irrelevant or off-topic messages in an online community, such as an online discussion forum or chat room, with the intention of provoking other users into an emotional response or to generally disrupt normal on-topic discussion.\"\n\nYou're right, I had it wrong. (It probably wouldn't do any good to point out that you've called people trolls for arguing with your edits, would it?)"}, {"author_name": "Jordan", "gravatar_hash": "7c2c75e70c1d5fcdaf847bc28fba9ce6", "author_url": null, "date": "Mar 06, 2009", "message": "@TheTxi: trolls like ponies and bunnies. Do you like bunnies. Oh crap! I'm feeding a troll now."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@mmyers: It doesn't matter if it is rare or not. Those edits are not 'abuse'. They are not preferred, not desirable on their own, and I have agreed to pay attention to this fact in the future.\n\nI say it doesn't matter, because there should not be anyone paying /that much/ attention to these edits. If the OP has an issue with it, we can deal with that. I would likely never even see if he complained or rolled back anyway. But usually a nice explanation of why we make the edits we do is sufficient.\n\nThat being said, under /no/ circumstance should another user roll back an edit that was not abusive and did not harm the question or the poster. If you are not the OP, you have /no/ right in defending things through roll backs like when 'hi' is taken out. If you feel an edit was made that hurt the question, and maybe the editor didn't realize it, edit it back in there or mention it to someone. No one is perfect, I am certainly not. Mistakes happen.\n\nBut the issue right now is basically that we have a small subset of apparently emotionally charged users following me around and trying to incite riots about any edit I make. They have yet to actually prove one case of abuse, and I have fielded every complaint and provided justification for each time. I shouldn't have to do this. It has gotten so bad recently that these people have taken to posting every little disagreement here, on UV or emailing it to the SO team.\n\nThat wastes everyone's time and truly does not help the community.\n\nI have agreed to my part. Let's hear an agreement that the other people leave their emotions out of the site and stop critiquing edits. If they see a case of malice or abuse, sure, discuss it or let Jeff and Co know about it. But this childish criticism of approved (yes, removing 'Hi' is approved even though it is not desirable to edit on it's own) edits is beyond ridiculous.\n\nWe need that side to agree to this.\n\nAs for me saying trolls? I believe my mentions of trolls and trolling are correct. I don't believe we need to open a new discussion on this here, but I would be happy to debate it out with you on another medium (IRC/IM/email/whatever) where it wont be detrimental to the experience of the other users."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 06, 2009", "message": "Important stuff first -\n@Pesto: Watchmen is largely faithful to the comic book. There is a lot of stuff removed, true. That additional content could make for a more complete movie, also true. But if my biggest complaint is that after 2hr 45min I would like to see more or it, then I really don't have anything negative to say about it.\n\n@Rich B: You say the minority of your edits, but watching your edit history I would have to say you make salutation/really minor title edits about 50%.\nYou and TXI seem to think I have it in for you. I do not. I haven't called for your banning either in earnest or jest. I have called you petty and immature, but I have been tolerating far more abuse for far less from you and your cabal.\nI do believe that for whatever reason you appointed yourself style master of StackOverflow, you do want to make the site better.\nI have been willing to listen and compromise. I have offered suggestions and have been willing to change those suggestions based upon feedback from the other posters in this thread. You have not budged from your stance either in words or actions.\nAll I am asking is you meet me halfway here and leave some of those salutation edits be. There is no reason for the bickering to continue."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": null, "date": "Mar 06, 2009", "message": "@Rich B: \"It doesn’t matter if it is rare or not. Those edits are not ‘abuse’. They are not preferred, not desirable on their own, and I have agreed to pay attention to this fact in the future.\"\n\nWell, I must admit it did bother me when a week or so ago, I suddenly had your name filling almost my entire page, just because a user liked to sign his name. I agree with removing names at the end of posts in general (particularly when making another edit at the same time), but I can see how some people would take that as abuse. That was my first reaction, too. I see now that, as others have said, these questions will be around indefinitely, so useless parts should be removed at _some_ point (and I think almost everyone agrees that signatures are useless in this context). Now, some people don't see it that way. Perhaps you are right and they are wrong (I use \"you\" to mean those of your point of view, not just you). Eventually, it is very likely that either you or they will come around to the other side. I don't think it's worth fighting right now; if indeed your way turns out to be better, it should be apparent eventually.\n\n\"That being said, under /no/ circumstance should another user roll back an edit that was not abusive and did not harm the question or the poster. If you are not the OP, you have /no/ right in defending things through roll backs like when ‘hi’ is taken out. If you feel an edit was made that hurt the question, and maybe the editor didn’t realize it, edit it back in there or mention it to someone. No one is perfect, I am certainly not. Mistakes happen.\"\n\nI quite see your point. However, this gives the advantage to the ones who prefer deleting: you can take things out and make people justify putting them back in, but no one would put things in and make you justify taking them back out (at least I hope not).\n\nAs an example (and I am not in any way trying to guess the makeup of SO):\nPerson A asks a question, gets a quick answer, and leaves. Persons B, C, and D are fine with the \"Hi\" that A began the question with. Person E does not want it, and edits it out. B, C, and D don't like E's removal, but since it's not abuse, they can't justify putting it back in. Now what?\n\nAgain, I am not thinking of particular people or a particular question. I just want to make sure you've thought this through."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Mar 06, 2009", "message": "@toast: If I'm in a question, and I edit it, you can be sure that I'll take out salutations as well as any other changes I make.  Why? Because it's both desirable and convention.  Further, it has been explicitly approved by the site owner.\n\nOne thing detractors of editing forget is that Stack Overflow (to paraphrase the literature) is to become a repository of all useful programming information. That means long after I've forgotten about my questions regarding Listviews in C# that other programmers can dig down and find my questions via Google (or whatever search engine exists at that time).  That means that when it comes down to it, the feel good smilies and salutations ADD NOTHING, and certainly detract from the encyclopedic nature of being a repository for all useful programming information.\n\nIf you have a counter-argument for this point, let's hear it.\n\nCAPTCHA: Rixey $1,022-million (SERIOUSLY? WTF?)"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://stackoverflow.com/questions/539451/are-you-compelled-to-eliminate-syntactic-cruft/539471#539471", "date": "Mar 06, 2009", "message": "I want a pony!  Hell, I want a unicorn that flies.  But I'll settle for a pony, since that was what I was promised.  From the very first Stack Overflow podcast:\n\n\"Spolsky:    So, what we're trying to get here, we could say, a place where you can ask questions, technical questions since we're programmers, and get answers and then get those answers rated and try to have the signal rise to the top and the noise just disappear forever.\"\n\nThere it is.  That's why I'm here in the first place.  I was promised \"the noise [would] just disappear forever\".  There are enough donkeys in the world.  They work great, but they smell funny and look like, well, ass.  If Stack Overflow turns into a donkey, I'm sure you all will keep it working without me.\n\nNow I'm not naive.  I've been involved in enough places where programmers ask and answer questions to know that there will be noise and that it will sometimes rise to the top for a while.  It was not a surprise to see a series of edit wars on Stack Overflow because no matter how good a site is designed, people will come along and mess it up.  You have to train yourself to ignore the noise and not add to it.\n\nSo I'd like to suggest everyone take Rich B at his word that he's not going to fight with an Original Poster who rolls back his edits.  Let's ignore any noise that we may see and focus on what he has agreed to do.  Let's not pick any fights with his changes, but focus on how we can add signal."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@mmyers: It is unfortunate that edits get sent to the front page like that, but I cannot help that. I do recommend not using the front page though, and instead use the new questions tab. You will not experience this issue. When I find a user that happens to need a lot of help throughout his entire history, I try to work on that. That allows me to spend less time searching and more time making more valuable edits to the site. \n\nNaturally people really only notice those edits they don't really like, but tend to ignore all the edits that are more valuable. This is just life I suppose.\n\nFor the most part, I try to make these heavy lists of edits at times when SO is slow, but yes, this can be abrasive to some users sometimes. I try my best to avoid this, but I also feel the actions are necessary.\n\n\n\nIn regards to your example, I would say the question that needs to be asked is \"Was any valuable content removed from the question when 'Hi' was removed?\"\n\nNo? Good, no reason to debate it then. Move along. B,C and D should not rollback, and should instead consider spending their time looking for other ways to contribute to the editing of that post and not dwelling on whether they agree with 'Hi' or not.\n\nPeople are making this into a much larger issue than it should ever be."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": null, "date": "Mar 06, 2009", "message": "@George: \"If I’m in a question, and I edit it, you can be sure that I’ll take out salutations as well as any other changes I make. Why? Because it’s both desirable and convention. Further, it has been explicitly approved by the site owner.\"\n\nI think he was arguing against removing salutations as the _only_ change. This actually doesn't happen that much, but it has happened enough for people to notice.\n\n\"One thing detractors of editing forget is that Stack Overflow (to paraphrase the literature) is to become a repository of all useful programming information. That means long after I’ve forgotten about my questions regarding Listviews in C# that other programmers can dig down and find my questions via Google (or whatever search engine exists at that time). That means that when it comes down to it, the feel good smilies and salutations ADD NOTHING, and certainly detract from the encyclopedic nature of being a repository for all useful programming information.\"\n\nAs I said to Rich B: \"Eventually, it is very likely that either you or they will come around to the other side. I don’t think it’s worth fighting right now; if indeed your way turns out to be better, it should be apparent eventually.\"\n\nBTW, it does annoy me a tiny bit when people use smilies on SO. But I'm not about to go though all of Jon Skeet's old posts and remove them. (He's obviously not the only one who uses them, just the most noticeable.)"}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 06, 2009", "message": "Hi,\n\n@RichB - \"They are not preferred, not desirable on their own, and I have agreed to pay attention to this fact in the future.\" - yay, on first glance it looked as common sense had prevailed and you'd embraced the virtue of magnanimity.\n\nBut then - FAIL! - \"If you are not the OP, you have /no/ right in defending things through roll backs like when ‘hi’ is taken out\" - so your position hasn't actually changed. According to the Law of RichB there shall be no Hi's and those that put them back will be sent to the naughty step with no tea.\n\n\"But the issue right now is basically that we have a small subset of apparently emotionally charged users following me around and trying to incite riots about any edit I make\" - RichB, you're not that important. Yeah I've knocked back a couple of edits in the last 24hrs to re-instate 'Hi', but more out of curiosity to see what you or your gang would do next. Get off your high horse my friend, you're not important enough to warrant the center of attention now other than being a curiosity and an exemplary scholar of the ad hominem argument.\n\n\"Let’s hear an agreement that the other people leave their emotions out of the site \" - Emotions, emotions, emotions - why do you always weasel word the debate back to emotions, don't you have any better arguments that trying to blame all the wrong in the world on emotions? This has nothing at all to do with emotions. It's all about trying to educate a young man that it's ok to be wrong and to let things go. Judging by your DailyWTF posts and subsequent suspension you clearly don't or won't get it, but it's worth a try and it's a slow day at work.\n\n\"...and stop critiquing edits.\" - why? That's why we have comments, nothing wrong with a bit of friendly advice as to why an edit was ill judged, and I mean friendly and polite. I've had a couple in the past (not that I've done much editing other than to fix typos and grammar) and happily accepted the error of my ways, easy really.\n\n@toast - \"I do believe that for whatever reason you appointed yourself style master of StackOverflow, you do want to make the site better.\" - I agree, heart in right place, manner of execution - FAIL.\n\nHave a nice weekend y'all.\nKev"}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 06, 2009", "message": "@George: (Gortek on the StackOverflow right?) If you are doing several grammar/spelling/markdown edits that's fine, do that extra bit if you feel it should go. But sitting on the main page, watching questions roll in and editing to remove \"Hi\" and a couple of line breaks is a bit obsessive.\n\nI've gone ahead and looked at his recent edit history, and I've tried to demonstrate good faith by posting comments where I agree with what he did. While looking, I've noticed that he hasn't done much in the way of micro editing, most of the edits are 100 character plus, and I'm going to assume he's not doing something as banal as just removing a trailing \"Thanks, Bob Dole\" from the posts."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@Jon: How about we change:\n\n\"Let’s ignore any noise that we may see and focus on what he has agreed to do.\"\n\nTo:\n\n\"Let’s ignore any noise that we may see and stop watching everything RichB does.\"\n\nAfter all, blatant abuse will stand out and get reported like it should. There is no reason anyone needs to be acting as the 'Rich B police' (to borrow terminology from some of my fan club).\n\nMove on with your lives, I am not worth your time and frustration. I certainly don't get bothered by this stuff. The only people losing out here are the people I could be help on SO right now instead of defending myself here."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@mmyers: I hadn't noticed Jon Skeet's use of smilies. \n\nLooks like I have some work to do tonight..."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": null, "date": "Mar 06, 2009", "message": "@Jon Ericson: \"So I’d like to suggest everyone take Rich B at his word that he’s not going to fight with an Original Poster who rolls back his edits. Let’s ignore any noise that we may see and focus on what he has agreed to do. Let’s not pick any fights with his changes, but focus on how we can add signal.\"\n\nIt does seem that there have been no major wars recently. Let's hope it stays that way.\n\n@Rich B: \"In regards to your example, I would say the question that needs to be asked is “Was any valuable content removed from the question when ‘Hi’ was removed?”\"\n\nA counterargument might be, \"Is the word 'Hi' abuse of the site?\"\n\n\"No? Good, no reason to debate it then. Move along. B,C and D should not rollback, and should instead consider spending their time looking for other ways to contribute to the editing of that post and not dwelling on whether they agree with ‘Hi’ or not.\"\n\nThe question is, why do the delete-it editors get to decide the borderline cases? That, I think, has been underlying a lot of this whole deal.\n\n\"I hadn’t noticed Jon Skeet’s use of smilies. \n\nLooks like I have some work to do tonight…\"\n\nWell, if you get struck by lightning, it'll at least make some people happy... ;)"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@Jon: You were right, I no longer need to reply to Kev either. He has clearly lost his grasp of reality. \n\nI do hope however that other people in the community will educate him with why this kind of behavior: \n\n\"yeah I’ve knocked back a couple of edits in the last 24hrs to re-instate ‘Hi’, but more out of curiosity to see what you or your gang would do next.\"\n\nIs just so bad for the community and against the spirit of SO. It is not my place to correct the behaviors and misconceptions of this user, but I hope the community will. We need to move past this kind teenage aggression."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@mmyers: You should probably note that I have stopped quite a bit of my editing lately, which is likely responsible for a lack of ammunition my fan club needs to continue their wars. \n\nAt least that is what I suspect has occurred."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": null, "date": "Mar 06, 2009", "message": "@Rich B: Why is talking *about* him better than talking *to* him, from a feeding-the-troll point of view?"}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 06, 2009", "message": "Oh Hai,\n\n@RichB - I see you have your bag of \"avoid the debate focus on the poster\" catch phrases to throw around as usual -\n\n\"He has clearly lost his grasp of reality.\"\n\"We need to move past this kind teenage aggression.\"\n\nStock stuff from the ad hominem toolbox.\n\n\"You were right, I no longer need to reply to Kev either\" - but you couldn't help having wee indirect dig though. :)\n\n\nKev\nps: the rollbacks were justified though."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 06, 2009", "message": "@Rich B: Yes, when you agree to compromise with us, we will stop arguing. Despite what you think, we are reasonable people."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://stackoverflow.com/questions/539451/are-you-compelled-to-eliminate-syntactic-cruft/539471#539471", "date": "Mar 06, 2009", "message": "@George:  Absolutely.  For the \"long-term repository\" use case, smilies (my fluff of choice) are useless.  20 years from now, they will look as stupid as gold parachute pants.  For any useful question or answer, they will need to go.\n\nBut for a long-term repository to occur, there's got to be another use case: people asking questions and getting answers.  The key word here is \"people\" because you have to have an actual person who needs help or who has solutions to make the site work.\n\nAnd if you have people, your going to have stupid fluff (like smilies).  And no matter what, people like their fluff almost as much, if not more, than getting good questions and answers.  So taking that away the fluff is going to alienate some of the people the site needs to generate a good long-term repository.\n\nMaybe we'll say as a community, \"who needs those losers?  Let them go.\"  That's a valid choice.  But as person who answers more questions than he asks, I probably won't stick around too long.  I like answering a question from an actual human who I know gets something out of the answer.  Taking away their \"Hi\" and \"Thanks\" takes away a bit of what makes them interesting to respond to.  I like being with people who are different than me and I like helping people who need help.\n\nSo I don't have any answers.  Just another data point."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@mmyers: \"A counterargument might be, “Is the word ‘Hi’ abuse of the site?”\"\n\nSee, but that is a misconception. The edits are not being done to edit out 'abuse'. They are simply there to refactor posts and remove noise and such. Therefore there is no need to debate whether 'hi' is abuse or not.\n\nIt is not useful, and does actually take up space in the preview which is a negative point. \n\nIt may not be a OMG NO situation, but it certainly tips the scale for editing it. (With the obvious provision that other edits are done as well, as we have agreed on)\n\n\"Well, if you get struck by lightning, it’ll at least make some people happy… ;)\"\n\nI am not afraid of Jon Skeet. I am not afraid of any rational human being who engaged his mind over emotions."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@mmyers: It was time to agree with Jon about feeding the troll. Now I can ignore said troll."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@Jon: If someone's personality is defined by \"Hi\", \"Thanks\" or \":)\" then that is truly sad.\n\nPersonality should come from the thoughts and insights in their writing. Jokes, wittiness, humor, little comical quips. Those are all valid ways to express yourself in your writing.\n\nIf I remove your \"Hi\", \"Thanks\" or \":)\" and I have removed your personality from that writing, I argue there is a deeper problem. But is not on my (or the community) end."}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Mar 06, 2009", "message": "Well, I'm going to get some work done. I might have a look here at the end of the weekend.\n\n@Rich B: If you haven't got anything to do this weekend, I give you the following link. I hope it will give you much enjoyment.\n\nhttp://www.google.com/search?q=\"hi\"+site:stackoverflow.com/questions/"}, {"author_name": "Pesto", "gravatar_hash": "350bd142172dc399ef6928001591544a", "author_url": null, "date": "Mar 06, 2009", "message": "@Stephen Hill: I'm pretty sure Rich has seen the Google homepage before."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://stackoverflow.com/questions/539451/are-you-compelled-to-eliminate-syntactic-cruft/539471#539471", "date": "Mar 06, 2009", "message": "“Let’s ignore any noise that we may see and stop watching everything RichB does.”\n\nI'm sure you have attracted plenty of attention because of the large number of edits and I certainly think it's a waste of time to \"watching everything\" you do.  \n\nBut you missed my main point: let's ignore all the words you've spewed here that do not add up to real signal and focus on the one thing that means anything beyond this petty fight.  You have agreed to not fight with an OP who rolls back one of your edits.  I had to ignore a lot of junk to pick up on that and I wanted everyone else to see it too.\n\nIt really annoys me when people put words in my mouth, so I'm trying to be careful not to do that to you.  Am I accurate or not?"}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": null, "date": "Mar 06, 2009", "message": "Hi,\n\n@RichB - \"If I remove your “Hi”, “Thanks” or “:)” and I have removed your personality from that writing, I argue there is a deeper problem. But is not on my (or the community) end.\" - no RichB, you miss the point again. Whilst a Hi or a smiley may not in your opinion be a component part of the personality of a poster, it can however alter the tone of a post and break the ice for a new user who's first language is not english or is not proficient at written english. Go back and read my explanation why from last night.\n\nCheers\nKev"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@Jon: I will not rollback if an OP rolls back my edit.\n\nIf I do notice it (would have to be a significant edit, really), I /am/ likely to try and discuss it with the individual, and try to reach a compromise where the OP understands what we do and why we do it.\n\nFor the most part this is what already occurs anyway right now, but I am vowing to put in more effort."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": null, "date": "Mar 06, 2009", "message": "@Rich B: \"See, but that is a misconception. The edits are not being done to edit out ‘abuse’. They are simply there to refactor posts and remove noise and such. Therefore there is no need to debate whether ‘hi’ is abuse or not.\"\n\nThat's my point: posting it in the first place isn't abuse, taking it out isn't abuse, but putting it back in is abuse? As I said, I can see your point, but I'm not sure you have a strong argument.\n\n\"It is not useful, and does actually take up space in the preview which is a negative point.\"\n\nTrue, although a difference of three or four characters isn't that big. I would definitely edit any post beginning with an apology, and I think most others would too.\n\n\"Personality should come from the thoughts and insights in their writing. Jokes, wittiness, humor, little comical quips. Those are all valid ways to express yourself in your writing.\"\n\nHow about politeness? Showing that you were actually brought up by humans and not, say, wildebeests?\n\nI just checked my profile, and I did not say \"Thanks\" on any of my questions. I did, however, use a smiley when I closed a question that was based only on a misunderstanding in the first place (arrrgh! It's such a bad question that I don't want to edit it and get it onto the front page, but now it bothers me to know it's there). I do, however, thank answerers in comments and by voting up. So I do agree that such things are not exactly necessary; however--as I said yesterday--if they want to be polite, and it’s not going to make less information visible on the questions page, why should I stop them?"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://stackoverflow.com/questions/539451/are-you-compelled-to-eliminate-syntactic-cruft/539471#539471", "date": "Mar 06, 2009", "message": "&gt; If someone’s personality is defined by “Hi”, “Thanks” or “:)” then that is truly sad.\n\nLike I said, calling people like me a loser is a valid choice.  \n\nIn this discussion, I have to say I've been warped by a cultural anthropology professor who explained the meaning and purpose of \"style\".  Even those of us who try to avoid being caught up in every trend in fashion are making a statement about ourselves.  And that statement matters.\n\nRemoving \"Hi\" is making a statement.  It is as much a matter of style as using a smiley.  The accepted style of Stack Overflow is to not use those things.  Unlike real life, we can edit the style of others.  I can't force a guy on the street to wear his hat straight.  (At least not without consequences.)  But I can remove your smiley or add it back.  There are implications to our little society.  Maybe they aren't as important as the style implications of a good joke or a clever solution to a problem.  But these little touches of fluff do have implications."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@Jon: I don't agree, but it also has nothing to do with me. Argue this out in a place the community can discuss and vote on this and come to a conclusion. \n\nIn the meantime, I will keep going with what I feel is the consensus on this issue."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@mmyers: I am tired of the argument honestly. You can disagree however you want to. You know my opinion on it, and the community's to this point. \n\nI have agree to only remove this fluff when making other edits as well. That is my end of the compromise.\n\nThe other end is to not rollback/edit war or start arguments/flamewars except for blatant abuse. I do not see anyone agreeing to this end of the compromise yet.\n\nLet's try not to get into the \"what ifs\" here. Let's come to an agreement like gentlemen and move on."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://stackoverflow.com/questions/539451/are-you-compelled-to-eliminate-syntactic-cruft/539471#539471", "date": "Mar 06, 2009", "message": "&gt; The other end is to not rollback/edit war or start arguments/flamewars except for blatant abuse. I do not see anyone agreeing to this end of the compromise yet.\n\nI'd love to agree, but here's the problem.  I don't feel like a start arguments or R/E wars.  And if you took a poll of everyone still reading, I bet you wouldn't find anyone who thinks they start this sort of thing.  So if anyone agrees to that condition, it would mean they have done those things in the past, which nobody thinks they do.\n\nHow flamewars start if nobody starts them is an exercise left for the reader."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": null, "date": "Mar 06, 2009", "message": "@Rich B: \"I have agree to only remove this fluff when making other edits as well. That is my end of the compromise.\"\n\nI'm fine with that, and I think I said so yesterday. I do the same thing, although I don't remove quite as much.\n\n\"Let’s try not to get into the “what ifs” here.\"\n\nI'm just trying to play the \"think it through\" game, honest I am!\n\n\"Let’s come to an agreement like gentlemen and move on.\"\n\nI quite agree. I think most people have already moved out of this thread, though."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@Jon: Rolling back an edit that is not abuse is the start of a rollback war. That is plain, simple and clear."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://stackoverflow.com/questions/539451/are-you-compelled-to-eliminate-syntactic-cruft/539471#539471", "date": "Mar 06, 2009", "message": "&gt; Rolling back an edit that is not abuse is the start of a rollback war. That is plain, simple and clear.\n\nFine.  Now define abuse."}, {"author_name": "toast", "gravatar_hash": "3888f6fb7ec23d2bd1328f95e1836702", "author_url": null, "date": "Mar 06, 2009", "message": "\"I do not ‘dig my heels in’ in principle during small edits contested by the OP\"\n\nhttp://stackoverflow.com/revisions/608034/list\n\nAre you not aware of your own history? There is proof you have engaged in behavior you yourself have described as abusive (fighting with the OP over trivial edits).\n\nYou and your buddies may like to paint me as a troll, stalker, or idiot but unfortunately your actions make such accusations ring hollow."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@Jon: You are really getting too much into this \"Let's try and be deep\" stuff now and it is not productive.\n\nWe have already defined that editing hi, thanks, smilies is not abuse. The rest is irrelevant."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 06, 2009", "message": "This is the song that never ends,\n    it just goes on and on my friends\n    Some people started singing it, not knowing what it was,\n    and they'll continue singing it forever just because..."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@TheTXI: Funny, all I hear is the sound of tiny violins..."}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Mar 06, 2009", "message": "@Rich B\n\n\"The salutation *alone* is not a good reason to edit the post\"\n\nCan I ask why you are still ignoring this rule?\n\nhttp://stackoverflow.com/revisions/611704/list"}, {"author_name": "The great edit nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "@gk: The only edit I see there that was made after the 'rule' that I agreed to is a tag deletion. Are you protesting the tag deletion?\n\nFurthermore, are you making it clear to us all that you are going to continue following me around critiquing every edit I make? I thought we were reaching a compromise here. Are you telling us you are not willing to compromise for the good of the community?\n\nThis is becoming clear to me with your constant false (and lame) accusations and your trolling in edit summaries of my edits.\n\nSo let me ask you point blank so everyone is clear. \n\nIs your intention to work with the compromises laid out here and contribute to the community, or are you going to continue to be a detriment to the community by trolling mid behavior and abusing the system?"}, {"author_name": "The great edit nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 06, 2009", "message": "*-mid \n\nWTF iPhone?"}, {"author_name": "Mike", "gravatar_hash": "8f8ff21a67437febebc70afd19364e95", "author_url": null, "date": "Mar 07, 2009", "message": "It's pretty obvious that “The salutation *alone* is not a good reason to edit the post” is just going to lead to new levels of pedanticness in Rich B's holy crusade to reshape SO in his own image.\n\nEdits in all below revisions made absolutely zero improvements to the questions and were clearly flimsy excuses to remove salutations/thanks/names.\n\n\nhttp://stackoverflow.com/revisions/587303/list\nhttp://stackoverflow.com/revisions/608360/list\nhttp://stackoverflow.com/revisions/608120/list\nhttp://stackoverflow.com/revisions/589521/list\nhttp://stackoverflow.com/revisions/597426/list\nhttp://stackoverflow.com/revisions/596014/list\nhttp://stackoverflow.com/revisions/603235/list\n\nand on and on..."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Mar 09, 2009", "message": "\"Edits in all below revisions made absolutely zero improvements to the questions\"\n\n608120: Correct tag (82 questions with forms-authentication and only 1 with formsauthentication)\n\n603235: Added code indentation\n\nThe rest is grammar and correct application changes with the greeting, salutation removal."}, {"author_name": "The Great Edit Nazi", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 09, 2009", "message": "@Mike: So I guess adding relevant links and correcting spelling and grammar is not OK with you?\n\nNot sure what you want me to say here.\nRemoving the salutation is not abuse. Putting it in is noise though. As long as I improve the post in some other way, everyone agreed removing it was fine.\n\nIf you want to talk about a pedantic waste of time, how about people like you who are paying attention to everything I edit and coming here to whine and complain?\n\nI spend far less time making those edits than it takes you to make these kinds of lame accusations against me."}, {"author_name": "Mike", "gravatar_hash": "87ccafb793538b54df092a3726443581", "author_url": null, "date": "Mar 09, 2009", "message": "Please tell me how upper-casing gimp, or changing a - to : is a correction of spelling or grammar."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 09, 2009", "message": "@Mike: Again, all valid edits to improve the quality of the post."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 09, 2009", "message": "@Mike: Did you somehow miss on the GIMP post that a link was also added?"}, {"author_name": "belgariontheking", "gravatar_hash": "2a2f9018942bf8e582faff47eb169fdf", "author_url": null, "date": "Mar 09, 2009", "message": "@Mike: capitalization is part of spelling, and GIMP is a proper name, therefore it must be capitalized to be spelled correctly and only then will it have a shot at having correct grammar.  Even though the logo for GIMP has lower case letters, the actual name of the product is GIMP."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 09, 2009", "message": "How about two posts where Kev is purposely just trolling and trying to start rollback wars? \n\nhttp://stackoverflow.com/revisions/611704/list\nhttp://stackoverflow.com/revisions/334485/list\n\nAfter all, let's attack the actual problem, not the perceived problem."}, {"author_name": "Jordan", "gravatar_hash": "7c2c75e70c1d5fcdaf847bc28fba9ce6", "author_url": null, "date": "Mar 11, 2009", "message": "Just ban Rich B. \nHe might believe that he is actually helping, but on the contrary he is just a problem. Maybe not as trollish as others, but a problem none the less. \nCut him out, one less problem."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 11, 2009", "message": "@Jordan: \n\nYour useless suggestion to ban someone just for your own personal convenience is more of a problem to the whole of StackOverflow than Rich B."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 11, 2009", "message": "@Jordan: What an insightful, intelligent comment.\n\nLet me catch you up on these comments and the issue in general.\n\nBanning someone would require some kind of abuse to be proven on their part. Otherwise, the site admin banning someone would be a bit foolish, would it not?\n\nEveryone reasonable and intelligent seems to agree to this. In the 300+ comments here, the many UV suggestions, IRC chats and activity on SO, no one has proven a single incident of such 'abuse'.\n\nSo I will give you the same option here that everyone else has received.\n\nShow us this abuse you are claiming to promote banning me. Otherwise, I am sure you will agree that no rational and intelligent person would ban an active member of a community for simply having a few people who disagree with him."}, {"author_name": "Jordan", "gravatar_hash": "7c2c75e70c1d5fcdaf847bc28fba9ce6", "author_url": null, "date": "Mar 11, 2009", "message": "@Rich B: \nI never implied anything about you \"abusing\" anyone or anything. But I know your kind, and you are more trouble than you are worth. And SO will be a better place if you would just go away."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Mar 11, 2009", "message": "@Jordan: 'My kind'?\n\nWhy don't you go ahead and describe that for us?"}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Mar 14, 2009", "message": "After all that has happened, I get the impression that Stack Overflow condone this inappropriate behaviour on the basis that the community will police itself.\n\nReminds me of \"The Lord of the Flies\"."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 14, 2009", "message": "Stephen, a lot of the interaction to deal with this is in private emails."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Mar 16, 2009", "message": "Rich B sometimes reminds me of Piggy except his lack of usefulness in the way of glasses."}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Mar 19, 2009", "message": "Jeff, thanks for clearing that up :)"}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Apr 14, 2009", "message": "I think you guys will be hard pressed to find somebody who hasn't had a run in, or had their post edited by Rich B and Gortov."}]}