{"response": [{"author_name": "Ken", "gravatar_hash": "dcd1fedb721be7dbfc73847c483dc1c7", "author_url": null, "date": "Mar 31, 2009", "message": "thanks for the transparency. we appreciate it."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Mar 31, 2009", "message": "Sounds like that RAID controller has been more trouble than it's worth. Did you ever look into software RAID? You pay a performance penalty, but there's also one fewer point of failure."}, {"author_name": "Robert Accettura", "gravatar_hash": "c660216c96c1b958ac35ef565da27573", "author_url": "http://robert.accettura.com", "date": "Mar 31, 2009", "message": "Another thing to note about Lenovo/IBM rebranded parts is they don't always pick up firmware/driver updates as quick as they should.  While you may have the \"latest\" it may just be a small revision while the \"upstream vendor\" has released a few major releases.\n\nI learned this the hard way with my Thinkpad.  Intel wireless card acting funny.  Lenovo says it was the latest driver, but Intel had a newer version.  The Intel one fixed the disconnect problem I was having.  If I waited for Lenovo I might have had to wait 6 months before they got to that major revision and tested it with all their enterprise products.\n\nCan you always flash a Lenovo/IBM branded product with the upstream vendors firmware or use their drivers?  Depends."}, {"author_name": "PWills", "gravatar_hash": "57dcebe24f9d0359c214d21c8844c849", "author_url": "http://socialcash.com/careers", "date": "Mar 31, 2009", "message": "I think you're missing a key takeaway:\n\n3. Buy an IP KVM as soon as you can afford one.\n\nWe've had good luck with the Belkin OmniView series. For under $1000 you can get a very good 8-port IP KVM.\n\nIn this particular case -- and in many, many others -- an IP KVM would have let you recover in 5 minutes, just by pressing ENTER!"}, {"author_name": "Niyaz", "gravatar_hash": "75bbf2be38dfeec9edc6bdc3b87d3c4f", "author_url": "http://www.diovo.com/", "date": "Mar 31, 2009", "message": "As the traffic levels are going up in SO, I would like to see more frequent backups."}, {"author_name": "Steve", "gravatar_hash": "28fdca798e4129cc895ac8123f0a4fc7", "author_url": null, "date": "Mar 31, 2009", "message": "If you dig through the Changelog for the firmware update, you find this:\n\n\n     - Fixes issue where a \"Memory Retention Failure unflushed cache lost\" \n       message during adapter POST after an unclean shutdown can occur\n\nSeems like the database server may not have shutdown cleanly.  Changelog here: ftp://ftp.software.ibm.com/systems/support/system_x/ibm_fw_aacraid_5.2.0-15427_anyos_32-64.chg"}, {"author_name": "Luke", "gravatar_hash": "4d69df831be32d2e5eddbd7afe1d671c", "author_url": null, "date": "Mar 31, 2009", "message": "Jeff, I just earned a 1000 rep. before the outage. Any changes I can claim that back somehow? :)\n\nGlad it's all up and running again and thanks for sharing such detailed information with us."}, {"author_name": "juliandewit", "gravatar_hash": "c9e315711b5b2d9ec7a27cb5878cb156", "author_url": null, "date": "Mar 31, 2009", "message": "Somehow RAID makes me feel very uncomfortable.\nListening to the podcast only enforced this feeling despite all your positivism about it.\n\nIt should give a more stable system with failover.\nNow they are suggesting you should use a failover system :D\n\nYou said you were a minimalist. RAID solves a certain problem like ASP.NET webforms solves a certain problem. However I have the feeling that ,like webforms, the abstraction is leaky. You run into strange problems that cost way too much of your time."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Mar 31, 2009", "message": "@juliandewit using one site's experience with one set of hardware as an indictment of RAID is silly. RAID is used extensively throughout the industry."}, {"author_name": "Matias", "gravatar_hash": "7a53888c3d36599e2d8d823269126957", "author_url": null, "date": "Mar 31, 2009", "message": "Hilarious post. Thanks for sharing. The government should subsidize driver development.\n\nLet us know if you get that email from the user who spent hours on an answer, posted it and now it's gone and they now want a portion of your ad revenue as a reimbursement for lost time. ;)\n\nLesson: Redundancy always trumps quality. \n\nIt's RAID-o-licious!!!"}, {"author_name": "tweakt", "gravatar_hash": "0b4adc19284ed0751844d610555dc6b2", "author_url": null, "date": "Mar 31, 2009", "message": "Eventually you'll learn that managing your own servers is not worth the effort. Everyone wants a chance to run the show and learn about new stuff. I have a ludicrous amount of hardware in my apartment for that reason, but I'll be the first to admit it's completely impractical.\n\nI completely agree with your reasoning that you want to know what hardware you're running on and have control of it. But that quickly becomes micro-managing and not central to the mission. \n \nI hope you haven't written off services such as Amazon EC2 completely."}, {"author_name": "Razzie", "gravatar_hash": "31b89c12bc0ab3a23c32bf4e8e86764c", "author_url": null, "date": "Mar 31, 2009", "message": "Hmmm, it looks like SO is down again! I hope it's planned this time though..."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Mar 31, 2009", "message": "@Razzie: My guess is that they're switching back over to the original database server.\n\nI've got an in-flight edit I really want to get squirreled away...\n\nJon"}, {"author_name": "Ali B.", "gravatar_hash": "e076cb8dfb81c15933038dc93cb6570a", "author_url": "http://awhitebox.com", "date": "Apr 01, 2009", "message": "It is down today as well. First I got presented with the maintenance message but now all I get is 404.\nHey wait, it just got back up... Wait, the logo is sparkling! :)"}, {"author_name": "Ali B.", "gravatar_hash": "e076cb8dfb81c15933038dc93cb6570a", "author_url": "http://awhitebox.com", "date": "Apr 01, 2009", "message": "Ok. I forgot it's April 1st ;)"}, {"author_name": "Gamecat", "gravatar_hash": "0b4b433679e1fb52f7e2ef4ea492496d", "author_url": null, "date": "Apr 01, 2009", "message": "Thanks for the great work.\n\nAnd nice new addition ;-)."}, {"author_name": "vartec", "gravatar_hash": "0b4fa970be41e2286c39f5b0167e6d9d", "author_url": null, "date": "Apr 01, 2009", "message": "PWill is right about KVM. However, there is no need to buy your own, many hosting companies that have it in the standard package."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Apr 01, 2009", "message": "I'd have to say it fits my own personal Experience with Adaptec. I mean... Most people still love Adaptec for their 2940 and 29160 SCSI Controllers, but that was a decade ago. I found the newer Controllers... Sub-Par.\n\nPersonally, I fell in love with 3ware, but that is on a Linux system where 3ware has an Open Source driver. This one never gave up on me, never let me down, never lied and never hurt me."}, {"author_name": "vartec", "gravatar_hash": "0b4fa970be41e2286c39f5b0167e6d9d", "author_url": null, "date": "Apr 01, 2009", "message": "\\it’s April 1st\\ isn't it still 31.03 in west coast US?"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Apr 01, 2009", "message": "The west coast is always so behind in the times :P"}, {"author_name": "FerranB", "gravatar_hash": "36311f08439ec65a1427a0e78fba6cc1", "author_url": null, "date": "Apr 01, 2009", "message": "About losing data. \n\nHave you database have archiving? With good archiving no data loss is possible."}, {"author_name": "Richard", "gravatar_hash": "6148688f57d27e6d5eb4f5561c82d9ba", "author_url": null, "date": "Apr 01, 2009", "message": "You're aware this happened at almost precisely 000hrs April 1st... was 23:00 31/03/ NZST when it dropped which meant it was 00:00 01/04 in Tonga...... I'm just saying that's all.\n\n\nSeems mighty co-incidental.\n\n....\n\nHah.. now I'm get Server 500 errors trying to post this."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Apr 01, 2009", "message": "To all you Tongan's out there. This was not the April Fool's joke.\n\nNow that's cleared up :)\n\nCaptcha: to foreign"}, {"author_name": "Mehrdad Afshari", "gravatar_hash": "df0bd8a818111607704dab056fcfc091", "author_url": "http://mehrdadafshari.com", "date": "Apr 01, 2009", "message": "Jeff, why don't you set up database mirroring? Have you considered it? http://msdn.microsoft.com/en-us/library/ms188712.aspx\n\nbtw, if you've any questions about it, feel free to ask on http://stackoverflow.com. We'll be ready to close it as not-programming-related. :P"}, {"author_name": "Mehrdad Afshari", "gravatar_hash": "df0bd8a818111607704dab056fcfc091", "author_url": "http://mehrdadafshari.com", "date": "Apr 01, 2009", "message": "Oh, I missed something:\n\n\"This meant downloading the SQL Server **2008** ISO (25 minutes), installing a hotfix and reboot (5 minutes)\"\n\nWeren't SO running on 2005 because of full text search problem you've been having? :)"}, {"author_name": "Quarrelsome", "gravatar_hash": "890b18939e1eae1eecc193478a7c57e9", "author_url": null, "date": "Apr 01, 2009", "message": "LOL @ Cornify. Genuis!"}, {"author_name": "Guy", "gravatar_hash": "aa81a6370a42b90429370bcf2dfad2e8", "author_url": null, "date": "Apr 01, 2009", "message": "DBA rule 101:  Never NEVER NEVER lose data.  Not a single committed transaction.\n\n\nTransaction logs?  On a separate drive(s) from the DATA, outside of the RAID set?\n\nTransaction log backups?  Regularly taken (every 15 mins max) onto a separate drive?\n\nRestore last full backup (in recovery mode)\nRestore and apply backup transaction logs (from the log backups, stay in recovery mode)\nCopy remaining (un-backed-up)transaction logs from drive (pull drive out and reseat it in spare machine) and restore those transactions (and automaticially roll back any uncommitted)\n\nOnly then bring the database online!\n\nAnd you already have learnt to have all the ISO images of the software you need (and have it unpacked) at hand (SQL, OS, Visual Studio) and probably installed on your \"emergency\" machine just so you can get yourself up and running asap.\n\n\nJeff,  you need to get that IT.StackOverflow.com site running ASAP.  This is exactly the kind of situation (and mitigation) \"you\" need to understand.\n\n(I hope this was not an April 1st joke!)"}, {"author_name": "patrick", "gravatar_hash": "b1b336a3a6dbea77275412ed0f46ff4c", "author_url": "http://www.tarent.de", "date": "Apr 01, 2009", "message": "Hi! The \"Stack Overglow\" Icon looks interesting. Altough it may get annoying after some time ;-)"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Apr 01, 2009", "message": "Shouldn't that be \"Hornify\"?  I see unicorns everywhere! :)"}, {"author_name": "hoberto", "gravatar_hash": "3c2ba67b59225900387448a5e5cf235c", "author_url": null, "date": "Apr 01, 2009", "message": "I agree with Guy...never lose data. I personally think that getting the sit up and running again is secondary to making sure the data was all there...\n\nSeems like the only thing that busted was the RAID controller...the disks still had the data from the database intact. I think you guys should have tried to fix that and/or pulled the disks and swapped them into another machine...even as another volume. The MDFs would could have been easily attached to another instance. \n\nGoing forward, get logshipping going."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Apr 01, 2009", "message": "Personally I like Areca RAID controllers. They have some high quality 4/8 port SATA PCI-e x8 controllers.\n\nWhat a lot of people don't do as well is have a backup of your RAID controller handy because they can and do fail. It can be a real problem if your controller dies and the only way to get a new (compatible) one is Ebay because they don't make them anymore."}, {"author_name": "Anthony DeRobertis", "gravatar_hash": "05b48b72766177b3b0a6ff4afdb70790", "author_url": null, "date": "Apr 01, 2009", "message": "First off, are you running with write-cache enabled w/o a battery backup on the RAID card? That's just asking for database corruption should a power failure occur. (And, colos DO sometimes drop the power on you.)\n\nFor RAID10, you really shouldn't lose much performance at all going with software RAID."}, {"author_name": "Marc Gravell", "gravatar_hash": "b4ae7f8b50a2c32287e456394570679e", "author_url": "http://marcgravell.blogspot.com/", "date": "Apr 01, 2009", "message": "Re outage; if only there was a site - something *like* StackOverflow, but more for the IT Pro community; you could ask them what you're doing wrong ;-p"}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Apr 01, 2009", "message": "How much did you save by getting a low end RAID controller and was it worth all the trouble!? I am  very suspicious of a controller that gets frequent BIOS upgrades. Makes me think it's buggy and they are still finding new bugs and fixing them. A rushed release?\n\nI have been using Mylex controllers for years and they are awesome. Mylex is no more so next time when I need a controller I will look at the company that acquired them and see what they offer. I know they are not Adaptec.\n\nSo which higher end controller are you recommending now? \nHow many channels does your current controller have?"}, {"author_name": "Matthew Morgan", "gravatar_hash": "fbd3e5cc0b7dd5648f43d49719d2f4a8", "author_url": null, "date": "Apr 01, 2009", "message": "I can't say I'm a RAID expert, but your observation is exactly the thing I have noticed through the years.  If you don't buy a very nice, expensive RAID controller, it lets you down.\n\nThe RAID controllers that come built in on standard desktop boards are a joke."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Apr 01, 2009", "message": "Progress of a sort. Remember when you used to reboot windows servers every day just to keep them working.\nAll those little problems on startup just take longer to find now."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 01, 2009", "message": "@mgb: If you had to reboot you Windows servers 'once a day' you were doing something /drastically/ wrong.\n\nGlad I don't run your code on my machines..."}, {"author_name": "Frank Krueger", "gravatar_hash": "3eef89c1710742937cc74bf88da9dff8", "author_url": null, "date": "Apr 01, 2009", "message": "As I am just a lowly programmer, this (yes, anecdotal) evidence has me wondering why have RAID at all?\n\nIf I follow @Guy's advice of having warm-backups ready to go, then why should I torture myself with random RAID failures. I would much rather deal with the simpler hard drive failure. All of this reminds me of the \"End to End Argument\" in communication design:\n\n&gt; The principle, called the end-to-end argument,\n&gt; suggests that functions placed at low levels of a\n&gt; system may be redundant or of little\n&gt; value when compared with the cost of providing\n&gt; them at that low level.\n\nConsumer-grade RAID has always been garbage (in my experience). It sickens me to think that server-grade RAID (as sold by Lenovo) is just as shotty."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 01, 2009", "message": "I have to agree with Guy.  (But hopefully the lesson has been learned.)\n\nRAID is great.  Being able to swap out the drives, which have moving parts and fail a lot, is a necessity. But you really need redundant controllers as well.  They are pretty much black boxes and when they fail you need to have another on to take its place.  On our project, we go so far as to buy multiple RAID systems when possible.\n\nThe key is to understand that all hardware fails eventually and the more gear you have the more likely you are to have something fail at any given moment.  That's one of the reasons our project uses clusters of relatively cheap computers: it's easier to fight through hardware failure.  Our single point of failure is the building power, which we could avoid if we co-located.\n\nOn the other hand, Stack Overflow has not had as much downtime as might be imagined for a new site.  Here's hoping this sort of update is rare!"}, {"author_name": "Adam", "gravatar_hash": "4f1066d8284a52647e2c1c17ed3a9775", "author_url": "http://www.varud.com", "date": "Apr 01, 2009", "message": "You guys really need to check out Amazon EC2.  Granted, you'll simply get new problems, but every possible action dealing with the servers can be done remotely (i.e. console access, etc...).  \n\nOnce you go cloud you'll never go back - seriously.\n\n(before flames roll in, I'm only talking about using cloud services for Internet services, not internal services like file sharing, etc...)"}, {"author_name": "rism", "gravatar_hash": "6148688f57d27e6d5eb4f5561c82d9ba", "author_url": null, "date": "Apr 02, 2009", "message": "Well i don't remember paying for any of this so keep up the good work. A couple of hours downtime when you've been riding a rocket ship for the last 4 months is not too shabby.\n\nYou guys are smart. You'll learn some stuff, make some alterations and further the process.\n\nI don't know anything useful about RAID but some of the comments surprise. I would have thought competition would have forced these vendors to up their game if things are that hairy.\n\n2am with a new baby - it's not like you would have been asleep anyway though right? ;)"}, {"author_name": "Aaron Wetherhold", "gravatar_hash": "efc7a06f93b76251d63dba00ca33debb", "author_url": null, "date": "Apr 03, 2009", "message": "Jeff I've done the same thing before; buy the server, buy the RAID card, and then buy the drives, and I've had the same experience where weird error seem to plague you.\n\nI know you don't want to do this, but seriously consider buying everything at once from Dell, Compaq, or someone else selling an all-in-one server package.  It is well worth the added expense."}, {"author_name": "jivetolkein", "gravatar_hash": "4a267707d948e7ac07223245536fdcd8", "author_url": null, "date": "May 01, 2009", "message": "Hate to break it to you guys, 8K adaptors ARE the luxury option. They are used in IBM x3650s as the upgrade to the onboard, RAID 0 or 1 only adaptor.\n\nWith the (supplied) battery they are actually pretty reliable, we have over 1000 of this type running with no data corruption that I'm aware of, even after involuntary outages.\n\nMain issue with them at the moment is that they take approx. 5 minutes to boot their BIOS and touch their toes etc. it's annoying but not game breaking.\n\nBTW software RAID? On a production system. No No No.\nUnless you're completely skint. It's better than nothing, but just that.\nWhy have RAID at all? Unless you want to duplicate systems, ship transaction logs, mirror frontend serv ers etc. etc. you are at the mercy of 1 disk failure. Disks fail an awful lot. With RAID, your global hot spare (yes, you should have one of these) spins up and you don't even suffer perormance degradation any longer than necessary.. and the co lo engineer can take his time slapping in the new spindle."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 04, 2009", "message": "Update: replacing the SATA hard drives with a brand from a different vendor magically resolved our issues with the ServeRaid. Yay!\n\nI followed up with a Server Fault question on this here:\n\nhttp://serverfault.com/questions/2/do-raid-controllers-commonly-have-sata-drive-brand-compatibility-issues"}, {"author_name": "Ferdinand svehla", "gravatar_hash": "d3374d506ecb4145d399bd9162dd66ce", "author_url": null, "date": "Dec 14, 2009", "message": "jivetolkein: ZFS."}]}