{"response": [{"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": "http://careers.stackoverflow.com/kyle", "date": "Feb 10, 2010", "message": "It's nice to see the podcast returning to a regular schedule. Does this mean we'll get one every 5 days from now on?"}, {"author_name": "dj", "gravatar_hash": "343122a8069d5b94b92ad9c2db012ff8", "author_url": "http://www.orbitalhub.com/", "date": "Feb 10, 2010", "message": "@Jeff: while in NZ, make sure you drive on the wrong side :D"}, {"author_name": "Shaun Finglas", "gravatar_hash": "5fa64738b2b35539637c51e7a098587b", "author_url": null, "date": "Feb 11, 2010", "message": "I wonder who the names that were beeped out were? At first I thought someone swore. \n\nThen I realised what I was listening to."}, {"author_name": "kevtrout", "gravatar_hash": "7a0762465103aec8849fbff171f78acd", "author_url": "http://www.kevtrout.com", "date": "Feb 11, 2010", "message": "Jeff's opinion of email is very self-centered.  I don't mean to call Jeff selfish, I just mean he has a very strong opinion about the state of email that seems to stem only from his personal preference.   \n\nPersonally, twitter has no place in my life.  I don't know enough people on it that makes it worth my time.  I text, email, and call my small network to communicate.  Understanding this, I can declare that I'm not interested in twitter.  I can't declare that twitter is broken.\n\nIt is perfectly understandable that Jeff declare he isn't interested in email.  But to say that it is broken reveals his frame of reference should be expanded to include what millions of others use email for.  \n\nThere may be better tools for some of the uses email represents, but that is up to users and managers to decide.  But to have such a disapproval for it based on his own personal preference is intense."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Feb 11, 2010", "message": "@kevtrout - I agree.  I think Jeff is trying to generalize his own world and has it a bit backwards.  \n\nMost people are not in his or Joel's situation.  \n\nEmail works for me (and I still can't see the point of twitter - at least not in my world)"}, {"author_name": "Sean", "gravatar_hash": "16db4bb794911afb2830e17e6c9d4702", "author_url": "http://buccofever.com", "date": "Feb 11, 2010", "message": "Just provide a slightly different slant on earlier comments, I think Jeff's own perspective, that of an internet celebrity who gets loads of emails from complete strangers every day is what makes email \"broken\" for him.  Most people who use email are not in that situation.  I use email for work, and I use it for personal communication, and it works great for both.  Granted my email inbox for work gets crowded at times, but it's just a matter of spending a few minutes a day to manage the load, that doesn't mean the system is broken.  \n\nTwitter is a nice tool, but its not an email replacement."}, {"author_name": "Bernard", "gravatar_hash": "af29baa43e6e6f77180e631cea686847", "author_url": null, "date": "Feb 11, 2010", "message": "@kevtrout, @Sean - I have to agree. To call email 'fundamentally broken' is a the result of a skewed perspective that is out of touch with most people. Sorry that you're a jaded internet celeb, Jeff! =p\n\nAs a New Zealander, the North Island is where the majority of people live. The South Island is certainly a lot prettier, and I think part of that is certainly the people density factor. \n\nJoel: I live (near) Tauranga, and it's probably not the 'beach resort' you're thinking of. You may be thinking of the Bay of Plenty in general, but most likely you're of somewhere in the Coromandel Peninsula."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 11, 2010", "message": ">  I think Jeff’s own perspective, that of an internet celebrity who gets loads of emails from complete strangers every day is what makes email “broken” for him\n\nUnfortunately Joel went off on a bit of a rant here that didn't have much to do with my point. It takes almost no volume at all to become problematic.\n\nSee this:\nhttp://tantek.com/log/2008/02.html\n\n1. Point to point communications do not scale.\n2. Emails tend to be bloated with too many details and different topics.\n\nIn other words, maximize the value of your keystrokes.\n\nhttp://www.codinghorror.com/blog/archives/000854.html\n\nBasically, asking one person a question is kind of a dumb strategy when you could ask THOUSANDS of people the same question with the same amount of effort."}, {"author_name": "Steve Wortham", "gravatar_hash": "7c4d1e4f8701946b8391d009d8d85221", "author_url": "http://regexhero.net/", "date": "Feb 11, 2010", "message": "@Jeff: It sounds like your solution for forgotten OpenID's should work fine.  However, I encountered the same problem and came up with a slightly different solution that solves the forgotten OpenID problem and provides Account Recovery functionality all at the same time.\n\nI described my solution here in case you're interested:\nhttp://regexhero.net/blog/2010/01/using-openid-on-regex-hero.html"}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Feb 11, 2010", "message": "I had a reaction to Jeff's claim that email was a 'dead medium' in a previous podcast, because obviously it's not dead if my email box is anything to go by. \n\nBut it struck me when I was getting exasperated at my brother's struggles to get email working on his iPhone - I said to him it wasn't worth the hassle because I couldn't even remember the last time I sent or received a personal email.\n\nEmail is still the default method of online communication; it's your identity to many organisations; it's increasingly seen as an acceptable way to send official documents and notifications. But it's more like a fax line than a way for people to communicate with each other. Unless they're old of course :)"}, {"author_name": "William Shields", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Feb 11, 2010", "message": "&gt; Basically, asking one person a question is kind of a\n&gt; dumb strategy when you could ask THOUSANDS of people\n&gt; the same question with the same amount of effort.\n\nThat's a good recipe for being ignored. Anyone knows that as soon as you broadcast something, it simply gets ignored by anyone you want to actually read it.\n\nThis can even apply in business emails when you send something to one person or two. Send something to one person and they know it's for them and they have to do something. Send it to 5 and CC another 5 and everyone ignores it."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 11, 2010", "message": "> Send something to one person and they know it’s for them and they have to do something. \n\nThis is just another form of \"eye for an eye\". Soon enough, everyone is blind."}, {"author_name": "I. J. Kennedy", "gravatar_hash": "a983df0a24f8714e0c9850cc7e96aa95", "author_url": null, "date": "Feb 11, 2010", "message": "Even though I'd read Jeff's previous posts on the weaknesses of e-mail, I was shocked when I heard him say that twitter worked better for him than e-mail as his main mode of communication. I can't even imagine how that could be. I suspect that he's \"doing it wrong\" at least a little bit as far as e-mail goes, and surely I'm \"doing it wrong\" with twitter. I can't even figure out how to search for a tweet I got, say two weeks ago, even if I know specific words that were mentioned."}, {"author_name": "Raul Agrait", "gravatar_hash": "a0d10d0fc2e2fc5d37a93d4477f32797", "author_url": "http://careers.stackoverflow.com/raulagrait", "date": "Feb 11, 2010", "message": "No more \\Joel on Software\\ blog posts?!?! Joel casually mentioned that he'd be ending his blog sometime in March, around its ten year anniversary. Has this been publicly announced anywhere else other than the podcast?"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Feb 12, 2010", "message": "Admittedly most of the discussion wasn't about Buzz, but I'd just like to make the point that Buzz isn't really \"built on email\" as claimed. It appears in Gmail, and it *can* use email addresses for addressing (although it doesn't have to). That's not really the same as it being \"built on email\"."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Feb 12, 2010", "message": "Ah man, I totally forgot to come here and start trolling about how I love the podcast.  I need to work on that.  Anyways, Jeff, thanks again for giving me something to listen to for the next hour rather than office banter!"}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://pro.robspages.net", "date": "Feb 12, 2010", "message": "@William Shields: The phenomenon you are referring to is called \"Diffusion of responsibility\" and has been very well documented:  (http://en.wikipedia.org/wiki/Diffusion_of_responsibility). I don't know of any studies on email, twitter or other broadcast communications but would be very interested in seeing if the effect continues.\n\nThe SO family of sites work because the visitors are motivated to answer (rep, recognition, etc.) but what motivates someone to answer a question on my backwater blog or insignificant tweets?"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Feb 12, 2010", "message": "I literally laughed out loud when Joel said: \"I have a secretary that reads me my tweets.\""}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Feb 12, 2010", "message": "I agree that email is broken--and I'm no internet celebrity. The medium works okay for broadcasting: Sending a notification, newsletter, or advertisement where no reply is expected or accepted.\n\nBut, it is terrible for conversing--especially among more than two participants.\n\nEssentially, it takes the snail mail metaphor way too seriously.\n\nThe medium doesn't explicitly link messages in a series together.  Our \"solution\": a terrible, almost incomprehensible long tail of ugliness (RE: RE: FWD: RE:) trailing each message.\n\nOther reasons:\n\n1. It's inherently unsecure.\n2. SPAM makes it unreliable.\n3. Organization (folders / labels / categories) is not standardized.\n4. Ettiquite is not well understood or enforced:\n\na. message length\nb. call to action\nc. style/formatting\nd. subject relevance\ne. letterhead/\"signatures\"\n\nSome mail clients and servers try to address these issues and do it pretty well.  But, they're hacks to try and make a broken system minimally usable."}, {"author_name": "Bill P. Godfrey", "gravatar_hash": "760bfd359153d0682dbe113dc02f81ba", "author_url": "http://billpg.com/", "date": "Feb 12, 2010", "message": "I kinda wish there was a way I could go onto a website I trusted to email me responsibly, click on something, and my mail reader would be automatically told to let anything sent by them (with the correct DomainKeys signature) through without filtering.\n\nMost mailer's already have something link this, but the user interface to maintain the list is horribly disconnected from reality.\n\nWhile we're at it, I'd like a way to send my email address to a website with some sort of authentication attached, so the website knows the address is correct and I consent to its use without having to go through the confirmation step.\n\nYou are the email wish fairy, aren't you? I also want a pony."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Feb 12, 2010", "message": "\"Rep transfusion\" - this was the first time that I've openly laughed out loud whilst listening to the podcast!"}, {"author_name": "Chris-S", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.shrinkrays.net", "date": "Feb 12, 2010", "message": "What type of symbiotic relationship has Stackoverflow got with the people doing the data dumps?"}, {"author_name": "Brian Duffy", "gravatar_hash": "064161830f029b89811c54205ba07766", "author_url": null, "date": "Feb 12, 2010", "message": "Saying that email is broken is ridiculous. We're not robots -- the \"inefficiency\" of point to point communication or the mixing of topics is an artifact of human communication.\n\nEmail is dumb for some use cases. If you are getting thousands of messages a day as part of your job, you are doing something wrong -- you need to delegate or automate. Otherwise, dealing with people is a part of life that needs to be dealt with."}, {"author_name": "Chris S", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.shrinkrays.net", "date": "Feb 12, 2010", "message": "All the Buzz items I've sent so far have appeared in my Sent items, but to no sender"}, {"author_name": "RegDwight", "gravatar_hash": "9e6196f558d30d39ba5c5f1d55865dd3", "author_url": null, "date": "Feb 13, 2010", "message": "\"You just can’t build a stable structure on top of a broken system\".\n\nEvidence to the contrary: TCP/IP.\n\nAnd guess who has blogged about it:\n\n\"Here's the magic part: TCP is built on top of IP. In other words, TCP is obliged to somehow send data reliably using only an unreliable tool.\"\n\nhttp://www.joelonsoftware.com/articles/LeakyAbstractions.html"}, {"author_name": "Ken Jackson", "gravatar_hash": "8314ccf86bd5fe2b258f0b1eaafbfee4", "author_url": null, "date": "Feb 16, 2010", "message": "@Zack, what's a better way of conversing between two parties?  Twitter has every problem you listed.  As does frankly every other mode of communication, including f2f communication."}, {"author_name": "Kartikk", "gravatar_hash": "89f09cb031da3a81fb78e4bcea3673e3", "author_url": null, "date": "Sep 13, 2010", "message": "Unfortunately there are not many \"well structured\" iphone/Android programming courses being offered online. This company is changing this with their Elite Module that teaches iPhone/Android Programming over a 12 week period. The course is offered via Online Video, Weekly Worksheets, PDFs, One-on-One help and access to forums. Aspiring candidates can learn more please visit - http://www.edumobile.org/242-5.html\nIts well worth the money as you get a personal tutor assigned to you who can help you along the way step-by-step. The course is served via weekly videos and worksheets. Strongly recommended as it’s probably the only single comprehensive course out there with live help."}, {"author_name": "torzsmokus", "gravatar_hash": "63203ff36392efdec9d5729154a14358", "author_url": null, "date": "Jan 02, 2011", "message": "weird that nobody mentioned (Google / Apache) Wave although it was invented to address the problems of email. while many consider it a failure, I think it has been the best try out there."}]}