{"response": [{"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Feb 05, 2010", "message": "E-Ink is beautiful when it's static. However, I've looked at Kindle, Nook and Sony and I feel like I'm getting smacked in the face by a large volume of an encyclopedia on every page turn. I find the ugly scramble of pixels to be very jarring. I like the idea of a book reader, but I'd like to see one that shows side-by-side pages. For me, the verdict is still out."}, {"author_name": "Cedric", "gravatar_hash": "767934a648524da57388558217ad9c2d", "author_url": null, "date": "Feb 05, 2010", "message": "Thanks to Apple and the iPad, he price of e-books is going from $9.99 to $13-$15 across all major publishers, how is that a win for consumers?"}, {"author_name": "Duncan", "gravatar_hash": "c705c1d246a9887cbe656dd870a9537a", "author_url": null, "date": "Feb 05, 2010", "message": "It was a bit disrespectful for Jeff to start the discussion on the OS X development environment by trashing it, presumably without experience.\n\nMy CAPTCHA: The buggiest"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 05, 2010", "message": "Duncan, I mostly base that on extended conversations with Rory Blythe and Miguel de Icaza, who have said at some length that the current iPhone dev experience is like stepping back in time to 1985 relative to the current .NET dev experience.\n\nThese are experienced developers who have worked in both environments at length, and whose opinions I trust. Neither are Microsoft sycophants, either -- quite the opposite, in fact.\n\nRefer to podcasts:\n\nhttp://blog.stackoverflow.com/2009/07/podcast-61/\nMiguel, the whole thing\n\nhttp://blog.stackoverflow.com/2009/10/podcast-71/\nRory section"}, {"author_name": "Daniel Jalkut", "gravatar_hash": "2773fb278535f8d2f0c193800a3b8e09", "author_url": "http://www.red-sweater.com/blog/", "date": "Feb 06, 2010", "message": "Hi Jeff, for what it's worth I didn't feel that you were particularly trashing Mac OS X. But even if you were, I can take it :)\n\nIt's interesting that you mention Miguel de Icaza because I saw him speak at the Stack Overflow mini-conference in Boston. As much as I respect his technical prowess, and enjoy his provocative attitude,  I was squirming when he disparaged OS X's developer tools on stage. My impression was \"here's a guy who doesn't understand the tools and is blaming the tools instead of his ignorance.\" He was literally complaining live on stage about things that any experienced Mac developer would take him aside and say, \"you're doing it wrong, try this.\"\n\nSuch is the danger of being incredibly smart in one field or on one platform. It's tempting to make proclamations in other areas where your knowledge may not be as deep.\n\nYou'll probably remember on the podcast that I took care not to disparage Windows or Linux tools because I don't have enough exposure to them to make a fair judgement. While I love the Mac OS X tools and think it's highly likely that I'd find them superior to other platforms, I don't have enough experience with the other platforms to declare them inferior.\n\nDaniel"}, {"author_name": "Duncan", "gravatar_hash": "c705c1d246a9887cbe656dd870a9537a", "author_url": null, "date": "Feb 06, 2010", "message": "Thanks for clarifying.\n\nI think positive feelings about Windows / .NET development can often boil down to 'Goddamn, I really like Visual Studio'. And I agree, it's a pleasure to develop C# with that IDE."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 07, 2010", "message": "> My impression was “here’s a guy who doesn’t understand the tools and is blaming the tools instead of his ignorance.”\n\nReally? Watching people type code in Objective-C demos at DevDays made me want to gouge my eyes out. It wasn't so much the tools, per se, as the primitiveness and verbosity of the language. Really like stepping back in time 10+ years.\n\n(granted, I guess this is part of the tradeoff to get speedy performance on mobile devices like the iPhone / iPad -- a managed code runtime would add at least 5mb to the download size of every app from what I've read.)\n\nStill, even if we discount Miguel as a person who has no idea what he's talking about w/r/t iPhone dev (not sure I agree, but for the sake of argument, let's say I do) -- I gotta go with Rory's opinion on this. He's a smart, smart guy who has deep experience on both sides.\n\nhttp://is.gd/7RIi7\n\nSo when he refers to Objective C as \"a language that left the Nerd Womb suckling a can of New Coke while watching Max Headroom\", I'd have to concur, based on the DevDays demos I saw. It's really primitive stuff."}, {"author_name": "Zeev", "gravatar_hash": "3805947ed52df06e4267250ca27a98b8", "author_url": "https://twitter.com/zeevb", "date": "Feb 07, 2010", "message": "Apple is taking the wrong path with the iPad since it continues the closed architecture of the iPhone. This will hurt developers, consumers and in the long run innovation (as was with the MS monoculture of the 80's and 90's).\nA few noteworthy links:\n\nPaul Graham's post about the App store approval process (written before the iPad was announced):\nhttp://www.paulgraham.com/apple.html\n\nApple iPad will choke innovation, say open internet advocates - http://www.guardian.co.uk/technology/2010/feb/01/apple-ipad-choke-innovation\n\nApple Bans the Word 'Android' From App Store - http://www.pcworld.com/article/188696/apple_bans_the_word_android_from_ap"}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Feb 07, 2010", "message": "\"Apple is taking the wrong path with the iPad since it continues the closed architecture of the iPhone.\"\n\nYeah, that iPhone's worked out real bad for them! Honestly I think that most consumers will be thrilled to finally have a computing device/appliance/whatever you want to call it that just works properly."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Feb 07, 2010", "message": "Furthermore, it's only their own utter cluelessness that is stopping rival manufacturers from coming up with a competing device that has a more liberal policy towards third-party applications."}, {"author_name": "dan", "gravatar_hash": "e058655769d843632955f6b436207bd7", "author_url": null, "date": "Feb 07, 2010", "message": "If I bought an ipad my wife would want to use it for facebook and farmville. Farmville wouldn't work on it (since it's flash) and I'd be in trouble. Unless farmville and other flash games work on it it's hard to sell to the wife."}, {"author_name": "Daniel Jalkut", "gravatar_hash": "2773fb278535f8d2f0c193800a3b8e09", "author_url": "http://www.red-sweater.com/blog/", "date": "Feb 07, 2010", "message": "Jeff - I won't argue that ObjC is primitive, but in many ways that is its greatest advantage. It's the simplest workable dynamic, message-oriented, object-oriented superset of C imaginable.\n\nI agree it's a little verbose.  Most of us get around it a bit by using macro-expanders that make quick work of common idioms. Anyway, I'm a fast typist, and it doesn't slow me down too much.\n\nObjC is a perfect language for Apple because it's a constraints-oriented language. Apple's own success, IMHO, comes from working fastidiously within constraints.\n\nSome people will say ObjC it's unworkable because it's verbose, or doesn't have enough features. Others (myself included) will say \"aha, here's a language that offers enough power to do what I need, and none of the clunky features that might distract or coerce me to bad design.\"\n\nMost people who use Objective-C seriously (and not just because they were forced to, as a secondary language), seem to fall in love with it. There's something to be said for that.\n\nIf I didn't use Objective-C I would probably choose Python or Ruby. Those seem to be the closest kin to Objective-C, even though they are scripting languages."}, {"author_name": "Chopper3", "gravatar_hash": "9607d45c8fedcce07e2abee65fe1f442", "author_url": null, "date": "Feb 08, 2010", "message": "People laughed at and criticised the iPod and the iPhone when they were released - yet they've both gone on to be both hugely profitable and of great benefit to tens of millions of satisfied users -but  you can't please all of the people all of the time.\n\nI'm rather hoping that the iPad succeeds because it will force the paper publishing houses to create digital versions of all their output - this is inevitable but needs the weight of an iPod/iPhone-like device and sales figures to really get them on their feet. I for one relish the day I can keep all of my books/newspapers/magazines etc. in one place, take copies wherever I want, keep them in mint condition forever - if that ties me into one, very good for most people, vendor then it's worth it to me. But then I can be pleased most of the time.\n\nI'm also hoping that the extra money that will hopefully land in the pockets of the free press will allow them to continue in their duty of investigative reporting. Today's digital world robs us of much of this work, leading to newspapers just reporting what everyone else is or printing press-releases as news - would Nixon have been found out in today's world?\n\nAnd in response to Cedric's question \"how is that a win for consumers?\" - sometimes the lowest price isn't a win for consumers - otherwise everyone would eat canned food from costco in their cars. If an extra dollar or so added to each book means that publishers can take risks on less obviously-popular writers or allow writers themselves to make more money then surely that benefits the world of the written word enormously - not everything is 'best' when cheapest - especially art."}, {"author_name": "Stephen Darlington", "gravatar_hash": "de1c8686d474f502849acbf1d19ac4b7", "author_url": "http://www.yummyapp.com/", "date": "Feb 08, 2010", "message": "Would anyone care to elaborate on how Objective-C is \"primitive\"?\n\nComplaints I've seen so far are properties (which I agree are a pain) and the lack of a VM or garbage collection (which is a deliberate design decision). While these may be true, I'm not sure that these warrant the \"primitive\" appellation.\n\nFor what it's worth, I've done more Objective-C development than Java or C#, but I'm a pragmatist and use whatever works."}, {"author_name": "Daniel Sobral", "gravatar_hash": "6d43da5df0e52fc31c55e6a227bb23f4", "author_url": "http://dcsobral.blogspot.com", "date": "Feb 08, 2010", "message": "I don't believe not providing Flash is so much a question of protecting income from the app store as it is a way to ensure application on the iPhone were built _for_ the iPhone, with _no_ portability to other devices.\n\nThat ensures iPhone characteristics are used to the fullest, while, at the same time, increasing the amount of exclusives for the platform. And, of course, protecting the revenue stream from the app store.\n\nAs evidence to this theory, take Java, for instance. Allowing Java applications on the iPhone would not in any way reduce the revenue stream, as it could be easily locked to only run apps signed by the app store. And, yet, and despite the vast amount of existing J2ME applications at the time iPhone was launched, Apple did not make it available then, and it still isn't available now."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 08, 2010", "message": "> If I didn’t use Objective-C I would probably choose Python or Ruby. Those seem to be the closest kin to Objective-C, even though they are scripting languages.\n\nRegardless, Apple built great devices and has done a fantastic job of supporting development on them -- even if curmudgeons like me would continue to argue that Apple is not, historically speaking, a company that is known for its ability to support software developers and ObjC's primitiveness is an example of that.\n\nThe proof, as they say, is in the pudding."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 08, 2010", "message": "> I don’t believe not providing Flash is so much a question of protecting income from the app store as it is a way to ensure application on the iPhone were built _for_ the iPhone, with _no_ portability to other devices.\n\nA fair point -- and this supports the \"bespoke\" model that Apple isn't shy about promoting. Everything must be custom, including your code.\n\nVery, very few companies can get away with that, and it says a lot about the success of the iPhone / iPod Touch that Apple has been able to."}, {"author_name": "Lasse Vågsæther Karlsen", "gravatar_hash": "1b11262da6d1cd26b1b0bc99a2620cee", "author_url": "http://usinglvkblogspot.com/", "date": "Feb 09, 2010", "message": "I felt that you two talked too much compared to having a guest on the show, he hardly got two words in edgewise between the two of you.\n\nJust my 2 cents."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": null, "date": "Feb 09, 2010", "message": "@Lasse Vågsæther Karlsen: I completely agree.\n\n@Jeff &amp; Joel: You had a great guest and neither of you could stop your compulsion to talk non-stop in your stream of consciousness way. This is genuinely amusing when it's just the 2 of you but this time it wasn't and for a bit near the middle I literally forgot you had a guest."}, {"author_name": "John", "gravatar_hash": "a7f4f9dcbbf1d46d660b0a6c98435751", "author_url": "http://johndcook.com/blog", "date": "Feb 10, 2010", "message": "The podcast speculated that Apple isn't supporting Flash in the iPad because they want to discourage Flash.  I heard, and I have no way of confirming this, is that they left out Flash support because the product would be more robust without it, that Apple has long had a hard stability problems with their products and Flash."}, {"author_name": "Tony Di Croce", "gravatar_hash": "fd04cb73de5ffd81321a85c45dc75724", "author_url": null, "date": "Feb 10, 2010", "message": "Wow, I gotta say, I think Jeff and Joel were entirely too nice to Apple on this episode... I really think this closed, limited world of software Apple is creating is NOT a future I want to be a part of... Imagine if Microsoft had to approve all the software you were allowed to install on Windows... Yuck... Sure, this diversity has created some problems... But, it's also created a totally rich environment... Where sometimes do have custom software that is perfectly tuned to them... I don't understand why everyone is OK with what they are doing..."}, {"author_name": "Chris S", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.shrinkrays.net", "date": "Feb 10, 2010", "message": ".NET 4.0 has now got Code Contracts which is equivalent to what Daniel was describing for Apple's performance tools, and has also had Pex for a while: http://www.codeplex.com/Pex \n\nI agree with Tony's point - Apple wants a monopoly and are more cash-hungry than the old arm twisting Microsoft. It's a thinly veiled excuse for their restrictions to masquerade as \"providing a more consistent and rich UI\". If the hardware wasn't so amazingly well engineered they wouldn't get away with any of it."}, {"author_name": "Aberdeen", "gravatar_hash": "dff808f3435eb9c60bae76c97754f9e5", "author_url": "http://www.estateagentsaberdeen.com", "date": "Mar 21, 2011", "message": "I don't think devices like iphones and ipads have the power to deal with flash.There are rumours that it has to do with selling apps as well.\nI rememeber the microsoft vs netscape issue,nuff said."}, {"author_name": "Scott", "gravatar_hash": "e032e43d9fa4f15a8991e91ccb5a55d8", "author_url": "http://www.ticketprocess.com", "date": "Nov 29, 2011", "message": "Android platform runs Flash just fine, I wish apple would just give in!"}]}