{"response": [{"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Feb 20, 2010", "message": "I evidently misread Joel's post. Everywhere he said SO, I read it as SE. I can see where SE could use VC - you've got a product to sell. I don't get where SO can use VC. All you've got to sell there is ad space (which, of course, is not nothing). And I see SO, etc., falling under the umbrella of SE as far as development goes (SO is an instantiation of SE). Maybe I'm just dense."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Feb 20, 2010", "message": "@Dennis: I wondered the same thing too. The SE code was forked from SO, but in the podcast they talk about merging it back at some point, so they will be the same code base eventually."}, {"author_name": "Helena", "gravatar_hash": "1df412bac270d65c4d3381b05781edd4", "author_url": "http://www.wirelesscctvsystem.net/", "date": "Feb 21, 2010", "message": "Technology is pacing too fast. I wonder how everything would fall into it's places."}, {"author_name": "Techboy", "gravatar_hash": "ef52171c0f3d2660411baca982c68561", "author_url": "http://www.starbase24.com", "date": "Feb 21, 2010", "message": "ROFL, I tweeted this https://twitter.com/TechboyUK/status/9431881298 then I was listening to the podcast and you mentioned my Stack Exchange site http://www.starbase24.com :-)\n\nBy the way, it is named Starbase 24 because in the MMORPG game 'Star Trek Online' (which the site is about), Starbase 24 is the first Starbase that all players go to."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Feb 22, 2010", "message": "I laughed my ass off about the Joseph Heller reference - explanation and the comment that Jeff isn't expected to get those jokes."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Feb 22, 2010", "message": "Nice Douglas Coupland reference (the sliding flat food under the door a la Microserfs)!"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Feb 22, 2010", "message": "@I don’t get where SO can use VC.\nSO relies on selling advertising, to sell advertising you need lots of visitors, so you need to advertise, which costs lots of money.\n\nIf you think it's odd that you need a superbowl ad to drive eyeballs to your website which is supposed to replace TV ads as the next new thing - you don't remember the .com boom"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Feb 22, 2010", "message": "I'd interpreted it the same way as Dennis above.  Now I'm confused.  They want to spend money on advertising to collect money from advertising?\n\nThe venture capital must have more to do with promoting Stack Overflow Careers and perhaps also some other such tangentially-related endeavor or two to be announced in the future."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Feb 22, 2010", "message": "I had also assumed the VC money was for SE, not SO.  I am also confused about what the money would be used for and how the VC would get money back.  Other than the high number of visits, what is compelling? \n\nThey've already gotten a business model with the advertising and the jobs thing - I guess we'll wait and see.  \n\nMy opinion is that VCs are better off waiting for Jeff and Joel to come up with a new/different idea to execute.  Both have shown great competency in making good ideas happen.  That is the sort of thing I think VCs like."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Feb 23, 2010", "message": "Is this conundrum really such a matter of rocket surgery? \"Stack Overflow\" as an entity is not just StackOverflow.com the site, it's the development effort behind the Q&amp;A software AND the management behind the \"trilogy\" of fully owned and directly managed sites (SO, SF, SU) AND the related ventures such as careers, jobs, etc. Stack Exchange is fogcreek's hosted \"build your own site using the Stack Overflow Q&amp;A software\" service but this stands in stark contrast to the wholly owned and operated sites that fall within the current trilogy as well as the careers and jobs sites.\n\nNow, there are a lot of details about SO's future that haven't been talked about publicly but I think we can safely say that taking SO.com itself to 100% marketshare in the programming Q&amp;A field is not the entirety of it. I think a few things are obvious:\n\n0. Sales. The mere existence of Stack Exchange isn't going to get the huge number of various individually owned and operated forums out there using phpbb or vbulletin to switch over. It'll take sales people making calls and making deals. Some of this may involve converting companies to Stack Exchange accounts, some of it will have to involve selling shrinkwrapped versions of the SO software. As examples, think about the forum software in use by, say, Toshiba, Seagate, or Lenovo.\n\n1. Expand the Q&amp;A trilogy. Create more wholly owned and operated sites in new fields. Stack Exchange shows the potential here and there obviously isn't any team more familiar with how to grow sites of this sort than the SO team, but there are lots of genres where they don't have the domain knowledge and can't provide that helpful initial injection of core users to kick-start the site. With VC they'll be able to create new sites and bring on outside \"talent\" to manage these sites. Also, Stack Exchange creates a potential channel for them to identify promising sites of this sort that they might buy out and manage directly.\n\nKeep in mind that SO.com manages to keep in the black on ad revenue alone despite the fact that programmers and techies are some of the hardest people to advertise to, the ad revenue on a site with almost any other topic would almost certainly be higher for the same traffic levels.\n\n2. Expand the careers / jobs sites. Jobs listings are a natural complement to any high-traffic, narrow focus site. And the careers site is a disruptive idea that could have a seriously ludicrous amount of growth potential, and also naturally meshes with a karma / achievement oriented tight focus knowledge exchange type site.\n\nIn short, imagine 10s, 100s, 1000s, etc. of different Q&amp;A sites out there using the SO software. On subjects ranging from AV gear, to automotive maintenance, to amateur astronomy, to knitting, to vegetarian cooking. Many of these sites (the professional ones at least) with appropriately targeted jobs and careers sites. All of them funneling licensing, ad, and/or job listing/search revenue into Stack Overflow Inc.\n\nThat's a big proposition, and probably something that will require VC, but the idea that SO software can serve as a foundation for this particular business prospect is enormously sensible.\n\nDo I get some sort of prize for apparently being the only one able to figure out something seemingly so immensely obvious?"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Feb 23, 2010", "message": "Wedge is right. There is especially room for SO Careers to grow. And also a lot of room for expansion into other, non-programming fields.\n\nIt's just a problem of naming and perception. Dennis, kip, mgb, myself, and probably others need to shake this incorrect idea: \"SO is an instantiation of SE\"."}, {"author_name": "B", "gravatar_hash": "28bdd5298558caad2744c8b32ad913c9", "author_url": null, "date": "Feb 23, 2010", "message": "The conclusion is that the naming is confusing in the least. We have:\n\n* stackoverflow.com\n* StackExchange\n* stackoverflow.com llc\n\nIt's quite obvious that Joel means \"stackoverflow.com llc\" (the company that Wedge sees expanding into many self owned Stack Exchange sites) and not \"stackoverflow.com\" (the programming Q &amp; A site) when he says \"Stack Overflow\" in the context of VC funding. Otherwise this doesn't make sense at all."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Feb 23, 2010", "message": "@Wedge,\nUm, no prize.  You haven't said anything new.  You were mixing SE and SO.  \n\nI don't see why they would need VC for ANY of the things you mention.  Thanks for trying to explain it to all us dummies, but I don't think we're any further along after your brilliant insights..."}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Feb 24, 2010", "message": "@Wedge: I think some of us are looking for clarification from Joel and Jeff. Possibly along the lines of what you offered. Definitely without the insults."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Feb 25, 2010", "message": "@Dennis,\n\nA great many details of Joel and Jeff's business activities and plans are publicly available, usually from their own mouths (or keyboards).  Yet when Joel announces that he wants to pursue VC for Stack Overflow there is this tremendous criticism (here and elsewhere) of his decision, much of it focused on questioning why he would need VC at all for nothing more than a dinky old programming q&amp;a site. Anyone who has been paying attention, has any degree of business sense, and spent the time to actually think about it shouldn't have trouble imagining why Stack Overflow might need an infusion of capital in order for their software to replace every single existing instance of a web-based forum in the entire world (one of their stated goals, though a bit lofty). I am annoyed by the fact that, from my perspective, so many people don't seem to have expended any significant mental effort before commenting.\n\nThat being said, there was no need for taking an insulting tone. I apologize for that."}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Feb 25, 2010", "message": "@Wedge ...\n\n\"That being said, there was no need for taking an insulting tone. I apologize for that.\"\n\nYes you did it again with your latest post.  \n\nSo, for all us dummies who have no brains, can you please enlighten us why it would take a VC round to execute what you are suggesting?  I'm all ears. \n\nAdditionally, you seem mistake confusion and misunderstanding with criticism.  \n\nPlease, oh brilliant one, enlighten us with your knowledge.  What is so clear to you that we have not seen?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 28, 2010", "message": "> Do I get some sort of prize for apparently being the only one able to figure out something seemingly so immensely obvious?\n\nYes, please report to Stack Overflow world headquarters immediately to collect your prize!"}, {"author_name": "sad_panda", "gravatar_hash": "8e36ea0ab323a958d35f6948820af425", "author_url": null, "date": "Mar 05, 2010", "message": "so this was the last Podcast? :("}, {"author_name": "Dan Dumitru", "gravatar_hash": "dead5c6457591268b4bd4c6199fa16b6", "author_url": "http://WhiteboxHardware.com", "date": "Mar 10, 2010", "message": "No."}, {"author_name": "thephantomtypist", "gravatar_hash": "bb54d41013255a7697a412d3e586c890", "author_url": null, "date": "Mar 10, 2010", "message": "It sure seems like this was the last podcast at least for Joel. Look at what he wrote in his last Inc. article.\n\nI don't think Jeff and Joel have gone this long without a Stack Overflow podcast.  Three weeks!"}]}