{"response": [{"author_name": "Jason", "gravatar_hash": "0e2e822d32a7ab3d7f0b7098d03b1d16", "author_url": "http://www.jasonedelman.com", "date": "Feb 03, 2010", "message": "You should come up with some sort of import tool so that people coming from crappy phpBB forums can easily take all their discussion and put it into their shiny new StackExchange site!"}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": "http://careers.stackoverflow.com/kyle", "date": "Feb 04, 2010", "message": "The launch doesn't seem imminent, or at least, I hope it's not. There are still several holes left unfilled in the platform (database export, etc) and issues/bugs that need to be worked out. There were also, apparently, performance problems with the latest beta that required three tries to get right.\n\nBeing a free beta the communities are content to put up with the issues that come along with it, but I expect that once Fog Creek starts charging $129+ every month, people are going to insist on a stable, robust platform. Given this, I just don't see StackExchange coming out of beta before the end of the month."}, {"author_name": "Entity", "gravatar_hash": "e326f7efc603a1881cd645d22a663de2", "author_url": "http://www.vbs2.com", "date": "Feb 04, 2010", "message": "Think that if the price was unlimited page views and $29 per month then I think more people would be looking at signing up. Then offer more corporate customer packages as charge per usage.\n\nThough people will vote with their wallets."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Feb 04, 2010", "message": "Jeff, given that you've stated very publically and frequently that the Stack Overflow engine is for Q &amp; A and not for supporting discussion or social discourse, what makes you think it will be a good fit for a discussion forum?\n\nFor the record, I don't like phpBB either."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 04, 2010", "message": "> what makes you think it will be a good fit for a discussion forum?\n\nBecause I think the Q&A format is *superior* to free form discussion, in every possible dimension.<sup>1</sup> \n\nAnd when people say they want discussion, I don't think they do: what they really want is answers.\n\n<sup>1</sup> except \"I just want to waste time by any means necessary\"; these folks deserve phpbb"}, {"author_name": "Steven Kass", "gravatar_hash": "50f7652752c65ab48141958d550b232b", "author_url": "http://www.askaboutprojects.com", "date": "Feb 04, 2010", "message": "Very much agree with Jeff on this.\nstackexchange is better than phpBB.\n\nI would add that stackexchange might be better than search engines for non-trivial questions. It's a human-powered search engine.\n\nHuge number of people use search engines to ask their questions.\nHow many times have I googled a question for ten minutes and then given up? That applies to programming questions, but for any other subject.\n\nAnd I am grateful to all the SO/SE folks for the tool."}, {"author_name": "Finglas", "gravatar_hash": "5fa64738b2b35539637c51e7a098587b", "author_url": null, "date": "Feb 04, 2010", "message": "*\"we may try pushing a tad further this year with yet another site.\"*\n\nDo we really need another site?"}, {"author_name": "Ivan Belov", "gravatar_hash": "59fc27af7133ea451cdaca3b2c5354d0", "author_url": "http://www.codermanager.com", "date": "Feb 04, 2010", "message": "@Finglass\n\nApparently we do. :) From what I understood, there is at least 10 more niche Q&amp;A sites already running on Stack Exchange."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Feb 04, 2010", "message": "\"Because I think the Q&amp;A format is *superior* to free form discussion, in every possible dimension.\"\n\nSo if I'm hanging out virtually in a forum dedicated to my favourite band and we're shooting the breeze over tracks on their new album, then you think that voting on people's opinions and accepting an answer is appropriate?\n\n\"And when people say they want discussion, I don’t think they do: what they really want is answers.\"\n\nIn a lot of cases, not all. phpBB has many problems (mainly too many features, plus being written in PHP, ha ha!), but I don't think that Stack Overflow is a one size fits all solution either. Sometimes people really do want open-ended discourse."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Feb 04, 2010", "message": "@Jeff Atwood:\nThe Q&amp;A format is superior if you're asking questions, yes.  Exactly how is it superior if the intent is to actually hold a discussion?\n\nThe Q&amp;A format used by the trilogy makes it damned hard to hold a back and forth conversation, particularly since comments are treated as second-class citizens."}, {"author_name": "voyager", "gravatar_hash": "c658f5d2eae05b8e7cab26a40106cd7c", "author_url": null, "date": "Feb 04, 2010", "message": "<blockquote>And when people say they want discussion, I don’t think they do: what they really want is answers.</blockquote>\n\nThat depends. Wave is a gigantic time sink, but it's great for threaded discussions precisely because it's threaded, as opposed to SOFU, that it's deliberately left thread unfriendly."}, {"author_name": "Steven Kass", "gravatar_hash": "50f7652752c65ab48141958d550b232b", "author_url": "http://www.askaboutprojects.com", "date": "Feb 04, 2010", "message": "I think there is definitely a need for additional stackoverflow / stackexchange sites because there are the best way today to search for answers and document those answers.\n\nSearching for answers is not restricted to programming.\n\nStackexchange structures the information around questions and that's not a bad way to do that. And it helps see the most useful answers at the top.\n\nOther types of forums are very noisy and do not scale.\nImagine 1,000,000 people discussing parenthood, legal advice, graphic design, project management, etc.\nHow will you find your answers, or just great posts if you don't have the system to scale?"}, {"author_name": "Joel Spolsky", "gravatar_hash": "d77663c217e9d27b725338c06674c94b", "author_url": "http://www.joelonsoftware.com", "date": "Feb 04, 2010", "message": "Whatever happens, one feature StackExchange will NOT have is PHPBB import.\n\nHere's why:\n\nhttp://meta.stackoverflow.com/questions/12943/stackexchange-to-allow-data-import/13008#13008"}, {"author_name": "Jeff Davis", "gravatar_hash": "6d81d6dc131240aff73b92c2777f1737", "author_url": null, "date": "Feb 04, 2010", "message": "Woah pricey. Can you make an \"ultra-small\" pricing, for sites that might get at most 100 thousand visitors a month?\n\nThe price might be enough to kill a smaller site."}, {"author_name": "Chris W. Rea, BasicallyMoney.com", "gravatar_hash": "046a18d60ddd3d01a994788755087638", "author_url": "http://www.basicallymoney.com", "date": "Feb 04, 2010", "message": "Jeff, Joel:\n\nI'm more satisfied than before with the StackExchange Beta 6 just pushed out, but as Kyle Cronin pointed out, I agree there are still some gaps that require the product to continue in Beta.\n\nHowever, I'd like to say I'm simply thrilled to be using StackExchange for my site.  Thanks for making it possible!"}, {"author_name": "Paul Nathan", "gravatar_hash": "fc3225dc3119500fcbf7af646a83c914", "author_url": null, "date": "Feb 04, 2010", "message": "I like fora, for discussions."}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": "http://stackoverflow.com/users/20654/oscar-reyes", "date": "Feb 04, 2010", "message": "&gt;*Woah pricey. Can you make an “ultra-small” pricing, for sites that might get at most 100 thousand visitors a month?*\n\nOr \"nano-small\" pricing? I have this 10 people team that's looking for a platform just like this, so, that should be about 300 visitors at month ? ( granted every one use it every day, which I doubt it ) \n\n While we can use stackoverflow.com, I think our question will get immediately closed for almost all the available reasons a question could be closed there."}, {"author_name": "Martin Brown", "gravatar_hash": "1a6ca736b1d0c7cfc9c2055a5408ccc4", "author_url": "http://www.farmingquestions.com", "date": "Feb 04, 2010", "message": "StackExchange $129 a month, phpBB free + $5 a month hosting. I don't see StackExchange making too much of a dent in phpBB's market while that pricing is still in effect."}, {"author_name": "Paul Lefebvre", "gravatar_hash": "61a04d956448b88ea0c845d19a30125e", "author_url": "http://www.logicalvue.com", "date": "Feb 04, 2010", "message": "I agree with Martin Brown.  I can see lots of uses for StackExchange, but at $129/month minimum ($1548/year), none of them are feasible."}, {"author_name": "Daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": "http://none", "date": "Feb 04, 2010", "message": "I agree with Martin Brown too. + The answer of why the Import feature is not going to exist by Joel is simply immature and very not professional. Ditching other system is not the key to show that your system is the best. More, the style of StackExchange is good for Q&amp;A but Php BB does the job (for the money) for discussion."}, {"author_name": "voyager", "gravatar_hash": "c658f5d2eae05b8e7cab26a40106cd7c", "author_url": null, "date": "Feb 04, 2010", "message": "@Martin Brown, @Paul Lefebvre: but maybe they are <i>not</i> trying to compete with PHPBB in a race to the bottom?"}, {"author_name": "Ether", "gravatar_hash": "43722cb1e955874a8eb721e9dfe101d1", "author_url": null, "date": "Feb 04, 2010", "message": "If this \"yet another site\" is <a href=\"http://meta.stackoverflow.com/questions/2582/robooverflow\" rel=\"nofollow\">roboOverflow.com</a>, then bring it on! :)"}, {"author_name": "Paul Lefebvre", "gravatar_hash": "61a04d956448b88ea0c845d19a30125e", "author_url": "http://www.logicalvue.com", "date": "Feb 04, 2010", "message": "@voyager I go the impression from Jeff's post that they did want to compete with phpBB:\n\n\"... the sooner we get people off the archaic, busted phpBB style of discussion on the internet...\"\n\nThere is quite a gap between $$100/year (phpBB + hosting) and $1500/year.  If they don't intend to come closer to $$100/year then he shouldn't have mentioned phpBB.  They're sure not going to get a lot of people to switch to StackExchange, even if we want to, at the current prices."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 04, 2010", "message": "> There is quite a gap between $$100/year (phpBB + hosting) and $1500/year. If they don’t intend to come closer to $$100/year then he shouldn’t have mentioned phpBB. They’re sure not going to get a lot of people to switch to StackExchange, even if we want to, at the current prices.\n\nMy answer was to open-source our code, but I was overruled.\n\nI am not saying I disagree with that decision, because in a business you do things as a team and sometimes compromise is necessary. I am fine with the compromise. (Joel has certainly compromised on things I wanted many, many times in the past.) But I also acknowledge that *not* allowing us to go open source kind of undermines our core mission to kill phpBB.\n\nThe current thinking is that the SE pricing is where it is to suppress demand to levels the SE team can actually handle at this early stage.\n\nThere's no reason the SE business couldn't become much larger over time as it matures, and push the monthly pricing down closer to something at least in the same rough ballpark as phpBB."}, {"author_name": "Tony", "gravatar_hash": "d8dd12cb73f6dceba97fa8694caf955f", "author_url": null, "date": "Feb 04, 2010", "message": "Jeff: people want discussions also. You're a strong believer of Q&amp;A but when people hang out, they discuss stuff. They don't go Q&amp;A at each other. So phpBB and other forums software will live forever. So don't get so hyped up with your Q&amp;A idea. Q&amp;A site are just good at... Q&amp;A.\n\nFor those who want cheaper Q&amp;A sites, just wait. I am sure there are developers working on clones. It's not rocket surgery. Like there are lots of forum &amp; Digg clones, there will be lots of Q&amp;A clones coming out soon. People will always follow where the money is.\n\nphpBB serves its purpose very well and SO will never be able to kill it. I can post several disadvantages of SO. When other open source Q&amp;A clones come out, maybe StackExchange's pricing model will die."}, {"author_name": "photographr.info", "gravatar_hash": "dd6c985d22e3bf6ea849e8d2e6750d76", "author_url": "http://photographr.info", "date": "Feb 04, 2010", "message": "The recent beta was a little shaky, but I suspect \\imminent\\ means a small number of months.\n\nOur SE based site (link above) has been building continually with interested photographers, some of them programmers who \\get\\ the Q&amp;A thing."}, {"author_name": "Frank Rizzo", "gravatar_hash": "9b2c958dfe7eed7002b55d7715613d0f", "author_url": null, "date": "Feb 04, 2010", "message": "Not quite sure how StackExchange is going to displace phpBB if the latter is free and the former is not."}, {"author_name": "Tony", "gravatar_hash": "8d56517c59e5338965f97588c26c568f", "author_url": null, "date": "Feb 04, 2010", "message": "Maybe a mix of QA &amp; threaded discussions is a good idea for a new type hybrid platform. People post questions and read voted answers on the same page. Like SO now.  If you want to engage in a discussion related to the question, then there's a link that takes you to a discussion area, away from the question. The two areas should be isolated with  cross linking links.\n\nRight now on SO and related sites, people engage in discussions through posting comments (I am guily of that) and you have to prefix your comment with the person's name you're replying to. Not very practical and kinda works. I prefer threaded discussions with quoting abilities for that. Otherwise how do people know who you're replying unless you read all the comments top to bottom. Not very efficient."}, {"author_name": "Jonathon Watney", "gravatar_hash": "0f0f5d11143921e700f2d98a2a7850cb", "author_url": null, "date": "Feb 05, 2010", "message": "@Tony and @John Topley: I recently posted a question on meta about supporting discussions. It might be worth checking out and leaving a comment.\n\nhttp://meta.stackoverflow.com/questions/38315/partner-with-traditional-forums-to-support-open-ended-discussions"}, {"author_name": "Helder Ribeiro", "gravatar_hash": "f819599bbed80f48013d5acad012a9c3", "author_url": "http://helderribeiro.net", "date": "Feb 06, 2010", "message": "Regarding other comments: I have my doubts about the Q&amp;A format not being suited for general discussion. The website yoomoot.com is *meant* for general, mass discussion, and the solution they came up with to the problem of endless and hard-to-sift-through threads was exactly making (almost) everything either a question or an answer."}, {"author_name": "Martin Wallace", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Feb 07, 2010", "message": "\"the sooner we can get people off the archaic, busted phpBB style of discussion on the internet, the better off we’ll all be.\"\n\nWhy are you comparing a free product with a pay product?\n\nYou would be better comparing yourself to vBulletin or Invision Power Board - both of which surpass phpBB and are excellent - probably better than 'The Stack'"}, {"author_name": "Arjan van Bentem", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "Feb 09, 2010", "message": "Please decide on a name with or without a space -- StackExchange or Stack Exchange...?\n\n(So far, I though it was without a space, while Stack Overflow et al do have a space. Now I'm in doubt, seeing that space in Stack Exchange in this post as well?)"}]}