{"response": [{"author_name": "C. Ross", "gravatar_hash": "ec4b051825229c870b5b4c0c9a371558", "author_url": "http://stackoverflow.com/users/16487/c-ross", "date": "Feb 10, 2010", "message": "Awww, thanks Jeff, we love you too.  I feel all warm and fuzzy now."}, {"author_name": "Grzes", "gravatar_hash": "37bb92ada54408e814ecedfcfa57da8a", "author_url": null, "date": "Feb 10, 2010", "message": "Interestingly the members of other sites based on the the engine (I am talking about mathoverflow here) don't share the same values - I did ask a few newbie questions and I got nasty comments and downvotes."}, {"author_name": "Mehrdad", "gravatar_hash": "df0bd8a818111607704dab056fcfc091", "author_url": "http://mehrdadafshari.com", "date": "Feb 10, 2010", "message": "The second email is the direct consequence of things done by the great moderators, community wiki police, question closers, editors, most notably Rich B who have to deal with the constant hate from a bunch of community members who are in love with not-programming-related, seemingly-funny, and subjective questions. Since this blog entry doesn't explicitly thank them, I'm doing that here instead. Thank you guys for keeping SO clean."}, {"author_name": "Stefan", "gravatar_hash": "cc39fb58e903e1377081c621c2f53c7c", "author_url": "http://stefankendall.com", "date": "Feb 10, 2010", "message": "@Grzes:\n\nI think that the math community is just built for intolerance. Software developers, on the other hand, tend to be nicer."}, {"author_name": "mmyers", "gravatar_hash": "49f3a2065659f5b4efa05ae29bd0856a", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Feb 10, 2010", "message": "@Stefan: Well, you can hardly blame them for downvoting newbie questions when http://mathoverflow.net/faq says the site is for \"research level math questions\".\n\nStack Overflow's FAQ, on the other hand, says that no question is too trivial or too newbie.\n\n\nCAPTCHA: conclave, first-class."}, {"author_name": "Scott Morrison", "gravatar_hash": "99056c7157a7301e3182ef99dd99a353", "author_url": "http://tqft.net/", "date": "Feb 10, 2010", "message": "@Grzes, mathoverflow is explicitly for research mathematicians, and this is stated clearly in the FAQ. People coming across from StackOverflow sometimes get a surprise, but we've had a very strong and supportive stance from our target audience for this approach. We want to keep the site useful for ourselves, and thank requires keeping out most \"amateur mathematics\". Unlike the programming world, the bar to entry to serious conversation is very high.\n\nThat said, I'm guessing you're [Grzenio](http://mathoverflow.net/users/3160/grzenio) at mathoverflow, and looking at your questions I'd say they were dealt with politely and straightforwardly, even if they weren't actually always answered."}, {"author_name": "shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://shog9.com/", "date": "Feb 10, 2010", "message": "I'll second Mehrdad's expression of gratitude to the many users who take time to perform the janitorial work on SO, cleaning up formatting and grammar, improving titles and tags, flagging spam, and closing out the duplicate, off-topic, and argumentative questions. \n\nAs someone who came to SO after my favorite forums were overrun with rude, poorly-asked questions, I cannot overemphasize how critical these tedious, often thankless tasks are to the ongoing success of the site described in the second email."}, {"author_name": "Johannes Rössel", "gravatar_hash": "d54ed51c0f03cb461741c3ec77a837b2", "author_url": "http://hypftier.de", "date": "Feb 10, 2010", "message": "Interestingly, while the majority of questions garner good answers in a manner of minutes the fact that questions don't remain *active* very long (i. e. people contributing to them and writing answers) means that questions that *don't* get good answers quickly tend to remain unanswered for eternity. So far there were a few problems I stumbled over which yielded that result. Might be that the questions are lousily asked or unclear, though.\n\nStill, the majority of answers I provide fall into two areas:\n\n1. Basic knowledge of the domain.\n2. Common errors of the domain.\n\nGood and interesting questions (to me at least–other's mileage may vary here) are quite rare and to that end I find it unfortunate that good questions aren't highlighted anymore in the podcast (or the accompanying blog post; never listened to the podcast because it's audio-only [until the transcript is up, by the time I have forgotten about it] which to me is pretty much the worst medium for getting information across)."}, {"author_name": "Shaun Finglas", "gravatar_hash": "5fa64738b2b35539637c51e7a098587b", "author_url": null, "date": "Feb 11, 2010", "message": "\\Interestingly the members of other sites based on the the engine (I am talking about mathoverflow here) don’t share the same values – I did ask a few newbie questions and I got nasty comments and downvotes.\\\n\nI had the exact issue. I'll never go back to MO. A waste of a site. Here at SO you can ask any programming question, at MO, that's frowned upon."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Feb 11, 2010", "message": "Haven't been following meta - so i don't know who suggested it . But I do like the new 'c++' (and I presume other specialties) badge."}, {"author_name": "mmyers", "gravatar_hash": "49f3a2065659f5b4efa05ae29bd0856a", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Feb 11, 2010", "message": "@mgb: They've been around for a year now. http://blog.stackoverflow.com/2009/02/specialist-badge-implemented/\n\nThe current list of specialist badges that have been earned is here: http://stackoverflow.com/badges?tab=tags."}, {"author_name": "Brian K", "gravatar_hash": "a2ae8510ad48b14c617d7f686ceed7b4", "author_url": null, "date": "Feb 19, 2010", "message": "I agree. The last question of mine was answered in around 7 minutes! My question even got an up vote!\nBrian"}, {"author_name": "Nick Moore", "gravatar_hash": "97d598350ba83471da04386f72be708f", "author_url": null, "date": "Mar 11, 2010", "message": "I love Stack Overflow too. \n\nSounds like there's a need for a \"Stack\" Math site for general math questions -- if there isn't already?"}, {"author_name": "Sosh", "gravatar_hash": "28b32e959ebbbf7e418f96bcd7c1db7e", "author_url": null, "date": "Mar 17, 2010", "message": "Guys, I love stack overflow, so get me wrong, but... I take issue with this point \"Community politics don’t seem to exist\".  In my opinion, they certainly do I'm afraid.  \n\nThe \"vote to close\" feature seems to be an attractor for this.  To give examples: I've had some of my questions closed, some without justification (in my opinion;).  When I asked for reasons, one was \"I'm not interested in hearing the answer to this question\".  Or - having my posts edited, where the edited version is no improvement, just a sylistical re-write.  I'd rather ask a question in 'my own voice' or not at all, thanks.\n\nI think a real danger for any comunity edited resource, is that they seem have a tendancy to turn cultish (Wikipedia anyone?) as things progress.  I really hope that things don't get ridiculously picky on SO."}]}