{"response": [{"author_name": "Radu Murzea", "gravatar_hash": "7045d2574ce2f38a399636534356e14c", "author_url": null, "date": "May 11, 2015", "message": "Nice chairs. And nice (main) topic :)"}, {"author_name": "Vogel612", "gravatar_hash": "f9e58f1344c5ba231821b6d53163b59e", "author_url": null, "date": "May 11, 2015", "message": "Very interesting podcast thank you for sharing.\n\nI personally would've loved to hear just a short section of the usual: 'What happened in the network since the last podcast?'\n\nI'd also love to learn more about the careers infrastructure and working since that's  (at least to my knowledge) not highlighted in the currently existing blog posts about SE infrastructure"}, {"author_name": "Yes", "gravatar_hash": "dce0b9873422a08a79a71743aaf0107a", "author_url": "http://math.stackexchange.com/users/147263/rafflesia-arnoldii", "date": "May 11, 2015", "message": "@Vogel612: That section was supposed to be about the new user profile, but the rollout <a href=\"https://twitter.com/OdedCoster/status/587987377718763520\" rel=\"nofollow\">didn't happen</a> in time for the podcast."}, {"author_name": "Mike", "gravatar_hash": "73de36d5338f20cf231237539772350f", "author_url": null, "date": "May 12, 2015", "message": "Why the title change?"}, {"author_name": "RP", "gravatar_hash": "d135323bc578f77a30427d8a65c3c77e", "author_url": null, "date": "May 12, 2015", "message": "Is there a safe for work explanation of who Joey Graceffa is?"}, {"author_name": "Kip", "gravatar_hash": "cbe10f44e958cd0d8dd08438e6ebf122", "author_url": null, "date": "May 12, 2015", "message": "Wanted to make one comment about the wording changes on your job listings- It is not just underrepresented groups that are intimidated by \"we only hire the best of the best\" type job listings. I'm a \"privileged\" straight white guy, and I had looked at your job listings every once in a while for a few years, but always found it intimidating because I've never worked with a Microsoft stack or on anything with the same volume of traffic that SO gets.\n\nBut I actually applied with you guys this year. I think what got me to actually apply was the line \"We don't expect you to know everything coming in, so we'll pair you with mentors who will help you grow and develop your skills.\"\n\nEven though you didn't end up hiring me, I made it through all the technical interviews, so I guess I'm pretty close to a good candidate..."}, {"author_name": "Dom", "gravatar_hash": "df53ac470d709dc9c71ff00cab1334d6", "author_url": null, "date": "May 12, 2015", "message": "I'd like to work at Stack Exchange but every open position requires some skills I don't have. \n\nIt's frustrating because I can satisfy multiple skills across 3 different job openings, but can't fulfil all the requirements of a single job opening completely.\n\nIt'd be nice to see some entry level jobs with development and career growth opportunities."}, {"author_name": "the_jeck", "gravatar_hash": "3975df72743a38a1411f77b8a01d5d98", "author_url": null, "date": "May 12, 2015", "message": "Since we're trading anecdotes, I was once told by a woman that my interest in music, as a programmer, was \"because of the math.\" No exaggeration. Those were her actual words, stated in a tone I would describe as casually dismissive.\n\nLet me be clear, I don't think she was being mean. She may have even supposed she was being complimentary. But, when you've been - let's not mince words - a \"nerd\" (or is it \"pissbaby?\" Hard to keep up, lately) your whole life, you're going to make certain inferences there whatever the speakers intents were. Why? Because those connotations *have* been made damn well clear and explicit by others in our lives. \n\n\"Those connotations\" being: I can't be creative, or talented, or whatever without some sort of \"explanation.\" A *PROGRAMMER* who is interested or good at music because I am... multi-talented? Because I am creative? I'd even have taken free spirited, but no. I program, and that's all I can ever be. Just some \"egghead;\" someone who for some reason must have no spiritual or humanly sympathetic qualities.\n\nWelcome to \"programming while male.\"\n\nI think one thing we can do is take in and observe gender biases as a whole, and stop acting like it was made up by men in the industry. You know, guys who are \"good at math.\" Cause that sh*t doesn't help anything, it just creates more animosity."}, {"author_name": "Jason", "gravatar_hash": "71d8d3c844a9033a1c70daaaff2c4ab5", "author_url": null, "date": "May 12, 2015", "message": "There's always going to be some sense of \"other\" that is different from us... accepting that is going to have to be part of the solution, because there's no way to get rid of it.  Biases and stereotypes exist because they allow us to not spend all of our time just figuring people out and actually get some work done.\n\nIt's incumbent upon those making the assumptions to acknowledge that they are doing so (or at least be open to being made aware that they are doing so), and it's incumbent upon those who find themselves being shoehorned into a stereotype to speak up when they feel it's necessary, and to be understanding of people who may be completely unintentional in their assumptions."}, {"author_name": "Bob The Zealot", "gravatar_hash": "e41d42cc22a5dfb4c68df365b51bb4e1", "author_url": null, "date": "May 12, 2015", "message": "Nice chairs!"}, {"author_name": "Albey Amakiir", "gravatar_hash": "fa1512d38160d0546361d2723d0949e4", "author_url": null, "date": "May 12, 2015", "message": "What's this? The title was changed to something that references the *useful* content of the podcast, rather than the silly? What is the world coming to? O_O"}, {"author_name": "Robin Nabel", "gravatar_hash": "ffe06a9a7477d25c9793136cb13f58f1", "author_url": null, "date": "May 13, 2015", "message": "Fantastic podcast. Especially regarding the way you changed your job listings. There are so many people I know who didn't apply to the top companies because they thought they weren't the top of the top of the top... The talent lost that way must be huge.\nKeep the good podcasts coming!"}, {"author_name": "Keith", "gravatar_hash": "2388c2980a83c02991f40bf461bf8e2f", "author_url": null, "date": "May 13, 2015", "message": "\"Diverse hiring\"\n\nAKA Hiring non-white males, because as we all know, white males are all the same."}, {"author_name": "BD", "gravatar_hash": "fbc266d42d849685896510cf387da452", "author_url": null, "date": "May 13, 2015", "message": "How is it not Alan Purring?"}, {"author_name": "cimmanon", "gravatar_hash": "f38e78d4ae5a92b47a42ab161c1551ed", "author_url": null, "date": "May 14, 2015", "message": "@Keith I count 29 developers on the \"team\" page where only 2 of them are women.  Your problem is what, exactly?  They seem to have hired plenty of white males to me.\n\nIf you're problem is that you believe that a minority was chosen over a more qualified non-minority, that is complain worthy... but not what you said."}, {"author_name": "Mike", "gravatar_hash": "73de36d5338f20cf231237539772350f", "author_url": null, "date": "May 14, 2015", "message": "@BD Alan Purring would be amazing!\n\nSkeptic: \"Cats can't flush toilets, they don't have opposable thumbs!\"\nAlan Purring: \"Good. Let me try and we'll know for sure, won't we?\""}, {"author_name": "Keith", "gravatar_hash": "2388c2980a83c02991f40bf461bf8e2f", "author_url": null, "date": "May 14, 2015", "message": "Moderator deleted my comment\n\n<blockquote>And I'll keep deleting it if you keep reposting it. This isn't Reddit; if you're gonna discuss something in the comments here, \n\n<ol><li>Be at least nominally on-topic.</li>\n<li>Don't resort to name-calling when folks disagree with you.</li></ol>\n\nIf you can't handle that, write your own blog post about the evils of leftists or whatever it is you so desperately want to talk about.\n\n--Ed.</blockquote>"}, {"author_name": "jimmy", "gravatar_hash": "947dc590928abb79e8827f60fc85db0e", "author_url": null, "date": "May 14, 2015", "message": "@keith\n\nI totally agree.  Discrimination is totally fine as long as the one being discriminated against is white and male."}, {"author_name": "Ismael Miguel", "gravatar_hash": "f4a16b1101f97665c00f3cc187352157", "author_url": null, "date": "May 14, 2015", "message": "I think that the reason why people kept talking to the guy (Gabe?) was because of her clothes.\n\nThis will sound stupid and silly as heck.\n\nBut she's dressed like someone who isn't a programmer.\nI mean, look at the guy! He looks like he works for S.O.!\n\nPeople here dress (somewhat) like that to represent the product, but they don't know anything about it.\nThat's the image that she's passing.\n\nBut it is great to see that she applied to S.O., but there's one thing that saddens me:\nI must be the only Portuguese to use S.O. in Portuguese! That's sad!"}, {"author_name": "Dwayne", "gravatar_hash": "27ae78d883eb8adcbec0fc91f441686d", "author_url": null, "date": "May 14, 2015", "message": "Great show.  I enjoyed the bit about heated developer discussions, definitely resonated with my experience.  \n\nI was wondering, how did stack exchange transition to a less hostile environment for code discussion, but still maintain the frankness necessary to make decisions?  It baffles me how relatively low key individuals (including myself) become exceedingly passionate about code related decisions in our meetings.\n\nWould love some tips if you have them!"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "May 14, 2015", "message": "If wearing SO swag == \"not programmer\" then we have an awful lot of top users who aren't programmers, @Ismael."}, {"author_name": "Ismael Miguel", "gravatar_hash": "f4a16b1101f97665c00f3cc187352157", "author_url": null, "date": "May 14, 2015", "message": "@Shog9 You are biasing what I said.\n\nThe **LOOK** is what would get me.\nAnd the place.\n\nShe's behind that... thing... (I forgot the name).\nShe looks like she's selling the next generation product that she knows nothing about, and that she has the representant right besides her.\n\nAt least, that is the 'default' look here, when presenting a product.\n\nI guess it is a cultural issue, and NOT A GENDER ISSUE, AS PORTRAITED IN THIS BLOG ENTRY."}, {"author_name": "Profeseor", "gravatar_hash": "820426ee357839e694776ae756963463", "author_url": "http://www.profeseor.com/", "date": "May 25, 2015", "message": "So programmer need the girl in programming team to make their team doesn't look like a boys club\nHaha"}, {"author_name": "Ismael Miguel", "gravatar_hash": "f4a16b1101f97665c00f3cc187352157", "author_url": null, "date": "May 27, 2015", "message": "@Profeseor I think that is the point of this blog post..."}, {"author_name": "_@", "gravatar_hash": "eaa5275b7c8df78c4d4216169c3add10", "author_url": null, "date": "Jun 02, 2015", "message": "@Ismael You're saying a girl in some kind of a jacket, a t-shirt, and presumably jeans doesn't look like a programmer, but a guy in a jacket, jeans, and presumably t-shirt does?\n\nI'm confused. Perhaps it's because the guy has a bag? Is that what gives him the right look?"}]}