{"response": [{"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 06, 2009", "message": "I believe that people should first be given an opportunity to <i>change</i> their behavior, provided sufficient motivation ... but after that, I favor deletion, under the bad apple theory.\n\nhttp://www.codinghorror.com/blog/2009/02/the-bad-apple-group-poison.html\nhttp://www.codinghorror.com/blog/2008/07/dealing-with-bad-apples.html\n\n"}, {"author_name": "Rex M", "gravatar_hash": "3e9f1629fd4cb4a5ce9fbd27b13e862d", "author_url": "http://www.rexmorgan.net", "date": "Apr 06, 2009", "message": "The penalty box is simply a mechanism to keep the system in line. Saying it shouldn't be turned on because it might not punish the right user is like saying we shouldn't go live because we might not be able to scale to a million users. Turn it on now and revisit when it becomes clear it's not working as intended. Speculation that something <i>might</i> be able to be gamed is not the same as demonstrating that it <i>is</i> being gamed. I doubt you'll try getting me banned, because a) you don't care enough to make the effort, b) there's a high probability you'll fail, and c) you're not an ass. Most other people fit in that box too.\n\n> \"It’s unfair for employers to punish employees for non work-related blog material\"\n\nBelieve it or not, that's not unfair at all. Of course some companies take this to an extreme, ban all criticisms and sometimes ban blogs, but if you are very publicly abrasive, and make it clear you work for company X, you are giving company X a bad reputation. You are not acting in company X's best interests, which is the first (and arguably only) responsibility of an employee.\n\nA community is even more sensitive to this than a company. A community doesn't have profit motivation to bind them together, it's driven solely by hundreds of individual personal interactions. If one person is consistently causing friction in those interactions, it causes friction for the community. A community naturally extends beyond the physical walls of their meeting place or the virtual walls of a web site. As we've seen, the community has naturally extended itself into other mediums. But SO.com is its home, its clubhouse, and so that's where the community starts and ends."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Apr 07, 2009", "message": "I'm sad that good contributors must sometimes be penalized, but I don't disagree with the punishment or the ruling.  As SO becomes more widely used and known, it will attract more users who see no problem with their disruptive behavior.\n\nIf I run a discussion group at a community center, and one of the members helps out quite a bit in that discussion group, but then outside the group is backbiting and negative regarding others in the discussion group (mentioning rape, death, racial slurs, and all manner of other _very_ offensive insults) then, for the good of the discussion group, I will kick them out.  It is not always easy to see or make the connection to how it is damaging the group, but over time it becomes obvious.  It's better to catch it early before the damage is visible, though.\n\nYes, analogies are poor - but humans are social creatures, and it's going to be the case that negative attitudes spread outside the forum they are expressed in, and will affect other communities.\n\nI can't tell you how many good communities have been ruined by one or two people who poison it - and not intentionally.  They don't believe their actions elsewhere have consequences.  Eventually the bile left unchecked rises, overflows, and ends up significantly damaging and permanently changing the community.\n\nI'm glad the Jeff and Co.  Are taking swift, decisive, and thoughtful action to prevent letting this change the essential nature of the community.\n\nCertain extremely problematic users have been told repeatedly to cease certain activities that others find destructive to the community they are trying to foster.\n\nThey have refused to change.  End of story.\n\nThese constant requests to face their accusers, see the emails, etc are nothing more than a tactic to pull others into their fight, draw it out, etc.  \n\nThey know exactly what they are doing wrong, and willfully refuse to change.\n\nI'm quite certain the penalty will not change their behavior either, which will be a loss to the community, but that is, ultimately, up to them."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 07, 2009", "message": "> if timed suspension can occur as a result of behavior off-site, then none of us are safe! \n\nAs I've said multiple times, it's a broad spectrum of behaviors. Was offensive off-site behavior a factor? Yes. Was it the only reason? Absolutely not, there's a persistent pattern of behavior across the reasons I listed that we are addressing. Not sure why you're fixating on this.\n\n> As should be clear to most commenters by now, <b>the surest way to get banned is, after being warned, to quarrel with the warning, accuse the blogger of improper motives, whine about unequal standards, and generally try to turn the discussion towards the subject of banning. If you get warned and don’t think you deserved to, just accept the fact that you’re playing in someone else’s sandbox, say you’re sorry, and/or let it go.</b>\n\nWell said.\n\nIf only more people would actually follow this advice."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 07, 2009", "message": "Atwood:\n&gt; Not sure why you’re fixating on this.\n\nI'm concerned about it because it potentially changes the game. Of course what i write on SO should have repercussions on SO - that's a no-brainer. External behavior is not; yes, there may well be words or actions outside of SO by a SO user that reflect badly on the site and thus demand an on-site response... but that should be an exceptional and well-documented even should it occur. \n\nThroughout this discussion, i've had in mind a specific occurrence on Everything2 from a few years back. It culminated with the banning of a specific user, and the permanent deletion of a large portion of his contributions to the site. The end result was that - regardless of how much this user's actions deserved such a response - there remained little or no record of them to serve as a warning to others, or to explain why such a seemingly-valuable member was brutally cut. \n\nSO should not have this problem; you've long preached the value of keeping a history even in the case of superficial deletion. So long as each change to a user's status can be derived, publicly, from the history of that user's actions, we'll each be able to view it and to make up our own minds as to whether the change was warranted or not. But lacking a clear audit trail, we've nothing to go on but your reassurance that secret information was sufficient to justify public action. That may be a good way to run a business or start a war, but it's a terrible way to run a community.\n\nThat quote... from the Volokh Conspiracy... That's a perfect strategy for avoiding trouble when posting blog comments. It's also why i generally don't post comments on most of the blogs i read - you're at the mercy of the blog owner, who with a click can remove any dissent from the public record. Unlike many bloggers, you've generally been good about hosting and even responding to comments that disagree with what you write, something i respect greatly. But SO isn't a blog, and those writing questions aren't allowed to rule over the responses with the same iron fist so often found elsewhere... IMHO that's a huge motivator, knowing that i can put the time in to produce a quality answer or edit without being silenced by someone who doesn't agree with my view of the world. \n\nPlease, stay true to the tenants of transparency and egalitarian participation that SO was founded under. Don't turn SO into The SOosphere..."}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Apr 07, 2009", "message": "An open letter to a user in timed suspension:\n\nI think you have done a great job at SO editing and correcting a lot of posts. I don't think there is anyone like you in that field. \n\nYou have committed some mistakes in the process -- even if you don't know which ones they were, or you don't think you did, or don't recognize them as mistakes.\n\nPlease don't reply with: \"Tell me what I did wrong and I'll show you  ...\" , no, no, no stop there for a minute.  Keep your hands off the keyboard for a couple of minutes, breathe in... relax...  and ask yourself, what could have I done wrong? Today. Not in your life, not in the last month, not yesterday, but <i>today.</i>\n\nDid you understand what others were trying to tell you?  Don't think about how are they wrong, or what arguments you have on your side. Just try to imagine how others see you and react to your words and actions.\n\nYou don't have to agree with them, you don't have to think like them, they are probably wrong, but just try to consider <i>why they are saying these things, what in the world could have made them think like that?</i>\n\nThis way you will understand more about the people you interact with, you'll be capable of listening to them and understanding them. Not to agree with them, necessarily, but to have a better understanding of your environment and how it affects you. \n\nWhen you can successfully understand the reasons other people have -- even when you don't agree with them -- then it will be easier for you to get what you want, whatever it is, because you'll manage to fit into a community, either online, at work, with your family or friends. \n\nWe are, after all, social animals. \n\nIf you admire someone, look at how they behave, what kind of answers they give, what's that something that makes you admire him or her.\n\nIf you aspire to do something within a community you have to learn to understand that community, otherwise you will forever be a hermit and an self-imposed outcast.\n\nI think you have a lot of energy and intelligence to share with the people around you.  You just need more patience. \n\nDon't go to the DARK SIDE OF THE FORCE. Use the source, Use the sooooooourceeeee!"}, {"author_name": "karthik", "gravatar_hash": "1589121859ab8cc0e11dc1bb079290a2", "author_url": null, "date": "Mar 03, 2011", "message": "is there anyway to reduce temporarily suspended period?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 13, 2011", "message": "@karthik you can email the address at the bottom of every page on the site."}, {"author_name": "Shimmy", "gravatar_hash": "8ac32db29e5bc37f2baef574334d79c8", "author_url": "http://blogs.microsoft.co.il/blogs/shimmy", "date": "Apr 14, 2011", "message": "It's sad that this has to happen, but it's definitely compelling!!\nWay to go, StackOverflow is the sweetest exception ever thrown!"}]}