{"response": [{"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Apr 23, 2009", "message": "Will I get a notification if one of my comments has been deleted? I left a comment on \"Why are all-caps constant considered bad coding style?\" (http://stackoverflow.com/questions/777641/why-are-all-caps-constant-considered-bad-coding-style) which had been voted up to 7 but is now gone. (The question was, \"why do you think this is a bad coding style?\" and my comment was, \"I don't\".)"}, {"author_name": "EpochWolf", "gravatar_hash": "c27f158e95e252c8c9c4eab473f6b60e", "author_url": null, "date": "Apr 23, 2009", "message": "I've been waiting for this since I've signed up! Now it's here and the implementation exceeded my expectations. \n\nI love all the work you guys put into the site."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 23, 2009", "message": "I can see how this will end up being incredibly confusing when pieces of a conversation start getting votes and they are promoted to the top but in an order that makes them incomprehensible. \n\nExample:\n\nCommenter X leaves a comment and gets 2 up votes.\nCommenter Y replies to Commenter X and gets 5 up votes.\nCommenter Z replies to Commenter Y and gets 4 up votes.\n\nSuddenly the entire \"conversation\" that was taking place becomes really jumbled until you click load and figure out just WTF is going on.\n\nIf you are going to post top comments, I would like to believe that they should be in chronological order with at least some indication that there are hidden comments not being shown."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 23, 2009", "message": "Looks good, but I have a few suggestions if you're interested.\n\n1. When expanding the comments, highlight or differentiate the top comments to make it easy to see their context in the comment thread. One way to do this is to make the text more black, as it's currently a little difficult to read the new comment style.\n\n2. Display the 5 highest-ranked, but display them in posting order. Again, this makes it easier to follow the discussion\n\n3. Don't display comments with score of 0. The majority of comments on any given post are score 0 and it makes no sense to pick the \"top\" comments out of this pool, especially if you're not doing #2 either.\n\n4. I posted this in an earlier topic, but I think that the poster's comments should be highlighted in some way to make them easy to identify.\n\n5. Provide a way to permalink to a comment\n\n6. Using #5, provide permalinks to the replied-to comment when a commenter uses an @ reply (this feature appeared for answers, then disappeared, during the beta)\n\nJust a few ideas. Let me know what you think."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 23, 2009", "message": "I would also like to say that I believe there should be some sort of user preference for this...\n\nA) Hide all comments by default (default preference)\n\nB) Show all comments by default\n\nC) Show X first comments by default (perhaps user defined)\n\nI would also suggest that the top comments be a user toggle, but that's stretching it a bit."}, {"author_name": "Mike Woodhouse", "gravatar_hash": "5978e2ed3a31f1bd2361dbb919d92012", "author_url": "http://grumpyop.wordpress.com", "date": "Apr 23, 2009", "message": "+1 on the \"conversation disruption\" problem thing.\n+1 on the \"top comment\" thing too.\n\nA little bit of Ajax creativity would probably give us the goodness of both, optionally."}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Apr 23, 2009", "message": "I thought the whole point of comments was to have a chronologically stable area to discuss an Question/Answer?"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 23, 2009", "message": "@Chris Conway: That would be too simple."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 23, 2009", "message": "TheTXI, did you read the last paragraph of the post? Just curious..\n\n> Display the 5 highest-ranked, but display them in posting order.\n\nComments should be relatively standalone in that they relate to the post.\n\nThat said, if you want a full chrono view, just click the \"3 more comments\" and you have it. Done.\n\n> Don’t display comments with score of 0.\n\nI am thinking about having certain classes of questions use a different rule for comment display, but I haven't reached a conclusion yet. I need to use the feature for a little while longer first.\n\n(Aside: we are designed as a Q&A site, not a discussion site, and that's why we sort by votes as a default. So when people say <i>oh noes! You've destroyed our discussion!</i> Uh.. yeah.. because we're not phpBB, by design! This is why I am continually perplexed at people who want, nay, DEMAND, that we allow tons of meta-discussion... though it's a terrible fit for the software we've written.)"}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Apr 23, 2009", "message": "I am quite curios how much will this move impact search traffic. I mean the site will have more keywords visible to the search engines this way.\n\nI expect an increase but I'm curious if it will be a small, medium or large increase."}, {"author_name": "Lucas", "gravatar_hash": "9d3d28e4d5778680945b9347b5c2aa1c", "author_url": null, "date": "Apr 23, 2009", "message": "Thanks! I never liked having to click the \"show comments\" link because it was so very slow for me. Many times I would have to re-click it close/open until they finally showed.\n\nBut, about up-voting/flagging the comment, I cringe everytime a feature is there \"but requires a Twitter-style mouseover to reveal.\" How will I reveal them when browsing on my iPhone? I can't mouseover them!"}, {"author_name": "Cagdas", "gravatar_hash": "7ffd13d6e7b8d7d2c62f72268453be0e", "author_url": null, "date": "Apr 23, 2009", "message": "@Jeff Atwood\nIf all the questions were perfect and clear, ie not-requiring someone else to ask via comments what exactly the questions asks, then I'd have agreed that there should not be any discussions in comments. But sometimes it's inevitable.\n\nI do hope you are right, though."}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": "http://blog.tapuchim.com", "date": "Apr 23, 2009", "message": "I completely agree with nobody_.\n\nYou should also make the comments available in a non-javascript way, for instance, for computers without javascript make a link with that shows the same page with all comments."}, {"author_name": "Paolo Bergantino", "gravatar_hash": "80ae8ec34e9e3e66c5be50733afaa44e", "author_url": null, "date": "Apr 23, 2009", "message": "Although I like the new feature, the comment themselves are a little hard to read now. I can kind of see why you took away the gray box they used to live on as it may be distracting en masse but some sort of contrast or at least making the fonts a touch darker would make things much better."}, {"author_name": "Sung Meister", "gravatar_hash": "409261beec25d8d5e7f821fcfae72351", "author_url": null, "date": "Apr 23, 2009", "message": "I agree with nobody_ on his 5th &amp; 6th ideas."}, {"author_name": "Zifre", "gravatar_hash": "6937bb37adb0a16d8f3096f5366134c6", "author_url": null, "date": "Apr 23, 2009", "message": "By the way, it seems like with this update the little \"x\"s on the ignored and interesting tags are gone, so I can't delete them. Is anyone else having this problem?"}, {"author_name": "zurvan2", "gravatar_hash": "fdd2cee0ff73e9805b94654e4d7418d3", "author_url": null, "date": "Apr 23, 2009", "message": "Couple \"comments\"\n- YAY you fixed keyboard navigation with expanded comments! \n- The way you hide the voting and flagging icons makes it look like all the text belongs to one item. You have to look far to the right to see the individual authors, etc. Harder with longer comments. Some visual break between comments would help this. \n- I was going to say \"5 isn't enough\" but then I couldn't find a counter-example. ;) \n- Comment order, whether you like it or not, adds context and makes comments more understandable. 5 comments is not so many that higher rated ones would get lost if they weren't on top."}, {"author_name": "Roj", "gravatar_hash": "22f29d8ccc491817dd1200619ae68aee", "author_url": null, "date": "Apr 23, 2009", "message": "I think it was a poor choice to release the new comment system before you finished preferences to disable automatically expanded comments.  :P\n\nAlso, it's kind of disorienting to see the comments in one order, then clicking on it to have it suddenly display in another order.  I feel like the top (n) should at least be in date order; getting to the top (n) alone is good enough for indexing, right?"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 23, 2009", "message": "To my eyes the new change has resulted in a cluttered appearance and makes me think of ExpertsExchange. There is a reason why I never used ExpertsExchange, wish we were not moving in that direction.\n\nThis truly needs to be a user preference."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 23, 2009", "message": "@Rich\nDid you read the last sentence of Jeff's post?"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 23, 2009", "message": "@Chris: I sure did, but reality is still reality right now."}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "Apr 23, 2009", "message": "Can you change the background back to gray and also separate the comments with a line. Its hard to tell where one comment starts and another begins."}, {"author_name": "JaredPar", "gravatar_hash": "529ba429a58902bef56c2fcb672d5ccb", "author_url": "http://blogs.msdn.com/jaredpar", "date": "Apr 23, 2009", "message": "I really dislike this change.  To me it just makes the screen look very cluttered. \n\nIs there a way to disable it and go back to the old behavior?"}, {"author_name": "Evan", "gravatar_hash": "f5e4fb973bce44b2d2a40f88b29207df", "author_url": null, "date": "Apr 23, 2009", "message": "@Donny V: You might consider voting on http://stackoverflow.uservoice.com/pages/general/suggestions/172551-make-mouse-hover-highlight-a-comment- which is close to what you want.\n\nI would love to see \"including comments with no votes in the initial display\" as a separate option to the planned \"n of comments initially shown\" option.  That way, if only two out of n+ comments have any votes, you only see two comments.\n\nWould cut the clutter factor waaaay down while still showing salient comments by default - which is the stated intent.\n\n(Would also prefer them shown in strictly chronological order, but suspect I'm pushing against the tide there.)"}, {"author_name": "Evan", "gravatar_hash": "f5e4fb973bce44b2d2a40f88b29207df", "author_url": null, "date": "Apr 23, 2009", "message": "@JaradPar: Read the last paragraph of Jeff's post.  That will be a user option that should be available soon."}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://stackoverflow.com/users/437", "date": "Apr 23, 2009", "message": "May I suggest that when the user option comes in, that it default to 0?\n\nDefault-visible comments on a quality, carefully worded answer are like \"Intel Inside\" on a Macbook."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 23, 2009", "message": "> comments on a quality, carefully worded answer \n\nare you sure you're talking about Stack Overflow?"}, {"author_name": "belgariontheking", "gravatar_hash": "2a2f9018942bf8e582faff47eb169fdf", "author_url": null, "date": "Apr 23, 2009", "message": "Yeah, we all know that the only answers you'll get on SO are \"FIST!\""}, {"author_name": "JaredPar", "gravatar_hash": "529ba429a58902bef56c2fcb672d5ccb", "author_url": "http://blogs.msdn.com/jaredpar", "date": "Apr 23, 2009", "message": "@Evan, Thanks.  Read right past that sentence.  I do wish the disable option though would be enabled at the same time as the feature."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Apr 23, 2009", "message": "\"If you are not comfortable with the idea of your questions and answers having visible commentary immediately below them, this may not be the site for you. \"\n\n:-D\n\n-Adam"}, {"author_name": "Steve", "gravatar_hash": "28fdca798e4129cc895ac8123f0a4fc7", "author_url": null, "date": "Apr 23, 2009", "message": "&gt;That said, if you want a full chrono view, just click the &gt;“3 more comments” and you have it. Done.\n\nBut if there are less than 5 comments, there is no \"X more comments\".  How can I put the comments back in chronological order when there are less than 5 commments?\n\nIt makes the conversation thread confusing.  And the comments are a conversation a large percentage of the time."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 23, 2009", "message": "I'm with _nobody and others on hiding comments with no upvotes by default (and NOT as an optional user preference!). \n\nRight now, it's just clutter on a lot of posts. That said, I do like the appearance when there are just a couple of helpful comments."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 23, 2009", "message": "> hiding comments with no upvotes by default\n\nI am definitely considering this, but as you pointed out, on shorter questions it seems counterproductive.\n\nPerhaps that rule should only be in effect on questions with more than 10 answers?"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Apr 23, 2009", "message": "I'd like to be able to set a threshold for the number of votes a comment needs to appear automatically. Personally I'd set this to at least 2 votes so that no single user can force a comment to appear but I suspect that I'd set it higher over time so I only see very popular comments.\n\nI also miss being able to reload the comments without having to reload the page."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Apr 23, 2009", "message": "&gt; Perhaps that rule should only be in effect on questions with more than 10 answers?\n\nis that 10 answers total, or 10 answers with comments?"}, {"author_name": "BCS", "gravatar_hash": "6757caf55de0413ae0994293e001d465", "author_url": null, "date": "Apr 23, 2009", "message": "It might be better to have it the top 3kB of comments or the top 15 lines of comments as that fixes it at an amount of screen space."}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://stackoverflow.com/users/437", "date": "Apr 23, 2009", "message": "&gt; are you sure you’re talking about Stack Overflow?\n\nOh, sorry. Actually, I was talking about a question and answer site."}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Apr 23, 2009", "message": "Now I'm unsure if I should roll the points/clarifications people make in the comments into my own answer or simply let the comments stand on their own.\n\nWhat is the correct thing to do here?"}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://stackoverflow.com/users/437", "date": "Apr 23, 2009", "message": "How about this? Instead of having a \"top n shown\" user preference, make it \"always show comments with at least n votes\"? \n\nYou could have n default to 1 (which some of us think makes more sense) or 0 (which you seem to prefer)."}, {"author_name": "Peter", "gravatar_hash": "745edd0ed5ca0851d9134bff34dd6588", "author_url": null, "date": "Apr 23, 2009", "message": "I like that it shows some comments by default, not sure about the top \"n\" disregarding the chronological order."}, {"author_name": "Jab", "gravatar_hash": "b0239ab2e5fd4b37a96e689ab60d823d", "author_url": "http://rndnext.blogspot.com", "date": "Apr 23, 2009", "message": "I'm not liking the order of the comments.  I like the idea of having voting on the comments, but maybe just a different css style based on up votes would be better suited.  I would personally leave non-up-voted comments the current light text color, and darken the up-voted comments a bit to emphasize their value.\n\nI know you don't want the meta-discussion.  But there are questions out there with meta-discussion in the comments already.  The change makes them out of order and context in a lot of places.\n\nNote, some of these are 5 comments or less.  This means you can't get the original order."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Apr 23, 2009", "message": "Is a part of the decision to go this way to reduce the queries that were done when people were opening and closing comments?"}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 23, 2009", "message": "I understand that you don't want comments to be a discussion, but the reality is that they often are, and often productively so.  Seeing comments out of order will be very confusing.  (Especially when there are five or fewer, meaning there is no way to get the correct order.)\n\nTo the extent that a comment is in response to the question or answer, order matters little.  But to the extent that a comment is in response to another comment, order really matters.\n\nI'm not saying, \"Let's add this new meta-discussion feature,\" but comments are very useful for discussion about a question or answer.  Scrambling their order will be confusing."}, {"author_name": "Matt Hamilton", "gravatar_hash": "2bd5f782c135ff7ed12a95bf209eb973", "author_url": "http://www.madprops.org", "date": "Apr 23, 2009", "message": "I'll add my +1 to the idea of showing the five highest-rated comments but in chronological order. Like it or not, most comments (apart from the first on each post) are in response to other comments."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Apr 23, 2009", "message": "I'd also suggest disabling the vote for the comments until after the user selects to see all of them - context, if we're going for discussion, is important in deciding whether a comment is valuable or not."}, {"author_name": "Bremen", "gravatar_hash": "9a45de8df0c5c3f6e137c785e71557b8", "author_url": null, "date": "Apr 23, 2009", "message": "&gt;Comments should be relatively standalone in that they relate to the post.\n\nIt's too late for \"shoulds\", this isn't a small beta community anymore. Comments ARE used for chronological discussion (primarily clarifications and expansions of ideas/feedback) because they have no place in the standard Q/A sections. \n\nIn a perfect world, good comments would be edited into the answers themselves, maybe that would be a better approach -- comments above a certain upvote threshold get \"appended\" to the answer text, while still remaining part of a hidden chronological discussion? I'd also argue that Most comments don't deserve upvoting, so leaving chronological comment discussions \"hidden\" and simply \"promoting\" upvoted-past-a-threshold comments to answer-appended status would provide the best of both worlds.\n\nRegardless, comments are necessarily chronological because nobody posts a perfect question or a perfect answer, and the appropriate method for improving writing is iteratively (which can only happen chronologically)."}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Apr 23, 2009", "message": "This is great. I expand comments about 90% of the time.   \n\nDid you see statistics on how much SO users expand comments or something?  If you did, this is a great example of \"watch how your users use the system\", If you didn't it was a great hunch!!! :) :) \n\nI don't think preference is needed. It won't hurt either.  After all as Joshua Bloch says: You can't please everyone so aim to displease everyone equally. http://bit.ly/RjAkS"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Apr 23, 2009", "message": "I have to agree with an earlier user. I like the new features and the search engine stuff but it does make the comments blend in too much with the answer. I liked the old UI but if something could be done to contrast a little more it would be nice."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 24, 2009", "message": "even more changes to comments tonight."}, {"author_name": "patrick", "gravatar_hash": "c0a33aa9d97926947861c0699eb37f82", "author_url": null, "date": "Apr 25, 2009", "message": "Like?"}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Apr 25, 2009", "message": "Once again I feel it necessary to say that I really don't like these recent comment changes. I saw one recent question with 100 odd comments and the top 5 or so voted add nothing. In fact they're actually confusing because they're selected seemingly at random from the 100.\n\nThe point is you have to read all the comments together to get proper context. Selecting comments out of that context can lose, distort or otherwise change that meaning."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 26, 2009", "message": "> I saw one recent question with 100 odd comments \n\nflawed question, almost by definition"}, {"author_name": "Jonik", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Apr 27, 2009", "message": "I wasn't a fan of the new comments functionality at first, but after the latest tweaks, I think it's starting to shine! (Specifically, it is important to *always* show them in chronological order - automatic switching between orderings can be very confusing/annoying.) \n\nFor example in questions like http://stackoverflow.com/questions/38210 I'm starting to appreciate the way comments with (the most) upvotes are visible by default, while others are not."}, {"author_name": "Michael Haren", "gravatar_hash": "f4f4b5a6f27f72b32d42463b1a25e0df", "author_url": null, "date": "Apr 29, 2009", "message": "Jeff-- I'm liking the new comment changes, too.\n\nAlso, I'm not sure when this started--maybe it's always been there--but shortening the display of URLs in comments with \"...\" is awesome polish. Nice work!"}, {"author_name": "BradC", "gravatar_hash": "c5c2165949f71bcd1fafbd8e694ab5f2", "author_url": null, "date": "Apr 29, 2009", "message": "After I click \"show 27 more comments\", I can't hide them again! Where's my \"hide comments\" button?\n\nI realize this behavior isn't well-specified (it could hide just the \"extra\" you showed, or it could hide all comments, even the original \"top comments\")"}, {"author_name": "Cell Detective", "gravatar_hash": "2e0d675f351c6edc4a67cb718ec3640c", "author_url": "http://tinyurl.com/nfjvb9", "date": "Jun 02, 2009", "message": "Any idea if there are similar blogs like this related to read?"}]}