{"response": [{"author_name": "David", "gravatar_hash": "23d82ea2162e72a5d0fd124d88141d2a", "author_url": null, "date": "Apr 30, 2009", "message": "Just a quick note: this doesn't seem to be an issue with using blogger as your OpenID provider."}, {"author_name": "Brian Boatright", "gravatar_hash": "3e1f0ea43c0a4cb33eb65ec349901feb", "author_url": null, "date": "Apr 30, 2009", "message": "I didn't have any problems using it this morning to login, but it was a Blogger OpenID that requires me to login with my gmail account. I use the same one on both sites."}, {"author_name": "Mike", "gravatar_hash": "7cd2dfec42419c9791031b2e86ea9b68", "author_url": null, "date": "Apr 30, 2009", "message": "This is actually good to know. I consider this a feature. I thought when I logged into any OpenID-enabled site with my Google account, the URL could be matched up with any other site that used OpenID. Now that I know this is not the case, I'm a lot happier about the privacy aspect of Google's OpenID service!"}, {"author_name": "Mark Biek", "gravatar_hash": "040ffc7f3327b05f01c54a8bef3ba60a", "author_url": null, "date": "Apr 30, 2009", "message": "Would using an OpenID delegate avoid this problem?"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Apr 30, 2009", "message": "On a slightly different issue, I've noticed that if I try to add the \"right\" Google.com OpenID to my Server Fault account, I'm barred from doing so, because it's not \"on the Server Fault beta list\".\n\nWould it be sensible to relax that check for people who are adding a new OpenID to their existing Server Fault account?"}, {"author_name": "Nicholas Riley", "gravatar_hash": "fbff5bc41ed88240c76f35d6fe5bf12f", "author_url": "http://njr.sabi.net/", "date": "Apr 30, 2009", "message": "No, using a delegate does not help as it's the resolved URL that gets matched, not the original one.\n\nMy delegated URL is a Yahoo! one, and it also seems to be broken."}, {"author_name": "Stephen Darlington", "gravatar_hash": "de1c8686d474f502849acbf1d19ac4b7", "author_url": "http://www.zx81.org.uk/", "date": "Apr 30, 2009", "message": "I tried this previously with my Technorati account and it didn't work. What I found is that the OpenID that you want to try can't be your \"Alt OpenID,\" it has to be the main one. \n\nNot sure if that's technically correct but it worked for me."}, {"author_name": "Chas. Owens", "gravatar_hash": "844c572938eaad1e44eb084fb39416f9", "author_url": "http://wonkden.net", "date": "Apr 30, 2009", "message": "While I would like to participate in the beta, asking me to get a second OpenID when the whole point of OpenID is that I don't have to manage multiple usernames/passwords seems a little silly."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 30, 2009", "message": "Chas -- I can't think of a workaround, since Google OpenIDs are effectively 100% unique strings per-site. There's no way to \"fingerprint\" the account.\n\nI guess we could ask you for other unique information about your account on Stack Overflow, if you've filled it in.."}, {"author_name": "Steve Armstrong", "gravatar_hash": "56f9b48c5923891a50d682611be2d764", "author_url": null, "date": "Apr 30, 2009", "message": "Jeff, if a delegate wouldn't work, could you explain why? Don't you guys link the account to the OpenID identifier, which is the delegate, and ignore authenticate against the  Identity Provider, but forget about it thereafter?\n\nI use my own domain as my Identifier, which delegates to myopenid, and I don't see myopenid anywhere in my profile. If I was delegating to Google, would I still have a problem? Or is the issue just with using Google for your Identifier, not your Identity Provider?"}, {"author_name": "Steve Armstrong", "gravatar_hash": "56f9b48c5923891a50d682611be2d764", "author_url": null, "date": "Apr 30, 2009", "message": "Wow, my second sentence is gibberish. Should be:\n\nDon’t you guys link the SO / SF account to the OpenID Identifier? Then if it's a delegate, resolve it, and use the result to authenticate against the Identity Provider, but forget the resolved address thereafter?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 30, 2009", "message": "I said nothing about delegates; you can view source on codinghorror.com and see how my delegation works. It shows up as the blog URL."}, {"author_name": "Daniel L", "gravatar_hash": "022a3ce92bd519e3219e50b639c7b948", "author_url": null, "date": "Apr 30, 2009", "message": "I guess an alternate (undoubtedly more difficult to implement) approach would have been to add something to the SO user profile page where qualifying users had one shot to submit an open id to be added to the serverfault beta list. \n\nIf such a feature had existed, I could have added the SF version of my google open id to the beta list myself ;-]"}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Apr 30, 2009", "message": "My SO login quit working and I've entered a ticket at uservoice and emailed the team, but I've received no response. I use a delegate and nothing has changed on my end that I know about. SO logs me in as \"unknown (yahoo)\" now instead of my correct user name.\n\nNeedless to say, I'm also not able to log in to SF."}, {"author_name": "Bill", "gravatar_hash": "690df524b8dd8e5d5cbf268e5bdd531f", "author_url": "http://wdr1.com/blog/", "date": "Apr 30, 2009", "message": "I agree w/ Mike.  This is how I'd expect it to work &amp; would definitely consider it a feature. \n\nSimply because one site knows of my identity, doesn't mean I want another to allow a completely site the ability to connect my activities together.  \n\n(In fact, I'd argue sites that _don't_ do this should.)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 30, 2009", "message": "> Simply because one site knows of my identity, doesn’t mean I want another to allow a completely site the ability to connect my activities together.\n\nThis claim is IMO rather silly because you're initiating a LOGIN PROCEDURE on the target site. It's not like Server Fault is sitting out there vacuuming up user credentials from the web.\n\nIn other words, I'm guessing you use the same email address as a login credential on multiple sites, yes? Then claiming that one site can \"know your identity\" by entering the same email address in two places is a little bit crazy in my book.\n\nNo offense intended, but I'm.. just.. sayin'.."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "May 01, 2009", "message": "Can't you use e-mail to link the accounts together? You can request the e-mail address from Google on the first login and match it with the one in the StackOverflow database. Of course that would require some extra code, but hey, it's a workaround.\n\nAnother workaround would be a link from SO to SF with some kind of token and then use that token to link the two accounts together.\n\nThe point of OpenID isn't to allow different sites to identify you between themselves. It's to allow you to log in without entering a login and a password."}, {"author_name": "Richard", "gravatar_hash": "3c291e7858e6b79e06889fa7dbf16d31", "author_url": null, "date": "May 01, 2009", "message": "A possible workaround:\n\nCreate a blogspot blog from your Google account\n\nUse the blogspot URL instead of the Google URL - it runs under the same credentials."}, {"author_name": "Enoc", "gravatar_hash": "ea8d2d7aa5cfadd9396e660a1e00e537", "author_url": "http://stackoverflow.com/users/54289/enocnroll", "date": "May 01, 2009", "message": "Alright, thanks.  I signed up for a myOpenID account and that got me into serverfault.com.  My wordpress openid wasn't working for me either.  That might have had something to do with the fact that I recently added some domains to the blog, whereas I created my SO account using the original WordPress blog URL?  It's moot now, myOpenID henceforth!"}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "May 01, 2009", "message": "Thats a dandy solution, except that serverfault doesn't allow you to change your openid providers even after being approved on an alt.  And you can only have 2 providers.  Thats really annoying in practice.\n\nTo be fair, I do know that answer to all ails with OpenID is JQuery.\n\n\n\nOr was that myopenid that is the answer? :)"}, {"author_name": "Fowl", "gravatar_hash": "edd73df39a0c7d85da3e01ce29f4bc3c", "author_url": null, "date": "May 02, 2009", "message": "Isn't it possible to set up some nifty redirects between the sites a few times to link it all up?"}, {"author_name": "tinkertim", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": "http://echoreply.us", "date": "May 02, 2009", "message": "That worked! Thanks :)"}, {"author_name": "Stefan", "gravatar_hash": "6a4c00e6470c5b5c913f4d3f37db7b62", "author_url": null, "date": "May 02, 2009", "message": "I agree with Fowl. Login with unknown google openid could direct to other site with token. Then currently logged on user could get the new openid identifier from a shared token directory and then bounch back to the original site. A feature and requiring some work but very convenient."}, {"author_name": "Kevin H", "gravatar_hash": "3dc7e21f80eaeac65920752c7d315af2", "author_url": "http://www.burntpopcorn.net", "date": "May 04, 2009", "message": "One alternative is to use OAuth to bond them together. Have serverfault.com ask the user to log in to stackoverflow.com, and send back the unique cookie."}, {"author_name": "Steve Schnepp", "gravatar_hash": "693f9a2f0eea07660d81e9690b6afd96", "author_url": "http://www.pwkf.org/", "date": "May 06, 2009", "message": "@Pies: +1 for the token\n@Kevin H: the cookie is too cumbersome, the user could just copy/paste some information. SF &amp; SO are for technical ppl anyway.\n\nA copy/paste SSO scheme would be enough : \n\nSF asks your SO user url, then presents a link to a special page in SO that generates a unique token only visible to your user. You just copy/paste it back in a SF page to link the 2. SF knows now the Google hash for your account."}, {"author_name": "server", "gravatar_hash": "9dd685c09a679aaa16a51f00b62256d3", "author_url": "http://www.servetr.com", "date": "Jun 11, 2009", "message": "Very nice job!"}, {"author_name": "Macha", "gravatar_hash": "e683c28f47a47425527c1d5fed11eec0", "author_url": "http://mackha.wordpress.com", "date": "Jun 21, 2009", "message": "Has this been fixed since? Is there any sort of crossover between the SO/SF accounts now the beta is over?"}, {"author_name": "Kurt Miebach", "gravatar_hash": "a2ae7d512e6206aafe541551b4271d32", "author_url": null, "date": "Jul 27, 2009", "message": "Why don't you create a single sign-on system? \n\nYou could have one site for login:\n\nhttps://login.stackoverflow.com\n\nwhich would be an OpenID RP, and to where you would redirect users from either stackvorflow.com, serverfault.com or superuser.com and\npropagate the authentication token to the requesting site.\n\nI think it is a good thing how google handles this. So a site where a user logins with open ID cannot neither learn about the user's google account nor about his logins on other sites. It is an improvement of user's privacy."}, {"author_name": "salvin francis", "gravatar_hash": "b732c13c9d7b82bfab07b3c460377ddd", "author_url": "http://www.salvin.in", "date": "Apr 09, 2010", "message": "The whole thing gives me the creeps.\nIts realm that's the issue. You probably have to give a realm in such a manner that it matches both the sites. However any such change will screw stack overflow as ALL the Existing accounts will stop working !!\n\nHowever, be assured that the open id will be the same for all the sites. Let me repeat that: ALL the Sites.\n\nHeck I will even reckon keeping it something lame as 'http://*.com\".\n\nTen cents that it will work in all scenarios :)"}, {"author_name": "salvin francis", "gravatar_hash": "b732c13c9d7b82bfab07b3c460377ddd", "author_url": "http://www.salvin.in", "date": "Apr 09, 2010", "message": "Oops it does not work that way :)\n\nI tried testing something similar with \"http://*\"\nguess i lost my 10 cents.\n\norg.openid4java.message.MessageException: 0x301: Realm verification failed (8) for: http://*\n\nguess u have to figure out something better, Kurt Miebach's solution seems good."}, {"author_name": "Dave", "gravatar_hash": "200225a606fb60085321c7d3e81eab6a", "author_url": "http://www.101domains.com/", "date": "Apr 22, 2010", "message": "I was having problems with my open ID with wordpress, it took me ages to figure out. Thankfully with a few perusals of the settings I sorted everything out!"}]}