{"response": [{"author_name": "Kyle", "gravatar_hash": "4cf2718a8ba769387e77245244ffc802", "author_url": "http://www.fitnessconnections.com/blog/", "date": "Apr 29, 2009", "message": "Jeff,\n\nWith absolutely no disrespect intended to the wonderful work you and the StackOverflow team do on the site, I think duplicates could be eliminated, or at least dramatically reduced if the search feature were improved upon.\n\nHave you considered using the Lucene.NET search provider, or similar?\n\nJust a thought."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 29, 2009", "message": "Disagree.\n\n- I've seen thematically identical questions asked with ZERO words in common. Last time I checked, Lucene wasn't magical faerie dust, unfortunately.. :)\n\n- The types of users who ask duplicates are often bound to do it no matter what UI or roadblocks you put in front of them.\n\n- Google search is always available, of course, using the site:stackoverflow.com operator. Our \"no results found\" page even fills it in for you and makes this a one-click operation"}, {"author_name": "John Sheehan", "gravatar_hash": "54b75f6fbf4434162bfcda6b0cb9b86b", "author_url": "https://twitter.com/johnsheehan", "date": "Apr 29, 2009", "message": "If you're question merger doesn't do this already, it should set whatever question ID is being eliminated to permanently redirect to the remaining question."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 29, 2009", "message": "The old question will 404; I'm leery of automatic redirects in this case, as it feels a bit .. experts-exchange-y.. for some reason."}, {"author_name": "Chris Lasher", "gravatar_hash": "0b5c9699fa348a28c4accd81ebce0a91", "author_url": "http://gotgenes.com/", "date": "Apr 29, 2009", "message": "I think you missed a significant scenario which leads to \"Accidental duplicates\" that's rather common. Sometimes (oftentimes?) it's difficult to formulate a question using the terminology appropriate for a particular realm of knowledge, especially if you're unfamiliar with that realm. Additionally, consider that if you're unfamiliar with that realm, you're more likely to ask a question about it.\n\nFor example, take my recent question on redirection in Django: http://stackoverflow.com/questions/798604/. Had I known what I was looking for was called \"redirection\" I would have been able to JFGI. The problem is while I knew what I wanted to do, I couldn't identify the right terminology to find it by a search. That's where humans excel over computers: they can understand semantics of my question and place it in the correct vocabulary. In other words, the newbie says, \"I want to do foo,\" and the guru says, \"That's called doing bar.\"\n\nThe proper response to a case like this is indeed just saying, \"You're looking for this; here is a link to the docs, a similar questions page on Wikipedia, etc.\" This seems to be what's happening on SO. Quite frankly, I don't mind these duplicates at all. I consider them \"you gotta start somewhere\" duplicates."}, {"author_name": "Chris Lasher", "gravatar_hash": "0b5c9699fa348a28c4accd81ebce0a91", "author_url": "http://gotgenes.com/", "date": "Apr 29, 2009", "message": "Hmm, upon rereading \"subtle duplicates\", it seems you perhaps categorized the scenario I presented above to that category, instead of \"accidental duplicates\". In that case, I suppose you can disregard my above comment, though it's not entirely clear to me, and perhaps to others this is what's meant."}, {"author_name": "Andy Baird", "gravatar_hash": "992221ea094450d55784b1f95dd27753", "author_url": null, "date": "Apr 29, 2009", "message": "My only problem with this is sometimes \"doing due diligence\" doesn't get you far as I'd like to. The search behind SO seems to be a little weak, I rarely seem to get what I'm looking for out of it and generally have better luck with Google. This is okay of course, but from my perspective as a user I don't find the search to be a very trustworthy function, and as a result, don't use it as much as I should."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 29, 2009", "message": "&gt; The old question will 404; I’m leery of automatic redirects in this case, as it feels a bit .. experts-exchange-y.. for some reason.\n\nCrazy idea: why not keep the text and the links for both questions separate, but have the answers for duplicate questions appear on both? Basically, two questions will share a body of answers. This way users can get their questions answered without being closed and Googlers have a greater chance of finding the answer they need if the same question can, and is, phrased in different ways by different people. Just a thought."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 29, 2009", "message": "Wow, glad to hear you guys can merge questions finally! I would assume you have a queue of questions closed as \"exact duplicate\"... (...or should we be flagging these for review on top of closing)?\n\nA 301 redirect seems more appropriate than a 404 for two reasons: \n\n  1) If the author of the closed post comes back to look for it, finding it gone is likely to prompt yet another duplicate.\n  2) If Google has already indexed the page, it may take a little while for it to update; in the meanwhile, you'll get folks showing up looking for their search result and finding nothing.\n\nThe latter will correct itself in time, and the former could be mitigated somewhat by automatically updating links in the profile of the user whose question \"lost\"... but a redirect is cleaner."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 29, 2009", "message": "Oh... and when you get around to doing a UI for this, my recommendation is to look at the conventions already developed for marking and closing duplicates:\n\n  1) When a possible duplicate is identified, a link (or set of links) is edited into the question as the first paragraph (so that it can be seen on the summary page) or posted as a comment. Then voting begins.\n\n  2) If it can be argued that the question is sufficiently different from the one posted, a comment is posted describing the differences. If the duplicate link was edited into the post, the edit can be rolled back, or moved into a \"see also\" section at the bottom of the post. Note that when multiple duplicates or near-duplicates have been found, the subtle differences argument is unlikely to fly - chances are, answers to existing questions more than adequately cover this new scenario even if it was not explicitly asked previously.\n\n  3) Once 5 people have voted to close as \"Exact Duplicate\", etiquette demands that a link be preserved in the question, even if there is still some disagreement as to whether or not it is truly an exact duplicate. If a sufficient number of people feel that the new question can stand on its own, then they can vote to re-open it.\n\nAt any point in this process, both the new and old questions may be edited, either to make the original more general (in cases where good general-purpose answers were provided for an unnecessarily specific question) or to make the new question more specific (and thus less likely to fall under the scope of the old question). \n\n---\n\nNote that this process depends heavily on there being a period of time post-closure for the resolution of disputes, although such disputes are relatively rare. \n\nNote the importance of providing a duplicate link and visible indicator on the post up-front. Not only does this avoid leaving the person asking the question hanging while he sees close votes accumulate on his question, but also helps prevent wasting the time of people who might otherwise provide answers that mirror those already given for the original question.\n\nFinally, note that many questions are duplicates of multiple previous questions."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 29, 2009", "message": "to see our current question 404 page, try this\n\nhttp://stackoverflow.com/questions/99999999/no-this-question-doesnt-exist\n\nNote that google and local search are one click."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 29, 2009", "message": "y'know what's better than one click...?"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 29, 2009", "message": "Actually, if the titles are sufficiently different then the 404 search links may be effectively useless. And chances are, if the title was close enough to the original, the pre-post search would have alerted the person asking it in the first place..."}, {"author_name": "Sung Meister", "gravatar_hash": "409261beec25d8d5e7f821fcfae72351", "author_url": null, "date": "Apr 29, 2009", "message": "So what's so useful about \\No this Question Doesn't Exist\\ link? =&gt; http://stackoverflow.com/search?q=no+this+question+doesnt+exist"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 29, 2009", "message": "Sung Meister:\n\nThe Google result shows that the internal search is not very complete: http://www.google.com/search?q=site:stackoverflow.com/questions%20no+this+question+doesnt+exist\n\nI'm guessing that if the question had some more specific words the results would be better.  Or if it could use the tags of the original question rather than just the title.  Of course search seems a bit pointless in this case: the site already knows exactly which question is being searched for.  It seems like providing a link to the duplicate would be the polite thing to do.\n\nWill the asker get some sort of notification of the duplicate?  I can see a scenario where someone asks a question, doesn't get an immediate answer and comes back in a few days to find their question has been deleted.  Maybe this is unlikely.\n\nJeff:\n\nThank you for this feature.  I'm trying out your advice on the accidental/borderline duplicate I asked."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 29, 2009", "message": "Yay, duplicate handling!!!\n\nThe fastest way to answer someone is to say, \"Your question is a duplicate to another and here are the answers to *that* question.\"  And Jeff, if the SO search and if the \"ask a new question\" search were better, I bet that a fifth of duplicates would be eliminated.\n\nUsing the definitions above, I'm OK with exact duplicates (category 1) returning a 404.  But you need to notify the user somehow to give both a carrot and a stick. Just whacking the redundant cut-and-paste dupes may encourage more aggressive duplicating.\n\nFor accidental duplicates (category 2), IMO, doing a 301 redirect is the better solution here, at least for a time.  Question:  What happens to votes (and *and* down) applied to the duplicate question?  Will this be considered \"deleted\" or a new kind of invisible?  Will 10k users still see it?\n\nThere are also accidental duplicates of a category you didn't mention:  Questions where a human being can easily tell it's a duplicate, but it asks the exact same question in a way significantly differently from the original, using different words and different terms.  We may wish to handle this differently.  When the questions are asked differently enough, there's clear value to leaving both questions on the site and merging the answer sets.  (As \"nobody\" says above and as I suggested at http://blog.stackoverflow.com/2009/04/how-many-questions-are-closed-or-deleted/#comment-20309 earlier.)\n\nFor borderline duplicates, links to \"see also\" at the bottom of the question are useful.  At some point this becomes a matter of judgment.\n\nRegarding finding duplicates, I think we need a voting system where votes can be taken back.  I've voted to close as duplicate and later seen a comment that make it clear the question wasn't a true duplicate.  But I couldn't undo my vote to close as duplicate.\n\nI think we need a separate system for handling duplicates.  That is, \"close as duplicate\" should be used for category #1 duplicates, but all other duplicates should maybe be handled separately, through a separate system."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 29, 2009", "message": "What category would this question fall into?\n\nhttp://stackoverflow.com/questions/804916/why-do-developers-hate-sharepoint\n\nThe question is \"Why do developers hate SharePoint?\" and it was marked redundant to \"What are your biggest complaints about Sharepoint?\".\n\nA sizable minority of questions closed as redundant fall into this bucket."}, {"author_name": "John Fouhy", "gravatar_hash": "cdca0dc45085388c1b753104ce4c8648", "author_url": null, "date": "Apr 29, 2009", "message": "I wonder if you could use duplicate questions to improve the search?  It seems like you could retain duplicate questions (even if they are \"deleted\") for searching purposes, but provide the dup-ee instead of the dupe.\n\ne.g. someone asks: \"How can I build a Thingumy in frob++?\"\n\nLater, another person asks: \"Dohickies in frob++ -- any ideas?\"  A commenter notes: \"Dohickies are more commonly known as Thingumies\" and others vote to close as \"exact dupe\" of the first question.\n\nLater still, person 3 starts composing a question about dohickies.  The search finds question 2, notes the close information, and returns question 1 as a result."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Apr 30, 2009", "message": "&gt; I’ve seen thematically identical questions asked with ZERO words in common.\n\nIf one of these was merged, what happens to the second question's title. Is it lost? or is it somehow associated with the merged question?\n\nIf it's not remembered, and the question title that remains is the least likely to be searched on, and the one that was lost is the more likely to be used to ask the question again, then you're setting yourself up to have multiple duplicates again in the future."}, {"author_name": "Henry", "gravatar_hash": "a9613b1e367b3f0a3803a73ed3a18103", "author_url": null, "date": "Apr 30, 2009", "message": "Just out of curiousity, how does the merge function handle the rep score for the two users who posted the questions?"}, {"author_name": "Chris", "gravatar_hash": "f89b5f030e5a8a254249d477f88b24f4", "author_url": null, "date": "Apr 30, 2009", "message": "Well if you bothered to use open source software, this problem has already been solved in Bugzilla and Trac obviously, plus a lot of less well known software.  You would customise it somewhat, renaming \"Bugs\" to \"Questions\" etc. but it is vastly the same problem.  Reinventing the wheel much?"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Apr 30, 2009", "message": "How are accepted answers and bounties handled?\n\nI assume that rep gained from accepted answers to questions that are deleted in a merge will be lost. I'd hope that the OP of the question that answers are merged to would be notified so that they might re-evaluate their accepted answer, although the way the Recent Activity page works I'm guessing that unless the answers were for \"today\" the user wouldn't be notified via that page.\n\nIs it possible to merge questions with bounties? Of course the likelihood of that happening is low as bounty questions have to have been around for 2 days before the bounty can be closed, but it could still happen that you wanted to remove an old bounty question and merge it with a newer question, or does it always force the newest question to be deleted?"}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 30, 2009", "message": "&gt; Well if you bothered to use open source software, this \n&gt; problem has already been solved in Bugzilla and Trac \n&gt; obviously, plus a lot of less well known software.\n\nI think their solutions are as weak (or weaker) than the SO one.  In what ways do you think they are better?"}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "May 02, 2009", "message": "&gt; If you’re question merger doesn’t do this already, it should set whatever question ID is being eliminated to permanently redirect to the remaining question.\n\nMaybe the 404 page for merged questions could say that the question was merged, link to the question it was merged into?"}, {"author_name": "Ben", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "May 03, 2009", "message": "For my money, duplicates are nearly always a search problem.\n\nNot wanting to harp on about this (uservoice already knows), but if you search for \"f# convolution\", you don't get an answer.\n\n\"But you should have put the f# in []\"\n\"Use uppercase F#\"\n\"Use Google Search (link provided)\"\n\nDON'T MAKE ME THINK!\n\nFor starters, the first two solutions quoted here aren't on the 'nothing found' page, and it was only after reading this post that I even noticed the Google link - dunno, the RED TEXT kind of holds the eye.\n\nAnd your average Joe User isn't going to think that far, they'll just conclude that there is no question and write a new one. And unless I'm mistaken, even the Ajax existing questions list won't pick up on \"F# convolution\".\n\nhttp://stackoverflow.com/questions/803055/how-do-i-do-convolution-in-f\n\n(No, not my question, just a usefully specific question title)"}, {"author_name": "MarkJ", "gravatar_hash": "1f3ce1ae1497058e8efd34a05dbdee22", "author_url": null, "date": "May 07, 2009", "message": "Another type of duplicate question (might be rare). Someone asks a question using an anonymous account, then gets a proper account with OpenID, wants to continue with the question but can't find a way of merging the two. So they ask it again.\n\nFor instance these.\nhttp://stackoverflow.com/questions/833413/conversion-from-vb6-string-data-to-net-byte-array\n\nhttp://stackoverflow.com/questions/785181/interpret-string-data-as-float"}, {"author_name": "centribumble", "gravatar_hash": "7324e37f02b8a930d28c15bcfca4ddfe", "author_url": "http://www.centrifugalbumblepuppy.com/card/matt-16-birthday.html", "date": "May 15, 2009", "message": "&gt; Well if you bothered to use open source software, this\n&gt; problem has already been solved in Bugzilla and Trac\n&gt; obviously, plus a lot of less well known software.\n\nI'm not so sure about that. More often than not the bugs that I post to Bugzilla, Launchpad etc. get flagged as duplicate by a moderator (usually a developer)."}]}