{"response": [{"author_name": "Jason Punyon", "gravatar_hash": "44302dd1c18f747ba4fff5f689c475ba", "author_url": "http://jasonium.com", "date": "Apr 22, 2009", "message": "When you have the actual data in front of you, SO seems like its starting to approach the uncanny valley.  We're getting to the point where everyone is focusing so hard on the tiny imperfections..."}, {"author_name": "moron", "gravatar_hash": "da99e7ca457fb13427f536dd7cbd81a2", "author_url": null, "date": "Apr 22, 2009", "message": "The same names seem to pop up far too often as voting to close questions. \nIf your question doesn't conform to, for instance, these names' definition of a \"real question\" then too bad. \nIt's like the answerers get to set the questions"}, {"author_name": "Michael Haren", "gravatar_hash": "f4f4b5a6f27f72b32d42463b1a25e0df", "author_url": null, "date": "Apr 22, 2009", "message": "I think you see a lot of repeat closers because they are some of the most active (in terms of time) members of the site. Sure, they might be exclusionists, too, but these numbers (1 in 25--not 1 in 50) seem to indicate that they're doing a good job."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 22, 2009", "message": "> but these numbers (1 in 25–not 1 in 50)\n\n4% are closed; as I said in the post, half of those are <i>EGREGIOUSLY</i> not programming related, spam, or garbage -- by any definition.\n\nThus: 2% are legitimately in the grey area.\n\n100 / 2 = 50."}, {"author_name": "Michael Haren", "gravatar_hash": "f4f4b5a6f27f72b32d42463b1a25e0df", "author_url": null, "date": "Apr 22, 2009", "message": "Ah, my bad--sorry about that."}, {"author_name": "me", "gravatar_hash": "bfb40fd549ddac9745ad7ec50b3b2995", "author_url": null, "date": "Apr 22, 2009", "message": "Am I missing something with these figures?\nFor a non valid question the route is close and then possibly delete, yet you state there have been 9,794 questions deleted and 5,900 closed ?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 22, 2009", "message": "- you can delete your own question (in certain circumstances)\n\n- spam/garbage tends to go straight from open to deleted\n\n- pure duplicates tend to be directly deleted if found"}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Apr 22, 2009", "message": "@me: I’d guess that the closed count is the number of questions that are currently closed, and haven’t been deleted yet.\n\nSo the tola number of questions that have ever been closed is 5,900 + 9,794."}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Apr 22, 2009", "message": "I know you've declined this because of your available bandwidth ( human bandwidth ) but, doesn't all the non-programming related questions call for a sister site? \n\n\nSomething like the Meaningless Drivel of JavaRanch ( http://www.coderanch.com/forums/f-32/Meaningless-Drivel ) but with the cool SO features. \n\nI think eventually a lot of questions will emerge and be closed from serverfault.com because they are \"not-it\" related ( and the history will repeat, what is IT related? Real life problems - server is down..- or pretty much anything in the industry )  or because they are subjective and argumentative.\n\nThis is the most similar uservoice I've found.\n\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/74945-host-sister-sites-for-non-computer-related-subects\n\n\nRegards."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Apr 22, 2009", "message": "@Oscar \nIf the 'not programming related' is going to just involve discussing last nights pop idol then there is no need for another site.\nIf it is to discus Oracle's takeover of sun or H1B caps then somewhere like Joel on software is probably a better place to discuss it.\n\nI do think a lot of social/work aspects of programming questions get closed unnecessarily. \nIf you are a rampant question closer, consider that SQL isn't Turing complete and therefore not a programming language - so all database questions are not programming related!"}, {"author_name": "moron", "gravatar_hash": "da99e7ca457fb13427f536dd7cbd81a2", "author_url": null, "date": "Apr 22, 2009", "message": "So 2% of questions occupy a grey area.\nIf it's a grey area and it's only 2% then the default should be to leave them in, maybe with a NotForPedants tag so these people wouldn't have to read the question more than the one time that originally p***ed them off enough to be arsed to close it"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 22, 2009", "message": "(This is only to illustrate a point.)\n\nBut also, even if every one of those questions deserved the close, we are talking a 24:1 signal to noise ratio (based on the split mentioned). So why close at all, the ratio is pretty damn low as it is. Apparently, we know when enough is enough with regards to off topic-ness. The close function only serves to antagonize those whose questions are closed.\n\nThe argument of small numbers works for both sides. If it is inconsequential enough to argue that the other side shouldn't be making a fuss, then it is equally inconsequential to perform the action in the first place."}, {"author_name": "Marc", "gravatar_hash": "622422c50c87ae1ff41f8174a24bd6d9", "author_url": "http://www.whostolemypc.com", "date": "Apr 22, 2009", "message": "Like @moron says, it does seem to me that it's a relatively small group of people that close questions. What I'm wondering is what drives these people to do it? Do they get reputation? Do they feel its their civic duty? Do they get off on killing others' questions? Or do they feel compelled to keep the site 'clean'? I'm leaning towards the last, as we programmers seem to suffer from OCD (occupational hazard?).\n\nHowever, its seems that they get a bit overboard - I use the RSS feed, and I feel that if I click on a question and it's been closed, it shouldn't have been (but then again, everyone has their own threshold for this).\n\nOther sites (like Digg) offer a banning option, if the compulsive closer banned a question instead of closing it, it would result in the same effect from his POV. However, the rest of us wouldn't be punished for a few people's opinions. Perhaps if you hooked the banning to the questioner's reputation so that he'd be shamed into asking better questions, this would help.\n\nEither that or make it a little harder for a question to be closed."}, {"author_name": "Jason Punyon", "gravatar_hash": "44302dd1c18f747ba4fff5f689c475ba", "author_url": null, "date": "Apr 22, 2009", "message": "[This is only to illustrate the counterargument to the illustration of a point]\n\n@toast:  This is the path to another version of the broken windows problem Jeff alluded to in his previous blog post."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Apr 22, 2009", "message": "&gt; Either that or make it a little harder for a question to be closed.\n\nIt used to be that one person could close a question. Then three people. Then four, and now five. What more do you want?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 22, 2009", "message": "> then again, everyone has their own threshold for [determining what should be closed]\n\nSolution is simple: earn 3,000 rep and vote to reopen anything you like!\n\n\n> So why close at all, the ratio is pretty damn low as it is\n\n(This is only to illustrate a point.)\n\nIndeed, why prosecute murder, there are so few murders to begin with? Don't like murders? DON'T LOOK AT THEM THEN!\n\nAre you really proposing a system of zero boundaries and zero rules? Ask whatever you want? That's the fastest route to community immolation I can think of, though it might happen slowly enough that the frog wouldn't know it's being boiled."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 22, 2009", "message": "@Jason: Broken windows are a slippery slope.\nNot to mention that the broken window theory isn't without flaws and detractors itself http://www.washingtonpost.com/ac2/wp-dyn/A46381-2005Jan29?language=printer\n\nAnd the window is still broken regardless. The question may be closed, but it does still exist. Whatever clutter it may represent isn't magically unrepresented by it being in a closed state. Being closed it actually draws more attention to itself.\n\nAnyway, the point was that those statistics can be used to support either side of the argument. Using them as definitive proof of either is only displaying your existing bias."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Apr 22, 2009", "message": "\"SQL isn’t Turing complete\" - most versions of SQL implement proprietary features that, in fact, do make them turing complete.  The original SQL was not turing complete, of course, but power corrupts, and turing completeness corrupts absolutely.\n\nOn Topic:\n\nThanks for the stats, Jeff!  I agree that the gray area is so small that it doesn't require much attention.  \n\nI disagree with those that say, \"if it's a gray area, then leave it open\" primarily for the logical conclusion that this simply moves the gray area over a little bit, and now the same people are fighting over new, perhaps more liberal, gray area.  \n\nA line has to be set, and given that there are 5 open/close votes, anyone can get 3k rep and participate (there are currently over 800 people with this power), and it's all community managed, there is no reason to complain about a select set of exclusionists.\n\n-Adam"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 22, 2009", "message": "@Jeff: So asking a non-programming question is akin to murder?\nWhy prosecute jay-walking? There are so few instances of jay-walking to begin with. Don't like jay-walking, IGNORE IT.\n\nThere's more to rational argument than comparing things you don't like to bizarre extremes and using meaningless statistics.\n\nFor some of the questions there is disagreement. Lots of disagreement in other cases. To dismiss those disagreements because they occur in a statistically small case of all questions is wrong.\n\nAlso, you can look at it that 50% of all closed questions are disagreed upon. But then again, find me a position and I can find a statistic to back it up."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 22, 2009", "message": "> So asking a non-programming question is akin to murder?\n\nIt's more akin to Naz.. hey, wait a second!\n\nThe point is twofold:\n\na) you are advocating NO system of rules/law/justice, aka anarchy. That is Not A Solution(tm).\n\nb) when a community does not define what it is NOT, it has failed to define what it IS. And it is utterly doomed.\n\nIf b) requires that some people get their feathers ruffled because they can't do exactly what they want to do at all times, then so be it. I invite them to explore the internet for other sites that can accommodate their needs. The internet is a big place, and us trying to be everything to everybody is a fool's errand.\n\n> The question may be closed, but it does still exist. Whatever clutter it may represent isn’t magically unrepresented by it being in a closed state. Being closed it actually draws more attention to itself.\n\nClosing is a sort of purgatory / limbo, while we decide what to do with the question.\n\nMany closed posts are eventually deleted. It's the most common outcome."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Apr 22, 2009", "message": "To be more clear, \"now the same people are fighting over new, perhaps more liberal, gray area.\"\n\nIn other words, there will always be a battleground gray area.\n\nLogically the community will eventually settle on an \"accepted\" gray area, because as things become more liberal, more people will end up on the other side and vice-versa.\n\nThis means that the community itself will determine the gray area that will always be fought over.\n\nThe funny thing?  The community of 800+ people who can vote to open and close have already done this.\n\nThe few that people call out as \"ringleaders\" are simply the most active of those, and generally the more vocal, but if you look at the most recently closed list of questions you'll find hundreds of people are participating.\n\nIf you want to change this, you'll need to appeal to the community.  Given that the audience is a set of programmers, you'll likely be more successful with logical, complete arguments than appeals to common sense, sensitivity, etc.  Start by leaving comments in questions that are in the gray area - in most cases people read those comments before voting to close or open.\n\n-Adam"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 22, 2009", "message": "And let me clarify something. I don't fault your conclusion or think that no question should be closed/deleted. There is obviously some junk that needs to be shut down.\n\nI find issue with your manner of coming to that conclusion since it makes all decisions a numbers game.\n\nLook how many times you've had to single out a single question or user as a clear example of behavior 'x'. Statistically irrelevant in the context of number of questions/users on the site, but when a sizable portion of the vocal population focus on them, they become more relevant than the numbers indicate."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 22, 2009", "message": "Indeed, I am truly sorry for using the closing issue as my example of statistics being useful in proving anything as that is not what I was trying to say. Hence the disclaimer at the top."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Apr 22, 2009", "message": "&gt; we are talking a 24:1 signal to noise ratio (based on the split mentioned). So why close at all\n\nMaybe the reason the ratio is so low is *because* questions get closed. If there was no visible moderation on the site people would start posting about anything they felt like talking about and the noise would outweigh the signal."}, {"author_name": "Josh", "gravatar_hash": "b7dbeac20de8dfb41e2ea8dc23eef3ee", "author_url": "http://jberke.blogspot.com", "date": "Apr 22, 2009", "message": "I agree with Jeff that not having a system to keep the content of a certain standard is not a solution. Instead of trying to get rid of closing try and come up with other solutions. Right now there are two mechanism which help keep content to a certain standard.\n\nWe can edit the content, and we can vote to close question which we feel are not appropiate for StackOverflow. \n\nI was very dissapointed when this question was closed: http://stackoverflow.com/questions/319639/. A comment was made that people liked those answers much better, which prompted someone else to copy all of our answers to the original question, (Which means we don't get any rep if you vote up our answer on the original question). So now we have a potential feature, provide the ability for us to move answers from one question to another when the question is a duplicate. I am not advocating this as a feature but trying to show that instead of asking for a system of no rules, come up with better rules."}, {"author_name": "Jason Punyon", "gravatar_hash": "44302dd1c18f747ba4fff5f689c475ba", "author_url": null, "date": "Apr 22, 2009", "message": "@toast:  \"Broken windows are a slippery slope.\"\n\nCouldn't have said it better myself.  Leaving broken windows broken is the best way (besides actually breaking the windows yourself) to ensure there are more broken windows.  \n\nClosure and deletion of questions (like maintenance) are the solution, not the problem.  Everyone the system trusts gets a vote.  Is there a more democratic way for the community to decide what content it would or wouldn't like to include?"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Apr 22, 2009", "message": "Addition to the SO drinking game.\n\nIf (insert your opinion here) then Stack Overflow is probably not the right website for you."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Apr 22, 2009", "message": "We're programmers. \nIf 1 in 50 lines of code is not properly styled or indented, that's very distracting.\nIf 1 in 50 lines of code shouldn't be there or is buggy, that's unacceptable.\nAll I'm saying is that these statistics do not make me feel less discouraged when good questions I ask are closed or good answers I work on are deleted because some part of the community decides they're not quite right for SO.\n\nFor someone who cares about SO, considers the 'sofaq' tag \"interesting\", and is not a C#/asp.net guy, these 4% contain an annoying high rate of false positives."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Apr 22, 2009", "message": "I think Sam Hasler nailed it. The reason the ratio of signal to noise is so [high on Stack Overflow] is *because* questions get closed.\n\nGo check out Yahoo! Answers to see what the site could devolve to if left unmoderated.  I know it's very tempting to ask off topic questions on Stack Overflow because there's a high concentration of smart people here, but if we don't purge the noise that could change."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Apr 22, 2009", "message": "@Assaf Being a programmer has something to say if a community is built around that. But it's still a community, and communities are always something that you can not control like a program."}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 22, 2009", "message": "&gt; Are you really proposing a system of zero boundaries \n&gt; and zero rules? Ask whatever you want? That’s the \n&gt; fastest route to community immolation I can think \n&gt; of, though it might happen slowly enough that the \n&gt; frog wouldn’t know it’s being boiled.\n\nNoone is seriously proposing that.  What we are proposing is that if there really are only 2% of questions that are ambiguous then perhaps more leeway should be granted to them.\n\nFor example, I've seen numerous java questions stay open that were horrible questions.  That sounds bad, but its actually ok as those often ended up being resolved into good answers.\n\nOn the other hand, the other day someone posted about replacing IDE keyboard shortcuts with footpedals.  It was closed as not programming related.  You later said it was closed because it was too hypothetical.  Then finally you said it was because the question wasn't well researched enough.\n\nIn the end, I think your final summation clarifies why many of these questions get closed.  Someone reads the question, doesn't really get it, and then closes it.  But others who know what he's getting at are then frustrated by their inability to answer what they see as a legitimate question.\n\nThese questions that exist \"on the bubble\" like this can often go either way.  Sometimes they start out weak and get thoroughly edited into good and well answered questions that are a resource for us all.\n\nOther times, they descend into a meaningless, non-answered morass of wasted time.\n\nClosing them (where them is defined as the truly grey area ones, not \"which tires should I buy for my programming commute?\") doesn't clean up the site in any meaningful way, it simply guarantees which of those outcomes occurs."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Apr 22, 2009", "message": "@Olafur,\n\nMy point was that certain topics are more sensitive than others. In particular, if meta-questions are disallowed, then the community has a much harder time changing. \nIt's definitely not a democracy, if the the FAQ and ultimately the mods are closing the very questions that dare to raise the issue of their own relevance.\n\nThe analogy to code was just to show that 4%, which might seem like a small percentage, isn't really a low figure when it correlates strongly with the questions you happen to care about (in my case, SO meta-questions). \n\nThank god at least blog comments are still ok, or there would be no place to discuss these matters at all (UV being irrelevant).\n\n@Jeff, \n\n&gt;&gt; ... I invite them to explore the internet for other sites that can accommodate their needs. The internet is a big place, and us trying to be everything to everybody is a fool’s errand.\n\nWhen it comes to meta-questions - questions that help shape the community - that lines of reasoning does not apply. I don't think you really intend people who love SO but disagree on some small issue, like softness of programming related questions, to split and start their own community. So you're basically saying these are you marbles and you make the rules of the game, which isn't fun for those that happen to disagree. Instead, allow the community to ask/discuss/vote on issues relating to itself, thereby containing and not driving away users who are passionate about the site but happen to disagree with the FAQ on this or that."}, {"author_name": "JPLemme", "gravatar_hash": "1990b0f2b3530b25fb98178d668e56c1", "author_url": null, "date": "Apr 22, 2009", "message": "@Assaf\n\nI completely agree with you, and I used to post regularly in an attempt to influence the \"community\" to allow discussion *about* itself, and because I hated to see interesting questions get closed. But it's a lost cause. SO is still a handy place to get questions answered, but it's not *my* community. C'est la vie.\n\nI still lurk, so I suppose a part of me still regrets what SO might have been (but in fairness the \"SO community\" is probably glad it didn't turn into that). But there comes a time when you just have to stop pining over what might have been and move on. SO is SO, many people like it, and it's too late to change it."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 22, 2009", "message": "> What we are proposing is that if there really are only 2% of questions that are ambiguous then perhaps more leeway should be granted to them?\n\nI am proposing that a lot of noise about 2% is unwarranted. The system is in place, and has been adapted over time. Did you see @mmeyers comment?\n\n> It used to be that one person could close a question. Then three people. Then four, and now five. What more do you want?\n\nNobody seems to remember that we have in fact adapted the system over time.\n\n> Instead, allow the community to ask/discuss/vote on issues relating to itself\n\nIsn't that what we are doing <b>RIGHT HERE, RIGHT NOW</b>?\n\nContorting SO into a meta-discussion system -- something it does very poorly -- will result in driving away many more users. There is NOTHING more boring than a blog about blogging, a podcast about podcasting, a book about writing books. Oh dear sweet God, the tedium. Meta-discussion is a necessary *evil*, and it will be tolerated to a certain degree, but it is absolutely <i>not</i> something we want to seek out or encourage as a part of the core website."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 22, 2009", "message": "> Closing them (where them is defined as the truly grey area ones, not “which tires should I buy for my programming commute?”) doesn’t clean up the site in any meaningful way\n\nIn fact it *does*, because people waste their time answering a question that needs to be radically edited. So much so that their answer would be wrong or totally off-topic (or deleted and thrown away forever!) for what the question eventually becomes.\n\nClosing says \"this question needs RADICAL changes\". It prevents new answers, but it does not prevent the question from being edited or improved in any way.\n\nI've seen plenty of posts come back from being closed.\n\nAnd besides, if you don't like the way the system is working -- <b>be the change you want to see in the world</b>. \n\n- Vote to reopen everything, like Michael Pryor does (even when the post is proven to be a fraud, as in the case of the \"programming at sea\" question).\n- Edit posts that are closed to mold them into better questions.\n- Vote them up.\n- Leave comments explaining why the question should be reopened.\n\nI just don't understand all the hysterics on this topic. Don't like it? Stop complaining and do something about it. You have tools. Use them."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Apr 23, 2009", "message": "&gt;&gt; Isn’t that what we are doing RIGHT HERE, RIGHT NOW?\n\nYes, only blog comments is a poor way of doing it. I want people to be able to vote on such \\comments\\ and edit them.\n\n&gt;&gt; And besides, if you don’t like the way the system is working — be the change you want to see in the world.\n\nThen you just get the edit wars (and then mod wars) we've seen over the past week. Edit wars are not something to encourage, and close/reopen/close/reopen is just another form of edit warring.\n\nAsking a subset of users to keep swimming against the stream, when ultimately their effort are futile because mods override them, is uncool. \n\nI don't get what's so evil about meta-questions. Just ignore the tag. The slippery slope argument, btw, is an argumentative fallacy. Weigh each case on its own merit.\n\nObviously there are plenty of people who spend enough time on SO to care about the forum itself just like the programming questions on it. The current policy applies a negative selection pressure on such users by not allowing them to discuss the very same system in which they spend long hours every week. Instead of frustrating those who care the most about SO, let them Q&amp;A on its issues. That's the natural thing to do, and that's exactly what newcomers usually do - ask a question about SO itself (only to be shut down promptly and banished to some bug system where they have to re-login, figure out how to use it, and find out that it's a lame system).\n\nClosing doesn't say \\this question needs RADICAL changes\\. You might want closing to say that, but it doesn't. In reality closing communicates the following sentiment: \\SHUT UP WITH THAT\\. But I guess those who make the rules tend not to get questions they ask closed so I understand why they might make this mistake.\n\nClosing also has the effect of delaying a question long enough so it has less chances of being answered. So a question that was closed and reopened has much less chances of being answered than a question that was never closed. That's just one of the side effects of closing, and that's one of the reasons why we should be more careful with closing.\n\nMaybe part of the problem is that the different reasons for closing a question all translate into the same question life-cycle. Thus questions that are arguably soft or perhaps a bit theoretical or puzzle questions are dealt with the same way as utter spam and trolling is dealt with. \n\nSo maybe there should be a softer way of marking questions for review or improvement beside closing. E.g. when reopening questions, send them back to the top of the \\newest\\ pile. So instead of the OP having to fight (basically over a half-dead question) to be reopened, he would have the chance of getting his question improved/reopened and Then \\rentered\\ into the system where it would stand a fair chance of actually being answered."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Apr 23, 2009", "message": "p.s. another example why blog comments are insufficient for discussing SO is the above comment (by me) which was garbled by twice-failed annoying recaptcha tests. quotes turned into backslashes and naturally no way of editing the comment or seeing how many people agree with it. \n\np.p.s.\nOh fun, now another turing test to post this comment..."}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 23, 2009", "message": "&gt; Closing doesn’t say \\this question needs RADICAL \n&gt; changes\\. You might want closing to say that, but it \n&gt; doesn’t. In reality closing communicates the following \n&gt; sentiment: \\SHUT UP WITH THAT\\.\n\nI think this is the point that Jeff is missing, really.  One of the most annoying closures that I ever saw was this question:\n\n\"Would it be reasonable to add more methods to the Java Array objects in a future language release?\"\n\"I've thought of some methods that would be quite useful, and have never understood why they weren't added... for more background, see {someurl}.  What would the drawbacks of adding these be?\"\n\nThis was closed.... as SPAM!  He screwed up the question by removing the link and putting all of the background information into the question (as it was NOT spam), and they then said \"just because the reason for closing no longer applies, doesn't mean we should reopen\".\n\nUm, WHAT?  Sending a giant SU MORON to someone for a question like this was unnecessary.\n\n(take the following tongue in cheek, b/c noone should do this EVER) And as to the 2% thing... it would be nice if we could hack all of Jeff's blogs and SO.  We could then randomly remove 2% of his posts and comments.  I wonder how he'd feel? ;)  2% is significant."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Apr 23, 2009", "message": "&gt; Closing doesn’t say \\this question needs RADICAL changes\\. You might want closing to say that, but it doesn’t. In reality closing communicates the following sentiment: \\SHUT UP WITH THAT\\.\n\nMaybe more feedback about why the post was closed is needed then. I've created a uservoice suggestion: http://stackoverflow.uservoice.com/pages/general/suggestions/172694-when-op-views-a-closed-post-give-them-editing-pointers\n\nCaptcha: warty sister"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Apr 23, 2009", "message": "&gt;This was closed…. as SPAM! \n\nlast closer picking the wrong close reason is a good argument for exposing the complete voting record for closing. As it is, one user can cause a lot of harm by picking the wrong reason (deliberately or inadvertently)"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Apr 23, 2009", "message": "not the first time I've suggested exposing the complete voting record for closing, I made this suggestion on uservoice http://stackoverflow.uservoice.com/pages/general/suggestions/101286-show-the-reason-a-close-vote-was-given\n\nwhich was declined:\n\n&gt; \"won't be doing this; too much detail PLUS we don't track it.\"\n\nthat was back in March. I wonder if anything's changed since the DB refactor."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 23, 2009", "message": "Ah.  Lovely, lovely numbers!  1 in 50 seems too high. My subjective observation is that actually less than 1 in several hundred questions are controversially closed.  So the ratio of truly awful questions to total closed questions is likely to be much higher than half.  So it's reasonable to argue that the number of grey-area questions is not worth the amount of discussion we have here (and elsewhere) about them.\n\nBut I think putting the numbers in the context of good questions is a mistake.  An analogous situation is cell-phone dropped calls.  Phone companies are probably quite proud of their statistics which show only 1 in X calls are dropped.  From an engineering standpoint, its amazing and getting better.\n\nBut if you are the one who's call is dropped, you're not happy.  And if you happen to live or work in a location that is subject to lots of dropped calls, you are going to be a very disgruntled customer.  Having the phone company list their 6 sigma failure statistics is not going to make a difference.\n\n&gt; I just don’t understand all the hysterics on this topic. Don’t like it? Stop complaining and do something about it. \n\nI'm sorry you have to deal with whiny users.  Must be tough.  ;-)\n\n&gt; You have tools. Use them.\n\nI think the point is the tools don't work very well for these edge cases.  \n\nCompared to voting, closing questions is black and white and seems to encourage thinking in absolute terms.  But the grey area is grey.  Questions that aren't quite right for Stack Overflow, yet not junk get treated exactly as if they are junk.  Treating them as regular questions isn't right either.  And putting them through a tortuous cycle of editing, commenting, reopening and reclosing may be the most degenerate result.  There are just too many diverse and strong opinions about what should be done for true consensus to emerge.\n\nThe weird thing for me is that the voting system could probably be tweaked to make question closing unnecessary.  C'est la vie."}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 23, 2009", "message": "&gt; The weird thing for me is that the voting system could \n&gt; probably be tweaked to make question closing \n&gt; unnecessary. C’est la vie.\n\n+1"}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 23, 2009", "message": "There's a lot of focus on 4% of questions, which should really be focus on the *fraction* of the 2% that we would disagree over as a group.  Remember that some of that 2% is duplicates, meaning a *smaller* fraction is stuff closed for \"belongs on uservoice\" or \"off topic\" or \"not a question.\"\n\nI keep being surprised to see people advocating a system with no rules (other than \"no SPAM\"). I agree with the several who have pointed out that the fact that so many questions get closed shapes behavior and causes people to avoid asking the kind of question that will get closed.  The moment you say, \"Anything goes except SPAM,\" the number of off-topic questions will skyrocket.\n\nTo me, 1/50 questions being closed as off-topic or duplicate is too high.  To me, that says there are too questions that fall into the bucket: \"duplicate, off topic, or on the fence.\"\n\nFor a site like /. it makes sense to gain rep bring being clever or funny, but for a computer QA site, gaining rep for being funny seems, well, funny.  I am less apt to vote to close an off-topic question that is CW, but most off-topic questions are not CW.  And there are some who advocate to NEVER mark questions CW!\n\nMaybe a consensus about off-topic posts, polls, and the like being CW will help?  Some who vote to close a non-CW post would leave it open if it were CW. Others will vote to close anyway, but a consensus about CW posts might change that.\n\nTo sum it up and ignoring the \"close and delete nothing but SPAM\" folks, I see the community struggling over these issues:\n\n1) Meta questions on SO, most of which are a poorer fit for UV than for SO.  We need an appropriate place for meta discussion.  This blog is a lot better than nothing, but not sufficient for the demand that is out there.\n\n2) Soft questions and not-off-topic-but-on-the-fence questions -- maybe a consensus on CW would help here.  If there were a consensus, people might be less quick to vote to close something as long as it was CW.\n\n3) Duplicates -- we need a way to merge duplicates, but this is a hard problem.  One way, maybe, of handling duplicates would be to merge the answer sets so the multiple duplicates have the same set of answers.  That is, you answer one and the answer appears on all.  Of course, the community would need to create the \"duplicate\" linkages.\n\n4) Poorly worded questions.  Note that editing a poorly worded question promotes it to the front page again.  I've edited poorly written questions that were hours old with no answers, then seen answers start appearing in minutes, so I think this works well as is."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 24, 2009", "message": "This question is the perfect example for why an official meta-discussion area is needed.  This is a much poorer fit for UV than for SO.  The SOFAQ probably cannot answer this kind of question.  Not without being so comprehensive that it would be difficult to search.\n\nhttp://stackoverflow.com/questions/786161/how-to-search-stackoverflow-for-string-containing-and-characters"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 24, 2009", "message": "> The weird thing for me is that the voting system could probably be tweaked to make question closing unnecessary. C’est la vie.\n\nHow so? I think voting is an entirely different axis of expression. Closing is an EDITORIAL function. Voting is a POPULIST function. Both groups are necessary.\n\nAlso missing from this discussion is the fact that you can open posts just as easily as you can close them. It's a perfectly symmetrical operation. Don't like closing? Vote to open. Key word: <b>VOTE</b>. As in, <b>voting system</b>. Isn't that what we're discussing?\n\nBoth of these statements are wrong:\n\n\"All we need is voting by the people!\"\n\"All we need is a good set of skilled editors to vet content!\"\n\nTo the extent that there is conflict and disagreement, welcome to a system of government with checks and balances. That's how it works."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 24, 2009", "message": "&gt; Also missing from this discussion is the fact that you can open posts just as easily as you can close them. It’s a perfectly symmetrical operation. Don’t like closing? Vote to open. Key word: VOTE. As in, voting system. Isn’t that what we’re discussing?\n\nNo.  The key word is not voting.  You've taken a small aside out of context and ignored a central point.  I think the system could be altered to avoid closing questions, but I know it ain't gonna happen.  So I tried to indicate I was resigned to our current system and am not pushing to change it.\n\n&gt; How so? I think voting is an entirely different axis of expression. Closing is an EDITORIAL function. Voting is a POPULIST function. Both groups are necessary.\n\nNow this is an important insight.  In fact it gets at something that has bothered me for a very long time about Stack Overflow that I just now understand.  You want us to enforce your rules.\n\nThe small number of founders make a set of rules about what belongs and what doesn't.  (No meta-questions is one such rule.)  Then the larger subset of users who have enough reputation are asked to enforce the rules.  So the populist group is being asked to perform an editorial function.  It's as if the executive makes the rules and the legislature enforces them.  You can see why this seems unnatural to a US citizen at the very least.\n\nToday you are saying that we are free to enforce the rules the way we feel like.  But we all know that ultimately, you have any power over Stack Overflow that you feel like granting yourself.  When you look at the vast majority of high-reputation users, they agree with the rules you've laid out.  So anyone who takes time to disagree is beating at the wind.  It's a complete waste of time if your goal is to change the situation.\n\nI admire you for listening to dissenters as much as you have.  Far too many people would not do what you've done.  But as nice as it is to be given an opportunity to disagree, it's not really a level playing field.  This is why high-reputation users *need* a space for meta-discussion no matter how evil it might be.\n\nTo get back to the main point, remember that we are talking about fringe questions.  That's what the statistics represent.  The majority of questions are easy: either they are in or they are out.  That's the easy part of editing.  These grey-area questions are difficult.  Probably too difficult for anyone who doesn't have a full picture of the situation and are experts both on the rules and how they have been enforced in the past.  In the US, there's a final set of checks and balances designed to answer these sort of edge cases: the courts.  As far as I know, Stack Overflow does not have that branch.\n\nI'm very hesitant to even mention that because it's likely to be difficult or impossible to retrofit the community at this point.  I know that if I had my way, Stack Overflow would instantly lose some of its best contributors.  Radically changing things at this point is a bit like killing the goose that lays the golden eggs.\n\nBy the way, I think if you are going to have closed questions, you should not allow them to be reopened  The decision ought to be decisive and final.  Let the person ask in a different way instead.  The \"perfectly symmetrical operation\" is what causes the constant opening and closing of questions to no end.  I don't like it."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 24, 2009", "message": "There is no such thing as \"constant opening and closing of questions to no end\" anymore. That was taken care of when they made it possibly to only vote to close once (and to reopen once) per question. So now instead of it being 5 vs. 5 indefinitely, it is 5 vs 5 and then another 5 to reverse and then another 5 to rereverse and so on. Eventually you run out of people on one side to flip it back."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 24, 2009", "message": "The courts are not a \"final\" set of checks and balances in the United States. They are just as equal as the legislature. If the court does something which the legislature feels is a huge problem (in terms of legality), it can impeach the judge or judges. The executive branch also has control over who is nominated and the legislature has control over who passes. \n\nThere is also the ability to bring the same \"problem\" to the courts to rule on multiple times. The judges always have the option of overturning a previous ruling they feel is unjust or does not conform with the laws of the land. \n\nTrying to make it appear as if the courts are the final decider of things is off base."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 24, 2009", "message": "&gt; So the populist group is being asked to perform an \n&gt; editorial function.\n\nYes. That's pretty much the essence of a wiki system, and SO's adoption of it (vs. the \"elite group of moderators\" system used by many other sites) is what makes SO an interesting system.\n\n&gt; ... Probably too difficult for anyone who doesn’t have \n&gt; a full picture of the situation and are experts both \n&gt; on the rules and how they have been enforced in the \n&gt; past. In the US, there’s a final set of checks and \n&gt; balances designed to answer these sort of edge cases: \n&gt; the courts. As far as I know, Stack Overflow does not \n&gt; have that branch.\n\nOh, but it does: the SO Team moderators. Flag a post for moderator review, and the matter is \"in court\" - the judgement may be locking, deletion, warnings to those responsible, boxing, or banning. \n\n&gt; By the way, I think if you are going to have closed \n&gt; questions, you should not allow them to be reopened \n&gt; The decision ought to be decisive and final. Let the \n&gt; person ask in a different way instead.\n\nI'm in favor of this as well, along with a faster and easier path to deletion once a question has been closed. However, re-opening does allow some balance between the exclusionists and inclusionists, as well as a check on any group that would use closing for malicious purposes... Again, flagging and locking allow moderators to step in when things get out of hand."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 24, 2009", "message": "TheTXI:\n&gt; Trying to make it appear as if the courts are the \n&gt; final decider of things is off base\n\nTrying to compare SO to the US Gov't is off base..."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 24, 2009", "message": "Shog9: Agreed."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 24, 2009", "message": "@TheTXI:\n\nIt's good to hear the loop is not infinite.  It's a start at least.  It doesn't change my mind about closing questions, but I will try to change my rhetoric.\n\nAs for the courts being final, you will find that for the vast majority of disputes they are final.  Few cases are successfully appealed and even fewer judges are impeached.  We can mostly hold the generalization that the courts are final because they mostly arrive at consensus that society can live with.  It's only once in a blue moon that we as a society poke through the veneer of the court's \"final authority\".\n\nThe United States is a touch more complicated than Stack Overflow, however.  ;-)  \n\nBesides, the key ingredient of the court system that I think is lacking in the Stack Overflow community is expert moderation that has the bigger picture in mind.  What Jeff is asking us to do is execute mob justice.  (I know the phrase is far too inflammatory, but I'm struggling to think of a better analogy.  Design by committee?  The smackdown model?)"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 24, 2009", "message": "&gt; Yes. That’s pretty much the essence of a wiki system, and SO’s adoption of it (vs. the “elite group of moderators” system used by many other sites) is what makes SO an interesting system.\n\nPerhaps.  I admit I don't spend a lot of time using other wiki-type systems.  But my impression is that wikis tend to have better out-of-band meta-discussion components than Stack Overflow.  Also for the type of cases we are discussing, some authority usually needs to step in to make a definitive decision.  \n\nIn addition, unlike a wiki system, Stack Overflow has borrowed aspects of blogs and forums that encourage individual ownership of particular posts.  It works incredibly well so often, but regularly blows up on edge cases.  As the original author, I have some higher claim on my posts than the community if for no other reason than my reputation (and Reputation) is on the line.  In the posts we are talking about, the community is asserting an even higher claim than the author.  Personally, I think unless the claim is abundantly clear, the community ought to show restraint.  But I am in the minority on this.\n\nCAPTCHA: phrase chimps"}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Apr 25, 2009", "message": "@Jeff: would you be able to provide some additional stats I'd be interested in? Namely:\n\n- How many closed questions were deleted by people other than the owner?\n- How many times has this occurred before and after the change to 3 delete votes required. I'm particularly interested in after because I'd be surprised if it's happened even once.\n\nBTW there is a lot of noise in the \"recently deleted posts\" tool from people deleting their own questions and answers.\n\nLastly, I agree with the stance that there should be standards and a populist/anarchist position advocated by some would quickly degenerate SO into endless discussions about whether Captain Kirk was a better captain than Picard."}, {"author_name": "Jason Punyon", "gravatar_hash": "4fb7b364b3f80e89add72eb6a7ce0d55", "author_url": null, "date": "Apr 25, 2009", "message": "@cletus:  \"...whether Captain Kirk was a better captain than Picard.\"\n\nHow can you even ask that question...isn't it obvious?"}]}