{"response": [{"author_name": "SCdF", "gravatar_hash": "d23c43fed180ee2eebef1c3efd75965d", "author_url": "http://blog.mylittlepwnage.com", "date": "Apr 07, 2009", "message": "&gt;If you are going to edit a post, make sure you’re substantively improving the whole thing, not just changing one or two words.\n\nLet me the first to say *no*.\n\nIf you're a bored grammar nazi then what's the harm in walking through someones post fixing grammar and presentation?\n\nIf anything it does well to hide the seething underbelly of badness on the Internet and makes SO look like it's filled with intellegent people who enjoy the fact that they're over there with their good grammar...\n\nSure, if people revert back because they think its better that way then I'm sure most people will sigh and move on and not end up in a giant edit war over correct usage of aphostrophy's.\n\nMaybe I'm too trusting..."}, {"author_name": "Philip Morton", "gravatar_hash": "3ea9c684a2db319df788cecc6c98f9cd", "author_url": "http://www.philipmorton.com", "date": "Apr 07, 2009", "message": "I don't see why fixing someone's spelling and grammar is a bad thing. If you've got the time, why not? For people whose first language isn't English, you're helping them learn more than just code."}, {"author_name": "Nicolai", "gravatar_hash": "045605bea15f3745e8aa97de3b238b94", "author_url": null, "date": "Apr 08, 2009", "message": "Well, Jeff didn't say don't fix spelling and grammar.\nHe said:\n\"For example, don’t bother changing “its” to “it’s” unless you have a bunch of other edits to make in the same post. There has to be a legitimate case that your edit made multiple edits that transformed the post from good to great.\"\n\nSo if it is a post with lots of mistakes which makes it hard to understant the post, you probably should go in and fix spelling and grammar."}, {"author_name": "1800 INFORMATION", "gravatar_hash": "acc637690f49e2b5a2146deb17874d6f", "author_url": null, "date": "Apr 08, 2009", "message": "Right. Don't edit just to change a single word. But if you see a whole bunch of spelling mistakes and grammatical errors, go right ahead. A lot of people that use SO do not have english as their first language, so probably if the post is hard to understand, it might be because they typed it with a dictionary in their lap. With that in mind, they will probably appreciate you fixing it up for them."}, {"author_name": "SCdF", "gravatar_hash": "eb2c9961d9729359e086e9dcf6312ff9", "author_url": "http://blog.mylittlepwnage.com", "date": "Apr 08, 2009", "message": "\"Right. Don’t edit just to change a single word. But if you see a whole bunch of spelling mistakes and grammatical errors, go right ahead.\"\n\nI could argue about this, but my opinion is irrelevant: in the end it comes down to this:\n\nJeff is not a God, people do not do what he says just because he says it, especially if they hear what he has to say.\n\nWait, that's not right. Jeff *is* a God. Not in the \"wow that pirruette was amazing, you're a ballet GOD!\" sense but in a slightly more literal sense. If you think of us, our stackoverflow selves, as entities inhabiting a place, then Jeff controls that place, totally and utterly.\n\nIt is through that ability that he can shape how his little ant-like followers behave, not through asking nicely on a blog. There are people that will disagree and thus ignore his advice (like me). \n\nBut far more important is the fact that most people who use SO don't read this blog and so will never get the message anyway.\n\nThe point I'm struggling to make here, is that if the SO team prefer people to act a certain way they must express this desire through the fabric of the site or accept the communities behavour for what it is.\n\nEverything else is just chin-wagging."}, {"author_name": "Will", "gravatar_hash": "7a0492b3fd266c7ebd65f3cfce437ebc", "author_url": null, "date": "Apr 08, 2009", "message": "I had thought the whole idea, expressed in endless interviews with the founders, was that questions and answers tended towards perfection because they were being constantly refined.\n\nI cannot see any possible objection to correcting punctuation errors - either one error or ten errors.  \n\nOf course there's a judgement call, and people have made themselves look foolish changing bits of idiom they didn't understand into things which made no sense, but what's the problem with correcting one typo?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 08, 2009", "message": "> The point I’m struggling to make here, is that if the SO team prefer people to act a certain way they must express this desire through the fabric of the site or accept the communities behavour for what it is.\n\nWell, you can take that up with Gortok -- he specifically requested this blog entry."}, {"author_name": "PiNtoS", "gravatar_hash": "77787eefd430ce67aa2aa020f3cbd61e", "author_url": null, "date": "Apr 08, 2009", "message": "I've also been puzzling over your argument, Jeff, to avoid fixing minor errors (like it's -&gt; its). When I read wikipedia articles, if I notice something misspelled, worded badly, or misusing an apostrophe, I'll jump in and fix it. It's got that [edit] button *begging* to be clicked. From what I understand, a lot of people do this \"drive-by\" editing, and it's part of what helps wikipedia become a pleasure to read.\n\nGranted, the barrier to editing on SO is higher, but the same principle should apply, and it shouldn't matter whether you're making one small change or completely rewriting the post. I do agree with the \"don't be a jerk\" rule, so if the original poster doesn't like it, just leave it alone; also, if the post is barely English, then fixing a single apostrophe is a bit bizarre.\n\nNevertheless, if a post is generally well-written, but has a tiny error, why not encourage people to fix that?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 08, 2009", "message": "> Nevertheless, if a post is generally well-written, but has a tiny error, why not encourage people to fix that?\n\n#3, Every edit is a judgment call.\n\nIf the post is so good that only that one single word / mistake needs to be edited, then sure. But I'd recommend being more aggressive; the types of posts that *typically* need editing need a lot more than one word.\n\nBut, again, I'm generalizing."}, {"author_name": "Razzie", "gravatar_hash": "31b89c12bc0ab3a23c32bf4e8e86764c", "author_url": null, "date": "Apr 08, 2009", "message": "I think the general consensus should be that the focus of the site should be asking and answering questions, NOT editing out every single little misplaced punctuation, or stripping every question from personal touch (like stripping out 'hi' and 'bye' and smileys and nothing else) just for the sake of editing.\n\nI think time is better spent giving great answers, than nitpicky edits. Sure, grossly misspelled words or whole posts are perfect candidates for editing, but there should be a balance between the two. And I think that every sane individual knows perfectly well when an edit is a bit too much."}, {"author_name": "rism", "gravatar_hash": "7905d373cfab2e0fda04b9e7acc8c879", "author_url": null, "date": "Apr 08, 2009", "message": "I'm struggling to believe that a site by programmers for programmers has programmers who edit posts simply to replace \\hasnt\\ with \\hasn't\\.\n\nThere is an automatic solution to the \\problem\\."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 08, 2009", "message": "don't make any clbuttic mistakes!\n\nhttp://www.codinghorror.com/blog/archives/001176.html"}, {"author_name": "Nathan Fellman", "gravatar_hash": "898c2217a5457bdef0a0ed58283010dc", "author_url": null, "date": "Apr 08, 2009", "message": "&gt; If the post is so good that only that one single word / mistake needs to be edited, then sure. But I’d recommend being more aggressive; the types of posts that *typically* need editing need a lot more than one word.\n\nI don't look for posts to edit.  If I stumble upon one that needs editing, I'll edit it.  I don't care about the posts that *typically* need editing since I'm not hunting for them."}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Apr 08, 2009", "message": "I couldn't disagree more with: \"make sure you’re substantively improving the whole thing or don't bother\".\n\nI appreciate any edit which improves my writing, and even minor mistakes improve my writing.  Jeff I strongly believe that you are taking away a small part of what you were so proud of in your post \"What Stack Overflow Can Teach You\".\n\nI wonder about exactly why you wouldn't want small mistakes corrected even if the person correcting them doesn't mind doing it.  I can see a couple reasons...\n\n1. It takes less server side space for you in the end because you don't need to store the new edited version.\n\n2. Small changes may push people closer to the threshold of it being a community wiki post. \n\nRegarding #1, I hope this is not the case.  You really shouldn't sacrifice quality of the site for less than a penny in space savings.   I would be greatly embarrassed if I shipped a software product with small spelling errors everywhere. \n\nRegarding #2, this should probably change so that if an edit is smaller than a certain % threshold, it won't count towards an edit that pushes you towards a community post. \n\nSmall edits improve quality.  I'm disappointed that a lazy behavior is being encouraged for this site, and I feel more discouraged in taking part in a site where high quality is discouraged."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 08, 2009", "message": "Brian, let me add a reason to your list:\n\n3. a certain user generated a mountain of ill will by making lots of small, meaningless edits. See the example I gave in the post of removing salutations *alone*.\n\n> There has to be a legitimate case that your edit made multiple changes that transformed the post from good to great. Or at least substantively improved it. \n\nDo you feel you can make a legitimate case with your edit? Then have at it."}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Apr 08, 2009", "message": "Regarding #3, then I think your original post should be edited to say \"Don't bother removing decorations of a post such as Hello, and Thanks\"\n\nI think the strict no small corrections tone in your original post does not fit what your thoughts are (I'm saying this based on your post to this thread on April 8th, 2009 at 1:03 am).\n\nI fully agree with leaving people's post alone if they show any resistance at all.  But you have a lot of loyal subjects (minions) that will listen to exactly what you recommend.  And I think in this case it will lead to a little less quality in the site as a whole.\n\nPerhaps if you added an edit to the original post that said that it is more polite to write a comment about the suggested change and allow the author to change it when it is a minor change."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 08, 2009", "message": "> Regarding #3, then I think your original post should be edited to say “Don’t bother removing decorations of a post such as Hello, and Thanks”\n\nUm, no, I meant what I said: feel free to remove Hello and Thanks <b>if you were going to make other edits anyway</b>.\n\nDitto for other tiny changes. And if you have a lot of tiny changes to make, then that's a substantive edit, isn't it?\n\nNow if the post is 100% perfect and someone misspelled a single word, go for it.  But I believe this is an edge condition and harping on it is ignoring the typical case, which is posts that need <i>several</i> edits to be whipped into shape.\n\nProgrammers: they never met an edge condition they didn't love discussing ad nauseam. :)"}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Apr 08, 2009", "message": "I don't disagree with the statement:\n\nIf there are several edits to do, then don't just do a single one, change everything you can.\n\nAnd I don't disagree with anything you stated when there are substantial changes involved in a post. \n\nI disagree specifically with the tone the post set for good quality posts with small errors:\n\n\"Avoid making minor, trivial edits, as they are the source of much friction. For example, don’t bother changing “its” to “it’s” unless you have a bunch of other edits to make in the same post.\"\n\n\nThis states that you shouldn't bother correcting small spelling mistakes unless the post is in a really bad state.  This doesn't agree with your last comment post that you just made \"Now if the post is 100% perfect and someone misspelled a single word, go for it.\" \n\nI think we both agree for the case when you have a really good post with a small error, but the original post contradicts my thoughts on this (and I think yours too)."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Apr 08, 2009", "message": "Also definition of quality is in the eye of the beholder.\n\nI do a lot of edits where I am clearing away Walls of Text just because I have a very hard time reading questions like that.\n\nAnd the Diff tool does not show explicitly that i spaced text unless you look for it.\n\nWhat i feel is a necessary edit (and while I am at it, i will fix greetings and other spelling/grammar errors if i find them), might come off as just minor fixes from me, and the OP or other person might roll back that edit."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 08, 2009", "message": "> I think we both agree for the case when you have a really good post with a small error, but the original post contradicts my thoughts on this (and I think yours too).\n\nOK I edited #1 to make this more clear. Again, let's not focus on the edge condition to the exclusion of the typical case here -- typically, posts that cry out for editing need MULTIPLE edits to be whipped into shape.\n\n> might come off as just minor fixes from me, and the OP or other person might roll back that edit\n\nI think an edit that changes multiple things, and makes sweeping changes to improve the readability of the post, is much more defensible than the pedantry-type edits.\n\nJust MHO. That's what I'm getting at with #1."}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Apr 08, 2009", "message": "Thanks Jeff, I fully agree with it now."}, {"author_name": "Jon B", "gravatar_hash": "c60d994d29c63ea5d83702924b935461", "author_url": null, "date": "Apr 08, 2009", "message": "I typically fix minor spelling, grammar, and punctuation - whether it's one mistake or several. i find its distracting to read questions were these mistakes are left in. I usually leave an edit comment like \"minor grammar cleanup\". Hopefully posters don't find this offputting. I think this makes the site better.\n\nI agree 100% about \"Hi\" and \"Thanks\". I also don't find it necessary to reword anything that's not terribly unclear, or fix nitpicky grammar issues like split infinitives."}, {"author_name": "rism", "gravatar_hash": "7905d373cfab2e0fda04b9e7acc8c879", "author_url": null, "date": "Apr 08, 2009", "message": "\\don’t make any clbuttic mistakes!\\\n\nGood point, but a site full of programmers can surely come up with much better ways to manage grammar and spelling than manually sniffing out error in every post. Perhaps a per post quality rating specifically targeting those two aspects of a given post. Something that can be filtered for by all those who have \\the need\\.\n\nOr some kinda snapshot tool that allows those with \\the need\\ to obtain a report of all posts with hairy spelling/and or grammar. It groups likely candidates by post but doesn't dump the whole post when contextualizing the potential error. Maybe just the sentence before and after. It would course offer the ability to batch update \\mistakes\\. If this feature came with an auto suggest function, those with \\the need\\ could potential fix hundreds of errors very quickly simply by clicking an \\Apply\\ button.\n\nAnd maybe look at incentivising quality with some kinda green badge as recognition for ones non polluting word-smithery. \n\nOr. Or. Or.\n \nAutomated perfection maybe (currently) unrealistic but automated assistance in the quest for perfection seems a  worthwhile endeavor."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "I know I ended up agreeing to these very rules in the email exchanges (http://somod.subtlehustle.com/) (not complete yet, still working on it) that I had with Jeff. But it didn't help.\n\nWhat we are still missing is for the mods to stand up against certain people who feel it is their job to follow editors around and rollback any edits they happen to make. That is clearly bad behavior and needs to be very quickly and swiftly stated as such. If I can compromise on the rules, surely the moderators can do me the favor of then standing up for my edits by making their stance clear to these people.\n\nMake sure we subject both sides to the rules, because it is feeling pretty one sided right about now."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 08, 2009", "message": "Rich B, I agree, one email has been sent on that already. I also emailed the person who keeps creating Rich B impersonation accounts to cease and desist (you know who you are)."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 08, 2009", "message": "If you know who it is, why aren't they being immediately punished in the same fashion that btk (belgariontheking) was punished (immediately and without prior warning) when he changed his avatar to match that of GateKiller and changed his name to HELLO I AM A TROLL to point out how much of one GK was being at that time?"}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 08, 2009", "message": "@Rich B,\n\nIf you can stick to the rules Jeff has brought up in this post (especially # 1) we will all get along fine."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 08, 2009", "message": "BTK had been warned once about abusive comments.\n\nAlso, just as a point of reference, giving your account the name, image, and URL of an imprisoned serial killer is not a great way to endear yourself to the moderators, or anyone else, for that matter.\n\nJust sayin'."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "Apr 08, 2009", "message": "@Click, i think we all got that point a few weeks ago."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 08, 2009", "message": "Thank you Jeff for clarifying the rules for all."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Apr 08, 2009", "message": "@Click Upvote: I wish I didn't have to pick on your here, but I do. Specifically because in our last great encounter, you purposefully roll back edits that others make (especially Rich B's edits), as if you're carrying a crusade for the Original Poster.\n\nI believe that you ought to abide by Rule #1 as well; and not revert simply because you believe others aren't."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 08, 2009", "message": "Dude...that picture is Rich B. And I don't think they've found any bodies yet to be able to convict Rich."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 08, 2009", "message": "Regardless of what's happened in the past, I'm going to tone down on my edits and rollbacks now simply to prevent edit wars.\n\nBut when an edit does nothing except remove humor/personality from a post, such as this example:\n\nhttp://stackoverflow.com/revisions/506538/list\n\nI will modify/revert those edits.\n\nJust stick to rule #1, as long as you actually improve the post in some way, you won't have to worry about it being rolled back."}, {"author_name": "belgariontheking", "gravatar_hash": "2a2f9018942bf8e582faff47eb169fdf", "author_url": null, "date": "Apr 08, 2009", "message": "@Jeff: That was a joke.  Didn't mean to offend anyone.  That's why I didn't put it back when it was removed from my profile.  \n\nThe picture is Rich B, not Dennis Rader (Rich likes guns), and I think the mod realized that and didn't remove the avatar.  That or they don't have the power to remove avatars without deleting the account.  \n\nI like my new avatar though.  :)"}, {"author_name": "Jon B", "gravatar_hash": "c60d994d29c63ea5d83702924b935461", "author_url": null, "date": "Apr 08, 2009", "message": "@Click Upvote: The edits in the example you posted were valid and useful. Because the main page shows the first few sentences of the post, anything extra at the top just wastes space (like \"Houston, we have a problem\"). The more useful information a user can read in the summary, the more likely they are to read and answer the post."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Apr 08, 2009", "message": "@Click Upvote: Again, the problem you're going to run into is that you're actually creating a fight that isn't yours.  If the Original Poster wants to put it back, that's one thing -- but for you to go behind others (3 people thus far) that have removed it, now you're intentionally starting a fight."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 08, 2009", "message": "The main page shows only the titles of the posts for me:\n\nhttp://stackoverflow.com/"}, {"author_name": "Jon B", "gravatar_hash": "c60d994d29c63ea5d83702924b935461", "author_url": null, "date": "Apr 08, 2009", "message": "@Click Upvote: The \"question page\", then, or whatever it's called. (I never visit the real \"main page\")."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 08, 2009", "message": "@George, Those 3 people are part of the SO mafia. If your friends gang up on a post and rollback edits, then they are the ones picking a fight, not me.\n\nAs i've said, just stick to the guidelines that were posted today, they're clear and precise. Improve the question in some way, not just remove the personality. And we'll all get along fine."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 08, 2009", "message": "> Because the main page shows the first few sentences of the post, anything extra at the top just wastes space (like “Houston, we have a problem”). The more useful information a user can read in the summary, the more likely they are to read and answer the post.\n\nDefinitely a fair point..\n\n> Improve the question in some way, not just remove the personality\n\nI would say Gortok's edit does improve the question.\n\nAnd beyond that, are we REALLY going to have an edit war over such a simple post? Is it worth our time? Really?"}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Apr 08, 2009", "message": "@Click Upvote: Interesting that you are targeting edits because of who they were made by, and not because of the strength of the individual edit."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 08, 2009", "message": "Samuel is in the mafia? First time I've ever seen him is yesterday. You think we just let ANYBODY in to our secret mafia cabal?"}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Apr 08, 2009", "message": "Two days, two blog entries about Rich B. Oh the price of infamy..."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Jeff: Alright, so I have agreed (and I think my recent history proves it, despite my unrelated ban) to follow these rules that we established a while back.\n\nNow my question is (as it has been in my emails and other mediums), what will you do about people like Click Upvote who are actually causing these wars? My edits are no longer the problem, the people rolling back for no reason are. \n\nCan you make a firm stance here and now that going forward there will be zero tolerance for this kind of thing? \n\nIf you are not the OP and you cannot prove definitive abuse to the mods that an editor is making bad edits, then you will be punished for rolling back. That is what I am asking for.\n\nIf click upvote feels my (or anyone else's) edits were somehow abuse he should have emailed them to team@stackoverflow.com instead of rolling back over and over. \n\nYou will hopefully notice I did not engage in these rollbacks. I emailed team@stackflow.com with them. I feel I followed the correct course of action. I am asking others to be held to the same standard."}, {"author_name": "belgariontheking", "gravatar_hash": "2a2f9018942bf8e582faff47eb169fdf", "author_url": null, "date": "Apr 08, 2009", "message": "@Cletus: wait, is there an upside to being infamous?"}, {"author_name": "Slavo", "gravatar_hash": "528f3acc8d119dcc6c7817deda454251", "author_url": "http://www.slavoingilizov.com", "date": "Apr 08, 2009", "message": "I was always wondering about something, and probably this post is not the place to ask, but I was just reminded of it now. If a user posts a bad question, one where he does not clearly express what he wants to ask, the community votes him down. Around comes a guy that actually understands the question, and makes an edit, so that it is clearer and meaningful - not a bad, but legitimate question. The subsequent viewers vote up, either bringing the vote count to 0 or above.\n\nNow, the original author didn't do anything right to get the reputation from the upvotes after the edit, but still got it. To me this is a little tricky and unfair. What do you think?"}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Apr 08, 2009", "message": "Any publicity is good publicity"}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Apr 08, 2009", "message": "@Slavo : there are quite a few Uservoice Requests open on something like this. I'd love to be able to assign votes to specific edit revisions of a post."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Slavo: I do this a lot for people, and I sometimes struggle a bit with it, especially when the user never seems to learn or try and keeps repeating the same types of posts. \n\nI keep editing them though. I keep hoping that good karma will eventually work out for me. \n\nIt seems to be working quite the opposite at the moment, but I guess we will see going forward. Hopefully Jeff is going to correct a few behaviors and do a soft reset on this whole issue."}, {"author_name": "belgariontheking", "gravatar_hash": "2a2f9018942bf8e582faff47eb169fdf", "author_url": null, "date": "Apr 08, 2009", "message": "@Downvoted retard: Good job proving once and for all that you care more about who makes an edit than the substance of that edit."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 08, 2009", "message": "@Rich B,\n&gt;  If you are not the OP and you cannot prove definitive abuse to the mods that an editor is making bad edits, then you will be punished for rolling back. That is what I am asking for.\n\nThis applies equally to you if you aren't the OP of a question and are editing it.\n\nRead guideline # 1 again:\n&gt; If you are going to edit a post, make sure you’re substantively improving it. Avoid making isolated, trivial edits, as they are the source of much friction. \n\n&gt; To be very specific, I would discourage editing a post solely to remove salutations like “hi” and “thanks”. \n\nAs long as you abide by these guidelines I'm not going to roll back any of your edits. So you can stop including me in the list of people who rollback your edits."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Apr 08, 2009", "message": "@belgariontheking: to quote Dilbert (or was it Dogbert?) \"it's better to be a famous incompetent than a competent nobody\".\n\n@RichB: what I find astounding is that even with all these problems following you around you seem to scratch yoru head and write them off as \"bad karma\" when perhaps you should be asking yourself what it is you do that is engendering this kind of petty and juvenile response (from the likes of Kev and others0?\n\nWhat I also find telling is that you seem to be looking for Jeff to legislate some sort of zero tolerance policy. You can't legislate that people treat one another with respect.\n\nThe only way to handle these kinds of corner cases (which, thankfully, is what they are) is oa a case by case basis and yes it's a judgement call based on some guiding principles.\n\nOr, like Congress, do we need an 800 page ethics manual?"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Click Upvote: I have been following these guidelines for a while now, and your rollbacks have persisted even in the face of of moderator actions against them.\n\nPerhaps you will discontinue the behavior in the future. But in the light of your continued arguments against valid edits even today, I cannot say I am very confident of this.\n\nTherefore I am asking Jeff to promise to take a harder stance against this as well. I am fine with being responsible for my editing behavior, but I want to see a consistent standard laid on both sides of the debate."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 08, 2009", "message": "@Rich,\nI disagree with that, you've had many edits in the past where you only removed smileys, salutations, or did minor trivial updates. Like the one I linked to earlier (although I didn't know that the first lines of a question are showed on the questions page, I'll keep that in mind in the future).\n\nAnyway, regardless of what's happened in the past, as long as you abide to the guidelines I quoted, you won't find me rolling back any of your edits.  Other than that, I don't care what goes on with you and Jeff, just don't mention my name :)"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Click Upvote: Again, you are ignoring time lines. What you are saying is simply not true. If you don't understand why the edits are being made, you should not be rolling back. \n\nTalk to the person and if that fails talk to the mods. Don't just start a rollback war. That is what I have been saying since I made my changes to behavior."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 08, 2009", "message": "@Cick Upvote: If you aren't going to rollback after these new guidelines, why did you roll back http://stackoverflow.com/revisions/408929/list?"}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 08, 2009", "message": "Abide by the guidelines.\n\nMake positive improvements, not just removing humor from a question.\n\nAnd you won't even see my name.\n\nEnd of story.\n\n\nAnything else just means you plan to ignore the guidelines or just keep going with a flame war."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 08, 2009", "message": "That's my question Samuel. You are the ones supposed to stay away from it if I don't want your edits to it."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Upvote: So you are saying you refuse to honor the agreement and bring your claims of abuse to the mods instead of just rolling back?"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Apr 08, 2009", "message": "(Slightly leery of getting involved here, but...)\n\nPersonally I have no problem with salutations being removed.\n\nUpside: less fluff, including in the summary.\nDownside: ? Can't think of any. Maybe the fact that it's a tiny bit closer to being auto-wikied.\n\nTo my mind, the question ends up being clearer - a good thing all round. To put it another way, if there wasn't any editing involved, would you rather see a question with the salutations or not? I'd rather see a question without. An edit which just removes the salutation just takes the worse of those situations and turns it into the better one. Where's the harm?\n\nJon"}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 08, 2009", "message": "@Click Upvote: That question *is* definitely subjective. Anytime you say best, it is always subjective.\n\nAnd Java isn't the only programming language, so you cannot say it's general."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Upvote: That is not true at all. The OP does /not/ control the tagging. The community does."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Apr 08, 2009", "message": "There, I improved the nature of the question and removed the argumentativeness from it so it will (hopefully) be re-opened.\n\nhttp://stackoverflow.com/revisions/408929/list\n\nCan we move on?"}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 08, 2009", "message": "&gt; @Upvote: So you are saying you refuse to honor the agreement and bring your claims of abuse to the mods instead of just rolling back?\n\nDo you really want every edit to be emailed to the team? Do you think they have time to babysit us all the time? Why can't you just agree that you will abide by the guideline and improve the question with each edit? Then we won't have a problem at all.\n\n@Sameul\n&gt; @Click Upvote: That question *is* definitely subjective. Anytime you say best, it is always subjective.\n\nAnd Java isn’t the only programming language, so you cannot say it’s general.\n\nI wanted a comparison of the features of Netbeans and Eclipse which is completely objective. Read the question. Also general programming to me means general issues related to programming, such as version control, IDE, etc. I've already got my answer so let that post fade out."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 08, 2009", "message": "You know what. Both sides are [wrong]. ClickUpvote doesn't care about the question contents and neither does RichB. They are both just making petty edits [because they can].\n\nThey are the extremes I want to avoid on the site. I like how everyone is arguing for the other side to be the bigger man and walk away.\n\nWay to call yourselves petty and immature folks.\n\nFollow the guidelines in the post and if you feel someone is egregiously violating those guidelines, then bring it up to the team. Don't be petty."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 08, 2009", "message": "@Click Upvote: You want objective, yet the answer you accepted is THE most subjective one there."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Upvote: I have already agreed to the guidelines and I have been practicing along those guidelines, no one is even arguing that.\n\nThere is no reason any of my edits should be getting reported, but if I was truly doing something wrong, this would be the correct avenue. Then I could be penalty boxed or banned or whatever.\n\nFact is that I am living by the rules, you are not.\nWill you accept the agreement or not?"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Jeff: If we are going to be holding people accountable for inflammatory comments on this blog (or anywhere else on the internet apparently) could you please do something about this post/poster: http://blog.stackoverflow.com/2009/04/in-defense-of-editing/comment-page-2/#comment-19006\n\nTime and time again we try to ignore the inflammatory comments by this poster as they provide nothing to the conversation, but they really don't represent the reasonable, calm argument we are having at all."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "But I am the problem right?\n\nhttp://stackoverflow.com/revisions/408929/list"}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Apr 08, 2009", "message": "Click upvote, \"The main page shows only the titles of the posts for me\"\n\nThe main page rollover tooltip shows the first little bit of the question.\n\nFar too many questions are being posted where that tooltip is useless because they've got a long salutation, or \"I hope you guys can hlpe me im realy stuck!\" and so forth.\n\nI don't remove salutations and such, but I don't rollback edits done by others because it arguably improves the question and usability of the site as a whole.\n\nIf the original author of the post insists and performs a rollback, fine. \n\nBut I disagree that other editors who do the rollback are actually helping the author - the rollback rarely makes the question better in terms of clarity, ease of reading, etc.\n\nSo I'm of the opinion that Jeff Atwood is:\n\n\"If you are going to edit a post, make sure you’re substantively improving it. \"\n\nA rollback is an edit, and RARELY *substantially* improves a post.\n\nIf you think the original edit made the post SUBSTANTIALLY WORSE then go ahead and do the rollback, because you'll be making the post substantially better.\n\nOtherwise, let the original author defend their post, and follow the \"substantially better\" rule for both regular edits, and rollback edits.\n\n-Adam\n\nreCaptcha: sneak\n\nIndeed."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 08, 2009", "message": "@Rich B - Because \"reasonable, calm argument(s)\" carry on for 200+ comments with the end result of commenting being locked and your last post being removed by the site author?\n\nStop trying to vilify me. What I find odd, is the end guidelines suggested by Jeff are what I was shooting for all along. Yet, you and select others have saw fit to continue to mock, ridicule, and discredit me through dishonest means the entire time.\n\nAnd if I sounded upset, it's because I am a little at ClickUpvote's behavior. I don't want that. It causes you to focus on that instead of my arguments. I can't defend ClickUpvote, because I don't condone his actions either. You've set me up as some sort of huge, monstrous villain to your righteous avenger, yet I've not done half the stuff you've accused of me or thought I did.\n\nI give the StackOverflow team full permission to disclose any and all emails I have sent them."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 08, 2009", "message": "*sigh* Ok, no more edits from me ever. Lets end this flame war now.\n\nPick a new subject now rich b."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Adam Davis: Agreed, and this is what I have been asking for since I modified my behavior after talking with Jeff.\n\nThe fact is that some people are truly only into starting a fight.\n\nFor instance: http://stackoverflow.com/revisions/408929/list\n\nI don't condone anyone rolling that back, but Upvote is /insisting/ on rolling back to an improper edit. It is clear he is only doing it to argue.\n\nI would ask Jeff to lock the post and give Upvote the stern warning he needs before placing him in the penalty box."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Apr 08, 2009", "message": "Every time you see a question, IGNORE who made it, who edited, whether it was edited, etc.  Even if you've seen it before and notice it's changed.\n\nIGNORE THAT.\n\nThe question, for all intents and purposes is a clean slate. \n\nNOW apply Jeff's suggestion: “If you are going to edit a post, make sure you’re substantively improving it.”  Would the SUBSTANCE of the question be improved with some editing?  If so, then go ahead and edit.\n\nOtherwise, leave it alone.\n\nRollbacks are edits, and should follow the same rule starting with the question as it currently stands - not with the original post.  Is the rollback going to change the SUBSTANCE of the question in a significantly positive manner?\n\nIf not, no edit, no rollback.\n\n-Adam"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Adam: In 100% agreement if I haven't made that clear before.\n\nNow hopefully we can move on to removing the actual disruptive users who are still causing these issues."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 08, 2009", "message": "@Rich: I think Toast's post is the best, must succinct summary of the situation that I've seen.  Any value from your editorial contributions, or ClickUpvote's, is far exceeded by the rancor that they generate."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 08, 2009", "message": "I doubt Joel will have as much patience for these guys as Jeff has shown so far."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Apr 08, 2009", "message": "@theman_on_vista I'm torn - on one hand it'd be fun to see what Joel has to say about it, on the other hand this is actually a small corner case of the whole of SO, and quite frankly isn't worth the time and effort people are expending on it.\n\nI vote Jeff doesn't even bring it up or mention it on the podcast, or elsewhere.\n\nIn other news, I haven't seen anything about the vote for new SO super moderator.  Did I miss something, or is that process stalled/scuttled?\n\n-Adam"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Chris: I do a lot of edits in a normal day. 99% of those cause nothing as far as I or anyone else know.\n\nIf a small subset of users is hell bent on causing problems with my edits we have mechanisms for dealing with this. Upvote for example was one of those users and was reported many times and his rollbacks were deleted by the admin team. \n\nI feel the admin reaction was a bit on the soft side from what I could see for such a distinct patten of blatant abuse.\n\nI have asked before whether I should stop editing altogether and I have heard my thoughts confirmed that this would neither stop this behavior from these users (look at this rollback war for example: http://stackoverflow.com/revisions/408929/list), nor would it benefit the community since I make lots of valuable edits and help a lot of people that no one else might have bothered with.\n\nI advise attacking the root of the issue which is users who are so clearly hellbent on attacking other user's posts or edits based on who they are. We have someone right here in front of us who has been proclaiming his intent to abuse the system for a while now, and acting on it. In contrast, I have abided by the rules and changed my behavior on multiple occasions in response to Jeff and the admin team."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 08, 2009", "message": "@Adam - Probably stalled while they handled this issue. As for it coming up on the podcast, if they do mention it, they'll probably leave out names and abstract the situation to something greater that neither side can take offense at.\n\nGood chance they'll talk about Clay Shirkey"}, {"author_name": "Matt", "gravatar_hash": "1776a3d5eb60a5b01d108e86a047ad2d", "author_url": null, "date": "Apr 08, 2009", "message": "Now I feel the whole lot (Rich B, upvote, toast, BTK etc.) should have been banned. Not just Rich B. \n\nClear the ring."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Apr 08, 2009", "message": "@Chris, yeah, I think you're right.  One of the mailing lists I participate in had a member that was on constant moderation for calling other's on the list stupid, moron, etc in response to their questions.\n\nTechnically brilliant, socially abrasive and abusive.\n\nEventually he got a newbie to ask why he was on moderation, and he started to send answers to questions that essentially said, \"I'd tell you, but I'm on moderation and refuse to be censored\"\n\nThe list moderator then made a great, IMHO, mistake.  \n\nHe responded.  This generated endless discussion for days that, honestly, 99% of the list didn't care about and didn't want to see.\n\nAs much as a site is community driven, eventually there needs to be a formless, faceless wall that says, \"This is how it is, and if you don't like it, maybe StackOverflow is not the site for you,\" just so that the 99% of users who don't care don't have to keep seeing the discussion and problem.\n\n@toast LOL at Clay Shirky.  Human interaction is so interesting.  Keep meaning to read \"Here comes everybody\" to see what it has to say.  I wonder - there's got to be a ton of anthropologists studying community dynamics on the internet.  Might have to start poking around myself.  Fascinating stuff.\n\n-Adam"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 08, 2009", "message": "@Rich: I think the rancor that has been generated by those 1% of edits far exceeds whatever value there is in the other 99%."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 08, 2009", "message": "Guys, this is my final conclusion on this topic:\n\nRich B is a troll with a potentially very sad life. He gets off on the attention he generates here by arguing with everyone over petty things. \n\nHis claim earlier was that he wanted me to stop rolling back edits. I've agreed to that and yet he just can't shut up. \n\nBy engaging in any more conversation with him you're feeding the troll."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Apr 08, 2009", "message": "@Click Upvote:\n\n/facepalm.  \n\nSeriously?\n\nTake it offsite.  This is not the forum you're looking for.\n\n-Adam"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Chris: I think your opinion on that would be a minority opinion."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 08, 2009", "message": "@Adam - \"Here Comes Everybody\" added to my Amazon list. I'll probably pick it up next time I order something."}, {"author_name": "grieve", "gravatar_hash": "b6846c76073e26cfdb1e0dc4ab8fd5db", "author_url": null, "date": "Apr 08, 2009", "message": "I stumbled onto this blog yesterday from a link in a SO post. I didn't even realize it existed, and the first thing I see is Rich B in the penalty box.\n\nHilarious!"}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 08, 2009", "message": "@Click Upvote: by posting a middle finger, you have eliminated any sympathy you might have had.\n\n@RichB: Click Upvote is allowed to rollback ** his own post **.  And yes, some people are still focusing greatly on behavior that you stopped doing or reduced doing a few weeks ago.  The only way you will convince them is by showing changed behavior over time.  Arguing with these people only entrenches their opinion of you, without accomplishing any of your goals.\n\nI was partway through an attempt to respond intelligently in this thread and decided to refresh in another tab and holy crow.  People are losing their minds.\n\nPeople, get perspective.  This is not our *life*, except for the owners of this space.  This is a web forum.  Go outside.  Kiss your kids, parents, SO (pun!), pet, computer, someone or something!  Get some fresh air. Come back in a day.  RELAX."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Eddie: No doubt an OP has a right to rollback his own post, no one is arguing that, as you see in the example being discussed I did not rollback his post.\n\nWe are discussing a distinct pattern of blatant and admitted abuse however. One that needs to be dealt with every bit as much as overzealous editing."}, {"author_name": "Anthony DeRobertis", "gravatar_hash": "05b48b72766177b3b0a6ff4afdb70790", "author_url": null, "date": "Apr 08, 2009", "message": "@Jeff,\n\nI understand your sentiment is something along the lines of: if you see\na single error in a post, there are probably more; please fix them all.\nIf there really is only one, go ahead and fix it. It seems from your\ncomments that you do not intend the alternate meaning of if there is\nonly one mistake, don't fix it.\n\nIf my understanding is correct, I agree with that. I also add, however,\nthat even fixing a single error of many improves the site, and while\nit'd certainly be better to fix all of them, fixing one is still a\npositive contribution.\n\nI certainly welcome any such edits to my posts, no matter how trivial.\n\nI agree with other posters that removing leading fluff is significantly\nhelpful, as it improves the question \"preview\" text; further, I believe\nthat removing fluff anywhere is good. I believe that in general copy\nediting is helpful, as it makes the questions and answers easier to\nread. However, I temper these beliefs with another, that ultimately the\nOP “owns” his question, and that if he does not want copy editing —\nindicated by him reverting — then it should not be provided.\n\nJeff, I also suggest looking to Wikipedia for inspiration; they have\ndealt with this issue for ages. For example, their three-revert rule\n(3RR) helps prevent this kind of edit warring.\n\n--\n\n@Click Upvote, Rich B, Samuel\n\nI am an uninvolved third party who knows none of you, and none of your\npast disputes (if any). I hope thus to provide the view of an impartial\nthird party.\n\n408929 is an edit war, and its not something any of you should be proud\nof. I suggest you all start following something akin to Wikipedia's 3RR\nto prevent future incidents.\n\nIn particular:\n\n1. I agree that the community owns the tags, and that tvanfosson (who\n   did not edit war) made a proper edit to put in the subjective tag.\n   There are plenty of community members who prefer to ignore subjective\n   questions, and the subjective tag provides a technical mechanism to\n   do so.\n\n2. I really have no opinion about the 'general-programming' tag. I wish\n   there weren't a five-tag limitation, but as there is, I can\n   understand it being removed to make room for subjective.\n\n3. Gortok (who did not edit war) made a useful contribution. I do not\n   believe anyone disputes this.\n\n4. Samuel's changing \"Pros\" and \"Cons\" to lowercase is, by standard\n   English, correct. To me, that is a helpful edit. However, the edit\n   warring afterwards was certainly not.\n\n5. I do not understand Click Upvote's revert of the lowercasing; it\n   really looks like it wasn't performed in good faith to me. However,\n   it is his question, so, I'm not sure about this. Personally, were\n   that my edit being reverted, I would not have edited the question\n   again.\n\n6. The edit war of capitalize/uncapitalize is plain silly. That is\n   definitely an application for 3RR.\n\n\nI'm \"derobert\" on SO. I hope my formatting above survives the blog\nengine; it looks fine in Vim."}, {"author_name": "theman_on_vista", "gravatar_hash": "776fc61036a84f03601589ed7fba87b2", "author_url": null, "date": "Apr 08, 2009", "message": "@adam davis - \n\nNo i meant, i keep checking this site waiting for the new podcast and all i keep finding is this stuff.  I just like listening to the podcast"}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 08, 2009", "message": "@theman_on_vista:  If you want only the podcasts, then at the bottom of each SO page (but not at the bottom of blog pages) click on the \"podcast\" link.  There, you will see only podcasts and no blog entries."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 08, 2009", "message": "Editing is fun. It makes the site better and puts smiles on the faces of the grubby children. Anyone who talks bad about editing hates SO... And children. \n\nRolling back non-destructive edits, even trivial ones, is malicious and should be considered a direct attack on the site. \n\nRolling back rollbacks of trivial edits is petty and pointless - as i've established above, you're up against a malicious devil, hell-bent on the destruction of SO. You're out of your league. Send an email to the SO team, go to bed and pray for daylight.\n\nAnd that's all i got to say..."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Apr 08, 2009", "message": "What is wrong with a small edits?  Maybe I don't have the time or interest to make the post substantially better, but I can at least fix simple grammatical mistakes as I see them.  You're saying if I can't pick up all the litter in the park and fix the jungle gym while I'm at it, then I shouldn't bother moving that old Dasani bottle from the bicycle path to the trash can.\n\nAre there users really getting upset by people changing \"its\" to \"it's\"?  If so, why?"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Kip: Yes they are. And I agree with you it is ridiculous.\n\nCheck out the edit wars blog post and it's comments."}, {"author_name": "JMS", "gravatar_hash": "64046677f02ebd6fcb9ce23bc7dc74a0", "author_url": null, "date": "Apr 08, 2009", "message": "Excellent, SO drama has filled the void left by BSG.\n\nVery entertaining. Keep it up!"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Apr 08, 2009", "message": "kip,\n\nI think the problem that some people have with making one \"trivial\" change to a post, like changing its to it's, is that it moves that post one step closer to being community wiki.  If 5 people each make one tiny edit to a post, it becomes community wiki and the original poster gets no credit for it.  For this reason, I think it's polite to make all the changes that you notice at one time, just to keep the number of edits to a minimum."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Apr 08, 2009", "message": "Something interesting going on right now...\n\nhttp://stackoverflow.com/questions/tagged/gnu-linux\n\nThe 'gnu-linux' tag didn't exist until yesterday. Now the user that created it seems to be trying to retag all 'linux' questions (and will get a Taxonomist badge when badges get fixed). Are these edits justified?"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 08, 2009", "message": "@mmyers: I would say no.  Until this fellow came along the community standardized on the linux tag to describe this OS and I don't really see any pressing need to change."}, {"author_name": "Paolo Bergantino", "gravatar_hash": "80ae8ec34e9e3e66c5be50733afaa44e", "author_url": null, "date": "Apr 08, 2009", "message": "@mmyers: I don't agree with that at all. I am tempted to just start undoing them right now but I'd like Jeff's input on this one."}, {"author_name": "Anthony DeRobertis", "gravatar_hash": "05b48b72766177b3b0a6ff4afdb70790", "author_url": null, "date": "Apr 08, 2009", "message": "@Jeff: Another thing that comes to mind is that the Stackoverflow community really doesn't have a good way to talk to each other. So we're left guessing each other's intentions.\n\nFor example, we don't have a good way of talking to each other to agree on tag taxonomies."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 08, 2009", "message": "@Anthony: There's also no good way to contact this user within SO to let him know why we disagree with his actions.  Comments are good for discussions about a single question, but not so great for issues that span multiple questions, like tagging."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Apr 08, 2009", "message": "@Anthony DeRobertis : We tend to congregate on IRC and usually discuss that there. I think the user that is adding the gnu-linux tag is being disingenious, and that tag should be removed."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "Just report his retagging to the admin team, let them deal with it."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 08, 2009", "message": "@Anthony DeRobertis: While I have had a few brush ups with Click Upvote, http://stackoverflow.com/revisions/408929/list goes to show that he is only trolling. When he posted the question, he had it as pros and cons and continued to leave it that way until Gortok changed them. So I went in and fixed Gortok's mistake and Click Upvote all of sudden changed his stance to be against the edit back to pros and cons.\n\nHow is that *not* trolling?"}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 08, 2009", "message": "IMHO, if the community has agreed on a tag, then going in and mass changing to some new tag is abusive.  If the community has chosen \"linux\" then that is how people will *search* for it.  Changing it to \"gnu-linux\" may fit some person's political correctness, but it actively makes the site more difficult to search.\n\nI've mass edited tags, but only when I saw two very similar tags, e.g., \"book\" vs \"books\" where one was used hundreds of times and the other maybe dozens.  In *every* case, I have retagged the lesser-used tag as the more-used tag in order to follow the community chosen preference."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Apr 08, 2009", "message": "@George: Can you unilaterally decide that a user is being disingenuous? Does the user get to defend himself?\n\nFrom his profile, I gathered two things:\n\n1. He's only been a member for a month--still a bit of a newbie. Can we cut him a *little* slack?\n2. He's a self-described \"free software enthusiast\". To some people (quite possibly including this user), Linux is a misnomer and should be corrected to GNU/Linux.\n\nAnyway, this is sort of a moot point since communication has now been established in the comments on his question (http://stackoverflow.com/questions/726773/how-can-i-generate-a-file-of-random-negative-and-positive-integers-in-serial)."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 08, 2009", "message": "1800 questions tagged \"Linux\" and 23 tagged \"gnu-linux\".  That says to me that the community has CLEARLY and unambiguously decided.  To retag the 1800 questions as \"gnu-linux\" is to cause harm."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Apr 08, 2009", "message": "@Eddie: I agree, and I wasn't defending the retag. I was simply arguing for \"assume ignorance, not malice\". And look--all the gnu-linux tags have been removed, and no permanent harm done!\n\nCaptcha: crossed crisis. How appropriate, I hope!"}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 08, 2009", "message": "@mmyers: Yes, I was not disagreeing with you, nor replying to you personally.  I was adding context to this discussion.  Thanks for pointing out where dialog has been opened.\n\nI agree.  Better to assume lack of malice until proven otherwise."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 08, 2009", "message": "I think this is a good example of why Stack Overflow needs a meta-discussion area.  http://stackoverflow.uservoice.com/pages/general/suggestions/106921-provide-an-authorized-location-for-meta-discussion-"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 08, 2009", "message": "What I find non-persuasive about bringing up a specific good or bad edit and using it to justify one behavior or the other is that it assumes that the action itself is the problem.\n\nFor example: If I ask \"Was entering World War II a good decision?\" and you answer \"Yes, Germany decided to invade neighboring countries and generally act like a dick\", I could then, by the same logic, reach the conclusion \"Well, then you agree with the war in Iraq as a good decision.\"\n\nThe question isn't whether or not the action itself has value, because inherently it is beyond such statements. Editing is neither good nor bad, it needs no defense. Only when the action is applied to specific cases can we start to evaluate merit.\n\nAre all edits good? No.\nAre all edits bad? No.\n\nPeople assume because I am against bad editing practices that I am against editing in general. This is a gross over-simplification of my position.\n\nThe thing we want here is to discourage the bad editing and encourage the good editing."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Chris: It has one. There is the official #stackoverflow IRC channel on freenode."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 08, 2009", "message": "@RichB: Chat is no substitute for a good website based discussion area.  Chat isn't any good for asynchronous discussions, and it doesn't do a very good job of preserving history for later reference.  Heck, if we're going to consider internet stone age tech like IRC, a mailing list would do a much better job.  What we really need is something integrated into SO itself."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 08, 2009", "message": "@Chris: The real time discussions on IRC have been very advantageous. If you don't feel like joining, that is fine. \n\nOtherwise, go start a forum site and ask for the admin team's blessing. I don't see why the SO team should spend anytime on it, they barely have the time to moderate SO.com, what makes us think they can take on a forum as well?"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 08, 2009", "message": "It could be called StackOverflowOverflow.com"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 08, 2009", "message": "@Rich: They should spend time on it because an integrated meta-discussion area would make SO better.  A forum on a separate site wouldn't work nearly as well.  This is really something that needs to be integrated with SO itself.  I really think this has been the most important missing feature from day one."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 08, 2009", "message": "Ok, questions about the hypothetical off-site forum:\n\nIf I create the forum, the people come, it gets blessing from the powers that be, etc, etc. How do we handle the inevitable problem of high rep users wanting more control on the forum as they enjoy on StackOverflow?\nWhat about when I make a decision that some higher reps feel is inappropriate?\nHow is it handled in the IRC channel (if it comes up at all)?\n\nWhat if two people create forums, they get equally popular, and the admins are conflicted about which to bless with officaldom?"}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 08, 2009", "message": "@toast: Considering there are only four SO moderators, I would suspect most high rep users understand that their rep inside of SO only means something at SO.\n\nAnd just because something is marked as SO official, does not mean it cannot be revoked later on. I'm sure that if SO ever added discussion forums, they would make any such third party forums unofficial."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Apr 08, 2009", "message": "@mmyers: I'v'e commented on the issues of Taxonomist badge farming here http://stackoverflow.uservoice.com/pages/general/suggestions/135084-remove-the-taxonomist-badge. I think that badge encourages this kind of bad behaviour with no real upside (and thus should be removed).\n\nBut the issue hasn't really got any traction so I guess we just live with gnu-linux."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 08, 2009", "message": "ashawley's last comment in response to http://stackoverflow.com/questions/726773/ is telling.  I disagree that tagging is half-baked, but fully agree that there is currently no proper place for the discussion that occurred in the comments to this person's question, and that such a place is needed.\n\nThe kind of friction experienced by that user is inevitable as more users reach edit privs and decide to shape the community in their vision.  (aka, global retagging.)  The several people responding to ashawley were IMHO quite gentle, at least in the comments to that question. The user's response *seems* to be \"If I can't globally retag as I see fit then I'll take my ball and go home.\"\n\nThis will only become more common as more users gain edit privs.  We need a way, for example, to *gently* interrupt new users going on a retag rampage and bring that person into the fold.  Commenting is a poor proxy for what is needed.\n\n@RichB: Yes, the IRC is useful.  It is most definitely useful.  But it is a poor repository of discussions and decisions reached.  Something integrated with SO would achieve far higher usage and would see a larger and thus more representative fraction of SO's userbase."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 08, 2009", "message": "@Eddie: Exactly.  I know Jeff is regretting following the Wikipedia database model, but one area where WP really shows the way is in it's talk pages and WP: namespace pages.  They allow for discussion about the site while providing a nice clean separation between that discussion and the site's actual content"}, {"author_name": "Anthony DeRobertis", "gravatar_hash": "05b48b72766177b3b0a6ff4afdb70790", "author_url": null, "date": "Apr 08, 2009", "message": "@George, Rich B: I'm on the IRC channel (nick: derobert). But its not\nreally that good for long-term conversation. And if you're not there all\nthe time, you miss out. Quick coordination, sure, but not much more.\n\nWe need talk pages.\n\n\n@Samuel: Yes, I saw the sudden insistence on capitalization. That'd be\n\"really looks like it wasn’t performed in good faith\". But if a person\nreally wants to make himself look illiterate in public, well, I\npersonally don't care to argue with him."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "All I can say is: \nhttp://stackoverflow.com/revisions/408929/list"}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Rich B: This just show that Click Upvote is only here to troll. He is just rolling back my changes to roll them back, even when my changes uses the grammatical form that he himself used in the original question."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "I don't want your edits on my question. – Click Upvote (34 mins ago)\n\nThat says it all."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "If its my question, I decide what I want on it or not. Respect the original author. If you want to break rules you're the ones trolling, not me.\n\nSome people just don't have a life. I can't believe you've been checking that question all night Rich b to see if I'll roll it back."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: I agree with respecting the original author, but not when they are obviously trolling. Care to explain why you all of a sudden changed between \"pros &amp; cons\" to \"Pros &amp; Cons\"?"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "Have I mentioned recently how much I like ponies?"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: RSS Notifications are hard."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel, because I like Pros &amp; Cons better than pros &amp; cons. It brings more attention to the words. The question was carelessly typed when I first posted it so I didn't notice it.  Because its my question, I can have it the way I want.\n\nBut when you keep insisting on forcing your opinion over the OP when its against the guidelines/rules, especially for such a trivial issue, that IS trolling."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: So in other words, you are bullshitting about the reason.\n\nAlso, care to explain the subjective/general-programming tagging?"}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel, in other words you have nothing else to explain your trolling so you're sorting to insults. Read my comments earlier for explanation of the tagging, general-programming to me means all general issues related to programming such as IDE, version-control, etc. Good bye now."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "resorting *"}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: What insults? All I've done is call you out on your trolling of that question and bullshitting of your reasoning.\n\nAnd what happened to your comment where you said you give up and won't edit it anymore? That mysteriously disappeared when you rolled it back a couple days ago."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 09, 2009", "message": "There are 23 edits on that question and the only one that I think actually adds anything useful is Gortok's.  ClickUpvote and Samuel are both behaving like five-year-olds who insist on getting their way.  The capitalization (or lack thereof) of pros and cons has no effect on the readability or usefulness of this question.  \n\nBoth of you give it a rest!"}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Chris: I would consider tag maintenance and proper grammar to be useful. But I've reported CU and asked for the question to be locked in its correct form, now we just wait and see."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel: The 'improper' grammar in this case doesn't do anything to impede the readability or usefulness of the question.  Edit warring over such a trivial thing is useless.  Asking the SO team to lock the question is worse than useless.  I want them to spend their time improving the site, not settling silly arguments over capitalization."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 09, 2009", "message": "This edit warring has gotten to the point where I think we need something like a one-revert rule: http://stackoverflow.uservoice.com/pages/general/suggestions/159271-establish-a-one-revert-rule"}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Chris: It's not just this question, CU does this on lots of questions. And he whined enough to the team to get Rich punished.\n\nI think SO as it is would be fine if there were more moderators. Preventing trolls like CU from rolling back valid edits would go a long way to improving SO and allow others to improve questions/answers without fear of being punished because of the loud minority."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel: We wouldn't need more moderators if people would stop feeding the trolls.  Let him have his meaningless capitalization.  If you're worried about getting punished by a loud minority, only roll back stuff when it's clearly necessary.  If you're the only one rolling back his rollbacks, maybe that's a sign that his rollbacks aren't really that bad."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Chris: People will feed the trolls, there are no ifs, ands, or buts about it. I've given him his grammar error trolling, but what would you suggest about improper tagging?\n\nPeople use tags for lots of different things and having questions improperly tagged cause grief to many users."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Chris: So instead of rolling back people would just edit?\n\nIt has been brought up and shot down before."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 09, 2009", "message": "@Chris - Exactly. Responding to bad behavior with bad behavior gives you no moral high ground. That's the biggest problem with the edit wars, both sides look like trolls."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 09, 2009", "message": "@Rich B - Even in Wikipedia's 3RR, they take into account edits that are effectively reverts/rollbacks. It's not a technical limitation, it's a social limitation."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Chris: This post isn't a great representation of the problem as a whole. I don't condone the rolling back either. Sam should have just reported CU from the start and walked away IMO. That is what I have been doing.\n\nBut watching CU go around and rolling back my edits and other people's edits for no justifiable reason is a pattern of abuse and trolling. I think this is what has Sam upset. Sam has the right idea, and means well but is going about it in the wrong way. I can at least respect that.\n\nBut something does need to be done about the user exhibiting a pattern of abuse and trolling. That is ultimately the solution to the root problem."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Chris: I certainly am not trying to fight with you at all, because I would suggest we all have the same goal and the same ideas, just with slightly different emphasis.\n\nHowever I do need to point out that the last rollback was made 3 hours ago. You went and adding incendiary comments to that question's comments 1 hour ago. If both sides have let it go, please don't go back and stoke that fire. Keep the meta argument here or on IRC or something please.\n\nI know you have the best intentions with those comments, but in my experience all it usually does is fan the flames."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel:  This is Click Upvote's question, not yours. You are not the final arbiter of what should appear there.  When the OP objects to your interpretation of proper grammar, the OP wins.  Period.  Right and wrong is irrelevant.  Better or worse is irrelevant.  That you're changing to how the OP originally had it is irrelevant.  The OP is the *final* arbiter of grammar and writing style.  Period.\n\nTags are a different matter.  Tags are (IMHO) owned by the community.  But if the OP puts his or her foot down on writing style, that is -- by definition -- the end of that discussion."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "&gt; And he whined enough to the team to get Rich punished.\n\nI reported New and Improved BTK and I suggested it was the sockpuppet of Rich B. His IPs seemed to be from a web proxy so Jeff didn't do anything about that. So its hardly my email that got him banned, Jeff said there were over 30 complaints about Rich B.\n\n&gt; But watching CU go around and rolling back my edits and other people’s edits for no justifiable reason\n\nI owe you an apology for that, and I'm sorry. I didn't know that:\na) The first few lines of a question show up under questions\n\nb) In some cases you had improved the grammar and readability, now that I look back on them. But you had also unnecessarily taken away the humor, hence the rollbacks. In future, please try not to remove personality/humor while making your improvements, and we can all co-exist.\n\nSo there. But you don't really have to worry about me editing anything anymore, other than my own questions where needed."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "I wish I had a ball so I could pick it up and take it home."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "Oh, I forgot to post this here:\n\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/159197-make-editting-anonymous"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 09, 2009", "message": "I think that anonymous editing would take the grudge aspect out of some rollbacks, but I don't see it doing as much to prevent the edit warring as believed.\n\nA lot of my complaints have had to do with the style of editing rather than the editor himself.\n\nI think the entire reason this thing got mostly focused on Rich is because he put himself in the spotlight by stating that he never made pointless edits, etc, etc. (Let's ignore that discussion for the moment, it's not the point I'm making here.) He became the defacto champion for his side of the debate. As such, his actions became hyper-evaluated, even smaller missteps were given undue weight.\n\nIf anonymous editing is enabled, hopefully it will prevent people revenge-editing people like Rich who does do some good in his editing regardless of whether or not you think he is a good guy. That way we can concentrate the discussion on where it needs to be, and not on who is making the discussion."}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Apr 09, 2009", "message": "@Rich B,\n\nI was kind of oblivious to the you being placed in the penalty box situation until now.\n\nI've also just read that horribly boring IRC transcript you posted as well.\n\nYou are the ~definition~ of what would make a bad moderator.  Have you made lots of good edits?  Sure.  Have you made lots of edits that are questionable/not in-the-spirit of the site? Definitely.\n\nI've seen with my own eyes you getting into a number of edit wars and just counter-productive behavior.  \n\nWe need someone about 1000x more level headed and mature to moderate SO."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "@Toast: I have gone and based almost my entire revision style off of the same method that Rich B and other users like Gortok use. Not once have I ever been rolled back or re-edited to reinsert things like smiley faces, salutations, or any of the other \"fluff\" which has been part of such heated discussions. \n\nIf I can get away with doing the exact same types of edits that Rich B gets flak for, then it is likely that there are some possibilities: \n\nA) Rich B just has a much greater volume of edits which makes him more visible and more likely to run into trouble\n\nB) People associate Rich B negatively with the edits he makes and therefore will start to fight tooth and nail against them. \n\nBased on the sheer number of people who have been coming on the blog to whine about Rich B or to come and high-five each other over his suspension, I am certainly leaning towards B. Gortok doesn't get nearly as much flak for the edits he makes even though he has been engaged in edit wars in the past. I have not once ever received flak for making similar edits. \n\nI do believe that if you were to make the edits anonymous, people are not going to spend as much time complaining about the edits because they won't have a villain to associate them with. Sure there will be some people out there who will insist that they should not be edited and conflicts will arise, but they will be isolated incidences which do not carry grudges because there is no enemy to associate with (for all you know, you could be fighting against 14 different revisers). I believe a reporting feature should be implemented that would allow for quick flagging of conflicts so the mods would immediately quash it."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Apr 09, 2009", "message": "Regarding TheTXI's comments. I edit in the same fashion as him/RichB/Gortok and i've seen others edit in the same way.\n\nWe've seen rules changed and we have followed those rules and I've even been in some edit wars (not big ones) but still, I have yet to seen anything from the team towards me.\n\nSo yes I do think RichB has gotten a lot of unnecessary fallout from pent up anger in the community."}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Apr 09, 2009", "message": "If you edit things in an obnoxious way, or if they go against the posters wishes then expect to have that sort of resentment build up.\n\nFix typos, provide links, make sentences more clear... that is the only editing you should be doing.  Anything else is a net-negative."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "Simucal: \n\nI think you are missing an important point. There is no communal outrage when someone else does the exact same things. That should indicate that the outrage isn't actually coming from the type or quality of the edit but who is making it."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "&gt; Fix typos, provide links, make sentences more clear… that is the only editing you should be doing. Anything else is a net-negative.\n\n+1000 to that."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: So if the only editing we should be doing is fixing typos, why are you against me fixing your typos?"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "This is the song that never ends,\nit just goes on and on my friends\nSome people started singing it, not knowing what it was,\nand they'll continue singing it forever just because..."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel, capitalization is a matter of personal preference, the meaning of the word remains the same with and without capitalization. Your first edit was perfectly fine but when an OP rolls back your edit, trying to force your opinion is just asking for an edit war."}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Apr 09, 2009", "message": "TheTXI:\n\nIt is a proportional response to the degree with which it is done.  If someone makes a single bad edit then they ~shouldn't~ be singled out.  \n\nIf you see a person make a bad edit, and then another, and then see an edit war, then guess what?  People are going to take notice and that is exactly what happened.\n\nHe isn't magically being singled out TheTXI.  He is being singled out for a real reason, he has caused some strife and negative response with the way in which he edits.\n\nHe removes humor from posts, if his edits are rolledback by the original poster he will sit there like a child and re-edit someone elses question over and over.   These are just things ~I~ have seen myself.  Multiply that by the number of edits he makes and you can gather that he is going to piss people off.\n\nIf your edits breed consistent resentment from the community than ~you~ are doing something wrong."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: Capitalization is not a matter of personal preference, there is a reason why we have grammatical rules. And since pro and con are not pronouns, they do not get capitalized.\n\nIf you want to place emphasis on text, you use italics or bold."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel, I'm perfectly capable and allowed to format my questions any way I want them, I don't need to copy the great master editor Samuel. And since you're going to keep arguing and I have work to do, I'm ending this discussion."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "*starts the stopwatch*"}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: Like you ended your editing 10 hours ago and then decided to start up again?\n\nTalk to any English major, they will tell you that typos are not a formatting options; however, they will easily tell you that bold and italics are formatting."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "Also Samuel, this isn't english lessons, this is a programming website. The meaning of the words remains the same, if I want the initials capitalized, I capitalize them, if I don't, I don't. And since it was my question, I can do either of them. Stop arguing now."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: So you are in favour of editing rules that allow to fix typos/errors in spelling and grammar, but only when they aren't your words?"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "*stops the watch*\n\n3 minutes."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@TheTXI: Blog shows 2 minutes."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Me: Whoops, 3 minutes, but still... 3 minutes. lol"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "Basing on the time difference between Click's two posts. If you have an issue with that, buy your own freaking stopwatch!"}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel, in this case you were trying to fix something that wasn't broken. And I'm of the opinion of editing typos/errors, but leaving it alone if the OP rolls it back, unless you're deliberately looking for edit wars. \n\n@TXI, I typed that question right after the first without leaving the page, so reset your stopwatch!"}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: If you are for editing to fix typos/errors, you cannot just arbitrarily decide what is a typo/error. \"Pros &amp; Cons\" is an error, there is no form of English where that is not an error.\n\nWhy is someone special enough that they get the privilege to ignore following the rules of our language?"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 09, 2009", "message": "I think Rich B is going to have company in the box soon.\n\nOT: Are the captchas dependent on context? Because my current set is \"hot\" and \"deserved\". Hot, much like the issue between ClickUpvote and Samuel. And deserved, which is what it would be if they both got boxed."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@toast: If the moderators are going to ban me for one infraction, then SO is not a website I want to visit."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "I hope you don't mean me toast"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel - But you are being willfully antagonistic towards ClickUpvote. You seemed to try and take up where Rich left off. It doesn't help that ClickUpvote is also being willfully antagonistic, but it doesn't excuse you either.\n\nEspecially in light of the consensus reached by everyone else here.\n\n@Simucal - Thank you for understanding and rephrasing my points (even if you reached them independently, I'm not trying to claim converts/followers/whatever just acknowledging that what you say, I agree with 100% and has been my point all along)."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel: I will say this one more time.  I know you will probably ignore me, but I'll try again anyway:\n\nClick Upvote is the *final* arbiter of the language content, grammar, and writing style of his (or her) own post.  If someone *wants* the grammar to be a certain way on ** their own post ** then tough noogies to the rest of us.  That's how it will be.  These are The Rules, as recently specified and clarified.  This is also the community consensus.\n\n@Simucal: Your facts are a few weeks old.  RichB altered his behavior some weeks back.  People are so focused on Rich's personality that this fact has been lost in the uproar.  As others have pointed out, several other people with very similar editing styles have been ignored with all of this energy focused on Rich."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Eddie: Indeed. I changed my behavior based on discussions with Jeff (http://somod.subtlehustle.com) and people gloss right over it.\n\nI don't condone Samuel's actions right now, but he doesn't have the same /pattern/ of abuse as Upvote.\n\nSamuel needs to back down, but since no one appears to be willing to do anything with Upvote, and Upvote continues to be a troll and get away with it, I understand his frustration.\n\nAnyway, oh well, if people want to live in my past activities, good for them. Doesn't make a difference to me though."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@toast: If you mean I have been editing to improve posts and clean up the tags, then I guess I am guilty of following Rich B, but then so are dozens of other people.\n\n@Eddie: You also seem to be a little late, after being told to stop, I did. Click Upvote has now twice brought it back up. I was willing to let the baby have his bottle but he won't let it go.\n\nIt's not just this one question that's the problem, Click Upvote has done this numerous times and continues to do it and believes he is doing nothing wrong. Rolling back changes just to roll them back should not be allowed when the change was to fix a typo/error.\n\nAnd the poster does not have the final say, the moderators do."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel:  Your last rollback on http://stackoverflow.com/questions/408929/ was only 7 hours ago, which in my time zone is \"today.\"  If the moderators have told you to stop, I am not privy to that information.  Changing your behavior a few hours ago is different from having done so *weeks* ago.\n\nAnd yes, Click Upvote has been engaged in 3rd party edit wars, which is negative.  But the question that everyone is so focused on in this discussion *belongs* to Click Upvote, so is the wrong example to use to try to cite \"abuse.\"\n\nJeff has stated that the OP is allowed to roll back their own post, even when doing so re-introduces grammatical (or even factual) errors.  That's it.  End of argument unless you can convince the owners of this site that you are right and they are wrong.\n\nAnd yes, of course *technically* the moderators (meaning the current four people who have global rights) have final say.  However, unless you or I or Rich or Click Upvote (etc) plans to become a moderator in the near future, it's an irrelevant point to this whole discussion."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Eddie: Sure you cannot use the latest edits, but if you look further into the past you will see how abusive he was towards Rich over tagging. And you yourself say that tags are community owned, yet you turn a blind eye to Click Upvote's abuse of them?"}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Eddie: And if you look now, you are missing a large chunk of that edit war that Click Upvote continued over the tags.\n\nThe moderators cleaned it up and left the subjective tag in. Can you explain or justify CU's edit after all of that to remove the tag that *the moderators* left in?"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel - Abuse does not condone abuse. Even Rich has said (earlier in this thread) that you should just leave it and report if you feel it is abusive. By continuing, you are no better."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 09, 2009", "message": "@RichB: The problem here is that in this case feeding the troll is just as bad for the site as trolling is.  Someone who's trolling is trying to provoke a response.  There may be some circumstances where what they're doing is so bad that it justifies a response, despite the fact that doing so gives the troll what they want (if the troll is blanking posts or inserting spam, for instance).  This is one one of those circumstances.  The capitalization of two words is utterly inconsequential.  Anyone getting into a revert war over this sort of thing is part of the problem, not part of the solution."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 09, 2009", "message": "Sorry that is ambiguous. *By continuing, you are no better than Click Upvote.* After looking, I see that it could be taken as \"no better than Rich\".\n\nAnd since I'm correcting and clarifying:\n\nI meant in that taking up where Rich left off in that question alone in terms of rolling edits."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@toast: I have stopped editing that question, but the fact remains that Click Upvote has been hugely abusive and will continue to do so and the moderators have yet to step in a stop him.\n\nBut they plenty of time to ban their scapegoat."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 09, 2009", "message": "Argh.  That should be 'isn't' in the third sentence from the end, not 'is' (stupid fingers)."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Chris: Not sure why you are arguing with me. I agree with that. \n\nAgain, I would suggest we report Upvote and move on.\nAnd the only reason I even care to mention it or respond to it here is because I want to see our moderators do something about it.\n\nIf they reprimanded Samuel for it, where is Upvote's reprimand x all the posts he did this on?\n\nAs much as Samuel should have stopped rolling back and just reported it, so should have Upvote if he truly had good intentions.\n\nBoth parties are guilty here. Samuel got his reprimand and stopped. Where is the other side of it?"}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "FYI Jeff emailed me following the comments on the last blog posts and said this:\n\n\"Also, please do not undo edits just for the sake of undoing them.\n\nAt that point you are no better than Rich B! Surely this is not the message you want to send?\"\n\nAnd I've agreed to that. Bringing up things happened before that is pointless."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "@Rich B, you're missing the point again. Its my post and I can edit it however I want to. Had this been any other post I would've stopped after the first edit"}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: How is it pointless? If I got one email for one question, I suppose you have gotten dozens. Which would bring you close to 30+ complaints which means you should be banned."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Upvote: Someone here is missing the point, but it is not me."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel, because I haven't broken any rules. You knowingly broke a rule by forcing your edit over the author of a post."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "I'm really not trying to start another fight in here...but is there a logical reason why you are so gung-ho about keeping your post in a state that is technically incorrect (even if minor)? I'm not saying you should always just let everyone run roughshod over your posts if you feel the edit does not improve...but it really does appear as if you are/were just engaging in this to be spiteful (even though the same could be said of samuel after it gets past a certain point).\n\nI just don't understand why people get so emotionally attached to a wiki system and get offended and defensive when someone cleans it up. That's just me though."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: But you have, you rolled back a valid change. The community (according to Eddie) has determined that tags are owned by the community and the author has *zero* authority over them."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Upvote: You both broke the rules. At least Samuel can admit it."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 09, 2009", "message": "@Rich - I'm in total agreement with you that they both should be reprimanded, not just Samuel.\n\n@Samuel - Don't base results on what you \"suppose\". I suggested (somewhat in jest) that you and CU would deserve a boxing. That is in light of the recent agreements. I believe engaging in such behavior after all has been said and done is far worse than the original infractions that brought the argument to a head. It shows that you honestly only care about extending the fight for as long as you can."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 09, 2009", "message": "@RichB: Not every comment I make is intended as disagreement with you.  Just most of them :)\n\nI'm not really opposed to minor edits, I just don't think they're worth anyone getting riled up about.  I'm wondering if we maybe need one standard for making edits and another, higher, standard for reverting changes.  If I'm making reasonable edits, even if it's just correcting capitalization, the assumption is that nobody will mind (and the hope is that somebody will be at least a little grateful).  If someone reverts those edits, then someone obviously does mind.  Even if I'm positive that I'm right and they're wrong, there's no sense in getting into any sort of disagreement about it unless the change made a big improvement to the question.  I was thinking along lines when I proposed limiting reverts.  It essentially forces you to wait for some other, uninvolved party to decide if the change was significant enough to make it worth getting involved."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@toast: The only problem with giving us equal punishment means that any severity and frequency of occurrences deserves the same punishment. This is my first major edit war and yet Click Upvote has had dozens."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel - So. You did it with full knowledge that such behavior is seriously frowned upon and when there was an emerging protocol to handle the situation.\n\nIn this case, the amount is immaterial. It's like excusing a rapist, because it's his first time raping and some other guy got away with it way more times than you. You knew it was wrong, you had a better way to deal with it, yet you ignored it. You were both equally bad."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "I'm putting this in here once again and I still believe it would eliminate a lot of acrimony over edits: http://stackoverflow.uservoice.com/pages/general/suggestions/159197-make-editting-anonymous"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Chris: The solution in my opinion is to enforce the site as stated in the FAQ:\n\n\"Like Wikipedia, this site is collaboratively edited. If you are not comfortable with the idea of your questions and answers being edited by other trusted users, this may not be the site for you.\"\n\nAnd then let the moderators step in when abuse is reported. But making a 'useless' edit is not abuse no matter what anyone wants to say. Making a rollback to a useless edit is.\n\nThere don't need to be these hard and fast rules on editing. When you have an issue, kindly ask the person to modify their behavior to avoid conflict. I was asked to modify mine, and I did. The only reason it is still an issue is because we are not squashing the actual trolling when it is reported.\n\nI just want to see us stop this wishy-washy stuff. It only bolsters the confidence of trolls like Upvote."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "@toast: I agree that they are both equally bad in one instance, but you (at least it seems that way) and others are ignoring the fact that Click isn't a first time offender here. I don't think Sam is looking for mercy, he is looking for CU to get punishment in accordance with his prior record.\n\nOr I'm just stupid, who knows."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@toast: Except that the courts *do* take past offenses into account when determining the sentence. Are you living on another planet or something?"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 09, 2009", "message": "@TheTXI - I'm willing to put aside history period. Rich B's, Click Upvote's, yours, mine, everybody's.\n\nI see this post as a sort of laying down of the law, a final word on the subject (Jeff's main post, not this comment). Everything that happened, happened. We all got a bit extreme at times, and none of us has behaved 100% admirably.\n\nThere have been measures put into place and protocols developed to handle users who step out of bounds. And ways to make that known. When Samuel and Click Upvote started back and forthing, both of them knew this. I'm not saying they should both be put out for an extreme period, but each should get a slap for being douchey.\n\nIf Click Upvote is a habitual douche, then I'm positive that he will keep winding up in the box until he is permanently removed from the site. Same with Samuel.\n\nIf, however, one or both of them aren't habitual, then they will get their reprimand and that will be that.\n\nOnce again, I'm not saying any such punishment should be extreme, but they do deserve equal treatment, because by now everyone should know better."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 09, 2009", "message": "@Rich: From my perspective, this isn't about figuring out who is guilty of 'abuse', it's about trying to make SO work better.  It takes two to troll successfully.  Taking the bait is part of the problem."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel - And for some crimes, past offenses do not factor in at all. It all depends."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@toast: All crimes do. Just chances are you won't get out before you've done your time for murder.\n\nAnd comparing this rape is just wrong, this is like assault or arson."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "&gt; But is there a logical reason why you are so gung-ho about keeping your post in a state that is technically incorrect (even if minor)?\n\nThere's no logical reason, its just about personal preference of Pros &amp; Cons. Because this is my question I can have it this way.\n\nThe tags were also changed on my own post. I don't need to keep repeating myself so see the explanations given earlier for why I wanted the general-programming tag over the subjective tag. However when Gortok improved the post in other ways I thanked him and didn't try to roll it back."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: Then why didn't you add the general-programming tag?"}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "&gt; If Click Upvote is a habitual douche, then I’m positive that he will keep winding up in the box until he is permanently removed from the site. Same with Sam\n\nHow about that's determined when I /do/ this in the future rather than speculating? When I do any rollbacks (on not one of my own posts where ultimately its my decision to how its presented) feel free to report me and get me banned. I don't intend to do this, I've made it clear several times.\n\n&gt; I see this post as a sort of laying down of the law, a final word on the subject (Jeff’s main post, not this comment). Everything that happened, happened. We all got a bit extreme at times, and none of us has behaved 100% admirably.\n\n+1"}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: \"Like Wikipedia, this site is collaboratively edited. If you are not comfortable with the idea of your questions and answers being edited by other trusted users, this may not be the site for you.\" from the FAQ. So I suggest you leave SO if you are so concerned about having absolute control over your questions.\n\n*opens door for Click Upvote*"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "And now we once again open the door to the fabulous world of StackOverflow contradictions:\n\nOn one hand we have the famous reference to Wikipedia and how this site may not be the best for people who have issues with other people touching their stuff...\n\nOn the other hand we have had recent rulings come down from the powers that be which have pretty much caved in on the side of the original author, giving the author carte blanche to throw tantrums if their stuff is edited because \"it's my post and I can make it how I want.\"\n\nAnd here we stand, mired in the quicksand."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "@Sam, I'm comfortable with my posts being edited, hence Gortok's edit is still there as are many other edits. But ultimately if I want Pros &amp; Cons to be capitalized on my post, you're no one to force your opinion on me that they shouldn't be.\n\nRefer to this comment each time I now say the words 'Read last' to you, because you keep asking the same thing over and over again."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "@Click Upvote: If you are comfortable with yours posts edit, you should not have such fierce resistance to small subtle improvements.\n\nWould you oppose me editing it to read \"*pros* &amp; *cons*\"? Strong text is much better at emphasizing than capitals."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "your posts being edited*"}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "Lol. Go ahead and change it to *Pros &amp; Cons* if you want to, I don't have any issues if you leave the initials capitalized."}, {"author_name": "Samuel", "gravatar_hash": "53150995c134902b9790479b76f1845c", "author_url": null, "date": "Apr 09, 2009", "message": "That's not what I proposed, I proposed \"*pros* &amp; *cons*\"."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "Then no."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "Apr 09, 2009", "message": "Sorry."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "I just had the sudden wave of sadness wash over me like when Old Yeller had to get put down."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 09, 2009", "message": "@Samuel: I am not defending anybody's actions, nor I am turning a blind eye toward anybody's actions. And regarding tags note that my exact words are, \"Tags are (IMHO) owned by the community,\" which does not imply that the OP has *zero* authority over them.  Geez.\n\nClick Upvote says that he has stopped reverting 3rd party edits on posts not his own.  Let's take him at his word on that, put the past behind us, and move on.\n\nAnd regarding capitalization on Click Upvote's post, please just get over it.  Yes, the \"accepted usage\" is lower case for \"pros &amp; cons.\"  You are absolutely, 100% correct.  And Click Upvote has expressed that he prefers a non-standard usage.  That's his prerogative. From my read of what Jeff has said, if an edit causes friction, then the editor should back off.  Period.  If the editor made the friction-causing edit because the message was abusive or offensive, then back off and notify the admins and mark the post offensive.\n\nIt's just that simple.  If an edit causes friction, then the editor should back off, even when the editor is in the right.\n\nWhat is my stance regarding tags and tag wars?\n\nIMHO, tags are owned by the community.  However, sometimes, an individual for whatever reason will want their post to have inappropriate tags.  After a couple attempts by *different people* to place appropriate tags on the question, let's just drop it.  This means that that user's post will be more difficult to find.  It's a small loss to the community but not the end of the world.  If it's a big problem, then notify the admins or get the admins' blessing to continue fighting the good fight.  Otherwise, just back off."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "Well, at least the good thing to come out of all this is highlighting the true problems on this site: people like Click Upvote who let emotion come before reason and community.\n\nHow many times have people said I am not willing to modify my behavior? How many people said I would not compromise?\n\nWell I did. Drastically.\n\nUpvote will not change. He is making this clear. He is going to dig his feet in, put his fingers in his ears and scream. \n\nIt will require all of us working together to correct this issue.\n\nPeople want to talk about letting history go, but in every blog entry so far I am assaulted with the past. I was not banned for my edits. I have followed the rules set forth since they were set forth. I haven't commented on SO since then either to be sure that there was nothing to complain about. People are still complaining. They cannot back up why they are, but that does not stop them. I provided all the emails (http://somod.subtlehustle.com) to show that I did everything required of me. I would be happy to discuss anything there on IRC if anyone wants to have a reasonable conversation about it. Not here. Not on SO. That hurts the community. Let it out on IRC and get it over with. Be adults about it. You certainly wont hurt my feelings.\n\nCalling me the problem is laughable at this point. If the people who are still active on these topics truly care about SO like they claim then I propose we all bond together now and not let trolls run this site anymore. \n\nStand by editors that make good edits. \n\nIf anyone would like to argue those edits, let them take it to the moderators, for a decision. We will just have to hope they learn to grow a spine and tell people they stand behind edits like the FAQ says. But if you see someone rolling back without a good, community spirited reason (like \"Oh, I think I made a better edit, do you agree?\" or \"I think you made a mistake, the author was correct because this is python not PHP\"), but instead just to make a stance on some ridiculous concept like 'humor' or 'smilies' or greetings or anything that doesn't add content to the site, report it. Report it each and every time.\n\nNow is the time for us all to reach an agreement so we can move forward and stop this nonsense. When other people see us all working together the community will prosper and grow.\n\nSo let's take these rules and move on. Make good edits like Jeff says, but don't make petty rollbacks. I don't care if you do feel 'wronged' by someone removing a smilie. Take it up with the mods. If you make petty, angry rollbacks you will be reported, no matter what side you stand on.\n\nWho is in?"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 09, 2009", "message": "Rich B:\nThat's probably the most thoughtful, mature thing i've ever read from you*. Agreed on all points, well done.\n\n\n\n\n*yeah, i'm subtly implying you've been rude and immature in the past. Get over it... ;-P"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 09, 2009", "message": "@Shog9: Subtly?"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Shog9: NO U!\n\n;)\n\nAlso, to be clear, are you in?"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 09, 2009", "message": "Rich: yeah, i'm in. I hate the thought of generating email traffic over crap like this, and hope we get a proper UI / queue system at some point... But if this is what's necessary now to keep peace and make the site work, then so be it."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Shog9: Well I agree, but clearly the team is leaving us one option, and that is email.\n\nI would hope that there might be a flare up of complaints, but if they stay firm and make it clear to people reporting valid edits or rolling back, the emails will drastically reduce in a short period of time.\n\nThere will be an adjustment period for sure, but consistency is going to be key here.\n\nThank you for your support."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Shog9: BTW, if you haven't done so already, check out: http://stackoverflow.uservoice.com/pages/general/suggestions/159197-make-editting-anonymous\n\nI think that is the best way for a 'UI/queue' system to fix this.\n\nIn the meantime hopefully we can get a large scale gentlemen's agreement going here."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 09, 2009", "message": "@RichB: Very well put.  There's no question. I'm in."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Eddie: Thank you for your support."}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Apr 09, 2009", "message": "@Rich B,\n\nI can say this for you, you are willing to air your own dirty laundry.  http://somod.subtlehustle.com was an interesting read.\n\nI'm not a believer is forgive and forget if you haven't earned it.  I can't be an asshole for x period of time and then tell everyone to stop dwelling on it.     Make good edits, and be a contributor not a detractor and things will settle down.  \n\nI don't know how old you are or what issues you have but just go back to being an asset to SO."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "Thank you Rich for reposting the link to that UserVoice suggestion. I truly feel that the more attention it gets, the better discussion it can have and the higher likelihood it will get ruled upon by the higher authorities. \n\nOn that note, I am also going to post a link to another UV suggestion (which actually stemmed from the discussion in the first). http://stackoverflow.uservoice.com/pages/general/suggestions/159703-allow-for-reporting-of-content-and-users-to-mods-and-or-team\n\nI believe that this suggestion will allow a more streamlined method for users to report content and users which is violating the FAQ, terms of service, or the \"Don't Be A Jerk\" rule. I think this is much better than stuffing team@stackoverflow.com's inbox full of reports as well."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 09, 2009", "message": "Kudos, Rich B. Well said.\n\nhttp://blog.stackoverflow.com/2009/04/in-defense-of-editing/#comment-19296\n\nAlso, Click Upvote, consider this: at what point are your behaviors just as negative as what you're complaining about? Don't make things worse. Make them better!"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Simucal: So can we count you in or not?"}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@TheTXI: In or out?"}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Apr 09, 2009", "message": "@Rich B,\n\nI was never out.  I appreciate the edits you make.  I just want them to be made in a slightly less obtrusive way.\n\nYou weren't the only one either, there are definitely other offenders and I want them to stop or be stopped as well.\n\nWe are at the point where it can be nipped in the bud without it becoming a huge deal."}, {"author_name": "Russ", "gravatar_hash": "c6ecd6c96fcfb41c754fc0bf6812e6d0", "author_url": null, "date": "Apr 09, 2009", "message": "As someone who has gotten a little upset about edits made in the past, I think that the following is important to keep in mind.\n\nWhen an individual asks a question, it is their name and profile that is shown as the owner of the request.  The same is true for the answers.  While I've gotten used to the WIKI nature of Stackoverflow, there is certainly a perception about the types of edits that are being made.\n\nFixing typos is and adding information to the question that will help it get answered are one thing, but consitently going into questions asked and rewording them along with other non-value added changes will upset people.  Afterall, their name is what is shown in the corner.\n\nAt the end of the day, StackOverflow is by far the best place to come for technical issues and I'm on here almost everyday.  The very nature of the site and ownership of questions and answers is what fuels the edit and rollback wars.  \n\nIf we can't be adults, then all of this is for not.  While I know there are some who think that they have done no wrong, we all must remember it takes 2 to tango.  These edit and rollback wars have multiple parties. \n\nMy reccommendation is pretty simple, if an edit is rolled back, just leave it alone.  You tried to help, but clearly it wasn't desired.  The person who asked the question will have to live with the answers they receive along with the up/down votes.\n\nIf you have a question or answer that gets edited, just try to ask yourself if the change made improves the overall utility of the thread or not.\n\nAgain, this entire thread and all of the efforts by Jeff and team will be completely wasted if we can't be adults.  The notion of not being a \"jerk\" is important.  If multiple people around you are suggesting you are acting like a \"jerk\", maybe you should evaluate what they are seeing from their side, not your own."}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": null, "date": "Apr 10, 2009", "message": "I came across the perfect exception to the rule today on SO.  I made a one word edit substituting \"which\" for \"witch\" that substantially improved the post!  :-)\n\nduction Brickett"}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Apr 10, 2009", "message": "I agree with Jeff's guideline of not fixing minor typos just for the sake of it.\n\nTrue, it doesn't harm the readability of the post (quite the contrary), and it doesn't change the meaning of the question, but it may still come across as invasive to the poster. It's simply not worth risking a conflict over.\n\nEvery time you make an edit, keep in mind that the person whose post you're editing may disagree. He may find it rude that you fix his typos, or he may disagree with your interpretation/clarification of the question.\n\nIf I post a question, I have a kind of ownership over it. It's my name that is shown next to it, and whatever the question says, is associated with me.\nThat is unlike Wikipedia, where there is no clear ownership of individual pages. Anyone can edit, because no one \"owns\" the page.\n\nOn SO, it's a bit different. Feel free to edit, but respect the owner. And respect that he may feel differently about small nitpicky edits than you do.\n\nSo don't edit unless you think it is worth risking that conflict. \n\nAnd that means that no, I have to disagree with Rich B. I agree with a lot of the stuff about \"making good edits\", of course, but ultimately, I feel that if person X asks a question on SO, then person X has the final say on what's in that question. Even if that means the question becomes unreadable and downvoted. Even if it means that helpful and well-intentioned edits get rolled back. Tough luck, but that was apparently what the person asking it wanted.\n\nEdits should not be anonymous. Stand by your edits, and accept that you are editing someone else's text, and you can't hide behind their name, because your name will be put on the question too.\n\nFinally, I fundamentally disagree with your apparent view of SO as a \"moderator\"-driven site.\nBack when Jeff asked for nominees for moderator, that was a big issue, because in your mind (and others. I'm not trying to make this into a \"the world vs Rich B\" post), moderators are important. In the previous post, it was a big issue that SO \"isn't a democracy\". It seems like you have the idea that there is, or should/must be some ruling clique who *controls* SO. Whether that is Jeff, a group of moderators, a \"democracy\" within the community or \"a gentleman agreement\" among the readers of this blog, it is implicit that any disagreement goes to this ruling clique. If I disagree with how you edited my post, I shouldn't just revert it, I should \"take it up with the moderators\". And if someone higher up in the hierarchy edits my post, they get priority so I shouldn't rollback.\n\nI think that's missing the point of the site. I don't need to take it up with the moderators, because I have the power to edit my own post. SO isn't a community, and the need for rulers or moderators is minimal. Posting on SO doesn't place me anywhere in a community or hierarchy, not as moderator, and not as newbie, and not anywhere in between. The ultimate authority in disputes about question X is the author of question X. That is who you have to appeal to if you disagree with an edit or rollback of same.\nPart of what makes SO so useful is that there are no ranks, no one you have to ask permission, and no one to overrule you (except of course in extreme cases of clearly offensive questions or spam)\n\nIf I ask a question, then within that question no one outranks me. I can accept edits, but I can sure as hell also revert them. So like Russ said above, if an edit is rolled back, leave it. The questioner didn't want your help, so leave it alone. They're the ones who'll get downvoted if the question sucks anyway.\n\nAt least, that's how I see SO. I may be wrong, but hey... :p"}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Apr 10, 2009", "message": "I thinking fixing minor typos is a huge feature to SO and I plan to continue correcting peoples posts of their minor spelling mistakes when I see them.\n\nPeople subconsciously look negatively at posts with typos or mistakes in them.  It can even generate downvotes from an otherwise good question.  I see this especially from non-English speaking members.  I fix every single one I see.  Like the FAQ says, \"If you don't like your stuff edited then this isn't the site for you.\"\n\nI can't imagine someone getting offended by me making them look more articulate.  That just doesn't follow.  Every time people correct my spelling/grammar I think, \"Damn, I missed that!\" but I never think, \"These people have invaded my personal post! That is offensive!\"\n\nI'm thankful when people fix my writing and overall it improves Stackoverflow in a much bigger way than most people can imagine.  One of the things I ~hate~ about browsing random tech forums is reading peoples intelligible posts.  On Stackoverflow the grammatical correctness is much, MUCH higher than the average forum simply because everyone can spot each others mistakes and fix them with little resistance."}, {"author_name": "toast", "gravatar_hash": "3e8ac91e068a80d3ae0921595e63f0bb", "author_url": null, "date": "Apr 11, 2009", "message": "@Simucal - And I agree. I just didn't see any point to the editing of posts where there were no typos at all."}, {"author_name": "bear-in-the-woods", "gravatar_hash": "8b7fd6928cca81f4c7fe6615373e5d4c", "author_url": null, "date": "Apr 12, 2009", "message": "*sigh*\n\nI've read this blog from conception, and Coding Horror for years. I have been to date, purely a reader of SO and have been highly impressed with what Jeff, his team and the community have achieved. SO has become a vibrant community, and already contains a wealth of knowledge, which is rapidly evolving into a centralised repository. SO is also something to which I will contribute to, from my own specialised fields of work and study ... in due course. However, discussions such as this make me shake my head and question why?\n\nAgree to disagree, but at least properly justify and clarify your respective positions. Propose solutions, and not fuel arguments about minutia.\n\nIf you care to listen to a person with no SO ranking or badges and no interest to gain any, this is my opinion:\n\nDecide on the factors required for editing:\n\n1). Accountability (anonymous is evil)\n2). Responsibility (degree of earned trust)\n3). Justification (require a reason)\n4). Intelligibility (improve the question)\n5). Presentability (grammar Nazis, etc.)\n6). Comprehension (clearer direction to solution)\n7). Moderation (ownership of the question)\n\nThe question asked has a name attached, and that name alone possess the right to be viewed and read in the language and style of their choosing - errors, flaws and all. They are the ones who asked it. Without them, it would not exist. The question should be treated as if it has an automatic copyright applied. (Cue the copyright activists ... who haven't a clue what I'm actually implying)\n\nModeration rights therefore belong to the original question owner - not to anyone with editing rights. Because of this perceived right of the morally justified few, some questions have been greatly modified, and then ask entirely different questions, thereby diverging from the original authors intention.\n\nRequire a justification on all edits, as this provides a built-in and already available forum for discussion, tracking and abuse moderation.\n\nRules can be put into place regarding any perceived issues (delayed edit visibility, time limits before auto-approval, \"grand-high exalted poo-bah editor badges\", etc.) \n\nFinal say is the right of the original question owner.\n\nSince all edits are tracked, the edited portions of questions could quite readily be (subtly) highlighted on the site (black vs. grey for example). This then (optionally) indicates how a question has been modified, and/or diverged from its original form.\n\nTo this end, having the original question available and moderated by the asker, is the only way to understand the original intent in the case of any edit wars.\n\n---\n\nWhat is a SO ranking truly worth? I've got a perfect 0.\n\nFix it, don't break it.\n\nEdit wars are just self-deluded egotistical morally bankrupt pissing contests.\n\nMine is bigger than yours in any case.\n\n(Cue the trolls ...)"}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 12, 2009", "message": "@tvanfosson: The funny thing about your post is the very day you posted that, I edited a post with the same error. \n\n@bear-in-the-woods and @jalf: I believe that editing for grammar and readability does a large service.  If even once I had an OP object to my edits (which so far has not happened to my knowledge) I would try to remember to not edit that individual's posts any longer.\n\nHowever:  Read again the paragraph almost at the top of this page that begins, \"Like Wikipedia, this site is collaboratively edited.\"  This is part of the nature of the site, by design.\n\n@Simucal: Your recent post captures well what I also believe about editing."}, {"author_name": "bear-in-the-woods", "gravatar_hash": "8b7fd6928cca81f4c7fe6615373e5d4c", "author_url": null, "date": "Apr 12, 2009", "message": "@Eddie: True. Some people will neither permit their grammar to be corrected, nor their question readability to be improved. These should however be the _exceptions_ amongst the intelligent population which predominantly comprises SO. We're now discussing these exceptions.\n\nI would wholeheartedly encourage improvement, and I personally would go so far as to encourage the trivial \"it's and its\" fixes - to be divided up amongst the grammar Nazis. But show yourself, provide the reason/justification for it, and any intelligent person should realise and understand the nature of the correction as an improvement, not as an admission of any error.\n\nThe key problem is that egos get in the way of any acquisition of intelligence or knowledge. Pick anything from religion to politics to illustrate the point ...\n\nHowever, my key statement of opinion is that it is their question and we must respect their intentions (and errors) with respect to it - regardless of how we (or the greater community) may feel about it.\n\nSome degree of \"Darwinism\" must then apply - a question (and asker) poorly presented will \"die\" - a question well presented will \"rise above the rest\".\n\nStarve the bad things ... feed the good things."}, {"author_name": "Ant P.", "gravatar_hash": "9cdc90442db35b14a5007b737a516039", "author_url": null, "date": "Apr 14, 2009", "message": "I've found a less irritating solution to the RichB soap opera - I just stopped going to Stack Overflow completely."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Apr 14, 2009", "message": "@Ant P: hey I've heard something else that might interest you.\n\nApparently if you stay in bed all day, don't answer your phone/email/chat, get all your food delivered and generally just avoid interacting with people they'll never disappoint or annoy you."}, {"author_name": "John Fouhy", "gravatar_hash": "cdca0dc45085388c1b753104ce4c8648", "author_url": null, "date": "Apr 16, 2009", "message": "I don't know if anyone will read this far, but ...\n\nMy question: Should I fix bugs in people's answers?\n\nI'm talking obvious bugs here: someone types '=' instead of '==', or forgets a semicolon, or uses '.append' instead of '.add'.  I see them, now and again.  Usually just post a comment saying \"I think you mean ----\".  But I've got 2k rep now.  Should I just fix them?"}, {"author_name": "robert harvey", "gravatar_hash": "5b92f01bfaa002fd5327a8e85a3cceef", "author_url": null, "date": "Aug 13, 2009", "message": "Let me just be the first to say that a big banner at the top of someone's question:\n\nDuplicate of stackoverflow.com/questions/blahblah\n\nis NOT a substantive edit."}]}