{"response": [{"author_name": "batman", "gravatar_hash": "ebc2eca8e45b079bde36376a017a87ac", "author_url": null, "date": "Apr 26, 2009", "message": "i vote to close this as not-programming-related"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 26, 2009", "message": "What question or questions precipitated this post? I haven't noticed any \"joke\" questions that garnered any serious attention on Stack Overflow (though I have been known not to get jokes). Can you point to an example?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 26, 2009", "message": "Examples..\n\nHow can I deal with a C++ coworker who refuses to acknowledge my recent gender reassignment surgery?\nhttp://stackoverflow.com/questions/788294\n\nalso, \"programming at sea\", and a couple others. I don't want to encourage this behavior so I am not linking to anything in the post.\n\n(<b>you will need 10k rep to see the above link</b>, but the title is enough to get the gist of it)"}, {"author_name": "bartman", "gravatar_hash": "fbcc1ffde4bf1d06b8f1de8fc1e2ebe2", "author_url": null, "date": "Apr 26, 2009", "message": "Can someone barrow me 10k rep? i need to see that question!!!!"}, {"author_name": "Steve Lacy", "gravatar_hash": "8a9d0c522461ae0dd46e9f99fbb45724", "author_url": "http://slacy.com/blog", "date": "Apr 26, 2009", "message": "I think your rules are arbitrary -- the community should vote good and bad questions up and down, respectively.  Bad questions will be voted down, and good ones up.\n\nPersonally, I think the worst part of stackoverflow.com are all the questions on the \"Hottest Questions This Month\" tab.  All of that stuff is utter and total junk, and I think really does a disservice to the idea of a *programming* question and answer site.  Issues like \"worst working conditions ever\" aren't programming related at all, and don't really help anyone.  They belong on http://stackoverflow.com/phpbb, but that doesn't exist. \n\nAnyway, I think the distinction between a joke question (i.e. http://stackoverflow.com/questions/770076) and a crappy stupid non-programming related one (i.e. http://stackoverflow.com/questions/700205) is arbitrary.\n\nThe site needs to either have a strict \"programming questions only\" attitude, or \"anything goes\".  The middle ground of \"X is okay but Y isn't\" is a very bad thing."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 26, 2009", "message": "&gt; How can I deal with a C++ coworker who refuses to acknowledge my recent gender reassignment surgery?\n&gt;http://stackoverflow.com/questions/788294\n\nHow have you not banned this guy yet? As for \"programming at sea\", I thought you said on the podcast that it was a real question? Also, as a user with +10k rep, why can't I see the question?"}, {"author_name": "bartman", "gravatar_hash": "fbcc1ffde4bf1d06b8f1de8fc1e2ebe2", "author_url": null, "date": "Apr 26, 2009", "message": "its nice to see that we have to kind of people here:people with 10k rep and others. that reminds me of slavery."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 26, 2009", "message": "> Issues like “worst working conditions ever” aren’t programming related at all\n\nSee the 'tuscan milk' link, above. Does that belong on Amazon? Why is it allowed? We've said all along that a certain small number of fun, <i>programming related</i> questions are OK if the community likes them.\n\n> I think the worst part of stackoverflow.com are all the questions on the “Hottest Questions This Month” tab\n\nAll that stuff that people voted up, you mean? I thought voting was the answer to everything! :)\n\n> As for “programming at sea”, I thought you said on the podcast that it was a real question?\n\nAfter looking at the data, it definitely wasn't. Some people get very upset when I share that data, so you'll have to take my word for it, unfortunately."}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Apr 26, 2009", "message": "Aye, the \"Programming at Sea Question\" got deleted by Jeff.\n\nHe was nice enough to email me the long answer I wrote though.  So, all is not lost."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 26, 2009", "message": "\"&gt; As for “programming at sea”, I thought you said on the podcast that it was a real question?\n\nAfter looking at the data, it definitely wasn’t. Some people get very upset when I share that data, so you’ll have to take my word for it, unfortunately.\"\n\nOK, now I'm really curious."}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Apr 26, 2009", "message": "&gt;&gt; After looking at the data, it definitely wasn’t.\n&gt;OK, now I’m really curious\n\nYeah, what do you mean by \"Data\" Jeff?"}, {"author_name": "almond", "gravatar_hash": "939f29a42d144267f88db408af9cca73", "author_url": null, "date": "Apr 26, 2009", "message": "I think part of the problem is that stackoverflow has brought together a great community around programming but it has no where to for it to gather and shoot the breeze or be off topic. \n\nI think there should be a area, that is separate from the main Q/A section where users can shoot the breeze.\n\nThis type of off topic questions have came up again and again, I don't think making more rules is going to stop it. \n\nJeff, you speak about how you can ever know how community is going to use social software, the offtopic stuff on here is an example of it. \n\nMaking a offtopic area would solve all this overnight."}, {"author_name": "Bob", "gravatar_hash": "820d0e4ee14e986a44d33782ca852f51", "author_url": "http://dontaskforemail.com", "date": "Apr 26, 2009", "message": "You're talking about trolling. I think your post would be better understood if you replaced \"joke\" in your post with \"troll\"."}, {"author_name": "Out Into Space", "gravatar_hash": "4a4321cffc7fb51be0ca54f341e01e31", "author_url": null, "date": "Apr 26, 2009", "message": "@almond, SO is a Q&amp;A site. If you want a forum to \"shoot the breeze\" with people you met on SO, then make one."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 26, 2009", "message": "Hmm...\n\nHalf the questions i've posted have been intentionally less-than-upfront about their true purpose. Two were removed after a time as not-programming-related; the last collected some good answers, and while it may never help me i see no reason why it might not eventually be of use to someone else. \n\nFrankly, I don't see the need to draw a distinction here. If the system works, it'll work for joke or troll questions the same as for any other type of question. If the system doesn't work, FIX IT!\n\nThe programming at sea question was right on the border of programming-related, but IMHO it wasn't really appropriate even if completely true. Shawn's question, while hilarious to those of us who'd been out drinking prior to its arrival, was utterly off-topic. Again, according to the site guidelines, it *should* have been speedily removed even if completely legit.\n\nBecause the truth is, there are an awful lot of \"joke\" questions whose authors are completely serious: Programming questions asking for help in doing something that should never be done, or non-programming questions asked because the author recognizes that it will probably be answered regardless... or because they just like to share whatever they're going through. \n\nI've seen the equivalent of BOTH of the examples you gave, posted on other programming sites, by people who were being completely honest. The difference with SO is, we shouldn't need to care whether the question we're answering is legit or not - either it's a well-written, on-topic question or it isn't. \n\nIf you see a problem, fix the algorithm, eh? ;-)"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 26, 2009", "message": "@almond: if you really just want to \"shoot the breeze\", then load up http://mibbit.com/ , sign on to irc://freenode/#stackoverflow , and start shooting wildly. \n\nIf you really want to have lengthy discussions on non-programming topics, find another site - there are plenty of good ones."}, {"author_name": "bear-in-the-woods", "gravatar_hash": "8b7fd6928cca81f4c7fe6615373e5d4c", "author_url": null, "date": "Apr 26, 2009", "message": "I'd agree with Steve Lacey on this:\n\n\"I think your rules are arbitrary — the community should vote good and bad questions up and down, respectively. Bad questions will be voted down, and good ones up.\"\n\nStrengthening the functional degree of natural selection (darwinism) of good vs. bad questions will permit the community to provide greater question moderation by itself - without interventions.\n\nJust as there are leaders (alpha males) in any group, give high-rep users a more powerful vote than others. In a simple form, the value of the vote cast is the voter's reputation score. Just add up the rep as the score - not just a vote count - then threshold for viewing (a life/death level).\n\nBorrowing again for George Orwell ... some votes are more equal than others.\n\nOnce a score exceeds a (user configurable) threshold, the question is dead to those users. Extinct. If you want to see it, it may still be available - but definitely don't let Google index it.\n\nSince rep is earned, not given - when questions are killed by group consensus (moderated, removed, or through mob mentality or any other social effect), the users rep will automatically go down. In this way the user and questions are automatically punished, and the system can self-regulate. Predator and Prey.\n\nNatural processes are much easier to control and self-regulate than any enforced rules. Build a suitable natural model, and life and death can occur naturally.\n\nThere's a reason mother nature works so well. It self-regulates, and the process has been refined over many, many years. It's a good model to follow."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 26, 2009", "message": "> Just as there are leaders (alpha males) in any group, give high-rep users a more powerful vote than others.\n\nAlready exists.\n\nThis is known as \"close votes\" and \"open votes\", available at 3k rep.\n\nAlso \"delete votes\" and \"undelete votes\" at 10k rep.\n\n> Once a score exceeds a (user configurable) threshold, the question is dead to those users. \n\nAlready exists; see http://blog.stackoverflow.com/2009/04/the-stack-overflow-question-lifecycle/\n\n> when questions are killed by group consensus (moderated, removed, or through mob mentality or any other social effect), the users rep will automatically go down\n\nThis only happens for questions flagged as offensive/spam."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 26, 2009", "message": "> You’re talking about trolling. I think your post would be better understood if you replaced “joke” in your post with “troll”.\n\nNot quite the same thing as trolling. Trolling is \"(insert name of your favorite technology here) sucks!\"\n\nJoke posts are more along the lines of \"you've been punk'd\"."}, {"author_name": "Purslane", "gravatar_hash": "2acda5365ade04b5964de0502116a037", "author_url": null, "date": "Apr 27, 2009", "message": "I think the Amazon \"Story about Ping\" reviews are actually exactly the kind of things you say you do not want on the site. Sure, it is fun to people \"in the know\", but parents who are simply looking for a book to read to their children do not understand it at all, and Amazon reviews are meant to help them find out if it is a good book for them. Joke reviews do not do that. It also shows that user-voting does not work, since people vote it up because they \"get it\", and I assume this review has been linked to from technical sites, making sure that this review is the most popular, and therefore the top shown, review for this book.\n\nAs for why Amazon lets it stand: I don't think Amazon deliberitely lets things stand, Amazon reviewers are not a community. I think they only delete non-spam reviews when the author of the book complains."}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": "http://blog.tapuchim.com", "date": "Apr 27, 2009", "message": "What is the \"programming at sea\" question?"}, {"author_name": "darius", "gravatar_hash": "9f7f8ade016694e1e33aae3246116b1e", "author_url": null, "date": "Apr 27, 2009", "message": "I think you nailed one of the big differences between Brittish humour and American humor. The Brittish one is often, as you say, deceptive and more difficult (for some) to understand but oh-so-funny when you (or for those who) get it. :D"}, {"author_name": "Fabian Steeg", "gravatar_hash": "528394f867632bcca8497088cd71a6d4", "author_url": null, "date": "Apr 27, 2009", "message": "In my opinion deleting a question with almost 100 up-votes, which was a favourite of many users and contained very useful information is quite unfortunate, even if it only got that popular because it was mentioned on the podcast, and even if it originally was a joke (I'm talking about the \"programming at sea\" question). I believe it was one of those questions that are both useful and fun. And I think the community indicated it thought the same."}, {"author_name": "Sindri", "gravatar_hash": "57768e8922e7a7d6543254a159039bc6", "author_url": "http://sindri.info", "date": "Apr 27, 2009", "message": "I really don't think the \"Programming at sea\" question was a joke, and this is actually a serious consideration of mine. I do intend to eventually move out to a yacht, and weather or not and how I can continue to telecommute a programming job on a boat is an important topic to me. Frankly I'm quite upset that a question got moderated out (admittedly I wouldn't have noticed the question except for it being mentioned in the podcast).\n\nI don't actually agree the question was a troll or a joke. I do actually think this question was unfairly bullied out by people that somehow think it's laughable to ask it (those people are the trolls here)."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 27, 2009", "message": "> I believe it was one of those questions that are both useful and fun. And I think the community indicated it thought the same.\n\nImpossible to tell, because...\n\nhttp://en.wikipedia.org/wiki/Hawthorne_effect"}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Apr 27, 2009", "message": "I also was sad to see it go, especially considering I spent a decent amount of time researching an answer.\n\nIn any case, when I logged on and found it was deleted  (but not totally gone from the site) I saved it.  Soon there after Jeff emailed me the text of my answer as well.  If I wouldn't of been able to get my answer back I would of been really sad.\n\nIf anyone wants to still read the original question you can grab it at:\nwww.mattmcdole.com/boat/\n\nI tried to strip some formatting from the question and I'll continue to do so.  Eventually I plan to turn it into a blog post so it can at least have a home on the net."}, {"author_name": "bear-in-the-woods", "gravatar_hash": "8b7fd6928cca81f4c7fe6615373e5d4c", "author_url": null, "date": "Apr 27, 2009", "message": "&gt;&gt; Just as there are leaders (alpha males) in any group, give high-rep users a more powerful vote than others.\n\n&gt; Already exists.\n\n@Jeff: Ah ... serves me right for not actively participating in SO ... yet. RTFM.\n\nI had noted the close/open/delete/undelete votes and corresponding levels, but I was thinking in a more analogue (not digital) fashion. Many more shades of grey, to have something which is not limited by a chosen entry level, but by the rep/sum/vote strength as an analogue value.\n\nThe other point was more about the community and the group (mob) mentality. I believe it should be the community who decides on the (joke) value of a question and correspondingly rewards or punishes the asker. Through that SO will achieve the life or death of inappropriate questions and of inappropriate users automatically.\n\nTargeting a natural selection process, and providing the framework and tools for the community, will not only be easier to implement, but through the combined direction of the SO fundamental purpose and its users, becomes self-regulating and not require interventions beyond stating the purpose and direction.\n\nHmmm ... maybe I've been out in the woods too long - all this wiki predator and prey thinking. Now where was that river with all the salmon?"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Apr 27, 2009", "message": "Hawthorne effect? Really? Are you doing a study for the APA or some widely read academic journal?"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Apr 27, 2009", "message": "Also, I'm nonplussed about seeing that particular question get deleted regardless of the original intentions given Simucal's great answer. I think you need to take Steve Yegge's advice (hopefully the last time I ever write that) and cool it on some of the micromanagement stuff. It seems like HN's view, which you criticized, is not so strange after all. The idea that you spent time \"with the Data\" on that question seems odd."}, {"author_name": "Sung Meister", "gravatar_hash": "409261beec25d8d5e7f821fcfae72351", "author_url": null, "date": "Apr 27, 2009", "message": "I am guilty as charged for posting a \"joke question\".\n\nI sincerely apologize for my immature behavior that was caused by my heavy chronic drinking on a Saturday night, few weeks back. (Question in question was deleted not long after it was posted.)"}, {"author_name": "Jim", "gravatar_hash": "a7eb6d9e84ea1a901f245f568c4e62c2", "author_url": null, "date": "Apr 27, 2009", "message": "Jeff Atwood: We're all going to sit tight and reminisce about [programming]!\nGuy: Uh well uuh, one time, I'm [programming] at the beach, and a girl starts taking off her bathing suit!\nJeff Atwood: Get back to the [programming]!\n\n\n(I hope you see the Simpson's reference.)"}, {"author_name": "theman", "gravatar_hash": "535397b708dc316389dd4041a2797496", "author_url": null, "date": "Apr 27, 2009", "message": "@sung - lol, boozing up and then hittin SO?"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 27, 2009", "message": "Wow, Jeff.  One week you marginalize non-English speakers and basically call them irrelevant and the next you are on a mission to make all questions politically correct.  \n\nBy the way, I don't think the intent of some questions that you find inappropriate are meant to disparage or deceive - some people's humor runs along different lines than yours.  It may not necessarily mean they are mocking people.  \n\nYour pseudo-concern for the egos of those duped stands in stark contrast to your almost xenophobic and ignorant remarks about non-English speakers. \n\nI was amazed that the follow-on podcast with another guest showed the same lack of basic understanding of what Joel was trying to say.  Both you and the guest had no clue what Joel was talking about.  \n\nI'm also cynical enough to believe that this also really isn't about the users, it is about sanitizing the site so as to remove anything remotely offensive so that customers/buyers/advertisers of SO have nothing to protest about.\n\nIt's your site - you can run it how you want, but such public inconsistencies really stand out."}, {"author_name": "Sung Meister", "gravatar_hash": "409261beec25d8d5e7f821fcfae72351", "author_url": null, "date": "Apr 27, 2009", "message": "@theman: it sort of have become my routine on Saturday nights..."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 27, 2009", "message": "Oh my - I just read the link from simulcal at http://www.mattmcdole.com/boat/ and it is even worse than I thought.  Jeff, you disclose ip addresses and then change your policy when you get called on it.  (rather than admit it was a mistake)  It's not like the guy was trying to get us all to pay him a fee to get our inheritance out of Africa or other clear abuse.\n\nThis (ab)use of the system and actually had a great answer.  (that bubbled up to the top).  Rather than show this as one of two cases \n\n- a strange but possibly useful question with a good answer\n\n or \n\n- an abuse of the site that got turned around and became a positive, you choose to vilify it.  \n\nOh well.  I have certainly dropped off in my use of SO - partly because some of the fun was inconsistently taken out of it.  \n\nJeff, I am not sure if you are getting the message - but I seem to hear/read people saying that you either have to allow more leeway, or have none at all.  This I know it when I see it crap doesn't fly.  \n\nJust something for you to consider."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 27, 2009", "message": "&gt; Oh my - I just read the link from simulcal at http://www.mattmcdole.com/boat/ and it is even worse than I thought. Jeff, you disclose ip addresses and then change your policy when you get called on it. (rather than admit it was a mistake) It’s not like the guy was trying to get us all to pay him a fee to get our inheritance out of Africa or other clear abuse.\n\nI saw that too, and it greatly concerns me. When you can just do whatever you want with private information and retroactively modify the privacy policy, the policy ceases to have any meaning. While it's understood that the policy can be changed at any time and without notice, these changes should not retroactively apply. The correct procedure would have been to NOT disclose the private information, but instead modify the policy so that the information could be disclosed if future incidents occur."}, {"author_name": "Summa Bumma", "gravatar_hash": "c7916db3051f9c07fa9b3dd0eefefb18", "author_url": null, "date": "Apr 27, 2009", "message": "I think this should take a more strict approach, sure, fun should be allowed but as Purslane says it is a high risk it becomes an \"in-joke\" which in no way helps newcomers.\n\nAnother problem I see are all those \"half related\" questions/threads, like this one: http://stackoverflow.com/questions/84556/whats-your-favorite-programmer-cartoon or this one http://stackoverflow.com/questions/305223/jon-skeet-facts \n\nI don't think they serve the main purpose of the site much and is something that would be more appropriate on a forum."}, {"author_name": "Summa Bumma", "gravatar_hash": "c7916db3051f9c07fa9b3dd0eefefb18", "author_url": null, "date": "Apr 27, 2009", "message": "I also agree with the two people above me, tim and nobody_"}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 27, 2009", "message": "&gt; The idea that you spent time “with the Data” on that question seems odd.\n\nI agree.  If there's one thing that I've learned from this, it is that Jeff badly needs a big vacation.  To focus this much energy on proving his point on something like this isn't really a good sign.\n\nIs this Ahab's new Moby Dick? ;)"}, {"author_name": "Alex", "gravatar_hash": "dfdf71914df8f6cdac6fdcdb4d981064", "author_url": null, "date": "Apr 27, 2009", "message": "I think we have rules overflow case here."}, {"author_name": "Michael Pryor", "gravatar_hash": "83678606ffe33ee7c1fb50b97338daed", "author_url": null, "date": "Apr 27, 2009", "message": "Steve Yegge is wise beyond his years."}, {"author_name": "belgariontheking", "gravatar_hash": "2a2f9018942bf8e582faff47eb169fdf", "author_url": null, "date": "Apr 27, 2009", "message": "@Pryor: some of us are able to listen to men talk on podcasts without immediately wanting to have their babies.\n\nAlso, shouldn't you be running around NYC like a maniac all afraid of 9/11v2 or something?"}, {"author_name": "KingNestor", "gravatar_hash": "437d018976627b471adcf13c6b31feb7", "author_url": null, "date": "Apr 27, 2009", "message": "I feel bad because I'm the who questioned Jeff on that privacy violation issue in his answer which in turn caused him to delete the whole question.\n\nThat wasn't my intention.  I honestly just wanted him to rephrase his \"answer\" so it didn't reveal the IP/(fake)Email of the anonymous user so he wasn't in violation of his own policy and the users privileged information stayed that way.  \n\nYou can see our whole comment conversation here: http://imgur.com/20bCW.png\n\nI agree with Steve Yegge and the micro-managing comments.  I'd rather have Jeff let the community moderate itself and have him continue to make cool stuff."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 27, 2009", "message": "Community moderation is all well and good, but we've seen how well that works when there are three camps (inclusionists think everything should be fair game, exclusionists want the site to maintain a strict code of what is and isn't acceptable, and the third camp just don't give a damn)."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 27, 2009", "message": "TheTXI: there's another camp - the one that thinks a strict code is appropriate 'till it's something that they like."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 27, 2009", "message": "Captcha: true theater\nCaptcha: crusades of\n\nAh, so true... it's why i keep coming back."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 27, 2009", "message": "Shog9: I forgot about that camp."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 27, 2009", "message": "Jeff Atwood:\n\nYou say Hawthorne effect as if it's a bad thing.  In fact, getting good answers to programming questions (even bizarre ones) is the purpose of the site.  Unless you are conducting a psychology experiment, I don't see the difference between answers that are a natural result of the system or because of attention drawn to them.  Think of it as another tool in the community's moderation toolkit.\n\nI suspect that the reason for this particular post is that you were publicly tricked by a particular question.  It hurts to admit that you were fooled, but I think you need to have that sense of humor you talk about sometimes.\n\nThat said, there's a fine line between a fun question and hoax question.  If you are going to accept only a few jokey-type questions, you might as well take the ones that are not hoaxes."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 27, 2009", "message": "@Jon\n\nMy take on it was that he was trying to avoid \"feeling bad\" for the foreigners who don't have the grasp of the irony or sarcasm of some posts and he thought that having that kind of exclusion was bad.  \n\nThat is the odd/ironic part - because he clearly thinks of \"those people\" (non- English speakers) as second class citizens in his world.  He has repeatedly defended his position - even after a week and after all sorts of posts and I suspect emails about.  \n\nHe can spout off all the 'defacto' and 'lingua franca' he wants, but the bottom line is that he pretty much showed his stripes as an ignorant redneck american.  \n\nEven if his claims of moral indignation at having 'those in the know' and those not in on the joke are true, they are extremely shaky when he publicly states he pretty much thinks non-English speakers are useless in the world of programming."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 27, 2009", "message": "tim:\n\nLet's not drag this off-topic.  I strongly believe that you are mischaracterizing Jeff's position on non-English speaking programmers.  It's far more nuanced than you suggest.\n\nAs far as I can tell, only Jeff (not Simucal and not some group of \"foreigners\") was fooled by the boat question.  And Jeff wasn't really fooled, but relaxed his suspicions a bit while talking on the podcast.  It can happen to anyone."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 27, 2009", "message": "> I suspect that the reason for this particular post is that you were publicly tricked by a particular question. It hurts to admit that you were fooled, but I think you need to have that sense of humor you talk about sometimes.\n\nNot at all. The end result of a joke question is always negative, in terms of energy expended on it verus benefit. That's why I regret not doing what I should have done (and was going to do, before others intervened with \"never close anything\" objections) -- which is deleting the joke question as soon as it was closed.\n\nWe'll be ruthlessly deleting closed joke questions from this point forward, in order to save everyone time and energy. <b>Garbage in, Garbage out.</b> It's what I've been saying all along -- whenever possible, let's spend our time answering real programming questions!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 27, 2009", "message": "> While it’s understood that the policy can be changed at any time and without notice, these changes should not retroactively apply. The correct procedure would have been to NOT disclose the private information\n\nWell, I deleted the revealed information, so I'm in compliance. I guess you should be asking Simucal why he reposted it, then, and not me? :)"}, {"author_name": "Jonik", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Apr 27, 2009", "message": "&gt; He can spout off all the ‘defacto’ and ‘lingua franca’ he wants, but the bottom line is that he pretty much showed his stripes as an ignorant redneck american. \n\nCould you possibly cut the crap (which happens to be offtopic too) - far from xenophobic or ignorant, Jeff was being pragmatic and absolutely correct about that particular issue. \n\nWhile I'm everything but a redneck American myself (a non-native English-speaker belonging to a rather marginalised language group), I for one fully agreed about the lingua franca (of our field) point, and the (lack of) need of localisation of SO."}, {"author_name": "dbr", "gravatar_hash": "edf857d71f672d8f411ef6b8376316b8", "author_url": "http://neverfear.org", "date": "Apr 27, 2009", "message": "Okay. Fine.\n\nHow do we decide when a question is \"fun\", compared to a \"joke\"?\n\nFor example, is http://stackoverflow.com/questions/795724/is-there-any-advantage-to-having-more-than-16gb-ram-on-a-windows-dev-machine  a \"joke\" (a random question I happened to have open, which seems a bit far fetched)?\nIf the programming-at-sea question as tagged with \"fun\", would it be okay? What if the questioner said he was going to and live on a pirate ship, rather than a 40-foot sailing yacht?"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 27, 2009", "message": "&gt; Not at all. The end result of a joke question is always negative, in terms of energy expended on it verus benefit. \n\nHuh?  The question had one answer that has been largely viewed as quite good.  Sure the answer has been removed and the only effect of the question now is energy needlessly expended.  But the question *could* have been retained leaving a small amount of light on the site.  Maybe the question and answer could have been edited and improved.  We can't know at this point.  Deleting it has not (as we are now observing) removed any heat--only added.\n\nThis is yet another example of a phenomenon I've observed on Stack Overflow.  Moderator actions against grey-area questions tend to increase the noise surrounding the question rather than decrease it.  To me this is a sign of a broken system.  The frustrating thing to me is that your response is consistently to blame the users.\n\nI just found an article you might want to chew on: http://www.mikealrogers.com/archives/577  My favorite bit:\n\n\"But now you don’t have to do anything because you’ve convinced yourself that you did nothing wrong and it’s just a bunch of users you don’t want complaining about something they are too dumb to understand.\""}, {"author_name": "Duff", "gravatar_hash": "974938b8250a08cf9e22714aff1f9fcc", "author_url": null, "date": "Apr 27, 2009", "message": "Online communities jump the shark when they spend of time worrying about suppressing trolls and such."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 27, 2009", "message": "> Huh? The question had one answer that has been largely viewed as quite good. \n\nYes, *after* it was mentioned on the podcast and linked from the blog, *repeatedly*. You're confusing cause and effect here. These two things are intimately related and inseperable, in this particular case.\n\n> This is yet another example of a phenomenon I’ve observed on Stack Overflow. Moderator actions against grey-area questions tend to increase the noise surrounding the question rather than decrease it.\n\nIn fact, the exact opposite of what you're describing happened --  moderator actions on that question generated one unusually excellent response. \n\nThis entire conversation (plus the many emails I fielded on the topic) proves why questions like this are not worth the effort -- we <i>could</i> be building Stack Overflow, or answering other programming questions based on real problems actual programmers are having -- not wasting our time with hypothetical jokes.\n\nSilence and swift removal is the best treatment for joke questions; allowing them to persist and talking about them is what increases the noise. \n\nNot sure where you're getting \"blame the users\" from. I blame <b>myself</b> for letting the ugly canker sore that was \"programming at sea\" persist, giving it attention and letting it spread infection. This mistake will not be repeated."}, {"author_name": "Sung Meister", "gravatar_hash": "409261beec25d8d5e7f821fcfae72351", "author_url": "http://stackoverflow.com/users/4035/", "date": "Apr 27, 2009", "message": "@Jeff Atwood\n\n&gt; let’s spend our time answering real programming questions!\n\nAs long as people can receive badges from joke-questions that hit big, people will not cease to attempt to post those questions."}, {"author_name": "Rob", "gravatar_hash": "3fef2ba73b347b671e0d85d581d6e6f9", "author_url": null, "date": "Apr 28, 2009", "message": "StackOverflow is turning into a nanny state. What a waste of time."}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Apr 28, 2009", "message": "Totally agree with Sung Meister. It isn't enough with CW mode, these questions should not award *anything*, no rep, no badges, nothing.\n\nThis way people will stop posting this stuff"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 28, 2009", "message": "Juan: \n\nI would like to believe that, but I think if you got rid of CW mode, you would end up rewarding them for posting the garbage and collecting a few upvotes before the \"nazis\" come rolling in to clean up the mess."}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 28, 2009", "message": "&gt; Yes, *after* it was mentioned on the podcast and \n&gt; linked from the blog, *repeatedly*. You’re confusing \n&gt; cause and effect here. These two things are intimately \n&gt; related and inseperable, in this particular case.\n\nWho cares?  Seriously, the question ended up good, with good answers.  Why do you care so much how it got there?\n\n&gt; This entire conversation (plus the many emails I \n&gt; fielded on the topic) proves why questions like this \n&gt; are not worth the effort — we could be building Stack \n&gt; Overflow, or answering other programming questions \n&gt; based on real problems actual programmers are having — &gt; not wasting our time with hypothetical jokes.\n\nI agree, and there is a simple solution.  Quit chasing your fantasy of a problem and keep building the site."}, {"author_name": "cruachan", "gravatar_hash": "b32a3867736b5164a1c8092a362cbdd7", "author_url": null, "date": "Apr 28, 2009", "message": "I think Jeff is a little to close to this to be making the decision. The Programming at Sea question was simply *not* that prominent an issue.  I have SO open as a default tab on my browser and it gets refreshed probably a couple of dozen times a day on average and whilst I do recall glancing at it I'd strongly surmise it really didn't have any significant impact on any general SO user.  Indeed it's main prominence was the fact that it was mentioned in the Podcast on a couple of occasions.  More the Streisand effect than Hawthorne :-)\n\nAs to Jeff's ego not being involved here, well simply I methinks the man doth protest too much.  Which is silly, because he's made far more embarrassing bloopers (we love em' Jeff!) - the English Question being magnificently eclipsed by the sheer gringeworthyness of the misunderstanding over NP-completeness.\n\nHonestly, just chill and trust your community to sort it out - that's what you wanted? right?\n\nBesides, strongly policing the boundaries would be impossible as it's ridiculously easy to think up questions that can be both joke and serious - and you'll just end up in a world of trouble over it.  For example how about this...\n\n\"The vast majority of programming languages have been defined by men, what impact does the SO community think that unconscious gender-bias has had on the semantics of modern programming languages and how would the design of a truly gender-neutral language differ from current practices?\"\n\nSo I just thought this up as a 'PC gone mad' joke question - just a little more subtle than a sex change on C++ coders, but wait; most languages are designed by men and most programmers are men, so could it really be we've designed languages that appeal to the male mentality so *is* there a gender-bias in there?  Oh and look, I can even Google up an article that discusses the issue seriously: http://burningbird.net/diversity/a-matter-of-language/\n\nHmm, so now if I posted a variant on this question myself it could be a joke question, but it's conceivable that Shelley Powers (the author of the link) could post exactly the same question in all seriousness.\n\nIn other words, the route Jeff is proposing to take with this really does look to me like it leads into a particularly nasty sort of quagmire. And all for something that to the normal SO user really doesn't impact."}, {"author_name": "Nathan", "gravatar_hash": "ec2b04ac1bad14fea8244a78ef0f2133", "author_url": null, "date": "Apr 28, 2009", "message": "@cruachan +1\n\n@Jeff, I think that the people who read this blog are the least likely to put up \"joke content\"\n\nI thought the boat question was ridiculous from the get-go. The final answer that was pretty good. So perhaps it should stay up.\n\nAnyway, I'm really looking forward to ServerFault and all the improvements to StackOverflow"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 28, 2009", "message": "&gt; Not sure where you’re getting “blame the users” from. I blame myself for letting the ugly canker sore that was “programming at sea” persist, giving it attention and letting it spread infection. This mistake will not be repeated.\n\nBut if you look back over your posts here (and try to read them fresh) I think you will find that there are many attempts to \"educate\" your users on how to use the site correctly.  I find the rules you lay out to be very specific to certain users or questions rather than broad generalizations.  They tend to be overly reactive and directed against specific behaviors.\n\nI'm making a broader point, not related to the boat question.  You won't let it happen again?  How?  By deleting the work of more users?  By saying stop doing these nasty things to my site?  By banning users?  All of those things give the question more attention.\n\nWhy not take a moment to see how the site itself might be causing the pathologies you see in your users?  Maybe you will change nothing.  That's your call.  But telling us that we are using the site incorrectly has the same effect as blaming your users no matter who you actually blame.\n\nTo put it another way, http://stackoverflow.com/about says:\n\nWe don't run Stack Overflow. You do. Stack Overflow is collaboratively built and maintained by your fellow programmers. Once the system learns to trust you, you'll be able to edit anything, much like Wikipedia. With your help, we can build good answers to every imaginable programming question together. No matter what programming language you use, or what operating system you call home -- better programming is our goal. \n\nDo *you* trust us as much as the system does?"}, {"author_name": "litb", "gravatar_hash": "31a1c40a45079decc7f5525d2a873481", "author_url": null, "date": "Apr 28, 2009", "message": "And i assume this is a joke question too:  http://stackoverflow.com/questions/795286 . I guess the guy sits there and laughes about the people that \"fixed\" his answer so it made at least some sense. \n\nPersonally, i voted to close that question. But most people have good souls and are with that guy :)"}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 28, 2009", "message": "&gt; In other words, the route Jeff is proposing to take \n&gt; with this really does look to me like it leads into a \n&gt; particularly nasty sort of quagmire. And all for \n&gt; something that to the normal SO user really doesn’t \n&gt; impact.\n\nIndeed... I've sometimes wondered about the specific criteria for denying joke questions as well if this were 100% enforced.  If I post a serious question in a non-serious manner, I'm joking and it will be closed.  But if I post the exact same question not as a joke, it wouldn't be closed.\n\nHow can one tell the difference, and why should one care?"}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 28, 2009", "message": "@Jon Ericson: +1.\n\nThere seem to be much larger issues than joke questions, and I don't understand why this is receiving so much attention.  I would guess the site gets a few joke questions a day **at most**, and probably closer to a few a week.  However, I easily see a dozen+ \"pure noise\" (but genuine) questions a day, such as \"what software is SO running on?\"\n\nIf signal-to-noise becomes unacceptably low here, I doubt it will be from \"you've been punked\" questions. I would not be surprised to see it be caused by \"what kind of code do you want on your wedding cake\" and \"what is your favorite ____\" and \"what is the funniest ____ you've done in programming\" questions, however."}, {"author_name": "theman", "gravatar_hash": "535397b708dc316389dd4041a2797496", "author_url": null, "date": "Apr 29, 2009", "message": "@litb - that might be serious, a lot of people dont understand the ternary operator.\n\n@jon ericson: +1 cause you helped me with a bash question once and i generally agree with your comments here.\n\n@the communtity: if a tree falls in the forrest and no one is around to hear it, does it make a noise?  if i post a \"joke\" (or viewed as a joke) question, and no one bothers to read it, then is it even a problem?"}, {"author_name": "theman", "gravatar_hash": "535397b708dc316389dd4041a2797496", "author_url": null, "date": "Apr 29, 2009", "message": "@eddie: +1.  yea i especially love the \"what is your favorite t shirt to wear when you code\"-type questions.  They should be tagged with \"who-cares\""}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 29, 2009", "message": "I would prefer a WGAS (Who Gives A S***) tag"}, {"author_name": "theman", "gravatar_hash": "535397b708dc316389dd4041a2797496", "author_url": null, "date": "Apr 29, 2009", "message": "WGAS it is!"}, {"author_name": "litb", "gravatar_hash": "31a1c40a45079decc7f5525d2a873481", "author_url": null, "date": "Apr 29, 2009", "message": "@theman, i've no doubt that there are people not understanding it. But the guy did a rep-game just a few questions before with his university-friend (which i flagged, of course). Also, look into the edit history how the very first version was. That question can't be serious :)"}, {"author_name": "theman", "gravatar_hash": "535397b708dc316389dd4041a2797496", "author_url": null, "date": "Apr 29, 2009", "message": "@litb - ahh, k, i didnt spend more then 10 seconds looking at it, i was expecting a stupid question like the ones i .. uh nevermind.  I accepted \"oh.. he doesnt know what ternary operators do\" and moved on"}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Apr 29, 2009", "message": "@litb: You mean this revision?\n---\nin c++ quastion\nint qempty(){ return(f==r)?1:0;}\n\nplease what ? mean ?????? &amp; what can we replace it with \n---\n\nWhy does that seem like a joke question to you? I've seen worse on SO before.\n\nI don't know about the rep-game bit; I suppose the question is deleted, since it doesn't appear in his history. But without further evidence, I don't think I could accuse him of posting joke questions."}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 29, 2009", "message": "Here's another that was closed but is now a decent question (it was before as well, but was perhaps a bit too concise):\nhttp://stackoverflow.com/questions/803197/how-do-i-go-about-building-a-test-plan-for-our-qa-department\n\nI believe that one original closer has changed votes (so it no longer really even has the 5 close votes), but it hasn't garnered enough attention to actually get reopened.\n\nThats what I mean about the process being too heavy-handed."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 29, 2009", "message": "One of the problems with closing questions is that they rarely get opened.  Pat of that is the nature/how the close happens.  You can't vote to re-open or \"offset\" a vote to close it until i is closed.  And then it is off the radar of most users.  It goes away.  I would bet very few are reopened - and it is especially hard not that you need so many votes to bring it back from the dead.  That was a mistake in my opinion.\n\nIt costs people rep to vote down a question or post, but it costs nothing to vote to close.  That seems inconsistent to me."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 29, 2009", "message": "> Honestly, just chill and trust your community to sort it out - that’s what you wanted? right?\n\nWell, programming at sea was properly closed *by the community* until Michael insisted that I intervene, then we brought it a bunch of attention, etc etc etc. The result: clusterf**k.\n\nBut yes, we are in agreement. The general principle going forward will be -- kill the joke questions silently and with as little fanfare and discussion as possible.\n\n> You won’t let it happen again? How? By deleting the work of more users? By saying stop doing these nasty things to my site? By banning users?\n\nAs I said, the post was originally closed by the community. I failed to delete it, which is what I normally do.\n\nAnd that mistake won't be repeated."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 29, 2009", "message": "@tim: If you make it take rep to vote to close, then the site will be overrun by duplicates and jokes of all kinds.  Signal to noise will drop, slowly at first, and more rapidly as people see that bad questions don't get closed.\n\nYou are inadvertently asking for a system of *no* rules."}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 30, 2009", "message": "&gt; Well, programming at sea was properly closed *by the \n&gt; community* until Michael insisted that I intervene, \n&gt; then we brought it a bunch of attention, etc etc etc. \n&gt; The result: clusterf**k.\n\nStrange, b/c I thought the result (\"hawthorne effect or not\") was good answers.  Isn't that the real point of the site anyway?"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "May 01, 2009", "message": "This does open up more meanings of the term software piracy:\n\nhttp://stackoverflow.com/questions/811640/how-to-handle-software-piracy"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "May 01, 2009", "message": "@eddie\n\nThe point was that once questions are closed they are generally not going to be reopened because of the way the system works.  You can't vote to reopen or cancel close votes until it is closed.  The people who seem to have lots of time to spend on SO seem to like to close things.  I am a proponent of just leaving things open - unless it is spam or offensive.  Jeff CLAIMS that the site is to be run by the users, but he then releases edicts and gets involved in particular questions.  It is inconsistent that he wants to have it both ways - fun and intolerant of marginal questions.  Oh well.  It is his site, but I am not fooled by his claims that he is letting the users pick the questions that remain."}, {"author_name": "Mike", "gravatar_hash": "9c44d512c30bd79bd0658a7d4e2a0b44", "author_url": "http://google.com", "date": "May 01, 2009", "message": "your site is GREAT, its one of the best sites I have ever seen on the internet, surfing up by more than 3 years! Thanks for you, dear creators!"}, {"author_name": "amit prasad", "gravatar_hash": "6affdcca3b4bbf77f32848cd60850e9c", "author_url": "http://www.amitaj4u.wordpress.com", "date": "Jul 20, 2010", "message": "if u are pm then,what r u doing?????\n   www.plusemai.ning.com\n   www.helopik.webs.com\ngo to that site and creat ownself"}]}