{"response": [{"author_name": "1800 INFORMATION", "gravatar_hash": "acc637690f49e2b5a2146deb17874d6f", "author_url": null, "date": "Apr 29, 2009", "message": "I think I would like to be a beta tester for that \"money\" button"}, {"author_name": "Jörg W Mittag", "gravatar_hash": "1f1d81bc927dd67f05ea41f4c8a61e9f", "author_url": null, "date": "Apr 29, 2009", "message": "Those displays with the \"8\" are called \"7 segment displays\", because they make every digit out of ... well ... 7 segments: 2 vertical left, 2 vertical right, and 3 horizontal top, middle and bottom.\n\n  1\n2   3\n  4\n5   6\n  7"}, {"author_name": "Jörg W Mittag", "gravatar_hash": "1f1d81bc927dd67f05ea41f4c8a61e9f", "author_url": null, "date": "Apr 29, 2009", "message": "Oops. Formatting screwed up."}, {"author_name": "Simon Buchan", "gravatar_hash": "ea6872cf5f32040741eabf1e7e089416", "author_url": null, "date": "Apr 29, 2009", "message": "Thanks mmyers, I always forget which is which. I'm actually serious!"}, {"author_name": "mmp1", "gravatar_hash": "83bcb6a6206265dc4456d6ef85c9b80d", "author_url": null, "date": "Apr 29, 2009", "message": "mmmm... those HP calculators rock.  My favorite was the HP-28S.  If it could mp3's, i'm sure it could have been the iphone of its day."}, {"author_name": "Jon Cram", "gravatar_hash": "28d3858fd164c191d05954e114adeb9a", "author_url": "http://webignition.net", "date": "Apr 30, 2009", "message": "Talking of phone hacks, as Michael did, there used to be a method of obtaining free calls from BT-provided public telephones in the UK. This method has not worked for many years.\n\nPressing the 'next call' button followed by 99* would cause the last coin you put in to be returned to you. As Michael said, you can't not be curious and try to see if this works.\n\nIn working with the last coin only this did limit calls to those costing less than £1, but 15 years ago £1 = £1,000,000 so that didn't matter."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Apr 30, 2009", "message": "danke danke danke danke\n\n&lt;3 podcast &lt;3"}, {"author_name": "Euro Micelli", "gravatar_hash": "a905a92a336eaea1b936c100ec49e229", "author_url": "http://stackoverflow.com/users/2230/euro-micelli", "date": "Apr 30, 2009", "message": "I used an HP-41CV through much of college (that is, until I was stupid enough to leave it behind in the cafeteria). I have never found another calculator that felt so... *natural* to use. I miss it so much.\n\nI'm still cracking up with Joel's description of a rotary phone. It's like the tales of the family gathering around \"The Radio\". I feel like I'm like 80. Next episode: Joel will actually explain the Babbage differential engine. :-)\n\nI have a friend overseas who STILL has an old phone with a busted disk mechanism, and who STILL dials it by the hook-pulsing method."}, {"author_name": "Chris Marasti-Georg", "gravatar_hash": "4281c5c19a1c365390eb478d529de6fa", "author_url": "http://www.bowlsk.com", "date": "Apr 30, 2009", "message": "@Jeff, around 24 minutes.\n\nI think the reason that it would be a good idea to create a new question and answer is for the continual feedback loop that SO creates.  What if there is a bug in the answer you found?  What if there is a better way to do it?  These are a few of the reasons cited for creating SO - why discourage people from seeding SO with these Q &amp; As, so that they can be improved on?"}, {"author_name": "Eric Z. Beard", "gravatar_hash": "62cc585b9fd3ee7182dadbd09a7f4b47", "author_url": null, "date": "Apr 30, 2009", "message": "Jeff, if you like clocks you should have this one: http://www.thinkgeek.com/homeoffice/lights/59e0/"}, {"author_name": "Charles Grant", "gravatar_hash": "453e2a96c59c6a9761e11f9ea11e7380", "author_url": null, "date": "Apr 30, 2009", "message": "Last Christmas I dropped in at the Microsoft visitor center for the first time in years. I was appalled at how sterile and lifeless it had become. Back in the late 90s when it was the \"Microsoft Museum\" it had plenty of wacky and cool stuff. Different groups would rotate through setting up a typical Microsoft office. There were video loops of great pranks, and tongue-in-check informercials, with Steve Ballmer in a checkered sports coat touting the \"web of wealth\". There were even some actual educational exhibits about how Microsoft wrote and manufactured software. The current visitor center is like an Apple store with no people, and fewer interesting products."}, {"author_name": "Rik", "gravatar_hash": "18a86c02ff06b2af506f1e842745d62f", "author_url": null, "date": "May 01, 2009", "message": "Do you realize that the first 10 minutes of this episode where about podcasts about podcasts? A discussion of meta-discussions. Meta-meta-discussion?"}, {"author_name": "malach", "gravatar_hash": "09eb3720b1c9d33bedd35a3bd47ec1c9", "author_url": "http://rickenba.ch", "date": "May 01, 2009", "message": "9'000'000 programmers in the world - I would say that might be fairly right as that is more than 1 out of a 1000 of the whole world population."}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "May 01, 2009", "message": "Someone should repost the babby question on Stack Overflow.\n\n“How is babby formed... for a programmer?”"}, {"author_name": "Dusty", "gravatar_hash": "f6748e7fc8264c0d98bbf37541138f01", "author_url": null, "date": "May 01, 2009", "message": "Jeff, I get the point that you dislike meta, but I really feel that if you're not going to let us ask and answer questions about how to use stackoverflow.com on stackoverflow.com you have to write better documentation.\n\nThe other day I was using the site and was trying to find questions to answer.  I could not get the feature to work the way I expected.  Since I was right already here, I searched for the question about the stackoverflow.com feature.  There were several answers but they needed clarification (which I figured out after 15min of messing with uservoice).  I updated it with a new answer and helped someone else who later up-voted my answer. Bam! Instant documentation.  So if you don't want meta questions, write more in-depth and broader FAQ or a manual.  Otherwise, you'll have to let us use the system to do it."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "May 01, 2009", "message": "I still think you're missing the point about metadiscussion. I don't want to discuss stackoverflow, and I agree, I don't want to see metadiscussion on stackoverflow.\n\nBut I *do* want to know how to use Stackoverflow. I've been there since something like november, and there's still a lot of it I simply don't understand. I still haven't figured out what all the colors mean on questions. I have no clue what the \"votes\" list on my user page means. Is that how many votes I've given out, or received?\n\nMy problem is simply that Stackoverflow is basically undocumented. I don't want to encourage metadiscussion, but I *do* want a place to ask \"what does it mean when I see this on Stackoverflow?\"\nAnd I have no place to do that. It's not Uservoice, because it's not feedback. It's not programming related, so it shouldn't go on SO either.\n\nI could post it here on the blog, but... really? Is this blog supposed to be the authoritative reference documentation for SO?"}, {"author_name": "Phil", "gravatar_hash": "6b686fe7f07115890ca63099d088948d", "author_url": "http://stackoverflow.com/users/19464/pdurbin", "date": "May 01, 2009", "message": "Did Jeff say he talked about Server Fault in some other podcast?"}, {"author_name": "Nathan", "gravatar_hash": "ec2b04ac1bad14fea8244a78ef0f2133", "author_url": null, "date": "May 01, 2009", "message": "@Phil,\n\nYeah, he mentioned the \"Run As Radio\" podcast, which can be found here http://www.runasradio.com/ I would imagine the podcast with Jeff will appear May 6th, as they publish every Wednesday."}, {"author_name": "Chris", "gravatar_hash": "0988afcc48ea3e50fc80ba85366aab42", "author_url": "http://www.dreamlogic.net", "date": "May 01, 2009", "message": "Weird Stuff is still around. I love that place. It's over by Yahoo in Sunnyvale now though.\n\nhttp://www.weirdstuff.com/sunnyvale/html/index.htm"}, {"author_name": "bob", "gravatar_hash": "820d0e4ee14e986a44d33782ca852f51", "author_url": null, "date": "May 02, 2009", "message": "This will make your fetish run wild,\n\nhttp://www.darkroastedblend.com/2009/05/extraordinary-clocks-and-watches.html"}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "May 04, 2009", "message": "The copying of questions + answers from other sites is a lot like solving problems you don't really have (unless you're going to refer to it in the future.)"}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "May 04, 2009", "message": "I agree with @jalf a few comments up about documentation. I suggest making it a Wiki and seeding with some very simple info, like what can you do at different levels of reputation, how to get rep etc.\n\nThe FAQ is a nice starting point, but it should really be a Wiki IMO."}, {"author_name": "Jason Punyon", "gravatar_hash": "4fb7b364b3f80e89add72eb6a7ce0d55", "author_url": null, "date": "May 05, 2009", "message": "Michael,\n\nMaybe it was Joel's inimitable mic'ing skills, but here and there throughout the podcast you sound remarkably similar to Mike Birbiglia..."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "May 06, 2009", "message": "Just check the Run As Radio site and it looks like the new episode features some other guy. Jeff, when will your episode go live?"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "May 06, 2009", "message": "Uh, make that \"just checked\"."}, {"author_name": "AndyM", "gravatar_hash": "ca95ed9737215505faf4ca931cb0613d", "author_url": null, "date": "May 08, 2009", "message": "Thinking about Joel's teacher's lounge idea. What about creating discussion forums which require certain badges in order to post?"}, {"author_name": "Clay Nichols", "gravatar_hash": "be1412da6c2da03393da8fcbeb015f1e", "author_url": "http://www.BungalowSoftware.com", "date": "May 10, 2009", "message": "How about a meta-StackOverflow tag so that folks can filter it out?\n\n+1 for the folks asking \"how do I do this in SO\" *on* Stack Overflow."}, {"author_name": "Nathan", "gravatar_hash": "ec2b04ac1bad14fea8244a78ef0f2133", "author_url": null, "date": "May 14, 2009", "message": "Just a heads up, the podcast with Jeff on RunAsRadio is up. See http://www.runasradio.com/default.aspx?showNum=109"}, {"author_name": "Sosh", "gravatar_hash": "a217e17ee044d9d33d2bd8dd51909c41", "author_url": null, "date": "May 20, 2011", "message": "You guys talk so much about how blogging about blogging is worthless.  I think you may have become the authoritative blog about blogging about blogging ;)"}, {"author_name": "Sosh", "gravatar_hash": "a217e17ee044d9d33d2bd8dd51909c41", "author_url": null, "date": "May 20, 2011", "message": "...and please tell me I'm not the only one who did a double-take on that first bullet point!"}]}