{"response": [{"author_name": "macbirdie", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Apr 23, 2009", "message": "I think it was the best episode ever, thanks!"}, {"author_name": "Jason Punyon", "gravatar_hash": "44302dd1c18f747ba4fff5f689c475ba", "author_url": null, "date": "Apr 23, 2009", "message": "First.  You guys should seriously consider asking Steve to be third mic for every podcast if he has the time.\n\nSecond.  I've never heard Yegge's voice before.  If you have and didn't know he was a toker, see your doctor immediately.  You might have an auditory processing disorder..."}, {"author_name": "guns", "gravatar_hash": "a16f8e5e806ff4992128e0ee0647c5f0", "author_url": null, "date": "Apr 23, 2009", "message": "&gt; No, Steve, the caller did not say “eunuchs”!\n\nHaha, but I should have, in retrospect.\n\nGreat answer Joel - I didn't mean to be too flag wavey; I was really just aiming to hear an amusing story about some crazy Unix machine in your past that scarred you for life. (I still think you're keeping a good story from us, though)\n\n&gt; Steve observes that the only way to determine what packages are installed on Ubuntu is to diff the dpackage output against a clean machine.\n\nJust to be clear, I think what Steve Yegge meant is that the only way to determine what packages that have been installed on the system since installation is to diff the 'dpkg -l' output. This is probably true, but just listing all the installed packages is trivial: 'dpkg -l | grep ^i' or 'aptitude search ~i' does just fine.\n\nThe real trouble is the shifting boundary of an open source operating system: where does the operating system end and the user applications begin? If that distinction is unclear, there's no good way of telling what's not native to the system.\n\nThat question could be clear though, if package managers would just install user specified packages to a completely different directory hierarchy than those specified by the distribution. Then Linux distro release versions could actually mean something."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Apr 23, 2009", "message": "congrats on 50 episodes!! (is this a milestone or is 52 ?)\n\nAlso, I am done with that java project so now theman is back at home on linux"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 23, 2009", "message": "Great podcast, although there was a period of about 25 minutes (5:55 to 30:08) where Jeff couldn't get a word in at all.\n\nI'm really interested in Steve's project, but I'll reserve judgement until I see it in operation (which, by Steve's admission, could be a while or never). I suspect that making it compatible with all programming languages would be extremely hard to do well because there's so much variation in what constitutes a programming language. Though if he does succeed I look forward to using it with Piet. ;-)"}, {"author_name": "matt b", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Apr 23, 2009", "message": "This episode was really fun to listen to.\n\nI second the nomination to have Steve become a permanent member/host of the podcast!"}, {"author_name": "glaxaco", "gravatar_hash": "12528d0957525f720b9f3ab2e8a815de", "author_url": null, "date": "Apr 23, 2009", "message": "When I was in grad school a million years ago (OK, the late 80s/early 90s), my thesis adviser was a big fan of APL. I have no idea why - it probably had some cool features you couldn't easily get in other languages at that time. Fortunately, he didn't force me to learn it (I was confused enough with C/C++ at the time, what with being a mechanical engineer and all)."}, {"author_name": "Jake", "gravatar_hash": "769b1f309a41e2893654c81496b9f8b4", "author_url": "http://jakemcgraw.com", "date": "Apr 23, 2009", "message": "New podcast drinking game: anytime someone discredits PHP take a shot. Call the ambulance now."}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Apr 23, 2009", "message": "@Jake,  Well, you are a PHP programmer. You have got to understand at least ~somewhat~ where they are coming from! ;)"}, {"author_name": "Jake", "gravatar_hash": "769b1f309a41e2893654c81496b9f8b4", "author_url": "http://jakemcgraw.com", "date": "Apr 23, 2009", "message": "@Simucal yeah... it does suck, but, like JavaScript, the frameworks are making it better. Anyone can write terrible Python, Ruby, Java or C++, it's just easier to write terrible code in PHP I guess."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Apr 23, 2009", "message": "Just for the record... apparently we have Dancing with the Stars in the UK as well, and there's also Strictly Come Dancing.\n\nI can pretty much guarantee that I'll never be on either of them though. This is a Good Thing.\n\nI've still got about 10 minutes to go, but so far - great podcast. Probably the best so far.\n\nJon"}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "Apr 23, 2009", "message": "I agree with everyone saying that it would be great if we could have Steve as a permanent member of the podcast.\n\nI think you 3 have a good dynamic and Steve brings a lot of technical information to light that I find really interesting."}, {"author_name": "Pete", "gravatar_hash": "b5c36c4aeb4254e7d687f03bde1cbce2", "author_url": null, "date": "Apr 23, 2009", "message": "Every time I listen to a Podcast with Steve on it i feel like I've learned a lot! love it"}, {"author_name": "1800 INFORMATION", "gravatar_hash": "acc637690f49e2b5a2146deb17874d6f", "author_url": null, "date": "Apr 23, 2009", "message": "I wonder what Steve Yegge's SO username is"}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Apr 23, 2009", "message": "Best episode ever!"}, {"author_name": "MissT", "gravatar_hash": "2594d231b1e9ac1d7ccea9db5a077262", "author_url": "http://www.c3wife.com", "date": "Apr 23, 2009", "message": "Liked the podcast!\n\nMy favorite language used to be VHDL so I guess there is no shame loving Javascript. It's perfectly OK to be a programming language masochist!\n\nGoing John Cage is alright as long as you don't go ASLSP\n\nVery happy you talked about my favorite subject: programming language design."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Apr 23, 2009", "message": "You guys should get Crockford on the show. He would probably clear up some misconceptions you all have about Javascript."}, {"author_name": "Kai Hendry", "gravatar_hash": "c63e3277a1ab0cb87c603f09fc67ba43", "author_url": "http://wiki.whatwg.org/wiki/IDE", "date": "Apr 24, 2009", "message": "Listened with interest about making Javascript easier to edit. What about JSlint and simply formatted error feedback within the editor?\n\nhttp://wiki.whatwg.org/wiki/IDE\n\nI realise Intellisense is far better for a certain class of programmers, though the minimalistic approach works for me. :-)"}, {"author_name": "Rik", "gravatar_hash": "18a86c02ff06b2af506f1e842745d62f", "author_url": null, "date": "Apr 24, 2009", "message": "Joel said \"Begs the question\" again in the wrong context."}, {"author_name": "cgreeno", "gravatar_hash": "24b8f104813d0cd6fea18ace38876e0c", "author_url": null, "date": "Apr 24, 2009", "message": "Is it possible for Steve Yegge to become a permanent member of the podcast? The dynamic of the three of you makes such a good listen. \n\nBest podcast by far."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Apr 24, 2009", "message": "&gt; @Simucal yeah… it does suck, but, like JavaScript, the frameworks are making it better. Anyone can write terrible Python, Ruby, Java or C++, it’s just easier to write terrible code in PHP I guess.\n\n@jake - nice canned, unoriginal response"}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Apr 24, 2009", "message": "Interesting podcast. Steve is fun to to listen to and, with Joel, they make a dynamic duo.\n\nLess talk about SO. Not that it's not interesting but the break from SO talk this time was very felt for me.\n\nGreat job."}, {"author_name": "Cameron LaRue", "gravatar_hash": "99e084137af1790e78d14694c8c82cbd", "author_url": null, "date": "Apr 24, 2009", "message": "Excellent episode- I feel like I learned almost as much from this one podcast as I do from a typical day at ASU as a CS undergrad.\n\nThe main difference is, I get this podcast for free! Thanks!"}, {"author_name": "Ryan Thames", "gravatar_hash": "2936cec6a3ee0181288681332dd60c3f", "author_url": null, "date": "Apr 24, 2009", "message": "I also agree with adding Yegge to the podcast more often."}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Apr 24, 2009", "message": "I believe he will be on the 75th episode =)\n\nDoes he have a podcast of his own? I saw the blog, but it's just too much text, now that I found podcasts I never want to read again! (j/k)"}, {"author_name": "Steve Yegge", "gravatar_hash": "b7b89858d3aae8a1c7dce94f17f8b30b", "author_url": "http://steve-yegge.blogspot.com", "date": "Apr 24, 2009", "message": "Thanks for all the kind words!  I'm a bit too overloaded to do a weekly podcast, but I could definitely see doing it every 25 episodes. ;-)"}, {"author_name": "Auramo", "gravatar_hash": "c31b822dc1c8097d66be0334fafbd4c2", "author_url": null, "date": "Apr 25, 2009", "message": "Best and most entertaining SO podcast so far, thanks! I was surprised to hear those kind words about Scala from Steve. His comments on the language in \"Rhinos and Tigers\" blog post weren't exactly favourable :-)"}, {"author_name": "Arjun", "gravatar_hash": "74bf45a25edbb8bc4dbe1c3343a5f500", "author_url": null, "date": "Apr 25, 2009", "message": "Joel/Jeff, both of you are incredibly smart people but your greatest strength is your ability to talk about technology in a conversational form and not a series of dry technical facts.\nMy only complaint is that in the podcasts your try to hard and spend too much time trying to be funny. Could we have more technical content in the podcast? I dont mean to be critical but I feel you can do so much more in the technical enlightenment of your listeners.\n\nCheers"}, {"author_name": "Pietro Polsinelli", "gravatar_hash": "5198744cd329b6dfdb9e39b4f9794cd1", "author_url": "http://polsinelli.wordpress.com", "date": "Apr 25, 2009", "message": "+1 on best podcast so far."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Apr 26, 2009", "message": "An example of APL code for the youngsters out there\nhttp://jeffareid.net/misc/aplfns.jpg"}, {"author_name": "LT", "gravatar_hash": "4fe3d43ce3443af071aa880b9407c1ab", "author_url": null, "date": "Apr 26, 2009", "message": "Where can I find the boat programming question on stack overflow?\n\nJust because you personally haven't done programming at sea it doesn't mean that nobody does it. And since you don't have any knowledge or statistics about it, how can you judge it?\n\nI think it is just as relevant as the question \"How do you clear your mind after 8-10 hours per day of coding?\"\n\nWhat's wrong of having that question available when you search for it?\n\nRemoving things the majority doesn't already know about removes the possibility of expanding your horizons. It makes a site become the place of the lowest common denominator just like digg or reddit.\n\nAnd yes, I'm serious."}, {"author_name": "Gishu", "gravatar_hash": "69772f0246d5013d72703967b8761e89", "author_url": "http://madcoderspeak.blogspot.com", "date": "Apr 26, 2009", "message": "\"You guys are gonna be destroyed by boat-programming.org\" - Yegge. Prophetic?"}, {"author_name": "Ville Laurikari", "gravatar_hash": "6b75c51d2125affac45e4534a15d8070", "author_url": "http://laurikari.net/ville/", "date": "Apr 27, 2009", "message": "&gt; Steve observes that the only way to determine what packages are installed on Ubuntu is to diff the dpackage output against a clean machine.\n\nWell, that's obviously wrong, and shows that Joel, Jeff, or Steve have never in their life used Ubuntu for 2 minutes, and didn't really know what they were talking about.\n\nIf you want to see what's installed, it's three clicks away: \"Applications\" -&gt; \"Add/Remove\" -&gt; \"Show: Installed applications only\".  Or you can go to the command line, which isn't really as complicated as Steve makes it out to be.\n\nIf anything, it's much _easier_ to install software on Ubuntu than it is on Windows, for the user I mean.  Most importantly, there are tens of thousands of software packages available in the standard repositories.  Basically any software that's been ported to Linux is available from the same place.  On Windows, you need to find stuff from somewhere else.  You just have to know a big bunch of places where you get your Acrobat reader and whatever.   It's kind of the same difference as the iPhone app store vs. a Nokia phone."}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 27, 2009", "message": "&gt; Just because you personally haven’t done programming \n&gt; at sea it doesn’t mean that nobody does it. And since \n&gt; you don’t have any knowledge or statistics about it, \n&gt; how can you judge it?\n\nI agree.  DELETING a question that had serious (and potentially useful) answers is crazy.  \n\nPerhaps a Moby Dick analogy would help?"}, {"author_name": "Brendon Duncan", "gravatar_hash": "225be77d47a9725676d15af430e60f7e", "author_url": null, "date": "Apr 27, 2009", "message": "APL is written using a normal keyboard, you just press Ctrl+ another key, or Ctrl+Shift+ another key.\n\nAPL is also a very suitable tool for number crunching and its use of symbols make it so expressive that you can do a lot in very little code, great for rapid development."}, {"author_name": "Philip Reynolds", "gravatar_hash": "f090725d6eccf41624185526a5c4d1f9", "author_url": "http://www.brassy.net/", "date": "Apr 28, 2009", "message": "Anyone else think Steve sounds like Drew Carey?"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Apr 28, 2009", "message": "&gt;its use of symbols make it so expressive that you &gt;can do a lot in very little code, \n&gt;great for rapid development.\nThat's what they said about Perl!"}, {"author_name": "Kibbee", "gravatar_hash": "2b568071163c0d009635cfa63cf6e6ac", "author_url": "http://www.kibbee.ca", "date": "Apr 29, 2009", "message": "Hey Jeff, I think it's probably obligatory to link to my question, since you mentioned the running joke that the answer to everything is use JQuery.\n\nhttp://stackoverflow.com/questions/471597/is-jquery-always-the-answer"}, {"author_name": "wds", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "May 02, 2009", "message": "@Ville: Steve meant to say what software he has installed in addition to what was installed originally. Or more specifically, what user apps he has installed (as opposed to graphics drivers etc). So yeah, that's actually not that easy, probably you can just filter by category but there's a problem of package vs. application, since several package sometimes make an application, and all the libraries etc...\n\nActually the problem with firefox slowness is interesting. I've found it usually turns out to be a graphics issue. I'm no fan of the way X window system works and I don't think many people really are (except for when it comes to terminal clients, which is pretty easy in X). Firefox in particular, running on two different graphics cards you can notice huge differences in the performance just based on the graphics card and driver they're running."}, {"author_name": "amit", "gravatar_hash": "1649f70c1a1d97f794aaa1a4e1263c1c", "author_url": null, "date": "May 02, 2009", "message": "Excellent podcast. Great to hear Yegge talk about his project at google. Some great discussion on programming languages and unix that I liked very much.\nKeep it up Joel and Jeff, this has been probably the best podcast so far from you guys."}, {"author_name": "Ville Laurikari", "gravatar_hash": "6b75c51d2125affac45e4534a15d8070", "author_url": "http://laurikari.net/ville/", "date": "May 20, 2009", "message": "@wds: Yes, I can see that now.  I listened to that part of the postcast again and Steve clearly says \"what packages _you've_ installed\" and not \"what packages have been installed\".  I apologize.  My comment was the worst kind of incorrect: it was also rude."}, {"author_name": "HeavensRevenge", "gravatar_hash": "3de5190a89beda6ce4c0a2be077a56c9", "author_url": "http://toxprox.com", "date": "Jun 07, 2009", "message": "Hello, this was a damn good podcast, I'm being lured to the content into the next episode after each consecutive one.\n\nI kept hearing of your Haskell fear :P Even though I might not be that lone Haskell hatemail guy, I use haskell and It's my fav :).  And I'm happy we have many excellent JS (and XQuery Update) parsers and syntax compilers for Internal DSL's.  But I'm being sucked into the JS hole for a project I need to start but will be interfacing and parsing JS from Haskell almost exclusively.\nWell I'm Haskell Guy # 2 and I'm simply reading the ECMAs5 Draft to make sure theres no surprises for when I get my hands on Google's mythical JS compiler :) And until then I play with V8 checkouts. \nUntil next time."}, {"author_name": "Jeremy Banks", "gravatar_hash": "bd192f0a40308fe9ecb9aa2a72ee8d81", "author_url": null, "date": "Aug 29, 2011", "message": "Listening to this in the future is interesting, since <a href=\"http://code.google.com/closure/compiler/\" rel=\"nofollow\">Google's Closure Compiler</a> has been public for a while."}]}