{"response": [{"author_name": "1800 INFORMATION", "gravatar_hash": "acc637690f49e2b5a2146deb17874d6f", "author_url": null, "date": "Apr 09, 2009", "message": "I haven't listened to the podcast yet. I just had to remark on the two paragraphs on the one hand of wanting to discourage \"content stealing jerks\" and the fellows at cnprog, and then on the other hand encouraging users in other languages to create their own communities. Actually I see that there is no actual conflict, although on the other hand it is obvious that people with little ability in english will look at SO and want to copy it since it is such a great implementation and yet seems to have so little apparent support for questions in any language other than english.\n\nps. your captcha is getting really hard."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 09, 2009", "message": "You should really listen to the podcast before commenting on that. There's about 20-30 minutes on that single topic. I wish I was kidding."}, {"author_name": "1800 INFORMATION", "gravatar_hash": "acc637690f49e2b5a2146deb17874d6f", "author_url": null, "date": "Apr 09, 2009", "message": "I promise I will, and I'm not trying to say there actually is a conflict between the two paragraphs. I guess what I am trying to say (poorly) is that I can see why cnprog copied your design, although it wasn't an ideal thing to have done."}, {"author_name": "Mark Harrison", "gravatar_hash": "f79b395a801bf291b74e8bccea8e03f8", "author_url": null, "date": "Apr 09, 2009", "message": "I think there's not much risk in releasing the database.  There are just a couple of fields which would need to be scrubbed (email? what else?) since almost all the other data is available as text on the website.\n\nAre you concerned about releasing the voting information?"}, {"author_name": "1800 INFORMATION", "gravatar_hash": "acc637690f49e2b5a2146deb17874d6f", "author_url": null, "date": "Apr 09, 2009", "message": "I have to agree with Joel on the \"5 languages\" thing. Those 5 are the exact 5 we guarantee our own product is localised in. We have others with differing levels of support, but if you don't have French, Spanish, Chinese, Japanese and German then you just don't sell in those countries. I would go further and suggest that a Hindi localisation of SO would be the next on the list - from my anecdotal experience in SO it looks like a lot of indian programmers post there, and obviously we know there is a big industry."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Apr 09, 2009", "message": "@Jeff - you're wrong about language preference. I want to be a good English speaker because it helps allot learning and connecting with the community.\n\nBut ...\n\nI only read programming books in English if the native versions aren't available, I write my blog posts in Romanian, I'm highly active on local user groups. Most of my writing is in Romanian, most of my reading is in English still.\n\nProgrammers should be good at English, ... but ... that doesn't mean that they prefer English as their main communication language. \n\nEven in Romania if you enter a books store, 99% of \"programming\" books are translations, of the original books.\n\nFurthermore there are \"quite a few\", **programming** books written by Romanian authors. \n\nWe have to be good English speakers to be good programmers, that doesn't mean we prefer to speak English every time we do something programming related.\n\nAs always, very enjoyable podcast,\n\n      Cheers"}, {"author_name": "1800 INFORMATION", "gravatar_hash": "acc637690f49e2b5a2146deb17874d6f", "author_url": null, "date": "Apr 09, 2009", "message": "I have noticed there is a percentage of people that will post programming questions in say C++ and they have all of their comments, variable names and function names and so on in their own language. Clearly they are not thinking in english when they code, although it requires a superficial understanding of what the english meaning of the words like \"if\", \"while\" and so on mean, most of the time they don't need any english knowledge at all."}, {"author_name": "Dan", "gravatar_hash": "6c365385b6d0fd8b3489349038c9746c", "author_url": "http://blog.uncommons.org", "date": "Apr 09, 2009", "message": "<a href=\"http://www.damninteresting.com/?p=946\" rel=\"nofollow\">The Remarkable Pneumatic People-Mover</a>."}, {"author_name": "DrJokepu", "gravatar_hash": "973c6e2cf1ae9f6615dd883eb14597b1", "author_url": null, "date": "Apr 09, 2009", "message": "I think in English all the time when I code. Seeing comments or identifiers written in my native language confuses the hell out of me as it forces my brain to switch context from \"English\" to \"Non-English\" and then back to \"English\" all the time. Really annoying."}, {"author_name": "theman_on_vista", "gravatar_hash": "776fc61036a84f03601589ed7fba87b2", "author_url": null, "date": "Apr 09, 2009", "message": "thank you thank you thank you thank you!!"}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": "http://ashwin.zaatar.org/", "date": "Apr 09, 2009", "message": "Jeff, I agreed with your post that suggested English as the lingua franca of programming. While that is a good vision to aim for, I have to *strongly* agree with Joel on the language issue. I'm afraid your opinions are highly unrealistic in this regard.\n\nYou have to realize that most of the technical education in the developed/developing world now happens in English. Except that is, in these 4-5 countries (China, Japan, etc.). That is the real reason why folks from these countries will *always* prefer to read/study/learn/discuss about programming in their native language though they still program in English (of course). As Joel noted, *all* their university textbooks/papers are in their native language. Their written/virtual discussions at university/workplace with their peers all happens in their native language. And remember that they are by no means a minority (China remember?) And please do *not* call them second-tier programmers; some of the top engineering/programming folks/companies have originated from those countries.\n\nIndian programmers OTOH are not the same as Chinese/Japanese/etc. While Indians might (sometimes) have problems communicating in English, all our technical education happens in English. So, not only is English our programming lingua franca, we do not even have the right technical jargon to discuss programming in our native tongues.\n\nAnd yes, for whatever (valid) reason StackOverflow gives up on the programming community in those languages, it will difficult (or even impossible) to get it back later."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Apr 09, 2009", "message": "@1800 INFORMATION- from my own anecdotal experience, nearly all Indians that study computer science learn English.  I'm sure those who are Hindi speakers would appreciate a Hindi translation, but what I've gathered from many conversations with Indian programmers is that their culture sees English as a necessary skill in a high-tech career.  In contrast, I worked with a lot of French programmers at my last job, and they sometimes seemed annoyed if they had to communicate in English.  (And, in general, the French programmers' English was quite a bit worse than the Indian programmers').\n\nAgain, this is anecdotal and I can't claim it represents the whole culture of France or India.\n\nAlso, Hindi is spoken by less than half of the people in India (not sure what percentage of Indian *programmers* speak Hindi though)."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Apr 09, 2009", "message": "I'm splitting hairs, but Chinese is split into two main dialects, Mandarin and Cantonese.  Mandarin is spoken by more people worldwide and throughout most of mainland China.  Most places where Cantonese is the dominant dialect, like Hong Kong, you can make yourself understood if you only speak Mandarin.  If you're localizing your software for China, Mandarin is the language you want to target.  CNProg.com is a Mandarin language site."}, {"author_name": "Rob Teixeira", "gravatar_hash": "02ea93864875ce5027a322388720f375", "author_url": null, "date": "Apr 09, 2009", "message": "Here's my take on the Ultimate Language Question.\n\nI for one prefer to use English when programming. I tend to think in English a lot and so I am comfortable. Using English also gives me access to a lot more content out there (such as Stack Overflow.)\n\nAnd thus I will be the first to tell you that yes, programmers should learn English for their own good.\n\nHaving said that, now comes reality. Reality is that not everyone wants/can learn English. Even if they can and do learn English, I know plenty of people who still prefer to read and write in their own language. \n\nIn developing countries, it is really hard to learn English. It is usually expensive and time consuming and many (most?) programmers will not give this a very high priority, preferring other things, such as learning programming languages.\n\nOn the topic of \"but the keywords are in English\", truth be told, I know plenty of programmers who simply learn the keywords themselves for what they are: keywords. They don't necessarily -- and if fact seldom do -- know what the word actually means in English, they just know how to use them in code. They speak \"code\", not \"English keywords.\"\n\nOne final note of caution, Jeff -- you said in the podcast that you've read thousands of comments on the subject saying that English is important and all that. True. Just remember that whenever you're reading a comment, it's written by a member of the subset of programmers who happen to be able to read and write English. That should skew statistics a little bit."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl", "date": "Apr 09, 2009", "message": "I think what Jeff means is that the architect should have an advisory role, but shouldn't decide about technology. I think it all becomes more clear when you consider, that at every software company, the programmers are the ones who actually do what the company does, and everyone who isn't a programmer is there to help programmers do their work."}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": "http://ashwin.zaatar.org/", "date": "Apr 09, 2009", "message": "@Bill The Lizard: Mandarin and Cantonese are different dialects of Chinese (and there are many more dialects than those). They are entirely different spoken languages, but all Chinese dialects use the same written script. So, a Mandarin person cannot communicate with a Cantonese person verbally, but can write it down for him. And hence, unless your software is about audio, the different Chinese dialects hardly matter.\n\nNow, there are different versions of the written script which have evolved over time, but that's a different issue."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl", "date": "Apr 09, 2009", "message": "One more thing, if you're using a framework, you're outsourcing application architecture. "}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 09, 2009", "message": "@dan this is fascinating!\n\nhttp://www.damninteresting.com/?p=946\n\n> if you’re using a framework, you’re outsourcing application architecture. \n\nExcellent point, I never quite thought of it that way.."}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Apr 09, 2009", "message": "i think you could learn a couple of things from CNProg (or at least google's translation of it). i think the ask a question should be \"I would like to question.\" it's so much more descriptive of what i want to do!"}, {"author_name": "Martin", "gravatar_hash": "aa3657dc1c20c8ea33264155f8555f87", "author_url": null, "date": "Apr 09, 2009", "message": "Great podcast - I could tell because I spent a lot of it yelling \"Shut up, you're wrong, listen to him, you idiot\", though I won't say to whom that was addressed...\n\nI think one aspect of the cnprog issue that you may have missed is a cultural one. In Confucian tradition exact copying is a sign of respect, which is very different from how the West sees it. For them this probably didn't seem like piracy, rather it was a polite reimplemented copy of a respected model. I'm not saying that makes it right, just that the intention was firmly complementary."}, {"author_name": "Jin", "gravatar_hash": "70ad2c2830eb9a7753bd6312f3811e3e", "author_url": "http://www.8164.org", "date": "Apr 09, 2009", "message": "@Ashwin Nanjappa, Good explanation. However when it comes to written Chinese, there's simplified(used in Mainland) and traditional (used in Taiwan/HongKong). Most sites that supports Chinese also supports both written forms.(e.g. wiki, google)"}, {"author_name": "Donal", "gravatar_hash": "8b2d39a59a961ef26440e9c1453d1939", "author_url": null, "date": "Apr 09, 2009", "message": "@Jeff \n\nRegarding the language issue, you lost all credibility (on this topic) when you said that any programmer that doesn't have a good command of English is a \"second tier programmer\". I agree with you about the benefits of programmers having a lingua franca (English), but I totally oppose the notion that fluency in English is somehow a prerequisite for first-tier programming (whatever that is)."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Donal: I have to agree with you there. That was rather rude, arrogant, and actually a bit shocking.\n\nAnd English is my first and native language by the way."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "Shit, most people who are fluent in English can't even be considered third-tier programmers."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 09, 2009", "message": "...most people who are fluent in English, aren't..."}, {"author_name": "Marioh", "gravatar_hash": "b72399b9c538b7715b86d94f4db9e853", "author_url": "http://developeando.com", "date": "Apr 09, 2009", "message": "About the language thing, Joel it's right in this one.\nI write code in English but when i talk to my local community I use Spanish, because that's the language we like. \nIt is easy to write code in English, but it is more fun to talk in your on language when you are not coding (even if we are talking about requirements of an English program). \n\nJeff: you know that writing code (or reading documentation) it not the same as talking about programing.\n\nJoel: it is true, there is a lot of Spanish versions even if we denied (even in the same country) :) ."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Apr 09, 2009", "message": "About the language and localization. Joel is right on that one.\n\nHe's right in the sense that there are languages/countries where this applies... this is due to how it's been done through the years. But this does not apply to all countries (as joel states)\n\nIf i take Iceland for example (since I'm from there), is that you could not find an active user of Icelandic Windows even if you looked everywhere. Even though there exists an Icelandic version of Windows and the translation of it is good. (when I tried it)"}, {"author_name": "Bob Weber", "gravatar_hash": "46a44f7fced6ed193281a1247d5b7a3a", "author_url": "http://blog.alltheinfo.org", "date": "Apr 09, 2009", "message": "I have a comment to on the language thing.  One of the most brilliant software developers I have ever worked with was from China, here on a work visa.  He was educated in the US and had lived here a long time, but his english wasn't great.  \n\nHe would actually research problems and use a translation site to convert the conversations to Chinese so he could better understand what was being said.  He was definitely not a \"second tier programmer\" and eventually left us to move to California and work for Paypal.\n\nI don't disagree with the argument that Stack Overflow probably shouldn't focus on localization at this time, but Joel's point about programmers want to talk in their own language is supported by my limited anecdotal evidence."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 09, 2009", "message": "@Bob: I agree, I spent some time working on large programming problem in China with a bunch of Koreans. There were tons of language barriers, so we often ended up getting very creative with the whiteboard and drawing pictures and trying to communicate in C and psuedocode.\n\nI learned a lot on that project and a lot from the people I was around. I would certainly not say there were “second tier programmers”. \n\nIf that is someone's feeling, I suggest they get out an experience the world a little and meet some people."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 09, 2009", "message": "@Jeff Atwood\n\n&gt; @dan this is fascinating!\n&gt; http://www.damninteresting.com/?p=946\n\nGreat article; best quote:\n\n&gt; Ultimately, however, trucks proved more efficient at information-moving than the series of tubes."}, {"author_name": "David Seruyange", "gravatar_hash": "880fe2226a83569aa89f46da05268fc8", "author_url": "http://metadeveloper.blogspot.com", "date": "Apr 09, 2009", "message": "Atwood's assertion that top tier programmers are english oriented is wrong. It reminds me of how my parents (who speak pristine English with accents) have to deal with churlish Americans who raise their voices and slow their speech down at people they perceive to be less intelligent because of a language barrier. \n\nWith that said, I think Jeff is right in that by copying they pose a limited threat to StackOverflow. Allow them to meet the needs of their community since getting a multilingual version of anything is incredibly difficult."}, {"author_name": "Mr. Shiny &amp; New", "gravatar_hash": "d78a43ac94c1c0d6cf5740efd7574928", "author_url": "http://eternalephemeron.blogspot.com", "date": "Apr 09, 2009", "message": "I think it's a little odd that Joel doesn't consider Linus Torvalds to be the architect of Linux.  The architecture of a program involves more than just the user interface (in the case of a kernel, the API/ABI); in the case of the Linux kernel there is a significant \"architecture\" which is apparent to anyone who looks at the code.  Many high level design decisions represent the architecture, such as the filesystem layer (VFS) which allows you to plug in filesystem drivers.  Implementing a filesystem is a job for a programmer; designing the VFS is the job for the architect.  Joel is partially right in that some of the requirements for the VFS were derived from Minix (or more accurately Posix), but Linus didn't recreate Minix.  Example of an architecture decision: using a microkernel or a monolithic kernel.  Linus made all the early architecture decisions (since he was the only developer).  As new developers came along some of them also made architectural decisions, and now there are many people who fulfill the role.\n\nRemember: there is a difference between a role and the person who does that role.  And the architecture role (high level design, technology choices, etc) is a real role.  Every project has someone making these decisions.  Some teams have people who only make these kinds of decisions; they are \"architects\".  Many of those people lose sight of reality because they are in an architect-distortion-field.  But every real project needs an architecture.  Just not necessarily a full-time architect."}, {"author_name": "Teddy", "gravatar_hash": "9da7760aff44cf48d181611a34de5009", "author_url": null, "date": "Apr 09, 2009", "message": "@Jeff&gt; Have you ever taken the time to think that you, being American and reading in English, are bound to find similar viewpoints? Are you expecting to find everyone advocating Chinese(to be a good programmer) on an English speaking website? \n \nI have not always agreed with your opinion but this has to be, by far, the dumbest most closed minded thing I have ever heard you say. There are lots of good programmers around the world that do not speak any English. If you got out and explored the world you might stop being the \"Ugly American\" that the world loves to hate...."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 09, 2009", "message": "The first 20 minutes or so of this podcast are infuriating.  Jeff: go back and listen to Joel.  He's 100% right!\n\nWhen I was picking a language to learn in high school I picked German, since it was (at the time) the lingua franca of science and engineering.  (Incidentally, I understand that English has subsequently replaced it.)  But after a semester, I realized that was a stupid reason.  Nobody I knew spoke German, but some people did speak Spanish, so I switched.  Now I know a lot of people who speak Spanish and I still can't think of a time when German would have been useful even though I work in science and engineering.\n\nMy point is you can't force people to use a language because it's the lingua franca of a field.  Obviously good German programmers will learn (and already know) English.  But I bet they speak German in their jobs and will answer questions in whatever language they are asked.\n\nI bet every native Japanese-, Chinese-, German-, Spanish-, French-, and Swahili-speaking programmer who hears this podcast will wonder if it would be all that hard to implement Stack Overflow in their language.  If you could get voting + Wiki + reputation + tagging working and could round up enough users to get critical mass, you could lock up a market for years.  You wouldn't even need to implement bounties.\n\nAnd when Swahili becomes the lingua franca of programming, you'll be out of luck.  ;-)\n\nWith that out of my system, maybe I can listen to the last 40 minutes."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 09, 2009", "message": "Mr. Shiny beat me to the punch on Minix.  Under the hood Linux and Minix are almost totally dissimilar.  Linux uses a standard monolithic kernel, while Minix has a microkernel with message passing between processes.  Tanenbaum and Torvalds had a big argument on Usenet over the relative merits of the two approaches back in the early '90s.\n\nThat said, Linux clearly inherited quite a bit of it's architecture from it's *nix forebearers.  It's just that these were more mainline Unixes of the day like BSD and System V"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 09, 2009", "message": "Jeff: you're killing me!  KVMs (or equivalent) on a server are optional in exactly the same way a mouse is optional on a desktop."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 09, 2009", "message": "> I totally oppose the notion that fluency in English is somehow a prerequisite for first-tier programming (whatever that is).\n\nFair enough. Can you point to examples of famous / accomplished programmers who do not write in English?\n\n> I have to agree with Joel on the “5 languages” thing. Those 5 are the exact 5 we guarantee our own product is localised in\n\nIt's interesting that Joel took this position when FogBugz isn't even localized into those languages. It's a broader \"product\" than Stack Overflow, as FogBugz is intended for product managers and users and other non-technical users, whereas SO is programmer-only.\n\n> Obviously good German programmers will learn (and already know) English.\n\nWell, compare how many users cnprog has (5 pages, so maybe 200) with how many users Stack Overflow has (50,000+).\n\nI'll go back to my vb.net example: I switched to the more prevalent language, c#, because it was inefficient not to. And any good programmer eventually realizes the same thing.\n\nAnd my general point had more to do with focus than anything else: do we want to deliver a product in 5 different languages poorly, or 1 language -- the primary language -- extremely well?"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Apr 09, 2009", "message": "Comparing the user lists of the two sites is wrong on so many levels."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 09, 2009", "message": "@Jeff: I can't comment on whether or not your decision to focus on the English-only market is good or bad.  Only you guys can know.\n\nBut I think most of us are in violent disagreement with the idea you seem to have that other markets are too small or not worth serving.  You are clearly looking in the wrong place if you looking at a Stack Overflow-like site in Chinese for evidence.  Try looking for evidence in mailing-lists, Usenet, web forums, etc.  Or ask a programmer who speaks Chinese."}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": "http://ashwin.zaatar.org/", "date": "Apr 09, 2009", "message": "&gt; Can you point to examples of famous / accomplished programmers who do not write in English?\n\nYukihiro Matsumoto, the creator of Ruby. He speaks/writes in English now, but that is several years after Ruby got popular in the Western world.\n\n&gt; Well, compare how many users cnprog has (5 pages, so maybe 200) with how many users Stack Overflow has (50,000+).\n\nJeff, I'm sad to say this, but your arguments today are just absurd! You are challenging the debate of languages by comparing SO pagecount with that of a new Chinese copy that even no one in the Chinese world might've heard? Shouldn't CNProg or any other SO copy be given some time (the same time that SO took) before you can compare them like this?!\n\n&gt; I switched to the more prevalent language, c#, because it was inefficient not to. And any good programmer eventually realizes the same thing.\n\nSorry to pop your bubble, languages people speak are *not* like languages people program in (no matter the similarities). Heck, English isn't even the most spoken language, it's Mandarin and even that is not going to change any soon. Please, please, please, just buy a ticket to Japan/China, drop in there for a day, have a look around and talk to the people."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 09, 2009", "message": "&gt; Fair enough. Can you point to examples of famous / accomplished programmers who do not write in English?\n\nEver since Alan Key posted on Stack Overflow, I've felt like an auto mechanic crashing the Nobel Prize.  Somehow I don't think Yukihiro Matsumoto will drop by anytime soon."}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Apr 09, 2009", "message": "Jeff, great point about the C# switch from VB.Net."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 09, 2009", "message": "&gt; Fair enough. Can you point to examples of famous / accomplished programmers who do not write in English?\n\nOk.  Now I'm really worked up about this.  Japan obviously has a ton of brilliant programmers toiling away in the obscurity of companies like Nintendo, Sony, Canon, Toyota, Honda, and so on.  I highly doubt that more than 1% of their work is in English.  And what we see in the US is just scratching the surface.  There's just no way to know who they are because they don't have a footprint in the places us English speakers look.\n\nChina probably has the same \"handicap\".\n\nNow I'm going to cool off by reading Steve Yegge's latest essay: \"Have you ever legalized marijuana?\""}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 09, 2009", "message": "> Yukihiro Matsumoto, the creator of Ruby. He speaks/writes in English now, but that is several years after Ruby got popular in the Western world.\n\nBut isn't Ruby's relevance 100% attributable to its western adoption and western evangelizing? Was Japan churning out trillions of lines of Ruby code all these years and nobody noticed?\n\n> Comparing the user lists of the two sites is wrong on so many levels.\n\nWhat other data should we be looking at? Are there existing foreign language programming sites with massive amounts of traffic?\n\nIs the audience of non-English speaking programmers being <i>so radically underserved</i> we should stop development work on the English versions of stackoverflow.com and serverfault.com , and spend the next 6 months localizing the software into the five recommended languages?\n\n> the idea you seem to have that other markets are too small or not worth serving\n\nWhere did I say that? These markets are just not worth serving by *us*, at least not in the next 2 years."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Apr 09, 2009", "message": "Exactly how difficult is it to localise SO?\nThere are only about 100 words used in the interface, then all you have to do is clone the server and register stackoverfow.de.\nAfterall the users supply the content."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 09, 2009", "message": "@mgb: As they mentioned on the podcast, a localized version may also require different features, to accommodate a different audience.  There's probably a lot of research and experimentation to figure out what those different features are.  For Japanese and Chinese, there would probably be a lot of work associated with the different character sets.  Not to mention repeating all the community building effort Jeff and Joel have put into it."}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": "http://ashwin.zaatar.org/", "date": "Apr 09, 2009", "message": "&gt; But isn’t Ruby’s relevance 100% attributable to its western adoption and western evangelizing? Was Japan churning out trillions of lines of Ruby code all these years and nobody noticed?\n\nThat is not what I was (at least) talking about. Top notch programmers in those languages exist and they cannot be called \"second tier\" just because they do not use English as their preferred medium of communication.\n\n&gt; Is the audience of non-English speaking programmers being so radically underserved we should stop development work on the English versions of stackoverflow.com and serverfault.com , and spend the next 6 months localizing the software into the five recommended languages?\n\nAs Joel clearly pointed out, this is a decision for you folks. As he explained using the eBay clone of NZ as an example, SO/SF clones will appear in these languages (a good idea cannot not be copied), gain critical mass and later SO/SF cannot go into these communities and gain them back. SO is your baby, so as long as you folks are aware of this and are okay with it, then there is no contention."}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": "http://ashwin.zaatar.org/", "date": "Apr 09, 2009", "message": "@mgb: Localizing SO/SF is a decision left to Jeff and Joel. But, it is an interesting problem.\n\nSO is built by the community and is wiki-like. Maybe wiki-like features can be used for multi-language support too. Every programming question/reply could have a \"translate\" button on it. If there is a Chinese programmer with a passing knowledge of English he could click it and translate that question into Chinese so that it helps his brethren. That would automatically make a CN copy of the question/reply into cn.stackoverflow.com. The question/reply with multiple translations could be linked to each other and this link can be visually displayed by showing a list of its translated versions below it: CN-JP-EN. All in all, Wikipedia already has this multi-language problem solved, SO/SF could take inspiration from that."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 09, 2009", "message": "> As he explained using the eBay clone of NZ as an example, SO/SF clones will appear in these languages (a good idea cannot not be copied), gain critical mass and later SO/SF cannot go into these communities and gain them back.\n\n1) ebay is a zillion dollar business trying to be a trazillion dollar business. What a terrible, terrible problem to have..\n\n2) it's a bad example because eBay is predicated on shipping costs / times and thus locality is hugely important. Programmers don't care where they live because they are citizens of cyberspace.\n\n3) Ebay audience != programmers\n\n4) English is the lingua franca of programming, and thus the most important priority by far. If we lose focus and fail to serve our primary audience as well as we possibly can, that will hurt us far more than failure to localize into elbonian."}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": "http://ashwin.zaatar.org/", "date": "Apr 09, 2009", "message": "@Chris: I don't see a problem with the character sets as long as everything is being dealt in Unicode. (I am not the right person to comment about the social software aspect though.) Also, SO might be a golden opportunity to form a truly global programming community breaking across these traditional language barriers. We all have the same programming problems and we all surely have much to learn from each other. And who knows, there might very well be a Chinese Jon Skeet out there! ;-)"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 09, 2009", "message": "@Ashwin: It's a little more complicated then just replacing a bunch of unicode strings.  Text areas and buttons will be to small or too large.  The WMD Markdown editor would probably have to be rewritten or replaced, etc."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 09, 2009", "message": "&gt;&gt; the idea you seem to have that other markets are too small or not worth serving\n\n&gt; Where did I say that? These markets are just not worth serving by *us*, at least not in the next 2 years.\n\nThat's why I said \"seem\".  And I get the impression from all the dismissive comments you make about programmers who would prefer to not communicate in English.  \n\nYou don't need to convince *us* that you shouldn't start a Stack Overflow for Elbonian.  If you have to chose one language, English is the right choice in every way.  That's the only argument you need.  It's the other arguments that leave you open to misinterpretation.\n\n&gt; Was Japan churning out trillions of lines of Ruby code all these years and nobody noticed?\n\nDraw your own conclusions: \n\nhttp://www.linuxdevcenter.com/pub/a/linux/2001/11/29/ruby.html\n\nBut more importantly, why does it matter?  Japan is churning out trillions of lines of code now.  This line of argument isn't helping your case."}, {"author_name": "nign", "gravatar_hash": "6b660c4a7fd570a46e6d25d7424bb97e", "author_url": null, "date": "Apr 09, 2009", "message": "I think it's unfortunate that Jeff decided to drag the language issue into a simple case of blatant plagiarism. What CNProg has done is wrong because it's wrong to pass someone else's work as one's own, not because there are a bunch of programmers who aren't fluent in English. The fact that the theft doesn't help with making the world respect China more probably means more to the CNProg people than their compatriots' lack of English proficiency.  \n\nGiven how people are taught there and the absence of a general grasp of the idea of \"plagiarism,\" you probably have to first explain to them what plagiarism is and why it is bad and how they're doing a great job earning Chinese programmers a bad name. This may sound weird, but in an education system that emphasizes rote learning above all else, copying the work of people better than you to the point of being able to memorize and reproduce exactly is often seen as an intellectual virtue. \n\nWhile it's true that because of America's status as the leader in computer science and various other factors that English has been the lingua franca of programming and of the internet, it's not true that you must know English to be a good programmer. I know an elite programmer with a 200 I.Q. in his early 40s who simply can't cope with English. The ability to learn a new natural language is not the same as the ability to learn a new coding language, if only because natural languages are so much messier and richer than computer codes. Try and learn Chinese or Japanese while living in the US full time and see how far you can go in four years. Given how different these two languages are from English, you won't go very far, I guarantee you. ;)\n\nBeing able to read English programming book also is not the same as being able to pose a question properly in English; you can guess what it means without really understanding the grammar in the former case, but to actually \"produce\" something yourself you do need to know the language. I have a friend who has translated several O'Reilly books yet can't even write a simple present tense sentence correctly. This means that there are probably a bunch of StackOverflow readers who use the site regularly but are unable to really \"use\" it when they need a question answered because they are afraid of making a fool of themselves publicly with lousy English.\n\nJust try not to mix these two things together. They are wrong because what they're doing is wrong, and that's all there is."}, {"author_name": "nign", "gravatar_hash": "6b660c4a7fd570a46e6d25d7424bb97e", "author_url": null, "date": "Apr 09, 2009", "message": "Oh, and a few guesses at why people wouldn't admit they aren't good at English:\n\n1) Schools in non-English-speaking countries generally start making English part of the regular curriculum no later than middle school, which means that by the time you meet them, they've been learning and using English for at least a decade in most cases. Admitting that you've been learning something for over a decade yet doesn't really know it hurts. And my guess is the people you talk to usually have done very well in school and got very good marks on their school English exams, which makes that admittance so much more hurtful to their pride. \n\n2) There's usually a lot of prestige attached to knowing the language of the most powerful nation in the world. This doesn't mean that non-English speakers outside the US have inferiority complex regarding their own language. It just means that they get a higher place on the local social hierarchy if they are good at English. Knowing a bit of English and refusing to admit that you only know a bit of it can often take you very far locally, which makes the refusal to admit a habit.\n\nP.S. I'm perhaps among the handful of your regular listeners who can't code. I just find your conversations hugely entertaining. What I've said is what I've observed locally, which may or may not apply in other cases."}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": "http://ashwin.zaatar.org/", "date": "Apr 10, 2009", "message": "&gt; it’s a bad example because eBay is predicated on shipping costs / times and thus locality is hugely important. Programmers don’t care where they live because they are citizens of cyberspace.\n\nAll netizens are global and local residents at the same time, i.e., they do have \"locality\". You and me would not find hanging out at a Chinese online forum fun, because we would not understand what the heck they are discussing.\n\n&gt; English is the lingua franca of programming, and thus the most important priority by far. If we lose focus and fail to serve our primary audience as well as we possibly can, that will hurt us far more than failure to localize into elbonian.\n\nPriorities are very important. I do not think either me or anyone here said that the scarce resources of SO/SF should be immediately diverted to localization.\n\nThe point of discussion has been that there are huge communities of non-English programmers, that this scenario will not change in the immediate future and calling them second-tier programmers just because of their predilection to their native tongues is not only not right, but could be seen as disrespectful."}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": "http://ashwin.zaatar.org/", "date": "Apr 10, 2009", "message": "@Jeff:\n\n&gt; What other data should we be looking at? Are there existing foreign language programming sites with massive amounts of traffic?\n\nI asked my Chinese friend and one popular programming website in that language seems to be CSDN.net:\nhttp://en.wikipedia.org/wiki/CSDN\nhttp://community.csdn.net/\n\nStarted in 2004, CSDN now has ~1.3M registered users. There should an equally popular service in Japanese, given their predilection for their language."}, {"author_name": "Static", "gravatar_hash": "a802a4d7130cf412df35f6d1a3a9a601", "author_url": null, "date": "Apr 10, 2009", "message": "&gt;But isn’t Ruby’s relevance 100% attributable to its western adoption and western evangelizing? Was Japan churning out trillions of lines of Ruby code all these years and nobody noticed?\n\n@Jeff Ruby became popular because of Rails and not because western adoption. The fact you think \"Nobody\" noticed doesn't surprise me. Who is nobody? The Japanese noticed because they where the ones churning out the code. Nobody must obviously being the Japanese in this case.\n\n@Jeff For the record I don't care if stackoverflow is developed in other languages. I just want you to stop trying to defend your belief that all programmers that don't speak English are not as good as the ones that do."}, {"author_name": "Steve Holmes", "gravatar_hash": "d607f119e8d6ce52f35aa24424a9c5a9", "author_url": null, "date": "Apr 10, 2009", "message": "Listening to the first 20 minutes of this is like watching a horror movie...stay with me on this :)\n\nYou know the kind of movie where there is a bogeyman terrorising the village, well listening to Jeff was like watching your favourite character in the movie hear some creepy noise coming from the basement and instead of seeing sense and getting out he opens the basement door (\"don't do that Jeff!!\"), there is no light so he goes and gets a candle - which you know will blow out - (\"Jeff nooo!!!\") and runs down the steps with a pair of nail-scissors in his hand! (\"Oh My God!!\")\n\nLocalise dude! It won't take you anywhere near 6 months and it won't be half as scary. :)"}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": "http://ashwin.zaatar.org/", "date": "Apr 10, 2009", "message": "@Jin: The Traditional and Simplified Chinese scripts are the evolved scripts I mentioned."}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": "http://ashwin.zaatar.org/", "date": "Apr 10, 2009", "message": "@Chris: About the WMD editor, CNProg seems to be using the same one as SO and it seems to work fine with Chinese-English text ;-)"}, {"author_name": "Mike Chen", "gravatar_hash": "8c1efc4f4618aa68b18c88f2bcaa5564", "author_url": null, "date": "Apr 10, 2009", "message": "&gt; What CNProg has done is wrong because it’s wrong to pass someone else’s work as one’s own, not because there are a bunch of programmers who aren’t fluent in English... \n\n@nign, I totally disagree with your assertion. \nFrom the first minute, we decided to build a different community website, which would be desired to help more Chinese developers by providing more professional and dedicated spirits. I said the whole reason why we create cnprog in our first blog, and why SO is the best model for us to use.\n\nAfter Jeff told me they didn't plan to localize SO in China, I developed cnprog in python and made it open source with my firend during last Christmas and new year holidays. Because none of us is good at UI design, and when we follow the original system functions, we keep all UI styles all the time. From early of March, I began to build new interface for beta2, but before cnprog has been discovered by western world, it hadn't been finished yet and CNProg was still in beta1 testing within limited friends. \n\nDuring the whole event of copying SO thing, we have kept silence all the time. Because I don't care western people call me \"thief\", as long as through cnprog, we do give a new opportunity to help Chinese developers. Our serving users are Chinese. But don't get me wrong, I do have regrets from this, and the only one is I feel sorry to make people get confused between SO and cnprog. And the same time, I do think there is gap between western and eastern world-languages, cultures, and the variance from this podcast is one of the best proves. So I didn't say anything when I saw many critical comments and unreasonable tease, but did our best to update whole website with new UI ASAP.\n\nBut now, more western people are considering we are evil to bring cnprog up, and they think the existence of cnprog is a shame for Chinese developers. And even worse, some Chinese developers without any observation, they begin to believe all these negative judgement. That's the worst thing for us and cnprog, maybe it's ok for me without your respect but cnprog needs. There needs somebody stand up and let others know. Otherwise, we'd rather to stop and stay away. I just hope people can asky why before they give quick assertion and be able to see forest as well as trees."}, {"author_name": "Mike Chen", "gravatar_hash": "8c1efc4f4618aa68b18c88f2bcaa5564", "author_url": null, "date": "Apr 10, 2009", "message": "&gt;Started in 2004, CSDN now has ~1.3M registered users. There should an equally popular service in Japanese, given their predilection for their language.\n\n@Ashwin, that's right-CSDN is one of the most popular technical community websites in China. Actually, current statistics are even further away from you gave. Live figures can get from its site, when you visit http://community.csdn.net/HomePage.aspx, you can see both registered users and questions are more than 6 million. But as I said in my first blog on cnprog, developers can gain benefit from CSDN are too less.\n\nBack to the quotes Joel used in podcast, I also referred same example of books and book stores in Jeff's ugly American post.  The most popular category of technical books in China, are all these Chinese-translated English books. There is no doubt average Chinese developers are not good at English, and they are willing to pick and read Chinese books first. And the same as websites, which also applies to SO. I tried to find how many developers population in China, but I couldn't, and I'm afraid the figures increase more rapidly than the way to calculate it."}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": "http://ashwin.zaatar.org/", "date": "Apr 10, 2009", "message": "@Mike Chen: Thanks for responding on this podcast. Please do not take the harsh comment folks seem to be doling out at CNProg too seriously. It is commendable that you folks developed a site to help your community of developers (for free that too). In fact, you folks went a step ahead of StackOverflow by releasing the CNProg code as opensource here:\nhttp://code.google.com/p/cnprog/\n\nWoah! The latest statistics of CSDN are mindboggling!!! :-)\n\nMembers: 6,451,229\nPosts: 6,110,784\nReplies: 46,267,318"}, {"author_name": "jmcecil", "gravatar_hash": "c208509e12211c8678e96997f7f11cfd", "author_url": "http://jmcecil.blogspot.com", "date": "Apr 10, 2009", "message": "As many have pointed out StackOverflow has two communcity issues.\n\n1) Code - I agree with Jeff on this. Code is English and most programmers in the world learn English \"CODE\"\n\n2) Discussion about code - Joel is right about this.  People need to discuss in the language that they have the deepest capability in.\n\nWhat Joel was saying is if you don't support the big languages, someone else will beat you to supporting those markets.  You might even find the code on the sites is in English, but the discussion will be in whatever local language."}, {"author_name": "Matthew Morgan", "gravatar_hash": "fbd3e5cc0b7dd5648f43d49719d2f4a8", "author_url": null, "date": "Apr 10, 2009", "message": "Banks didn't USED TO have pneumatic tubes.  Banks HAVE pneumatic tubes.  ;)"}, {"author_name": "nign", "gravatar_hash": "6b660c4a7fd570a46e6d25d7424bb97e", "author_url": null, "date": "Apr 10, 2009", "message": "@Mike Chen\n\nNot being good at UI design isn't sufficient excuse to steal, i.e. copying in full with permission or consent, somebody else's UI, just as not being good at one test subject is no reason to cheat on a test.\n\nIf the sole reason you decided to \"use\" SO's UI is that you thought it's the greatest, shouldn't you have asked Joel and Jeff to give their blessings first? If you already knew that others would call you thieves if they find out you've plagiarized OS's UI in full and have therefore kept quiet about your beta, then you definitely knew that people, not just WESTERN people (I'm not \"Western,\" btw), would still call you thieves when you go public. \n\nHaving one's work copied slavishly is not flattery to anyone who has a good idea of the value of creativity or a sense of what copyright is."}, {"author_name": "nign", "gravatar_hash": "6b660c4a7fd570a46e6d25d7424bb97e", "author_url": null, "date": "Apr 10, 2009", "message": "Ooops, got to fix that:\ncopying in full WITHOUT permission or consent\n\nI do feel that Mr. Chen's reply more or less proved my assumption that the people behind CNProg don't quite know what plagiarism means in full."}, {"author_name": "nign", "gravatar_hash": "6b660c4a7fd570a46e6d25d7424bb97e", "author_url": null, "date": "Apr 10, 2009", "message": "A few words on localization: \n\nGlobalization means that at least the most educated bunch in all countries now more or less think and act alike. Many SNS now just do multilingual interface and, for what I've seen over the years, people are pretty ok with that. (Plurk is no less fun in other languages. My friends and I actually switch between language interfaces to practice our 3rd &amp; 4th language skills.) I don't think you need to worry too much about the implications of cultural differences, esp. since StackOverflow is aimed at programmers, which means that pretty much all of your potential users have used a lot of English sites and are well acclimated, if not accustomed, to the logic behind them. I actually don't find locally grown Web 2.0 sites that much different from global sites with multilingual interface. The real difference generally lies in the content, not in the way the sites attempt to structure user behavior."}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Apr 10, 2009", "message": "Jeff: Stop digging. It's amazing how arrogant and ignorant you are being, asserting over and over again that because you've never heard of any great programmers who don't speak English, all great programmers must speak English. There's actually a lot of good reasons why you might not localize Stack Overflow in the short or medium terms, but the complete lameness of Japanese, Chinese, Spanish, and German programmers should not be one of them."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Apr 10, 2009", "message": "Actually great programmers are the ones that need stackoverflow the least. Stackoverflow is not about great programmers, but about all programmers. So even if great programmers speak English they are a fraction of the community, the rest may not speak English.\n\nIS stackoverflow business model centered around 10K+ rep users? don't think so."}, {"author_name": "nign", "gravatar_hash": "6b660c4a7fd570a46e6d25d7424bb97e", "author_url": null, "date": "Apr 10, 2009", "message": "An earnest suggestion to Mr. Chen and the CNProg team:\n\nBe kind to yourselves and other Chinese nationals and put your site on hiatus and develop your own UI. You're called thieves and will continue to be called thieves as long as you keep using StackOverflow's UI. It wouldn't help if you say that Joel and Jeff are your idols and you think SO's UI is the best in the world ever and that it's because you think they're so brilliant that you're using the UI they created. You probably already knew that Joel and Jeff intend on making it a commercial enterprise, which is why they took the time to develop the UI, and your action is in effect taking a free ride, which in turn means that you think their work is worth nothing, since you obviously aren't willing to pay for it, and does that seem like saying you think their work is great? I don't think so. And since you didn't even have the courtesy to give them the hat tip in your \"why we created the site etc. etc.,\" that doesn't show much appreciation either.\n\nReally, be kind to yourselves and stop doing this. It's not making you look good, and given how much ill repute Chinese nationals have garnered for knocking off other people's work, what you're doing isn't making things better or earning you and your people more international respect. If you have the brain to come up with the backroom mechanisms, you should be smart enough to generate your own front-end stuff too. It seems that the reason you aren't doing that is because you simply don't want to take the time to do that, because, well, it takes time, and that only makes you seem lazy, aside from other things.\n\nBe kind to yourselves, really."}, {"author_name": "nign", "gravatar_hash": "6b660c4a7fd570a46e6d25d7424bb97e", "author_url": null, "date": "Apr 10, 2009", "message": "Concurring with Chris.\n\nNote to Jeff: Be sensitive to what you say. Your podcast has a very international audience. What you said implies that because programmers who are native English speakers are good at English (if they haven't got the perfect grammar, at least their English skill passes the usability test anyway), they're automatically in the \"first tier\" rank, since it's only second and third tier programmers who can't handle English. \n\nYou probably don't think you think that way, but it comes out like that anyway."}, {"author_name": "sth", "gravatar_hash": "92fb4563ddc5ceeaa8b19b60a7a172f4", "author_url": null, "date": "Apr 10, 2009", "message": "@nign:\ncnprog already has it's own UI since a few days."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 10, 2009", "message": "What Pop Catalin said. \n\nI totally understand if you guys just don't have the time or resources to do multi-lingual at this point. I'd understand a reluctance to risk balkanizing the existing site. \n\nHeck, i'd even agree with a desire to promote the use of English in some small way by forcing mediocre programmers to learn it in order to take advantage of SO... ;-)\n\nBut don't blow it off as unimportant 'cause really good programmers will like English better anyway - making a site for only the best programmers was never the goal for SO!"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 10, 2009", "message": "I think a lot of people are misunderstanding what Jeff means when he talks about English skills and great programmers are misunderstanding what he means.  Jeff repeated his favorite Joel Spolsky quote in a recent blog post:\n\"The difference between a tolerable programmer and a great programmer is not how many programming languages they know, and it’s not whether they prefer Python or Java. It’s whether they can communicate their ideas.\"\n\nThis is not necessarily about programming skill.  It's about being able to communicate your ideas to as broad an audience as possible."}, {"author_name": "Purslane", "gravatar_hash": "2acda5365ade04b5964de0502116a037", "author_url": null, "date": "Apr 10, 2009", "message": "I wonder why you licensed Stack Overflow under a Creative Commons license? Is that mentioned in the podcast? (I cannot listen to that now)."}, {"author_name": "PS", "gravatar_hash": "b4bc950c2b34d6a9ab0aa740a5155430", "author_url": null, "date": "Apr 10, 2009", "message": "I understand that it wouldn't be worth it to you to localize SO.  But your argument that this is because only second-tier programmers aren't fluent in English seems silly.\n\nFirst because, I agree with Joel that sometimes people want to discuss things in their first language whether or not they are fluent in a second language.  \n\nAnd second, because I didn't think this site was primarily for \"first-tier\" programmers.  I specifically remember listening to one of the early podcasts where y'all discussed that beginner programming questions would be encouraged, that you wanted SO to be the go to place for all programming questions.  There are beginner programmers all over the world who might not have had time to perfect their English yet.\n\nI know you can't be all things to all people, and that's a valid point for keeping the site English-only.  But all this first-tier/second-tier stuff is rubbish."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 10, 2009", "message": "Thinking about Steve Yegge’s latest essay and localization, I think I see why Jeff is digging in his heels on this.  It's easy for someone to say, \"Why not localize?  It'll only take 6 to 8 weeks.\"  But we haven't really thought through all the issues.  Adding Chinese overnight would be a nightmare.\n\nOn the other hand, there are sites that have localized successfully in stages.  The best example I've seen is http://www.librarything.com/ which added new languages and gave users the power to edit most of the text on the site.  The users do all the work.  The various languages are in various stages of completeness and you still see English strings even on the most completely translated pages.  But there's enough localization that a person who speaks no English could probably keep track of their own books without too much trouble.\n\nTo reiterate: us users are not in the place to decide if the time and effort to localize Stack Overflow is well spent.  As the decision seems to have already been made, I wish Mike Chen (and other followers) the best of luck.  It sounds like you have a couple-year's head start."}, {"author_name": "McDowell", "gravatar_hash": "9061706d2661cf0fa9f2df0eee56cf9b", "author_url": "http://stackoverflow.com/users/304/mcdowell", "date": "Apr 10, 2009", "message": "To be honest, I find the \"2nd tier\" stuff a distraction from what is an interesting problem.\n\nAt heart is the decision of how to grow the company. Should they become more global, expanding into other territories, or branch out to cover new subject domains in a single language? Jeff's current approach is to broaden the categories which SO covers. Joel points out that ignoring foreign markets now means surrendering them to other parties. While the I18N process is easier now than it has ever been, that doesn't make it trivial, or cheap. It is also at odds with Jeff's development approach, because it necessarily means surrendering quite a big of site control early in the business' life. A bigger problem I see is building foreign advertising support. IT and programming have overlapping interests for his existing customers. It may also mean diluting the audience too early - would you go off and be a bigger fish in a smaller pond?\n\nI wonder if a franchise approach to foreign markets might not be more profitable and less risky. That wouldn't be cheap either (in terms of effort) - at least, not in the short term."}, {"author_name": "grieve", "gravatar_hash": "b6846c76073e26cfdb1e0dc4ab8fd5db", "author_url": null, "date": "Apr 10, 2009", "message": "@Jeff: \n\n&gt; Fair enough. Can you point to examples of famous /\n&gt; accomplished programmers who do not write in English?\n\nHave you stopped to consider that you may not know any accomplished programmers who don't speak English, since you only know English?"}, {"author_name": "Purslane", "gravatar_hash": "2acda5365ade04b5964de0502116a037", "author_url": null, "date": "Apr 10, 2009", "message": "\"Fair enough. Can you point to examples of famous / accomplished programmers who do not write in English?\"\n\nEdsger W. Dijkstra wrote most of his articles in English, but also wrote in Dutch. One example is his \"algorithme ter voorkoming van de dodelijke omarming\" (algorithm for the prevention of the deadly embrace)"}, {"author_name": "Purslane", "gravatar_hash": "2acda5365ade04b5964de0502116a037", "author_url": null, "date": "Apr 10, 2009", "message": "Dijkstra's articles really are timeless by the way and I am glad that your ridiculous arguments made me think of them again. I just read this gem (EWD-194), and was quite shocked that this was written more than 40 years ago:\n\n\"Heden is het nog niet ongebruikelijk, dat grote programma's min of meer op de bonnefooi gemaakt worden en dan aan enige willekeurig gekozen testgevallen worden onderworpen om althans de grofste blunders aan het licht te brengen en —zij het vaak ten koste van veel machinetij— te localiseren. En zulke programma's gaan daarna als \"geteste programma's\" de wereld in! Maar het moment lijkt nabij, waarop een dergelijke manier van werken met recht dilletantisme genoemd mag en ook zal worden.\""}, {"author_name": "sth", "gravatar_hash": "92fb4563ddc5ceeaa8b19b60a7a172f4", "author_url": null, "date": "Apr 10, 2009", "message": "Obviously it's easier to explain a complicated problem and compare the subtile advanges of different solutions in a language where you are sure how to express all the things you want to say. The better you know the language, the easier it is to produce clear questions and answers. And since most people know their mother tongue the best, they like to use it to talk to others. That's not different when the topic is programming than if it would be anything else.\n\nAlso, there's a big difference between being able to understand some English documentation and being able to produce a well written English question that will help to solve your problem. It most certainly will take you longer then to just write the question in your native language.\n\nAdditionally all this \"the keywords are in English\" is a completely stupid argument. As if any English speaker would be able to just write a for-loop without learning the surrounding syntax. Once you learned all that syntax you don't really care anymore what \"for\" means in the English language. It has a very special meaning in the programming language and that meaning is all that counts for programming. Knowing additional meanings of that word in English isn't helping at all."}, {"author_name": "Christian", "gravatar_hash": "b9712b3a496340ff7492ac3c40f5d3b4", "author_url": null, "date": "Apr 10, 2009", "message": "@jeff: JOOC how many languages do you speak fluently ?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 10, 2009", "message": "I thought about this a little more, and I think I understand the disconnect now.\n\nWhile local communities can and should form in native languages, the entire point of Stack Overflow is to have a cultural melting pot in one place --  Python, Perl, Ruby, and C# side by side -- and that has to be around the lingua franca by default.\n\nPart of the explicit goal of Stack Overflow is for programmers to learn to be better communicators -- better communicators in <i>English</i>, the lingua franca of programming.\n\nIt's sort of like arguing that there should be a special Stack Overflow for Perl, or Stack Overflow for Haskell.. it's kind of .. totally missing the point on a certain level."}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": "http://www.tiltech.net", "date": "Apr 10, 2009", "message": "There are two separate thoughts I want to write about:\nFirst: Joel is pointing out that ignoring foreign markets may mean surrendering them to people who are able to implement the ideas of SO in that market.  Choosing English first is the best choice because it is the largest market, and a good use of limited resources.\n\nThe other thought is that equating programming skill with knowledge of english is a weak correlation.\n\nI don't know any of China's heroes or historical figures, because I have no contact with their culture.  This is not to say they don't have any. Apply this logic to programmers instead of heroes.  If you are very familiar with the culture, icons, people, history, and where to get more information about programmers in their culture, and then can't find any, that is something else all together.\n\nProgramming is about the ability to conceptualize difficult problem spaces and requirements, the relationships between many different objects and scopes, and putting it into code a computer can execute.  I refuse to believe that knowing English words, grammar, and structure is directly related to these capabilities.\n\nHere are links to some of Einstein's papers, in the original german:\nhttp://nausikaa2.rz-berlin.mpg.de/digitallibrary/digilib.jsp?fn=permanent/einstein/cw/081_1916/pageimg/&amp;pn=3&amp;ws=1.5\nhttp://nausikaa2.rz-berlin.mpg.de/digitallibrary/digilib.jsp?fn=permanent/einstein/cw/082_1916/pageimg/&amp;pn=2&amp;ws=1.5\n\nEnglish is the predominant source of information on technology in the world, so knowing it allows access to the most resources, but it doesn't cripple your thought process or ability to learn.\n\nEinstein had great insights and observations and did so in German.  You don't know about good or famous programmers that don't know English because you don't know the languages they are famous in.  If they don't communicate in English they are completely off your radar, and it is arrogance to assume they don't exist.\n\nThese non-english programmers may not make a mark on the english programming community directly, but they still write code that people use in many diverse situations.  If it works well, isn't that much more important than what languages they can speak?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 10, 2009", "message": "> Woah! The latest statistics of CSDN are mindboggling!!! :-)\n\nhttp://siteanalytics.compete.com/csdn.net+stackoverflow.com/\n\n(as sth pointed out, that's US only -- Alexa is more representative)\n\nhttp://www.alexa.com/siteinfo/csdn.net\nhttp://www.alexa.com/siteinfo/stackoverflow.com"}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": "http://www.tiltech.net", "date": "Apr 10, 2009", "message": "One more reponse\n&gt;Part of the explicit goal of Stack Overflow is for programmers to learn to be better communicators — better communicators in English, the lingua franca of programming.\n\nThe goal is explicit until the indexOf('-')  the About Page(http://stackoverflow.com/about) does not list English at all, it states specifically: \"No matter what programming language you use, or what operating system you call home -- better programming is our goal.\"\n\nI think that making English mandatory for the goal of better programming actually stands in the way.\n\nThink of how useful Ashwin Nanjappa's suggestion of the ability to host all languages on this site could be.  You could be the Rosetta Stone for programmers, allowing them to see questions in both English and their native language.  The wiki aspect would help these questions become more accurate and provide better translations, and better opportunities to learn.\n\nYou say that communication is the key to improvement, and doing it in the medium that will best convey the information is best way to communicate, hence people using their native and most proficient tongue."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Apr 10, 2009", "message": "I'm curious what's the percentage of French, Spanish, German, Chinese and Japanese programmers on stackoverflow?"}, {"author_name": "sth", "gravatar_hash": "92fb4563ddc5ceeaa8b19b60a7a172f4", "author_url": null, "date": "Apr 10, 2009", "message": "&gt; http://siteanalytics.compete.com/csdn.net+stackoverflow.com/\n\nQuoting compete.com:\n&gt; Compete estimates site traffic and engagement metrics based on the daily browsing activity of over 2,000,000 U.S. Internet users.\n\nSo it looks like most of the traffic of csdn.net doesn't come from the US..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 10, 2009", "message": "> and doing it in the medium that will best convey the information is best way to communicate\n\nAnd for <b>programmers</b>, that is English.\n\nhttp://en.wikipedia.org/wiki/Turing_Award\n\nIMHO. I'm not forcing anyone to visit Stack Overflow, and I encourage local native language communities to find their own places as well. It's a very, VERY big pie -- and I sort of objected to the way Joel thought we should \"own\" so much of it. Ownership is overrated; I'd much rather build what I think makes sense, and let others build what they think makes sense. I didn't do this because I wanted to rule the world.\n\nShrug."}, {"author_name": "Jack", "gravatar_hash": "a805ef397c1e8191ab66f1839b520143", "author_url": null, "date": "Apr 10, 2009", "message": "Ugh!  Sometimes Jeff displays how ignorant he is on things (languages outside of algol, mathematics, etc.) but usually knows when to let Joel talk.  It was maddening listening to him argue with Joel.  It is so obvious that Jeff has very little experience outside the U.S. border.  Joel was trying to explain this gently with facts and interesting experience and Jeff kept missing the forest for the trees and grasping onto strawmen.  Just Painful.  There is nothing wrong with being igorant about certain subjects.  Being silent, admitting ignorance, and listening to others to gain knowledge is an admirable skill that seems to be dying."}, {"author_name": "Purslane", "gravatar_hash": "2acda5365ade04b5964de0502116a037", "author_url": null, "date": "Apr 11, 2009", "message": "\"Additionally all this “the keywords are in English” is a completely stupid argument.\"\nYeah. I wonder if Jeff also thinks that all good mathematicians are Greek because \"the symbols are in Greek\"?\n\nMany people in the comments already said that it makes sense to focus on English first. I do the same with my own application. English is by far the biggest market, and getting something out there is important now. You cannot be everything to everybody. That is a reasonable and rational argument. For similar reasons, I don't think there is anything wrong with developing a web application that initially only works with Firefox and Internet Explorer, because that is by far the biggest market, but it would be silly to say that you don't develop for Opera because smart people should use Internet Explorer anyway because it has the largest market and is the \"de facto standard\".\n\nYou ALMOST seem to get it when you say \"IMHO. I’m not forcing anyone to visit Stack Overflow, and I encourage local native language communities to find their own places as well.\" but I wish you just said that without all the \"people who are not fluent in English cannot be good programmers\" crap.\n\nDo you think Dijkstra was a less competent programmer than you are? Do you realise that he communicated his shortest path algorithm in Dutch years before he officially finally published it in English? \n\nYour statement that English IS the lingua franca of programming is just untrue. Wishing this does not make it true, and constantly stating it makes it seem like you do not understand reality as it is. I think that that is a bad quality for a programmer. The very fact that such large communities in other languages exist disprove that at the moment there is any lingua franca."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 11, 2009", "message": "> people who are not fluent in English cannot be good programmers\n\nI think there is a de-facto limit to how good you can be as a programmer *without* English skills.\n\nI believe this, and I believe it for the same reason I switched from VB.NET to C#. It wasn't because I liked the C# syntax -- in fact, I still don't. Sure, there are \"communities\" of VB.NET users out there. But the vast majority of .net information is dominated by C#, and resisting that was hurting me as a programmer.\n\nYou may believe something else. That's fine, too."}, {"author_name": "Chris Conway", "gravatar_hash": "c1cc649bda672575d17d588b81513dfd", "author_url": "http://procrastiblog.com", "date": "Apr 11, 2009", "message": "<blockquote>I think there is a de-facto limit to how good you can be as a programmer *without* English skills.</blockquote>\n\nThis opinion is arrogant and, quite frankly, imperialist. That a plurality of working programmers in the world speak English (which may or may not be true) is a contingent fact, due primarily to the historical coincidence that the software industry was \"invented\" in the U.S. If you really think that millions and millions of Chinese programmers are going to learn English in order to have access to Coding Horror and Stack Overflow, you are mistaken. In the future, there will be a <em>smaller</em> percentage of programmers speaking English, and communities will grow to serve those non-English-speaking programmers."}, {"author_name": "Donal", "gravatar_hash": "8b2d39a59a961ef26440e9c1453d1939", "author_url": null, "date": "Apr 11, 2009", "message": "&gt; I think there is a de-facto limit to how good you can \n&gt; be as a programmer *without* English skills.\n\nI am astonished that you cling to this arrogant, narrow-minded opinion despite the fact that:\n\n1. nobody appears to agree with you\n2. your arguments in support of this position are flaky and the flaws therein have been thoroughly exposed\n\nRegarding (2), your only arguments in support of this position appear to be:\n\n(i) The keywords are in English \n\nThis is so idiotic that I'm reluctant to dignify it with a response. Does the meaning of 'switch', 'case', 'for' in the context of a programming language really have much in common with their definition in an English dictionary? I think Purslane's remark above about Greek symbols in mathematics does a great job of debunking this argument.\n\n(ii) There are little or no famous programmers who don't write in English\n\nAgain, the flaws in this argument are so obvious, that I'm loathe to insult the intelligence of the readers by explaining them. In short, there are a large number of famous (and/or highly accomplished) programmers who write in other languages. They're just not known by you because......they don't write in English!\n\n(iii) You switched from VB.NET to C# because the amount of information available in VB was limited compared to that available in C#. Programmers who don't speak English have a similarly limited amount of information available to them and ***some giant leap of reasoning*** therefore are 2nd tier programmers.\n\nSo lets say there are 50 C# books written in English and 5 in Chinese? Is the Chinese programmer really at a disadvantage here? All he probably needs is one book that is \"good enough\"."}, {"author_name": "Donal", "gravatar_hash": "8b2d39a59a961ef26440e9c1453d1939", "author_url": null, "date": "Apr 11, 2009", "message": "Further to (iii) above, saying that all non-English speakers are 2nd tier programmers because they have a limited amount of information available to them is about as valid as saying that all VB.NET programmers are 2nd tier programmers.\n\nEvidently you seem to believe that both of these are true, so presumably the only candidate first-tier programmers are those who speak English and program in a mainstream language such as Java, C#, C++, etc?"}, {"author_name": "Donal", "gravatar_hash": "8b2d39a59a961ef26440e9c1453d1939", "author_url": null, "date": "Apr 11, 2009", "message": "@Jeff\n\nPerhaps the most compelling argument against your theory is that I (and other commenters) have worked with top class programmers that don't speak English. \n\nYou're entitled to believe a theory which contradicts the practical experience of many, but this seems irrational (at best)."}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": "http://ashwin.zaatar.org/", "date": "Apr 11, 2009", "message": "@Donal: Totally agree with your cogent argument. I just gave up after Jeff stuck with his ridiculous argument. It is clearly obvious that Jeff has never worked with non-English programmers who live in other countries. The best help Joel could do at this point is to buy Jeff a plane ticket to Tokyo/Shanghai for a few days."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Apr 11, 2009", "message": "Jeff, your positon on languages is very unsophisticated. Simply because you have a hundred people commenting on your blog agree with you does not a good argument make. I think you need to just go out and learn about the World more and maybe you will understand this a bit better, certainly you should stop comparing VB.NET/C# to English/Non-English. That's just weird."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 12, 2009", "message": "> In short, there are a large number of famous (and/or highly accomplished) programmers who write in other languages. They’re just not known by you because……they don’t write in English!\n\nIf they don't write in English at some point, they are unknown to the world. cf:\n\n<blockquote>\nAs an American and native English-speaker myself, I have previously been reluctant to suggest this, lest it be taken as a sort of cultural imperialism. But several native speakers of other languages have urged me to point out that <b>English is the working language of the hacker culture and the Internet, and that you will need to know it to function in the hacker community.</b>\n\nBack around 1991 I learned that many hackers who have English as a second language use it in technical discussions even when they share a birth tongue; it was reported to me at the time that English has a richer technical vocabulary than any other language and is therefore simply a better tool for the job. For similar reasons, translations of technical books written in English are often unsatisfactory (when they get done at all).\n\nLinus Torvalds, a Finn, comments his code in English (it apparently never occurred to him to do otherwise). <b>His fluency in English has been an important factor in his ability to recruit a worldwide community of developers for Linux</b>. It's an example worth following. \n</blockquote>\n\nhttp://www.codinghorror.com/blog/archives/001248.html\n\nIf you don't agree that <i>English is the working language of the hacker culture and the Internet, and that you will need to know it to function in the hacker community</i> that's fine. The world is a big place and not everyone has to have the same opinion."}, {"author_name": "Donal", "gravatar_hash": "8b2d39a59a961ef26440e9c1453d1939", "author_url": null, "date": "Apr 12, 2009", "message": "&gt; If they don’t write in English at some point, \n&gt; they are unknown to the world\n\nI guess you're just not listening, I'm giving up after this comment...\n\n&gt; Back around 1991 I learned that many hackers who \n&gt; have English as a second language use it in \n&gt; technical discussions even when they share a birth \n&gt; tongue; it was reported to me at the time that \n&gt; English has a richer technical vocabulary than any \n&gt; other language and is therefore simply a better\n&gt; tool for the job.\n\nSo English is somehow inherently superior to all other languages for programming discussions? I like to see some real evidence to support this (not weasely words like \"it was reported to me\"). Well, I can report to you that in my previous job that I worked with a lot of Francophones (who also spoke English), and they *always* held programming discussions in French.\n\n&gt; If you don’t agree that English is the working \n&gt; language of the hacker culture and the Internet, \n&gt; and that you will need to know it to function in \n&gt; the hacker community that’s fine. \n\nNOBODY has disputed this! What I (and others) are disputing is whether English is a pre-requisite for \"first-tier programming\". Don't you see that this an entirely different question to whether English is the lingua franca of the hacker community?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 12, 2009", "message": "> NOBODY has disputed [that English is the working language of the hacker culture and the Internet]! What I (and others) are disputing is whether English is a pre-requisite for “first-tier programming”\n\nI guess it's a semantics thing, then. To me, \"first tier programming\" means being able to fully participate in the internet and hacker culture as a peer. Whether it's joining open source projects, enjoying the full breadth of documentation, getting your questions answered on SO, etc.. all of this requires English for <i>programmers</i>.\n\nAs I said above:\n\n> Part of the explicit goal of Stack Overflow is for programmers to learn to be better communicators — better communicators in English, the lingua franca of programming.\n\n> It’s sort of like <b>arguing that there should be a special Stack Overflow for Perl, or Stack Overflow for Haskell</b>.. it’s kind of .. totally missing the point on a certain level."}, {"author_name": "Pop Catalin", "gravatar_hash": "6905efdf12e66dd9a3b94e6aa4d01cac", "author_url": null, "date": "Apr 13, 2009", "message": "&gt; Part of the explicit goal of Stack Overflow is for programmers to learn to be better communicators — better communicators in English, the lingua franca of programming.\n\nThat won't happen for countries that don't have think the same way you do. Even if (we) the rest of the world share your opinion, in the countries mentioned there's a strong tradition to use the native language for anything computer related. The french don't even use English words for technical terms, they have their own terms  \"software\" -&gt; \"logiciel\", even if the rest of the world has imported the word \"software\" directly.\n\n&gt; I’m curious what’s the percentage of French, Spanish, German, Chinese and Japanese programmers on stackoverflow?\n\n\nOk, maybe asking for numbers is too much, but can you say that SO has roughly the same audience of French, German and Spanish programmers, like it has for other countries?"}, {"author_name": "Peter", "gravatar_hash": "745edd0ed5ca0851d9134bff34dd6588", "author_url": null, "date": "Apr 13, 2009", "message": "Jeff, I think you're trapped in an echo chamber. Of course if you ask people who read you blog -- written in English -- about English they're going to be biased. I'm not saying you are totally wrong, but the data you're working with is not representative. There's a whole world, literally, out there that you don't really have access to without knowing that specific language. I don't think you can accurately judge the size and impact of the Chinese market without being part of it or at least knowing the language. While SO has 50K+ members that's still small compared to the millions of programmers out there.\n\nWe appreciate all your hard work, and I understand how localizing the site would be a huge task. If you don't feel like it's worth it or don't have the time / energy / desire to tackle the problem, that's fine too.\n\nI think where things got heated is when you claimed your superiority, or the superiority of the language you use, and labeling everybody else as second tier. When you do this, you anger a big portion of your audience. I personally have no problem writing / reading in English, but I have friends who I know that struggle with the language, and when you label them one way or another simply because their \"language gene\" is not the best it leaves me with a sour taste in my mouth. And I'm not quite clear what you gain out of it either, other than a temporary ego boost."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 13, 2009", "message": "&gt; While local communities can and should form in native languages, the entire point of Stack Overflow is to have a cultural melting pot in one place — Python, Perl, Ruby, and C# side by side — and that has to be around the lingua franca by default.\n\nOddly, I find this to be far and away the best argument *for* localizing Stack Overflow so far.  One hurdle separates those of us arguing for it and (basically) Jeff.  If the goal is to provide a forum for every programmer to hone their craft, share knowledge and communicate effectively, it's necessary for a common language to be used.  \n\nJeff's model is the lingua franca model: pick a language and stick to it.  If you don't know the language, you must learn it or be handicapped.  It's a reasonable model and many industries use it.  For instance, if you want to be a pilot, you need to know enough English to communicate with air-traffic control.  It's a hard requirement.\n\nOne alternative model is what might be called the marketplace model.  Rather than picking a common language upfront, the parties to each transaction negotiate a language to bargain in.  When we visited Italy a few years ago, my wife and I went to some outdoor markets.  Some vendors spoke English, but others did not.  In those cases, we either: a) moved on, b) tried Spanish, or c) used ad hoc sign language.  It wasn't ideal, but we didn't have time to learn Italian and couldn't expect everyone else to learn English.\n\n(It seems obvious to me that Stack Overflow is well suited to the marketplace model, but the transition would not be easy or painless.  If the development team is not committed to the model, it will be far too much to take on.)\n\nI believe Jeff chose the lingua franca model for ideological reasons, just as he chose to use OpenID.  One would hope that if some other language replaced English, Stack Overflow would also change languages.  There is an added practical reason: Jeff and his team speak English.\n\nThe reason I think Jeff's comment above works *for* localizing rather than against it is that I believe the marketplace model works better to achieve the goal of a common language than the lingua franca model.  Trying to enforce a common language results in silos that refuse to interact with each other.  Counter-intuitively, creating a language-neutral marketplace will result in a small number of languages that participants will want to know in order to reach the largest number of counter-parties.  For programming, English is likely to be the overwhelming favorite.\n\nAssuming Stack Overflow does not localize, there will be similar sites in other languages.  To the degree they connect questioners to answerers in their silo, they will be successful.  But there will never be an easy transition from one silo to another.  Tragically, Stack Overflow will lose the opportunity to be a language-neutral (mostly English) marketplace."}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": "http://ashwin.zaatar.org/", "date": "Apr 13, 2009", "message": "@Jon Ericson: That was a very erudite comment, thanks! In any case, the one spot of sunshine I see is that the CNProg folks have opensourced their code. So, if there is enough interest out there to build a SO clone, but one where programmers from different languages can interact, then they have a good starting point in the CNProg code. Kudos to Mike Chen and team for doing this!"}, {"author_name": "Kristian", "gravatar_hash": "84ae8d02a9fcf306df3e159918a0a63a", "author_url": null, "date": "Apr 13, 2009", "message": "Isn't the title of \"Software Architect\" really just a pompous way of saying that someone is a true \"Software Developer\", instead of just a \"Programmer\"?\n\nSoftware Architect = Designer || Planner\n\nRole: makes theoretical, highly removed blueprints/patterns with a very high-level perspective.\nTraits: Generally a jumped-up jobsworth [translation: a pretentious, officious &amp; inflexible person]\n\nSoftware Developer = Creator &amp;&amp; Innovator &amp;&amp; Engineer &amp;&amp; Refiner\n\nRole: adaptable multilevel perspective; understands the big picture of the project or sub-project &amp; also gets their hands dirty with the details of implementation.\n\nProgrammer = Builder || Implementer \n\nRole: a code monkey with a lower-level perspective, just concerned with writing lines of code, not understanding the grand scheme of things.\n\n\nWell, I'm a Software Developer, not just an Engineer, nor merely a Programmer, nor simply an Architect!"}, {"author_name": "Jim McKeeth", "gravatar_hash": "e5ca3abec062f8174570a4b1d1c840d8", "author_url": "http://www.Delphi.org/", "date": "Apr 14, 2009", "message": "Scrubbing your data for privacy information is not as complex as the AOL data.  For starters my tracks on Stack Overflow are already public.  Anyone can come here and see what questions I asked, what answers I gave, and any comments I left.  All of that with time stamps as well. \n\nThere is no illusion of privacy here.  With the AOL search data users were under the belief that their search terms were private.  \n\nAnd in actuality, if you were to scrub all user identifiable information then you would be in violation of the <a href=\"http://creativecommons.org/licenses/by-sa/2.5/\" rel=\"nofollow\">cc-Wiki</a> license that we all contributed our work under:\n\n<blockquote>Attribution. You must attribute the work in the manner specified by the author or licensor (but not in any way that suggests that they endorse you or your use of the work).</blockquote>\n\nAdditionally, if you were successful, then someone could simply search Stack Overflow for a question or answer and find the exact page it originated from and discover who the original author was.\n\nAs was mentioned, you only need to scrub email addresses, OpenId accounts, and perhaps voting information.  Basically anything that isn't already publicly viewable should be scrubbed, while anything that is viewable could easily be left."}, {"author_name": "Nathan Reed", "gravatar_hash": "1178609ba6835138fb8ae7f0a2eeffc2", "author_url": null, "date": "Apr 14, 2009", "message": "I came here specifically after listening to the podcast to let Jeff know how wrong he is, but it looks like I have been beaten to it by quite a few people... \n\nSeriously though, I think Joel's point was this: If you don't localize SO, then someone else will, and later if you try to move into those markets, it will be too late.\n\nYou seem to think that this will not happen because most working programmers can speak english good enough to participate in SO. This may or may not be true, but even if it is, why wouldn't these people *prefer* to ask and answer questions in their native languages? There is definitely enough of them to get to critical mass for a community to work.\n\nJust because they want to speak their own language, doesn't make them second rate.\n\nNo offense, but maybe you should travel outside the states a bit more"}, {"author_name": "Mike Polen", "gravatar_hash": "b8d72d565757586c8632243e51c96d4f", "author_url": "http://mwpolen.wordpress.com/", "date": "Apr 15, 2009", "message": "I came to comment about the importance of communication versus an architect and WOW people are trying their best to convince Jeff he is WRONG...well I think just about all the posts are missing a BIG picture.\n\nSome facts I have gathered via listening and reading SO since it's inception:\nA) SO has limited resources\nB) Jeff is Passionate about social software\nC) SO is becoming a success, but isn't at the point that it can overcome A\nD) Jeff understands the US programming culture as Coding Horror is in just about every top 10 I have read (e.g. #2 on NOOP.NL - http://www.noop.nl/2009/03/top-100-blogs-for-developers-q1-2009.html)\n\nIf I were Jeff, I would not being pouring my limited resources (A) into a market that isn't my primary market (D). I also would not being spending my limited time (A) trying to find a Foreign-Jeff (that also has B) to make a Foreign SO.\n\nIt is easy to criticize, but difficult to offer genuine constructive criticism."}, {"author_name": "Nicholas Bieber", "gravatar_hash": "cb9e249283eea099f5cc5a3e48fe04f4", "author_url": null, "date": "Apr 19, 2009", "message": "I found out about the Spolsky/Atwood world through one of my Japanese mentors who read and recommended Joel's book, and had it in the collection of programming related books.  It was a Japanese version, and he spoke no English what so ever.  Yes, he could figure out code by looking at it, but the idea of having a conversation with him in English e.g. a code review, would be cute at best.  Admittedly, the same conversations in Japanese showed huge holes in my language ability.\n\nThere are several forums, social bookmarking sites, and blogs in Japanese covering similar content, and quite a few of them  have links to english sites with translations of the non-code parts, but I see no centralised SO type site (or I haven't found it yet).\n\nThere are a lot of Japanese programming books here in Tokyo (although I've found a few good English book stores with decent quantities of coding tomes), but a large amount of the books have little specialist content and some fairly common base level content are produced by content production houses (an introduction to content development for mobile phones was produced by the last company I worked for) as more of a PR exercise for the company, publishing books saying \"yes we can\" and hoping that it will attract more consulting business.\n\nJapan could do with an SO, and I think that the Atwood/Spolsky combo would have enough clout to do it. Partnering up with a largeish Japanese company would be important though, a branch of Softbank (they distributed the iPhone here), perhaps, or the people who built Mixi (facebook for japan), or Hatena (japanese digg type thingy).  I can see the sharing centralised knowledge aspect with the race to aquire rep points would go down really really awesomely in Japan.\n\nmy catchpa was \"bawdiest critter\"."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 20, 2009", "message": "Jeff the ugly american programmer.  I was almost ready to redact my personal opinion of Jeff, but then I listened to podcast 48.  He sounds like a redneck american saying that everyone should learn English.  I was embarrassed for him.  \n\nI did not have time to read all the posts above mine, but I suspect he was beaten up by many people.  \n\nNote I am not a \"farener\" [sic]"}, {"author_name": "Jimmy Chandra", "gravatar_hash": "2b43bb94f52fda53de5a15a9be9c32f5", "author_url": "http://geeks.netindonesia.net/blogs/jimmy", "date": "Apr 20, 2009", "message": "Hi guys,\n\nAlthough most of the time I found myself on the opposite side of Joel's argument, in this one I have to agree with him on the topic of localization (in context to this episode).  I, myself, is from Indonesia and I've worked with lots of developers that doesn't really speak / read English very well.\n\nI can see how Jeff can arrive at his point of view, probably from working only with English spoken developeres, but that does not mean there is not a big need for a localized development content.\n\nJoel is right in pointing this out in the podcast since I've seen it locally, bookstore w/ hardly any English text IT related books, etc.  It's very hard for me to look for technical books in English (which I myself prefer) locally.  In the mailing list (still I think the primary mean for communication around this part, people communicate most of the time in Indonesian language).\n\nI got a feeling that Jeff is a big fish in a small pond when there is an ocean out there, so to speak.  I hope this will open up Jeff's perspective a bit that there are localization market out there."}, {"author_name": "rhubarb", "gravatar_hash": "0b1bc11dcecdebd99abdaa37ec3f8119", "author_url": null, "date": "Apr 23, 2009", "message": "One more observation to make about the whole localization debate.\nAs a native english speaker and programmer living in Portugal, I occasionally visit technical sites specific to portuguese topics and find answers to questions I had written in portuguese.\n\nHere's the thing: after a decade of living in portugal, but working/speaking/writing in English, my portuguese is good enough for reading books, newspapers, and even, if there were such a thing, a portuguese SO. But my writing sucks. Reading and writing, like understanding and speaking, it turns out, are totally different skills - especially when learnt in a foreign language as a adult.\n\nThe upshot is that while I often find answers on portuguese forums to Portugal specific problems, I seldom enter questions or comments. First it's a lot of work to get the grammar right, and secondly I know it will have enough mistakes to make me look like a dumbass.\n\nAnd that's on an anonymous forum. Now, put me on a system where Reputation is the coin of the realm, and I'm really going to think twice to attaching some garbled, twisted, kindergarten-level-grammar-written question to my name.\n\nAnd that's what you're losing with the english-only SO. Half the worlds programmers don't feel comfortable writing a question in english, even if they have no problem reading one. \n\nYou just cut off 50% of your potential contributors."}, {"author_name": "rhubarb", "gravatar_hash": "0b1bc11dcecdebd99abdaa37ec3f8119", "author_url": null, "date": "Apr 23, 2009", "message": "Edit to my last comment - there's a comma missing in the first sentence which makes it seem like I'm contradicting myself later (see what I mean!? and that's in my own language)\n\nIt should read: \"... and find answers to questions I had, [pause] written in portuguese\".\n(The answers were written in portuguese, the questions were still in my head)"}, {"author_name": "thosteg", "gravatar_hash": "05c8faaaddf5fd8604bdcea3f3d19d2c", "author_url": null, "date": "Apr 24, 2009", "message": "It is often said that learning a new programming language from time to time is good - because a different programming language may come with a different way of thinking.\n\nPerhaps this holds true for learning a \"real\" language as well?! \n\n--\n\nIt might be interesting for some english-only speaking people to really try\n\n- a foreign language which is sufficiently different from english (i.e. perhaps not western)\n- go to that particular languages country for some months to \"get a shower of that particular culture\"!\n\nAlthough not natively english-speaking, I'm looking forward to that myself :-)"}, {"author_name": "Preeti Edul", "gravatar_hash": "6c3dc3da44e024508359758b8b64c2ac", "author_url": null, "date": "Aug 21, 2009", "message": "&gt;&gt; And my general point had more to do with focus than anything else: do we want to deliver a product in 5 different languages poorly, or 1 language — the primary language — extremely well?\n\nIs that so? Didn’t seem like it Jeff. The arrogance was such that if Joel tomorrow even presented you with a perfectly functional Japanese version of SO you would disapprove of it!\n\nAnd also, you actually thought “YOU” would create the localized Japanese version? Getting a little self obsessed, are we now?"}, {"author_name": "Sara", "gravatar_hash": "68b3fe7452685c737deea35713cdcd8a", "author_url": null, "date": "May 10, 2010", "message": "Well the Chinese developers DO give you guys credit. If you click on the link at the bottom of the page and go to their equivalent of codeplex, they give the code for the project and say it was inspired by stack overflow."}]}