{"response": [{"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 15, 2009", "message": "I haven't listened to the podcast yet so I don't know if this was mentioned, but there is a well-known programming language that uses symbols instead of words:\n\nhttp://en.wikipedia.org/wiki/APL_(programming_language)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 15, 2009", "message": "nobody_, Joel did bring that up BUT I THOUGHT HE WAS KIDDING. Holy crap?\n<blockquote>\n<p>\nIn the following example ... the first line assigns some HTML code to a variable \"txt\" and then uses an APL expression to remove all the HTML tags, returning the text only as shown in the last line.\n</p>\n<p>\n<img src=\"http://upload.wikimedia.org/wikipedia/en/0/09/StripHtmlFromText.gif\" width=\"500\">\n</p>\n</blockquote>\nFrom wikipedia http://is.gd/m4m5"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Apr 15, 2009", "message": "Should we create a tag (or has that been done) for questions to be moved over to serverfault. \n\nSo we can add these questions when we see them to this tag and then you move them over."}, {"author_name": "Bremen", "gravatar_hash": "9a45de8df0c5c3f6e137c785e71557b8", "author_url": null, "date": "Apr 15, 2009", "message": "Isn't the classic example of symbols-instead-of-words the language \"Brainfuck\"? It's a literal Turing machine implementation, which seems to appeal to CS majors on a deeper level."}, {"author_name": "Joshua", "gravatar_hash": "2c21bed614c58c9e1c48fe272e79efd2", "author_url": null, "date": "Apr 15, 2009", "message": "WOOT! Looks to be a good episode. I can't wait for the next one. Yegge always has good stuff (his last article about weed explains a lot)."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 15, 2009", "message": "@Ólafur\n\nyes, there is already a [belongs-on-serverfault] tag (and close reason!), and it is OK to use both for now"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 15, 2009", "message": "Looking forward to hearing Yegge again.  I still think you need to get Paul Graham on the podcast.  Maybe at the Business of Software conference?"}, {"author_name": "toast", "gravatar_hash": "3e8ac91e068a80d3ae0921595e63f0bb", "author_url": null, "date": "Apr 15, 2009", "message": "Some would argue that Wikipedia is permanently broken. But Wikipedia succeeds because it doesn't take much to be able to edit Wikipedia. For example, here are some statistics I found on a website I frequent:\n\nhttp://www.codinghorror.com/blog/archives/000616.html\n\nNow assuming that the number of programmers at large is greater than the number who can contribute to Linux, we are still talking orders of magnitude difference.\n\nEven still, the number of people who can edit StackOverflow is nowhere near the number of programmers in general. If my math and everything is correct, there are about 1300 people who can edit StackOverflow.\n\nMaybe we have an advantage in that we are a narrow community with a focus on a skilled profession. This attracts a higher quality of ruffian from the outset. But maybe we are seeing how the wiki model scales downward.\n\nAnd gah, I still haven't had time to listen to last week's episode. Work is causing me to fall behind in critical slacking areas. :P"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 15, 2009", "message": "@Jeff\n\nI assume, or at least I hope, that once ServerFault goes live that closing with the \"Belongs on ServerFault.com\" reason won't be the mechanism for site-to-site moving.\n\nWhile we're on the subject of cross-site integration, I'm curious just how connected the sites will be. Specifically, I think that there's an incredible amount of overlap between IT and programming - enough so that there will be a nontrivial number of questions that will be duplicated in hopes for getting a wider audience reading answering them. Ideally a question SHOULD be able to exist on both sites, but this would necessitate running both sites from the same DB, which could be bad for future scalability."}, {"author_name": "Chaz", "gravatar_hash": "c125870a852b79389553c983657b1331", "author_url": "http://www.chazmeyers.com/", "date": "Apr 15, 2009", "message": "Maybe \"Mentioning Stack Overflow Podcast Bingo\" should be added to the bingo card... ;)"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Apr 15, 2009", "message": "@nobody_ - I think the most overlap will come from sysadmins asking how to automate certain tasks."}, {"author_name": "Aputsiaq Janussen", "gravatar_hash": "450d2112be2bc89d6a13ecab2fc9918e", "author_url": null, "date": "Apr 15, 2009", "message": "Minor request. Please make sure Yegge's audio gear is tested as he seemed to have some minor problems hearing Spolsky last time. It was one of the greatest podcast so far however, thank you for doing another one."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 15, 2009", "message": "> Maybe “Mentioning Stack Overflow Podcast Bingo” should be added to the bingo card… ;)\n\nfull 360 degree meta"}, {"author_name": "Matt", "gravatar_hash": "f1175b620c26ca0a8280600b7e679244", "author_url": null, "date": "Apr 15, 2009", "message": "Holy crap! Alex sounds exactly like the narrator from the Wonder Years!"}, {"author_name": "Bartek Tatkowski", "gravatar_hash": "81a7b5102336c191c73935c30ec45689", "author_url": "http://www.tatkowski.com", "date": "Apr 16, 2009", "message": "Regarding what Alex said around 19 minutes in about english keywords:\n\nAll keywords in VBA and VB up until version 3.0 are localized. Excel people love this, while programmers are driven insane and start looking up the keywords in a thesaurus since the localization is less than perfect."}, {"author_name": "Mladen Mihajlovic", "gravatar_hash": "42c5bbf957f3ac0385fb5694d40992ef", "author_url": "http://gamemax.org/", "date": "Apr 16, 2009", "message": "Why not create a bit more tighter integration of both sites. You could have a flag on a question whether it should appear on both sites, and if so maybe they could share the answers? The link could maybe be moderated or flagged by users if it's invalid?"}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl", "date": "Apr 16, 2009", "message": "If I may, I suggest Joel buys up appropriate domains and research finding local people, Jeff isn't the right person to do stuff like that (because he's easily distracted and doesn't like talking on the phone:D)"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 16, 2009", "message": "@Mladen Mihajlovic\n\nYeah, that's sort of what I was getting at. I definitely think that badges and reputation should be site specific, but having a single pool of questions that can be on either (or both) sites would reduce cross-posting.\n\nI just don't know how you'd calculate individual site rep from questions that appear on both sites (would you duplicate it? split it? have it belong to the account on the site from which the question was answered?)"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 16, 2009", "message": "Actually, the best solution would be to award rep and badges based on the votes cast on the separate sites. So if someone on SF votes up a post, the poster's rep increases on SF (but not SO)."}, {"author_name": "Nathan", "gravatar_hash": "ec2b04ac1bad14fea8244a78ef0f2133", "author_url": null, "date": "Apr 16, 2009", "message": "I think it's hilarious that Joel doesn't follow this blog at all and is so surprised during the podcast by the new features and the reasons for implementing them."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": "http://softhardsoft.com", "date": "Apr 16, 2009", "message": "Regarding how much English is printed in foreign language programming books: I work in a company in the US where 1/2 of our programmers are from China. One of them has a Chinese copy of Professional C# 2005 on his desk. When I heard this discussion in the podcast, I paused it and went to look at his book. 100% of the code samples in that particular book are in English. Only the explanations are in Chinese.\n\nAs an English-only speaker this looks really surreal and dream-like."}, {"author_name": "Nalandial", "gravatar_hash": "a5fabaf7306eddbf36045d727883a0c2", "author_url": null, "date": "Apr 16, 2009", "message": "Alex mentioned his ING direct confirmation # was 27.  Just FYI, ING uses confirmation numbers unique per customer number.  So that was the 27th transaction he did."}, {"author_name": "Nalandial", "gravatar_hash": "a5fabaf7306eddbf36045d727883a0c2", "author_url": null, "date": "Apr 16, 2009", "message": "Also with regards to Steam, it's not just small companies on there.  Really huge companies like Electronic Ards, iD Software, Rockstar Games, etc, have ALL of their games available on Steam."}, {"author_name": "Chris Marasti-Georg", "gravatar_hash": "4281c5c19a1c365390eb478d529de6fa", "author_url": "http://www.bowlsk.com", "date": "Apr 16, 2009", "message": "@toast:\n\nI love everything about this:\n    a higher quality of ruffian"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Apr 16, 2009", "message": "Regarding the whole language thing, I think I've isolated the source of disagreement between many of us and Jeff.\n\nI think most people would agree that a passing knowledge of English is almost necessary for a developer and that more fluency is likely to help them. However, I feel that many developers will always be able to communicate better in their native language than they would in English. That doesn't mean they're \"second tier\" developers - they're just *more comfortable* in their native language than they are in English. I for one don't want to hold that against them. I'm awful when it comes to non-English languages, and I feel hugely lucky that English *is* the lingua franca for technical discussions.\n\nCommunication is incredibly important in problem-solving, so why would we want it to be harder than it could be?\n\nOf course that doesn't mean it should be a priority for Stack Overflow - but this difference between \"passing familiarity\" and \"enough fluency to really *think* in English\" is an important one, and shouldn't be dismissed.\n\nOn the topic of technical books, my copy of the Japanese edition of Grooy in Action arrived this week, and this morning I wrote the foreword for the Korean edition of C# in Depth. I don't understand a word of either of them, but I'm glad they exist - technical topics are hard enough to learn as it is, without the reader also having to translate.\n\nGreat podcast, btw. Alex sounded fun."}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Apr 16, 2009", "message": "For the record, Steam is not for just small companies to outsource distribution, as you see EA, Activision, etc on Steam."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 16, 2009", "message": "\"Communication is incredibly important in problem-solving, so why would we want it to be harder than it could be?\"\n\nAs you point out, communication may be easier in someone's native language.  On the other hand, if you are speaking the lingua franca you benefit from the network effect base on the much larger number of people who can help you with your problem."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Apr 16, 2009", "message": "@Chris: I agree that you benefit from a larger number of people - although some of those people may actually be able to converse better with you in your native language than in English.\n\nThere's also the fragmentation issue, where people end up posting the same question on multiple \"versions\" in order to reach a broad audience - which can waste people's time. There's a lot of room for discussion about this, and I suspect it's moot in some ways anyway as there are other tasks which are perfectly legitimately higher up the SO team's priority list.\n\n(I haven't yet heard about which feature Joel was mocking up, btw...)\n\nJon"}, {"author_name": "Roberto Teixeira", "gravatar_hash": "02ea93864875ce5027a322388720f375", "author_url": null, "date": "Apr 16, 2009", "message": "Jeff, on that localization issue, I think I agree with you more than with Joel with regards to localizing Stack Overflow. There is actually a very good point that Joel may not be considering.\n\nJoel is correct in that many programmers will prefer to discuss programming in their own languages. The problem here is that localizing Stack Overflow may be a little more complex than it would immediately look. It would not be enough to simply translate the website. You would also have to monitor the website for people \"taking over\" questions written in another language.\n\nGoogle learned that the hard way with Orkut. Brazilians quickly took over the site, making it very hard for other people to use it. Imagine a questions asked in English with Brazilians answering in Portuguese and starting all these discussions. It would quickly become annoying for other people to follow the discussions. Of course, I'm only using Brazilians as an example here.\n\nGoogle eventually caught up and made changes to Orkut to make it easier to experience it in only one language while ignoring the rest, but it was too late and Orkut became essentially a Brazilian site.\n\nStack Overflow is very good as it is right now (English-only) and although I can see Joel's point that there are more markets out there, I think right now SO should focus on what it does best.\n\nJust my 2¢"}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Apr 16, 2009", "message": "Re: localization, the question of \"should StackOverflow cover all languages\", that's just a business question. Would the added traffic outweigh the added development/maintenance costs? If yes, localize, if not, don't.\n\nAs for which language people actually use, it's trickier. As Jon said, it takes a certain level of English fluency to be able to talk about code in English. You only need to know a few words to be able to write your code in more or less English, but to explain it, or ask questions about it, you need to be a lot better.\n\nOn the other hand, the opposite can be true as well. Once that level of English fluency is reached, using English can be preferable, simply because it always becomes awkward when you mix languages. Having to slow down a bit, and occasionally google a word may be preferable to trying to juggle two languages, and constantly alternate between the two, and trying to do so consistently (For the podcast's example of CreateWindow, it gets *really* confusing if the description starts talking about \"Window\" in non-English, requiring the reader to mentally do the translation and mapping to the technical concept.\nI long ago gave up on writing about programming in my own language. It just becomes an impossible mess of localized vs nonlocalized technical terms, attempts to use the grammatical rules of one language for technical terms taken from another, and not least, different translations than others may use. That's the reason I hate and despise localized IDE's. What is the correct translation of \"compile\", for example? I can think of four or five candidates in Danish. Will the localized application use the one I'm thinking of? Will they use the same one consistently? Is the translator enough of a programmer to know what \"compile\" actually means in a programming context? Will I be able to *recognize that their translation means \"compile\"?\nAll too often, the answer is \"no\".\n\nIn that sense, I think English is the de facto language of programming. If you know it, you almost certainly prefer to use it consistently, *even* if you still have another language you're better at. \n\nIf you don't know English, obviously using it is not an option.\n\nSo I don't think people prefer to speak \"their own language\", but rather there's a threshold where you flip over from \"my native language\" to \"English\".\n\nI see quite a bit of imperfect English here, since people aren't native speakers. But people still prefer communicating about programming in English And of course, the reason for this is that people here are generally *good enough* at English that the occasional broken sentence isn't a deal-breaker. There is no doubt that if the English skill drops too low, the native language becomes preferable. But the threshold is not \"equal skill in both\". Imperfect english is preferable to most people over perfect non-english.\n\nIn some parts of the world, English clearly isn't even an option.\n\nAs for being impressed that all of MSDN is human translated to Japanese, I think I'm more shocked by the proposition that other languages may have been machine-translated. Doing that just shows a staggering disregard for localization and for making your content understandable. It is often better to make no translation at all, than to rely on machine translation.\n\nAs for Steam, as people have already mentioned, most of the big companies use it now. EA and Ubisoft came to Steam a few months ago, THQ and many others have been there for a long time. Sega has games there.\nEven store-bought games are starting to be tied to Steam. The last two games I bought (Dawn of War 2 and Empire: Total War) were bought as boxed copies - but both have to be activated on Steam before I can play them. Steam is *huge*."}, {"author_name": "Louis Kessler", "gravatar_hash": "dfc2b6aae1baa3fa00ad45ebca5adedc", "author_url": "http://www.lkessler.com", "date": "Apr 16, 2009", "message": "For more about APL, see:\n\nhttp://stackoverflow.com/questions/268751/what-ever-happened-to-apl"}, {"author_name": "Doug Chase", "gravatar_hash": "e51246c0c3b0b2fdd87dcee4e6923ee5", "author_url": "http://yafiction.net", "date": "Apr 17, 2009", "message": "In order for Server Fault to succeed, there will have to be a good solution for those of us IT guys who do a lot of scripting.  If I post a question about, say, Powershell on Server Fault, will users that have the Powershell tag flagged see it on Stack Overflow?  What happens if I want to answer scripting questions - do I have to visit both sites, or can I search both sites from one search box?\n\nOr has this already been addressed and I'm missing it?  I really enjoy SO, find it super useful, and don't want this resource to get diluted or crappified for those of us on the fence between \"IT\" and programming.\n\n(Also, my rep is under 200 but I would like to be in the beta.)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 17, 2009", "message": "> those of us IT guys who do a lot of scripting\n\nI think you'll get better answers on SO in this case. However, that depends on the purpose of the script.\n\n- Is it a script intended for wider use, like the one that runs, say, Movable Type? Perl is a \"scripting language\", too.\n\n- Is it a script that does one-off SysAdmin stuff like creating users? Moving files? Setting configuration?"}, {"author_name": "Nick Stinemates", "gravatar_hash": "44522fc90c3828034bf947f635fff4ce", "author_url": null, "date": "Apr 19, 2009", "message": "I found that the gues really wasn't active very much in this podcast. Joel and Jeff went on their rants as usual and kind of left the guy hanging. When he chimes back in toward the end I was thinking to myself: \"Oh he didn't leave?\""}, {"author_name": "Doug Chase", "gravatar_hash": "e51246c0c3b0b2fdd87dcee4e6923ee5", "author_url": "http://yafiction.net", "date": "Apr 20, 2009", "message": "Jeff, to be clear, what I'm worried about is that the community will get diluted because of that very ambiguity.  You've already expressed that it's more fragmented than the programmer community, because we all wear so many hats.  Those of us that concentrate on scripting and are good at it probably consider ourselves half sysadmin and half programmer.  We also have patterns that can be useful to both groups, so having scripting questions available to both sides could be beneficial.\n\nCan you tell us whether search and tagging will function across both sites?\n\nSysadmins who are Powershell/scripting folks will likely wind up hanging out on SF, and will miss Powershell questions that get posted on SO.  Or we'll wind up having to hang out at both places, and spend cycles every time we want to ask a question, deciding what side of the fence the particular question falls on."}, {"author_name": "Daphna Shezaf", "gravatar_hash": "c443c6c585151090fdc91eec799ba856", "author_url": "http://soybeans.wordpress.org", "date": "Apr 20, 2009", "message": "Let's be very clear about it: you don't need to know English to be able to write code. \n\nYes, I need to know the Latin alphabet - the letters, and something about the sounds they represent. I have studied English from the 3rd to the 11th grade. The alphabet I knew 3 months into the first year. And I WAS 8 years old.  \n\nOnce you have that, you can write code. As Joel said, language keyword are anyway arbitrary. And you can write damn good code with variable name in, say, Czech. I have seen it, it’s done.\n\nYes, to handle a standard library, you’d be better of with a vocabulary of a few hundred verbs and nouns in English; word like “window” and “close”. I think this would be my 5th grade vocabulary. Maybe 6th. More than that, you just need to know words. It requires zero command of syntax.\n\nYou actually do need a real knowledge to read documentation or a text book. This would require a few thousands words of general vocabulary, plus a much smaller set of domain-specific vocabulary, plus good command of syntax. I know a lot of people who know English, in the sense that the can communicate pretty well in it, and still would find technical reading difficult and prefer to avoid it. That’s why MSDN is localized to so many languages. \n\nAnd yet, reading requires just passive knowledge. Actively participating in StackOverflow requires you to be able to express your ideas in English. It’s called active knowledge and anyone who speaks any amount of a foreign language would understand the difference. Think of it like the difference between retrieving a value from an array by index and searching for a value in an unsorted array.  \n\nSo here it is: to be able to program on a professional level, at least in a country where books and documentation are localized, you need elementary school English. To participate in StackOverflow you need an active semi-native command. Huge difference."}, {"author_name": "Evan", "gravatar_hash": "35fc5853be2c9206609f1483b83b5808", "author_url": null, "date": "Apr 22, 2009", "message": "wrt Captchas: Joel mentioned that the spammers will employ people to solve them. Another technique I've heard about is that they take the captcha image, and redisplay it on another site with a high user activity base (e.g., a pr0n or phishing site) and get a human there to solve it for them, and feed the solution back to the original site."}, {"author_name": "Evan", "gravatar_hash": "f5e4fb973bce44b2d2a40f88b29207df", "author_url": null, "date": "Apr 22, 2009", "message": "...and I listen to the rest of the podcast in the car on the way home, and he mentions exactly what I commented on.\n\nDoh."}, {"author_name": "Artem", "gravatar_hash": "e519e735596b76d539a193bfabff1d81", "author_url": "http://catlion.name", "date": "Apr 22, 2009", "message": "There are programming languages with the Russian keywords and they looks weird for most of people.\n\nMost of programmers who are non-native english speakers don't really consider keywords as 'words'. It's more like magic spell which should be just learned."}, {"author_name": "Matt Ross", "gravatar_hash": "c7efb11b812df2ee180be08407923e58", "author_url": null, "date": "Apr 23, 2009", "message": "Love StackOverflow and dig the podcast. As a developer who regularly gets tasked with sys admin stuff (?#!\"£), when you were talking about serverfault and nothing else being out there, are you not forgetting experts-exchange? I use them and SO frequently."}, {"author_name": "Dominik Deobald", "gravatar_hash": "a9ff706566705fb0a0882915bcabb790", "author_url": "http://blogs.interdose.com/dominik", "date": "Apr 23, 2009", "message": "Just a quick note on your mention of \"generate codes by sticking two words together\" as (for example) AOL did it.\n\nWe have used that mechanism to generate passwords for new customers on one of our sites. Obviously we had removed all \"offensive\" words like \"stupid\", \"kill\", \"death\", \"war\", \"gun\", \"sex\" and so on, but every now and then an unexpected problem appeared when combining words that seemed very innocent on their own. We actually had people complaining about some of the passwords."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Apr 23, 2009", "message": "I think maybe talking about different spoken langauages should go on the bingo thing. I mean this sincerely with no malice but I think a lot of the issues with Jeff and this whole \"if you don't speak English you are at best a second tier programmer\" stuff is just from not being very culturally sophisticated. Perhaps if Jeff traveled the world a little more and broadened his horizons he might have a different perspective. Just an observation."}]}