{"response": [{"author_name": "Jason Punyon", "gravatar_hash": "44302dd1c18f747ba4fff5f689c475ba", "author_url": "http://jasonium.com", "date": "Apr 11, 2009", "message": "What is the difference you guys see between Offensive, Abusive, or Hate Speech and SPAM?  Do you have different policies for dealing with them?  I would think that either way, you want them off the site as soon as possible.  So why the extra click for SPAM?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 11, 2009", "message": "There is no extra click, it's a click 10 pixels over.\n\nSpam is, well, spam and should be categorized as such. We might use it to train an anti-spam engine at some point, or blacklist the URLs it contains, etc."}, {"author_name": "Code Slave", "gravatar_hash": "0a638176c7349e10fe82e6e65f2b069f", "author_url": null, "date": "Apr 11, 2009", "message": "And I presume the Inform Moderator is for situations where someone is being an uber-jerk?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 11, 2009", "message": "not necessarily; it's for anything you feel is not covered by the other flagging options, but still warrants a moderator looking at it."}, {"author_name": "EvilBobby", "gravatar_hash": "01a4a7e96176b435386a2767602db32d", "author_url": "http://EvilBobby.com", "date": "Apr 11, 2009", "message": "and soon you can sit back and watch your little monster work all by itself...\n\n*enters recaptcha*"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 11, 2009", "message": "So if a post fits into one of the categories that overlaps (offensive or spam) should we be closing and flagging it or just one or the other?  A lot of the \"I'm gong to tell Jeff on you\" stuff the past few days has concerned edits rather than entire posts.  Will there be any way to flag specific edits or revisions or should we just flag the post and explain our concern with an edit in the textbox?"}, {"author_name": "daok", "gravatar_hash": "a147f48a1c8298c71d4bb425b2801224", "author_url": null, "date": "Apr 11, 2009", "message": "This is a solution that I have asked few times ago because sending an email is just a joke to talk with moderator. Nice move.. the only thing I do not understand is that most of my suggestion in the past got just ignored and now they are mostly all implemented (I talk about seeing the full number of reputation, to have something to track more easily stuff to be more effective with posted stuff, having something to reward with higher reputation or something to get moderation). All got received like I was a reputation whore... but magically now it's implemented and it's not anymore a \\bad\\ suggestion :P Life is funny."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 11, 2009", "message": "SIX TO EIGHT WEEKS DAOK!!1!"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "61d2a0f034915fa9d2acd6f6b145bba8", "author_url": null, "date": "Apr 11, 2009", "message": "Good to see this.  I think that this new system can also _replace_ most of what the close votes were doing.  The exception is, of course, duplicates, and that system has other problems."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 11, 2009", "message": "@Joel Coehoorn, that's an interesting thought... \n\nShould OT questions be flagged immediately, or flagged only if an open/close/edit war ensues? \n\nI was leaning toward the latter, but the former might provide an opportunity for new users to be provided with a gentle introduction to the site before getting slammed with down-votes."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 11, 2009", "message": "> I think that this new system can also _replace_ most of what the close votes were doing.\n\nErrr.. ? How so? Close / Open is still working reasonably well, last time I checked."}, {"author_name": "mark", "gravatar_hash": "b634f0dcc3d5aefb94bc3192e51db539", "author_url": "http://officeadd.in", "date": "Apr 11, 2009", "message": "Good work Jeff and the team. \n\nIs this appropriate to use for reporting low level bad behaviour eg: sock puppets?"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Apr 11, 2009", "message": "@Joel: I think the amount of questions flagged to be closed would quickly overwhelm the moderators unless Jeff added a lot more of them."}, {"author_name": "Alex B", "gravatar_hash": "44a93d237941f727ab6dbd652ed516f7", "author_url": null, "date": "Apr 11, 2009", "message": "If I don't have enough rep to close a question, should I flag it?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 11, 2009", "message": "not usually. Only flag things that require serious attention. Someone asking an off-topic question isn't serious.\n\nThink of it as exception handling in code.. is this something exceptional?"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 11, 2009", "message": "I have a few questions about the rules:\n\n&gt; 4. If an individual post reaches a threshold of six offensive or spam votes within two days, it will be automatically deleted from the system by the Community user.\n\nDoes this mean that a post has to hit six offensive votes or six spam before it's deleted, or six votes total (i.e. 4 offensive and 2 spam)? I suspect, and hope, it's the latter, but English can be somewhat ambiguous.\n\n&gt; 6. Flag counts are no longer shown to anyone except moderators.\n\nI don't understand the reasoning behind this; I, for one, found the offensive count to be useful in alerting the poster that their post was about to be removed. I've also used the edit/rollback feature to reset the offensive votes on a post that was near removal that I thought was unfairly flagged.\n\nIn any case, those with 10k+ rep have access to the moderator tools, which reveal the flag counts for some posts. Why not also allow those with 10k+ to see the flag counts on the post itself?"}, {"author_name": "Scott", "gravatar_hash": "3edf666db168e039f7d0afd422cf3255", "author_url": null, "date": "Apr 11, 2009", "message": "So does this mean the hunter class is now nerfed as well?\n\nsorry, couldn't resist ..as it sounded like a World of Warcraft Patch. \"Here's the latest fix, here's how you roll the dice. kthx bai\"\n\nNice implementation though guys."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 11, 2009", "message": "@nobody_: i'm happy about this. Some folks got way too upset over a few offensive votes showing up on their posts; this makes that less likely. \n\nYou can still warn people that their crappy posts are liable to be removed if they don't improve. It's no less true."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 11, 2009", "message": "@Shog9\n\nOK, I will admit that seeing an offensive flag on my own post upset me (though such an occurrence is rare), and I've addressed the person who flagged my post as such in the comments, but ultimately my goal is to remove offensive or potentially offensive material from my post to avoid getting flagged again. Since offensive flags are anonymous (as they should be) there's not much sense in getting angry at the flagger.\n\nThis does bring up another point - these flags (offensive/spam/open/close) should be reversible. If I've voted to close or marked as offensive a post that later is radically improved, I would like the ability to remove my vote. With regard to open/close, I think that it would also be beneficial to be able to vote a question to stay open or to stay closed. As it is, a controversial post will oscillate between open and closed as both sides have their say. This is frustrating for all parties involved, but none more so than those that are trying to answer the post only to find it closed when they click \"Post Your Answer\". IIRC, those that typed up an answer when the question was still open used to be able to post that answer after the question was closed. However, a new \"feature\" came along that would repeatedly poll the question to check for new answers but also to check to see if the question was already closed. If it was, then the poster would no longer be able to click \"Post Your Answer\".\n\nYes, I realize that the bulk of this post probably belongs on UserVoice, but I think that there hasn't been enough discussion there about the mechanics of flagging posts."}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": null, "date": "Apr 11, 2009", "message": "Do all \"flags\" count as a downvote? Do any still count as a downvote?     I'd suggest that only \"offensive\" and \"spam\" count as a downvote, but that \"inform moderator\" not.  Inform moderator may only be used to notify moderators of an edit war and shouldn't count against the OP or the question, but I'd like to see the others still affect the question vote total.\n\nClose as spam or flag as spam or both?  To me a post that simply links to a blog article is spam, but I'm not sure that it's flaggable spam.  Any guidance here?\n\nrecaptcha: Norris Ashland"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 11, 2009", "message": "nobody_:\n&gt; Since offensive flags are anonymous (as they should \n&gt; be) there’s not much sense in getting angry at the \n&gt; flagger.\n\nRight. And no point to seeing them at all. You really should be getting better feedback from comments, edits, etc. anyway, so a flag count just becomes a distraction.\n\nAs for being reversible... Originally, just about every action you could do on the site was effectively reversible: posts could be deleted, comments could be removed, votes could be retracted, closed posts could be re-opened, edits could be rolled back... Flagging was the exception: you flag a post when there's nothing you can do about it, and let the system sort it out. I don't think it was ever intended to be viewed as a concrete action... but, that's how it was implemented.\n\nThen that started to fall apart. Closing was turned into another voting system, with no way to retract a vote. Post deletion was heavily neutered, turned into another voting system. More people gained the ability to view offensive votes, and suddenly they looked just like the other voting systems - vote approval, vote to close, vote to delete, vote to delete as spam, vote to delete as offensive.\n\nAnd that's when i started really noticing a *lot* of offensive votes. When they looked and behaved just like every other vote. \n\nI *don't* think there should be an undo for flags. They shouldn't be used as a stick, with their removal a reward for better behavior. They should be reserved for situations where a post is unsalvageable - flag and move on.\n\nI *do* think close needs to be revamped to be less like flagging. It should be easier to close, and easier to re-open. Close votes should be retractable. Closing a post should be the first option for bad but salvageable   - close it, suggest improvements, open when it improves. \n\nI don't see any reason to allow posting answers to closed questions. When bad/OT posts get closed quickly, they don't collect a lot of answers or people trying to answer them - that's Good. Especially in the case of subjective/argumentative questions, you want to hold off all the subjective/argumentative answers until the question is improved to where it doesn't beg for them."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 11, 2009", "message": "@Shog9\n\nI agree that you get better feedback through comments than through the offensive flag. If flagging were not automatically coupled with deletion (and -100 rep) I would agree completely that there's no reason to see the flag count. If, like Hacker News, flagging a post simply requests moderator review of the post, then there's no real reason why anyone besides the moderators would need to see the flag count. However, when posts are deleted automatically, as is the case on Stack Overflow, it's important to be able to see how far away a post is from that threshold, especially since a deleted post is locked and cannot be undeleted except by starred moderators.\n\nAs far as reversibility goes, again I argue that as long as the offensive flag triggers automatic deletion there should be a way to reverse a flag you activated. The automatic expiration of flags works in this capacity to some extent, as well as the rollback method for resetting the flag count. However, there's no way for a person that's flagged a post to change their mind. If the flag were simply a cue for a moderator to review the post it wouldn't matter, but since automatic deletion is involved I think it's necessary.\n\nI have an idea that might act as a compromise: keep offensive vote counts hidden, but once a post has reached a certain threshold allow people to vote on the post's deletion. The current method to delete a question (aside from the offensive vote) is to close, wait two days, then delete. To prevent abuse, those that vote to delete can't have been the ones that flagged it as offensive. This might sound complicated, but the process is identical to the current method for closing without the two-day window in between.\n\nFinally, with regard to posting an answer to a closed question, I was trying to explain that it's frustrating after writing a fairly in-depth answer to a question it's suddenly closed without warning and you're forced to either toss your answer or try to integrate it with the existing ones. My strategy to avoid this has been to get an answer out fast (one or two sentences) to a question that looks like it might be closed then to edit it with the full answer, since edits are still allowed after a question is closed. However, oscillation between closed/open is still a problem that's being fed by the current mechanisms for closing and reopening a question. I think that both reversible votes and the ability to cast preemptive votes (i.e. \"keep open\" or \"keep closed\") can help to curb this issue."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Apr 11, 2009", "message": "Why no Best of Stack Overflow option?"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 11, 2009", "message": "nobody_:\n&gt; I have an idea that might act as a compromise: keep \n&gt; offensive vote counts hidden, but once a post has \n&gt; reached a certain threshold allow people to vote on \n&gt; the post’s deletion. \n\nThat effectively makes removing truly abusive posts a long, two-step process requiring twice as many active users. \n\nAnd for what? Abusive posts can and have been a problem at various points, but near as i can tell, malicious deletion by way of offensive voting has not been - yeah, there are questions that will collect a handful of offensive votes here and there, but it's rare to see them garner enough to actually do anything. With the count hidden, i expect to see this reduced further (no bandwagon jumping voters).\n\nIf the votes are deserved, then that will be obvious from the question itself. You can and should still warn the user who posted it, and if they care at all then they'll edit it, stop getting flagged, and eventually the cast votes will wear off. If they're inattentive, then the question will remain bad and be removed. Either way, a net win for everyone else on the site.\n\nnobody_:\n&gt; it’s frustrating after writing a fairly in-depth \n&gt; answer to a question it’s suddenly closed without \n&gt; warning\n\nIf you start to reply to a post with *any* close votes, then you have your warning. If it's closed for being a dup, then you should be provided with a link to the original, where you can post your answer; otherwise, the question was inappropriate and you should just move on - at least you were notified before you wasted too much time writing a long answer.\n\nI strongly suspect that this latter issue is only a real concern if you make a habit of answering extremely subjective / argumentative / Off-Topic questions. I've never written an answer to a programming question and found myself locked out...\n\nThat said, it *would* be nice to have the ability to retract a close vote, to avoid the long close/re-open process for questions where the author or an editor *is* able to substantially improve the question.\n\nCAPTCHA: not mecca"}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Apr 11, 2009", "message": "I don't understand why the information is now only visible to moderators. Why is that?\n\nAlso other posters are correct: this (along with close votes) should be reversible. If you identify a problem and the OP fixes it, why can't we change our mind?\n\nWe used to have a 10k rep tool to see things flagged with 2 or more offensive votes. This kind of thing was useful for bringing problematic content to our attention. I really don't understand the rationale for removing it."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 11, 2009", "message": "@cletus: the tool is still there. Now shows posts flagged offensive or spam."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Apr 11, 2009", "message": "@shog: yes I just noticed this.\n\n@Jeff: you might want to change that language a bit. \"Moderators\" != \"10k+ rep users\"."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 11, 2009", "message": "> Why no Best of Stack Overflow option?\n\nthere will be for comments"}, {"author_name": "csmba", "gravatar_hash": "e8ec9371b0173179ee41dd68e0e80ddd", "author_url": null, "date": "Apr 12, 2009", "message": "The hard threshold may be ok, but if you notice it is being gamed or simply is too harsh (creates False positive deletes) then I have an alternative (that is, do not just play with the threshold).\n\nWhy not make the threshold dynamic based on the number of page views? you will be asking basiclly, is a X% of the people that looked at this think it is XYZ. only of x% think XYZ I will do ABC."}, {"author_name": "Keith", "gravatar_hash": "1071b6f3de4155f89264e0d61a167d23", "author_url": null, "date": "Apr 12, 2009", "message": "Maybe you can use this to implement a tattle-tale badge!"}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Apr 14, 2009", "message": "\"Why no Best of Stack Overflow option?\" - I expect that questions with highest favorite counts might give that information, but there's no equivalent for answers and comments.\n\n-Adam"}, {"author_name": "Michael Pryor", "gravatar_hash": "83678606ffe33ee7c1fb50b97338daed", "author_url": null, "date": "Apr 15, 2009", "message": "Why do we even have a close question feature?  It's an ELECTRONIC DATABASE! You don't need to \"clean house\"!!!  We're not running out of disk space.\n\nIf someone wants to ask a not programming related question, then either answer it or ignore it!  Who cares?  \n\nThis whole idea of cleaning up electronic data is stooopid.  You only browse SO via the first page of questions.  Thereafter everything is search related.\n\nWe get new people coming to the site, registering, then asking a newbie question and everyone jumps on them and closes their question because you've encouraged it by giving them TEN reasons why questions can be closed.\n\nAnd wtf is with the reason \"This belongs on uservoice\".  Why?  StackOverflow is THE BEST PLACE TO ASK QUESTIONS ABOUT STACKOVERFLOW."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 16, 2009", "message": "Prime example of open/close oscillation nonsense:\nhttp://stackoverflow.com/revisions/756650/list\n\nExtra irony for being a topic about why it's necessary to close questions."}, {"author_name": "Rich B", "gravatar_hash": "680b8d4a9b843a858148493db5ef0164", "author_url": null, "date": "Apr 20, 2009", "message": "@Michael Pryor: The community certainly does not seem to agree with you in the flamebait you posted on SO.com, and even Jeff Atwood seems to agree with none of your points.\n\nDid you just happen to wake up and realize everyone made a site without you and you are now upset that it isn't everything you wanted it to be?\n\nWhy didn't you express these views during the development and planning, or at least during the beta?"}, {"author_name": "belgariontheking", "gravatar_hash": "2a2f9018942bf8e582faff47eb169fdf", "author_url": null, "date": "Apr 20, 2009", "message": "@Michael: I really think it is sad that you think that cleaning has something to do with reducing disk space.  It's about reducing the chaff so we have only wheat on the site.\n\nDude, chill out.  You're gonna have a heart attack by the time you're ($age + 1).  I bet you've already had an eye squirt blood onto your keyboard."}]}