{"response": [{"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Apr 13, 2009", "message": "It would be interesting to see the edge cases of the 2nd graph. ie. a user with low reputation but that upvotes or downvotes a lot. And likewise with a high rep user."}, {"author_name": "Brian Campbell", "gravatar_hash": "6aa87e056bd2ee342fbd56eb2110603c", "author_url": null, "date": "Apr 13, 2009", "message": "<blockquote>You could view reputation as a measure of how invested someone is in the site, not just a measure of their perceived competence.</blockquote>\n\nHmm. In my experience, reputation is much, much more heavily correlated with how invested someone is in the site than how competent they are. There are a lot of good hackers who have low rep just because they don't post all that often; and I've seen some people with moderately high rep who don't have much of a clue. Since upvotes increase rep so much faster than downvotes reduce it, someone who posts prolifically but gets as many down votes as up will still get a high reputation eventually."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 13, 2009", "message": "> someone who posts prolifically but gets as many down votes as up will still get a high reputation eventually.\n\nSure -- the time != value proposition\n\nhttp://www.codinghorror.com/blog/archives/000524.html\n\nI think that's why some have proposed a \"divide rep by # of questions/answers\" sort of mechanic or statistic."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Apr 13, 2009", "message": "The SonicWALL Content Filtering Service thinks http://blog.stackoverflow.com/ is Pornography.\n\nhttp://img187.imageshack.us/img187/983/sonicwall.jpg\n\nhttp://cfssupport.sonicwall.com/Support/web/eng/newui/viewRating.jsp"}, {"author_name": "Peter", "gravatar_hash": "745edd0ed5ca0851d9134bff34dd6588", "author_url": null, "date": "Apr 13, 2009", "message": "@Zack: LOL, I guess everybody has their own idea of what's hot :)"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 13, 2009", "message": "@Zach\n\nIt's probably due to all the pictures of scantily-clad servers Jeff's been posting\n\nhttp://blog.stackoverflow.com/2009/01/new-stack-overflow-server-glamour-shots/"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Apr 13, 2009", "message": "Dividing rep by #questions/answers wouldn't work without also removing the rep cap (or not applying the rep cap when calculating that value) - otherwise you're saying that 20 answers with 10 upvotes each (in a day) exhibits the same skill/value/whatever as a single answer with a single upvote. Both have a rep/answer value of 10, because of the rep cap of 200. Even if half of those answers are accepted, you end up with a rep/answer value of 17.5 - less than a unaccepted single answer with two upvotes.\n\nI haven't seen much sign of cluelessness amongst high-rep users - which isn't to say it's not there, of course. I'd say it's a measure of more than *just* time invested, but I don't really think it's important to try to pin down exactly what it means.\n\nRep is a measure of how many upvotes, accepted answers, downvotes etc you've received. Any attempt to correlate that to anything more meaningful will run into exceptions, subjectivity, strange aliasing effects due to things like the rep cap - any number of issues. It's best not to try to make that correlation in the first place, IMO."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Apr 13, 2009", "message": "Thinking about it further, while I'd in no way want to absolutely equate time with value, I think there's a difference between \"skill\" and \"value to the site\" which should be acknowledged.\n\nConsider two developers - one is an \"average\" developer who spends an hour a day on Stack Overflow. He answers three or four questions a day, thoroughly and correctly but without ever needing or displaying brilliance. He's solid, but he'd never really \"wow\" you at an interview.\n\nNow let's suppose Linus Torvalds or Donald Knuth signed up, answered a single question absolutely brilliantly, and then disappeared in the end.\n\nSurely there's no question as to which developer is the most skillful/competent. However, which is actually of more value *to Stack Overflow* as a resource? The \"plodder\" IMO.\n\n\nI'm not entirely sure that I support the way that downvotes matter so much less than upvotes, as it precisely means that you *can* get away with gaining rep from a question where 9 people downvote you for being incompetent but 2 misguided souls upvote you. The answer will show as -7 of course, but you'll still have gained 2 rep.\n\nI'm a bit of an extremist when it comes to accuracy, as any readers of my book reviews will know - I find the general accuracy level of technical books to be somewhere between dismaying and shocking. I apply the same thoughts to Stack Overflow answers, albeit slightly less strictly, as at least no-one's *paid* for inaccurate answers. I think it's a pity that people can write complete rubbish and still earn a positive reputation. However, I think relatively few people actually do that. I suspect that most people would be pretty ashamed of answers with strongly negative scores and would try harder to be more accurate next time. Maybe I'm just too optimistic though.\n\nAnyway, the overall point of this waffle is that while I don't support inaccuracy at all, I *do* think that a mixture of competence and dedication is a very good thing for the site. Frankly, relatively few questions *call* for brilliance. (Good thing too, from my point of view... ;)"}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Apr 13, 2009", "message": "Is anyone able to download this anonymous data? I for one would be interested in getting a copy for analysis."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Apr 13, 2009", "message": "@cletus\n\nFrom what I can tell there's no secret data here, just the vote counts for every user which can be found on the profile page. Although Joel has expressed dislike for screen scrapers (even going so far as talking about \"banning\" them on the last podcast) it's nevertheless an effective way of getting this information. Back when I scraped I usually did it at like 3AM on the weekend when the traffic was the lowest as to not overwhelm the server."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 13, 2009", "message": "> I suspect that most people would be pretty ashamed of answers with strongly negative scores\n\nThat's right, and that's why the voting system works the way it does -- intrinsic motivation should win out.\n\nAnd for the users who don't <i>care</i> that all their posts are negative.. well, that's plainly visible for everyone to see, too, and react accordingly."}, {"author_name": "gamecat", "gravatar_hash": "0b4b433679e1fb52f7e2ef4ea492496d", "author_url": null, "date": "Apr 14, 2009", "message": "&gt;  I think it’s a pity that people can write complete rubbish and still earn a positive reputation.\n\nWell, if it is upvoted, somehow the community thinks its valuable. And that's both teh power and weakness of democracy: \"anybody can vote.\"\n\nBut then again, there is common sense. If you just implement the highest voted answer without testing or checking out the other answers (and the comments) then you can expect disaster sooner or later."}, {"author_name": "Nick", "gravatar_hash": "ac6c9ecd35650e2ec795c0303d2554f4", "author_url": null, "date": "Apr 14, 2009", "message": "I would hope that you are at this moment preparing the anonymous voting information for download by the the rest of the community."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "Apr 14, 2009", "message": "@nobody: that's kinda my point. I could get this information by scraping. Such a scraper is actually on my to do list but currently low priority as I've got a crapload of other stuff to do and the Uservoice ticket suggesting public information dumps would be made available, which would be my preferred means of acquiring this (public) information."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "Apr 14, 2009", "message": "@gamecat: My issue is that you can still gain positive reputation if *most* of the community recognises your answer as being rubbish, hence my example of an answer with an aggregate vote of -7, but which still increases the rep for the poster. That feels somewhat odd to me.\n\nI don't think it's actually causing a significant problem, but it's still odd."}, {"author_name": "gamecat", "gravatar_hash": "0b4b433679e1fb52f7e2ef4ea492496d", "author_url": null, "date": "Apr 14, 2009", "message": "&gt; That feels somewhat odd to me.\n\nIt is ;-).\n\nAnd it is even biassed because downvoting needs more rep and it cost rep to downvote. \n\nStackoverflow is focussed on the positive side of voting. It encourages upvotes en slightly discourages downvotes. \n\nThere are two sides to the story. Per question/answer the ratio is one on one (each upvote is countered by a single downvote). Which is cool because this gives the community a tool to order the answers according to the common common sense (pun intended). \n\nRep is another story. If you provide usefull content (again according to the community) you will gain some points. And yes you sometimes get a lot of points with a silly answer and the brilliant answer that took a lot of work only got a few upvotes (if any).\n\nI view a downvote as a signal. Most of the time it turns out I haven't understand the question or there is new information added. Normally I delete these answers or I edit them. So the overall quality of the answers is enhanced.\n\nIf there is a real bad answer with lots of upvotes, you can either provide a better one and comment on the bad answer. Or you can call it offensive (if it is) or warn a mod (which is a cool new feature). But in the end, the community decides. But I would be surprised if I told you something new. ;-)."}, {"author_name": "Isaac Waller", "gravatar_hash": "5dad9f874a3a69c451d1280682a50c96", "author_url": null, "date": "Apr 16, 2009", "message": "This is not fair. I visit Stack Overflow twice a day at least and I still only have 150 rep. Why? Because I spend it all on bounties! I feel like they have destroyed the community, because in order for your question to be really noticed, you have to sacrifice some of your own rep (and a lot.) My reputation peaked at 350 :("}, {"author_name": "Graphain", "gravatar_hash": "ebbed120580f668d0d76b1805ca14c28", "author_url": null, "date": "Apr 17, 2009", "message": "I think some of the outliers towards the higher reps may indicate that there is less motivation to try and rep gain once you have achieved all (or most) of the powers on the site.\n\nAlso, @Isaac Waller, I've found unless your problem is really obscure you never need a bounty.  In fact, most of the times I want to use a bounty are for urgency and those are the times you can't use it.."}]}