{"response": [{"author_name": "Purslane", "gravatar_hash": "2acda5365ade04b5964de0502116a037", "author_url": null, "date": "Apr 17, 2009", "message": "I still agree with Michael that it is ridiculous to answer a question and then vote for deletion. If you think a question is among the worst of the questions, dangerous to the community, than why would you answer it first? If it is worthy enough to answer, isn't it worthy enough to stay?\n\nFor the rest, I agree with you that it is good to delete very bad questions, but I must say that stackoverflow is the most inconsequent of all the q/a sites I visit. It seems entirely random to me when a subjective question is allowed to stay and when it is deleted. \n\nThe \\does anyone else think this version of MSDN is preferable\\ is clearly not a real question, does not solve a problem, and was just someone who wanted to share his/her discovery, for example. There is no \\best answer\\ and the \\answer\\ with the most upvotes is a snarky \\Microsoft finally discover ... HTML?\\\n\nOn the other hand, this question: http://stackoverflow.com/questions/756063/do-you-have-a-physical-developer-busy-indicator-closed clearly seems to fall under \\Questions about social engineering, management, or career building, ergonomics, or other “soft” topics related to development work.\\, yet it was closed as \\not programming related\\. One closer said he closed it because it was \\subjective and argumentative\\, but it was clearly not argumentative (maybe the closer does not know what that word means?), and subjective is an often used tag with almost 4000 questions, so clearly that in itself is not a problem.\n\nI really understand that closing and deleting is subjective as well. People are not robots. But still, I think this randomness is much worse on Stack Overflow than on, say, Ask Metafilter."}, {"author_name": "Purslane", "gravatar_hash": "2acda5365ade04b5964de0502116a037", "author_url": null, "date": "Apr 17, 2009", "message": "I have no idea why all my quotation marks turned into backslashes."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 17, 2009", "message": "1) Question #756063 should not be closed and I have reopened it. This is the \"normal disagreement\" part.\n\n2) Question #753871 was edited into shape (I agree with these edits completely) and is certainly programming related per \"use of software tools used in the development process\". It's about a common programmer reference site (MSDN) and also a philosophy of building websites (simple+fast often beats fancy+slow+complex)."}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Apr 17, 2009", "message": "Jeff, it's worth mentioning that a questions should only be asked if : \n\n* There is not a simillar question already asked (and maybe even answered) on the site\n* The info is easily findable using a search engine (ie: Why do I get a ThreadAbortException when using Response.Redirect()?)"}, {"author_name": "Alex Angas", "gravatar_hash": "150413748d6f503b2109cca74746f129", "author_url": "http://alexangas.wordpress.com", "date": "Apr 17, 2009", "message": "Andrei: I don't agree with your second point. Especially when Google takes me to Experts Exchange."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 17, 2009", "message": "Andrei: good point. Though I would hope that #1 and #2 are the same thing, in that web searches SHOULD lead you back to Stack Overflow if the question was already asked there.\n\nThis is also, by the way, an argument for intentionally HAVING duplicates. I've said many many times before that people have the most uncanny ability to ask the same exact question using completely different words.\n\nBetter duplicate handling is a very high priority for us at the moment, right after we finish the comment refactoring still in progress."}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Apr 17, 2009", "message": "@Alex Angas : Yes, I haven't thought of the dreadful Experts Exchange.."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Apr 17, 2009", "message": "Purslane, I hope you meant \"inconsistent\" and not \"inconsequent\".\n\nJeff, thanks for clarifying this for us.  I know I've recently voted to close some questions that were in the gray area, so I think this will help me make adjustments.  I think the biggest gray area is in \"Questions about social engineering, management, or career building, ergonomics, or other “soft” topics related to development work.\"  This is where we seem to get questions like \"How do I convince my boss to give me a raise? For programmers.\"  It's really a question that could be asked in any profession, so it's not *specific* to programming, so it tends to get closed.\n\nAlso, good point above about intentionally allowing some duplicates.  I know I've searched for the original of a question that *I've answered before* and not been able to find it.  A couple of tools that I've found helpful are a custom Google search page http://www.google.com/coop/cse?cx=018205968162215846785:7n6ajnwyz-i (which I found on Joel Coohoorn's user page, I don't know who made it) and http://askjonskeet.com/ created by Andrew Rimmer.  You can customize AJS for any user by modifying the URL with a user's id number.  My AJS page, for example, is http://askjonskeet.com/user/1288/Bill/search"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "Apr 17, 2009", "message": "I think it's that last point from the list that his given the most trouble:\n\n&gt; Questions about social engineering, management, or career building, ergonomics, or other “soft” topics related to development work.\n\nA large segment of the community doesn't want to admit it exists.\n\nIt's also good to hear that the handling of duplicates is about to receive some attentions."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "Apr 17, 2009", "message": "@bill: I made that custom search, because I wanted something like it.  It's not hard to do, though, and I know I'm not the only one who's put one together for SO.  \n\nI know it should also be possible to also limit that search to only question pages (right now it often returns unhelpful results from user profile pages), but I haven't been able to get that working for the cse yet and I've pretty much given up trying.  If someone else can figure that out I'd appreciate knowing how it's done. (-inurl:users doesn't work with the cse for some reason :( )"}, {"author_name": "capar", "gravatar_hash": "5f9291215de1b7b03154b48360f62252", "author_url": "http://stackoverflow.com/users/31044/capar", "date": "Apr 17, 2009", "message": "Thanks Jeff! I'm very pleased to read this. Hope springs eternal."}, {"author_name": "Out Into Space", "gravatar_hash": "4a4321cffc7fb51be0ca54f341e01e31", "author_url": null, "date": "Apr 17, 2009", "message": "@Bill the Lizard: I agree with you about the \"for programmer\" aspect of soft questions. I think the best approach is to evaluate each question on its own. If someone says, \"As a programmer, how do I get a raise? Thanks\", that's a good candidate for closing. But if someone says, \"I just earned my Java certification and I think I should get a raise. How do I leverage my new qualifications in a discussion with my boss?\", I think that should stay.\n\nThose are just silly examples, but I think they get my point across. What do you think?\n\nAnd to Jeff: THANK YOU for this post. This will help so much."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Apr 17, 2009", "message": "@Out Into Space:  I'd agree with you on those two questions.  If \"soft\" questions are allowed to stay then an effort needs to be made to show why programmers specifically should care about them.  That effort needs to go beyond tacking \"...for programmers\" onto any generic question.  Otherwise, this is just Yahoo! Answers.\n\nAnother interestingly gray question I saw today was http://stackoverflow.com/questions/760121/is-there-a-way-for-elegant-source-code-listings-in-openoffice-org-writer  It's asking about using word processing software, but in a way that I think only programmers would know about.  This is probably a good place to ask that question, since there are good odds that someone here might know (despite having no answers as of this writing)."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 17, 2009", "message": "I'd like to shamelessly plug my UserVoice request for an authorized forum for meta-discussion: http://stackoverflow.uservoice.com/pages/general/suggestions/106921-provide-an-authorized-location-for-meta-discussion-\n\nBeing able to talk about specific questions without cluttering the question, its answers and comments would be a big step in the right direction.  Being able to talk about meta-issues when Jeff has not blogged about them would be a plus as well."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Apr 17, 2009", "message": "There's a glaring bug in the FAQ/design of SO, and that's the decision to banish away all questions related to the site itself to some weird bug system web service called UserVoice.\nThe community seems to be divided on this matter, and the fact that the FAQ and many high-rep users are on one side of this divide has a really nasty side-effect: whenever the issue is raised the questions is closed and usually a closing-war ensues. \n\nHere's why. \n\nWhen one side tries to speak its mind by saying \"user voice is no place to discuss question like this\" and the other side basically says \"shut up and move it to user voice\" - well, that's when you get questions with 200+ comments and (rare) mod wars, like we had today with Pryor's question (which I voted to reopen, just for complete disclosure here). \n\nUserVoice is a decent issue tracker, but no place for a community to discuss its ground rules, and decide how to shape itself. As a forum, it's a bad system. As a system for suggesting solutions, voting on their merit and even debating them, it's useless. But wait, I know such a place!\n\nThus, the 'sofaq' tag, I'm arguing, especially when used in a wiki-question, should be an exception to the rule, and the \"belongs on UV\" close should only be used on purely bug/feature request-type questions. And please, no \"slippery slope\" arguments. \n\np.s.\nIt's a damn shame I have to write this here and can't discuss it on SO itself. Blog comments are also less than ideal for the above purpose. \nJust let us discuss SOFAQ on SO already, sheesh. It's obvious that lots of people want this, so just accommodate, won't you?\nYou can make the sofaq tag ignored by default, or whatever. But just admit already that the decision to disallow discussion _of_ the site _on_ the site, and moreover the terrible idea to hold such discussions in the nasty UV system, was wrong and it's time to reverse it."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Apr 17, 2009", "message": "Oops, in my last comment:\n\n| But wait, I know such a place!\n\nShould have been:\n\n| But wait, I know of a better place!\n\nThe point was, of course, that SO is the perfect place for discussing SO.\n\nA shame this couldn't be discussed on SO, where I could have edited my post and corrected it..."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "Apr 17, 2009", "message": "@Assaf:\n\nThe sofaq tag is now itself cluttered and nearly worthless.  Something more like the sofaq-proposed tag is a little better, allowing users to only move \"important\" items to \"sofaq\".  The current \"sofaq-official\" tag almost works instead, but not enough of the main questions are promoted and users who don't know the system will expect the sofaq to to arleady be official."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Apr 17, 2009", "message": "@Joel, good idea. \nThere's really no reason for a separate \"section\" of SO, as some have suggested, for meta-questions. The tag based approach is just what's needed."}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 17, 2009", "message": "Here's another one that was closed inappropriately:\nhttp://stackoverflow.com/questions/762033/which-actions-would-you-assign-if-you-had-pedals-under-your-feet/762057#762057\n\nThis is an honest (and fun) question about a potential piece of hardware that could be useful for programming.  Why bother closing this?"}, {"author_name": "Purslane", "gravatar_hash": "2acda5365ade04b5964de0502116a037", "author_url": null, "date": "Apr 17, 2009", "message": "Thank you for correcting me Bill. You are right, I did mean inconsistent."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 17, 2009", "message": "@Assaf:\n\nUserVoice makes a lousy forum. SO makes an even worse one. At least UV defaults to displaying answers in chronological order, giving you some hope of sussing out conversation threads as you read from start to finish... SO - by design - makes discussion difficult. \n\nSo why on earth would you choose SO over anything else for hosting a discussion... even a discussion related to SO?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 17, 2009", "message": "> This is an honest (and fun) question about a potential piece of hardware that could be useful for programming. Why bother closing this?\n\nhttp://stackoverflow.com/questions/762033/which-actions-would-you-assign-if-you-had-pedals-under-your-feet/762057\n\ntoo hypothetical of a \"what if\" to stay open IMO. If it was actual experience, or proposing the adoption of a real product.."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 17, 2009", "message": "> I think the best approach is to evaluate each question on its own. If someone says, “As a programmer, how do I get a raise? Thanks”, that’s a good candidate for closing. But if someone says, “I just earned my Java certification and I think I should get a raise. How do I leverage my new qualifications in a discussion with my boss?”, I think that should stay.\n\nI agree, and that conversation (if necessary -- I think this case is rather clear, personally) can happen in the comments of the question."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 17, 2009", "message": "BTW, Jeff - thanks for providing an epilogue for this. Hope it stays one... ;-)"}, {"author_name": "Princess", "gravatar_hash": "e3ca6bc8243a1cb06886cf8daa923f0e", "author_url": null, "date": "Apr 17, 2009", "message": "Maybe a community messageboard would be beneficial to the SO community. It would at least serve as an outlet for people who want to have idle chatter with one another.\n\nI think the obvious counter argument is \"go to another site if you want to make chit-chat\" -- that's one option, but I'd like this group of people and would love to talk with them, share recipes, have extended off-topic discussion, talk about politics, have SO community meet-ups, and so on.\n\nI personally think silencing all off-topic discussion is bad for the community. People *hate* censorship, they *hate* being stifled, even their comments aren't particularly worth saying the first place. The best thing SO can do is embrace miscellaneous banter and discussion, just keep it out of the Q&amp;A by channeling it all into a messageboard. You'll get a much happier community as a result.\n\nUntil then, prepare for an increasing inter-community war between pro/anti-censorship, pro/anti-SO purity, and so on."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Apr 18, 2009", "message": "@Shog, \n\n1. Sort posts by newer, problem solved.\n2. SO isn't a discussion board, I agree, but whatever it is, it's what I want for discussing SO. I think someone called it \"crystallization\" of knowledge. A great term. I want to be able to discuss SO itself in a way that the best answers float up and may be edited by the community.\nOh common, I have to explain why SO is a brilliant system for discussing SO? Why should it be good for programming questions and bad for meta-questions?\nI think everyone can agree that SO's style Q&amp;A would be very helpful for discussing the forum/community itself. And please don't get me started on UV..."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Apr 18, 2009", "message": "Like a few others have already said, these clarifications don't really answer what's probably the biggest source of non-programming related questions: Where do we go if we want to ask \"meta-questions\" about SO? What do some of the buttons or icons do, or how should I treat a question like X?\n\nShould we ask those questions on SO? Should we give them a specific tag? Should they go on Uservoice?\n\nI don't think either solution is really good. sofaq is cluttered and useless, the community wiki is treated as a garbage bin for any question that people disagree on.\nAnd UV is for issue tracking and feedback.\n\nHow about the simplest possible solution? Host a plain old wiki for this? That may be the best way to create a comprehensive user guide to SO, allowing these metaquestions to be answered. In any case, there has to be *some* legal way to ask \"how does this site work?\"\nAnd at the moment, there isn't."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 18, 2009", "message": "> sofaq is cluttered and useless\n\nDid you ever wonder <i>why</i> sofaq is cluttered and useless?\n\nPerhaps because the <b>STACK OVERFLOW ENGINE IS NOT GOOD AT DISCUSSION?</b> And that's what the sofaq has become. Discussion.\n\nThe SO engine is great for focused Q&A. It is pretty bad for random discussion. So all of you who are asking for a discussion area in Stack Overflow itself, take a long, hard look at how bad the sofaq tag has become. Seriously. Get in there. Sit down and read through some of these.\n\nhttp://stackoverflow.com/tags/sofaq\n\nI spent a few hours cleaning it up tonight and I barely made a dent in the sprawling mess it has become.\n\n<b>Be careful what you ask for. Corollary: stop asking for things that are clearly ALREADY. NOT. WORKING.</b>\n\n> there has to be *some* legal way to ask “how does this site work?”\n\n1) If it isn't fairly obvious how the site works, if you need a giant linked 50 question FAQ to figure it out, then we have <i>utterly failed</i>. Everything else is irrelevant at that point.\n\n2) You can ask about SO, it just gets answered, closed and deleted eventually. This can be OK, in that these questions have a brief lifecycle, but it's symptomatic of a deeper problem. See #1.\n\n3) In all honesty, it is my opinion that the FAQ should just be a static web page that we hand edit. The sofaq is far too complex, and far too detailed. Will the average user actually read through all that sofaq material?"}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Apr 18, 2009", "message": "@Jeff, you're still not addressing the fact that UV is an even worse place for discussions, AND that some of the questions asked about SO are just as \\questiony\\ as the programming questions. The latter would benefit from being discussed on SO just like any programming question.\n\nThere's just no reason why SO would work for programming and not for SO itself. \n\nAbout the so called sofaq mess, I really don't know what you're talking about. I found great answers to some of my SO related questions on the sofaq tag. If anything, because it's such an inherently meta tag it benefits even more from the continued crystallization effect, because it's always revisited. Anybody who visits the site even semi regularly ends up going through sofaq questions at some point. Sorting the sofaq questions by votes gives wonderful results, so I really don't see what you see wrong with this tag. \n\nAlso, have you considered that the questions in sofaq aren't as clean as they could be because half of them get closed prematurely?"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Apr 18, 2009", "message": "&gt; 2) You can ask about SO, it just gets answered, closed and deleted eventually. This can be OK, in that these questions have a brief lifecycle, but it’s symptomatic of a deeper problem. See #1.\n\nI don't see a problem with this.  They type of person who is going to ask questions about Stack Overflow are new people who don't know their way around yet (this is almost a definition).  If you just direct them to the correct page in the FAQ or unofficial FAQ, then vote to close, the question doesn't clutter the site for long.\n\nI see no difference between this and closing a question as a duplicate.  People rarely complain when their question gets closed as a duplicate **if you provide a link to the original question**.  As long as they get an answer to their question, most people are happy."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 18, 2009", "message": "Assaf:\n&gt; 1. Sort posts by newer, problem solved.\n\nNo, it isn't. You've just added another unwritten rule to the set that applies to discussion questions. Eventually it might end up something like...\n\n  1) Make question CW\n  2) Sort answers by timestamp\n  3) Reply using @name and link to the answer you're replying to.\n  4) Quote small portions of relevant text when necessary.\n  5) Do not edit the original question - post an answer.\n  6) Do not edit answers from other users.\n  7) Do not delete your answer if someone has replied to it.\n\nCongrats - assuming you can get everyone interested in discussion to agree and follow by those rules, you might actually carve out something approaching a real forum. Yeah, you'll have to police it day and night, because new users won't know the rules and won't go looking for them. Yeah, you'll find yourself bogged down in hundreds of tiny arguments over boring little protocol details. And no, you won't get any support from the software, since the SO Team is absolutely against turning SO into a forum.\n\nOr you could just go find a real forum. There are thousands. Or hang out in the IRC channel, if you can deal with using IRC. Or post on UserVoice - it's linked to on every page in SO, if your post doesn't get traffic it's because no-one cares.\n\nCome back to SO when you have a programming question to ask, or feel like answering one. That's why the rest of us are here... ;-)"}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 18, 2009", "message": "Thank you for clarifying.\n\nI agree with others that SOME place -- not UserVoice -- is needed for meta-discussion. Until it appears, we'll continue to have meta-discussion spilling onto SO.  The IRC channel is good for some things, but it sucks as an archive.\n\nThe SOFAQ isn't so bad, as long as you look only at the top answer to each of the questions.  This is an area where we don't need questions + many answers; we need more of a Wiki-like system.  And We already have this by editing the first answer to each of those questions.\n\nWe have a group of people who wish to re-open every question that is closed, it seems.  (Except for obvious SPAM.)  Some people seem to see a closed question -- even questions that clearly violate the intent of the site -- as censorship that needs to be reversed."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Apr 18, 2009", "message": "@Shog,\nI already agreed SO isn't the best discussion forum, far from it.\nI also raised a question: why should SO be good for programming questions and bad for SO related questions?\nI still await an answer on that."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 18, 2009", "message": "Assaf:\n&gt; why should SO be good for programming questions and \n&gt; bad for SO related questions?\n\nSO is good for programming questions because a programming question can have one correct answer. SO provides facilities for creating, fleshing out, and highlighting one good answer per question. \n\nFor SO-related questions that fit that model, SO works - that's the point of sofaq. For instance: \"What is a “closed” question in Stackoverflow? How do they work?\" has one good answer, collaboratively written, describing the mechanics of the \"close\" feature on SO. \n\nFor SO-related questions that DO NOT fit that model, questions that beg for discussion, SO does not work; \"StackOverflow: Why do people close questions?\" has no one answer that could be considered canonical, ultimately requiring this blog post to settle the matter. \n\nAs Jeff notes, the proliferation of the latter ultimately reduce the utility of the former; concrete answers to specific questions are lost in the noise. A search for \"[sofaq] closing\" now returns 31 questions; a search for \"[sofaq]\" returns hundreds of questions; a search for \"[stackoverflow]\" returns hundreds more. Finding a specific answer has become a tedious process; keeping answers up-to-date and accurate is almost a lost cause. \n\nCan you imagine how bad it would be if most SO-related questions *weren't* immediately closed and later deleted?"}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 18, 2009", "message": "&gt; too hypothetical of a “what if” to stay open IMO. If it was actual experience, or proposing the adoption of a real product..\n\nI understand where you are coming from, but I'm still looking for the \"too hypothetical\" drop-down when closing.\n\nSeriously, I understand closing some questions, but closing stuff like this adds no value (think about how similar it is to the minor edit wars) and just serves to annoy people (in this case a newbie).\n\nWhy cause the pain for no gain?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 19, 2009", "message": "> but I’m still looking for the “too hypothetical” drop-down when closing.\n\nIt's under \"not a real question\".\n\n> just serves to annoy people\n\nWell, you know what else is annoying to people? Having a lot of \"what if my arms were made of cheese.. for PROGRAMMERS!\" questions in the system.\n\nI mean, if he had done actual RESEARCH and put some EFFORT in the question -- posting products, reviews, and other concrete ideas.. perhaps. But as a blue-sky \"wow, what if!\", it's not helpful to anyone.\n\nEDIT: got fed up with the discussion and fixed the goddamn question myself. See what I mean?\n\nhttp://stackoverflow.com/questions/762033/is-it-practical-to-program-with-your-feet"}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Apr 19, 2009", "message": "@Shog,\n\n&gt;&gt; Can you imagine how bad it would be if most SO-related questions *weren’t* immediately closed and later deleted?\n\nAre you sure the sad state of sofaq you describe isn't _because_ of the fact so many questions are closed before good answers can be provided for them?\n\nRegardless, let's not throw out the baby with the bath-water. Some of the sofaq question are indeed good, fitting for SO, with properly voted answers. Great. At least let's have these. The not-so-good questions will naturally get lower votes, so the SO effect applies to them and they'll eventually annoy us less.\n\nYou're basically saying that some SO related questions, like some programming questions, don't have clear answers or are argumentative - fine. Close them like you would any other \"bad\" question; but this has nothing to do with being _about_ SO. The mere fact that a question is about SO, right now, causes it to close and thus not get properly answered and voted on. \n\nAlso, I really don't get the whole \"may have a single answer\" criterion you're applying. Since when do programming questions have single answers? That's probably untrue for 99% of questions. That's part of the reason why SO has voting, not just marking \"correct\" answers.\nIf there are conflicting views on SO related issues, let those views all be voiced and voted on. When discussions do occur naturally once in a while (as is the case with programming questions) then they can be held in comments. Not an ideal forum, but (again) NEITHER IS UserVoice. In fact, UV is a much worse place to hold discussions (have you tried? it's a terrible system)."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Apr 19, 2009", "message": "Assaf:\n&gt; Are you sure the sad state of sofaq you describe \n&gt; isn’t _because_ of the fact so many questions are \n&gt; closed before good answers can be provided for them?\n\nSure - have a look, please:\nhttp://stackoverflow.com/questions/tagged?tagnames=sofaq\n\nThe problem isn't that there are too many closed questions - there aren't - it's that there are too many questions, *period*. Questions that are unanswerable, questions that are answered already as part of another FAQ, questions that are flat-out duplicates of an existing FAQ...\n\nA FAQ that grows to include every question anyone might ever have... loses the Frequently, leaving simply Asked Questions. \n\nBut don't take my word for it:\nhttp://stackoverflow.com/questions/tagged/stackoverflow\n\nSort by newest, and go through a few - try to find the relevant FAQ entry by searching SO. See how long it takes you...\n\nAssaf:\n&gt; The not-so-good questions will naturally get lower \n&gt; votes, so the SO effect applies to them and they’ll \n&gt; eventually annoy us less.\n\nSO's voting system relies on people coming to SO with specific questions, finding answers that help and up-voting them, and finding answers that don't and down-voting them. \n\nThat system falls apart for SO questions for two primary reasons:\n\n  1) People don't come to SO to ask SO questions.\n  2) People don't vote on unhelpful questions, they ask their own question, thus contributing to the noise.\n\nWhen's the last time you down-voted a SO question for not being helpful to SO? If the system worked for SO questions, we wouldn't face the problem we face now - therefore, it does not.\n\nAssaf:\n&gt; Also, I really don’t get the whole “may have a \n&gt; single answer” criterion you’re applying. Since \n&gt; when do programming questions have single answers?\n\n\"How do i fill a solid-color rectangle using Win32 GDI?\" True, that question has at least 4-5 specific answers... but for any given situation you're only going to pick one - either the question will be specific enough to indicate one of them, or a single reply can be composed outlining the pros/cons of each approach.\n\nI must apologize - i'm conflating \"answer\" and \"reply\". Any given problem will have one best answer, but a question on SO may not be specific enough to indicate what that answer should be - hence, the semi-wiki power of SO, which allows for melding individual answers into a single reply. \n\nOf course, there are plenty of questions that have *no* good answers; those often still collect opinionated replies, but which one you consider \"best\" will depend entirely on your subjective opinion. SO is little more than a straw-poll system when it comes to these questions; you may learn something from reading the responses, but the top-voted reply indicates little beyond a preference in those who bothered to read it - unlike an answer to a specific question, these replies are rarely verifiable.\n\nAssaf:\n&gt; If there are conflicting views on SO related \n&gt; issues, let those views all be voiced and voted on.\n\nAnd what? What's the outcome? This works to an extent for coming up with internal standards (such as the format for indicating dup posts), so long as enough people are interested in the question to make it work... but does nothing at all for reporting bugs in the system, or contesting the implementation of specific features (beyond, yet again, contributing to the noise). Anything that requires a SO dev to take action based on the outcome is useless on SO, since there's no guarantee a SO dev will ever see it. Like it or not, that's what UserVoice is for...\n\nAssaf:\n&gt; In fact, UV is a much worse place to hold \n&gt; discussions (have you tried? it’s a terrible\n&gt; system).\n\nI hate UV. Everyone hates UV. But 'till SO adopts a proper bugs database, UV is all we have to work with. \n\nAnd please, do a bit of research: \n\nhttp://stackoverflow.uservoice.com/users/32266-shog9\nhttp://stackoverflow.uservoice.com/users/265740"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Apr 19, 2009", "message": "Addressing Assaf's question of: \"why should SO be good for programming questions and bad for SO related questions?\"\n\nNow that Jeff has done a single clone for serverfault.com, it seems it shouldn't be too hard to do a similar one for \"questions about Stack Overflow\" rather than \"questions about programming\" or \"questions about IT\".\n\nThe name for it is pretty obvious: StackOverflowOverflow.\n\nOf course, we might then need a forum for questions about SOO: StackOverflowOverflowOverflow. And so it recurses. What do we get after we do this too much? A stack overflow."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Apr 19, 2009", "message": "Jon, I didn't get that you were joking until you gave a name to the beast.  Well played.\n\nDoes StackOverflowOverflowOverflow sound like a Java Enterprise class name to anyone else?"}, {"author_name": "Fernando", "gravatar_hash": "f18fe189ba44c9592ec230c9fa40ff79", "author_url": "http://www.barrocal.com", "date": "Apr 19, 2009", "message": "May I ask about a question I wrote ? What your opnion about that ?\n\nhttp://stackoverflow.com/questions/696949/how-a-developer-should-sell-his-skills"}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 19, 2009", "message": "&gt; I mean, if he had done actual RESEARCH and put some \n&gt; EFFORT in the question — posting products, reviews, \n&gt; and other concrete ideas.. perhaps. But as a blue-sky \n&gt; “wow, what if!”, it’s not helpful to anyone.\n&gt;\n&gt; EDIT: got fed up with the discussion and fixed the \n&gt; goddamn question myself. See what I mean?\n\nHonestly, I appreciate your attention on this, and some of your changes are clearly an improvement.\n\nBut in other ways, it is now even more confusing:\n\n1. Now you are saying that it was programming related, but a bad question.  Thats obviously not what it was closed for initially based upon what people were saying.\n2. You are also saying that the way to fix it is to include lots of specifics (reviews, etc) which basically answer the question... in the question.\n3. Even if all of the above are reasonable truths, you are also saying that it is better to close such a question, eliminating the possibility of it being usefully cleaned up, than to foster a reasonable set of answers.\n\nDo you get my point here?\n\nIn any case, I'm glad that the question was cleaned up and answered.  There are some interesting ideas there actually."}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Apr 19, 2009", "message": "@Fernando:\n\nJust my opinion (obviously), but to me the only criteria from Jeff's description above that applies is this:\n\n&gt; Questions about social engineering, management, or career building, ergonomics, or other “soft” topics related to development work. \n\nAccording to many, it was non-programming related.  To me personally, however, it fits the above criteria and therefore is programming related by the SO criteria.\n\nJeff says it is too narrow.  Maybe thats true, but I haven't seen the criteria for that anywhere, and I don't really understand how tips for a one line job description is too narrow (if anything, to me it sounds like it has the potential to be too broad)."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Apr 19, 2009", "message": "@Bill: I'm not completely joking. SOO would be useful, I suspect - and I think that would be the best name for it, too.\n\nThe recursion part was a joke, but just the one level seems reasonable."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 20, 2009", "message": "> But in other ways, it is now even more confusing:\n\nNow that I've thought about this more, I think I know the root cause. \n\nThe OP was not asking:\n\n<i> \"I've tried (x) and I have the following issues/concerns with (x).\" </i>\n\nHe was asking:\n\n<i> \"What about (x)?\"</i>\n\nWhich is, in my mind at least, analogous to this:\n\n<i> \"I need code to do (x)!\"</i>\n\nWhereas what we encourage people on Stack Overflow to do is:\n\n<i> \"I've tried writing / researched (x) and I can't quite get it to work / figure it out. What am I doing wrong?\"</i>\n\nYou can't expect others to put effort into something when you haven't put any in yourself."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Apr 20, 2009", "message": "&gt; The name for it is pretty obvious: StackOverflowOverflow.\n\nWhere's the damn up arrow on this answer?"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 21, 2009", "message": "All the following (the last 4) are very subjective.  It is amazing that people feel the need to close questions that are related to development.  It is a subjective scale and I find it funny that some people think hey should judge the content.  \n\nPeople ask questions about version control - which is not a programming question - it is a tool related question.  But those are mostly answered.  But if you ask a question about Excel (which is specifically mentioned below) or Word or other programming RELATED software - they are likely to be closed.    \n\nVery inconsistent.  \n\n# Questions about best practices and other aspects of programming, including use of software tools used in the development process, standards for maintenance and readability of code, advice to avoid potential coding pitfalls, etc.\n# Questions about software tools that, while not directly related to software development, involve some scripting or programming themselves, for example, Excel or Matlab.\n# Questions about hypothetical problems that don’t necessarily have real-world applications, for example “code golf” or the “FizzBuzz problem”.\n# Questions about social engineering, management, or career building, ergonomics, or other “soft” topics related to development work."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "Apr 21, 2009", "message": "@tim: Version control exists for the primary purpose of development.  This doesn't compare to Excel and Word, which overwhelmingly are *not* used for development.  Word and Excel are not programming related.\n\nIf someone asked a question about Word or Excel that was *directly* related to programming, I wouldn't vote to close it, but almost all questions I see about these programs are related to writing or computing, not to programming.\n\nBy your logic, tongue in cheek here, I could ask about clothing, because I have to wear clothing to go to work.  Or I could ask people what they eat for lunch as a programmer.  Or I could ask people what brand of tires they use on their car, since they need to get to work somehow.\n\nJust because it is something that programmers use doesn't mean it is programming-related."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 26, 2009", "message": "> But if you ask a question about Excel (which is specifically mentioned below) or Word or other programming RELATED software \n\nI can't even remember the last time I used Word or Excel. I take that back, I use Excel to build graphs to put in my blog entries maybe once every two months.\n\nHow are Word and Excel possibly programming related? Seems pretty clear to me that they aren't.."}]}