{"response": [{"author_name": "Brian", "gravatar_hash": "ac59f99e5f6958e4df7466134a70c085", "author_url": "http://TBA", "date": "Apr 05, 2009", "message": "SO, Joel S and Coding Horror have inspired me to start a \"blog\" to further my writing/communication skills. Great work Jeff!"}, {"author_name": "dirkgently", "gravatar_hash": "19d1ce956fb43cea6297a63b30737575", "author_url": null, "date": "Apr 05, 2009", "message": "Hey, how do I upvote this? Or, should this be community wiki?"}, {"author_name": "miles", "gravatar_hash": "d36eef32625367a43da63a9909ba716e", "author_url": null, "date": "Apr 05, 2009", "message": "Platform agnostic true, but heavily skewed towards .net"}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Apr 05, 2009", "message": "Back in the long lost days when usenet was usable and I was in college I used to spend a lot of time on various technical newsgroups. This led to a tremendous increase in my writing volume, a tremendous increase in my writing quality, and a tremendous increase in my ability to effectively communicate on technical topics.\n\nStack Overflow is not quite as good as usenet was at its peak, but it has a fair number of redeeming qualities, not least of which is improving the quality of technical writing of a significant number of programmers."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Apr 05, 2009", "message": "For me trying to write technical answers in English when its not my 1st language has also been a challenge. \n\nSo my 1st few questions were pretty rough but I think I like to think I have gotten better these past few months.\n\n&lt;3\n\nCaptcha: vulgar Net"}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "Apr 05, 2009", "message": "@miles : Both Jeff Atwood and Joel Spolsky come from a .NET background so it was innevitable to have many users in the same background. These users produced content (questions and/or answers) in the .NET domain, naturally.\n\nHowever their effort (Jeff's and Joel's) to be platform/technology independent goal is at least admirable.\n\nThese things are not really avoidable. If they were PHP-ists they probably had a lot of PHP/MySQL \"followers\" and would have made other people upset."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Apr 05, 2009", "message": "Jeff,\n\nYou would probably be pleased with one of the slides in my recent \"Myths of .NET\" user group presentation, which highlighted how a lot of \"myths\" were due to miscommunication.\n\nThe slide included:\n\n\"Possibly Stack Overflow’s greatest benefit: It encourages developers to put effort into communication.\"\n\nThe \"helping out technically\" is good 'n all, but if we can *all* communicate more effectively, that's a win on a different scale entirely.\n\nJon"}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Apr 05, 2009", "message": "I have always wanted to blog, but never wanted to spend the time trying to find readers.  SO gives me a good balance with instant readership by just the right kind of people."}, {"author_name": "guerda", "gravatar_hash": "3df83952dc426143757b8891f68bfbfc", "author_url": null, "date": "Apr 05, 2009", "message": "I hoped I could upvote this post. I totally agree with the mail author and you. It's so great that I learn to express myself in a foreign language via SO.\n\nThanks SO! :)\n\nGreetings, guerda"}, {"author_name": "gamecat", "gravatar_hash": "0b4b433679e1fb52f7e2ef4ea492496d", "author_url": null, "date": "Apr 05, 2009", "message": "I like to help people and I like to code. SO provides a platform to combine both. The fact that this is often appreciated gave an enormous boost to my self confidence.\n\nAnd yes, I agree there is a lot of .net on SO but lacking any significant knowledge in this direction didn't stop me to reach the top 50 (rep wise).\n\nAnother nice thing about SO is the amazing ability of this community to self regulate. Yes there are sometimes trolls trying to press their finger print on this site, but the community often manages to solve this problem swift without any mod which is great. \n\nOther people spend lots of time improving the quality of the questions and answers by editing and retagging.\n\nThere is just a tiny complaint. Sometimes when a new member asks a question (without looking at the faq), the downvotes, close and offensive votes are cast easily. Which sometimes scares newbies away. Maybe we should find a way to handle this. \n\nBut regardless of anything else, we are about to become for programming what wikipedia is for general knowledge and that is quite an achievement.\n\nGC"}, {"author_name": "Philip Regan", "gravatar_hash": "892ef4994953820e31857adc7e0e9505", "author_url": "http://www.oatmealandcoffee.com", "date": "Apr 06, 2009", "message": "\"...and the platform agnostic community spirit it embodies.\"\n\nWhile I agree with the general sentiment of this post, I do have to disagree with the above statement. I understand that from a platform perspective, that SO has been (blissfully) free of the usual platform war nonsense that can bog down other sites. The language wars, however, thrive.\n\nLook up many of the questions from people looking for tools to use for cross-platform development, and it doesn't take long to see that the dust starts flying at a single mention of REALbasic* vs. Java vs. QT vs. [insert cross-platform library/IDE of choice]. It's both stunning and sad to see so much FUD based on incorrect, outdated information thrown out with such authoritativeness and vitriol. SO solves a lot of problems and has become a great resource, but there are some things that I don't think it will ever resolve. \n\nOne thing that would help, and I'm not the first person to mention this (at least in my circles), is that it would be great to have it so that anyone who votes down a question or answer must give a comment as to why. It's just not enough to vote something down, particularly in the case of criticizing a technology. It seems to me that the person voting down really ought to stand by their vote otherwise they should just ignore the posting and move on.\n\nSO rules.\n\nCheers\n-- \nPhilip Regan\n\n* I am on the board for the Association of REALbasic Professionals."}, {"author_name": "Sander Versluys", "gravatar_hash": "6a2edc913e801a2e6579d7a9a0356b4d", "author_url": null, "date": "Apr 06, 2009", "message": "I agree with Bran. I'm not the most active user but having a good blog with regularly interesting content is to hard for me, but answering a question here and there does give me the feeling i know some things and i can be helpfull to fellow programmers. SO is great!"}, {"author_name": "erickson", "gravatar_hash": "ffbf4e85b8ffbae4e9039b9c0cf07bc8", "author_url": null, "date": "Apr 06, 2009", "message": "I laughed when I read about the \"platform agnostic community spirit [Stack Overflow] embodies.\" While the system is platform agnostic in principle, the spirit of the community is .NET in practice.\n\nIt's got decent breadth for easy, frequently asked questions, but it's not a great place to find in-depth answers for other platforms.\n\nStack Overflow is a great place as it is. There's no need to try to spin it as something it's not."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 07, 2009", "message": "> While the system is platform agnostic in principle, the spirit of the community is .NET in practice.\n\nI do not agree; for example, I've gotten lots of feedback that Stack Overflow is a better place for iPhone developers than the official Apple forums.\n\nOf course this will vary depending on language, etc, but in general -- be the change you want to see!"}, {"author_name": "pbz", "gravatar_hash": "745edd0ed5ca0851d9134bff34dd6588", "author_url": null, "date": "Apr 07, 2009", "message": "@miles and @erickson\n\nWhat do you think would help to make SO more inviting to non-.NET technologies?\n\n@Jeff Atwood\n\nReading these comments made think of one aspect of SO that I feel is missing and perhaps could be added. We have a few SO \"stars.\" Some of them have a blog and perhaps others do not. \n\nHow about, after you reach a certain threshold the site would give you the ability to blog, or something close to that. This would be a separate section from the regular Q&amp;A of SO but with a tight integration. Any posts to this blog would be \"monitored\" the same way all the other posts on SO. Perhaps also have the up/down votes but still maintain the chronological order of the posts.\n\nOne of the problems with blogs is that few authors are willing to actually participate in a discussion. A lot of bloggers view the blog as their personal megaphone, rather than a seed for discussion. If they would go through the SO weeding processes a lot more people would be willing to actually continue the conversation, which of course would bring more traffic to SO.\n\nThis could also be place to bring up non-programming topics. Since it'll be a separate section from SO any personal thoughts would not dilute the strongly focus of the main SO.\n\nWhat do you guys think?"}, {"author_name": "anirudha", "gravatar_hash": "5fd35cf797febea67669c11f2e276812", "author_url": "http://stupididiot.com", "date": "Sep 21, 2009", "message": "in the world more dunkey are avilable when all meet at a place then we say it stackoverflow \nstackoverflow has a palace where some du dog animal \nmeet with some other stupid and Say his language\n\ni hate Stackoverflow because if any beginner use stackoverflow then his account was suspend or dismished\n\nso i say to stackoverflow then next time i create a stackoverlfow for Animal Legally. where all Stupid Developer of Stackoverflow can meet on portal or Say Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah Blah"}, {"author_name": "Joseph", "gravatar_hash": "d7bd1948202569b67786b8f706784dda", "author_url": null, "date": "Jun 25, 2012", "message": "Thanks for posting this. I have always wanted to blog, but never wanted to spend the time trying to find readers. SO gives me a good balance with instant readership by just the right kind of people.\nhttp://www.urbanfence.com"}]}