{"response": [{"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "May 04, 2010", "message": "It's been interesting to watch as this thing has grown from a simple idea into what it is today.  I think it's about to get a whole lot more interesting.  Congratulations!"}, {"author_name": "Jon", "gravatar_hash": "1dd287e1721847d59bcb9b51bfaa0811", "author_url": null, "date": "May 04, 2010", "message": "No it isn't.\n\nThis is great news for SO, I think.  Sometimes I regret living so far away from the US where everything happens..."}, {"author_name": "Jef Claes", "gravatar_hash": "94d1b9d6eed962641a26a95c11d9cb62", "author_url": "http://jclaes.blogspot.com", "date": "May 04, 2010", "message": "And five years from now, only us geeks will now how it all started.."}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": "http://stackoverflow.com/users/20654/oscar-reyes", "date": "May 04, 2010", "message": "Ok, ok, you don't have to twist my arm, I accept.\n\nHere's my CV\n\nhttp://careers.stackoverflow.com/oscar-reyes\n\nBear in mind that some of those new communities will be in other language than English and Spanish is in the top three http://bit.ly/cBH0yA \n\np.s. The about hiring link needs a \"http://\" to work properly :P"}, {"author_name": "Eric Ryan Harrison", "gravatar_hash": "84d9c06ad23348c26556512289dfe6a4", "author_url": "http://ericharrison.info", "date": "May 04, 2010", "message": "If all the new employees are going to working out of the New York office with Joel, are there any plans for Jeff and the others to make the move as well?\n\nAlso, how is this newly-funded company structured? The About page doesn't go into much detail and I never did hear you guys say who does what.\n\nIs the funded company \"StackExchange\" or is it StackOverflow? Is Jeff the CEO, or is he just a founder with shares? What is the actual breakdown of who does what?\n\nJust curious, thanks."}, {"author_name": "Zachary Spencer", "gravatar_hash": "cc2b741199a36cb01c456dbed0430cf4", "author_url": "http://www.zacharyspencer.com", "date": "May 04, 2010", "message": "That Sidekick position sounds freakin' awesome. Could you describe it in more detail?"}, {"author_name": "Nicolas Miyasato", "gravatar_hash": "313a517a47d3bcf4091e397204facec9", "author_url": null, "date": "May 04, 2010", "message": "What can I say? Congratulations Jeff and Joel!"}, {"author_name": "Jeff Yates", "gravatar_hash": "3b0d930715cf8f5729e177981f69f44e", "author_url": "http://www.myspace.com/jefftunes", "date": "May 04, 2010", "message": "Congratulations! Great news."}, {"author_name": "TJB", "gravatar_hash": "20e04754409abe97cca30b5cda369fcc", "author_url": null, "date": "May 04, 2010", "message": "Congrats, glad such a great project has made it big.  Hoping that I never have to click on a link and find a dreadful PHPBB forum to search through.  Here's to making the internet a better place!"}, {"author_name": "Jonathan Sampson", "gravatar_hash": "3eada417ab749e3a7a5d51d451b2cc3a", "author_url": "http://sampsonresume.com", "date": "May 04, 2010", "message": "This is just awesome - well-deserved reward for all of the efforts expended to date! I look forward to the continued growth of such a wonderful venture, and am proud to say that I got to witness the earliest stages of what may become one of the great ideas in programming history. Keep up the great work, Jeff (and his minions!)."}, {"author_name": "Travis Koger", "gravatar_hash": "e28f5d8eaadeae91a70930812fc14ef2", "author_url": null, "date": "May 04, 2010", "message": "Great stuff guys, congrats on the VC funding and looking forward to seeing the future of StackOverflow and riding along with you as a user."}, {"author_name": "Bernard Lunn", "gravatar_hash": "e1aa8335a551d9654d7dd5e5a5a7f58e", "author_url": "http://bernardlunn.wordpress.com/", "date": "May 04, 2010", "message": "Excellent news. Not a programmer but was just researching something techie and landed here and then jumped to the news. If you have cracked the code of making forums actually useable....wow!"}, {"author_name": "Stuart Malcolm", "gravatar_hash": "1f9efd388d2a3d7faa57c892aadda5c5", "author_url": "http://www.ifoundry.co.uk", "date": "May 04, 2010", "message": "7.1m visitors a month is awesome. well done..\n\n..but..\n\n7.1m must be a tiny fraction of the number of developer searches every month. I dont think you've come anywhere near close to maxing out your beach-head.\n\nWhy diversify so soon? sounds like a high-risk strategy to me, where you end up spread too thin on the ground leaving the developer Q&amp;A spot wide open for someone else.\n\nJust $0.02 worth from a guy that has not come anywhere close to 7m uniques per month:)\n\nWell done and enjoy the ride!"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "May 04, 2010", "message": "@Stuart: That's not 7.1M developer searches - it's 7.1M *visitors*. Each may be performing many searches. Now, if you consider the total number of individual developers instead of the total number of searches, 7.1 million starts looking like a much bigger proportion."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": null, "date": "May 04, 2010", "message": "Congratulations! $6M with no revenue model is awesome...just like it's 1999 all over again!\n\nNever fear, I know y'all will figure out a way to make it work AND make it pay...without becoming evil ;-)"}, {"author_name": "SkillGuru", "gravatar_hash": "5c35ef2481aee594685ddbf5c5fe4d8b", "author_url": "http://www.skill-guru.com", "date": "May 04, 2010", "message": "Geeks rule the world!!! Big fan of Joel.\nAnd I love stackoverflow."}, {"author_name": "UncleZeiv", "gravatar_hash": "bd24dab59beada36b501670cd01b8e2c", "author_url": "http://unclezeiv.kerid.org", "date": "May 04, 2010", "message": "Awesome, congratulations!"}, {"author_name": "Vincent Buck", "gravatar_hash": "d3bc907364d590fe0a18d06f7631a392", "author_url": null, "date": "May 04, 2010", "message": "&gt;&gt;The problem is that, golly gee, why just programmers? \n&gt;&gt;Surely there are people out there in different\n&gt;&gt;professions — you know, candlestick makers, robotics\n&gt;&gt;engineers, and designers of favicons — who could use a \n&gt;&gt;site much like Stack Overflow to get answers to their \n&gt;&gt;hard questions\n\nPrecisely!\n\nAnd what exactly makes you think that people who are experts in their field, and ready to answer questions, will jump through the hoops of a Stackexchange 2.0 process where their expert idea of Q&amp;A site must first be 1/validated by and 2/bootstrapped within a much, much wider SO 'community' made up of programmers and other geeks who will not know the first thing about that expert domain, if they ever heard about it at all.\n\nDo you suggest that 'people out there in different professions' should first get some recognition on the trilogy sites so that they may later hope to be in position to vote for their own expert Q&amp;A site? Really? \n\nMy feeling is, your plan is so developer-centric and ignorant of the realities of national and professional cultures that you won't be developing Stackexchange to its true potential, which is a pity given the concept's value, and the outstanding quality of the execution.\n\nI hope to be proven wrong, of course."}, {"author_name": "Allen Gould", "gravatar_hash": "49a618fdafc80fefc7b323d92bf1a120", "author_url": null, "date": "May 04, 2010", "message": "Sadly can't apply for any of these, but I hope to find a company with this sense of humor in their job postings.\n\n(Whomever gets the \"Sidekick\" position should seriously consider \"Joel's Doppleganger\" as the title on the business card.)"}, {"author_name": "JD Long", "gravatar_hash": "d2e5bf1cdb782a02ef30e41563702541", "author_url": "http://www.cerebralmastication.com", "date": "May 04, 2010", "message": "Congratulations Joel and team. I've been rooting for you guys since day one. I've enjoyed voyeuring in on your build out through the podcasts and blog. Now go be awesome!"}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "May 04, 2010", "message": "Like 1999 eh? The local Herman Miller dealer must be rubbing their hands together.\n\nYou should buy a Sun Enterprise server to run all this on too.\n\nCaptcha: poster commented"}, {"author_name": "Matt", "gravatar_hash": "0489cb59fc0b67f7673798e833b8afae", "author_url": null, "date": "May 04, 2010", "message": "So basically the idea is to take a loss making site with no revenue - and scale it up with higher fixed costs so it's an even bigger loss making site with no revenue.\n\nIs the idea to see how much money you can burn though each month? That really worked out for companies in 1999."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 04, 2010", "message": "Thanks for the kudos -- we will do everything we can to live up to the community's expectations, and be an example of how to do this in harmony with the greater internet.\n\n&gt;  the idea is to take a loss making site with no revenue\n\nThe site was already profitable."}, {"author_name": "http://photographr.info", "gravatar_hash": "dd6c985d22e3bf6ea849e8d2e6750d76", "author_url": "http://photographr.info", "date": "May 04, 2010", "message": "Will any of that VC go towards buying the goodwill built by the existing SE beta site owners that join the SE2.0 fold?  Even a teensy bit? ;)"}, {"author_name": "Tom horn", "gravatar_hash": "7bb5f2493a0683f05729bfd93c4c8636", "author_url": "http://www.cannonade.net/dev", "date": "May 04, 2010", "message": "Congratulations! I am looking forward to seeing what you guys do with the money."}, {"author_name": "Ben", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "May 04, 2010", "message": "Just one question: do any of these investors actually use any of the SO sites? It's nice to have their money, but if they're deciding stuff as well, it would be good if they grok the thing.\n\nI think Vincent Buck may have a point about cultural differences. The (revolutionary and excellent) Q/A framework is only one ingredient of the success of StackOverflow. I'm not sure that anyone really knows how to translate that success into another domain. Don't forget that the StackOverflow community was 'seeded' from Jeff and Joel's combined blog readership. That alone is difficult to reproduce.\n\nCaptcha: funds the"}, {"author_name": "Simon P Stevens", "gravatar_hash": "9587b96f4baf903b6a2413de77e8a737", "author_url": null, "date": "May 05, 2010", "message": "I think your walking a dangerous path here.\n\nVC money with no planned venue model. The idea that if you get enough people to use it you'll figure out a way to make money later. It does sound a lot like pre-millennium dot com bubble planning.\n\nThat said, you guys are clearly smart people who get stuff done, so I'm sure if anyone can pull it off you guys can. Never forget the VCs are only in it for the profit.\n\nI really hope it works out. Good luck."}, {"author_name": "Nick Lamb", "gravatar_hash": "f5a9f5340bead3436af3c4d3c13f28ce", "author_url": null, "date": "May 05, 2010", "message": "I am dubious. Here's the thing, stackoverflow is always cited, not just because it was first but because it's  most obviously working. The central idea (top answer is probably right, no charge to see it) works for coding, but may not elsewhere.\n\nThe ideal topic is one in which\n\n• there are plenty of Internet-using users\n• those users have answers on some topics but questions about other topics (quid pro quo)\n• a 3rd party has an excellent chance (low type 1 and type 2 error) of judging whether the answer is correct\n• questions are mostly ad hoc, don't fit into a neat template.\n\nThe last two are both worth an example. If you've just started playing World of Warcraft and you use SO, you might think \"WarcraftOverflow\" is a great idea. Everybody who plays is on the Internet, and many are expert at some tiny corner of the game, at least briefly. But you're wrong, and here's why:\n\nFor most questions there's a neat template. A Wowhead search for \"Orange Dye\" gets you a single page which shows where you can get it, what it's for and so on. Same for places, people, anything with a name. If you have some unusual question related to the thing there's a comment thread per-topic.\n\nThe remaining questions (\"What's the best spec for a PvP druid?\") tend to be largely opinion and constantly changing. A popularly accepted \"best\" answer probably isn't right, and if it is right today it'll be wrong next month. These are better handled by conventional forums, which have short memories with the latest and greatest always at the top of the pile.\n\nSo for these topics (and I think the vast majority of topics will turn out to have one or both issues to some extent) an encyclopedia with comments plus a forum are a genuinely better approach than SO. In twelve months you may find that for every topic well-suited to SO's approach there are ten, or even a hundred that don't work. To meet your stated goals (not polluting the web with mediocre resources) those have to close, no doubt angering their users.\n\nNone of which makes stackoverflow itself less of a brilliant implementation of a good idea, but it may mean a limited life for stack exchange."}, {"author_name": "Clint", "gravatar_hash": "e72176a4d0a5454b329bc703c6fa8004", "author_url": null, "date": "May 05, 2010", "message": "Great. Digg all over again..."}, {"author_name": "Humdrum", "gravatar_hash": "aa348e52b9d2f803311aff8ba28aaf0a", "author_url": null, "date": "May 05, 2010", "message": "If you want to see something tell-tale, hit the search box up top and type in \\jumped the shark\\."}, {"author_name": "Kev", "gravatar_hash": "a9840656ceee0faa528806c4c04a9399", "author_url": null, "date": "May 05, 2010", "message": "I agree with Vincent Buck's sentiments here, having my idea for a Stack Exchange site validated by wider members of the SO community (primarily techies) is just plain peculiar, verging on the bizarre. \n\nWhy haven't you tested the water with typical pricing plans of say:\n\nBronze - $14.99/month\nSilver - $29.99/month\nGold - $59.99/month\netc\n\nI sometimes think there is contrarianism going on just for the sake of being contrarian.\n\nIt's nice to see a smaller outfit with an already profitable business model get VC funding, but I think your SE idea validation plans are just too strange/cultish for words. It'd be like a community version of the Apple iPhone AppStore...eek.\n\nAlso, how is one to plan their Stack Exchange offering based on the vagueries of how the 'community' feels about your idea. I might be wrong but I see Plan C on the horizon because Plan B is a bit silly."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "May 05, 2010", "message": "&gt;VC money with no planned venue model.\nIn todays market giving someone like Joel Spolsky $6M is looking less risky than putting it in the bank!\nThe local VC market here has become much more business angels investing in smart people with an existing business than dot-com hopes of a $Bn IPO.\n\nAnd frankly what's $6M today - it wouldn't get you an apartment in NY."}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": "http://echoreply.us/tech/", "date": "May 05, 2010", "message": "I'll pop a beer to that one guys. Congratulations. Its been a lot of fun participating over the last year, I think this is something all of us can feel good about."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "May 05, 2010", "message": "@kev\nIt's a bootstrapping effort - just as SO used joelonsoftware to pre-populate it, this will gradually use SO/SU/SF people to prime new sites.\n\nWhen Amazon started out it's top selling titles were O'Reilly because only geeks had internet and would shop online.\nAmazon pitching that your grandmother would shop there for her crocheting supplies would have sounded crazy in the 90s."}, {"author_name": "Ryan Walker", "gravatar_hash": "e4bc01b417b384e529e0e257c0d2d492", "author_url": "http://rywalker.com/", "date": "May 05, 2010", "message": "Good luck with the crapshoot. \n\nI (and your investors) recommend filling out the Senior VP employment tier ASAP (they know some good guys that'll be perfect that are currently transitioning).\n\nThat way the mass of developers you hire will have experienced leadership.\n\nSorry DHH has poisoned my mind re: software startups taking VC.\n\nI for one think you guys are making an unnecessary mistake. But it should be a fun ride!"}, {"author_name": "UKanth", "gravatar_hash": "991b4d356b66d8008e8d392f3e75fa39", "author_url": "http://ukanth.in", "date": "May 05, 2010", "message": "Great News guys ! Congratulations :)"}, {"author_name": "Arlen Beiler", "gravatar_hash": "1e5078a857acb4ce01a9ae3923890285", "author_url": "http://astroanswers.org/", "date": "May 05, 2010", "message": "What's that about money? I thought it was free because it was in beta. Then you say charging didn't work. Most obviously it would have worked."}, {"author_name": "dpcwollmann", "gravatar_hash": "75a98b884ee385cf965fff7529b487c1", "author_url": "https://twitter.com/dpcwollmann", "date": "May 05, 2010", "message": "Quick, somebody mod those twitter comments up! @waiting4thebeat is spot on about finding answers to JavaScript questions on SO. Rock on, homies."}, {"author_name": "pranav", "gravatar_hash": "2821d4ca7cec394ca9d04f2af631ddb1", "author_url": null, "date": "May 05, 2010", "message": "Did I hear someone saying goodbye expert-exchange.com ? :). \n\nCongrats to the whole stackoverflow team.!"}, {"author_name": "KMan", "gravatar_hash": "c7cf5f8467d9c0763cdf0d039168bca7", "author_url": "http://izlooite.blogspot.com", "date": "May 06, 2010", "message": "Great news, Congratulations!"}, {"author_name": "Julius Angwenyi", "gravatar_hash": "7eb5574c56e2a395c58613412822eff3", "author_url": "http://stackoverflow.com/users/13370/jangwenyi", "date": "May 06, 2010", "message": "Good stuff! I'm loving it."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": null, "date": "May 06, 2010", "message": "Please, please, please license SO technology to LinkedIn.com - their discussion format is terrible, and community policing is almost non-existent. Thank you."}, {"author_name": "Amrinder Arora", "gravatar_hash": "e8f91b07dbc64f768b15c20f2b3842d5", "author_url": "http://www.standardwisdom.com", "date": "May 08, 2010", "message": "So, do I hear a Google killer in the making (or already here)?\n\nNope, in the best case (which is very likely), a Google acquisition by early 2011 for 20-40m.\n\n[@ anyone who said this was a risky venture -&gt; Citibank is giving 2% CDs, 60 month lockin.  FDIC insured.  Bank of Portugal backed.]"}, {"author_name": "joe", "gravatar_hash": "1110c2bdb3b7be8380de211e85fefdb3", "author_url": "http://nofouls.com", "date": "May 10, 2010", "message": "Congratulations Joel and Jeff. I know you will succeed.\n\nHope the podcast comes back soon."}, {"author_name": "Thomas", "gravatar_hash": "3ce5ec571a3f82ee497afc35ede5e43c", "author_url": null, "date": "May 11, 2010", "message": "Being a physicist, I agree a bit with Vincent Buck:\n\n&gt; Do you suggest that ‘people out there in different professions’ should first get some recognition on the trilogy sites so that they may later hope to be in position to vote for their own expert Q&amp;A site? \n\nI think it is great you enable people with other interests than just IT to help their fields as well.\nBut I do agree with Vincent Buck, please don't make us programmers first to be able to participate (although there are some great programmers among physicists!) \n\nBut it does stand that different professions than software guys have their own needs, some required tools (being able to enter mathematical formulas for physicists, for instance) being just one example.\n\nGood luck in making the other professions q&amp;a sites work fine as well!\n\n-- by the way, great that you managed to convinced the maker of the iphone to swap horses ;-) (jobs@stackoverflow.com) Haha."}, {"author_name": "John Greenan", "gravatar_hash": "ac71b5bd103903863ed387008a3b976e", "author_url": null, "date": "May 12, 2010", "message": "The global financial electronic trading community would benefit from StackOverflow.  I pitched this one back in June '09.\n\nhttp://www.fixprotocol.org/discuss/read/bbe62feb\n\nIt is a bit 1999 over again but the guys in the SO team are very smart.\n\nBest of luck!"}, {"author_name": "Angus Borkhead", "gravatar_hash": "05ac7dfb3d08318cba3c14396743812e", "author_url": null, "date": "Jun 14, 2010", "message": "SO is only good for basic or simple questions from newbies. The harder the q or the more thought rather than just repeating some fact the less likely you will get answer, and the more likely some dorkwill label it subjective. Wake up ppl computers deal with boring exactness, humans use their opinions to form an idea about how to solve a problem."}, {"author_name": "Lunan", "gravatar_hash": "5279149e7710987852e434312e2959c9", "author_url": null, "date": "Jun 20, 2010", "message": "It may succeed it may not.\nBut in order to get it started, you will need, and i repeat, need Professional people in their subject and you need them to either MOD, or ANSWER the question.\n\nWikipedia took off, so i believe finding those people maybe a breeze, but i still doubt it.\n\nEX:a teacher goes into site, and ask how to handle a ADHD children effectively. Answering that requires another professional teacher, or even Psychologist."}, {"author_name": "thecafetechno.com", "gravatar_hash": "edd9f055f3e6483cb8d2b8dc003e7518", "author_url": "http://thecafetechno.com", "date": "Apr 15, 2012", "message": "wow that'a great news."}]}