{"response": [{"author_name": "Adam Wendt", "gravatar_hash": "278ac619b6e01e2d0bbd34c80b06f46f", "author_url": "http://skilltrainingcomplete.com/", "date": "Jun 01, 2010", "message": "For site owners interested in submitting a proposal to the community, we will keep their previous site open throughout the process so the data is not lost. Users will love the reputation boost they get from asking their favorite question on the new, larger system. But we will not be able to migrate users or questions piecemeal. The code and databases are different and there’s no association between users on the old system and the new network. In short, we don’t want to start your shiny, new site off with initial problems and bad data.\n\nAm I understanding this correctly? Do you really expect us to have to ask/answer every question again on the new SE 2.0 site? That seems like a huge dis-incentive for users of the existing SE 1.0 site if they have to make a gold rush just to retain any of their reputation and ability. This may not be a big deal for users who use other SE sites, but for users who only use the single SE 1.0 site being migrated I think this would make them hesitant to continue to contribute."}, {"author_name": "TJB", "gravatar_hash": "20e04754409abe97cca30b5cda369fcc", "author_url": null, "date": "Jun 01, 2010", "message": "Hey what's that area51 under the network sites? going to area51.com returns a suspicious \"Hello World\" string...\n\nCAPTCHA: congest that"}, {"author_name": "BradC", "gravatar_hash": "c5c2165949f71bcd1fafbd8e694ab5f2", "author_url": "http://bradcorbin.net", "date": "Jun 01, 2010", "message": "So if I'm reading right, there are really 3 possible paths:\n\n1. If a SE1 site has enough traffic, it can stay the way it is indefinitely, with no platform software updates.\n\n2. If a SE1 site has enough traffic, it can be migrated to the SE2 platform (keeping users/questions/answers intact)\n\n3. If a SE1 site does NOT have enough traffic, it will be shut down after a period of time. \n\nModerators of SE1 sites can still participate in the SE2 proposal process, but this is (in essence) a NEW SE2 site, community owned, and subject to all the rules of the proposal process. The scope of the new site could change, as could the name, the moderators, and any other details.\n\nThis new site (if it passes the process) will be re-launched, with no import of past users/questions/answers from any SE1 sites that happen to cover the same subjects.\n\nSound right?\n\nOh, I guess there is one more:\n\n4. Owners of SE1 sites could, if desired, move to a 3rd party StackExchange clone, and host the software themselves."}, {"author_name": "Scott Morrison", "gravatar_hash": "99056c7157a7301e3182ef99dd99a353", "author_url": "http://tqft.net/", "date": "Jun 01, 2010", "message": "Just summarising the consensus of the mathoverflow community (see http://meta.mathoverflow.net/):\n\nThere is *no way* we will switch to SE 2.0 without:\n1) One of us maintaining admin powers.\n2) Keeping ownership of the domain name.\n3) Being able to produce complete database dumps.\n\nWe have a strong, vibrant community -- indeed, I think we're the perfect example of what everyone would like SE 2.0 to be, so hopefully we'll be able to get a good deal. But these three points are non-negotiable, and we're willing to switch to the relatively crappy open-source alternatives if necessary."}, {"author_name": "rafek", "gravatar_hash": "7c3b45d8f867a5e405f8bb54424e2fdd", "author_url": "http://devMedia.pl", "date": "Jun 01, 2010", "message": "So, as far as I understood if a SE1.0 site will have enough traffic it can operate on the same terms as long as it has the traffic. That means - the deadlines which were proposed (1 yr / 3 months) will be no longer valid. Am I missing sth?"}, {"author_name": "Guy", "gravatar_hash": "aa81a6370a42b90429370bcf2dfad2e8", "author_url": null, "date": "Jun 02, 2010", "message": "If Stack Overflow is a shining example of how to create an \"online community\", then it seems to me the whole Stack Exchange debarcle has been an excellent example of destroying them!\n\nCome on guy's.  You can't dictate a \"perfect solution\" to communities sites.  Each has to find its own way - and that way may be different to how you'd expect and like it."}, {"author_name": "Ward", "gravatar_hash": "f347c53c9cb1ddcb816daeb22aaf89c8", "author_url": "http://www.crazyontap.com", "date": "Jun 02, 2010", "message": "One thing you should do right away is rationalize all the meta sites you've got going.  Unless someone is really, really into this whole process, it's too confusing with:\n\n- blog.stackexchange: now points to blog.stackoverflow, the standalone SE blog is gone\n\n- meta.stackexchange: seems like it's going away? There are now some SE announcements on meta.stackoverflow\n\n- I still think one big meta site for SOFU is a bad idea, any SF-specific meta is drowned out and there are very few SF'ers who look at meta.  If you're now going to move SE meta to the same place, that's even worse...\n\n- the FAQ for area51 urgently needs work.  The question \"How do I start a new site?\" isn't actually answered, it just says you need a bunch of enthusiasts, it doesn't say what you should do to propose something.  Unless someone is familiar with what's been posted on blog.SE and/or meta.SE, the FAQ is unintelligible.\n\nI'm posting this here because I can't figure out if there's a better place to point it out."}, {"author_name": "Ward", "gravatar_hash": "f347c53c9cb1ddcb816daeb22aaf89c8", "author_url": "http://www.crazyontap.com", "date": "Jun 02, 2010", "message": "&gt;&gt;&gt; If Stack Overflow is a shining example of how to create an “online community”, then it seems to me the whole Stack Exchange debarcle has been an excellent example of destroying them\n\nIt wouldn't be the first time!"}, {"author_name": "Tim", "gravatar_hash": "63f289d0adff09dc3ff2ce690a25ab3e", "author_url": null, "date": "Jun 03, 2010", "message": "Just so I get this straight.  \n\nYou had a subscription model, people owned their sites &amp; paid for it.  You didn't make any money, so you changed business model, where you own the site &amp; it's free, as long as you get enough traffic?  For people to upgrade, i.e. keep their site they paid you for, you become defacto owner?  \n\nSo you are totally screwing your early adopters, as in, basically stealing their sites from them?  To me it's unethical at the least and possibly unlawful.\n\nOh, and this is all about \"making the internet better\".  In the famous words of OchoCinco - \"Child Please\""}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jun 03, 2010", "message": "@Tim\n\nI think you are overstating it a bit - this can hardly be characterized as unlawful and no one is stealing anything.  I also don't think any money was paid for the services, though people may have paid for advertising and other things related to the sites.  (The original terms were for monthly payments but I don't think they ever started billing.  I may be wrong)"}, {"author_name": "Tim", "gravatar_hash": "63f289d0adff09dc3ff2ce690a25ab3e", "author_url": null, "date": "Jun 03, 2010", "message": "@tim - say SalesForce.com said upgrade to v8 or lose your crm data and if you do upgrade to v8 SalesForce.com now owns your customer data.  To me that's unethical."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jun 03, 2010", "message": "Unethical is one thing, unlawful is another.  They are also providing access to all the data - there is no loss of data so I think you are pushing it a bit.\n\nNote also that I have been a critic of this move as well, (Jeff offered to ban me at one point for my criticisms) but you have your facts wrong and are not making good analogies.\n\nI think they could have handled the SE 1.0 folks a little differently as well."}, {"author_name": "Ward", "gravatar_hash": "f347c53c9cb1ddcb816daeb22aaf89c8", "author_url": "http://www.crazyontap.com", "date": "Jun 03, 2010", "message": "&gt;&gt;&gt; I have been a critic of this move as well, (Jeff offered to ban me at one \n\nJeff's a bit thin-skinned."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jun 03, 2010", "message": "\"Jeff’s a bit thin-skinned.\"\n\nI am not sure I would characterize it like that.  I think we have very different opinions on a variety of topics and I am guessing he was tired of what he perceived as complaining and negativity.  (I viewed my posts as pointing out inconsistencies and problems)\n\nTo be fair, I have posted a lot of critical things on this forum and his advertisement revenue site."}, {"author_name": "Rick", "gravatar_hash": "d7536fb6daba4fd28e013f0b8a34c9dd", "author_url": null, "date": "Jun 03, 2010", "message": "So, why would anyone want to be an SE 2.0 site?\n\n@Scott Morrison: Just dump your data and move it off of SE. It wouldn't be incredibly difficult to get a new application to work with your existing data and I'm sure many would volunteer to help get it going. \n\nThere seems to be no incentive to being part of SE 2.0. The functionality isn't that hard to build."}, {"author_name": "Dan Dumitru", "gravatar_hash": "dead5c6457591268b4bd4c6199fa16b6", "author_url": null, "date": "Jun 03, 2010", "message": "Well, actually, that's the whole thing.\n\nThe functionality IS hard to build.\n\nTo get at least 50% of the features Stack Overflow has now, I'd estimate at least a 1 year work of a 4 person team.\n\nJust look at OSQA and Shapado. They've been working for some time at their clones, and they're not even close.\n\nThe SO software is actually quite complex and quite awesome."}, {"author_name": "Rick", "gravatar_hash": "d7536fb6daba4fd28e013f0b8a34c9dd", "author_url": null, "date": "Jun 03, 2010", "message": "@Dan Dumitru:\n\nNice estimation attempt. I think you're a bit off. You're saying it would take a 4 person team 2 years to build SO? I think not. Where is the complexity exactly? It's a forum with voting."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Jun 03, 2010", "message": "@Rick: Just to be devil's advocate, read: http://www.codinghorror.com/blog/2009/07/code-its-trivial.html\n\nYou may not agree with the specifics of the post, but, don't underestimate the work required to implement the Stack Exchange software. Many software projects become colossal failures because of excessive optimism."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jun 03, 2010", "message": "I can't believe that the majority of the functionality would take more than about 6 man months of effort.  \n\nFrankly I don't see the challenge.  It's not like we're building complex software or algorithms.  Most of the challenges are likely on the scalability and server side."}, {"author_name": "Dan Dumitru", "gravatar_hash": "dead5c6457591268b4bd4c6199fa16b6", "author_url": "http://WhiteboxHardware.com", "date": "Jun 04, 2010", "message": "@Rick, Tim\n\nThere is actually a lot of work. As I said, if you follow the development of OSQA and Shapado, you slowly realize there has been a lot of work in SO.\n\nIt's not just about posting Q&amp;As, sorting by votes, giving reputation points and badges.\nThere is a lot of code in dealing (on different levels) with spam, creating all the mechanism for self moderation, tweaking stuff so the system can't be gamed etc.\n\nYes, you can make something that has the basic features fast, but it's a lot of work for getting at least near the awesomeness of SO.\n\nMy estimation of 48 man months was for creating something like the software behind the Stack Exchange 1.0 sites. That was an earlier version of the present SO software, and even for that you'd need a lot of work to get it right.\n\nBut I dare you to prove me wrong :)"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jun 04, 2010", "message": "@Dan: I think Jeff and Co. did it in far shorter than 48 man-months.  That is a high number. \n\nI also doubt that using \"failed\" projects as an indicator is a good metric or one to cite as proof of your position."}, {"author_name": "Rick", "gravatar_hash": "d7536fb6daba4fd28e013f0b8a34c9dd", "author_url": null, "date": "Jun 04, 2010", "message": "@Dan, @tim, @Chris Jester-Young:\n\nI'm certainly not underestimating the task. It's just that some are greatly overestimating it.\n\nThe value of SO is not in its lines of code or its server farm but, rather, in the community gathering around a simple, well implemented idea (voting -&gt; reputation -&gt; privileges).\n\nIf you anger the community, we will gather around someone else's fire."}, {"author_name": "Dan Dumitru", "gravatar_hash": "dead5c6457591268b4bd4c6199fa16b6", "author_url": null, "date": "Jun 05, 2010", "message": "\"It’s just that some are greatly overestimating it.\" Pick me, pick me!\n\nNow, the community has indeed given valuable feedback, but the fact is that the software is actually very good.\n\nAnd the thing is, since they started it in summer 2008, they've been continuously improving it. They've dumped way more than 48 man months in it. Just go through this blog, you'll find important features deployed every couple of months.\n\nI don't think Shapado or OSQA are failed projects. They are still under heavy development, I mentioned them because I follow their progress and I see how many things they have to do in order to get where SO is now.\n\nAnyway, I still stand behind my estimation, but I have no way of convincing you that I could be *in big lines* right."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": null, "date": "Jun 06, 2010", "message": "@Dan,\n\nIf you just take the current timeline and add all the SO's time, then you can claim that it took 48 man months.  However, So was very functional and had a hug following in half that time (or even less).\n\nIf you choose to use the metrics to date and claim that's how long, then fine, I will continue to use their timeline to show it takes far less effort.  \n\nIt really isn't that difficult.  We're not talking about torpedo guidance or weapon control systems or NLP.  We're talking about a glorified BBS for god's sake."}, {"author_name": "Dan Dumitru", "gravatar_hash": "dead5c6457591268b4bd4c6199fa16b6", "author_url": null, "date": "Jun 06, 2010", "message": ":)\n\nI did indeed overestimate. You're right, they had an almost complete &amp; polished system last summer.\n\nA platform to port SE 1.0 data to (and not to feel like you've made 10 steps backwards in usability &amp; reliability) is harder to build than you guys think, but I admit it - estimation fail."}]}