{"response": [{"author_name": "Zypher", "gravatar_hash": "2e1ea31243c478894a96971da3b49b55", "author_url": null, "date": "May 26, 2010", "message": "Can we get our own meta too :-D"}, {"author_name": "Evan Anderson", "gravatar_hash": "68acf720b80851eeaf4383f4c27bf829", "author_url": "http://serverfault.com/users/7200/evan-anderson", "date": "May 26, 2010", "message": "Hard to believe it's been a year! Zow...\n\nThanks to you guys for putting up Server Fault and for giving me the space to bloviate so thoroughly. I've had a lot of fun trying to help people out over the last year, and I've enjoyed being helped out by all the questions and answers posted by other members of the community."}, {"author_name": "Jonathan Sampson", "gravatar_hash": "3eada417ab749e3a7a5d51d451b2cc3a", "author_url": "http://sampsonresume.com", "date": "May 26, 2010", "message": "Congrats ServerFault, and all those who actively make it so great. I've been using it more and more over the last few weeks as I recently gained the responsibility of playing the sysadmin role, along with our database administrator and developer roles. Needless to say, ServerFault has kept me sane over the last few days, and I trust that it will continue to do so as I progress down this long, dark, scary path."}, {"author_name": "fretje", "gravatar_hash": "4a066da7a2e83549c10e47105f4e9596", "author_url": null, "date": "May 27, 2010", "message": "+1 for a year of Server Fault\n\n-1 for posting an xkcd without the roll over text (isn't that a crime ;-).\n\n(for the record, this is the original roll over text:\n\n\"The weird sense of duty really good sysadmins have can border on the sociopathic, but it's nice to know that it stands between the forces of darkness and your cat blog's servers.\")"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 27, 2010", "message": "@fretje -- fixed! :)"}, {"author_name": "Kev", "gravatar_hash": "a9840656ceee0faa528806c4c04a9399", "author_url": null, "date": "May 27, 2010", "message": "I asked in a Coding Horror or Stack Overflow blog comment a while back if you could talk more about how you're building out the SOFU infrastructure, it's nice to see this happening and I'm looking forward to following this. \n\nIt's always interesting to see how other folks grow their systems so thanks for sharing this.\n\nAlso Server Fault has been great resource over the past year for when as a developer I just don't have the time to spend hours digging about trying to solve a server admin type issue. +1"}, {"author_name": "Jonathan Sampson", "gravatar_hash": "3eada417ab749e3a7a5d51d451b2cc3a", "author_url": "http://sampsonresume.com", "date": "May 27, 2010", "message": "One request, make the SF blog more like this one (aesthetically). The information on the SF blog is excellent, but the design-work is foreign to what we have come to expect from the SO team.\n\nOther than that, great posts so far. Even though I understood about 2% of what was discussed, I still enjoyed the reading."}, {"author_name": "Emilio", "gravatar_hash": "a9fa13d0cc3679dfe1ef6febb3aae939", "author_url": null, "date": "May 27, 2010", "message": "This is great.  Looking forward to reading about it.\n\nCurious though, why does the infrastructure require 2 sysadmins?  I worked at a large company where we hosted many 2MM+ monthly unique sites in the data center and our ratio of servers to admins was about 80:1."}, {"author_name": "Ward", "gravatar_hash": "f347c53c9cb1ddcb816daeb22aaf89c8", "author_url": "http://www.crazyontap.com", "date": "May 27, 2010", "message": "&gt;&gt;&gt; In the next year, we’ll be pursuing a bunch of other ideas to keep Server Fault in tune with the greater sysadmin and IT pro community\n\nYou'd be better off putting some effort into making SF more appealing to sysadmins: for example, take SF meta off of meta.SO where it's drowned out (and where few SF'ers bother to go) and make some effort to draw in more sysadmins."}, {"author_name": "Duff", "gravatar_hash": "974938b8250a08cf9e22714aff1f9fcc", "author_url": null, "date": "May 28, 2010", "message": "@Emilio - Economics for small companies and system administration is different. You generally have a lower server to admin ratio, but usually a better service to staff ratio.\n\nA big company tends to need less sysadmins, but introduces more administrative folks and other overhead. In a small company, the overhead positions don't exist and are either outsourced or fall upon a single individual with other duties. You know the group of people in your big company that you can't figure out what they do? They don't exist in the smaller entity."}, {"author_name": "Edd", "gravatar_hash": "8328fd788e45abbde53191c2c6630a3c", "author_url": null, "date": "Jun 01, 2010", "message": "Surely it should be ServerFault.log, not blog! (8-p)"}]}