{"response": [{"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "May 05, 2010", "message": "You paid for a chat room, when you could have just used IRC? That VC money is going to your heads!"}, {"author_name": "Frank Krueger", "gravatar_hash": "3eef89c1710742937cc74bf88da9dff8", "author_url": null, "date": "May 05, 2010", "message": "I remember a whole lot more blah blah blahing between bits there.\n\nThe whole exercise proved to me that Jeff is right.\n\nThese chat rooms get dominated by a couple loudmouths who think that their personal \"friend hunts\" are more important than the topic at hand. There was little to no restraint exercised in the room. What a mess."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 05, 2010", "message": "@Frank that's why we posted an edited summary transcript!\n\nThis was more of a public performance. In general inviting 100 random people into a public chat room is a bad idea and won't lead to anything useful.\n\nThe way this is *typically* done, is you'd have 3 or 4 moderators seeing a raw public chat and only pushing appropriate questions over to the \"real\" chat room.\n\nBut that solution is specific to \"public Q&A with a popular public figure\" format."}, {"author_name": "Jonathan Sampson", "gravatar_hash": "3eada417ab749e3a7a5d51d451b2cc3a", "author_url": "http://sampsonresume.com", "date": "May 05, 2010", "message": "Thanks for posting this, Jeff. I think the chat was excellent, and provided a great opportunity for the community to get just a bit more insight into the growth taking place at SO.\n\nAs noted, it was a bit messy at times in the room, but I think it was a diamond in the rough, and your edited transcript above exercised the diamond and showed the great potential in these types of settings.\n\nHopefully this will become a somewhat regular thing for you guys in the future - with more planning and tact, of course."}, {"author_name": "jerryjvl", "gravatar_hash": "320dc2b3b003612d9879e1563e7a41ca", "author_url": "http://www.thenakedflame.com", "date": "May 05, 2010", "message": "Shame I missed the chat, but thanks for posting up the summary.\n\nI know it says that doing 'software' is off the table, but I was wondering whether any thought will be given to some kind of view-only engine to go with the data dumps so that once a site 'dies' from inactivity its latest state can easily be hosted for viewing by anyone that wants to maintain a copy of its last state? Would be perfect if the view-only engine is visually mostly indistinguishable from the previously live version."}, {"author_name": "Jon Smock", "gravatar_hash": "7cf5af9e0f94976adae00ce7dfdd467b", "author_url": "http://jonsmock.com", "date": "May 05, 2010", "message": "Yeah, it was kind of a mess, but I really appreciated the idea.  If only we could have used our SO logins.  Then perhaps Joel wouldn't have to continually ban the fake Jeff A. :-P"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "May 06, 2010", "message": "@jerryjvl \nA couple of the FOSS clones can import SO data dumps"}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": null, "date": "May 06, 2010", "message": "@jerryjvl  There are already open source clones of the SO engine that allow you to us the data dump and fire your site right back up.  I don't see that its worth it for the SO team to spend any time going the route of make a subset of their code for viewing only."}, {"author_name": "jerryjvl", "gravatar_hash": "320dc2b3b003612d9879e1563e7a41ca", "author_url": "http://www.thenakedflame.com", "date": "May 06, 2010", "message": "That's fair enough too then... I've never looked too closely at the data-dump posts, but I don't think it has a link to any of this software. It might be worth having something with the dumps that points to the software you can use to just import it?\n\nAnyway, withdrawing my original comment ;)"}, {"author_name": "Fredrick Pennachi", "gravatar_hash": "80868923b060c85c9704f2e09fd74bae", "author_url": "http://fredrickpennachi.info", "date": "May 08, 2010", "message": "First mention of an enterprise version, glad to see the \"community\" and \"making the internet a better place\" hasn't completely taken over :P"}, {"author_name": "celine", "gravatar_hash": "fee0c9267a7fe921955fb23c72d00326", "author_url": "http://www.letsluxury.net", "date": "Mar 24, 2011", "message": "This is a great blog and very engaging too. Excellent work! That’s not really much coming from an amateur publisher like me, but it’s all I could think after enjoying your posts. Excellent grammar and vocabulary. Not like other blogs. You really know what you’re talking about too. So much that you made me want to explore more. Your blog has become a stepping stone for me, my friend. Thank you for the articulate journey. I really enjoyed the 4 posts that I have read so far."}]}