{"response": [{"author_name": "mindcorrosive", "gravatar_hash": "be3b138352dc100c9459e612b275b413", "author_url": null, "date": "Sep 28, 2010", "message": "First off, I've committed to the Dev testing proposal on Area 51, as I'm interested in software testing methodologies and would like to develop my skills in that. \n\nNow, I (and I believe a lot of people from the community) are not opposed to merging *per se*, we're opposed to merging with programmers.se -- as somebody mentioned, it's like the water cooler tank of SO. I do not wish to participate in a community, regardless how useful, if I will have to browse irrelevant questions like \"what colour of keyboard do you use?\" on programmers.se, As you suggested (or maybe Joel?), a Software craftsmanship community is a great place for dev testing, together with a bunch of other things. I am all for that. \n\nBut don't force us to merge with a community we don't feel have anything to do with us. If you don't like programmers.se, just kill it, archive the posts, and let us start again on an empty sheet, this time with a clearer focus in mind. Make this software craftsmanship proposal, announce it, and see how this will work out.\n\nJust don't piss the community by forcing a decision you and Joel proclaimed should be theirs to make."}, {"author_name": "Grzes", "gravatar_hash": "712248df6de12dd9b8ba73869a110f1f", "author_url": null, "date": "Sep 28, 2010", "message": "I agree. I think a site must be really big to gain proper momentum and attract \"normal\" people to the community. When I say normal I think about people who are reasonably competent in the field, but have family, dog, work, hobbies, etc. and are not going to regularly visit more than one or two sites. Stack Overflow is definitely big enough, but I have even doubts about Super User. \n\nOn the other hand sometimes there is useful overlap between tags within a single site - e.g. unit-testing questions are often relevant for both C# and Java developers. There are some questions \"I would do this in Java. How would I do it in C#?\" where it helps to have both java and c# developers look at your question."}, {"author_name": "Miguel de Icaz", "gravatar_hash": "3a9106e0c085d9a856588c454894d66b", "author_url": null, "date": "Sep 28, 2010", "message": "I agree with this policy, and have advocated it before.   Most recently with the ubuntu/unix split.\n\n\nI was hoping you guys would make a merger call based on this sort of editorial policy instead of running a user poll that determined that merging was \"a bad idea\""}, {"author_name": "Gavin", "gravatar_hash": "9a382f89bcb948a8318c3edeeada7449", "author_url": null, "date": "Sep 28, 2010", "message": "Totally agree. Yesterday I needed a simple algorithm. Searching on stackoverflow found an implementation but in Java. Even though I wasn't programming in Java I was able to easily adapt it. I would never have looked on java.stackexchange.com for the solution."}, {"author_name": "Michael Mrozek", "gravatar_hash": "b01e4398878d75905df1124118b703ec", "author_url": "http://mrozekma.com", "date": "Sep 28, 2010", "message": "I keep waiting for the announcement that SOIS has put their foot down and merged Unix and Ubuntu by force; I'm rather surprised Jeff and Joel have contained themselves for as long as they have"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 28, 2010", "message": "> But don’t force us to merge with a community we don’t feel have anything to do with us.\n\nhttp://programmers.stackexchange.com/questions/tagged/unit-testing\n\nI agree that programmers needs some cleanup, but it <b>does cover subjective, professional programming questions exactly like the dev test proposal example questions</b>.\n\nRest assured, cleaning up programmers.se and removing the 15-20% worst questions, as well has having a reasonable set of \"is this subjective question worthwhile?\" guidelines is priority #1 for me at the moment.\n\nExpect to see more on that tomorrow."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 28, 2010", "message": "> I keep waiting for the announcement that SOIS has put their foot down and merged Unix and Ubuntu by force\n\nThere will be a .. different .. announcement in October that will make this decision more understandable."}, {"author_name": "Bill", "gravatar_hash": "e6f407d5c456c07416f427a66776de5b", "author_url": null, "date": "Sep 28, 2010", "message": "I don't see why you have to make the split between a site and a tag anything more than conceptual\n\nIn some cases focusing the sites definition might be what is required to get momentum for the site going due to the fact that some people will always want to associate themselves with specific things (testing, ruby etc)\n\nWhen a case like this emerges you couldgive both sides what they what by creating the site as a pre filtered version of its parent site. Users who log on to the child site see all questions filtered by what they care about and it appears to have its own chat and meta. They will also have the ability to start viewing the subject from the wider perspective of the parent if they wish.\n\nThis should keep the multi-culturists and the fanboys happy at the same time"}, {"author_name": "Kramii", "gravatar_hash": "3255def900f904a3af3918e2824ecff3", "author_url": "http://allwrong.wordpress.com", "date": "Sep 28, 2010", "message": "I agree that factionalism is bad for the community.\n\nSo why not merge \"Game Development\" with SO?"}, {"author_name": "James Murphy", "gravatar_hash": "7a56b9a98f7bf4e4d5896dc2999c9f39", "author_url": null, "date": "Sep 28, 2010", "message": "Someone asked - quite rightly - why we don't, therefore, just have one site? stackanswers.com I suppose.\n\nYet it seems fairly clear that stackoverflow, serverfault and superuser are distinct entities sufficient unto themselves and with clear lines of demarkation between them.\n\nSo the question is not should there be multiple sites - because that's already been decided - the question is how many and how fine grained.\n\nIt comes to this - is a topic sufficiently deep and are there enough interested parties. Coding (which is substantially what stackoverflow is about) - obviously. Testing? Don't know - but I'd like to find out.\n\nConceptually merging the dev testing proposal into programmers seems sensible however given what programmers is *now* it would be a disaster. If you're planning to nuke programmers and start again? Then *maybe* - but in the process you're going to want to move some non-code questions - version control strategies for example - out of stackoverflow *and* go on to start stomping on subjective questions (depending on what and how asked) in programmers and I still don't think you get why dev testing was proposed as a separate entity (-: (Maybe I don't either...)"}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Sep 28, 2010", "message": "I called this way back in April\n\nhttp://meta.stackoverflow.com/questions/46829/is-stackoverflow-china-or-the-ussr"}, {"author_name": "gvkv", "gravatar_hash": "40afb250cd453dc2c3374f3d5aa122b3", "author_url": null, "date": "Sep 28, 2010", "message": "The the exact same logic can be extended to the Ubuntu/Unix decision that was made a few weeks ago.  Why no command decision to merge there?"}, {"author_name": "Kristof Claes", "gravatar_hash": "cdf5324ec8ff7cf76083192b64d1402c", "author_url": "http://www.kristofclaes.be/", "date": "Sep 28, 2010", "message": "I agree with mindcorrosive. If you decide to merge Dev Testing, it shouldn't be merged with programmers.se. Maybe with SO?\n\nI also agree with Krammii. Why not merge Game Development as well then? What's the difference? The same goes for Ububtu and Unix."}, {"author_name": "Frankie", "gravatar_hash": "5a46c45ae5e044a4e63c9ed91b7b7c0a", "author_url": "http://pulsarcap.com", "date": "Sep 28, 2010", "message": "This has more to do with psychology than actual reason. We answer mainly for one reason, peer recognition. In the deep end that's what drives us. \n\nMultiple small communities will have all sorts of neighborhood-heroes. When you merge that popularity gets diluted and all hell breaks loose. Creating them in the first place was probably wrong.\n\nTagging is the way to go. Imagine you'd have a Google Cars, a Google Bikes, a Google Phones, etc, etc... the key and-excruciating-difficult-task is in splitting it while keeping it all together. And, while doing it, you'll probably have to find ways to fragment reputation as much as possible so every one can be a small-town-hero."}, {"author_name": "duffbeer703", "gravatar_hash": "974938b8250a08cf9e22714aff1f9fcc", "author_url": null, "date": "Sep 28, 2010", "message": "How about giving the users the ability to customize the front page of a stackexchange site by grouping related tags? Or even pre-defining some high level groups?\n\nSo if I'm a Unix guy on serverfault, or a gold enthusiast on the personal finance stackexchange site, I can tailor my own view of the world. Or pre-define a \"Developer Testing\" bundle of tags that almost represent a site within the site.\n\nYou guys are going to continue to get pressure for more spinoff sites that may or may not be needed because people like their own turf."}, {"author_name": "Wooble", "gravatar_hash": "d97c4357dd1d0a26a62555ad949a77af", "author_url": "http://www.geoffreyspear.com/", "date": "Sep 28, 2010", "message": "Honestly I never bought the \"Yahoo Answers sucks\" rationale for not having a single all-inclusive site.  Yahoo Answers doesn't suck because it's not narrowly focused, it sucks because the moderation system isn't working properly.  I believe a site with a thriving community and a well-designed system with an \"ask anything, as long as it's a real question with a possibly objective answer\" would work fine."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": null, "date": "Sep 28, 2010", "message": "I don't think \"Developer Testing\" deserve a separate community but I also believe merging Developer Testing into Programmer is really not a good Idea; it does not really fit there.\nIf you need to merge them somewhere, pick Stack Overflow, tags will help them to delimit their *cough* classy community."}, {"author_name": "SteveJ", "gravatar_hash": "ba0cb9c3465cf59da45ec43b549a488f", "author_url": null, "date": "Sep 28, 2010", "message": "Having no skin in the game, it really does seem like SOIS is attempting to keep a bad idea afloat (programmers.se) by merging in a legitimate site idea.  \n\nThe story to this point looks like this:\n\n\"People keep putting crap on Stack Overflow!\"\n\"Oh NO!  We want our crown jewel to stay a beacon of pure Q&amp;A awesomeness.  Get rid of the bad stuff!\"\n\"People keep asking bad questions!\"\n\"Well...we can't get rid of the people, lets distract them with another site\"\n\"Oh no!  The specifically designated site for stuff that isn't good enough for SO is looking...well, bad!\"\n\"Oh no!  It might die!  And then the barbarians will come back to Stack Overflow!\"\n\"I know, we'll prop it up with a legitimate community!\"\n\"Brilliant!\""}, {"author_name": "Wil", "gravatar_hash": "8e40b955ba72299d98374726cdc1573d", "author_url": "http://blog.williamhilsum.com", "date": "Sep 28, 2010", "message": "If this is how you feel, is there any chance in the future that Web Apps will be allowed in Super User?\n\nI don't understand why questions on big \"topics/apps\" such as Gmail, Hotmail and Twitter are not allowed whilst questions on some very remote applications that are specially licensed and only a few places will use are allowed."}, {"author_name": "Kibbee", "gravatar_hash": "2b568071163c0d009635cfa63cf6e6ac", "author_url": "http://www.kibbee.ca", "date": "Sep 28, 2010", "message": "I like the fact that all of the programming questions are on one site.  I would never visit a Java specific site simply to answer questions, because it's  are not my main language.  However, I've answered many questions about Java because I do have some knowledge, and I know where to find the documentation. I can also swap out Java for PHP, Python, Javascript, or even C in the above example. \n\nPutting all the questions together for everyone to answer gives us a bigger pool of people to answer questions.  I wonder if anybody has done statistics on answers provided by people outside their main expertise.  I think the people who aren't experts, but that know even a little bit, can be a big help over all."}, {"author_name": "Jeff Yates", "gravatar_hash": "3b0d930715cf8f5729e177981f69f44e", "author_url": null, "date": "Sep 28, 2010", "message": "Thanks for raising this, Jeff. As more Stack Exchange sites are created, it is getting harder for me to participate in each of the ones that I feel I can contribute or benefit. If topics split into specific factions like this, it would reduce even further my ability to both benefit and contribute, and possibly make it harder to find information rather than easier.\n\nI vote for big, all-encompassing sites like Stack Overflow rather than small-specific sites like Developer Testing."}, {"author_name": "Brian D", "gravatar_hash": "8080eecebb34a24ac69a198678224942", "author_url": null, "date": "Sep 28, 2010", "message": "I'd prefer one site with tags, even if it meant a set of 'super tags' that let people filter entire classes of question like separate sites do today. If my filters are wide open, I'm much more likely to find an answer to a question, possibly in a tag I wasn't thinking to to look at (imagine questions about programming electronic music equipment). Instead of closing questions, moderators would just re-tag them. That makes it a lot easier on the author who no longer has to copy/paste their question to a completely different site. You could scope tags by domain name so coding.stackoverflow.com would automatically override my tag filters and only show me things in the coding tag.\n\nSeriously, the more sites, the less I use any of them - I might as well just go back to Google search and hope the best of SO rises to the top."}, {"author_name": "Eli Bendersky", "gravatar_hash": "fc761ccaf6c0d7d977e2959f9bfebd06", "author_url": "http://eli.thegreenplace.net", "date": "Sep 28, 2010", "message": "Please, guys, stop the splitting. Stop it - I don't care about web apps, gadgets, iphones, ubuntu vs linux. But please don't kill stack overflow itself by splitting into sub-sites like programmers and testing and java and whatever.\n\nPlease!"}, {"author_name": "eglasius", "gravatar_hash": "9711911847e71c94733250dfa63f9427", "author_url": "http://eglasius.blogspot.com", "date": "Sep 28, 2010", "message": "I agree, don't split testing, that's crazy its part of development. Specially automated testing, it requires developer skills, being together benefits everyone."}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://patrickmcelhaney.com", "date": "Sep 28, 2010", "message": "Stack Overflow is like a giant hardware store where I can find any part I need. I love it and think it's perfect as-is.\n\nBut I wouldn't mind if there was a workshop right next to the hardware store where you and I and Grant Imahara could talk about where to position the solar panels on my go kart.\n\nI think what Jeff is trying to say is that we don't want 10 different workshops. No one is talking about splitting up the hardware store."}, {"author_name": "Chris Porter", "gravatar_hash": "a15f64286581f41eee0f402d8aad70ee", "author_url": null, "date": "Sep 28, 2010", "message": "The programmers.stackexchange.com link at the bottom of the \"I’m sensitive to the subjective...\" paragraph is broken."}, {"author_name": "Aarobot", "gravatar_hash": "687f8a43b58fe35c8b2933f1f16b13cb", "author_url": null, "date": "Sep 28, 2010", "message": "The only REAL problem with proposals like Developer Testing, Software Engineering and so on is that hordes of Stack Overflow users with only the most superficial understanding of those topics are waltzing in, posting dumb generic questions as examples, and patting each other on the back for them with votes.\n\nDo you really think that \"How do I unit test threaded code?\" or \"How do I test private methods?\" are actually the most common type of questions that would get asked on a testing site?  That's like saying \"How do I build a web app?\" is the most common kind of question on Stack Overflow.  People are going to have *specific*, in-depth questions about *specific* testing situations and that's the point - those questions do exceptionally poorly on Stack Overflow because they get buried before anyone who's actually qualified to answer them can see them.\n\nI know, it's just another one of my belligerent, zany, opinionated ideas, but I think the root cause here is that the definition phase of Area 51 is intrinsically broken for the same reason that the reputation system is sorta broken on Stack Overflow: It rewards cheap, generic, easy-to-understand sound bites, and those are precisely the ones that *should* be voted as \"Not A Good Example.\"  That's what nearly killed (and may still kill) the Software Engineering proposal.\n\nSure, you can ask really easy, generic testing questions \"How can I unit test multi-threaded code?\" on Stack Overflow and get a few good answers.  But narrow that down to \"How can I unit test the 50 different kinds of item expirations in my thread-safe asynchronous cache implementation that relies on a component with its own hidden timer thread to expire items - without having to re-implement that component myself or waiting all afternoon for the tests to complete?\" and see what kind of \"quality\" answers you get on Stack Overflow.  You'll probably get one answer linking to CHESS and if you're lucky, another answer with extremely generic advice on mocking that probably doesn't apply to your situation.\n\nIf you want to blame the failure of the system (Area 51) on an intrinsic problem with the community (\"factionalism\") then I guess I can't stop you.  But you're wrong.  Very, very wrong.  This isn't factionalism, this is the very *opposite* of factionalism, it's the Dunning-Kruger effect, the result of people with only a shallow, superficial understanding of a subject arrogantly assuming that there IS no more depth.  From the perspective of someone professionally engaged in testing or engineering or compiler design, it's analogous to teenage computer nerds claiming that they're \"hackers\" who are more than qualified to discuss the finer points of advanced cryptosystems.\n\nI still think that you will, eventually, need to start dividing up the communities on Stack Overflow, even if they all still technically exist on the same site (i.e. by virtue of mega-tags like another commenter suggested).  This is NOT because the communities hate each other or are elitist - that's just silly - but because too many questions are already going unanswered due to the mass saturation of overall questions (most of which are irrelevant to whoever is browsing the site at any given time).\n\nPutting everything together on one site was the RIGHT decision at the beginning, absolutely, no question - but you're refusing to recognize *scale* problems.  People are starting to say \"Hey, these questions don't tend to do very well on Stack Overflow and I'd like to have a community that can handle them properly\", and they're *committing* to these prospective communities, and you already *have* all the tools to support them - but instead of embracing that, you declare them \"factions\" and want to throw the proposals out the window.\n\nYou're becoming victims of your own success.  It's a shame that you refuse to look at the elephant in the room."}, {"author_name": "Mike Schinkel", "gravatar_hash": "81df87e0d3e269d6fa6a17c6914fd656", "author_url": "http://mikeschinkel.com", "date": "Sep 28, 2010", "message": "As I said on \"Merging Season\"[1], you created this problem yourselves and you are driving down a dead end street.\n\nYou will never get away from factionalism, and everything you do to get away from it will harm you more than help you. As I said on[1], either:\n\n1.) Allow the splits, or\n\n2.) Merge ALL StackExchange sites into one and update your architecture so we can experience SE *as if* it were a site about things we care about.  Both @Frankie and @Brian D made great comments and/or suggestions here along those lines in the comments.\n\nThe more you merge (unless you do #2), the fewer people you will have contributing.\n\n-Mike\n\n[1] http://blog.stackoverflow.com/2010/09/merging-season/"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 29, 2010", "message": "> because too many questions are already going unanswered due to the mass saturation of overall questions (most of which are irrelevant to whoever is browsing the site at any given time).\n\nThis is like walking into a huge video rental store (remember those?) and freaking out because there are, y'know, TOO MANY MOVIES TO CHOOSE FROM!!!1!@!one!\n\nOr, you could do what sane people do, and browse by new releases.. by dramas.. by comedies.. by blu-ray releases..\n\nIn other words, by tag."}, {"author_name": "tzenes", "gravatar_hash": "947c457cb4e5480cb8b2f09e49794834", "author_url": "http://gaming.stackexchange.com/users/102/tzenes", "date": "Sep 29, 2010", "message": "So I was shocked this morning to find out the Vim related SE (http://area51.stackexchange.com/proposals/14187/vi-vim-and-vixens) was put on hold for merging reasons.  Ok maybe not shocked, but I had been looking forward to it.  So much so, in fact, that I had a backlog of vim questions I couldn't find answers to elsewhere.\n\nSeeing no topic on meta to discuss this I decided to post my question on SO (http://stackoverflow.com/questions/3822835/) and guess what? It got answers. So I've come up with the following solution:\n\nI'm just going to post my Vim questions on SO, I can see only two (and a half) possible out comes:\n  \n  1. They get answered\n  2. They get bumped to another site and answered there.\n  2a. They get bumped around to the point where it demonstrates the need for a Vim SE.\n\nAs far as I'm concerned its: win/win/win."}, {"author_name": "Aarobot", "gravatar_hash": "b724ebca1ce4dc031f4db1215b70825e", "author_url": null, "date": "Sep 29, 2010", "message": "Jeff, you and the team desperately need to start realizing that TAGS SUCK AT LARGE SCALE.\n\nHere's a better video store analogy for Stack Overflow: When you walk in, you see a big neatly-arranged shelf of New Releases.  If you're not interested in any of the new releases (or they've already been rented out), you can try browsing by category, except that every category is a huge dumpster bin with all of the movies just piled in there with no organization or vetting whatsoever.  And there are 200,000 other people crowded in the same store trying to dig through the bins at the same time.  If you want to find Canadian Bacon, first you have to muscle your way past two dozen hipsters and sift through 300 snuff movies and home videos.\n\nAnd that's what \"factionalism\" is all about.  Building an actual sub-community around, say, the Sci-Fi genre and getting together for screenings and conventions, having your own TV channel, and generally not caring about the latest Rom-Com flavour of the month.\n\nThis is exactly what you ALREADY DID with Stack Overflow!  Part of what you did was look at the discussion forums and come up with a better UI.  But more importantly, you guys looked at existing Q&amp;A sites with similar UIs like Yahoo Answers and said, umm, how is this crap supposed to work for specialized communities like programmers?  Let me see and ask questions specific to programming and not have to read about some idiot's latest breakup!\n\nExcept you all seem to think it stops there, whereas in reality, these sub-communities grow organically and you end up with sub-sub communities like, say, the Trekkies, and they decide that after fifty collective seasons and god knows how many movies and easily tens of thousands of followers, they want their OWN screenings and conventions and whatnot because they're not interested in Star Wars and Battlestar Galactica and all that other crap.  And the cycle begins anew.\n\nYou're all acting like this is a thoughtful decision that's been researched on every level.  Except it's not.  It's you and a few other people saying \"Oh, we want segregation, but not THAT MUCH segregation.\"  You could have easily gone and made Stack Overflow a general IT site for all professional IT questions but you didn't; you decided that Server Administration was a separate topic that needed to be discussed on a separate site.\n\nYou've gone ahead and created this so-called \"democratic\" process called Area 51 and even though I've come to the conclusion over the past few months that it's fundamentally broken, it's still wrong for you to be acting like tinhorn dictators about it and say \"actually, it's only a democracy if we like what you vote for, and if we think you've screwed up, we're going to level the entire city and rebuild it ourselves.\"  Either let the communities grow out the way they want to or just kill Area 51 completely and do your own market research and create new Stack Exchange sites as you, personally, see fit.\n\nIf you want a dictatorship, I'm *fine* with that, but call a spade a spade already.  Admit that your decisions are arbitrary or at least intuitive instead of smugly insisting that the failure of *your* system to produce coherent site definitions is actually a conceptual failure of the proposal itself and thus overwhelming evidence that you and only you know exactly what level of isolation is best for everyone.\n\nIt's fine if you want to kill joke proposals, to clamp down on people abusing Area 51 for rep and general entertainment.  But now you're getting ready to kill perfectly legitimate proposals on the grounds that they'll drain membership from Stack Overflow.  That's like pointing to the Mexican immigrants and screaming \"THEY TOOK URRR JOBS!\"  Or the RIAA/MPAA pointing to torrent sites and screaming \"THEY TOOK URRR SALES!\"  It's just not true.\n\n*** People are trying to create these little clique communities because they've already decided that Stack Overflow ISN'T the place for them, as George Edison stated in no uncertain terms on MSO.  You've *already* lost that audience from Stack Overflow, at least insofar as any questions they may have about compiler design or software architecture are concerned. ***\n\nBaloney, you say?  Take a look at these two queries:\n\nhttp://odata.stackexchange.com/stackoverflow/s/546/top-users-without-new-posts\n\nhttp://odata.stackexchange.com/stackoverflow/s/547/top-users-with-infrequent-posts\n\nAs of August 31st, out of the top 500 users, 247 averaged less than 1 post per day, 77 averaged less than 1 per week, and 139 had not posted anything within 1 week.  Maybe they're all on vacation or something but the writing on the wall seems pretty clear to me: People at the top are disillusioned, they're not finding good questions to answer on Stack Overflow anymore, and based on the kinds of proposals you're seeing on Area 51, it would seem that many of them would prefer to participate in smaller communities where good content doesn't get buried under a heap of trash within 5 minutes.  It might take a while to get a good answer but at least they'll *get* a good answer.\n\nGuys, I'm in your corner.  I want you to succeed.  I've invested a huge amount of my personal time on Stack Overflow and Area 51 and a few of the betas.  I'm not trying to put you down, I just want you to start taking a more objective look at all of the wonderful things you've accomplished so far.  People are strange and unpredictable, *crowds* doubly so, and communities with 300,000 people just don't function as well as communities with 3000 people; they may have more total activity but large swathes of individuals will have less activity and be less satisfied on average.  You can either keep up with the trends, or you can deal with the attrition.  Simple as that.\n\nTags aren't going to solve it.  They just aren't.  When I say I don't want to walk into a store with 300,000 people standing shoulder-to-shoulder, I MEAN that I don't want to walk into that store.  Telling me exactly where to go to find exactly one type of product does NOT address my concerns, especially when I'm looking for 20 different items and a sizable percentage of them are mislabeled anyway.  Rest assured we'll all shop at Wal-Mart when we want something cheap and convenient - but there's still plenty of room for the good old-fashioned strip mall that has separate stores for home theatre equipment and DJ/mixing equipment, even though they're sort of related.\n\nAnd if you refuse to run those stores, somebody else will eventually be glad to step in."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 29, 2010", "message": "> People are trying to create these little clique communities because they’ve already decided that Stack Overflow ISN’T the place for them, as George Edison stated in no uncertain terms on MSO. You’ve *already* lost that audience from Stack Overflow, at least insofar as any questions they may have about compiler design or software architecture are concerned.\n\nFine, so if they're so lost, why are they even at Area 51 in the first place? Why aren't they long gone already from this terrible wasteland of a place? Something doesn't quite add up there.\n\n> Tags aren’t going to solve it. They just aren’t.\n\nTags seem to work quite well right now for a lot of people, except the factionalists who insist that they don't work, and they absolutely POSITIVELY must have their own site, with their own reputation system and cigar humidor and ping-pong table.\n\nEven though as the comment DIRECTLY ABOVE YOURS indicates their questions <i>already get answered (and well) on an existing site!</i>\n\nHonestly, what else is there to say? The proof is in the questions and answers. If the question is on-topic for an existing site, and tends to get answered well there.. everything is working!\n\n>  it would seem that many of them would prefer to participate in smaller communities\n\nA tiny and noisy minority believes this, yes.\n\nAs I said in this blog post, it is our mission to bring reasonably large communities with shared value systems (they love and hate similar things) together in the same way we brought the [Java], [C#], [PHP], [Python], and [Ruby] communities. Even kicking and screaming if we must.\n\n> And if you refuse to run those stores, somebody else will eventually be glad to step in.\n\nTo me, leadership is more than blindly kowtowing to what the community thinks it needs. The community gets <i>input</i> into the process at all times, yes -- but the community doesn't always do a great job of seeing the bigger picture."}]}