{"response": [{"author_name": "John Ferguson", "gravatar_hash": "b67e77f0ebfd02feab11af0a6175e0dc", "author_url": null, "date": "Sep 02, 2010", "message": "But from those results the UNIX users did want to merge. Either the Ubuntu users are the factionalists or they were scared that Ubuntu users seeking answers on a generalised UNIX/Linux stack-exchange would be put off by the more arcane side of POSIX-land."}, {"author_name": "Martin", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Sep 02, 2010", "message": "Why either was allowed to branch from superuser.com is beyond me to be honest."}, {"author_name": "Laurence Brevard", "gravatar_hash": "fedc103058a54e78d76bfc3a941c7327", "author_url": "http://brevardandbrevard.com", "date": "Sep 02, 2010", "message": "I've been involved with computers since BEFORE Unix (starting in 1967). While I love Linux (in general) I have always said that Unix was the OS (community) that could not even agree on the backspace character! \n\nThanks for the tremendously useful resources of StackOverflow, ServerFault, and SuperUser - with their high signal to noise ratios."}, {"author_name": "Jamie Hale", "gravatar_hash": "04523fb5cc74b0f807d5b4c2c0b637d9", "author_url": null, "date": "Sep 02, 2010", "message": "Will you link the sites together so that someone posting a question on one will be able to see similar posts on the others?\n\nIf not, don't you risk frustrating users by forcing them to check multiple sites?"}, {"author_name": "Yoni", "gravatar_hash": "3cd6861feb69cd6a65b88c9c4895bf6b", "author_url": "http://scriboergosum.wordpress.com", "date": "Sep 02, 2010", "message": "With all due respect, all I am reading from your post is that the sample size of the poll just wasn't large enough.\n\nA quick look at the users page on both sites shows that you made a decision based on less that 10% of the user population.\n\nMy personal opinion is that you made the wrong decision, and that the sites should be merged (Ubuntu can a have a niche within a larger site, just like tons of other topics on SO).\n\nIn any case, I suggest finding a way to promote your polls on the site itself via stackexchange and the stackexchange network of sites, rather than rely on your blog."}, {"author_name": "Bebo", "gravatar_hash": "97bd038ce05870745d1f397a2c6c4485", "author_url": null, "date": "Sep 02, 2010", "message": "I do believe you just made fun of the Ubuntu/Unix/Linux crowd. ;-)"}, {"author_name": "MikeRand", "gravatar_hash": "2f822f8f82def56dc3237cc4ff794e9e", "author_url": null, "date": "Sep 02, 2010", "message": "I \"love\" Python because it's the language I'm learning, but I'm still happy that my SO searches turn up answers in other languages:\n\na) it's a decent way to see how other problems are solved in other languages,\n\nb) when it's Java/C/C++, I'm able (with my limited C knowledge) to leverage the answer 80% of the time.\n\nI guess I'd just like someone to explain to me where \ntags stop making sense and whole new Exchanges start."}, {"author_name": "RT", "gravatar_hash": "ec8b38eff40f467ae47ea8a89d7f97ab", "author_url": null, "date": "Sep 02, 2010", "message": "- Ubuntu is (arguably?) the most popular Linux distribution nowadays\n- Ubuntu is quite consistent in its way to do things\n- Ubuntu includes the non-hardcore-techie folks in its target market\n\nso,\n\n- Ubuntu users usually find answers specific to Ubuntu, instead of generic answers which require you to find (depending on the distribution) out where some library is, or if some command is available. Other distributions' users get happy from finding *any* answer related to his problem, even if this answer refers to another distribution or version, or another problem which vaguely resembles theirs.\n- Ubuntu answers for most problems usually consist in some 'sudo apt-get foobar'.\n- Many, many Ubuntu users are users, not hackers. They just want their mouse, video card, and ftp server to work, and just don't care if their applications' binaries are compiled and optimized to their processors, or if their system is 100% free software, or if it follows some specific philosophy.\n\n\nthen,\n\n- Ubuntu users don't need other distributions' users to have their questions answered.\n- Ubuntu users don't want generic answers, they want a sequence of steps to get things working.\n- Ubuntu users don't want their questions/answers to be lost in a flood of generic debates (generic unix/linux answers aren't answers, are debates about what is the best approach)\n\nI moved to Ubuntu, because I was tired of being a system administrator, instead of a user of my own machine. I see no reason to even look behind."}, {"author_name": "Paul Alexander", "gravatar_hash": "d885ab1335e04d28aa89618ee67126f2", "author_url": null, "date": "Sep 02, 2010", "message": "This is the age of mashups - why does the _data_ have to exist in only one location? It makes great sense to have the communities exist on separate domains but there's a large quantity of shared data to be sure. Certainly there should be a way for the same question, where it is relevant to both groups, to be present on both sites."}, {"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Sep 02, 2010", "message": "I'm sad that the Ubuntu separatists have chosen this. However, I see it as there own loss. They do not have the benefit of the experience of non-Ubuntu users. I myself have helped Ubuntu-ers in the past to do very manual things, that solved there problems. They didn't know how, or where to look because Ubuntu has not the documentation nor the community for these things.\n\nThis decision scares me as it set precedence that the other 'fork-ers' will be justified in destroying any unified question sites. Instead of SO we will likely see proposals for $language start to succeed. There also already more $distro proposals.\n\nI'm disappointed that this was even left up to the community to decide, TBH, but such is 'democracy'."}, {"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Sep 02, 2010", "message": "@RT debates have no real place on Stack Exchange sites, there are only answers to question. Bash is Bash whether it's on Ubuntu or FreeBSD, Gnome is Gnome, apt is apt but it only applies to distro's that used Debian as a base. I have found myself stripping a few questions of Distro specific tags on the Unix site, more than I add them."}, {"author_name": "NG", "gravatar_hash": "cbfa20635c9269675d54547c080c9b64", "author_url": null, "date": "Sep 02, 2010", "message": "The fragmentation will eventually be to the detriment of stack exchange. If I'm a whatever expert, I'll know to go to whatever.stackexchange.com. But the point is, I'm not an expert, which is why I'm going to these sites. At the moment, I have confidence that if I google \"site:stackoverflow.com my question\" I'll have a pretty exhaustive set of answers. If it gets too fragmented, I won't have that confidence anymore. In the back of my mind I'll be thinking I wonder if someone on obscurethingIdontknowabout.stackoverflow.com answered this better."}, {"author_name": "Xiong Chiamiov", "gravatar_hash": "49e1f0165a9340fcbad51c2d7886100c", "author_url": "http://changedmy.name/", "date": "Sep 02, 2010", "message": "So, in totally unrelated news, the SO blog isn't parsing in Google Reader any more, and apparently hasn't been since... http://blog.stackoverflow.com/2009/11/podcast-75/ &lt;-- this post.  I only noticed because this popped up on Hacker News."}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": "http://echoreply.us/tech/", "date": "Sep 02, 2010", "message": "Just wait until Gnewsense plays into it :) That is a WHOLE OTHER SITE :)\n\nOn the one hand, you're dealing with hackers who have tried to run patent and non-free software free systems . since the mid 80's. 1984 for most.\n\nOn the other hand, you have users who just want their computers to work and don't give a crap how that happens.\n\nThen there are those who say you should care about one, the other, or both who delight in being nothing but pundits. Yeah, that will go far.\n\nAnd then finally you have prestigious recording artists recording a modern day \"Don't copy that floppy\" and blaming 'hackers' in general, with no understanding of what the term 'hacker' actually means.\n\nWelcome to the world of free software :)"}, {"author_name": "Joel Spolsky", "gravatar_hash": "95e6837f350869bfb44e069a98885c58", "author_url": "http://stackoverflow.com", "date": "Sep 02, 2010", "message": "@Xiong are you subscribed to the podcast feed (http://blog.stackoverflow.com/?feed=podcast) or the main feed (http://blog.stackoverflow.com/feed/ )?"}, {"author_name": "Dan Dumitru", "gravatar_hash": "dead5c6457591268b4bd4c6199fa16b6", "author_url": "http://riotingbits.com", "date": "Sep 02, 2010", "message": "http://blog.stackoverflow.com/feed/ works, it's what I use in my Google Reader..."}, {"author_name": "ipc", "gravatar_hash": "f2aa6d01f82b8139f721a7f14a8895bd", "author_url": null, "date": "Sep 02, 2010", "message": "aren't 'stackoverflow', 'serverfault', and 'superuser' just tags themselves?  What is the advantage of providing separate sites?"}, {"author_name": "Nick Coghlan", "gravatar_hash": "f3ba3ecffd20251d73749afbfa636786", "author_url": null, "date": "Sep 02, 2010", "message": "Joel, have you given any thought to a federated meta-exchange that provides a view across *all* of the stack exchange sites, treating the subsite as just another tag?\n\nOr, on a smaller scale, having all of the ubuntu questions and answers appears as part of unix.stackexchange.com, with an extra tag \"ubuntu.stackexchange.com\"?"}, {"author_name": "Maarten ter Huurne", "gravatar_hash": "fbd473e7e3b6675a84cd3c3b4a2c1972", "author_url": null, "date": "Sep 02, 2010", "message": "It's possible that Ubuntu users who favor the merge were using the UNIX site and voted there instead of on the Ubuntu specific site."}, {"author_name": "MikeRand", "gravatar_hash": "2f822f8f82def56dc3237cc4ff794e9e", "author_url": null, "date": "Sep 02, 2010", "message": "ipc/Nick:\n\nPart of the reason that a site might make sense is that the voting/reputation engine works across tags but not across sites. I might not want somebody who's an ace on Stack Overflow getting good reputation on Sever Fault, but I might be willing to say that a Python programming ace can comment on object oriented stuff, etc.\n\nThat said, maybe the \"specific\" aspect of community is relevant voting/reputation (since tags/search seem to take care of relevant content). Might there be a case that the voting/reputation engine should take into account the tags on which a person answered questions (e.g. S.Lott would have a lot of reputation answering questions on Python, a lot less answering questions on Haskell)."}, {"author_name": "jacob", "gravatar_hash": "c0e7d52ef4ad3b9c2cfb8c300be33582", "author_url": null, "date": "Sep 02, 2010", "message": "I don't give a shit about unix/linux/ubuntu but this is the wrong way to deal with this. I remember one of you 2 guys ranting in the podcast how many crappy QA sites there are on the net - now you're just perpetuating that.\n\nThere should be only one backend for everything. The various sites should be filters for it all. Think of it as one big table and lots of views. Yes really, cooking and programming and dog grooming all in one database. Think of the domains as tags/filters."}, {"author_name": "Roger Barnes", "gravatar_hash": "dd6c985d22e3bf6ea849e8d2e6750d76", "author_url": "http://roger.mindsocket.com.au/", "date": "Sep 02, 2010", "message": "Adding my voice to the chorus, this arbitrary separation of \"super-tags\" isn't helping anybody.\n\nI can see the need for separate sites so that knitting and ubuntu don't get blended, but questions need to be able to transcend site boundaries when appropriate."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 02, 2010", "message": "> In any case, I suggest finding a way to promote your polls on the site itself via stackexchange and the stackexchange network of sites, rather than rely on your blog.\n\nEvery user of each site that was eligible to vote (that is, they had a minimum 3 upvotes on their questions or answers on that website) had a vote notification inserted into their site message queue. If you came to either site at all in the last 7-10 days, you couldn't avoid being invited to vote with a hyperlink directly to the voting page."}, {"author_name": "Mark Weiss", "gravatar_hash": "760fbe232eb144edb34f88dfb80c678b", "author_url": null, "date": "Sep 02, 2010", "message": "Adding a +1 to comment by @jacob.  Taking the idea of one backend filtered by tags into many views one step further, users could have saved/custom sets of tags and build their own views over the SO content.  Why lock the community into static decisions about how to group posts?  Why not have \"preset\" site groupings but offer all the flexibility possible in a tag-based system, for those that want it?"}, {"author_name": "Kent Fredric", "gravatar_hash": "627ea286aab8e9593819d200d3e81f4e", "author_url": "http://blog.fox.geek.nz", "date": "Sep 02, 2010", "message": "I like the concept of questions being cross-linked between relevant domains, but I don't think it needs to be as simple as \"a tag filter\".\n\nBecause which domain something appears on is more contestable than mere tags, I'd rather have it as some vote based system.\n\nie: So people on ubuntu.* have the ability to vote \"this is generic enough to be cross-linked to unix.*\", and upon enough votes, it appears in both places, and the people over at unix.* have the power to vote against it when it appears with \"sorry, we disagree, it doesn't belong here\".\n\nOtherwise in cases of contention, there will be a frustrating mess of questions popping between servers and magically vanishing simply because somebody got whimsical and changed a tag."}, {"author_name": "Kent Fredric", "gravatar_hash": "627ea286aab8e9593819d200d3e81f4e", "author_url": "http://blog.fox.geek.nz", "date": "Sep 02, 2010", "message": "( extension ). I think why this is important, as I see it, is all the users of the various sites are *not* one large logical cohesive community. \n\nThey're all distinct separate communities with their own rules and criteria for what is and what is not acceptable content in that community, and thus, another community having the ability to whimsically push content into your community is very intrusive and anti-community.\n\nThe receiving community should have the final say whether or not that content is fit for that community, as they are more in-tune with the standards of that community and are the best qualified to assess the content because of that."}, {"author_name": "Wayne B", "gravatar_hash": "770a1f4797cc0879dd9e4954104767b1", "author_url": null, "date": "Sep 02, 2010", "message": "This is brilliant. Instead of making the questioner pick a category for their question, you make them pick which SITE to post their question to. Much simpler and certainly less confusing! [/sarcasm]"}, {"author_name": "Wouter Simons", "gravatar_hash": "4aeb4d6ebd34a5bcc7b48de60a2bd137", "author_url": null, "date": "Sep 02, 2010", "message": "The most interesting thing about reading this article and then all the subsequent posts is seeing how the discussion is pushed towards the my OS is more different than yours, rather than focused on the rather good point Monty Python originally made.\n\nMore sites are needed, because people are unable to unite and accept tags as a sufficient means to separate their questions into a specific corner. I am a kernel mailing list subscriber, this is where my main experience with these sorts of discussions comes from. Fork-it indeed, you can always upstream the good stuff, or can you?\n\nIf stackoverflow submits to the need to fork, can it also use the power of upstreaming from a fork? Can the tags be made searchable across all sites? I.e. if I want to see what has been said about the tag combination \"Linux\" &amp;&amp; \"Sysfs\" &amp;&amp; \"Cdev\" can I see what is on ubuntu/unix/whateverotherstackexchange? Now everyone can have a judean people front/people's front of judeans site and I can still find everything."}, {"author_name": "Wouter Simons", "gravatar_hash": "4aeb4d6ebd34a5bcc7b48de60a2bd137", "author_url": null, "date": "Sep 02, 2010", "message": "@jacob Alright, I will come out and admit it. I did not read through all the posts.\n\nI would sort of +1 this thought, however, I do not think it is relevant to talk about how the sites work in the background and the views you can define for your own research could be made possible on almost any architecture with some smart indexing.\n\nOf course indexing is very specific, so we would need a stackexchange site to discuss it. indexing.stackoverflow.com or something. But then that might look like it is about SQL based indexing, so we should probably get sql-indexing to give people a place to discuss all that.\n\n:P"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 03, 2010", "message": "> There should be only one backend for everything. The various sites should be filters for it all. Think of it as one big table and lots of views. Yes really, cooking and programming and dog grooming all in one database. Think of the domains as tags/filters.\n\n> Instead of making the questioner pick a category for their question, you make them pick which SITE to post their question to\n\nActually, the correct term is community. And communities have boundaries, where they rally around things they love, and fight against things they hate. A \"site\" which covers \"everything\" rapidly degenerates into noise.\n\nI would say that Yahoo Answers, answers.com, allexperts.com, wikianswer, askville, answerbag, yedda, and the hundreds of other generic \"answer\" sites have proven that this is a bad idea.\n\n> If stackoverflow submits to the need to fork, can it also use the power of upstreaming from a fork? Can the tags be made searchable across all sites?\n\nThis is generally referred to as \"Google\".."}, {"author_name": "Diederik van der Boor", "gravatar_hash": "fa7f6c8be0d09fd8438332eef28a40d3", "author_url": null, "date": "Sep 03, 2010", "message": "How is 89 vs 34 not a majority? That's 72% saying yes.\n\nYour observations about the UNIX world are clear, yet I wonder which slice of the community you managed to interview. The core group? The veterans? The loud enthusiasts? Many fanboys polarize.\n\nDemocracy is not always the answer. In this case, I think taking a stand would have been better. Exactly like you did when SO was started.\n\nWould stackoverflow be the same when developers got to vote about *one site* vs a site per programming language?"}, {"author_name": "Rob Uttley", "gravatar_hash": "63abdbd32a1e7c6af8fba76bea1a074a", "author_url": null, "date": "Sep 03, 2010", "message": "For what it's worth, I was someone who voted against the merger, on the Ubuntu site. I must say that the more I've thought about it, the more I think this was a mistake.\n\nI'm a total Ubuntu noob, using it to solve a specific problem 'at work' rather than being some kind of hobbyist or enthusiast, and I was concerned that by merging the sites we'd end up with every query being answered with a million 'why don't you use blah instead' or even worse, 'if you want to do that kind of thing, you're using the wrong version of Linux, blah-x is much better' (etc), rather than answers directed at solving the specific problem in it's specific problem domain.\n\nBut on reflection this isn't a problem on Stack Overflow (it happens, but not to a huge extent by any means and usualy it's done in a constructive, supportive way) and I think that with a bit of careful tagging and some restraint  and consideration on all sides, it would work just fine for Ubuntu and Unix too.\n\nSo I now believe the sites should be merged, for what it's worth!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 03, 2010", "message": "> Democracy is not always the answer. In this case, I think taking a stand would have been better. Exactly like you did when SO was started.\n\nI would have REALLY preferred it of 50%+ of each site had voted for the merge, to let Democracy work, but since they did a Gore/Bush perfect split nothing was decided. Sadly.\n\nWe MUCH prefer to let the communities vote and decide, but when they cannot reach a decision, it is unfortunately left up to us ... and by us I mean the team here at Stack Overflow Internet Services.\n\nFor the record, it was my vote to force merge them -- but I am not the only person casting a vote here, and I deferred to the overall sentiment of the SO Inc group, in a mini-democracy. Such as it is.\n\n(Full disclosure: maybe editorially overriding the community's indecision would be a bit heavy-handed.. but I'm not afraid to be a dick when I have to, because sometimes, honestly, being a <i>little bit</i> of a dick is what it takes to get things done in this world.)"}, {"author_name": "ADB", "gravatar_hash": "d622054cf6bc37a82dc13708b440aedd", "author_url": "http://www.greencod.com", "date": "Sep 03, 2010", "message": "This situation looks a lot like an unsolved problem. And it feels a bit like before StackOverflow was introduced: a world in which we know forums were not what we were looking for, but they were all we had. \n\nI just hope you find the solution to this puzzle so we can I migrate to the next level. I know I don't have a solution, but there ought to be one! Multiple sites so related to each other are split, lowering the potential number of people to answer them... it feels wrong.\n\nMaybe a tweet deck for StackOverflow?"}, {"author_name": "MAK", "gravatar_hash": "ad5a692e6c564556953c2db8a51bdab2", "author_url": null, "date": "Sep 03, 2010", "message": "I'm a ubuntu user, but I would've preferred a unified Linux site. I would not prefer a unified Unix site though, but I would have been ok with it. After all, tagging means that the questions get answered by the appropriate people, and the community does a pretty good job of filtering out arguments and similar garbage. \n\nAt the end of the day, I imagine a big chunk of activity there would have ended up about Ubuntu anyway.\n\nThe Unix world loves a lot of things. But taking sides is human nature, as you note yourself in this post. Please don't try to pass this as a pathology of Unix users alone. Unix users are perhaps more passionate about their OS. Heck, since you've already started it, I'm going to go as far as saying Unix users are more knowledgeable and aware about the intricacies and little differences than most users of other OSes. \n\nBut I agree, all this is just taking it a bit too far, and besides the point. The SO model makes it possible to have a large enough functional community to include everyone."}, {"author_name": "Umang", "gravatar_hash": "ef51b3b6b4daa5cd874abcf7916f7a71", "author_url": null, "date": "Sep 03, 2010", "message": "I agree with ADB. I strongly feel we should merge all these (computer related) sites and leave then as SO, SU and SF. Only categories that are clearly outside these sites: e.g Gaming should have their own side.\n\nI'm going to accept this decision however and participate in both."}, {"author_name": "Teej", "gravatar_hash": "4882618e75f402b2726bf3ac5d0a31c5", "author_url": null, "date": "Sep 03, 2010", "message": "Joel, what Stack Overflow need is a Steve Jobs, not a democracy."}, {"author_name": "Denny", "gravatar_hash": "4dc98d484bde3cbf271045879c170d78", "author_url": null, "date": "Sep 03, 2010", "message": "+1 @Jamie Hale &amp; others.  Would love to see a site to access all of the SO network.  There's just a lot of topics with overlap."}, {"author_name": "Hakon", "gravatar_hash": "697e26967492bb0e4029a317c197792e", "author_url": "http://www.SoftwareQuotes.com", "date": "Sep 03, 2010", "message": "Why not be able share questions between sites?"}, {"author_name": "gWaldo", "gravatar_hash": "2f8629fd72eb23d0e3db72474fcd8223", "author_url": "http://gwaldo.blogspot.com", "date": "Sep 03, 2010", "message": "Mr. Spolsky, I don't envy the decision that you had to made, but personally, I found the SO/SF/SU split very satisfying.  I enjoyed the fact that each community is very platform-agnostic, each categorized via tags.\n\nI myself am very platform-agnostic (anyone caring enough can look at my answers to see where I'm heaviest), and enjoy learning from other experts in areas in which I am weak.  Unfortunately for me and my wide-ranging skillset, it seems as though it'll be harder for me to leverage communities effectively.\n\nI can't say that I'm happy about the forking, but it is your decision to make.  Thank you for these fine communities with their high signal-to-noise ratio."}, {"author_name": "Paul", "gravatar_hash": "85418dc380cad9479c2643099d7eb39c", "author_url": "http://dictionary.reference.com/browse/their", "date": "Sep 03, 2010", "message": "I realise it's completely off-topic but I cannot let Caleb's misuse (post 10) of \"there\" in place of \"their\" stand unchallenged.\n\nEnglish: it's an unstructured, confusing and ugly mess but it's ours and we should protect and treasure it."}, {"author_name": "Dr. Jochen L. Leidner", "gravatar_hash": "a905ab38110e68c6465b6fcd18d75887", "author_url": "http://www.jochenleidner.com", "date": "Sep 03, 2010", "message": "Since you reference USENET, I have to state that I simply _loved_ its newsgroups. It had a structure, so for posting a Linux question, I could just go to comp.os.linux, and for a Monty Python joke I could catch up with alt.fan.monty-python. What was wrong with that?\n\n- USENET posts could be longer than the silly 140 character limit that Twitter imposes.\n- USENET was organized hierarchically as a tree.\n- USENET clients permitted replying to a post by pressing 'r', which\n- was much easier that a mouse click preceded by 10 minutes of RSI-inducing scroll wheel action.\n- USENET could use plain text, which is superior for technical problem discussions than HTML, which requires escaping characters commonly found in code and often leads to garbled responses.\n\nSo here's my heretic idea - why not classify SO messages using a Bayesian classifier according to the USENET taxonomy and cross-post them there?\n\nSigned,\nThe USENET Liberation Front"}, {"author_name": "PointMade", "gravatar_hash": "ee7dc45c380192144092b2a638f12578", "author_url": null, "date": "Sep 03, 2010", "message": "The reason stackoverflow has succeeded where generalized answer sites have failed is not as simple as \"people like it more specific\".\n\nI would express it more as \"those who have an interest in what they see want to participate in it and improve it\"\nConsider if you had a feed reader that subscribed you to some feeds you were interested in and a whole bunch you weren't.\nThink also about email, the barrage of stuff that isn't worth the time it takes to identify and ignore it, which detracts from the overall usefulness.\n\nThis makes it a signal to noise ratio that is different for every person, depending entirely on where their interests begin and end.\n\nExtrapolating a bit: StackOverflow works because the people who you want to participate are those whose interests extend past language barriers. Those who will take an interest in a site that ignores language boundaries are valuable to programming. It's a perfect selection.\nOn the other hand, those who would rather have a $language$ site, while they would likely participate in it, are likely to be less valuable (likely less experienced overall).\n\nNow this leads perfectly to the unix/ubuntu split. Who wants the join? Mainly the unix people, whose interests extend beyond the particular Distro/OS. These people, as with lang. agnostic programmers, could be considered more valuable to the community.\n\nNow comes the argument that although experienced people understand Ubuntu, there are people who use Ubuntu with interests cut off from the more agnostic types. These people aren't going to grow into agnostic types anymore than an average person grows into an electrician.\nThis is a fact, and this is 95% more likely to happen with a Ubuntu user than with any other distro.\n\nThe facts are all in place, now the million dollar question:\nTo merge or not to merge?\n\nBreak it down a bit now:\n\nWill the separate Ubuntu community (presumably people who \"don't want to be electritians\") be able to provide good answers for each other, and so make a good community?\n\nWill the combined Unix community churn out bash scripts and compilation instructions to this \"non-electrician\" community to where you lose it?\n\n\nI believe the first question's answer, while unable to be certain, is likely \"no\", at least compared to what it would be otherwise. It will depend on people who are \"electritians\" to have good answers. While I'm sure there are some very knowledgable people who just want to help average users, on the whole it will likely be a second rate community.\n\nNow if the second question has a yes answer, even if the first has no, it could be said that you may as well separate, because it's a mediocre community vs losing the people altogether. That makes this question the real key.\n\nTo this second question, I must humbly submit that I believe the answer is also no. I believe that the best answer is the simplest one that works, and while in the forums of times past those were hit and miss, with the system provided in stackoverflow this should change.\n\nNon-electritians and those who want to help them progress will find that it's not the people that gave bad/complicated answers, but the horrid forum systems of the past. They will find a combined site to be nothing like what's been on the internet before.\n\nPlease Jeff, be a dick, do the right thing."}, {"author_name": "Paul Howells", "gravatar_hash": "6d6f1dcbeaf6819cfb5dc8b624901a3e", "author_url": null, "date": "Sep 04, 2010", "message": "So what would happen if \nUbuntu.stackexchange questions were visible to Unix.stackexchange users (signalled or tagged as #ubuntu to maintain context), \nand \nUnix.stackexchange questions remained invisible to Ubuntu.stackexchange users \n?\n\nI have no idea, but I'd like to know if it could work."}, {"author_name": "Roberto Lopez Bujan", "gravatar_hash": "0489be5102e78562fe8c9ea280e91c2d", "author_url": null, "date": "Sep 04, 2010", "message": "Not all users are invested in the tribe, but all users are invested in the answer.\n\nThis is why I still post questions to Google's search box, because Google infiltrates all sides and will find my answer among Stack Overflow, Superuser, and Server Fault.  \n\nMaybe the solution is to find a way to make the stack exchange search boxes include answers from related stack exchanges with priority or preference provided to the results closest to the user's cult interests (Ubuntu people or Universalists).  \n\nThen everybody wins, but everyone also gets a front-end that speaks to their tribe."}, {"author_name": "Peter", "gravatar_hash": "9a9c700d14f561980defa3f295ba2c93", "author_url": null, "date": "Sep 04, 2010", "message": "Who'll be the first to post the same question to both groups with: \"Apologies for the cross-posting, but ...\""}, {"author_name": "سيارات", "gravatar_hash": "e4b4b53c8d104121d634f5f705be5270", "author_url": "http://www.soqak.com", "date": "Sep 05, 2010", "message": "long live Ubuntu"}, {"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Sep 05, 2010", "message": "@Paul unfortunately I type phonetically, and my web browser does not catch when I type the wrong word. I know the difference, I just don't always type the right one, and I'm very lazy about rereading what I've written  before hitting submit. Unfortunately these comments have no edit button."}, {"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Sep 05, 2010", "message": "@Paul I've also been known to type no, when I mean know, and do, when I mean due, etc and vice versa. This phonetic typing may be due to some form of undiagnosed dyslexia or something ( I don't really know ) given that I've caught myself reading thing backwards. If something like that is the case... is it really appropriate for you to point out someone else's disability?"}, {"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Sep 05, 2010", "message": "I want to say that I'm not sure these polls were started at the right time... Unix SE didn't have moderators yet, I think even now we are working out what is and is not allowed. I myself have recently reversed my opinion on whether we should define ourselves by \"what is also available on other platforms\" (e.g. are Firefox questions allowed? ) because so many apps I use on *nix are now cross-platform, or are becoming cross-platform, and apps like Firefox have differences on Unix systems in the way the work, and even in things like menu options (though I don't know why FF did that)."}, {"author_name": "Daniel", "gravatar_hash": "1c5255f8496fcade0244f12cb6ca6405", "author_url": null, "date": "Sep 05, 2010", "message": "At the end of the day you want a question and answer site that works. \n\nIn my experience with getting answers to ubuntu questions I have had. I have much better success with ubuntu specific forums and websites then I ever have had with generic unix or linux sites.\n\nThe generic unix answers are usually way above my head, are to generic or apply to a different distribution or package manager to the one in ubuntu.  And often leave me trying to figure out what package X is called on ubuntu. Or why I can't find this or thing configuration tool.\n\nIf you want ubuntu users to find good answers to their questions you need a ubuntu specific site. Its not about tribalism, or separatism. \n\nIts about whether or not you want stackexchange to work for ubuntu users.\n\nP.S has anyone else noticed that the ubuntu stack exchange is bigger then the unix site. Which either means:\n1. ubuntu is bigger then the rest of unix put together.... unlikely\n2. distro specific sites work better."}, {"author_name": "grumpy", "gravatar_hash": "89e75e356f00cc146d7e9f3821f4d262", "author_url": null, "date": "Sep 05, 2010", "message": "I understand why we need to separate Cooking discussions from the ones on Programming. However, I simply don't understand why we need Server Fault, Super User, Ubuntu and Linux/Unix as separate sites. These topics are all very closely related. (I did vote for some of these new sites... but only after the fragmentation had already started.)"}, {"author_name": "nstenz", "gravatar_hash": "357a20e8c56e69d6f9734d23ef9517e8", "author_url": null, "date": "Sep 06, 2010", "message": "As an Ubuntu user who's used several other Linux distros &amp; BSD in the past, I always check the Ubuntu-specific forums for help first. The way to get something done in Ubuntu is frequently considerably different than the way you'd do it elsewhere. I've messed things up several times following generic instructions that, while they worked, were impossible for me to reverse and do the \"correct\" Ubuntu way.\n- I removed the startup service for the network manager instead of just USING the network manager to set a static IP (duh!)\n- I killed off pulseaudio because it's a piece of garbage, which got me basic sound in applications, but Ubuntu's volume tray &amp; mixer app need pulse, and the old one isn't in the repo anymore\n- Some things that work in other distros just plain don't work in Ubuntu because the devs decided it needed to be simpler (search for 'ubuntu notify-send ignores timeout parameter' for a fantastic example- it's Godwin's law-invoking)\n\nYou can try to hack apart config files, tar xvf, ./configure, make, ... all day, but in the end, on Ubuntu, either you use the packages and config options that are available, or you screw up your system.\n\nI'm happy to look for things tagged #ubuntu on a general site, but I can never be sure when looking at something not specifically tagged \"Ubuntu\" that an answer will be acceptable \"the Ubuntu way\" without trashing my system.\n\nYou can do it either way, but I'm guessing most users are going to look for \"Ubuntu\" first and fall back to \"linux\" if they still can't find help (at least the experienced ones)."}, {"author_name": "nstenz", "gravatar_hash": "357a20e8c56e69d6f9734d23ef9517e8", "author_url": null, "date": "Sep 06, 2010", "message": "I also I agree that some sort of cross-linking or cross-posting functionality is desirable. I like the idea of the community RECEIVING the topic also having to vote to OK it."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Sep 06, 2010", "message": "From reading the comments here, it's pretty clear that the Ubuntu community voted as they did not because a merged StackExchange would actually be a problem, but because historically, in a pre-StackExchange world, general Unix/Linux forums were useless for Ubuntu users. \n\nBut that doesn't mean a merged StackExchange site wouldn't work. \n\nAnyway, I'm mostly worried about the precedent this is setting.\n\nWhat's to stop a Java, Python or C++ StackExchange now? When are we going to get a SuperOSXUser site to compete with SuperUser?\n\nThe *nix case was a tricky situation because there was no precedent, and the problem was only made apparent after both sites had been launched, making a merger controversial.\n\nI think the best solution had been some oversight *before* allowing the sites to go into beta. Someone to stop and think and say \"Ok, we've got a Linux site here, and a Ubuntu site gathering speed. There is a conflict of interests we need to resolve\". Then either merge them outright, or transform them into separate Linux-Users and Linux-Hackers sites, since that essentially seems to be the distinction the Ubuntu users cared about, or along some other axis that would cover the same ground, but without the overlap.\n\nThe solution didn't have to be \"One *nix site to rule them all\". It could have been similar to StackOverflow vs SuperUser: one site for those who want to mess with Linux, and another for those who just want their computer to work when they turn it on. The latter pretty much seems to be what the \"separatists\" in the comments above have requested: a way to ask questions about their Ubuntu system (which could be covered by a simple [ubuntu] tag), on a site targeted at *users*, not hackers or programmers.\n\nThe A51 process as it stands is broken. It is a waterfall model, where the sites are only evaluated at the very end, after they've been in use for months. And that makes it nearly impossible to change or reject a site once it gets that far. For the A51 concept to work, a more agile approach is needed, where the sites are constantly evaluated and tweaked, not just by their own community, but by someone aware of what's happening in the *rest* of the StackExchange universe as well. Someone who can push the scope of a site in the direction with the least overlap, and who can take the hard decisions when necessary.\n\nSo-called democracy is just going to give us what we had a couple of years ago: a million useless forums, and no idea where to look for answers to our questions.\n\nI'd have thought that the founders of StackOverflow, of all people, knew better than to blindly let the community fracture itself."}, {"author_name": "Legolas", "gravatar_hash": "ac3ef7b5ec4ec123ac7bacb1543dacf3", "author_url": null, "date": "Sep 07, 2010", "message": "What Hakon said: Allow a question to be also published on multiple sites. (In fact, also allow others to tag it in a way that it also shows up on other sites.)\n\nBecause it's funny how you make jokes about 'alt.taxonomy.obsessive.judean.people’s-front.popular', but really, you have already created comp.unix.general and comp.unix.distributions.ubuntu and comp.programming and comp.sysadministration etc etc...\n\nSo go meta: apply the stackoverflow idea to your grwoing crop of sites. If you don;t, you have just re-invented the problems of usenet..."}, {"author_name": "Alan Bourke", "gravatar_hash": "c147cc2b1b138563158075049012f24e", "author_url": null, "date": "Sep 08, 2010", "message": "Look, it's simple. Just propose that the existing Ubuntu and *nix groups are merged into a group called 'We Hate Windows' and they'll flock to it."}, {"author_name": "Kiru", "gravatar_hash": "596e7cfcc68c6711dced05001e3bf746", "author_url": null, "date": "Sep 08, 2010", "message": "For my part, I oppose the creation of both unix.SE and ubuntu.SE . 90% of the questions on either belong under a [bash] tag on SO, or under a [unix/ubuntu] tag on SU. The remaining 10% are idiotic popularity contests (neither community is as vicious to these as SO). Note that I've got a few hundred rep on both unix and ubuntu, I just think they're terrible ideas.\n\nMy general thought on any area51 site is always \"Does this fit on SO or SU (or even SF)?\"\n\nGood: Coffee, Japanese, Gardening and Landscaping, Homebrewing\n\nVery Questionable: Webmasters (SF?), User Interface, Web Applications, Software Engineering\n\nBad: DotNetNuke, Ubuntu, Unix, Python/Perl/C++/whatever, Webservice APIs\n\nI'm split on proposals like \"vim\" or \"emacs\". SO, SU and SF users could be expected to be roughly equal in expertise... a cross-site meta-tag is really what is needed here, and I'm not sure if a vim.SX is better or worse than the current situation."}, {"author_name": "qwerty", "gravatar_hash": "2085b9877cfd0322d790206e7d7a956d", "author_url": null, "date": "Sep 09, 2010", "message": "You posted the problem and didn't seem to realize it was a problem.\n\n\nHaving superuser and serverfault breaks your model of relying on tags. So now you have three sites where most of the users of any one will likely use at least one other.\n\n\nSo now people have to check in two or three places. \n\nIn other words you broke your own system of tags and are now no different than the message boards arguing about where to put questions.\n\nTalk about shooting yourself in the foot!\n\nMerge all three sites! Failing that, There is no reason for an Ubuntu SE. Having an Ubuntu SE is like having a Ruby or C++ SE. \n\nYou are really losing focus!!!!"}, {"author_name": "qwerty", "gravatar_hash": "2085b9877cfd0322d790206e7d7a956d", "author_url": null, "date": "Sep 09, 2010", "message": "\"This is generally referred to as “Google”..\"\n\nUsing Google to search SO is an excessive in frustration as Google is getting worse by the day.\n\nI can see keeping cooking and programming separate, but having SO, SU, and SF walled off completely contradicts the stated goals."}, {"author_name": "Jeff Oresik", "gravatar_hash": "1d64dab302497935886036efa52fa798", "author_url": "http://www.oresik.com", "date": "Sep 09, 2010", "message": "Go to SO, click on one of my favorite tags, view, comment, answer and ask questions. Unless someone uses the Ubuntu flag because that is the name of their dog and they have a breeding question, it really wouldn't interfere. Tags are an easy way to define communtity and not just SO in general."}, {"author_name": "Chris Hayes", "gravatar_hash": "6b1392b44dc23f299b843a568b231113", "author_url": "http://myofficevideos.com", "date": "Sep 09, 2010", "message": "This argument is circular.  It keeps going around and around.  What if you had ONE site for ALL questions and let EVERYTHING have a meta tag of some sort.\n\nHow much salt should  I add to my Southwestern Texas Style chili?\n\nWhat version of Microsoft Office Should I use?\n\nPoint being:\n1. someone came to your site\n2. someone had a question they thought the 'community' could answer\n3. someone answered it\n\nInstead of:\n1. Someone came to your site\n2. Someone had a question they thought the 'community' could answer\n3. Site police came and seized your question and held your account in probation until the 'problem' was resolved\n\nI can understand the people came together intending to create a site to perform a certain function but the world of people came along and tried to shape it differently.  Do we punish the people or do we try to follow the trend and profit by it?"}, {"author_name": "txwikinger", "gravatar_hash": "4d2d9514d8c1d2fc1f3f5e16a0d5eb41", "author_url": "http://drupal.txwikinger.me.uk", "date": "Sep 09, 2010", "message": "The issue is that in fact there is not only one dimension to this issue. While a lot of the discussion is about how to divide subject matters. The arguments are also often centered on the experts rather than the users, or the target audience to be attracted in the future. However, there is another dimension that needs to be look at. That is to be user focused (i.e. focusing on a particular target audience). This does not make a fork fragmentation or tribalism, but in fact adds another facet that compliments what is already done. <a href=\"http://http://blog.txwikinger.me.uk/content/evolution-does-not-follow-path-guided-scientific-categories\" rel=\"nofollow\">Evolution does not follow a path guided by scientific categories</a>"}, {"author_name": "txwikinger", "gravatar_hash": "4d2d9514d8c1d2fc1f3f5e16a0d5eb41", "author_url": "http://drupal.txwikinger.me.uk", "date": "Sep 09, 2010", "message": "The correct link is <a href=\"http://drupal.txwikinger.me.uk/content/evolution-does-not-follow-path-guided-scientific-categories\" rel=\"nofollow\">Evolution does not follow a path guided by scientific categories</a>"}, {"author_name": "msw", "gravatar_hash": "e5807b15351df3a2c99802d0789d015f", "author_url": null, "date": "Sep 10, 2010", "message": "As Caleb Cushing notes (as others did) this was too soon. As Jeff Atwood wrote much about \"the community\" and the will of the \"community\" unfortunately, the respective communities have not yet been established and therefore cannot provide useful demographic inference.\n\nThe numbers that follow are approximate based on time of sample etc., but the patterns are not and I'll give them better treatment elsewhere.\n\nFor the \"unix and linux\" site, out of a population of 1600 users only 1000 were eligible to vote and of those only 12% did. Similarly, of the \"ubuntu\" site population of 2200, only 1400 were eligible to vote and only 13% did.\n\nThere is much hand-wringing regarding voter turnout in the US being quite low, but ~10% of registered voters in an off-(presidental)-season would be an embarrassment of meagres.\n\nBefore a community can have a voice, it must - by definition - be a community"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 10, 2010", "message": "@msw I don't think your figures are correct; the number of registered users <b>with the required 3+ upvotes on their posts</b> is not that high.\n\nI think you're using \"total registered users\" which is not the same thing."}, {"author_name": "Closure", "gravatar_hash": "2085b9877cfd0322d790206e7d7a956d", "author_url": null, "date": "Sep 11, 2010", "message": "I guess SA has become a place where people like to waste posts talking about how it should be somewhere else just like every other message board.\n\nHere is a small example and it will get worse\nhttp://stackoverflow.com/questions/3689721/how-is-java-inspired-by-lisp/3690499#3690499"}, {"author_name": "Peter", "gravatar_hash": "62e243a3f26aafa0eacb0371c4170a49", "author_url": null, "date": "Sep 18, 2010", "message": "Joel, \n\nNo offense, but you're not exactly knowledgeable about Unix, Linux, GNU, or any of that set of technologies. Love or separatism has nothing to do with it. You're turning a technical argument into a political one, and assigning animosity where little or none exists. \n\nJava, C++, and C# all evolved from C, but you wouldn't want to lump those together. \n\nWindows 7 and Windows Mobile came from the same core OS, and indeed, have much the same community. You still wouldn't want to lump those together. \n\nApple's OSX, and either OS7 or NeXTStep are, equally arguably, the same OS. If either MacOS 7 or NeXT were still around, you still wouldn't want to lump them together. The community overlap is also quite large. \n\nWhy? Because in most cases they are different enough that answers for one are not the right answer for the other (even if they work). There's a different right way to do things. \n\nThe same is true for Ubuntu and Unix. I'm a member of both communities. I use Ubuntu on my desktop, and different Unix variants on servers. There is zero animosity between the communities. \n\nThe problem is that Unix and Ubuntu are different technologies. They evolved from the same set of concepts, but that doesn't mean that the right way to do things in one would be the right way to do things in the other. The differences are often subtle -- most Unix things can be done under Ubuntu (but not all -- e.g. gvs will steal devices, so they will be inaccessible to the traditional Unix utilities, and the boot process is fairly different, and an increasing number of other things are starting to fork). When things are done, the right way to do them is often different (hitting \"eject\" on a disk, vs. sync and umount). It just doesn't make sense to lump them together."}, {"author_name": "Weidenrinde", "gravatar_hash": "6b5c782e62a1d81f40c5be5d2694d361", "author_url": null, "date": "Sep 22, 2010", "message": "As pointed out by others, having multiple points to search for one question is evil.\n\nThere are 3140 questions in SU tagged with \"ubuntu\", and 1201 in ubuntu.stackexchange. \n\nSo perhaps the best way would be: Merge ubuntu.stackexchange to SU."}, {"author_name": "Sergey", "gravatar_hash": "fbf950615302e00a14bceec914af32ca", "author_url": null, "date": "Oct 01, 2010", "message": "On the other hand, the majority of Ubuntu and Unix users, who voted, are for the joined site. 72+89 = 161. 114+34 = 148.\n\nThen, these numbers are not exactly big numbers. How confident you can be they express the real attitude of the community? How many ubuntu users are there, who didn't know about this voting? (I didn't know about it, for instance).\n\nDeciding to split two sites forever just because there were 40 votes more in favour of a separate Ubuntu site? (If they voted otherwise, the would be no majority against the merge on the Ubuntu site). They could easily have been just a few school kids with several accounts.\n\nThere are thousands of questions related to Unix in general and Ubuntu in particular on the SE sites now. So I assume there are thousands of users involved. Why only 40 of them are enough to decide on the split?\n\nIf I had chance to vote, I'd vote to bring all Ubuntu.SE and Unix.SE back to the Superuser.com. There are too many sites to monitor now."}, {"author_name": "fogging Hill", "gravatar_hash": "9f2821b823e477318b1bd6b07580745c", "author_url": null, "date": "Nov 01, 2010", "message": "Good point!\nThere's a technical side to \"issues\" about programming languages and operating systems and there's an emotional side. The technical side is about the physical constraints in the hardwiring of our nervous system, the emotional side is about the contraints in the hardwiring of our animal heritage; whether this is physical/chemical or just misshapen usage patterns or anything else, we don't know so far, since we don't know shit about the maths behind the genetical code (I guess the understanding of the maths that drive the genetical code is a requirement for the understanding of the maths that drive intelligence, in the same way, that the understandig of the multiplication table is a requirement for the understanding of category theory, but to be quite honest, I don't actu ally know, what I'm talking about).\nWhat we do know so far, is, that a ressource available is an avalilable ressource. I see a great chance to study human behaviour patterns here, with the almost unique property, that the combattants exercising their territory/status/whatever-patterns are by and large highly capable of abstract thinking.\nThis is a chance to complete LTU. Unfortunately I have none of the knowlegde required. If anyone has an idea how to bring this issue to the appropriate fora, I guesstimate it's a wise thing to do it."}]}