{"response": [{"author_name": "Oscar", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": "http://stackoverflow.com/users/20654/oscarryz", "date": "Sep 10, 2010", "message": "Nice. I remember the talk you had with Scott Hanselman, a couple of \"years\" now ( time goes fast, when you're having fun, the song says ) when you talked about this feature. \n\nFortunately HTM5 and browswers have matured enough since then for you to have this implementation. \n\n\nCongrats"}, {"author_name": "Terence Ponce", "gravatar_hash": "b4a6fc637ee2a0a306c37654d6395a8b", "author_url": "http://eeyorexd.imperiousdeceit.com", "date": "Sep 10, 2010", "message": "This is a pretty nifty feature. To be honest, it's pretty easy to login already but you just made it even easier than ever. Good job!"}, {"author_name": "fahadsadah", "gravatar_hash": "e5d82305b8c36003b65ea6d6b2de39a0", "author_url": "http://disconnectedneuronactivity.wordpress.com/", "date": "Sep 11, 2010", "message": "Why not have everyone authenticate only on stackauth.com, and use cookies set on that site?"}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": "http://blog.stackoverflow.com", "date": "Sep 11, 2010", "message": "@fahadsadah - we tried that with 3rd party cookies.  Long story short: it doesn't work.\n\nWe could use 1st party cookies, but then we'd have to redirect everyone (including anonymous users!) to StackAuth.  This is a terrible user experience (doubly so for new users at *.stackexchange.com, as they're thrown to this mysterious stackauth.com site) and would mean that global login outages are equivalent to network wide outages."}, {"author_name": "UVL", "gravatar_hash": "c68e8a655d3835793d1d3be770cb4c85", "author_url": "http://www.uvlist.net", "date": "Sep 11, 2010", "message": "I could be wrong, but the main difference between cookies and local storage is that the latter can't be used directly server-side, so some ajax has to be used, am I right?\nI should ask this on stack overflow anyway ... :)"}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Sep 11, 2010", "message": "Too invested in OpenID to resort to a standard single-sign on solution, like Shibboleth (http://shibboleth.internet2.edu/) or CAS (http://www.jasig.org/cas)?  Did you even look at using something like this.  Sounds like it would actually have been an easier implementation."}, {"author_name": "db", "gravatar_hash": "37a37eb85b18dfee38bcb46438c7b1b8", "author_url": null, "date": "Sep 11, 2010", "message": "Why not drop the whole \"one account per stackexchange site\" system? I register once, on *any* stackexchange site, and then that's my identity across *all* of them. I then opt-in to the sites I want to be a part off.\n\nIt doesn't solve the multiple domain auth problem, but it seems like it would simplify a lot of the account/identity management infrastructure.\n\nIt also feels like it would be much simpler from the perspective of people looking to join any of the stackexchange sites."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": "http://blog.stackoverflow.com", "date": "Sep 11, 2010", "message": "@UVL - localStorage can only be accessed client side, and has no expiration mechanism.  Its similar to cookies only in that they're both data storage mechanisms.\n\n@tvanfosson - dropping OpenId is a complete non-starter.  My (admittedly limited) experience with CAS (as a client side developer) has been almost entirely negative.  Shibboleth was not investigated.\n\nThere's little to gain from using third-party systems, as there is no plan to open global login to third-party sites.  Its purely for use within the StackExchange network.  The system is actually pretty simple and accordingly quite easy to debug and deploy.\n\n@db - There are 28 main StackExchange sites (with 3 more pending creation, right now).  Joining any single site cannot be reasonably construed as a desire to join all of those communities.  It'd also be really painful to migrate the existing sites to a new user model, for essentially no gain.\n\nAlso, just because *right now* we do not treat a \"new to this site, but active on another site\" user any differently does not mean we will not in the future."}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Sep 11, 2010", "message": "@Kevin - weird.  We've been using a local CAS implementation based on the JASIG protocols for years with no problems.  Pretty trivial (as a client) for me to develop against.  Check if locally authorized, if not check and cash any CAS ticket, if no ticket redirect to the central login site with my service url.  I'll grant you that logout is a little tricker if you want to logout everywhere at once (often we don't), but still doable."}, {"author_name": "Michael", "gravatar_hash": "e908e862cfbe4ca885a4b0cf48349cbb", "author_url": null, "date": "Sep 11, 2010", "message": "It seems you have missed a third way to handle this problem. If only you would have checked how it is done by wikimedia for their various projects...\n\nWhen you have a \"global\" (unified) account and login to wikipedia, the resulting page will just include images from the various other domains. The Image-URLs include some kind of Session ID. The webserver sees the Session ID, knows that you have successfully logged in and sends not only the image but domain bound cookies as well.\n\nSo simple and work even with older browsers."}, {"author_name": "Maxim Zaslavsky", "gravatar_hash": "319bd6ef9c9c8d876f731150cb4951c7", "author_url": null, "date": "Sep 11, 2010", "message": "Will the global auth implementation be open-sourced in the future? Please? :)"}, {"author_name": "Arjan", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "Sep 11, 2010", "message": "@Michael, the Wikimedia login requires one to accept third-party cookies. That doesn't work for me, but the Stack Overflow trick works just fine."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": "http://blog.stackoverflow.com", "date": "Sep 11, 2010", "message": "@Michael - 3rd party cookies again.  They just don't work reliably anymore, and we did try a variant that used images just to be sure.\n\n@Maxim - no.  This scheme makes hard assumptions about how its used.  The basic *idea* will be documented somewhere eventually I'm sure, but the implementation isn't really open-source-able."}, {"author_name": "Arjan", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "Sep 12, 2010", "message": "Kevin has explained a lot more on Meta: http://meta.stackoverflow.com/questions/64260/how-does-sos-new-auto-login-feature-work/64274#64274"}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Sep 12, 2010", "message": "Fantastic!  Logging in on 4 different browsers and then multiple sites got old quickly :)\n\nBig cheers to Kevin."}, {"author_name": "Michael", "gravatar_hash": "e908e862cfbe4ca885a4b0cf48349cbb", "author_url": null, "date": "Sep 12, 2010", "message": "Kevin: I disagree, but maybe i don't get your point. \n\nThe article explains 3rd party cookies as this: \"reading or writing cookies stored at a domain other than the one you’re currently on\".\n\nBut this is not happening in the wikimedia way. The webpage includes an image from another domain. That image comes with cookies for that other domain but from the browser standpoint everything is fine as it is not a 3rd party cookie but a cookie set from the other domain for the other domain. And for the reading part: No part of this solution requires reading cookies from another domain.\n\nYou claim that this will not work with some browser. Please name one. I have never heard of that, i see no reason why it should not work (because it is fully compliant to cross site access rules). But i see many reasons why your javascript solution will fail instead."}, {"author_name": "Michael", "gravatar_hash": "e908e862cfbe4ca885a4b0cf48349cbb", "author_url": null, "date": "Sep 12, 2010", "message": "Arjan: Untrue. The wikimedia way does NOT \"require one to accept third-party cookies\" as it actually does not use third-party cookies as defined here. No browser whatsoever known to me does complain about the wikimedia way, as none of the cookies ever is for another domain. Every cookie for every domain is created by a HTTP response for a request on that domain. No browser shall deny that as this is no cross site access whatsoever."}, {"author_name": "Austin King", "gravatar_hash": "4021c2acfc5b98b6dfe2d0ec26432ce1", "author_url": "http://ozten.com", "date": "Oct 04, 2010", "message": "CAS +1"}, {"author_name": "Neal McBurnett", "gravatar_hash": "f9a6dbf7c76bfc2ddb25b951af35ea38", "author_url": "http://neal.mcburnett.org/", "date": "Nov 26, 2010", "message": "@michael, you seem to misunderstand what a third-party cookie is, perhaps because of subtleties with sub-domains vs completely separate domains.\n\nCookies set due to images from domains other than the URL in the browser address bar (the place the user thought they were going) are by definition third-party cookies.  See http://en.wikipedia.org/wiki/HTTP_cookie\n\nSome users, due to abuse by ad companies etc, do whatever their browser allows them to do to prevent sending cookies anywhere other than to the site in the address bar."}, {"author_name": "Deozaan", "gravatar_hash": "027cf2dd93a08eb41025ed6ef3c501e9", "author_url": null, "date": "Mar 09, 2011", "message": "It's not working. I logged into my existing StackOverflow.com account with my OpenID and then into StackExchange with the same OpenID and it created a brand new account. Now every new StackExchange site I log into uses my new account instead of my old one."}, {"author_name": "Deozaan", "gravatar_hash": "027cf2dd93a08eb41025ed6ef3c501e9", "author_url": null, "date": "Mar 09, 2011", "message": "I may have misunderstood how it works. I assumed it wasn't working because my reputation and badges and date of creating an account were different from my original account.\n\nBut apparently I have to start all that over for each sub site of Stack Exchange?"}, {"author_name": "Jacky", "gravatar_hash": "f708d031b8a203f9386bebb25062aab1", "author_url": null, "date": "Sep 21, 2012", "message": "How to log out if I am not logged in through multiple computers? \nI can not see \"Log Out Everywhere\", I can see \"Log Out\" button only,\nIt automatically logs in without ask me name and password after logged out."}, {"author_name": "Josh", "gravatar_hash": "92f446269f65ef4213e94bd99aa3e475", "author_url": null, "date": "Nov 06, 2012", "message": "I'm using Chrome. After I enabled both Third Party cookies (which I suspected as a problem from an icon in the addressbar) and JavaScript for stackauth.com (the JavaScript wasn't even hinted as being a problem on the <a href=\"http://meta.stackoverflow.com/network-login-help\" rel=\"nofollow\">trouble shooting page</a>) it seems to work."}]}