{"response": [{"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Sep 29, 2010", "message": "Great stuff. Figuring out any sort of guidelines for this issue must be an incredibly hard task; these guidelines actually look helpful, and are understandable."}, {"author_name": "Benjol", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Sep 29, 2010", "message": "This is a very timely post. \n\nIn recent debates on meta, it has seemed to me that people were confusing \"we don't like subjective on SO\" with \"subjective can't work on SE\".\n\n<a href=\"http://meta.stackexchange.com/questions/5843/what-kind-of-sites-would-stackexchange-not-work-for\" rel=\"nofollow\">This question</a> (and your answers), touched on this subject too."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": null, "date": "Sep 29, 2010", "message": "This is an great post. You have nailed this \"hard to explain\" subjective thing in six insightful points; an useful guideline for the community that has to ask, answer and vote with discipline."}, {"author_name": "Oliver Giesen", "gravatar_hash": "13c44ef2d9d79dcca761a584be868def", "author_url": "http://ogware.wordpress.com", "date": "Sep 29, 2010", "message": "OK, but have you already figured out how to fit the concept of \"accepted answers\" with the new-found acceptance of subjective questions?\n\nI always found one of the defining properties of subjective questions to be that there is no *one* correct or even best answer. This is quite at odds with the fact that the system urges you to accept answers and even punishes not doing so with displaying a low accept rate next to your name.\n\nOne benefit of a \"subjective\" or \"open-ended\" flag (not tag!) on questions that would envision is that these would not require (or even allow) to accept an answer."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Sep 29, 2010", "message": "Excellent post. Better late than never."}, {"author_name": "tvanfosson", "gravatar_hash": "00aa1356e6f90fca08b36fb3c8d230c5", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Sep 29, 2010", "message": "Ok, I agree.  Now, why do we need programmers.se?  It seems to me that the kinds of questions you describe could easily find a home on SO (with a little cultural retraining of people who can vote to close).  If the others are basically throw-aways, then what is left for programmers.se?  Or, more to the point,  why should good subjective questions be directed to programmers.se, forcing me to use two sites instead of one for my programming/software development information?"}, {"author_name": "Lance Roberts", "gravatar_hash": "576cdd58ab7df19c6715121c7806bbf6", "author_url": null, "date": "Sep 29, 2010", "message": "This was a great post, that gives exactly the specifics we've been needing.  Thanks."}, {"author_name": "Robert Cartaino", "gravatar_hash": "9dfd656461a1d0a2db33f3ed4183f4c0", "author_url": "http://stackoverflow.com/users/98786/robert-cartaino", "date": "Sep 29, 2010", "message": "> @Oliver Giesen: OK, but have you already figured out how to fit the concept of “accepted answers” with the new-found acceptance of subjective questions?\n\nIf you're asking a proper question, the \"accepted answer\" functionality takes care of itself.\n\nIf you \"...just want to poll a community for ideas that might help solve a problem (best book, best approach)\", you should accept the answer that best helped solve *your* problem. Accepted answer DOES NOT mean it is the only correct (or even the right) answer. It's the one that best helped solve your problem.\n\nBut, if your question is intended to gather a list of equally relevant answers, and you don't expect one answer to be the most applicable, it should be a community wiki anyway. Community wiki on a \"list of X\" question suggests that the value of the question is in having the *list* of answers as a collection (i.e. a collaboration). \n\nThat's why the \"accept rate\" calculation does not include community wiki questions."}, {"author_name": "Andrew Vit", "gravatar_hash": "f0987c97234fa9c6b26f796bdbdab037", "author_url": "http://avit.ca/", "date": "Sep 29, 2010", "message": "Great guidelines, just not sure how they correspond with reality: have you tried searching <a href=\"http://stackoverflow.com/search?q=favorite\" rel=\"nofollow\">\"favorite\"</a> on StackOverflow?"}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": "http://itcookbook.net", "date": "Sep 29, 2010", "message": "I am actually, no kidding, more than a little bit in awe of this essay, Mr. Cartaino. Exceptionally well done, and very applicable to a community problem (outside of SO/SE) I and some colleagues are facing. \n\nThanks; you've really helped define some hard-to-corral concepts for me!"}, {"author_name": "Robert Cartaino", "gravatar_hash": "9dfd656461a1d0a2db33f3ed4183f4c0", "author_url": "http://stackoverflow.com/users/98786/robert-cartaino", "date": "Sep 29, 2010", "message": "@quux: Thanks for the kind words. This was a long collaborative effort between Jeff and myself. He should definitely receive a large portion of your kudos."}, {"author_name": "Neil Fein", "gravatar_hash": "a3988c74befe682a08e8461f005106df", "author_url": "http://www.neilfein.com", "date": "Sep 29, 2010", "message": "Great post, and quite timely. We've been running into this a bit at the <a href=\"http://bicycles.stackexchange.com/\" rel=\"nofollow\">bicycles</a> beta, and I'm glad to see most of what the site has posted already follows these guidelines, I think."}, {"author_name": "Mike Schinkel", "gravatar_hash": "81df87e0d3e269d6fa6a17c6914fd656", "author_url": "http://mikeschinkel.com", "date": "Sep 29, 2010", "message": "@Robert Cartaino  - I really think you guys should remove the ability to accept an answer on the community wikis. By definition there isn't really a good \"best\" answer so having the checkmark there is a huge distractions. It's a lot like not having a \"null\" value in PHP; if you didn't have null how could you tell the difference between \"false\" and \"not assigned?\"  Same here."}, {"author_name": "Mike Schinkel", "gravatar_hash": "81df87e0d3e269d6fa6a17c6914fd656", "author_url": "http://mikeschinkel.com", "date": "Sep 29, 2010", "message": "@Robert Cartaino: I just read the linked Scoble blog about the chat room/forum problem and think it exactly describes why I want to see more smaller StackExchange sites vs. a few larger ones (or merge everything into one StackExchange and change your site architecture so it can *feel* this it's lots of smaller sites.)  JMTCW."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 30, 2010", "message": "@Mike when it comes to Q&A, every community is \"small\" in the sense that there are a teeny-tiny fraction of the overall people in the world who ...\n\n1. have the right technical background to understand your question\n2. have the time and inclination to help\n3. are able to provide a reasonably correct, understandable answer that meets your specific needs\n\nThe only time this doesn't apply is those mega-bad subjective questions such as \"what's your favorite color as a programmer\"... where the only \"expertise\" you require is being an expert in one's own opinion.\n\nTherefore, at least for the detailed types of expert Q&A we want to have, limiting the audience hurts. A lot.\n\nOddly enough, strictly limiting the audience on an EXTREMELY subjective Q&A site would actually be a good idea and maybe even your only option to reduce noise. But I'd say if your topic is that subjective and poorly moderated, you have far deeper problems to contend with. At that point, limiting the audience is just treating the symptoms rather than the underlying disease."}, {"author_name": "Lorenzo", "gravatar_hash": "83caed31765b229b5d7dfae623478b5f", "author_url": null, "date": "Sep 30, 2010", "message": "OK, now it's clear that \"trust the community\" and \"we don't rule SE, the community does\" was just mouth rhetoric.\n\nIf there's still some democracy on SE, we will be able to build our new place: http://area51.stackexchange.com/proposals/21841/bad-subjective-programmers?referrer=x1q3QTNL346OcSFp2uqP3w2"}, {"author_name": "Stefano Borini", "gravatar_hash": "f5fbb1b29965fe8ce3ff0b6b8461d61e", "author_url": "http://ForTheScience.org", "date": "Oct 30, 2010", "message": "It's totally unclear to me how this should work with respect to SO. Should SO host only \"factual\", objective questions? according to the SO FAQ, no. Then why should a \"Programmer SE\" exist at all? Who is in charge to decide where a question should go? Who can know (and therefore decide where to post it) if a question on software design is subjective or objective, if he does not know the answer it admits? \n\nAs I see it, this Programmers SE and the whole point of closing subjective, but highly insightful questions is a chaos unfolding. There's no way back. Questions will start flying from SO to PSE to SO again, get closed and reopened, people won't know where to post, and all because these rules are difficult and subjective in themselves to apply properly, in particular when the decision is taken by an army of people called to make a complex evaluation. \n\nComplex rules don't scale on communities."}, {"author_name": "Michael", "gravatar_hash": "35e2075811bfe23252bf2483b04f39aa", "author_url": null, "date": "Nov 22, 2010", "message": "I've tried to be as specific as possible, even to review the FAQ before posting, but people still close my questions before I can get a good answer.  It's all in the power of the reputation points, people like downvoting more than upvoting."}, {"author_name": "Tergiver", "gravatar_hash": "1dfca13b83e14639a53baba8836a026b", "author_url": null, "date": "Dec 14, 2010", "message": "Love the \"Fields arranged by purity\" diagram."}, {"author_name": "ranad nader", "gravatar_hash": "83ead5dc213ead9cdedba298e55b3994", "author_url": null, "date": "Apr 07, 2011", "message": "I need make :\n1. generate loop Random numbers .\n2. save Random number in text file .\n3. open text file and read number from text file to array .\n4. sorting Read number using: - Quick sort\n                              - Merge sort\n                              - insertion sort\n                              - save sorted array to text file\n                              - calculate number of copy and number of comparison"}, {"author_name": "ranad nader", "gravatar_hash": "83ead5dc213ead9cdedba298e55b3994", "author_url": null, "date": "Apr 07, 2011", "message": "please  help me&gt;&gt;&gt;\nI need make :\n1. generate loop Random numbers .\n2. save Random number in text file .\n3. open text file and read number from text file to array .\n4. sorting Read number using: – Quick sort\n– Merge sort\n– insertion sort\n– save sorted array to text file\n– calculate number of copy and number of comparison\n\n\nPlease answer as soon as I want .... I have been unable to find the answer to this question ....."}, {"author_name": "Mallow", "gravatar_hash": "d641d0cfc5cf4f2c66772591f844901c", "author_url": null, "date": "Apr 18, 2011", "message": "I absolutely hate how when posting in some forums, they will sometimes move the topic to another place within the forum. Preventing some topics from being posted in a stackexchange \\feels\\ like you are doing this. But the way I've seen it done here somehow \\works\\. +100 to you stackoverflow!\n\n\\Feels and Works\\ are strictly subjective to mallow"}, {"author_name": "Ivo Flipse", "gravatar_hash": "f7ae8c8fb83e502a854e2db3410f3827", "author_url": null, "date": "Mar 31, 2012", "message": "FYI @Robert, the link to the Back it up principle on moms4moms.com is a dead"}, {"author_name": "Emerald214", "gravatar_hash": "c87a238b57362307f788a9cb509b8891", "author_url": null, "date": "Apr 14, 2012", "message": "+1 for \"There is always more than one right way\". ;)"}, {"author_name": "Saeed Amiri", "gravatar_hash": "163e42d8836f08a09de868a83dae9d21", "author_url": null, "date": "May 27, 2012", "message": "@Robert Cartaino, \"But, if your question is intended to gather a list of equally relevant answers, and you don’t expect one answer to be the most applicable, it should be a community wiki anyway. Community wiki on a “list of X” question suggests that the value of the question is in having the *list* of answers as a collection (i.e. a collaboration). \"\n\nBut now community wiki is dead, what should be an accepted answer for such a subjective questions? I think you should activate community wiki on sites with possible subjective questions."}, {"author_name": "Nick McDermaid", "gravatar_hash": "6a96bfe0e61af099de8a27aa82c50fe5", "author_url": null, "date": "Nov 06, 2012", "message": "Thankyou for your your efforts to make the Internet smarter, not stupider. I will be supporting and assisting when I can."}]}