{"response": [{"author_name": "C. Ross", "gravatar_hash": "ec4b051825229c870b5b4c0c9a371558", "author_url": "http://stackoverflow.com/users/16487/c-ross", "date": "Sep 17, 2010", "message": "Wow, taco is getting big!"}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Sep 17, 2010", "message": "Nice picture of your dog, Taco!\n\nI see that my compiler proposal got listed in the 'StackOverflow duplicates'. Well, this may be so, I disagree that the users would be well-served on StackOverflow. This is somewhat of a niche topic, and as such would likely garner much better answers and questions on its own. How many compiler design questions are there on SO?\n\nhttp://stackoverflow.com/questions/tagged/compiler-design"}, {"author_name": "Josh", "gravatar_hash": "97ca2e94ba373515aa387feee67d613e", "author_url": "http://josh.gitlin.name", "date": "Sep 17, 2010", "message": "Who went to Newton North? I grew up in Newton, and worked for the school system, pulling cable at NNHS! :-)"}, {"author_name": "Justin Nelson", "gravatar_hash": "d787caaf04b85641692a24099fcee990", "author_url": null, "date": "Sep 17, 2010", "message": "@George, there are 14 questions in that tag.  So, if a Compile Design site would have been created at the same time as Stack Overflow it would have gotten 14 questions?  That doesn't seem sustainable.\n\n(I understand that it would have probably been a few more than 14, but you should still get my point.)"}, {"author_name": "Rob Sobers", "gravatar_hash": "702de2312c0d67472ed3036b53ce881a", "author_url": null, "date": "Sep 17, 2010", "message": "Great post Joel.  I've been wondering whether or not I was in the minority thinking things were getting ridiculously fragmented.\n\nI asked a question on the DIY Stack Exchange about re-seeding my lawn and, rather than get expert answers, an intense debate erupted about whether my question should be moved to another site specifically about gardening.  This could be really discouraging to newcomers.\n\nMaybe another rule is that I shouldn't have to think very hard about whether my question belongs on site X or site Y.  It should be friction free. And, come to think of it,\nI don't recall any psychology majors showing up to my computer science classes."}, {"author_name": "Edan Maor", "gravatar_hash": "10aae09a71c08efc29b09b7a9cf8706d", "author_url": "http://www.loopycode.com", "date": "Sep 17, 2010", "message": "Nice dog. Great name, too.\n\nI really hope you're not reading too much into the failure of one site. It's hard to draw many conclusions from one failure, and yet it seems that's what the SO team is doing.\n\nP.S. The oddest thing about your post was that you linked to the Encyclopedia Britannica and not Wikipedia. Seriously surprised me!"}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Sep 17, 2010", "message": "Judging by the size of those individual content management systems' docs and help forums, I would say yes, there needs to be separate sites for them.  I think, however, until stack-exchange replaces phpbb, that avoiding such niche topics is the correct decision."}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Sep 17, 2010", "message": "@jjnguy: No, there are 162 people committed to the Compiler Design proposal. Each commitment means 10 questions / answers, so that's 1620 posts right there. A far cry from 14."}, {"author_name": "adamjford", "gravatar_hash": "83d5fb4c3fe568ae6952e134ade54aef", "author_url": null, "date": "Sep 17, 2010", "message": "Getting big? From the looks of it, Taco is already big!"}, {"author_name": "bit", "gravatar_hash": "bf98593dad36ad5bea45420ccc121e46", "author_url": null, "date": "Sep 17, 2010", "message": "Love the Taco pictures... I can't believe how fast he went from puppy to grown dog."}, {"author_name": "badp", "gravatar_hash": "c81f585328c241594864f888f1154025", "author_url": null, "date": "Sep 17, 2010", "message": "I think the biggest problem here is reputation on Area51. Everybody makes their suggestion so that they can gain points, because bringing a submission from creation to public is the only way to get big points!"}, {"author_name": "Tzenes", "gravatar_hash": "947c457cb4e5480cb8b2f09e49794834", "author_url": null, "date": "Sep 17, 2010", "message": "I think the reason gaming.se works is because it covers so many games. You'll notice zergoverflow (a site just about starcraft) has fewer starcraft questions than gaming.se. There is definitely something to be said for leveraging a larger community"}, {"author_name": "bit", "gravatar_hash": "bf98593dad36ad5bea45420ccc121e46", "author_url": null, "date": "Sep 17, 2010", "message": "One idea that may help the \"am I posting my question to the right site\" is to programatically parse the question and give the user a list of possible sites to post to. It would also help to educate users about other sites. This option could just be a button so that it was optional and wouldn't change the flow for experienced users. \n\nThis feature could also be used to create a generic place to go to type in a question and have it give us back a list of possible sites to post it on."}, {"author_name": "Stefano Borini", "gravatar_hash": "f5fbb1b29965fe8ce3ff0b6b8461d61e", "author_url": "http://forthescience.org", "date": "Sep 17, 2010", "message": "I wrote similar concerns some time ago. Maybe it can be useful to visualize similar situations:\n\nhttp://forthescience.org/blog/2010/07/22/stackexchange-sites-proliferation/"}, {"author_name": "Laurent Gauthier", "gravatar_hash": "ce048be9728fbb8dc496f58b92f9f91b", "author_url": null, "date": "Sep 17, 2010", "message": "This really reminds me of the old Usenet days. There was lots of Wisdom in the process that had been put together...\n\nhttp://faqs.cs.uu.nl/na-dir/usenet/creating-newsgroups/part1.html"}, {"author_name": "Geoff", "gravatar_hash": "f99d6586474ee10a1a0c3d31a08fe493", "author_url": null, "date": "Sep 17, 2010", "message": "Why not have the big mega sites, but then give users a way to make their own custom mini-sites based on tags.   So, there could be a Musical Practice and Performance site, with Guitars as a tag.  Guitar enthusiasts who care only for that could make a \"sub\" community site based on a set of tags."}, {"author_name": "Bohdan Trotsenko", "gravatar_hash": "b1d8aeaae60b8237f7cd672186c99b2c", "author_url": "http://bteffective.com/labeler", "date": "Sep 17, 2010", "message": "Oh, up to the moment, there are so many stackexchange sites I'm interested in. Now I need to go through all of them.\n\nMake as many as you want, but please consider creating a site-aggregator which will bring stackoverflow, serverfault, superuser and android under one roof to give me a comfortable reading.\n\nOne day you may discover that the list of stackexchange sites grew too large and got cluttered. So, somebody (who?) should create categories.\n\nEach SE site has unique eye-appealing design for the group. Nice idea. People within the group would love it.\n\nApart from them, I think there many people like me who would happily exchange nice designs for the option to check-box the niches they are interested in and follow all them in one place.\n\nBR/Bohdan."}, {"author_name": "David O'Leary", "gravatar_hash": "02136142a9fb53b5a433e5d2f96c43b6", "author_url": "http://www.efficionconsulting.com", "date": "Sep 17, 2010", "message": "I'd be happy to have all DotNetNuke questions on StackOverflow. But, a lot of valid DotNetNuke questions aren't programming related and people complain when they get asked on SO. So, how do you create a single site that handles all DotNetNuke (or any other CMS) without fragmenting the various types of questions. I have no answer for this."}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Sep 17, 2010", "message": "I think a lot of this would have solved by simply limiting the rate at which new sites can be proposed.  If you only had say 50 possible sites at a time queueing up, people whose idea fit into an existing site would be more likely to join and add their ideas to that site, enlarging it's scope during the discussion phase.  If you have unlimited proposals, there's no incentive to coalesce within an existing site -- you just propose your own (and thus you get the People's Liberation Front of Judea and the Judean People's Front and the Popular Front of Judea).\n\nFor my money, all 25 or so proposals you listed are adequately covered by StackOverflow and are completely unnecessary."}, {"author_name": "Brian Armstrong", "gravatar_hash": "d9bd61e9a9ed9c9f3b995c07f7113ae5", "author_url": "http://www.startbreakingfree.com", "date": "Sep 17, 2010", "message": "Creating rules seems unlikely to work here.\n\nSurprised you guys didn't go for more of a \\wisdom of the crowds\\ approach to let it evolve naturally."}, {"author_name": "Ben McCormack", "gravatar_hash": "05dd4a81f00b069aafa141ccaa4e188d", "author_url": "http://benmccormack.com", "date": "Sep 17, 2010", "message": "I'm glad to hear about the merging of proposals.  I like being able to ask a question to a gigantic group of programming experts about the pros and cons of using the protected modifier in OOP design without having to worry about whether it will be closed because 5 people think it will be better served by a small community dedicated solely to discussing \"software engineering.\"\n\nThis also helps when a single topic crosses multiple boundaries.  If you have multiple sites, you have to pick one.  If you have one big site, you just choose multiple tags."}, {"author_name": "Aarobot", "gravatar_hash": "687f8a43b58fe35c8b2933f1f16b13cb", "author_url": null, "date": "Sep 17, 2010", "message": "Oy.  Yes, let's lump Software Engineering and Software QA and Software Law into the Programmers SE, because those things are really just programmer water-cooler topics.  Way to dismiss an entire industry, guys.\n\nSeriously, I can understand Jeff taking that angle, but I expected better from an ex-Softie.\n\nAside from that, I actually think you're wrong about the rest, too.  The gadgets site may have failed partly because it was too broad, but the more pertinent issue (which is clearly manifesting again on the individualized gadget sites like Android) was a non-stop flow of inane questions and very few real experts around to answer the truly difficult questions.\n\nOn the other hand, Stack Overflow has more than enough good questions and more than enough members qualified to answer them, yet the unanswered question static is dismal and getting worse.  That's because with 230,000 users on the site, everything happens too fast; if your question doesn't get attention right away (possibly because everybody decided to attack that \"What is the most poorly named application out there?\" question for easy rep/badges), it's completely buried after half an hour.  Yes, the oldest question on the front page is from 30 minutes ago!\n\nTime will tell, I suppose, and maybe I'm just bloviating and dead wrong myself, but I think one day you guys will realize that you have to split up Stack Overflow, or at least make some major UI changes to help members focus on their primary areas, and on that day, I will be laughing hysterically."}, {"author_name": "RegDwight", "gravatar_hash": "9e6196f558d30d39ba5c5f1d55865dd3", "author_url": "http://english.stackexchange.com/", "date": "Sep 17, 2010", "message": "This comment is blatantly off-topic, but I love this blog. Keep up the good work."}, {"author_name": "Jin", "gravatar_hash": "70ad2c2830eb9a7753bd6312f3811e3e", "author_url": "http://www.8164.org", "date": "Sep 17, 2010", "message": "@Bohdan Trotsenko, we have that functionality in place already. Go to http://stackexchange.com and log in, then you will be able to stream only questions from your favorite sites from there."}, {"author_name": "Mark Trapp", "gravatar_hash": "ef8d7a735c5ec71cb59105872900187b", "author_url": "http://marktrapp.com", "date": "Sep 17, 2010", "message": "Even suggesting Programmers.SE could even advertise itself as something other than the place for banal and completely off-topic Stack Overflow questions was met with universal resistance: http://meta.programmers.stackexchange.com/questions/213/how-can-we-avoid-programmers-se-from-becoming-the-se-black-sheep \n\nThat said, I've created a topic on http://meta.programmers.stackexchange.com to vote on and discuss  topics that the Programmers.SE community would like to see merged into it: http://meta.programmers.stackexchange.com/questions/237/what-questions-are-on-topic-and-what-are-off-topic/251#251"}, {"author_name": "Duncan", "gravatar_hash": "8325a6dc4903ef0b27c5fe487bb639e3", "author_url": null, "date": "Sep 17, 2010", "message": "Agreed; actually I'd be for even more aggressive merging. Dedicated Q&amp;A site for Tex/Latex, or GIS, or Role playing games ? Seriously ?"}, {"author_name": "Alex", "gravatar_hash": "11b23fa549ba889fe7ca2826eecf5ef7", "author_url": null, "date": "Sep 17, 2010", "message": "Here's some 1:00 in the morning silly thoughts...\n\nWhy are you bothering with multiple sites? I don't know your setup, but I'll bet this all runs in some common architecture/framework.\n\nBuild one site.\n\nDevelop an extensible, hierarchical taxonomy of \"topics\".\n\nSample:\n\n+ Technology\n++ Programming\n+++ Embedded Systems\n+++ Graphics\n++ Hardware\n+++ CPU\n+++ Handhelds\n+ Music\n++ Performing\n++ Genre\n+++ Jazz\n+++ Classical\netc.\n\nURL's like www.so.com/a=music or www.so.com/a=music&amp;b=genre&amp;c=jazz would be but filters on the content.\n\nMaybe a voting system to control the addition of new sub-taxonomies.\n\nLet the questions and community divide up the world for you. With proper metrics you'll be able to tell what's really important to the user base. If a path has 3 messages, who cares? If a path has 10,000 there may be need to pay attention to splitting it up...\n\nYou could setup \"admins\" for larger braches on the tree. Given enough volume of activity you could grant them a custom logo for that particular section, or other \"features\". Admins would still have the \"We administer the entire world of music on stack overflow\" bragging rights, but you could greatly reduce your administrative overhead.\n\nIt might take some \"interface magic\" to make things easy for the newbie user, but then it becomes a programming problem, not an sum-of-all-human-knowledge architectural problem.\n\nOk, it IS late, because I think I just merged stack overflow and the old usenet news group world.\n\nHappy hacking!"}, {"author_name": "SKapsal", "gravatar_hash": "2c67c702e6e2db5258c3f089a6235ca9", "author_url": null, "date": "Sep 17, 2010", "message": "I recently faced a similar problem/question when we started using a wiki for knowledge capture instead of those dreaded txt files in folders on a network share.  One of the major problems with the folder structure and files was that there often not a single folder that was the only fit for a topic.  A document could be categorized multiple ways.  This caused effort and time to be wasted trying to decide how to categorize information.  It also made finding a document difficult because it could be in more than one folder.\n\nWhen we started using the wiki, life was great.  We would tag a document in multiple categories and people thinking about related category A could find the document and people searching from the point of view of category B could find it.  If an appropriate category did not exist ... created on the fly.  Good stuff.  No more agonizing over which category a doc goes in, just mark it in all the relevant categories and life is good.\n\nTo me you already have a mechanism to segment content.  The tag.  Maybe start with a broad topic like music and let the subdividing happen organically with the tags.  The problem may be that there is no way to make a \"subdomain\" of the broad topic.  Start with music.stackexchange.com. If the guitars tag grows to X number of questions (and answers) it gets it's own URL, but is still included in music for those who care about all of music.\n\nThis lets the dividing happen organically and solves the problem of having to stop and think about how to organize content up front and also lets people find stuff at the level of detail they are interested in."}, {"author_name": "SKapsal", "gravatar_hash": "2c67c702e6e2db5258c3f089a6235ca9", "author_url": null, "date": "Sep 17, 2010", "message": "Also, +1 for voting a question onto a specific site (If sites will be divided)"}, {"author_name": "Eric Weilnau", "gravatar_hash": "45c914d730cef4110c3d790f03c31cfc", "author_url": null, "date": "Sep 17, 2010", "message": "Much of what Joel says in this post seems reasonable to me. However, I think that is because much of it has no relevance for me. I am completely opposed to the one proposed merge, Healthcare IT into the Programmers Stack Exchange, that does directly impact me. I have no reason to believe that the users who gained rep from answering http://programmers.stackexchange.com/questions/3886/do-you-prefer-to-code-in-the-dark-or-in-the-light or http://programmers.stackexchange.com/questions/4433/who-is-the-most-interesting-programmer-in-the-world are qualified (let alone experts) to answer questions about processing EDI X12 835 documents or maintain HIPAA compliance in a multi tenant database for a SAAS application. It will also be difficult to attract experts to answer these questions in a Q&amp;A site title Programmers which is dominated by questions like those cited earlier.\n\nIn thinking about these issue a number of technical problems with merging a proposal into an existing Stack Exchange already in beta also occur to me. How will the new users correctly tag Healthcare IT questions since none of them will have the necessary rep to create the new tags."}, {"author_name": "Alex", "gravatar_hash": "11b23fa549ba889fe7ca2826eecf5ef7", "author_url": null, "date": "Sep 17, 2010", "message": "SKapsal - Looks like we had a kind-of similar idea. I like the +1 thing. Perhaps questions could be kicked up or down the tree/taxonomy. Less need to nag about off-topic - just bump it up (or down).\n\nI think the categories would need some level of management, however."}, {"author_name": "Perosh", "gravatar_hash": "492ec1e08b796e4b584ff0e742e19e34", "author_url": null, "date": "Sep 17, 2010", "message": "+1 for Eric's proposal to not merge Programmers with Healthcare IT.\nWith quite complex domain as Healthcare IT is, there should be no problems with filling it with relevant content that is usually lost in SO and SF sites.\nI would rather leave Programmers site as silly question honeypot."}, {"author_name": "Nicojo", "gravatar_hash": "d787799fb7e8708e2fba1050b6ef68b5", "author_url": null, "date": "Sep 18, 2010", "message": "Good point to merge things... Just wondering, in my field(s) how that would work...\n\nPut Biology AND Bioinformatics AND Ecology in the same site, and you'll end up with a Bioinformatics site, simply because they're the most active users of such sites.\n\nBut it would still be great to have a Biology and an Ecology site, but there are too few people in these groups to actually create such sites.\n\nWould it be possible to have ONE site for all three, with something more substantial than a simple tag to actually sort them out? (Would it even be useful? I don't know, it's just an idea...)\n\nCheers!"}, {"author_name": "skolima", "gravatar_hash": "b6f2f9275a3eb6c38433419311d723a2", "author_url": null, "date": "Sep 18, 2010", "message": "I'd like to vote for merging http://www.sharepointoverflow.com/ into the main http://stackoverflow.com/ , which has more SharePoint questions and answers anyway."}, {"author_name": "Rick", "gravatar_hash": "cd92c3bd6852f23b5f8dfaf3ec9d6ab5", "author_url": null, "date": "Sep 18, 2010", "message": "I've had some really good interactions with StackOverflow.  In particular if I'm doing some iPhone development and I get some obscure compiler message, I'll search for it on Google (read as: whatever the default happens to be in my web browser ... I'm no Fandroid) and if I see a StackOverflow answer I'll head for that one first.\n\nSo mad props to y'all for that.  :D\n\nHowever, the thing that bugs me most about the relatively new Gaming StackExchange is the net nannies.  These are people who seem to want to emulate the wikipedians with their \"citation needed\" fixation.  They seem to spend more time telling people why their questions are wrong/stupid/\"too similar to some other question\" than they do answering questions.  I wish someone would point out to them that they are violating Wheaton's law.  For bonus points, let them know they're breaking Wheaton's Law without the person telling them that _also_ breaking Wheaton's Law by telling them that..."}, {"author_name": "Dylan Beattie", "gravatar_hash": "93ec7cff90c748bc4f4da0c540e68bfc", "author_url": "http://www.dylanbeattie.net", "date": "Sep 18, 2010", "message": "I think your example actually misses the sweet spot:\n\n- Outdoors enthusiasts (most broad)\n- Snowboarders, Skiers, and Mountain Bikers\n- (missing) Winter Sports\n- Snowboarders\n\nSnowboarders, skiers (of all disciplines) and other winters sports enthusiasts have useful knowledge to share with each other - good &amp; bad resorts, where to find accurate snow reports, how to take good holiday photographs in snow, how to cope with eating too much tartiflette, and so on...\n\nIt makes no sense to me to include mountain bikers with winter sports enthusiasts - there just isn't sufficient overlap - but I think it also makes no sense to separate skiers and snowboarders.\n\nMaybe the hypothetical scenario should be - if X enthusiast and Y enthusiast ended up talking (say, at a wedding), would they end up talking about their hobbies? I reckon a skier &amp; a snowboarder would end up swapping snow stories - but a skier &amp; a mountain biker probably wouldn't, whereas a mountain biker and a BMX rider would probably end up talking about bikes."}, {"author_name": "toivo", "gravatar_hash": "8153ef257a93cc5955e73fe92ec3a607", "author_url": null, "date": "Sep 18, 2010", "message": "you could only build communities by people. i.e. at the moment the site is divided by subject areas (guitars, java programmaning and cycling). Question - answers. It should be the other way. By people. Let's suppose Joe Hartwag  answers question  regarding guitars, java programmaning and cycling. Person - questions answered. \nBuild community of teachers, experts and consultants. \n\nWell, there could be a guy who is expert in 100 topics, but I highly doubt it."}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": "http://itcookbook.net", "date": "Sep 18, 2010", "message": "I liked tvanfosson's comment about limiting the number of proposals at any one time. Having some \"backpressure\" pushing to merge nascent smaller communities into larger ones has a nice ring of practicality to it.\n\nBut there probably also needs to be some pressure that works the other way too - when a community has waxed ginormous, give it a way to split into smaller communities. The split could occur along whatever fracture lines seem natural after reaching certain thresholds. I would guess the threshold is more about question velocity (time-to-answer, averaged across all questions) than about user count?\n\nThe StackExchange tagging system will likely provide the most obvious fracture lines, but I know this is only a hazy idea at best - finding algorithmic ways to do this is a task best left to you wizards behind the curtains.\n\n(I'd put at least some effort into thinking about ways that aren't *entirely* vote-based. Votes get weird.)\n\nCommunities are variable. They're not just about numbers. The right 50 guys could produce an awesome corpus of useful knowledge; the wrong 50,000 guys could meander forever and produce ... 4chan. Seems like StackExchange should be trying to find a way to fit both small and large communities?\n\nAnyway. Just some thoughts tossed into the pot for consideration!\n\n(And when are you guys gonna scrape up a few more podcasts?)"}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": "http://itcookbook.net", "date": "Sep 18, 2010", "message": "Then again, you could just chuck it and go with the <a href=\"http://library.thinkquest.org/5002/\" rel=\"nofollow\">Dewey Decimal System</a>!"}, {"author_name": "Ray", "gravatar_hash": "99bfe7f09d0087eefcd00cfb5f3b72ad", "author_url": null, "date": "Sep 18, 2010", "message": "I still think you should have a Guitar site, for it might be the most popular instrument out there.  There is a reason Guitar Center is called Guitar Center, even though it sells violin and piano etc too.  Alternatively, call Musical Performance and Practice (a long name) just Musicians or something shorter. Just my 2 cents."}, {"author_name": "Richard", "gravatar_hash": "1b1d983e092b649de25c520a40d325fc", "author_url": "http://quirkygba.blogspot.com", "date": "Sep 18, 2010", "message": "I wonder why Ubuntu was created. Wasn't the tag on superuser.com enough? Split \"Vi,Vim,Vixens\" off onto another stackexchange and all that happens is the users are too thinly spread, like butter scraped over too much bread (as Bilbo would say).\n\nPerhaps the problem is that all the current community really has in common are \"computer things\". A whole slew of new stackexchange proposals are just riffs on that same theme."}, {"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Sep 18, 2010", "message": "I think Geof's proposal about allowing \"niche\" site's based on tags might be a good one... truth is you can't do everything with tags that you can on a full site. For one you don't have all the sort options.\n\nI still believe the Ubuntu/Unix decision was the wrong one, and I said that allowing that would set a precedence that factionalism is ok.\n\nNo superuser didn't work for Unix people because there were just too many things that things could have been tagged. It would take a long time to follow everything that might work on a Unix system... and most of the users there seemed to know more about windows than Unix (Irony, since windows has no superuser)."}, {"author_name": "Joel", "gravatar_hash": "ff4fcce308200db766517210582cd6cf", "author_url": "http://bestattendance.com", "date": "Sep 18, 2010", "message": "What a cute dog!"}, {"author_name": "Rick", "gravatar_hash": "792b6087ed871435951f4dfdd8bb7dfe", "author_url": null, "date": "Sep 18, 2010", "message": "Gah, I also meant to propose that every tag is a subdomain of megaexchage.com. So my question would be on drupal.megaexchange.com and on php-development.megaexchange.com.\n\nThis means it's possible to live in the walled garden, totally ignoring the transparency of those walls."}, {"author_name": "Ernest", "gravatar_hash": "8e50002a2a2cc7eb2725764e0be5aecf", "author_url": "http://mxyzplk.wordpress.com/", "date": "Sep 18, 2010", "message": "I agree with a lot of merging and think that too much \"listening to the users\" will end up with a totally fragmented SE which serves no one.  I am interested in about a dozen of the topics in various SEs, but there is no way in hell I'm going to go follow all of them - I follow e.g. Server Fault and I ask my UNIX sysadmin questions there, whether they are Ubuntu or not.  I might find more \"focused\" communities on Unix or Ubuntu or the ten others I don't know exist, but that's too much trouble for me the general user (it's really only good for the 10 people that want to superspecialize and just talk to each other). Fragmentation is harmful for the vast majority of users.  I say people should use tags until traffic on a given topic inside an already existing SE gets so large that it could merit its own site."}, {"author_name": "RegDwight", "gravatar_hash": "9e6196f558d30d39ba5c5f1d55865dd3", "author_url": null, "date": "Sep 18, 2010", "message": "Programmers.stackexchange.com is indeed a strange beast. It is one of the least useful sites of the network. Even though it might be one of the most entertaining. \n\nWhen compared to other sites, there is an incredible amount of noise on Programmers, and not anywhere as much signal. Sure, to some extent that's by definition. However, the five on-topic questions that had been selected on Area51 at least sounded promising, if highly subjective. Right now, many questions are subjective and... well, that's it. They have no other defining qualities and bear no value whatsoever, to anyone on this planet. They are nothing but random polls, not helpful at all in \\making the Internet a better place for finding good answers to specific questions\\.\n\nMind you, there are also questions that *are* useful, such as, oh say, what keyboards are ergonomic, or how to talk to pointy-haired bosses (or lovely ladies), or whether job hopping will look bad on your resume. But even those questions are extremely broad, and the only answer you can reasonably take from (or give to) them is \\it depends\\. \n\nSo you read everybody's answers, you pat everybody on the back, and it makes you feel good as well. But at the end of the day, you walk away not having really learned that much, if anything at all. For a Q&amp;A site, that's abysmal.\n\nProgrammers is just one step short of becoming a Digg/Reddit clone. That's some extreme criticism right there, but so are the problems.\n\nI am not dismissing Programmers completely; having a place for that water-cooler nonsense is great — but I also feel that we are misusing the SE platform. The site, as it is, is not a good fit for StackExchange; and StackExchange, as it is, is not a good fit for the site.\n\nAnd it's beginning to dawn on people; on the community itself. Just look at meta.programmers. Ten days into the public beta, there are already quite a few discussions going on about how the SE engine could be changed to better suit the community. As if the community was somehow forced to use that engine to begin with. Out of a million possibilities, we consciously picked SE, and now we suddenly want to \\improve\\ it in all kinds of funky ways. Suggestions range from removing the ability to mark anything as Community Wiki to getting rid of the ability to accept answers.\n\nI think that speaks volumes. We are reinventing the wheel.\n\nCoincidentally, that's the main reason why merging a couple of more serious proposals into Programmers won't really fix anything. In and on itself, merging is an excellent idea. But this particular site is just too different from everything else. Painting stripes on a unicorn will not make it a zebra; it will make it a very sad unicorn and waste lots of paint.\n\nThe list of merge candidates for Programmers reads really weird. To expand on your very own metaphor, you have this motley crew having fun at the water cooler, and those Health IT specialists and software lawyers impatiently waiting on the doorstep, keen to discuss dead serious stuff. And you walk them over to the water cooler and tell them, \\You are all friends now! Talk to each other! I'll be off then!\\\n\nP.S.: I am also not quite sure about merging the vi proposal and the Emacs proposal with a site that is all about subjective questions such as which editor is the best ever. I must have missed the memo about the Internet running out of flame wars."}, {"author_name": "Gavin Chait", "gravatar_hash": "a55659cb13ad7ac2d6ceeee5df3d3c81", "author_url": "http://www.whythawk.com/", "date": "Sep 19, 2010", "message": "The success of StackOverflow is because of the well-structured balance between the dictatorship imposed by its initial form and the freedom that members/participants have within that form.  A bit like a game of chess.  There are very real, very complex (and somewhat arbitrary) rules but - within these - players can do as they wish.\n\nThis is something I called \"Orchestrated Freedom\".  Real freedom very quickly gets chaotic and death-by-committee is sure to follow.\n\nThe reason StackOverflow works is that you have a simple and clear set of rules for creation and answering of questions, as well as rewarding the authority of individual users.  When it came time to create new StackOverflows you essentially threw the rules out and created a free-for-all.  Anyone can create a new group and so everyone did.  I think you just need a new set of tools that can be accessed by those with sufficiently high authority (again, an arbitrary choice set by an external \"orchestrator\").\n\nHere are some ideas:\n\n- Questions can be migrated from one StackOverflow to another by votes by high-authority users;\n- When sufficient questions have been migrated to other sites then users can vote to merge entirely (and not necessarily with only one site);\n- Should insufficient users vote then the process continues until activity drops below an arbitrary limit whereupon everything is automatically migrated;\n- Those who migrate between Stacks can maintain their authority derived from migrated questions (potentially with some discount);\n- You may also wish to permit questions to migrate from popular sites to new sites (but perhaps with a greater level of voting to achieve) so that sufficiently complex Stacks can split and differentiate if required.\n\nWhat this would mean is that you don't automatically have to worry about what works with what but ensure that users know which stacks are posing similar questions and allow straightforward migration.\n\nIn addition, I would also recommend a process of \"forgetting\".  I think it may be useful for ensuring that sites don't become dominated by old \"crusty\" members if authority is maintained only for a year, with a fall-off on authority gained more than a year previously until it goes to zero for any points gained more than two years previously.  This allows a more organic movement between Stacks and ensures that only the most consistent recent supporters manage the site (and are not limited in necessary changes by those with tremendous scores who are not similarly engaged).\n\nThanks for a fantastic service and looking forward to seeing what happens next."}, {"author_name": "Alex Githatu", "gravatar_hash": "247360911b4919a1d820f43d469fea07", "author_url": "http://alextheafrican.wordpress.com", "date": "Sep 19, 2010", "message": "I was also surprised like many here at how big Taco is!\n\nNow I'm no expert on how communities are built, but I feel smaller groupings make more sense as part of a larger community. Take a large city (New York) for example. It's populated by residents who have diverse interests and many of whom may never cross paths, but they all take comfort and share in the identity of belonging to that city. \n\nSame thing applies to users of SO. Despite having wide ranging (and often clashing) programming interests, they co-exist as part of the community contributing to its stability, diversity and vitality."}, {"author_name": "Reuben Helms", "gravatar_hash": "456544b52d6f3864a40c3af426defffd", "author_url": "http://reuben-in-rl.blogspot.com", "date": "Sep 19, 2010", "message": "It might have been a rhetorical question, but I think there might be a need to do a SE per CMS.  By the same token, I'm likely to do a Google search if I have questions, and if a SE site gets included because of the right tags, then it won't matter while SE site I end up at.\n\nWhile programming techniques can be transferred between different languages, and even some library functions have similar counter parts in other frameworks, CMSs seem to be different beasts with only the big picture concepts of Content and Menus drawing them together.  I'll make an assumption that if you're looking for SE info on a CMS, you're probably looking for detail on how to make a model for a particular one. An existing answer, or a new question will be tagged with the specific CMS, and perhaps even it's version.  I don't imagine there would be alot of overlap between Drupal and Joomla questions, however, I might expect overlap between PHP and Drupal, or PHP and Joomla.\n\nEven though there might be a lack of overlap in CMS questions, I would suggest a single SE for them.  You'd end up seeing a certain amount of siloing in tags for the major CMSes."}, {"author_name": "Rob Beyer", "gravatar_hash": "8b7fd6928cca81f4c7fe6615373e5d4c", "author_url": null, "date": "Sep 20, 2010", "message": "Looking at the responses and cherry-picking, I'd recommend the organic route - let the scale of the questions/community create the splits from a generalised top-level tag based structure:\n\nStructurally need:\n\n1). Stack-Search it = Top Level (encompasses everything)\n2). Stack-Site it = Mid Level (encompasses topics)\n3). Stack-Tag it = Lowest Level (encompasses specifics)\n\nThen add 2 decisions on tags or sites (critical-mass):\n\n4). Stack-Overflow it = Split Level (too much content for tags, split into a separate topic site)\n5). Stack-Underflow it = Merge Level (not enough content for a site, absorb into larger topic using tags)\n\nCommunity voting requirement:\n\n6). Vote it = send a question to a Specific Site / Level / Tag (redirect the question)\n7). Vote it = send a tag to a Specific Site / Level / Tag (redirect the tag)\n\nThen as questions and tags get voted to locations by the community, the critical mass of a particular site is assured by value and quantity of the questions associated with the relevant tags.\n\nStart the 'top level' topic and watch the tags as the build and are voted upon. Make it organic, and the questions about whether or not a community can be built around a topic is automatically answered by critical-mass and the community itself.\n\nCaptcha: satzung supoze"}, {"author_name": "Pavel", "gravatar_hash": "9dd51b6a5cb889e88b64f122812f9876", "author_url": "http://appengine.google.com", "date": "Sep 20, 2010", "message": "I think that categories (of any kind) has become obsolete. Tags is much better for many reasons."}, {"author_name": "Vince", "gravatar_hash": "314a361589aa755c8e941242767f880f", "author_url": null, "date": "Sep 20, 2010", "message": "Rule 3 - You’re not creating such a big group that you don’t have enough experts to answer all possible questions\n\nIt contains a double negative that I just can't get my head around.  It should be something like:\n\nRule 3 - You're creating such a small group that you don’t have enough experts to answer all possible questions"}, {"author_name": "Amrinder Arora", "gravatar_hash": "e8f91b07dbc64f768b15c20f2b3842d5", "author_url": "http://www.standardwisdom.com", "date": "Sep 20, 2010", "message": "I think Yahoo Answers is such a terrible site simply because they have such terrible avatars.  (The advertising that covers 80% of the page doesn't help either).  Other than that, it might just have worked, no?"}, {"author_name": "Ian Ringrose", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Sep 20, 2010", "message": "As tags are used to divide up a site, a good rule maybe “most tags must be meaningful to most users of the site”.   Or all users of a site speak the same language.\n\nAnother option is, “if a user works in a field that is covered by the site, his/her boss will not complain when he/she sees the list of questions on the site”"}, {"author_name": "Ian Ringrose", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Sep 20, 2010", "message": "Maybe we need a way to let a large site be viewed as a collection of smaller overlapping sites.  Each of these smaller sites could have there own home page and url if needed.  I think some level of grouping above “tags” but below the current concept of “site” may be the another. See http://meta.stackoverflow.com/questions/65084/should-tag-be-able-to-be-group-together-large-sites-only"}, {"author_name": "David Hollman", "gravatar_hash": "4b0bc5fee5f02e4d117db039b47528dc", "author_url": null, "date": "Sep 20, 2010", "message": "I think the basic goal here is to avoid the \"Yahoo-answers effect\".  I have this dilema with one of my proposals.  @Vince has incorrectly restated rule 3.  The point IS in fact to \"not create such a big group that you don't have enough experts to answer all the questions.\"  Take my proposed site, for instance.  I have proposed a site for Computational Chemistry.  There has been a site proposed for Chemistry as well (which is, very literally, the size of an academic department at a university), though it about 1/3 as many followers as computational chemistry.  There is a fairly well established listserv for computational chemistry called CCL, which dates back to 1991 and has an estimated 3000 daily readers.  About 80% of the posts on CCL would make perfect StackExchange questions (the problem with CCL, of course, is that it is a mailing list, and a very old one at that, so everyone on the list gets every question asked in their inbox).  The problem with merging computational chemistry into Chemistry is that 98% of the questions on a Chemistry Q&amp;A site would be from high school students wanting to know how to do basic stoichiometry.  This is what I would call the \"Yahoo Answers effect\" Experts certainly don't have time to answer thousands of high school chemistry questions.  \n\nSo my question would be: how big does an online community need to be to justify a dedicated SE site?  A computational chemistry site might get 1,000 to 10,000 daily views in the best case scenario, but it would hold pretty steady there.  I have considered expanding my proposal to \"Computational Chemistry, Physics, and Biology,\" but these three groups of people almost never use the same software packages, and rarely even use the same vocabulary.  Where do we fit in?\n\nSorry for the super-long comment."}, {"author_name": "Carlos", "gravatar_hash": "a5a56df69f28ed0c99fbd2fa5fc6d173", "author_url": null, "date": "Sep 20, 2010", "message": "I think Gavin Chait is on the money here....\nI had the same thought (Well ish)."}, {"author_name": "Paul Nathan", "gravatar_hash": "fc3225dc3119500fcbf7af646a83c914", "author_url": null, "date": "Sep 20, 2010", "message": "Hi,\n\nI've committed to the Compiler Design and Programmers SE.\n\nI had hoped that PSE would be a good (not-programming-related) site. It's... er... a bit poll-ish at the moment. Value-added is sorta not good for me right now.\n\nCompiler design is super-focused. There are a lot of good people (Miguel de Icaza for one) who have committed. My case for believing it doesn't fall in the general SO is this:\n\nDesign of compilers encompasses theory (What's a PDA?), languages (How do you implement a lambda? what is a lambda?), and  practical (how do you implement a tokenizer... for C++).  I don't see SO as being very theory-friendly, and compilers encompasses a decent amount of theory. It's a very technical subfield that, I believe, does not wholly fit SO."}, {"author_name": "William Crawford", "gravatar_hash": "149417ae340e19cee855b13ae133cd4d", "author_url": "http://www.beacon16.com/blog/", "date": "Sep 20, 2010", "message": "Another +1 for Eric's comment on not merging Healthcare IT with \"Programmers\". There's a huge need for that site - I was considering starting my own based on OSQA until I saw the proposal on Area 51. The participants on that site will include software analysts, physicians, researchers and IT staff working on everything from NIH sponsored studies to integration projects for hospitals. \"Programmers\" sends the wrong message, and the requirements of the reputation system doesn't mesh at all. \n\nThat's a good overall point, frankly - maybe even criteria #5. Questions about X should be credible answerable by general experts on Y. Not the case with HIT at all (although the inverse may be partially true)."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Sep 20, 2010", "message": "Sorry to be such a downer, but I still don't think you're going to avoid another Unix/Ubuntu debacle with this.\n\nWould StackOverflow even have gotten off the ground if you'd been \"committed to the ideal that the community itself has to make the ultimate decision\"?\n\nThe community making the ultimate decisions was exactly what gave us a few thousand PHPBB boards about Java, and another bunch of PHP sites, some C++, some about game programming, and so on.\n\nWhat StackOverflow did was *not* to go out and let the community take the ultimate decisions. No one ever asked us if we wanted a separate PHP site. The option was never on the table because *you* had decided it was a Bad Idea. And it was. But if you had asked, I'm willing to bet my left arm that tens of thousands of PHP programmers would have said YES PLEASE! (and in the case of PHP, the rest of us might have agreed, but that's beside the point ;))\n\nI think what you're really missing is some layer of abstraction between the proposals that are made, and the sites that are created. The community is good at saying what it is interested in, but that's not necessarily what it *needs*, or what would actually work in practice.\n\nFor example, when users said \"we want a Unix site\" and \"we want an Ubuntu site\", perhaps the solution would have been not to merge or leave alone, but rather to transform them into two different sites.\n\nObviously, the Ubuntu users didn't feel they'd be served properly on a Unix site. Why not? Maybe the focus of the site is wrong. It's not so much that it's not exclusive to Ubuntu (since that could be handled with a simple tag). The problem is that the two sites appeal to different *kinds* of users.\n\nMaybe it'd have worked if those two proposals had been transformed into \"Linux-users\" and \"Linux-hackers\", for example. The reason why Ubuntu users didn't want to use the Unix site was that they felt Unix sites tended to focus too much on scripting things yourself, hacking, messing around with the system, while the Ubuntu users just wanted their computer to *work*.\n\nThe Ubuntu users didn't sign up simply because they use Ubuntu on their computers. They did so because they wanted a place to get simple, not-too-technical answers to their questions of how to make Ubuntu do X or work with Y. The uniting trait is not that they *have* Ubuntu, but that they want to *do* something with it.\n\nThat was how the original trilogy worked: All those interested in programming and writing software, go here. All those who are tasked with keeping stuff running by any means necessary, go that way. And those of you who just want your own computer to work, use this site\". We don't care *which* language you're programming in, StackOverflow is where you need to be. And it doesn't matter what kind of servers you're running, you need to be on ServerFault.\n\nThat certainly wasn't the division the community would have proposed if you'd asked.\n\nThe trilogy works because it divides people based on the activity they're interested in, rather than by the arbitrary set of bits on their harddrives. Call it Windows, Gentoo or OSX, it doesn't matter. If the problem is \"I need to configure my server to do X\", you have one place to go, and if the problem is \"I need to write a program that does Y\", you have another site.\n\nA sysadmin won't be much help for someone asking about Matlab programming, even if said Matlab instance is running on the same OS as the sysadmin's server.\n\nBut a Java programmer can contribute when a Python programmer asks how he should organize his code, or when a beginner in some other language asks what recursion means. Programmers have a skillset in common regardless of which language they're using. Sysadmins have skills in common, whether they're Unix or Windows people.\n\nThe same goes for the Music thing: maybe the best solution isn't simply to merge some of the sites, and leaving others alone. Maybe they have to be all merged together, and then split again along a different axis. Is the community going to suggest this? Probably not. So who is?\nWho does each site appeal to? What do their users want to *do*? Do they want to play music? Do they want to be in a successful band? Do they want to learn music theory? Do they want to *write* music? It's not really the guitar that's important, it's the fact that you want to learn to play an instrument.\n\nThe gamedev site suffers the same problem. It's targeted at people who are interested in \"game development\", but lots of people are, and they don't have a lot in common.\nThere are people who are interested in *programming* games, there are people who are interested in making the art for a game, people who are interested in designing games, and so on. Each of these groups has some kind of internal focus, an activity they can all relate to, and where they're all able to help each others. But the game programmer and game artist don't really have that much in common in terms of the activities they perform, or care about. They are interested in the same end product, sure, but there's no overlap between them as far as the activities they want to do to get there.\n\nAs for the programmers site, who is it *for*? The reason it's such a watercooler thing at the moment is that that's basically how it looks from the outside. We have StackOverflow for discussing the actual activity of programming. Programmers.SE is for what... discussing the *profession* of being a programmer? That *does* sound like something you do at the water cooler.\n\nAnd merging it with the ones listed doesn't really make sense. Then we'd have a site for... discussing being a programmer as well as being an Emacs user?\n\nisn't it a pretty good rule of thumb that the good, successful sites, focus on a verb, on an activity, rather than an object, or a \"thing\"?\n\nServerfault isn't about servers, it's about \"managing servers\". SO isn't about code, it's about programming.\nMathOverflow is for those doing math and solving math problems, not for those who want to talk about being mathematicians. (and it's not for any specific math \"thing\" either. We don't need a site just for square roots). \n\nThe Gadgets site failed because it was about a thing (well, a lot of things), rather than an activity. As such, there's no clear skillset to focus on. Lots of people own a gadget, but that doesn't mean they know anything about it, or can contribute to a Q&amp;A site.\n\nThe Ubuntu site isn't really about Ubuntu, it's about *making Ubuntu run, and serve your needs*. The Unix site isn't really about Unix, it's about messing around with Unix, and hacking it to do what you need. Those are the focal points that really unite the site's community. We might all be Ubuntu users, but that doesn't give us anything to talk about. What does give us something to talk about is that we're all trying to get our computer to work properly.\n\nSo two questions it might be worth asking about prospective sites:\n\n- is the site about a verb or a noun? Is it about programming or about C++? About \"making stuff work\" or about the stuff itself? The former is good, the latter should serve as a major warning sign.\n\n- if I click on a random question under a random tag, will I understand what's going on, and be able to learn something or contribute something? I've only ever written a couple of lines in Ruby, and certainly wouldn't be able to tell you why your Ruby code doesn't work. But I *can* see that it is code, and make a guess of what it does, so I might learn something from it. And if the question isn't too specific to Ruby, I might be able to answer as well. A guitar player will likely be able to understand what's going on if he clicks on a question under the Piano tag. But a game programmer clicking on a random game artist question is pretty worthless."}, {"author_name": "tion", "gravatar_hash": "35f44419aee0597f378e2d67d2f08f22", "author_url": null, "date": "Sep 20, 2010", "message": "I went to Newton South.  We certainly were a rowdy bunch. You should definitely have your kids transfer there from NNHS!  \n\nAcademia is a great analogy!  Ignore all these niche sites that have Napoleon complexes."}, {"author_name": "Jon", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Sep 21, 2010", "message": "Jalf should be CIO or CEO, he makes a very valid point."}, {"author_name": "Daniel Paull", "gravatar_hash": "95a53f6f0c28c75b24cf1a9eb0eb19e7", "author_url": "http://www.thinkbottomup.com.au", "date": "Sep 23, 2010", "message": "What if we considered there to be just one \"site\" called \"overflow.com\" and the only mechanism for categorising and segregating data was based on tags?\n\nThe trick, as I see it, is to allow some tags to be selected implicitly, making the overarching, generic site look like a more specialised site with a well defined community.  The URL used to access the site can provide this.  For example, if you used the URL \"programming.overflow.com\", the the \"programming\" tag would be implied - you would only see posts with that tag and that tag would be added explicitly for any new posts you make.\n\nExtending this to multiple tags in the URL supports the idea that \"communities consist of concentric circles\".  Consider \"programming.python.overflow.com\" - here you would find the inner-circle of Python programmers talking about all things Pythonic and how the rest of us just don't get it.\n\nI like the idea that questions that span communities can appear on multiple \"sites\" just by being tagged appropriately.  For example, if I had a question about software license agreements and tagged it \"legal\" and \"programming\", it would appear on \"legal.overflow.com\" and \"programming.overflow.com\" and I might get answers from both communities.\n\nSeparate branding (heck, completely separate user interfaces) can be provided for different URLs, so \"garneding.organic.overflow.com\" can look and smell completely differently to \"programming.overflow.com\".\n\nIt seems that the granularity of useful communities can be defined by the users simply by making certain URLs well known and indexed by search engines.\n\nCheers,\n\nDan"}, {"author_name": "Dave Anderson", "gravatar_hash": "b825ab529e741d433c3656a9c039b563", "author_url": null, "date": "Sep 23, 2010", "message": "It's funny that you note that social media sites have no sense of history, then say that the only similar categories you can think of are universities?\n\nHow about Usenet? Ten years ago that was a brilliant collection of some functioning and many non functioning groups. The most popular groups from there could probably serve as a good template for Stack Exchange."}, {"author_name": "Jesse", "gravatar_hash": "1886d8fe62f716fefbcb7ef6c763631a", "author_url": null, "date": "Sep 24, 2010", "message": "I think what Dan said is very much on the money.  Each site is much like enforcing a one-level hierarchy which should be able to be bridged with tags (ubuntu.unix.overflow.com) == (unix.ubuntu.overflow.com) ==~ ubuntu.overflow.com (assuming ubuntu isn't something other than a linux os).  This does sound like it can be solved with set theory.  Perhaps this blog post is in the wrong place it should be at mathoverflow.net!"}, {"author_name": "mbq", "gravatar_hash": "4e58c567f39fb31b8e7d6794bd1f9e9a", "author_url": null, "date": "Sep 24, 2010", "message": "Machine learning is an official topic of stats.stackexchange.com [feature CrossValidate.com], there is a lot of ML questions asked and answered there, we have posted and upvoted few comments about it to ML proposal and I have seen hardly few followers even logged in to this site..."}, {"author_name": "txwikinger", "gravatar_hash": "4d2d9514d8c1d2fc1f3f5e16a0d5eb41", "author_url": "http://drupal.txwikinger.me.uk", "date": "Sep 24, 2010", "message": "I think the problem with this whole topic is that the discussion is happening always on two levels at the same time, and these two levels do not or if intersect only barely.\n\nOn the one side are the engineers, who want to put everything in the right boxes, the right categories. They use a top-down methodology, This approach creates boundaries and rules that are not all-encompassing. People often leave if it does not fit (hence the hundreds of php bbs).\n\nOn the other site are the communities, that often appear and grow organically without the boundaries of engineering. Some called this anarchic. Well in some sense it is, but it is not without rules. It is anarchic in the old greek sense. The rules are made implicitly by the community itself, not by some \"Gods\" looking over the community. See also my comments at <a href=\"http://drupal.txwikinger.me.uk/content/evolution-does-not-follow-path-guided-scientific-categories\" rel=\"nofollow\">http://drupal.txwikinger.me.uk/content/evolution-does-not-follow-path-guided-scientific-categories</a>\n\nIn some way, I believe the whole area51 concept has thrown stackoverflow into a dichotomy. As long there was only the trilogy, there was a high form of control for the broad rules. Area51 promised in some way that if you find a topic and a community supporting it, there will be a site. This is in some ways like Thomas Mann's Wizzard's apprentice. You easily call spirits that you will not be able to control.\n\nAnd I believe this is exactly the issue that is now going on. The expectations of the old guard is totally different than the expectations of the new wave of communities coming in. \n\nI also believe that the trilogy was a different kind of beast, because even with three sides, the community was more or less of one type. It was all about using computers. The division into three sites is more a super-tag.\n\nNow the communities are starting to be far more diverse. Hence the general way of engineering things will not always work anymore.\n\nI don't know what the solution  to this problem is. I see basically two ways out of this problem. One is to go back to traditional tight control and top-down \"engineering\" approach. However, this will loose a lot of communities that do not fit into this kind of philosophy. \n\nThe other way is to open up and trying to start to learn what diversity really means and what it demands. This will not be easy, the US melting pot tries this for a couple of centuries and has not succeeded in it yet (maybe in truth it is not tried and that is why it is not succeeding). This will look more anarchic (but will still have its own implicit rules), it would be more evolutionary than planned. It will not prevent communities to grow together (and merge) or others to split. However, this way things are tested by real life and mistakes are corrected later.\n\nThe alternative does not allow to ever know what works and what works not, because the decisions are made on preconceived notions, or stereotypes. Diversity cannot exists under prejudice and stereotypes, the communities attracted will still be very homogeneous.\n\nI do not know which way is better, these are two different ways that both might be right in some way. However, maybe in the end, both ways will be walked in any way, because ideas cannot be monopolized. Even Microsoft could not prevent Linux to rise up. In the same way, if communities don't feel welcomed, they might just fork and go outside stackexchange.\n \nIn any way, there is an interesting future ahead."}, {"author_name": "David Rivers", "gravatar_hash": "9ae9258789a5fff2df62379a51cbe22f", "author_url": "http://davidrivers.name", "date": "Sep 25, 2010", "message": "Is it possible that if more people were aware of how to efficiently use the tag system, then they would desire less to create faction sites?  Not that it's hard, but I was probably using Stack Overflow for most of a year before I noticed (and started using) the tag system."}, {"author_name": "Daniel Dinnyes", "gravatar_hash": "e487b205e6e71c615e0cea6c1c194578", "author_url": "http://www.itemsolutions.com/", "date": "Sep 27, 2010", "message": "I think the problem is that the content on the new SE sites are not shared. In my opinion there should be a common architecture for all \"Stack\" sites, so that the questions and their answers are stored in a common repository. Then the sites like StackOverflow, ServerFault, SuperUser, and all Area51 experiments are just some selections from those, based on some clustering criteria. Tags are good metadata to do the clustering.\n\nThis would be a solution for all the problems you mentioned above. It's more natural also a bottom-up approach, scalable, and future proof... if taxonomies evolve (specialized, generalized, become obsolete, or created) it is only needed to refactor the clustering query. Most importantly, the set of questions on the sites don't have to be disjoint. One given question does not belong to just only one site exclusively.\n\ne.g. if the Ubuntu community wants their own site, it can be created by specifying some selection criteria. If someone adds a question to the Ubuntu site, it will be visible on the Unix site also, but not the opposite.\n\nI like how the Bazaar version control system handles the revisions in a shared repository: each branch is just a view/selection of all the revisions in the repository.\n\nHope my ideas help."}, {"author_name": "Mike Schinkel", "gravatar_hash": "81df87e0d3e269d6fa6a17c6914fd656", "author_url": "http://mikeschinkel.com", "date": "Sep 28, 2010", "message": "@Joel: I think you are completely off-base and further think you and your team painted yourself into a corner.\n\nFirst, this idea that forcing people into a larger community *given your current site architecture* flies in the face of decades of research in sociology. People want to create communities where they get to focus on the things that matter to them and when in those community they participate. Put them in a large community with too much noise and they go silent. \n\nAs evidenced I'm currently interested in WordPress. I've got a good reputation on the WordPress Answers site but a trivial reputation on StackOverflow even though SO has more WordPress questions than on WordPress Answers. FYI, my current rep on WA it's 4194, on SO it's 310:\n\nhttp://wordpress.stackexchange.com/users/89/mikeschinkel\nhttp://stackoverflow.com/users/102699/mikeschinkel\n\nIf you merge sites, I'll just stop contributing and I'll bet there are a lot more people like me than there are people who want to participate in a larger community. Yes, you have many on SO who want a larger community, but I'd compare SO's user base with Facebook's user base and say the latter want smaller communities, not larger ones. After all, Facebook has beat the 90-9-1 rule by getting far more than 10% actively contributing. How many SO users actually answer questions vs. just lurk?\n\nAs for painted yourself into a corner you've done so by launching multiple sandboxed sites. Compare to Quora which is a single site. I like the way your sites \"feel\" a lot better but Quora can scale in ways you'll never be able to. I see two options for StackExchange:\n\n1.) Stop this silliness about trying to force people into larger groups and allow as many niche communities as will have a reasonable number of users.\n\nOR\n\n2.) Follow what both Daniel Paull and Daniel Dinnyes suggested and merge ALL sites into StackExchange.com and allow them to have subdomain and even domain aliases like http://stackoverflow.com for specific communities. Provide a community process to \"promote\" tags to categories (following the WordPress model of tags and categories) and a category becomes a \"site.\"  Let users associate themselves with one or more categories/sites so that on StackExchange.com they see only those things that are related to their interests, or if they go to one of the subdomains/domain aliases they see only the things for  category/site *including* the question list and user reputation list being filtered for that category/site. IOW, allow the creation of sandboxes that people can play and and filter out all of the noise.\n\nSo here's my prediction: either you'll pursue #1 or #2, or you'll be eclipsed by something like Quora, and StackExchange will never make the transition into the public consciousness that companies like Google, Yahoo, Twitter, Facebook, Wikipedia and more have made. Continue on the current path and you'll just be an \"also ran.\" I hope that's not the case, because I love WordPress Answers, but I see the writing on the wall if you continue down the path of trying to force everyone into larger communities.\n\nJMTCW.\n\n-Mike\n\nP.S. In addition to @Daniel Paull and @Daniel Dinnyes I though @Ian Ringrose, @Gavin Chait and @David Hollman all had really great comments/suggestions.\n\nP.P.S. @jalf I disagree with you about PHP; I'd love to have a PHP Answers site separate from StackOverflow. SO is just too much noise for me to frequent."}, {"author_name": "matt", "gravatar_hash": "875b592087c435ab4a8d533cda9b69c1", "author_url": "http://www.maphew.com", "date": "Sep 29, 2010", "message": "Federated searching and browsing please! \n\nSurely there must be someway to mash things up so that when I'm looking for help on a particular problem in linux, and I use ubuntu but the issue is probably not ubuntu specific, that I can see answer on *both* sites?\n\nAnd no, \"Google it\" is not the answer (else we wouldn't have needed Stack Exchange in the first place)."}, {"author_name": "Steve Bennett", "gravatar_hash": "75f5707160697b2164444fc3f5054084", "author_url": null, "date": "Oct 07, 2010", "message": "One rule I thought you'd mention:\n\n5. People are starting to cross-post on both X and Y.\n\nYour stack overflows are too niche if there are questions that could be asked on two or more. For example, a question about cross-mobile-platform development would have to be asked at both the iPhone developers and Android developers' sites..."}, {"author_name": "W", "gravatar_hash": "30f7699e465efe849c5e2f830bcb594b", "author_url": null, "date": "Oct 12, 2010", "message": "If stackexchange sites are bigger than the typical interests of their users they need to allow the users to filter out what they aren't interested in. One way to do that is the interesting Tags filter suggested on meta.SO:\nhttp://meta.stackoverflow.com/questions/1187/filter-my-tags-questions-using-interesting-tags"}, {"author_name": "Paul Morriss", "gravatar_hash": "8691b744cb9151e4a173a23eb44eab3b", "author_url": "http://paulmorriss.com", "date": "Mar 25, 2011", "message": "I wish someone with a good overview would step in and decide what to do about splitting or joining web design/web development/webmasters/design/graphic design/comic design etc.\n\nHow many sites to do with the web do we need?"}, {"author_name": "summer", "gravatar_hash": "4927ada6d130be1688aba9cd3ab3aa7c", "author_url": "http://www.summerdayz.com", "date": "May 12, 2011", "message": "cute dog picture!"}, {"author_name": "FLY", "gravatar_hash": "b4c75b4c87ee7ae8be8ec8c4223ddf9c", "author_url": "http://zeep-vinkeveen.org", "date": "May 11, 2012", "message": "I you are considering iPhone development, shouldn't you be creating a bigger one 'apple development' where also iPad and OSX developers can come and exchange thoughts?"}]}