{"response": [{"author_name": "Dustin Senos", "gravatar_hash": "db3fd5c309ca7117cf165c1927300cfa", "author_url": "http://http//dustinsenos.com/", "date": "Sep 14, 2010", "message": "This is why Stack Exchange will succeed. You have the user's best interests in mind. Rather then being happy with the additional revenue from running ads on a site which doesn't need maintenance, you shut the site down. Thanks for being a good person Joel.\n\nCheers,\nDustin"}, {"author_name": "Andrew Steele", "gravatar_hash": "98a1506db38c5531acd8f4116d451076", "author_url": "http://www.steelebit.com", "date": "Sep 14, 2010", "message": "Not sad to see this site go. Of all the beta SE sites I have been involved with I was disenchanted by the Gadgets site almost instantly. It just never felt \"right.\""}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Sep 14, 2010", "message": "So iPad questions now need to go to the Apple site, not the gadget site?"}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Sep 14, 2010", "message": "(As opposed to Super User, where it seems like they’re not welcome.)"}, {"author_name": "Patrick", "gravatar_hash": "799b8c0b29c741b36bb9ff9ca47cb30c", "author_url": "http://www.circletoland.com", "date": "Sep 14, 2010", "message": "Hey Joel/Jeff. Feel free to shut down circletoland.stackexchange.com (the Pilot Q&amp;A site), I've moved it to a different platform at www.CircleToLand.com.\n\nGood luck in defeating the PHP boards!"}, {"author_name": "Joni", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Sep 14, 2010", "message": "Paul: Yep, apple.stackexchange.com is the perfect place for iPad questions."}, {"author_name": "Farseeker", "gravatar_hash": "3fe1ab2f3897d8e3931c5b297c29e994", "author_url": null, "date": "Sep 14, 2010", "message": "Whoah, I didn't even know that there WAS an Android site. If I had known that I would have asked my Android question there the other day.\n\nIt's a bit sad to see a site go, but as a bystander I can totally understand and appreciate the reasons behind the decision."}, {"author_name": "nohat", "gravatar_hash": "b64d136a3822a2e8194a583bb597ed99", "author_url": "http://nohat.net", "date": "Sep 14, 2010", "message": "What will happen to the people who \"committed\" to gadgets but didn't fulfill their commitment?"}, {"author_name": "Keith", "gravatar_hash": "0952b219674743e4d2bf396eb12032dc", "author_url": null, "date": "Sep 14, 2010", "message": "@Farseeker The Android site just opened yesterday in private beta.  Public beta will be available in 6 days."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 14, 2010", "message": "> What will happen to the people who “committed” to gadgets but didn’t fulfill their commitment?\n\nThese people will be shot.\n\nBut seriously, I guess we can release that commitment, since there's no way for them to do anything with it."}, {"author_name": "John", "gravatar_hash": "a22cd5aa8ee2982b6d52678a84634eba", "author_url": null, "date": "Sep 15, 2010", "message": "Will will happen to the old stack exchange 1.0 sites like http://mathoverflow.net/ will these be migrate to 2.0 or reviewed an maybe cut?"}, {"author_name": "Drake", "gravatar_hash": "b152453e24627505b5889e888585e55f", "author_url": "http://www.teamoff.org", "date": "Sep 15, 2010", "message": "I agree with this decision, and I am happy that a brand new SE site dedicated to Android is coming.\n\n1 fail on 24 is not a bad result at all :D"}, {"author_name": "Joni", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Sep 15, 2010", "message": "&gt; those questions can be migrated to the (beta) Apple site, or the (private beta) Android site, as appropriate\n\nHow do we go about this in practice? If one wanted to get e.g.  http://gadgets.stackexchange.com/q/57 migrated to the Apple site, what should he do? Flag it? Contact an Apple SE moderator? Email Jeff? :) Something else?"}, {"author_name": "Rob", "gravatar_hash": "503109dc01929dd0829c1f77362557f8", "author_url": "http://www.guruonline.tv/it", "date": "Sep 15, 2010", "message": "Ha ha, shame to only find out about all these sites just as they're being closed down. Still, probably a good call to combine them all, and this is still an awesome site!"}, {"author_name": "Richard Gadsden", "gravatar_hash": "3c291e7858e6b79e06889fa7dbf16d31", "author_url": "http://backtype.com/po8crg", "date": "Sep 15, 2010", "message": "Is there a plan yet for what happens if a site that has come out of beta has to be shut down because the traffic dies away after a few years?  I hope your intention in that situation is that the site would be locked as read-only rather than being completely closed.  There would be lots of good answers that probably have links pointing to them from all over the internet, and killing off all those URLs would make you pretty unpopular."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Sep 15, 2010", "message": "@Keith \nThat's why Android doesn't get it - you should announce the Android site everywhere and have people queuing around the corner every morning for the 6 logins available that day ;-)"}, {"author_name": "RegDwight", "gravatar_hash": "9e6196f558d30d39ba5c5f1d55865dd3", "author_url": "http://english.stackexchange.com/", "date": "Sep 15, 2010", "message": "It's always sad to see a site die, but then again, it never was quite as alive as its siblings to begin with. \n\nIt speaks volumes that there are so few users on Gadgets, and that the top 10 of them have less rep *combined* than many a user on other sites, some of which have been in beta for a much shorter time.\n\nOther metrics look even worse, or downright abysmal. At this point in time, taking the site down is just a logical conclusion. Again, it *will* make some people sad; but even to them, it won't be the end of the world. It'll be just the end of one site that didn't quite take off.\n\nI wish all the best to the Android and Apple sites, and to other communities that might rise from the ashes of Gadgets."}, {"author_name": "David Speyer", "gravatar_hash": "01632db9787f8da89709d5aa098ddd5e", "author_url": null, "date": "Sep 15, 2010", "message": "@John \n\nDisclaimer: I am a high reputation user on MO, but I don't speak for MO and have deliberately avoided becoming in the administration of the site. \n\nA lot of us are very concerned about migrating to SE 2.0. See the discussion at http://meta.mathoverflow.net/discussion/354/1/stack-exchange-20-and-what-this-means-for-mathoverflow/ . In particular, our understanding is that migrating to 2.0 would means that our moderators would no longer get full database dumps, which would make it impossible for us to ever move to a competing open source product. We are uncomfortable with the idea that we would have no backup option if SE became bankrupt or evil.\n\nMany of us hope that we can work out a deal which will allow us to take advantage of the new SE 2.0 features while addressing the linked concerns. If not, we will have to rely on Robert Cartaino's <a href=\"http://blog.stackoverflow.com/page/11\" rel=\"nofollow\">promise</a>\nthat \"any site that maintains enough traffic will be allowed to continue. SE 1.0 sites owners meeting the minimum criteria will have a choice:\n\n    * Continue for free under the same terms as SE 1.0 for as long as they maintain the traffic levels.\n    * Migrate directly into SE 2.0 as a fully-fledged SE 2.0 site.\"\n\nWe at MO certainly hope that our 50 questions a day, with a 99% answer rate, will be considered enough traffic."}, {"author_name": "Liam", "gravatar_hash": "faf9707decc36ef2b987bfb120af9e3b", "author_url": "http://www.LiamBateman.net", "date": "Sep 16, 2010", "message": "@patrick\n\nIsnt that a complete rip off of SO?"}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Sep 17, 2010", "message": "@Liam: certainly looks like it. Most of the FAQ is an *exact* copy/paste of SO's.\n\nWhat happened to the whole \"attribution required\" thing?"}, {"author_name": "Joni", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Sep 20, 2010", "message": "By the way, the next time you take a hard look at the SE beta numbers, I hope you take into account the little side effect that the migration of Gadgets questions had on the visitors/day metric (at Apple SE and Android SE):\n\nhttp://meta.apple.stackexchange.com/questions/112/why-did-apple-se-visitors-count-drop-so-fast"}, {"author_name": "Travis", "gravatar_hash": "69e090710d2a4303aeb8151a5c1f90d7", "author_url": null, "date": "Sep 21, 2010", "message": "Is there a way to \"claim\" questions that we asked on the gadget site that got migrated?"}]}