{"response": [{"author_name": "Matt", "gravatar_hash": "bc1d432d395297abeef42ee5294bc6ac", "author_url": null, "date": "Dec 15, 2014", "message": "I humbly invite you to read the rest of this post using the mechanical babelfish of your choice, and see if you think such tools can be relied on for important work ...\n\nChallenge accepted...\n\n\"Now is post questions and answers about programming in Japanese will be possible.\" \n\n\"Stack Overflow is everyone of site\"\n\n*slinks off back to The Workplace*"}, {"author_name": "nhinkle", "gravatar_hash": "356ab8ced7308b62b522cb7da345bfb4", "author_url": "https://stackexchange.com/users/78840/nhinkle", "date": "Dec 15, 2014", "message": "My translation fun: \n\n<blockquote>Currently, Stack Overflow is that it summarizes the seven million or more questions, each supports the programmer of the month 44 million people. </blockquote>\n\nWow! Programmer of the Month gets support from 44 million people - what a lucky guy!"}, {"author_name": "TravisJ", "gravatar_hash": "fabde205435e5299ee6cf78b57ba084f", "author_url": "http://blog.stackoverflow.com/2014/12/stack-overflow-in-japanese/?cb=1", "date": "Dec 15, 2014", "message": "My favorite line:\n\nThe future by the birth of Stack Overflow Japanese version, it is not necessary to solve the programming problem while struggling with English you."}, {"author_name": "Lightness Races in Orbit", "gravatar_hash": "3189f1e006358ec6c65481b9605cd0e3", "author_url": null, "date": "Dec 15, 2014", "message": "Yay, more institutional segregation and compartmentalisation of knowledge! Just what we need."}, {"author_name": "Raphael M", "gravatar_hash": "e5f3d257f7ac7cb7253c3c7f53cf3477", "author_url": null, "date": "Dec 15, 2014", "message": "And more than 600,000 of people of the Soviet Union have been accessed from Japan.\n\nSoviet Union? What does that have to do with a Japanese Stack Overflow? In what way and why do the Japanese \"access\" those 600,000 from the Soviet Union at all? I'm very confused."}, {"author_name": "akonsu", "gravatar_hash": "a70b7da5a3a712e800100e61ef8d8917", "author_url": null, "date": "Dec 15, 2014", "message": "The original text does not mention Soviet Union at all."}, {"author_name": "Doorknob", "gravatar_hash": "bf5ae1189f8b36ece8fcdc2e2e761104", "author_url": "http://keyboardfire.com/", "date": "Dec 15, 2014", "message": "&gt; Despite the English site, it has become necessary tools to solve the programming problem of Japan Pula Glamour.\n\nJapan Pula Glamour!\n\nBut anyway, I salute you in your attempts to make good programming Q&amp;A accessible to everybody. Keep providing useful resources for all of us!"}, {"author_name": "John Saunders", "gravatar_hash": "953e26e80351a67962a6e5840fc1fc14", "author_url": null, "date": "Dec 15, 2014", "message": "知ったかぶり"}, {"author_name": "David", "gravatar_hash": "03577366338fc9091d5f115f7c7300dd", "author_url": null, "date": "Dec 15, 2014", "message": "I'm getting a whole lot of boxes here. lol"}, {"author_name": "deceze", "gravatar_hash": "a235706e3d81b614acaec3368edfea4b", "author_url": null, "date": "Dec 15, 2014", "message": "お疲れ様っす！i18nが結構大変だったんでしょうか。"}, {"author_name": "Keavon", "gravatar_hash": "e1bfd94b888e860960c3e062c7ec9b43", "author_url": "http://keavon.com", "date": "Dec 15, 2014", "message": "Well, I was able to read the parts in katakana and various instances of the word \"Japan\" and \"Japanese\" along with some meaningless particles and okurigana. I really need to learn more kanji..."}, {"author_name": "ace", "gravatar_hash": "7f0f0a98ae117d27b197f8c1a7465ef5", "author_url": null, "date": "Dec 15, 2014", "message": "In contrast, being a Hongkongese I can read all the kanji and none of the hiragana and katakana, though I still managed to understand most of the article."}, {"author_name": "nhahtdh", "gravatar_hash": "a714584abc0ee64041a29dedf7105e59", "author_url": null, "date": "Dec 15, 2014", "message": "この記事は読めるけど、書くのはちょっと…"}, {"author_name": "abhitalks", "gravatar_hash": "ba865b2e539e8a7b00b27be3776d8394", "author_url": null, "date": "Dec 15, 2014", "message": "<blockquote>\n\"...the purpose was it together all answers questions related to programming, to provide them. To check for yourself whether or not valid answers on your own valuable time programmers themselves prior to the birth of Stack Overflow, you find answers in multiple blogs, bulletin boards and newsgroups, but did not.\"\n</blockquote>\n\nThank you! The purpose was it mechanical babelfish check of my here coming. To check for myself whether or not relied for important work, these tools!!"}, {"author_name": "Hrqls", "gravatar_hash": "31ab76077cdeaa9544362df625c79d0e", "author_url": null, "date": "Dec 15, 2014", "message": "Yoda made a career switch and is now working for StackExchange?"}, {"author_name": "Soner Gönül", "gravatar_hash": "8348bcf40f55bc5818651824369caff1", "author_url": "http://sonergonul.net/", "date": "Dec 15, 2014", "message": "どんなにあなたが使用する言語、私はあなたにスタックオーバーフローを愛していない"}, {"author_name": "Matthias Bauch", "gravatar_hash": "902bf283b8d8315098f6285e7e2ba7b2", "author_url": null, "date": "Dec 16, 2014", "message": "Lasst uns jubeln die japanische Programmierer"}, {"author_name": "Adriano Repetti", "gravatar_hash": "6a5304f7229e47941e1cf3229b3475af", "author_url": null, "date": "Dec 16, 2014", "message": "Let's FRAGMENT Stack Overflow. One site in Japanese, another one in Spanish, let's add two in Chinese (both simplified and traditional), one in Italian (thank you), French, Russian...and soon we will ask help to our neighbors. \n\nNO, thank you. Stack Overflow is valuable worldwide resource also because of its international users (unless you want to \"grow up\" another generation of American programmers who parse dates by hand assuming m/d/y).\n\nMy two cents"}, {"author_name": "Jean Hominal", "gravatar_hash": "48b539a26d13f6c9e40081805d8f47ac", "author_url": null, "date": "Dec 16, 2014", "message": "@Lightness Races In Orbit, @Adriano Repetti: The community and knowledge are *already* fragmented, because there exist people for whom english is a significant barrier.\nNot having a Stack Overflow in their language simply means that they will go to other websites for their QAs, not that they will join the global fluent in english community."}, {"author_name": "TLama", "gravatar_hash": "d6b3f1a4100f56e3e3c0874c82141ff6", "author_url": "http://stackoverflow.com/users/960757/tlama", "date": "Dec 16, 2014", "message": "@Jean Hominal, yeah, but now that barrier is even deeper."}, {"author_name": "Jean Hominal", "gravatar_hash": "48b539a26d13f6c9e40081805d8f47ac", "author_url": null, "date": "Dec 16, 2014", "message": "@TLama In what way does the existence of Stack Overflow in japanese deepen the barrier for a japanese-speaking developer who is not fluent in english? He was going to other sites in japanese anyway!"}, {"author_name": "Bojangles", "gravatar_hash": "64555e5f0e0ee1ecbf3eaaf0dc137328", "author_url": null, "date": "Dec 16, 2014", "message": "I feel like StackExchange isn't committed enough. I want to see a StackOverflow for Klingons, and perhaps in Elvish as well."}, {"author_name": "Euroxid", "gravatar_hash": "4d5cb2997c312c092ab60a73f8d9c347", "author_url": "http://www.euroxid.de", "date": "Dec 16, 2014", "message": "Unfortunately, the english language is not suited as input into any mechanical translation - there is a lot of context and not enough grammar. You are better of with some stricter language, e.g. german or latin."}, {"author_name": "The Blast I", "gravatar_hash": "0caa7eb1d4b0091c5ca00178f0ce8f9e", "author_url": null, "date": "Dec 16, 2014", "message": "Reminds me of the fun translating a HP press release from English to German, and back to English with Google translate. \"The mercury is happy to close a maximum of 90 percent of all customer solutions...\""}, {"author_name": "Duke", "gravatar_hash": "50c13a1a32050c21994136c230214d5b", "author_url": null, "date": "Dec 16, 2014", "message": "Just learn English. I am against any localized version of stackoverflow because it leads to fragmentation of knowledge."}, {"author_name": "Pratik", "gravatar_hash": "e1f37855c7c1bdb8275d7e6de76bd4fd", "author_url": null, "date": "Dec 16, 2014", "message": "Very nice , now Launch Stackoverflow in HINDI also for Indians.\n\n<blockquote>Ironically, if we wanted to launch a version of SO specifically for Indians... It would <i>have</i> to be in English. --Ed.</blockquote>"}, {"author_name": "alex", "gravatar_hash": "6b12e51a0008afacf9a3e09b4de620a1", "author_url": null, "date": "Dec 16, 2014", "message": "Wikipedia already did this experiment and it didn't lead to fragmentation. As long as there are users fluent in English (or any other established one) and the new language being added, they can translate content by hand, or use the older SO's content as a base for new answers.\n"}, {"author_name": "Rudy", "gravatar_hash": "e2c3101d19f6b1a509a097da940e47dd", "author_url": null, "date": "Dec 16, 2014", "message": "If a programmer can't read English, it means there is a problem. What will be next? We translate also the programming languages? We'll have different words for `if` depending on who wrote it?\n\nI am not a native English speaker, but I don't like colleagues who ask for translating something programming related from English.\n\nEnglish is also one very important point of the job interviews for programmers.\n\nThis entire effort is useless (in my opinion)."}, {"author_name": "Isiah Meadows", "gravatar_hash": "85d891895dd0988579bac444fbc87fd9", "author_url": null, "date": "Dec 16, 2014", "message": "@Pratik:\nI'm not sure if this link is for or against (specifically the answers), but it seems to hint at Hindi being used less and less.\nhttps://www.quora.com/Why-cant-we-make-Hindi-the-sole-official-language-of-India-to-develop-a-unique-identity\n\n@Rudy:\nLast time I checked, people still have to program for non-English speakers, and some projects never have to go beyond their home country, and thus, if English isn't the native language, it isn't a requirement. This is especially more so in the proprietary world."}, {"author_name": "Isiah Meadows", "gravatar_hash": "85d891895dd0988579bac444fbc87fd9", "author_url": null, "date": "Dec 16, 2014", "message": "Okay, this failed epicly with Google Translate. Most of the sentences aren't even in proper English. I'm pretty sure that Google doesn't entirely recognize words in Latin as their proper part of speech."}, {"author_name": "Ian", "gravatar_hash": "af60a40ce3bb2a7907452951c1f1c519", "author_url": null, "date": "Dec 16, 2014", "message": "I actually think the multiple versions could bring the demise of StackOverflow - it was one place for asking and answering questions, now there are a whole range of sites and we all need to be able to understand/translate every other language.\n\n@Alex\nI disagree - I have already come across answers (when searching base on class names) that ONLY exist on the portugese version of StackOverflow and have no translation to the English site. Therefore fragmentation is occurring."}, {"author_name": "Aujury", "gravatar_hash": "a81cf36b8a03611ea89cd22f33bb52f6", "author_url": null, "date": "Dec 16, 2014", "message": "Well I'M excited, at least. Looking forward to seeing this one grow! Looks like it's already got a good amount of activity."}, {"author_name": "Player", "gravatar_hash": "2653c23e6972b683f608362f0d94402b", "author_url": null, "date": "Dec 16, 2014", "message": "inb4 earn reputation by translating Q&amp;As"}, {"author_name": "Alex", "gravatar_hash": "d5fa3671bcf8ea3c553c28ca5f920709", "author_url": null, "date": "Dec 16, 2014", "message": "Having sites in different languages offers the possibility of making the sites more accessible to people that speak those languages, but there are going to be duplicates and people that don't speak each language will miss out. \n\nPerhaps if the questions were translated after a certain length of time it would help to mitigate problems with duplication and people missing out."}, {"author_name": "The Paramagnetic Croissant", "gravatar_hash": "8a8c858f80d45d0b21c1b0929b7af43b", "author_url": null, "date": "Dec 16, 2014", "message": "The machine translation from Japanese is still in better English than some people's questions on English Stack Overflow."}, {"author_name": "ラファエル", "gravatar_hash": "e5f3d257f7ac7cb7253c3c7f53cf3477", "author_url": "https://stackoverflow.com/users/1942027/%E3%83%A9%E3%83%95%E3%82%A1%E3%82%A8%E3%83%AB", "date": "Dec 16, 2014", "message": "@Ian that question sure wasn't there on the English Stack Overflow before either, was it? They sure didn't steal it.\n\nI can understand both sites a bit but ultimately support the creation of new sites in different languages. (I'll be using my first name written in Katakana for a month, to show my support.) Below is my extremely shortened but still wall-o-text opinion on the topic.\n\nIn short, see it as an entry drug to Stack Overflow for people who got a language barrier and wouldn't try it otherwise. Also people who know English but aren't native speakers can now help others in their native language but are also encouraged to use/participate on the English site. Also Answers in Japanese before were probably in multiple different forums, a central place with the new site would still make translating easier than it would have been before.\n\nAs for Japanese especially, it's a completely different language than English. It's the most difficult language for English speakers to learn according to the US Foreign Service Institute: https://en.wikibooks.org/wiki/Wikibooks:Language_Learning_Difficulty_for_English_Speakers it's the only one in the hardest category that also got an asterisk to mark special difficulty. I imagine they did some research before coming up with it.\n\nEven though above doesn't say anything about the difficulty of learning English for Japanese people, but the huge difference certainly wouldn't make it particularly easy to learn."}, {"author_name": "Jsilvermist", "gravatar_hash": "be03e2522bbfc5fac96dc9ed98d30c4d", "author_url": "http://www.silverlinkz.net/", "date": "Dec 16, 2014", "message": "(Using Rikaikun)\n\nWelcome to Stack Overflow\n\nIn 2008 Stack Overflow was established with the intention of being a summary of answers for all questions related to programming, a place sponsoring those trying to make things. Before Stack Overflow's birth, programmers themselves would use their own precious time, multiple blogs, bulletin boards, and news groups looking for answers, only to have no way to verify the validity of the answers but to check themselves.\n\nPresently, Stack Overflow has a collection of at least 7 million articles, and is supporting 44 million programmers every month. Now at least 600 thousand of the previously mentioned people access the site from Japan. Despite Stack Overflow being an English (language) site, it has become a needed tool for the sake of Japanese programmer's programming questions being solved."}, {"author_name": "alex", "gravatar_hash": "6b12e51a0008afacf9a3e09b4de620a1", "author_url": null, "date": "Dec 16, 2014", "message": "@Player\n\nActually that might not be a bad idea. Q&amp;As over a certain score threshold could go into a \"translation queue\" for 2K+ users who have registered as fluent in multiple languages. New gold badges yay.\n\n@Rudy\n\nEnglish isn't special. You don't code in English; as a programmer you're implicitly fluent in at least two languages (one spoken, one machine). \"If\" in English and `if` in C *are not the same word*, just cognates in different languages."}, {"author_name": "Danny G", "gravatar_hash": "8a49cd1726df828b9caca7ef8caf081a", "author_url": null, "date": "Dec 16, 2014", "message": "I cannot believe that still in December of 2014 we are still arguing about the implementation of SO in other languages, still people don't understand the basic need of it?\n\nLike this comment for instance:\n\n\"Yay, more institutional segregation and compartmentalisation of knowledge! Just what we need.\"\n\nSegregation is leaving behind the access to knowledge for people who can't actually speak proper enlish.\n\nEnough of that nonsense."}, {"author_name": "ラファエル (Raphael)", "gravatar_hash": "e5f3d257f7ac7cb7253c3c7f53cf3477", "author_url": "https://stackoverflow.com/users/1942027/%E3%83%A9%E3%83%95%E3%82%A1%E3%82%A8%E3%83%AB", "date": "Dec 16, 2014", "message": "@Jsilvermist\n\nwait, how do you use Rikaikun to translate whole sentences instead of just words? I got it installed already but am new to it and planning to learn Japanese once Christmas is over and I got more time.\n\nAlso that's a pretty specialized tool, therefore probably delivering the best quality results. Most might not know about it or how to use it (like me). I used the first 3 translators that popped up in a search and they all gave bad translations, with extreme problems in different locations (see the one insertion Soviet Union above for whatever reason)."}, {"author_name": "Jsilvermist", "gravatar_hash": "be03e2522bbfc5fac96dc9ed98d30c4d", "author_url": "http://www.silverlinkz.net/", "date": "Dec 16, 2014", "message": "@ラファエル\n\nWell, technically it does only translate single words, but if you just skim over the sentence, it's normally not too hard to piece it together.\n\nThe most important thing to remember is just pay attention to the particles (eg. は、が、に、で、から) to get an idea of the sentence structure, and from there just piece it together like you would in English when you read a word you don't know and have to look it up."}, {"author_name": "Joshua Maciel", "gravatar_hash": "01c4a70fddb042fa81be05ffde592339", "author_url": null, "date": "Dec 16, 2014", "message": "@Jsilvermist\n\nYes, the \"paying attention to the particles\" thing, especially in a language without subjects, is the part that computers have a huge issue with. Heck, I've been living here for over a decade and I still have trouble with particles. You should have seen the first draft of this in Japanese -- it was awful."}, {"author_name": "Will san", "gravatar_hash": "3568876d79f0551ec5d77652eb8ae9ef", "author_url": null, "date": "Dec 16, 2014", "message": "How do you say \"keep your goddamned tags out of the goddamned title\" in japanese?"}, {"author_name": "Tsahi Asher", "gravatar_hash": "f13412a027bf26cc942ad60df94b1744", "author_url": "http://tsahiasher.co.il", "date": "Dec 16, 2014", "message": "Any programmer who doesn't know decent English is not a decent programmer. The majority of the technical literature, and the majority of the professional web sites (such as SO), are in English. The API documentation of any library you use is in English. So every good programmer should start by learning English."}, {"author_name": "Rami", "gravatar_hash": "9d6e1795705b314d834c768623e62a3d", "author_url": null, "date": "Dec 16, 2014", "message": "damn guys you're extremists. If SO people would just add an i18n features to the site it would solve everyone's problems !!! Would anyone listen anyways. \n\nImagine asking your question in your native language, someone comes and translates it to english or to whatever other language. the question would be there for EVERYONE. WIKIPEDIA thought of this lonnnnnng time ago guys, you're not much better than them !!\n\n\n<blockquote>Have you ever used any of the non-English Wikipedias? They're great - but they certainly are not mirror images of the English site. There are topics that are only available in English and topics that are only available in (for instance) German; each site reflects the needs of their respective communities. A good model to follow indeed! --Ed.</blockquote>"}, {"author_name": "ラファエル (Raphael)", "gravatar_hash": "e5f3d257f7ac7cb7253c3c7f53cf3477", "author_url": "http://stackoverflow.com/users/1942027/", "date": "Dec 16, 2014", "message": "@Rami if only it were that easy. There are often a lot of comments needed to understand questions from beginners, even if they know English and the language isn't a problem. I just recently had a question where I argued with a few people about the right interpretation of the question (until the OP finally came back 2h later). A translation process adds another point of failure, some things might be more ambiguous. That's even the case if the translator knows both languages fluently.\n\nIn wikipedia it would be way easier to implement, it collects facts and cites resources that can be looked up. Questions here often come from beginners that sometimes don't even have a clear idea of the problem themselves, I imagine such questions could have a high chance of being translated into an X Y question since it isn't clear to the translator. There are a few more reasons why translating questions is harder than translating parts of a wiki.\n\n@Tsahi that might be the case with some languages, I usually prefer any English resource to German ones. That said it seems like there is a decent percentage of Japanese that prefer their own language (they are after all more used to it) even if they know English and therefore also write books and other resources in Japanese for their fellow developers. There are afaik many big conferences about programming in Japan that are being done in Japanese. (Most big conferences in Germany and Europe on the other hand seem to be held in English). There are also a lot of books, websites and other sources. Matz the Ruby creator got his blog on Japanese, there is a book about Qt5 in Japanese (or Chinese... I don't know it enough to clearly say) but none in English. That's just some stuff I remember from random googling I do now and then. Not knowing English or prefering your own language even if you know English doesn't have anything to do if you're a decent programmer or not."}, {"author_name": "Al", "gravatar_hash": "78eabf31eb20f8146f66df1dd2fa568c", "author_url": null, "date": "Dec 16, 2014", "message": "The problem everyone seems terrified of seems like an easy one to solve.\n\nOkay, worst-case scenario: I'm coding in ACMEcorp Superlanguage, and there's not much info about it. I get stuck. I search, and find nothing. I ask on SO.com (in English), and no-one answers. Little do I know that Japan is full of world-class ACMEcorp Superlanguage experts who prefer to use SO.jp. My question was already asked and answered on SO.jp in Japanese - but I'll never know.\n\nThis is the worst-case scenario - and it's totally a solvable problem.\n\nHow about some kind of system which does the following: On request (maybe it costs 5 rep to do, since it'd be quite resource intensive), SO's server takes the body of my question, machine-translates it, and pushes the original and machine-translation through other language SO sites' \"related content\" feature, finding other-language content with similar keywords. \n\nIf it finds matches above a certain threshold, it gives me a list. \"These questions in other languages might be relevant. We accept no responsibility for any consequences of poor machine translation\". \n\nThen I can look at the dodgy machine translations. Most will be irrelevant, wading through will be hard work, and there will be some silly ones where technical terms get translated, but if just one contains the insight I'm looking for, it'll be time well spent. \n\nI can then answer my own question in my own language, and BOOM - suddenly we've got quality content in both languages.\n\nFar from pushing content out of the SO family, we're taking expertise that currently lives on Japanese (and Brazilian, etc etc) forums, and making it more accessible to SO users. \n\nThere's work involved - but that's fine, because the person who needs to do that work (the person who asked the question) has the motivation to do it."}, {"author_name": "Hsin Desu", "gravatar_hash": "e0b1f01fe79c7249823c962f95b202bb", "author_url": null, "date": "Dec 16, 2014", "message": "@Tsahi, it is a ridiculous assumption to say that a one needs to learn English in order to be a good programmer. A programming language is a computer language; it is not the English language. And there are plenty of blogs and literature on programming in other languages. Just because you don't understand or haven't seen any good literature does not mean they don't exist.\n\nAnd on fragmentation--knowledge is already fragmented throughout the internet, but now the fragmentation can be concentrated into SO, and more or less curated by the community.\n\nA library with many books in many languages not only provides insight on the same subject through another perspective (via language/culture), it also creates a potential for a greater library because all that information isn't scattered across the land. So there may be some initial fragmentation, but it'll come together when there is a will and desire to do so, and when there is, there will be a place to do so.\n\nAnd for those of you who care only for English content: either learn another language, or just keep using what you have always been using in English--isn't that simple enough? Why is there a sense of entitlement to have everything written in a language that, conveniently, you understand?\n\nEnglish is my second language, and Japanese my third, but you would never see me complain about an SO branch in Hindi.\n\nJussayin'"}, {"author_name": "Derek", "gravatar_hash": "d6fab176b3d9d3026ee3eec2dba19fbe", "author_url": null, "date": "Dec 16, 2014", "message": "People here saying \"oh more fragmentation of the site\" like everyone in the world lives in America and speaks English... Let's think of the opposite, why don't we turn the whole site into Japaneses only and let English users use it and see what happens?"}, {"author_name": "Rickster", "gravatar_hash": "8cf91f10c800d760b2482760b063a30f", "author_url": null, "date": "Dec 16, 2014", "message": "&gt; And more than 600,000 of people of the Soviet Union have been accessed from Japan.\n\nObligatory Yakov Smirnoff joke incoming..."}, {"author_name": "Chris", "gravatar_hash": "3038142cea42b76065fd0e9462d6e210", "author_url": null, "date": "Dec 16, 2014", "message": "@Hsin Desu \"So there may be some initial fragmentation, but it’ll come together when there is a will and desire to do so, and when there is, there will be a place to do so.\".\n\nNo, it won't get better. They are separated sites with no relationship besides the name. It isn't even possible to link the same question in different languages. That's the least I'm demanding for. It would start a competition to translate high-quality questions and answers to get easy reputation."}, {"author_name": "MER", "gravatar_hash": "590beb461e1b18295b3f99cd484fd501", "author_url": null, "date": "Dec 16, 2014", "message": "So, doesn't this point out a weakness in the general Stack Exchange approach?\n\nWhile I love Stack Exchange and Stack Overflow specifically for it's enormous value to me as a programmer, it isn't perfect.\n\nPROPOSAL (which will be ignored by nearly everyone and probably hated by those who don't ignore it):\n1. Store all text in a central data base (well clustered DBs) in a unicode format (it's probably already stored unicode so this shouldn't be hard)\n2. Publish questions on all different language versions of the sites (we now get non-native english speakers publishing on standard stack overflow and, while it's not ideal wording, the questions ARE often valuable, and those of us who are fluent in English typically fix them up as best we can...)\n3. Edits to the questions should stay specific to the language specific site (a reasonably simple data structure could be created to always keep the original question and then have language specific versions of it tie back to the same question)\n4. High ranked answers would also be centrally saved &amp; distributed across the different language versions of a site\n5. Possibly provide a central reputation system to average out across the feedback they receive across the sites\n6. Fix the Reputation system so it scales better \n-(decrease rewards for answers that already have a certain number of up votes and/or that are answers to questions that are marked as duplicates of other questions) \n-(increase rewards for high ranking members for things that are more valuable for high ranking members to do, specifically things that guide other members in producing better answers and questions... such as commenting &amp; less reward for answering)\n-(give initial rewards to low ranking members for basic things like asking their first question, the first up vote they give, their first comment, even reading their first answer... basically lower the barrier to entry for new members, but raise it for becoming high ranking, we want to avoid people gaming the system as is often done now to get 1000s of reputation points at the expense of the overall system)\n-(programmatically identify duplicate 'candidates' instead of relying solely on humans... additionally, stop fighting duplicates so vehemently... they are not destroying stack exchange they spread out answers so they may or may not be as valuable but different people ask the same question differently which is a GOOD thing for people looking for an answer)"}, {"author_name": "nin", "gravatar_hash": "3ea8a6cc427e284e0bcf6e6008638b79", "author_url": null, "date": "Dec 16, 2014", "message": "@Rickster\n\nIn Soviet Russia, websites access people."}, {"author_name": "GoogleTranslate", "gravatar_hash": "cbede50c0d1034b1b4453b2d426542e7", "author_url": null, "date": "Dec 16, 2014", "message": "all your base are belong to us"}, {"author_name": "ImpromptuParade", "gravatar_hash": "c2409c284bd3735926a7efd0aa304a3e", "author_url": null, "date": "Dec 16, 2014", "message": "Wow. People on the internet will argue about *anything*.\n\n<blockquote>I DISAGREE! --Ed.</blockquote>"}, {"author_name": "Luis", "gravatar_hash": "5abc043cf72aec35744114e100a78510", "author_url": "http://github.com", "date": "Dec 16, 2014", "message": "I would like to see StackOverflow in kichwa. It would be quite interesting."}, {"author_name": "Rami", "gravatar_hash": "9d6e1795705b314d834c768623e62a3d", "author_url": null, "date": "Dec 16, 2014", "message": "@Ed : Your argument is basically, we'd better have nothing than have something partly useful. \n\n@Raphael : You assume that MOST of the questions are alien. I wouldn't tell you that the rules of a standard question is that the question should be detailed and precise, but I will just tell you, why don't you translate everything as is ? If you don't understand the english version, why don't you let others try to get it from a different language? \n\n\nSo when I said extremists, i meant\n1- people who say everyone should learn english.\n2- SO team who prefer putting a big barrier between each language community\n\n\none more thing, yeah a lot of people joked about it up there, but unless your plan is to open a SO website for every language on earth  (please tell me you will), it's offensive to open a website for japanese and not in my local dialect! That's just ignoring people speaking my dialect because they are not a lot and they don't get you money.\n\n\nCongratulations to the japanese people though for having an awesome website. Just wanted to throw my 10 cents criticizing a SO team decision and trying to get both extremes together for a succesful INTERNATIONAL community."}, {"author_name": "ONLY IN ENGLISH PLEASE!", "gravatar_hash": "b89943f2998b49a6025bcd82010e5895", "author_url": null, "date": "Dec 16, 2014", "message": "Why have the same question and answer in different languages? My native language is spanish but i think that having stackoverflow in several languages isn´t necessary!"}, {"author_name": "Victor", "gravatar_hash": "526d2a72f963ccc832e565e7e1043e9b", "author_url": null, "date": "Dec 16, 2014", "message": "Why so many people still insists with that \"translate questions and answers\" stupidity?\n\nThat is not the intention here. The intent is not to get english questions translated to whatever language, but is to be able to write questions and answers in a suitable language for that.\n\nNo one need to translate the best questions or best answers or something like that. Because this do not solves (or gives any help whatsoever) the main problem: POST questions and answers.\n\nAnd then some people say: Everyone should learn English. Even if a C or Java code does not really resembles anything similar to English. Further, the purpose of StackOverflow is to help people. And the people who need the most help are beginners, many of them have serious difficulty with english and couldn't participate this way."}, {"author_name": "Victor", "gravatar_hash": "526d2a72f963ccc832e565e7e1043e9b", "author_url": null, "date": "Dec 16, 2014", "message": "And there are some people complaining about some fragmentation. My main objection against that is: \"so what?\". In fact I don't see how this is practice lead to fragmentation. People who don't talk or are not confortable with English would not use the english site anyway and people who are already uses. Most of the content that is posted on a non-english site is very unlikely to had been posted if the site was on english, so the language issue rarely is causing any important fragmentation.\n\nIn Portuguese StackOverflow, I already saw that this is no issue. It works beautifully, and IMO it is better than the original SO. And it is helpful to a lot of people in many ways that would be impossible in the english StackOverflow."}, {"author_name": "Adam Jensen", "gravatar_hash": "39ad4f543fd78b73a8b05d6859a86f51", "author_url": null, "date": "Dec 16, 2014", "message": "As long as it doesn't become another site that assumes that I want Japanese content just because I am in Japan (at least reference my browser's language settings).\n\nSo many times have I googled something in English, got a preview of some page in English, clicked a link to be greeted by a machine translation, Chrome asking me if I want to translate the page into English, followed by having to look for the language settings (which aren't always obvious, as in order to have English content, sometimes, I have to pretend that my \"location\" is \"US\").\n\nPlease don't do that."}, {"author_name": "Sawk", "gravatar_hash": "ea2ee4d05894cefa2a528db83b932d63", "author_url": null, "date": "Dec 16, 2014", "message": "Before going further, I would just like to point out that I am a foreigner living in Japan, working in a Japanese company and English isn't my native language.\n\nLike some people said above, it is difficult for Japanese people to learn English, probably harder than for us European, however if I was able to learn Japanese and be able to work in a Japanese work environment (meaning all the specification and so on in Japanese) I do think they are also able to do the same, so the argument saying it's too difficult isn't valid from my point of view.\n\nLike it or not, the quantity and quality of the document related to IT in general are in English. I do understand people love their language and do not want to use something else, as I do, but unfortunately we have to sometime use English. As said above the documentation are usually (not always, but in general) more complete in English and sometimes for some specific library only in English.\n\nNow, concerning having SO in a separated, most of the Japanese don't even check SO there, I am working in one big Japanese IT company with services launched in other country. A good 80% of the engineers here can not speak or write English at all, and a good 50% can not read/understand a complex documentation in English. Having SO in Japanese is maybe a good thing, maybe a bad thing future will tell us but I wouldn't expect much knowledge sharing between Japanese and English version of the SO, you will maybe have few topic sharing resource but Japanese will stay on the Japanese version. \n\nThis is also a cultural problem you are facing, not only a language problem. They usually tend stay in the same group (as all people in the same group, but here even more valid) and do not really participate in general as actively as other country to international content. Keep in mind this is a general idea so relate a majority but not everybody, you might have some specific case.\n\nSorry for the wall of text, tried to make it short but there is quite a bunch to say."}, {"author_name": "ラファエル (Raphael)", "gravatar_hash": "e5f3d257f7ac7cb7253c3c7f53cf3477", "author_url": "https://stackoverflow.com/users/1942027/", "date": "Dec 16, 2014", "message": "@Sawk I feel like your second paragraph is about my previous comment stating that Japanese is one of the hardest languages to learn for English speakers, so let me clarify a bit.\n\nI did in no way mean that it's too difficult! My point was that Japanese is way different than English, way more so than other languages. And that it probably takes way more effort and time for them to learn English than it would for someone from a western country that got a language that's closer to English. We shouldn't think that one needs to be decent in English to be a decent developer and I welcome it as a help to Japanese developers.\n\nAlso for the sharing part, I don't think it's a problem. Even if they don't participate in the English version. The people that already participated probably will continue to do so, also it might easy the entry for some to start participating on the English version. For the majority though I also expect that they'll keep to their site.\n\nFor those being concerned about a separation, honestly I think that's a non issue. The majority of those were already using their own Japanese resources anyway.\n\n---------------------\n\nSince I posted so much here I'll also put that I'm from Germany, but I'm planning to start learning Japanese as a 4th language on my own soon. (Out of interest in the country, culture and history). I'm also generally for anything easing the access to information and really like SO going that way, it's my main reason for commenting so much here. (Sorry for the wall of text)"}, {"author_name": "名前無し", "gravatar_hash": "261cbacd9fc6590361d178e5f2860bd1", "author_url": null, "date": "Dec 16, 2014", "message": "I'm a native English speaker working in Japan and find it to be welcome. When speaking about programming, it is always in Japanese and I find it difficult myself to translate things back into English at times."}, {"author_name": "doublecompile", "gravatar_hash": "659fc48f331687e20a9ed0a1597f39b1", "author_url": null, "date": "Dec 16, 2014", "message": "You know, as of 2014-12-17, the style.css has a typo in the font-family rule for the body tag:\n\nfont-family: \"Helvetica Neue\",Helvetica,Arial,Sans-seris;\n\n\"Sans-seris?\" Awesome. This is causing half the characters on my screen to render poorly. Using Firebug to correct this to sans-serif did the trick. \n\nSomebody should really fix that CSS file."}, {"author_name": "노영선", "gravatar_hash": "2fd6831f047d384983f66cd6d559046c", "author_url": null, "date": "Dec 16, 2014", "message": "サイト開設おめでとうございます！\nGoogle Translateが起こっ - &gt;韓国語翻訳は、よくしてくれますね。\n逆もよくでしょうか？翻訳で日本語を作ってあげます^^\n- SO in Koreanを推進している韓国語のユーザー"}, {"author_name": "明", "gravatar_hash": "0fd1df57eb01d21fad11114529a141c8", "author_url": null, "date": "Dec 17, 2014", "message": "This is bad. Decentralizing SO will be proven disastrous. Trust me."}, {"author_name": "RealSkeptic", "gravatar_hash": "f0af08577947c3a20cfa265ea7171c03", "author_url": null, "date": "Dec 17, 2014", "message": "One of my (non-Japanese) friends has already successfully posted an answer on that side (it was accepted!). Mind you, his wife studies Japanese and the question was rather obvious from the code with a little help.\n\nBut this is very tempting... I've been studying Japanese for 8 years now, in my free time, and could combine my hobby with my professional skills there.\n\nSo I have two questions:\n\n(1) How welcome are westerners there, who write imperfect Japanese but (supposedly) good answers, professionally speaking?\n\n(2) How welcome is referring people to answers in the main site?"}, {"author_name": "Raphi", "gravatar_hash": "4b7ca19fe7022b6d4572a864e3dceddc", "author_url": null, "date": "Dec 17, 2014", "message": "Why don't we just have one Stackoverflow in Esperanto, and be done with it??"}, {"author_name": "Thomas", "gravatar_hash": "ac278f2455c71b11cd8f25ede37a32ae", "author_url": null, "date": "Dec 17, 2014", "message": "I don't think it is a good idea to start having SO in different languages. It probably makes sense for other SE sites, but SO is mainly programming and this may sound rude, but if you are a programmer you need to be able to read and write in English. Every API and public library which is widely used is in English. America may have lost the top spot in economic power to China, but English is still the most important language in IT and business."}, {"author_name": "snot waffle", "gravatar_hash": "ecaf2646e6fd5d2a203dd9ec82e4e22d", "author_url": "http://www.syntarsus.co.uk/", "date": "Dec 17, 2014", "message": "Babelfish.com says: \nStack Overflow was founded in 2008, the purpose was it together all answers questions related to programming, to provide them.\n\nTo check for yourself whether or not valid answers on your own valuable time programmers themselves prior to the birth of Stack Overflow, you find answers in multiple blogs, bulletin boards and newsgroups, but did not. Now, Stack Overflow is 70. (English)\n\nGoogle translate says: \n\nThe purpose of Stack Overflow has been founded in 2008, it put together all of the answers to questions about programming, was to create a place to provide them. Stack Overflow birth earlier, the programmers themselves use the valuable time of its own, multiple blogs, did on find answers in the bulletin boards and news groups, you can only check whether or not the answer is valid on its own was.\n\nCurrently, Stack Overflow 70\n\nThat speaks for itself, IMO."}, {"author_name": "snot waffle", "gravatar_hash": "ecaf2646e6fd5d2a203dd9ec82e4e22d", "author_url": "http://www.syntarsus.co.uk/", "date": "Dec 17, 2014", "message": "Naysayers in a nutshell:\n\n[!Speak English or GTFO!](http://4.bp.blogspot.com/-RUrzXif2r7I/UKuwWvmC-8I/AAAAAAAAAJ8/AJF0o5DgX_s/s1600/learn-to-speak-english-main_Full.jpg)"}, {"author_name": "Stéphane Bruckert", "gravatar_hash": "aa56a00a9f9ee1f6a72376071da280f0", "author_url": "http://stephanebruckert.com", "date": "Dec 17, 2014", "message": "Even though I *was* against the creation of a Portuguese Stackoverflow, I am up for a Japanese version of Stackoverflow. As soon as it doesn't change anything for \"us\", why not? \n\nThe only thing I dislike, is how this is mostly just going to be a copy/paste/translate game."}, {"author_name": "Miki", "gravatar_hash": "b4d02dc91d4623865c3f2994f52006b8", "author_url": null, "date": "Dec 17, 2014", "message": "@snot waffle: I do love how the most common reaction to people having reservations about creating other-language variants of SO boils down, to paraphrase your \"nutshell\", to \"LOL STFU you stupid American exclusionary rednecks!!11!\", even when the people in question are clearly neither USians nor even English native speakers."}, {"author_name": "erickson", "gravatar_hash": "ffbf4e85b8ffbae4e9039b9c0cf07bc8", "author_url": "http://stackoverflow.com/users/3474/erickson", "date": "Dec 17, 2014", "message": "Here's my attempt, greatly assisted by a mechanical babelfish:\n\nIn 2008, Stack Overflow was established with the goal of assembling the answers to all programming questions, and creating a place to provide them. Before the birth of Stack Overflow, programmers had to use their own valuable time, searching many blogs, bulletin boards, newsgroups, and elsewhere, and then checking whether the answers were right.\n\nToday, Stack Overflow supports 44 million programmers monthly with more than 7 million questions. Of these, over 600,000 are visiting from Japan. Even though Stack Overflow is an English site, it has become an indispensible tool for resolving the programming problems of Japanese programmers.\n \nWelcome to Stack Overflow Japanese Edition\n==========================================\n\n(Screenshot)\n\nThere are over 1 million programmers in Japan.\n\nWith the birth of Stack Overflow Japanese Edition, you no longer need to fight with English while trying to solve a programming problem.\n\nOn December 2, 2014, Private Beta for Stack Overflow Japanese Edition began, attracting over 1000 users weekly and over 100 individual questions. And now, it is open to all the programmers of Japan.\nTogether, let's make a Japanese resource just like Stack Overflow English Edition.\n\nLet's encourage Japanese programmers\n====================================\n\nFrom now on, it will be possible to post questions and answers in Japanese. The question posted today will help the Japanese programmer of the future. This is a chance to gather Japan's programming expertise and level up everyone's knowledge!\n\nStack Overflow is a site for everyone\n=====================================\n\nStack Overflow belongs to the community. Participants can indicate the most effective questions and answers by voting and, with authority,  edit and manage posts. And, within this community, site improvements can be freely discussed on Meta. The community is already discussing what to do with question lists and link-only answers.\n\nThis site aims to be the best Japanese-language site for programming Q&amp;A. Let's build it together!"}, {"author_name": "KasiyA", "gravatar_hash": "e207af0624ce6ea680d7b2e8c374f50e", "author_url": null, "date": "Dec 17, 2014", "message": "Do we have a popular Japanese-language syntax for programming?"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Dec 17, 2014", "message": "\"I humbly invite you to read the rest of this post using the mechanical babelfish of your choice, and see if you think such tools can be relied on for important work…\"\n\nCocky aren't we?"}, {"author_name": "system PAUSE", "gravatar_hash": "f979d6d83d40b10d9ad43bdfc51cb1de", "author_url": null, "date": "Dec 17, 2014", "message": "This is the world wide web and it is built on a thing called hypertext. Multiple languages? Cool, that's the \"world\" part. But don't forget about hypertext.\n\nPlease, make sure that questions and answers can be linked easily across the different language sites. If someone asks a question in Japanese that is essentially a duplicate of an existing English question, linking the two questions will allow Japanese speakers (who might understand *some* English, or at least be able to read code snippets) to get immediate value from past answers, without waiting for new answers and without waiting for translation. Although such links would also aid translators."}, {"author_name": "Victor", "gravatar_hash": "526d2a72f963ccc832e565e7e1043e9b", "author_url": null, "date": "Dec 17, 2014", "message": "@KasiyA\n\nYes, we have. It is called Ruby. :)\n\nAnyway, what is the relevance of your question?\n\n@system PAUSE\n\nThis is no problem. People just post links in questions and answers as already happens for at least one year in portuguese Stack Overflow. Second, why on the hell do you think that there would be translators? Part of the idea is exactly to not have or need them."}, {"author_name": "vance", "gravatar_hash": "0ce2009a136b1bd7b91e31ba7115586e", "author_url": "http://www.foreverscape.com", "date": "Dec 17, 2014", "message": "Why not just make it wiki-esque like posts are in the first place. Show languages would tab through languages and people could add translations as time allows. \n\nconversely if you posted a question in japanese, you could go to the english tab and put a machine translation in first, then users could correct it over time."}, {"author_name": "daveloyall", "gravatar_hash": "e646ae5011e510d929a72bdbd8f7eafb", "author_url": null, "date": "Dec 17, 2014", "message": "To the various folks complaining about fragmentation: please update your mental models.  Fragmentation already exists in the real world.  SE isn't the the position to reduce or increase it."}, {"author_name": "NewAlexandria", "gravatar_hash": "215a2738f720d3bd0270ed768ef50841", "author_url": "http://www.newalexandria.org", "date": "Dec 17, 2014", "message": "Can we have an option to turn-on results in other languages?  This would help if we do a specific search, and get few results.  Answers may exist elsewhere.  In the comments, here, both @AI and @ラファエル (Raphael) have supported the same.\n\nI understand that this benefit is hampered by machine translation of our wording.  My hope is that most search terms will be technical and [more easily] cross languages."}, {"author_name": "Jeremy", "gravatar_hash": "4c8a9bec5a27b66b28d3c5cddeb70e93", "author_url": null, "date": "Dec 17, 2014", "message": "Yookoso nihonjin! Stack Overflow ha honto ni sugoi desu!"}, {"author_name": "Yotam", "gravatar_hash": "9da1bebfbc4a216a9e4a5126357516d9", "author_url": "http://netyou.co.il", "date": "Dec 18, 2014", "message": "So, what other languages are available?"}, {"author_name": "Alex", "gravatar_hash": "d5fa3671bcf8ea3c553c28ca5f920709", "author_url": null, "date": "Dec 18, 2014", "message": "This could be the first step towards a multilingual stack exchange. Where every site is available in every language. There shouldn't be a language version of stackoverflow, instead stackoverflow should have built in support for different languages and a workflow for translating into all of those languages.\n\nWith the help of translation, both machine and human, the knowledge that non English speakers have can be shared with English speakers and vice versa."}, {"author_name": "Adriano Repetti", "gravatar_hash": "6a5304f7229e47941e1cf3229b3475af", "author_url": null, "date": "Dec 18, 2014", "message": "Let's follow Wikipedia example...unfortunately it's something different and more _static_.\n\nImagine to have SO in 20 languages, each language has a decent active community. Where do you ask? Of course in SO for your own language and you may go to English SO only if you do not find an answer. \n\n&gt;&gt;&gt; Questions per day on SO? -70% &lt;&lt;&lt;\n\nKnowledge base is still there, unfortunately it&#039;s available in Japanese (language I love but I don&#039;t speak), in Spanish, French and so on...if everything is in English (note I&#039;m not a native speaker) then it&#039;s available to EVERYONE, if it&#039;s in Japanese it&#039;ll be available to Japanese only."}, {"author_name": "Miki", "gravatar_hash": "b4d02dc91d4623865c3f2994f52006b8", "author_url": null, "date": "Dec 18, 2014", "message": "@daveloyall: that's one of the most misdirected Reverse Arguments of the Beard I ever saw. \n\nDisregarding the inherent logical fallacy, well, I don't know how how long since you came out of your time machine, but in our future era of late AD 2014 *SE has already proven itself extremely able to reduce fragmentation across various social boundaries*.\n\n----\nI must say I like the hyper-linking proposals of various folks. This would be an excellent crutch for the current technological deficiencies. Unfortunately, it's hard to get right, which might be a reason of it not existing yet.\n\nOne more thing: in the long run, I feel this was inevitable anyway, as localized clones of SE sites are already popping up. Better to control the process here, than oversleep and let it loose - which would, indeed, result in a net loss of community cohesiveness."}, {"author_name": "Ruffin", "gravatar_hash": "8ed4bc18193c194d998d549dabb85b5b", "author_url": "http://myfreakinname.blogspot.com", "date": "Dec 18, 2014", "message": "私、1のために、私たちの新しいロボット君主のための歓迎翻訳テキスト。"}, {"author_name": "Luis", "gravatar_hash": "5abc043cf72aec35744114e100a78510", "author_url": "http://github.com", "date": "Dec 18, 2014", "message": "Take this list from wikipedia - Amount of people speaking each language.\n\nhttp://en.wikipedia.org/wiki/List_of_languages_by_total_number_of_speakers\n\nAs I see it, there's an inconsistency here. Spanish speakers are more (in countries and amount) than japanese speakers.\n\nThe Spanish SO site should be open (it is still in area51 proposal state) OR (and/or) the japanese and portuguese SO sites should be closed and merged. Having them in the current way is a total nonsense (and, only considering the three facts simultaneously, a display of contempt from the english-speaking community towards the spanish speaking community)."}, {"author_name": "ラファエル (Raphael)", "gravatar_hash": "e5f3d257f7ac7cb7253c3c7f53cf3477", "author_url": "https://stackoverflow.com/users/1942027/%E3%83%A9%E3%83%95%E3%82%A1%E3%82%A8%E3%83%AB", "date": "Dec 18, 2014", "message": "@Luis I don't see why the Japanese/Portuguese SO sites should be closed simply because there are more Spanish speakers... those things aren't related with each other.\n\nAlso the start of localized sites depend on the demand here on SO, not some number of speakers.\n\nLastly you're misinterpreting the situation a bit. [The proposal for the spanish version](https://area51.stackexchange.com/proposals/42810/stack-overflow-in-spanish) finished the commitment stage and is waiting for the beta to start. The first question there is about missing international features and as it seems the only thing left to do is that SO is still [hiring a Spanish community manager](https://meta.stackoverflow.com/questions/271998/fluent-in-spanish-were-hiring-a-community-manager-for-a-spanish-stack-overflow) at the moment. That means it's just a matter of time and it's on the way already.\n\nNow for a bit of a time frame, they started the hiring process for a Japanese community manager last year in September, so it took a bit over a year . It seems like they only started the hiring process for a Spanish one about 2 months ago. Expect some time until they got the right person, got him set for the job... I'd imagine the whole process for the Japanese community manager would be longer though due to the huge language differences, so see the time it took for them as a kind of upper limit."}, {"author_name": "cdsandrade", "gravatar_hash": "31a0dbdf02b4e1552099acfe3d5907e9", "author_url": null, "date": "Dec 18, 2014", "message": "Some people here mentioned the Wikipedia model, which is a good one. I'd suggest allowing users to contribute translations of existing questions/answers, it could allow new users (like me) with a means of obtaining some rep. :)"}, {"author_name": "Dan Dascalescu", "gravatar_hash": "fb5e3a539b1e23c54b080b6d12b411c2", "author_url": "http://wiki.dandascalescu.com/essays/english-universal-language", "date": "Dec 18, 2014", "message": "So sad to see StackOverflow, a *PROGRAMMING* Q&amp;A site, split into separate communities based on a superficial issue like what native language people speak, when - LET'S BE HONEST - all programmers need to speak some basic level of English.\n\nAs StackOverflow founder Jeff Atwood said,\nhttp://blog.codinghorror.com/the-ugly-american-programmer/\nSTFU and learn English."}, {"author_name": "user2284570", "gravatar_hash": "58527d85734c6877ab6f3af844741ee8", "author_url": null, "date": "Dec 19, 2014", "message": "Babel effect:\n\nThe problem isn't when a site is created in a native language. The problem come when someone is Googling for an information and they don’t speak the language of the SO site where the information is stored. This append for English, but it will append more for non-english language. Currently When I look for an information, I search it using Deutche; French; or English keywords. But I’m stuck if the information is in another language. It is because translators aren't advanced enough there’s  a problem : **There’s no search engine which will translate the keywords for returning results in every available language!** One of the aim of SO was precisely to create ***real*** content for search engines.\n\n\nSo, when I read\n\"`@TLama In what way does the existence of Stack Overflow in japanese deepen the barrier for a japanese-speaking developer who is not fluent in english? He was going to other sites in japanese anyway!`\"\n\nIt is true. The barrier isn’t deepen for the peoples who don’t speak English, it is deepen for the peoples who don’t speak Japanese; Spanish and French. So this is not even the matter of learning one another language, this is the matter of learning thousands instead of just one or two."}, {"author_name": "ラファエル (Raphael)", "gravatar_hash": "e5f3d257f7ac7cb7253c3c7f53cf3477", "author_url": "https://stackoverflow.com/users/1942027/%E3%83%A9%E3%83%95%E3%82%A1%E3%82%A8%E3%83%AB", "date": "Dec 19, 2014", "message": "@Dan so I see you wanna trump my walls of text.\n\n\tSo sad to see StackOverflow, a *PROGRAMMING* Q&amp;A site, split into separate communities based on a superficial issue like what native language people speak, when – LET’S BE HONEST – all programmers need to speak some basic level of English.\n\n\tAs StackOverflow founder Jeff Atwood said,\n\thttp://blog.codinghorror.com/the-ugly-american-programmer/\n\tSTFU and learn English.\n\nYes, I've read both Jeff's blog post and your linked essay. I can also understand Jeff's point and partly agree with it (not fully though). You on the other hand bring some highly controversial arguments that I can't support or agree with.\n\nAs for the 'superficial issues', I don't see how they are superficial. On the other hand the arguments of the opposers seem to be the ones bringing superficial arguments like fragmentation and that every decent programmer needs to know English (how is that one even an argument worth considering?).\n\nI've written enough wall of text comments here already and don't really want to write a long essay, so just look at the feedback people gave on the hiring thread for the Spanish community manager, it's really mostly positive. https://meta.stackoverflow.com/questions/271998/fluent-in-spanish-were-hiring-a-community-manager-for-a-spanish-stack-overflow#comment97680_272052\n\nAs for everyone learning English. I'm in support of everyone learning English in school and being able to understand it, but forcing people to speak it? Hell no. Also think about usability, some people even though they can read and write English without any problems prefer to ask questions in their native language. English just doesn't feel comfortable for them.\n\nLet's bring Yukihiro Matsumoto (also known as Matz, he's the inventor of Ruby) and Ruby as an example. Matz knows English and has given several talks in English but yet he still got his programming blog in Japanese. Those are also people being targeted by the new site. So far for the argument that every decent programmer has to know English, some know it but just prefer their native language and I'd argue Matz is a more than decent programmer.\n\nAs for most information being available in English and non-English information being bad, the first **public** release of ruby was in 1995 and by 2000 it was more popular than Python in Japan. The first English mailing list was created in 1999 but it took until 2002 for it to get as much messages as it's Japanese counter part (even though people from everywhere around the world could use it instead of just Japanese people). It actually took until Ruby 1.8 and 2003/2004 to get good documentation and books in English.\n\nThat said we now got decent information about it in English available but there's also a massive Japanese community with wealth of information still, as one example Matz's own blog."}, {"author_name": "ラファエル (Raphael)", "gravatar_hash": "e5f3d257f7ac7cb7253c3c7f53cf3477", "author_url": "https://stackoverflow.com/users/1942027/%E3%83%A9%E3%83%95%E3%82%A1%E3%82%A8%E3%83%AB", "date": "Dec 19, 2014", "message": "@user2284570\n\nhow so? Using google.com you'd still get the English SO results and it won't do you any harm. Or are you getting any answers about programming problems from Japanese/Portuguese forums right now? Those arguments are completely made up in my opinion. Those sites do no harm for the users of SOen but bring a lot of advantages to others who can't/don't want to use the English site."}, {"author_name": "Subham", "gravatar_hash": "885366b5df79cfc1be1ac0db52d8208b", "author_url": "http://javahungry.blogspot.com", "date": "Dec 19, 2014", "message": "Great to see stackoverflow is targeting non english audiences. Seriously the amount of effort you guys put in and the way you organize the threads in the stackoverflow is really appreciating .\nI dont know what will happen to the developers if stack overflow does  not exist . Thanks for the wonderful effort and scaling the stackoverflow community ."}, {"author_name": "user2284570", "gravatar_hash": "58527d85734c6877ab6f3af844741ee8", "author_url": null, "date": "Dec 19, 2014", "message": "@ラファエル (Raphael)\n\nYou simply didn't understood. The second problem is I won’t get them in Japanese/Portuguese because search engines doesn’t translate keywords, and the result which would have been written in English would be written in another language which might be spoken by fewer peoples than those who speak English (yes, Chinese is OK in that way).\n\nIt solve the problem for those who don’t speak English, but it break far more users who doesn't speak hundreds languages."}, {"author_name": "dns ayarları", "gravatar_hash": "5c35392ce7b66bf502d76856cd7d0323", "author_url": "http://blog.proxtik.com/dns-ayarlari/", "date": "Dec 27, 2014", "message": "Thanks, this is awesome in its best. :-)"}, {"author_name": "aaa", "gravatar_hash": "e7eb71a31147da58333a99f88c91e149", "author_url": "http://www.broadintechencomplyt.com", "date": "Jan 12, 2015", "message": "I do not even understand how I stopped up right here, but I thought this post was great.\nI do not know who you're but definitely you are going to \na famous blogger if you happen to aren't already.\n\nCheers!"}, {"author_name": "Youtube.Com", "gravatar_hash": "4e131e7efb96ac04a6e144564874f755", "author_url": "https://www.youtube.com/watch?v=hpW5tF2U1Lo", "date": "Jan 13, 2015", "message": "Wonderful web site. A lot of useful information here.\nI am sending it to several buddies ans also sharing in delicious.\n\nAnd obviously, thanks to your sweat!"}]}