{"response": [{"author_name": "David McGraw", "gravatar_hash": "840264c45b706fb829d406e9c61a1889", "author_url": "http://www.david-mcgraw.com", "date": "Aug 20, 2008", "message": "I haven't listened, yet.\n\nWhy don't you guys have a tick mark for each entry that denotes if the post is a \"Question\" or a \"Discussion\" post? You'll have the both arenas without the problems.\n\nQuestions have the same rating styles.\n\nDiscussions have the rating for the author, but nothing for the posters. Possibly a 'participation' point(s) for writing more than x words."}, {"author_name": "David McGraw", "gravatar_hash": "840264c45b706fb829d406e9c61a1889", "author_url": "http://www.david-mcgraw.com", "date": "Aug 20, 2008", "message": "There's little you can do to prevent people from trying to discuss something within a 'question' type post without deleting the post, and nobody should go that far.  Just keep them on the bottom.\n\nBut I think having 'discussion' posts might promote less discussion in the wrong area."}, {"author_name": "Bernard", "gravatar_hash": "af29baa43e6e6f77180e631cea686847", "author_url": null, "date": "Aug 20, 2008", "message": "Excellent. I always really enjoy these podcasts. \n\nI personally think the real test for Stack Overflow will be when you go out of beta, and get a flood of people asking for help with assignments (or rather, asking for help with horribly contrived questions that could only be assignments). But if that can be handled, wish I am confident it will, you're gonna have a real winner on your hands.\n\nBest of luck! :)"}, {"author_name": "Jason Shoulders", "gravatar_hash": "bf91240ef917fdf3168250b6bd081e8f", "author_url": "http://www.JasonComedy.com", "date": "Aug 20, 2008", "message": "I've been able to use the Beta for a couple of days. I'm quite impressed. It appears to work as advertised very well. I'll read a question and work on an answer and usually someone beats me to it. Questions get answered quickly. That would be admirable on a PUBLIC site, but especially a BETA. Hopefully it's the site, reputation, and badge system that is bringing that out and not a flash in the pan phenomenon.\n\nI was member # 1780 and I think they said over 3000 have received invitations. I'm not sure how much more they want to finish before they go public or how much more stressful the load will get once the site goes live, but I am looking forward to it because right now the member load seems pretty sophisticated and most of the questions seem very focused and difficult. It's hard to find an unanswered, easy question, which is a good thing. But, I think it's also a reflection of the user base, too. The site will become more fun and useful once we get a wider range of users of all skill levels whereas now there's a bias towards experts.\n\nFrom listening to the podcast, it sounds like Joel needs to spend more time on the site :D"}, {"author_name": "pacifika", "gravatar_hash": "42786a4364f7fe5b27371e84f2bee8fa", "author_url": "http://amasan.co.uk", "date": "Aug 21, 2008", "message": "Why is stackoverflow so hang up on the rep system. I think only a small percentage would use the system to achieve rep points that are of no use. Expecting people not to do something because they get no rep doesn't make sense to me as it's very easy to use stackoverflow a lot without rep / looking at rep / thinking about rep?"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": null, "date": "Aug 21, 2008", "message": "Is that Jeff in the johnny_vegas photo?\n\nhttp://forums.fark.com/cgi/fark/comments.pl?IDLink=3817090"}, {"author_name": "Ethan", "gravatar_hash": "9f51af06622a82a4552848218387a235", "author_url": null, "date": "Aug 21, 2008", "message": "Around 15 min. in podcast you discuss the difficulty in getting 2000 points. Seems like you should do something like...superusers can make other people superusers, or people can give others up to a certain % points. Example, if I have 2000 points, I would be able to deal out 500 to anyone I want. If I am trusted then I should be trusted to quickly help others achieve more trusted status. Hope this makes sense :)"}, {"author_name": "Arron", "gravatar_hash": "a31c67f29ac59ea5676387c81467c993", "author_url": "http://www.unkwndesgin.com", "date": "Aug 21, 2008", "message": "@Zach it does look like him."}, {"author_name": "Joseph Gordon", "gravatar_hash": "0b1cc59c87d56c90e526ebd510f8c8bb", "author_url": null, "date": "Aug 21, 2008", "message": "For the discussion problem, you could put a \"sort by\" selection near the top with choices \"rating\" and \"chronological\".\n\nAnd I didn't even have to spend a point to suggest it!"}, {"author_name": "kick in the ass", "gravatar_hash": "dd731e0125ab560940b711ada3ccce0a", "author_url": null, "date": "Aug 21, 2008", "message": "let's get this shit released already."}, {"author_name": "Mark Tiefenbruck", "gravatar_hash": "5022e8f0a0c5572cc979ccb74bbf753f", "author_url": "http://mark.tiefenbruck.org/", "date": "Aug 21, 2008", "message": "You guys discuss at some length whether or not it's a good idea to have a minimum threshold for editing other people's posts and what that threshold should be. I'd suggest that the threshold should be a function of the age of the question/answer being edited. For example, new questions will probably be viewed by many people after an edit, so the risk of letting new users edit them is low. On the other hand, if a question has been around for a while, it has probably been reviewed and refined by a lot of people, so an edit is more likely to be inappropriate."}, {"author_name": "Ray", "gravatar_hash": "7a8bb521b094e586f8cca22de1a618d0", "author_url": "http://torch.cs.dal.ca/~edwards", "date": "Aug 21, 2008", "message": "Why does the podcast need to adhere to a 1 hour limit?  It seems really arbitrary, and most times I feel like conversation is always cut short.  Plus, you guys never get to many questions, even on the \"All Questions Podcast.\"\n\nIf you must set a limit, 1:30 seems more reasonable.  More room to ramble but not so long that things get boring.\n\nI really enjoy the podcasts, but this is my only complaint."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 21, 2008", "message": "@Pacifika\n\n\"achieve rep points that are of no use\" -- but they do have a use, they give you additional abilities on the site. If you want them.\n\n@Ray \n\nWow, \"make it longer\" is not something I hear a lot (Well, except for from the ladies [rimshot]). Sorry. couldn't resist. I think an hour is a good length; we just had a lot to catch up on because of Joel's vacation .. and adding a special guest.\n\n@Joseph\n\nSort answers by votes, time asc, and time desc are already in, and saved in cookie prefs. People still complain.\n\n@Ethan\n\nYou can \"deal out points\" by voting people's content up or down.\n\n@Zack\n\n\"Is that Jeff in the johnny_vegas photo?\" Yep me and Miguel de Icaza. Who I do, truly, have a total man crush on. He wrote Midnight Commander!! And helmed the .NET port to Unix, Mono!"}, {"author_name": "KP", "gravatar_hash": "2e6376f1ccbf0b5ce54a16c5285e78a9", "author_url": "http://priester.net/", "date": "Aug 23, 2008", "message": "How about Relative Reputation?\n\nI was one of the group of people that \"were really annoyed by the meta discussion around StackOverflow\"\n\nI have not been impressed that most of the folks with 2000+ rep have gained that rep by talking about SO.\n\nYou have mentioned that you may key in on our tags to see what we are interested in.\n\nSo make users rep relative to my interest.\n\nThat way when I look at someone that has 2000+ rep just from talking about VB6 or SO, and it's clear I am interested in C#, ASP.Net, MVC then their rep might as well be 0 as far as I am concerned.\n\nJust a thought while listening to this weeks great podcast."}, {"author_name": "tron", "gravatar_hash": "09cde5dd80d173aea916a5152470e417", "author_url": null, "date": "Aug 24, 2008", "message": "Is it possible to add bookmarks of some sort to the audio so we can skip uninteresting parts?\n\nI'm sure everybody is not interested in hearing every part of the audio.\n\nI know I can skip the audio, but that is a stupid solution."}, {"author_name": "Bork Blatt", "gravatar_hash": "74a883cb48920b8feb1ba26d42b7d40e", "author_url": null, "date": "Aug 25, 2008", "message": "I think the problem of new users contributing to or editing answers might be solved with a simple rules change:\n\nAllow users with low reputation to edit answers only if they posted the original question."}, {"author_name": "Berdon Magnus", "gravatar_hash": "595e261e4a13c3e484d3bd21bb5faa90", "author_url": null, "date": "Aug 25, 2008", "message": "As a programmer that constantly uses Google to debug and solve issues, this sounds like a godsend. A centralized, sensibly envisioned website that could provide relief from certain insanity.\n\nI want in. :("}, {"author_name": "Jim Robert", "gravatar_hash": "aa2c9c45372ed95ebd86c21d86766183", "author_url": "http://deathbyprotools.com", "date": "Aug 25, 2008", "message": "have you considered allowing the stackoverflow code to be reused for other topics than programming?\n\neither by open-sourcing the code behind the site, or by launching other websites with the same code, but based on other topics?\n\nI think there are a lot of other topics where this same engine would be quite powerful, and also very useful."}, {"author_name": "Maciej Rutkowski", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Aug 26, 2008", "message": "It would be better if the discussion related to a question would go to a seperate page to keep the question topic itself clean. There could be something like \"Show related discussion\". Just like in wikipedia."}, {"author_name": "Alex Andronov", "gravatar_hash": "542f45519ec27c8147da98b9226f331c", "author_url": "http://www.gamboling.co.uk", "date": "Aug 26, 2008", "message": "Couldn't everybody edit. But if you don't have the reputation the edit has to be aproved by somebody with the rep points or the owner?\n\nBut everyone can see that there have been unaproved edits. So if I look at a question or answer and there are a zillion edits which haven't been aproved I can have a quick look if I'm unsure."}, {"author_name": "Tim", "gravatar_hash": "6641db768ea9e1fccfff4db432edfe35", "author_url": null, "date": "Aug 27, 2008", "message": "I'm not in the beta, but I love the concept of the badge, karma and voting system.  It almost sounds like a game where people gain experience points and 'level' to become more important parts of the community.  Sounds like this is going to be a great site guys."}]}