{"response": [{"author_name": "Ryan", "gravatar_hash": "fa327f6d5b410d974d6601ea6a7b1fd6", "author_url": "http://www.mantratechnology.com", "date": "Aug 13, 2008", "message": "Geoff Dalgas is one of the best developers I've had a chance to work with.  He's positively an asset to any team he's on."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 13, 2008", "message": "nah, he sucks. :)"}, {"author_name": "mreggen", "gravatar_hash": "9da7b3594009ed1c7bb7d1f3ea499d83", "author_url": null, "date": "Aug 13, 2008", "message": "I think the misuse of \"Offensive\" comes from people sometimes use it as a \"So dumb that it's offensive\", essentially a cost-free down vote. I think this may be a sign of the users saying that down vote is \"costing\" too much at 2:1.\nAlso, the sound went apeshit at about 55 minutes."}, {"author_name": "Adam", "gravatar_hash": "96067e4ea2f0e7c16d380b3426080d05", "author_url": null, "date": "Aug 13, 2008", "message": "Jeff -\n\nAwesome work, you rock, etc, etc... One criticism --- the cheesy intro music to the podcast.  It is just plain terrible.  Dont know if you can change it?  Did IT Conversations coerce you to use 70's stock saxophone music???\n\nOther than that... everything all the time is awesome."}, {"author_name": "Arnor Heidar", "gravatar_hash": "bea4c269123970af0124a2e2fb183633", "author_url": null, "date": "Aug 13, 2008", "message": "Hi Jeff, thanks for the very enjoyable developer podcast... :-)\n\nOne small rant here... :-)\n\nI'd sure like to see some comparison numbers to back up your claim about windows vs the LAMP stack..\n\nAlso regarding speed of PHP vs .Net\n\nAlso memory usage, stability ... the need to actually compile and build etc.\n\nGranted, windows has been doing better and better. But I still haven't seen it run better than a LAMP stack...\n\nYou'd never get as far on a windows machine as on a LAMP stack, using the same hardware...\n\nBest,\nArnor"}, {"author_name": "Espenhh", "gravatar_hash": "ebd2c5e2b2e583b6934435f5f648dc30", "author_url": "http://espenhh.com", "date": "Aug 13, 2008", "message": "Thank you for answering my questions (the one about collaboration and code ownership). I was very pleased with the answers, it cleared some things up and gave me some great ideas for my own projects. It's great to be able to interact to you in this way, so thanks for today's podcast - it was a really interesting one :)\n\nI'll be doing some transcripting now, because this podcast made me lusting even more to get into the beta. Hope I get one soon :)\n\nAnd last but not least: please make more developer-podcasts. I have plenty of questions on my mind.."}, {"author_name": "Shannon", "gravatar_hash": "1204456b59157047dc7cd9717a93e876", "author_url": null, "date": "Aug 13, 2008", "message": "Since you've implemented some game-style aspects to the site with recognitions and achievements, how will you avoid the one pitfall that tends to be common among online games that track suck things?\n\nNamely, how will you avoid having the site be heavily influenced by King-of-the-Hill contests or Developer Ego Wars?  The current system has the potential of allowing a small clique to earn a huge amount of reputation and, by doing so, have control of the site through the mechanisms that you've outlined that are attached to reputation.  And worse, control over the other users of the site.\n\nIf reputation continually accumulates, how will new users ever gain enough reputation to be on equal footing with the older users?  Or will the 'legacy' user base always be deterministically in control of the direction of the site?  You could compare it to forum points, but earning points in a forum doesn't give you any powers over the forum members, just potential respect.\n\nIt sounds like you've already started to encounter this problem with certain users in the beta accumulating huge reputation 'scores'.  With the current users being all beta-testers, which supposedly are friendly to the goals and purposes of the site, this may not be an issue.  However, that will not be the case when the site goes live and the general public has access.\n\nHas any thought been given to any mechanisms that might address these potential issues?  Or do you not see it as an issue that will cause problems?  Or will there be a threshold beyond which more reputation points will no longer matter and anyone beyond that threshold will all have the same ability to control the site?  What happens when you have hundreds of people all able to edit the site?\n\nTwo developers rarely agree on everything... hundreds and there will be religious wars... Seems like it could be a potentially thorny issue."}, {"author_name": "Espenhh", "gravatar_hash": "ebd2c5e2b2e583b6934435f5f648dc30", "author_url": "http://espenhh.com", "date": "Aug 13, 2008", "message": "Looks like the \"email password-function\" on FogBugs is kind of slow tonight. Did some transcripting anonymously, hopes that counts, cause I reeeealy want an invite. Feeling like a little kid crying to get cookies now... ;)\n\nAnd one thing I forgot: about the revert-functionality you are planning.. A revert-function can be very harmful if you are trying to build a wiki-like spirit, and should just be used for obvious vandalism. Look at wikipedias policy on this matter (if you haven't done it already). They just let admins revert, regular users can't do that one-click-revert thing. In stackoverflows case, maybe the revert-functonallity can be granted just to users who have participated in the site for a while. It's a difficult thing to figure out, but I'm sure you will find an elegant solution. I just wanted to point out that simply having a revert function may be harmful, it there is no accesslimits on it.."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 13, 2008", "message": "Espenhh -- what, then, is the difference between edit-wars and rollbacks? Obviously if you own a post you can edit it to remove any changes other people have made, so the distinction between \"edit\" and \"rollback\" is pretty academic at that point.\n\nThe difference in our system is that there IS individual ownership, up to a certain point. No Wikipedia articles are *signed* \"Posted by Espenhhh (3 hours ago)\", are they?\n\nStack Overflow is a mixture of wiki, forum, and digg/reddit ranking and reputation systems. I would argue this is somewhat unexplored territory, and we're still figuring it out."}, {"author_name": "Scott Muc", "gravatar_hash": "a67d1b0481cb73482061576ebb54f285", "author_url": "http://scottmuc.com/", "date": "Aug 13, 2008", "message": "Would love to hear more about the automated build process. I take great pride in setting up a system at work where a freshly installed XP box could start working on the source by installing SVN and checking out the latest source. My system was greatly influence by JP Boodhoo, and I would love to see the file structure of your project.\n\nProject setup and structure is one of those strange things that I am always attracted to. I think it satisfies the OCD in me to see a clean project structure.\n\nScott"}, {"author_name": "Espenhh", "gravatar_hash": "ebd2c5e2b2e583b6934435f5f648dc30", "author_url": "http://espenhh.com", "date": "Aug 13, 2008", "message": "Jeff:\nI guess it's kind of difficult for me to fully grasp the consept before I have tried it first-hand, so for now I will just assume you have full control :) I like the idea of a wiki with ownership, and am looking forward to see how it works out.\n\nTo clarify what I meant about the wikipedia-reference: Admins have a link they can click to roll back (at least that's what I have heard, I am not an admin myself), while regular users have to first click \"history\", then select an older version, then click edit on that one, then save that form. The result obviously the same, but it's just a bit more hassle for regular users (which is good, I think). \nIn StackOverflow's case, obviously the owner of the post should be able to rollback the edits easy. What I meant was that if you are considering to enable rollbacks on a more general basis for non-owners, that has to be done with care and consideration.\n\nLet's say someone edits Joe User's post and changes three sections. If Joe User disagreas with some of the changes, it's better to make him remove some of the changes, instead of just revert the whole post. It's a fine line between making it easier to remove vandalism and preventing people from removing good edits contained within edits they disagree with. \n\nAgain, I know you are not wikipedia, but let me reference a good policy there.. and yes, even at Wikipedia they do not agree on there things :P\nhttp://en.wikipedia.org/wiki/Wikipedia:Rollback_policy\n\nSince the feature hasn't been coded yet, and I haven't even seen stackoverflow, I will not argue any more, and instead go to sleep, since it's 6.45 in norway now =)"}, {"author_name": "mmp1", "gravatar_hash": "83bcb6a6206265dc4456d6ef85c9b80d", "author_url": "http://www.missingmatterproductions.com", "date": "Aug 13, 2008", "message": "Firstly, great to hear more from the team.\n\nSo my observations so far (like anyone cars right) :\n\nIf you are really interested in not being labeled as a .NET shop/site, it might help to cut down on the .NET fanboy stuff.  I am not saying PUSH other technologies.  It actually sounds more like that Jeff really knows MS Dev tools, so that is his world view he talks from.  Which is fare enough but..  \n\nFor example - the focus on MS providing all solutions for your development process.  True they do a good job , but their are projects (products) out their that do a better job.  One example was your discussion on build/testing/deploy.  So what is my point - it sounds like you guys know MS stuff really well, and many comments sound like \"i have one hammer\".\n\nAnother area to cut down on the .NET branding of stackoverflow - be careful putting other technologies down.  From a business point of view (which I think stackoverflow is ?) you wish to build a community of all technologies.  Listening to the podcast, it very much sounds like its MS here only.  ie. Defending .NET stack versus say a PHP stack (I personally think they both can be made to work well and badly) by saying \"well PHP sucks for websites\" isn't helping your branding. Its things like that.\n\nWith regard to build, is there a tool like Maven for .NET.  If not , have a look at Maven.  There may be some Maven .NET artifacts/plugins that you could use.  There is a small learning curve, but given the complexity of full on web build, test and deploy this is a small price to play.  (Does anyone know of similar tools for windows ?)\n\nHave you considered \"upgrading\" the workflow for marking a post as harmful ?  ie. a weighting system ?  Require more than one vote?  Weight the vote by badge rating?\nSome sort of signoff by users with a minimum of credit?\n\nEnjoying listening to the \"process\" of bring the site to life is great.  Looking forward to next weeks blog."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Aug 14, 2008", "message": "offensive was called \"inappropriate\" before."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 14, 2008", "message": "Michael, I am flagging your post offensive AND inappropriate. Also, you're fired."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Aug 14, 2008", "message": "but... but... What am I gonna do now? Do I actually have to... WORK now? Please, give me a second chance, I even promise to memorize the Lyrics of (You're) Having My Baby!"}, {"author_name": "watt", "gravatar_hash": "42ad44db8efe1a2b5e5e9214b444c971", "author_url": null, "date": "Aug 14, 2008", "message": "Eh, I miss Joel (with his attitude) already."}, {"author_name": "Chris Bartow", "gravatar_hash": "97f8dbd7b1804150965ab30ae6fb0f0d", "author_url": "http://www.chrisbartow.com/", "date": "Aug 14, 2008", "message": "In this episode, Jeff attacks PHP and compares stackoverflow with facebook as a scalability example of PHP vs ASP.\n\nWhen are you going to release the non-Microsoft fan boy version of stackoverflow?"}, {"author_name": "Chris", "gravatar_hash": "5383360cbcf1ea823d037092f1f1da00", "author_url": null, "date": "Aug 14, 2008", "message": "I was interesting to hear Jarrod say the build engineering is such a large amount of work.\n\nWe have a full time Build Engineer where I work which struck me as odd (or curious) at first but it's since become clear how important it is to have. Time was, he was a normal developer who's job it was to also manage our builds but that began to take larger and larger portions of his time to the point that it was declared his full time job."}, {"author_name": "Matthijs Holsbrink", "gravatar_hash": "cba369265a2a38ef302f5458a355454d", "author_url": null, "date": "Aug 14, 2008", "message": "Why is someone with an positive opinion about say... MS tools, immediately a \"fanboy\"? \n\nI really hate that word, \"fanboy\".\n\nAnyway, I thought Jeff was clear enough that is a technology site for everyone, so I that doesn't mean one has to be overly positive about other languages. People are still entitled to theit opinions."}, {"author_name": "Ryan", "gravatar_hash": "9bef8aa80a646a931f893a327a5f1a14", "author_url": null, "date": "Aug 14, 2008", "message": "Thanks for doing these podcasts."}, {"author_name": "Ryan", "gravatar_hash": "631c4ee905d7bcde753fe95ad452c9ce", "author_url": null, "date": "Aug 14, 2008", "message": "I have certainly learned about new tools from Stackoverflow, so it's been a success from that standpoint.  Thanks a lot."}, {"author_name": "wds", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Aug 14, 2008", "message": "re unit tests and thanks for answering my question about them btw. One of the suggestions (I think this is from Fowler's book on refactoring) I've taken to heart is that whenever you get a ticket for a bug and fix that bug, add a unit test that would have exposed the bug for you. Where and when it makes sense of course. An easy way to add tests to the project and likely to land the tests in the more fragile pieces of your code."}, {"author_name": "Sean Patterson", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Aug 14, 2008", "message": "Just finished listening to the podcast and loved it! I know you can only get so far in an hour, but I loved listening to 3 developers go over issues about their product/application/what have ya and the thought process through it.\n\nI highly suggest (should I post in uservoice too? 8^D) that you keep doing these podcasts. Maybe only once a month, because I'm sure the other guys get busy, but even after the beta, I'd love to hear more from the developer side of the house."}, {"author_name": "mat", "gravatar_hash": "9fe51d6403ca63796a561e9dae27c2b4", "author_url": null, "date": "Aug 14, 2008", "message": "Jeff,\n\nIt seems like the word/flag offensive doesn't fit. Spam will always be inappropriate, but not necessarily offensive. I would vote for inappropriate as a better flag name."}, {"author_name": "Rex", "gravatar_hash": "3e9f1629fd4cb4a5ce9fbd27b13e862d", "author_url": "http://www.rexmorgan.net", "date": "Aug 14, 2008", "message": "@Arnor\n\nI think it's more correct to say YOU'd never get as far on a windows machine as on a LAMP stack, using the same hardware, because you're a LAMP guy. Just like *I* would never get as far on LAMP because I'm a WISA guy."}, {"author_name": "Dave Marshall", "gravatar_hash": "b0d2a939b4a705315443cd1a598938d8", "author_url": "http://www.davedevelopment.co.uk/", "date": "Aug 14, 2008", "message": "I don't think anybody could ever come up with a decent performance comparison between the LAMP and WISA stacks, so bold statements on one out-performing the other shouldn't be made."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 14, 2008", "message": "I didn't mean to offend with my PHP comments; I was actually *defending* the WISA stack. If you can afford it (this is the adoption barrier) you WILL get better performance than LAMP. Largely because of the \"P\"HP part of that equation and the differences between interpreted and compiled code\n\nSee here under the \"Python\" column:\n\nhttp://www.codinghorror.com/blog/archives/000509.html\n\nalso, here:\n\nhttp://tinyurl.com/5laxh5"}, {"author_name": "Andy Small", "gravatar_hash": "34c1246e129b2450b382beaa899c3a43", "author_url": "http://andysmall02.blogspot.com", "date": "Aug 14, 2008", "message": "This podcast was awesome.  \nGood job guys!"}, {"author_name": "Teller", "gravatar_hash": "ac0c1a480a59ccdfe9ba3fc04b7ecc7d", "author_url": "http://www.skelecosm.com", "date": "Aug 14, 2008", "message": "You know what I liked? Hearing Jeff talk for a change. Joel usually dominates with his Alpha Male personality, and it was a delight to hear Jeff just talk and talk rapidly and coherently for a change, while his co-developers cowered in fear. hee hee...\n\nDon't get me wrong, Joel is God. I'm just sayin'.\n\nOk: Instead of \"offensive,\" just put \"spam\" as the term. Too obvious, I suppose.\n\nSeriously, great work, all of you."}, {"author_name": "Josh Parris", "gravatar_hash": "92f446269f65ef4213e94bd99aa3e475", "author_url": "http://parris.josh.com.au/", "date": "Aug 15, 2008", "message": "\"while his co-developers cowered in fear.\"\n\nHehehehe!\n\nThat made my day.  It was good to hear Geoff and Jarrod loosen up as the podcast went on."}, {"author_name": "Tim", "gravatar_hash": "93ad15f9e3fdd8365cdcc48badda8cdc", "author_url": null, "date": "Aug 15, 2008", "message": "Jeff you should really stop talking about technologies you have no recent experience in. PHP might be interpreted but it does not matter as web apps tend to be IO bound rather than CPU bound. Furthermore your langauge will not be your scaling point bottleneck, your database will. Sites like Wikipedia only have about 300 servers and it uses PHP and MySQL. Facebook probably has even less and you don't see people complaining about the performace of that."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 15, 2008", "message": "Tim -- facebook has thousands of servers.\n\nhttp://gigaom.com/2008/04/25/facebooks-insatiable-hunger-for-hardware/\n\nWikipedia server info is here; I didn't count but it looks like more than 300 to me:\n\nhttps://wikitech.leuksman.com/view/Server_roles\n\nI agree that the database is a large bottleneck, obviously."}, {"author_name": "Tim", "gravatar_hash": "93ad15f9e3fdd8365cdcc48badda8cdc", "author_url": null, "date": "Aug 15, 2008", "message": "Thousands, not billions, which is quite a significant exaggeration.\n\nThe point is, different sites have different loads (read/write), and different hardware/software needs. You're also not getting anything like the raw request rates Wikipedia or Facebook are.\n\nLAMP stacks have the advantage of being cheaper to expand, so when a smaller stack is no longer sufficient, you can extend appropriately to fit your needs. There's no point second-guessing your requirements until you're in a position to do so.\n\nSome interesting insights on scaling here: http://warpspire.com/tipsresources/programming/scaling-is-for-nerds/"}, {"author_name": "Jason Shoulders", "gravatar_hash": "bf91240ef917fdf3168250b6bd081e8f", "author_url": "http://www.JasonComedy.com", "date": "Aug 15, 2008", "message": "I signed up for the Beta a week or so ago. Recently, I did some transcribing to the Wiki. I've done about 2:32 so far and will probably do some more later, but am I supposed to send an email or request to get a Beta invite sooner or does someone check the Wiki Transcript daily?\n\nIf I need to act, what should I do?"}, {"author_name": "CVOS man", "gravatar_hash": "52efd31aecb78b9bba73949b16fe8abf", "author_url": "http://www.netpaths.net/blog", "date": "Aug 15, 2008", "message": "Please sign me up for the beta invite"}, {"author_name": "Bartek", "gravatar_hash": "81a7b5102336c191c73935c30ec45689", "author_url": null, "date": "Aug 15, 2008", "message": "Wow, you guys all sound really alike :)"}, {"author_name": "Jason Shoulders", "gravatar_hash": "bf91240ef917fdf3168250b6bd081e8f", "author_url": "http://www.JasonComedy.com", "date": "Aug 15, 2008", "message": "Sound alike in our propensity to pander for Beta access? ;) Actually, I wouldn't have brought it up on my own, except it was mentioned in the Podcast that transcribing at least a couple of minutes would immediately get your name on the list bumped up, so I just wanted to make sure there was nothing else I needed to do.\n\nAlso, regarding .NET vs. PHP, I think Jeff especially has gone out of his way to not bash PHP. There's nothing inherently wrong with having a favorite technology - especially if you back it up with good reasons, as they do. I think the general consensus is that PHP is more popular and widely used because it's FREE. .NET costs more, but you get some performance benefits and better tools like Intellisense.\n\nI personally like .NET better and that's why I've kept up with Joel and Jeff's blogs and now podcast and look forward to using StackOverflow."}, {"author_name": "Matt R", "gravatar_hash": "91a2fc97dacd1d863341bdea905e2a0a", "author_url": null, "date": "Aug 15, 2008", "message": "After listening to the podcast, I think it was Geoff who was praising MVC, what other other models did you look at instead of MVC to create this website?"}, {"author_name": "François Schiettecatte", "gravatar_hash": "6a1c159367b376c46ec40efebed6798e", "author_url": "http://fschiettecatte.wordpress.com/", "date": "Aug 16, 2008", "message": "A couple of things really struck me in this podcast. The first has to do with privacy, I am not sure what kind of privacy measures you plan to put in place for the website but you discussed one user's flagging behavior on the beta site, identifying that user by name. I am not sure that is a great idea. Second I was rather offended by the comments that \"programmers are smarter than the average\" and that \"programmers are a cut above the rest.\" I found it very patronizing (even though I am software developer.)"}, {"author_name": "John Sibly", "gravatar_hash": "dbd5895d0bebc3e5980ee6e0d001848c", "author_url": null, "date": "Aug 17, 2008", "message": "Loved the podcast this week. It was actually a lot closer to what I imagined the stack overflow podcast was going to be like. Don't get me wrong, the podcast between Jeff and Joel is very interesting, but much of the time it seems to be about general software engineering issues rather than the development of stack overflow itself."}, {"author_name": "Harry", "gravatar_hash": "a2fa94cc7a365e1fd858cc57ed791235", "author_url": "http://www.adverseconditionals.com", "date": "Aug 18, 2008", "message": "How come everyone involved with this project has a J sound at the start of their name? Its weird."}, {"author_name": "Jason", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": "http://www.abcwebware.com", "date": "Aug 18, 2008", "message": "This has to be the 5th podcast I've listened to recently where the guest said they programmed BASIC or assembly language on the Commodore 64.  Then I went to a user group meeting a few weeks ago, and sat next to some guy who was trying to find work with some company, using the 6510 instruction set!  \n\nI'm almost thinking that this wave of people who have become recognized enough to be in podcast guest spots have ALL programmed on the Commodore 64.  I listen and think, \"Oh boy, here's another one...\"  Its almost cliche - in a good way though.  I TOO programmed in BASIC and assembler - I guess I started out on a C64, but what Gen-X programmer hasn't?"}, {"author_name": "Jin", "gravatar_hash": "70ad2c2830eb9a7753bd6312f3811e3e", "author_url": "http://www.8164.org", "date": "Aug 18, 2008", "message": "\"How come everyone involved with this project has a J sound at the start of their name? Its weird.\"\n\nThat's impossible."}, {"author_name": "Tom J", "gravatar_hash": "2bd698effae7c91dc93711e1568a2c72", "author_url": null, "date": "Aug 18, 2008", "message": "Greetings.\n\nI am enjoying the series, and this episode is a great change of pace.\n\nOne small suggestion ... \n\nGentlemen, please purge the words \"like\" and \"really\" from your vocabulary. It seems that every adjective during the podcast that is preceded by \"really\". \n\nTake care ..."}, {"author_name": "Jason", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": "http://www.abcwebware.com", "date": "Aug 18, 2008", "message": "Ugh, that sounds like a tall order to me.  \n\nAnyway, I listened to the podcast...  I think you can recognize others who typed in programs out of those Compute! Gazette magazines is by their hunched back (almost Gates style), before they could afford a decent desk chair (for some reason I call  it the 'computer chair').  I used to type those programs in without any hope of saving - had to save up for the \"datasette\" or 1541 disk drive. Fun stuff.\n\n-Jason"}, {"author_name": "Jarno Elovirta", "gravatar_hash": "703f10be721a80be8971a9d92257e7c3", "author_url": null, "date": "Aug 18, 2008", "message": "On th4e podcast you were talking about RSS feeds for the site. Do consider going for Atom (http://tools.ietf.org/html/rfc4287) instead of RSS. For end users it really doesn't make a difference which web feed format you use, but there should be a reason why you would choose RSS over Atom."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Aug 18, 2008", "message": "They went with Atom for their feeds, but does it really make any difference? Both work just fine."}, {"author_name": "Matias Nino", "gravatar_hash": "7a53888c3d36599e2d8d823269126957", "author_url": "http://dmbalmanac.com", "date": "Aug 18, 2008", "message": "Awesome 'developer' podcast! I see the sparks of something AWESOME. \n\nAll three of you should tell of your experience on DotNetRocks when you're ready for prime time. Tell Carl to book you way in advance! :)\n\nP.S. I recommend a monthly developer podcast in addition to your 'Jeff and Joel' high level discussions. The insight you can bring into what an effective (or perhaps sometimes not so effective) competent software development team experiences in this ambitious project is groundbreaking!"}, {"author_name": "Jarno Elovirta", "gravatar_hash": "703f10be721a80be8971a9d92257e7c3", "author_url": null, "date": "Aug 19, 2008", "message": "Good to hear about the Atom feeds. Both work, but Atom is probably [with your best Clockwork Orange voice] \"part of the new way\" and might be more future proof."}, {"author_name": "Matt K.", "gravatar_hash": "13e6e96d176cd18ef232d054b8e65f55", "author_url": null, "date": "Aug 19, 2008", "message": "A potential weapon against spammers/griefers could be a squelch or mute function.\n\nA user, say user \"A\", can mute any other user(s), i.e. users \"B\" and \"C\"; any questions/answers/posts made by B or C would be invisible to A.\n\nI don't know how practical this approach would be without knowing your system architecture, but the approach has the advantages of being proactive rather than reactive and has little chance for abuse; B and C are not *punished* by A and in fact don't even have to know they have been muted."}, {"author_name": "Glen Barnes", "gravatar_hash": "6cf87365e668b95f086c1348c5c35bdc", "author_url": "http://devour.co.nz", "date": "Aug 19, 2008", "message": "Any reason why you don't use reCAPTCHA on the site (You mentioned writing your own)? You are using it on this blog and it would fit in well with the community aspect of Stack Overflow."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Aug 20, 2008", "message": "I believe it was because Jeff wanted the actual page to be usable without JavaScript, and reCAPTCHA does not work without it, at least not with Firefox/NoScript, which is what most people use most likely."}, {"author_name": "Durgin", "gravatar_hash": "abc5a095a89894e431c2f0b7b5dd6798", "author_url": null, "date": "Aug 21, 2008", "message": "Yahoo answers definitely is the \"black hole of stupid\"."}, {"author_name": "Eric", "gravatar_hash": "4cc6319b3a017074fdbb5067960841eb", "author_url": null, "date": "Aug 21, 2008", "message": "You should still update this page from time to time. www.joelonsoftware.com reports that podcast #18 is up, where is it?"}, {"author_name": "Kevin Wong", "gravatar_hash": "f060ef5efd636c5803ce894d7b87d5e8", "author_url": null, "date": "Aug 21, 2008", "message": "I'm a Java guy.  Listening to your podcast it seems the .NET community is a couple years behind Java's in development process.  \n\nThe fallacy that unit tests increase development time has long been discounted in the Java community.  Why run the whole app to test when you can short circuit the process and just execute the code under development.  Also, you shouldn't \"go back\" and write unit tests; you should write them _first_.  The new definition of legacy code is \"code without tests\"; .NET guys should know that by now.  \n\nMoreover, QA in the Java community has gone far beyond unit testing, embracing into the mainstream practices like code coverage, static analysis (Findbugs), advanced IDE refactoring, mock testing, code modularization (OSGi), etc.  If you're serious about the quality of your work, you better get on board with these concepts.\n\nProper Java builds (based on Ant/Maven) are self contained and never depend on the installation of an IDE or libraries (ridiculous notions, both), except, of course, for the JDK and build tool.  So, setting up a CI server is easy.\n\nGood podcasts, tho. Gives good insight into the dark side.\n\nP.S. You might want to try Hudson as your CI tool.  I think it has better MSBuild integration."}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://andreir.wordpress.com", "date": "Aug 25, 2008", "message": "@Jeff : Regarding the correct pronounciation of Stefan Ciobaca's surname (which I think is romanian, like me) I can help out :\n\nChaw-buh-cuh."}, {"author_name": "Kurt from Florida", "gravatar_hash": "218dd8026929110aa3369d645b447884", "author_url": "http://www.leucht.com", "date": "Aug 26, 2008", "message": "Great podcast, guys.  You should do a developer podcast semi-regularly ... like once a quarter or something."}, {"author_name": "Haacked", "gravatar_hash": "cdf546b601bf29a7eb4ca777544d11cd", "author_url": "http://haacked.com/", "date": "Aug 27, 2008", "message": "Just listened to your podcast, it was great and thanks for the shout outs! BTW Jeff, there isn't like 20 people on the team, we have a pretty small team much like yours. :)"}]}