{"response": [{"author_name": "Jérôme", "gravatar_hash": "21ae3e5f2968bc957b7a6fa709bea2a0", "author_url": "http://www.jdecuyper.com/", "date": "Aug 28, 2008", "message": "Podcast is out! Subjets look great!"}, {"author_name": "Salman", "gravatar_hash": "9af868b673e089e603b242c995e5593a", "author_url": null, "date": "Aug 28, 2008", "message": "Jeff,\nWhat kind of pageviews are you guys doing now?"}, {"author_name": "Alistair", "gravatar_hash": "438c91736f20d0821c7a358ee8b00790", "author_url": null, "date": "Aug 28, 2008", "message": "As well as the elite 5%-10% of programmers that make up your target audience, there's also the code monkeys who only read tech blogs like coding horror and JOS as they're slacking off on the pretence that they're bettering themselves....."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": null, "date": "Aug 28, 2008", "message": "My gut says that word of mouth and Google organic ranking will get it off to a good start.  It will pull in exactly the developers you're after for a nice, strong, and steady ramp up."}, {"author_name": "wds", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Aug 28, 2008", "message": "Is it just me or did the guy from conversation networks introducing the podcast sound a bit sad?"}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Aug 28, 2008", "message": "So - how do you insert RTF into a Word Document from a Macro without deleting the Users Clipboard? :-P"}, {"author_name": "Matt B", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Aug 28, 2008", "message": "Any idea how long the wait is for people who have signed up for the beta via the google docs form?"}, {"author_name": "wx", "gravatar_hash": "80526cf8beda0c4c00980a407ba4871a", "author_url": null, "date": "Aug 28, 2008", "message": "Michael, you sohuld listen <a href=\"http://beta.stackoverflow.com/questions/22326/word-automation-write-rtf-text-without-going-through-clipboard\" rel=\"nofollow\">more carefully</a>.\n\nJeff, you are pissed that hacker folks did not notify you. Well after you open up the site, guess what - if you have left a weakness, it is going to be exploited cynically and abused, no matter what your feelings are."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Aug 28, 2008", "message": "Whoops, thanks :-)"}, {"author_name": "Drejc", "gravatar_hash": "b054efe2994c057c0ca34ad425ad1a2a", "author_url": "http://www.monex-finance.net", "date": "Aug 28, 2008", "message": "To learn from the best ;) just check out the Daily WTF site: http://thedailywtf.com/Series/CodeSOD.aspx"}, {"author_name": "Portman", "gravatar_hash": "57dcebe24f9d0359c214d21c8844c849", "author_url": "http://www.gratisinternet.com/careers/", "date": "Aug 28, 2008", "message": "&gt;&gt;I’m just unsure exactly where the transition point is for network latency versus the SQL calls staying in memory. \n\nA good rule of thumb is to offload the SQL database as soon as the filesize is greater than your operating system's RAM. \n\nIf you have a 4GB server, with the OS+IIS using 1.5GB, you will have 2.5GB left for SQL server. If your database is less than 2.5GB, SQL will effectively function as an in-memory database. You will not go to disk when reading data. \n\nOnce your database grows in filesize, you will need to go to disk more frequently, which is several orders of magnitude slower than network latency. At that point, offload to a new box.\n\nThat rule of thumb has served me well."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://www.johntopley.com/", "date": "Aug 29, 2008", "message": "\"Is it just me or did the guy from conversation networks introducing the podcast sound a bit sad?\"\n\nDo people actually listen to the intro then?"}, {"author_name": "Vincent", "gravatar_hash": "e604ed328420a7ec0fdbdf2a1818de1c", "author_url": "http://polymathprogrammer.com", "date": "Aug 29, 2008", "message": "Hi Jeff, I'm currently maintaining web applications hosted on a dedicated web server and a separate dedicated database server. The setup is as Joel mentioned. I thought this was a standard setup.\n\nThen again, Joel's laptop server when he started FogCreek isn't much better..."}, {"author_name": "vzczc", "gravatar_hash": "1887903198095d29f1bb9624898e9bc5", "author_url": null, "date": "Aug 29, 2008", "message": "It is true, I notice he sounds a bit sadder than he usually does. Bad day perhaps."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Aug 29, 2008", "message": "I see questions with no replies. I question if it's a waste of time to ask questions here."}, {"author_name": "DL", "gravatar_hash": "1149802ac01ca96a070705cc010628b6", "author_url": "http://www.odeit.com", "date": "Aug 29, 2008", "message": "Row level locking is not the same as turning on read committed snapshot. Turning on read committed snapshot helps with row level locking, row level locking is what happens when you select, insert, update or delete a row. There are different types of locks but anytime you access a record a row level lock is used. Read committed snapshot implements a locking strategy where if someone has a row locked because they're making changes to it anyone who reads that record will read the \"old\" version of the record instead of being told that the record is locked."}, {"author_name": "Isaac Lin", "gravatar_hash": "408975adb6e2f531f290e7fe0209a3a9", "author_url": null, "date": "Aug 29, 2008", "message": "Though I think it is justifiable to delete meta-topics during this beta period, it does raise the question about what you will do when the site is live. If you truly intend it to be self running, how will you cope with a myriad of trivial questions (possibly added by those trying to increase the reputation)? You may need to mimic Wikipedia and figure out a way to scale up community involvement in administrative duties.\n\nRegarding crackers, though I agree that these supposedly benign vandals were being impolite by trying to do truly destructive things, I think you are better off if security beta testers don't give you any advance warning, so you can truly test your ability (not just your software's) to detect and handle attacks."}, {"author_name": "Nij", "gravatar_hash": "b7268d6cc2399c04f99d91a18484ee48", "author_url": "http://www.kebabShopBlues.co.uk", "date": "Aug 31, 2008", "message": "@Portman:\n&gt; If you have a 4GB server, with the OS+IIS using 1.5GB, you will have 2.5GB left for SQL server. If your database is less than 2.5GB, SQL will effectively function as an in-memory database. You will not go to disk when reading data.\n\nOnly if you have done memory shenanigans with AWE, or have the 64 bit Sql Server, if I'm not mistaken..."}, {"author_name": "tan", "gravatar_hash": "444b531a4c2a04423836b69da734e90f", "author_url": null, "date": "Aug 31, 2008", "message": "@John Topley\nJust turned on the podcast now and it was my first thought also. Maybe it is because it is sunday :)"}, {"author_name": "Kendall Gelner", "gravatar_hash": "f1bdf7caade09236d81ff48f85e19543", "author_url": null, "date": "Aug 31, 2008", "message": "@ Alistair wrote: \"As well as the elite 5%-10% of programmers that make up your target audience, there’s also the code monkeys who only read tech blogs like coding horror and JOS as they’re slacking off on the pretence that they’re bettering themselves…..\"\n\nCome now, you can't read Joel On Software without inadvertently bettering yourself even if that's not your original intent!  :-)\n\nP.S. usability issue -copying comments here is harder than it should be as the images seem to extend al the way to the very border of the text, making it hard to highlight from the first letter onward.  Does a usability report get me in on the beta (I only just submitted my name to the list despite listing to the podcast for months now)"}, {"author_name": "David G", "gravatar_hash": "26913a608bc12c040aa05b61124b6a91", "author_url": null, "date": "Sep 03, 2008", "message": "I think the \"cluster\" Joel described (load balancer, 2 web servers, 1 database server) is ideal for many reasons. As Joel pointed out, you don't want to be scrambling when you go live because the load is 100 times greater than you expected. I would at least have the hardware ready so that you could put together a cluster quickly."}, {"author_name": "プラダ コピー", "gravatar_hash": "75a19b51f44abe3a2b55de290d60fec9", "author_url": "http://wwhttp://www.lv-star.com/Prada.html", "date": "Jan 29, 2010", "message": "Japan Prada"}]}