{"response": [{"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Aug 12, 2008", "message": "If I could only pick two people - I'd definitely get a Businessman because I hate that dry stuff.\n\nAnd then a second Developer to handle the Documentation and UI Part, because I also hate that stuff :-)"}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Aug 12, 2008", "message": "Ok, Questions.\n\nFirst, the obvious one: What was the single biggest technical challenge you had to overcome?\n\nSecond, the not-so obvious but still not really surprising one: Was there any feature where you thought before \"THIS is going to be so cool!\" only to learn later that it does not work out? Or Vice Versa?\n\nThird, the outlook-question: Where do you think StackOverflow will be going? Are you happy with the results of the Beta so far? What is the roadmap feature wise?\n\nAnd last, the stupid question: A light bulb is turned on by one of three switches. The light bulb is in an enclosed room with a single door and no windows. How do you determine which switch turns on the bulb if you can enter the room only once?\n\nAnd least but not last, the business question: How is SO going to make money?"}, {"author_name": "Adam Haile", "gravatar_hash": "3a29aba7f7e68203d4265d5fcca46f53", "author_url": null, "date": "Aug 12, 2008", "message": "Having created a full production site with ASP.NET MVC, what are your impressions of the framework in it's current preview state?  Is it ready for prime-time?"}, {"author_name": "Aidan Ryan", "gravatar_hash": "f01d06e6dcd2be5ea4519f97703797d8", "author_url": "http://ajryan.blogspot.com", "date": "Aug 12, 2008", "message": "Should all developers learn C?"}, {"author_name": "Ben", "gravatar_hash": "f67d7c6fbffc6ef2a37bb412fa83993e", "author_url": null, "date": "Aug 12, 2008", "message": "Can you talk a little bit about how you designed the back end database?"}, {"author_name": "Guy", "gravatar_hash": "aa81a6370a42b90429370bcf2dfad2e8", "author_url": null, "date": "Aug 12, 2008", "message": "What is the biggest thing you've learned since opening up the public Beta?\n\nIs there anything you're especially proud of?  Anything you'd do differently in hindsight?\n\n(Something more on topic for my field) How's the backend database running?  Server performance OK?\n\n...and how are we going to stop Michael Stum from hitting a bizzllion rep points by the end of the month!!\n\n;)"}, {"author_name": "Frances", "gravatar_hash": "119a4a4d15bd6101c19fcd0cca47c667", "author_url": null, "date": "Aug 12, 2008", "message": "1. Have there been bugs in the StackOverflow-design so far, that you've looked at and wondered: \"What was I thinking about when I wrote this?\"\n\n2. How many developers does it take to change a lightbulb? ;-)"}, {"author_name": "Guy", "gravatar_hash": "aa81a6370a42b90429370bcf2dfad2e8", "author_url": null, "date": "Aug 12, 2008", "message": "@Frances,\n\n\"How many developers does it take to change a lightbulb?\"\n\nNone. That's a hardware problem!\n\n*rimshot*"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Aug 12, 2008", "message": "I totally know where Morganton, NC is.  I grew up in Newton, about half an hour east of there.  I guess that's not a question but I thought I'd give a shoutout or whatever you'd call this."}, {"author_name": "Dave Anderson", "gravatar_hash": "e74e7299da165db42a5a461e150b82ff", "author_url": null, "date": "Aug 12, 2008", "message": "For what element of the website are you most proud of the code you've developed to create it? Which area do you think you've been most innovative in and which part would you really like to revisit if you had the time?"}, {"author_name": "paul celi", "gravatar_hash": "8218051965d32ae09c6591948081c1ec", "author_url": null, "date": "Aug 12, 2008", "message": "How do you guys manage/administer the site?\nHave you developed some activity dashboard or some alarm system for issues or bad behaviors ?"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": null, "date": "Aug 12, 2008", "message": "ONE:\nHow difficult or easy has it been working with your team members so far apart?  Surely it'd have been easier if you all were in the same office.\n\nTWO:\nAre you happy with the decision to use ASP.NET MVC?  Is it worth the \"tag soup\" cost?  Was AJAX made more difficult or easier?  Did you find yourselves missing the standard web forms abstraction?\n\nTHREE:\nDid you use Linq to SQL?  If so: Has that new syntax been difficult to learn/master?  How much have you fallen back into writing TSQL stored procedures?  If at all, was it due to a limitation of Linq?"}, {"author_name": "John", "gravatar_hash": "a5061ac6baf0b57c941cedffb340563d", "author_url": null, "date": "Aug 12, 2008", "message": "Has anyone on the team used any other web framework such as Rails, Django, Struts or Symfony?  If so, how would they compare ASP.NET MVC to them?"}, {"author_name": "Marshall", "gravatar_hash": "f4b0ae015ef3ffe842e5d7232907b567", "author_url": null, "date": "Aug 12, 2008", "message": "Do you have any concerns about the site being sort of dominated by one particular language? Have you noticed if this is the case during the beta, and is there anything you plan on doing to encourage diversity?"}, {"author_name": "Gareth Simpson", "gravatar_hash": "254ca3f1a5c9a73c20cbac880b8985a7", "author_url": null, "date": "Aug 12, 2008", "message": "Now that beta has been running for a while, what surprises have you seen?\n\nAre there any big features that you had high hopes for that didn't work out?\n\nAre there any little afterthought features that turned out insanely popular?"}, {"author_name": "Tim", "gravatar_hash": "63f289d0adff09dc3ff2ce690a25ab3e", "author_url": "http://www.techtoolblog.com", "date": "Aug 12, 2008", "message": "Guys,\nLooks like you went with a WISA stack (Windows, IIS, SQL, ASP.net).  Say stackoverflow becomes a high visit site such as delicious, digg, linkedin, etc... (all built on LAMP stacks).  Do you think the WISA will scale, especially with the cost of a Windows license?"}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Aug 12, 2008", "message": "My Question:\n\nWhat is Jarrod looking at that and why is it making him so happy."}, {"author_name": "Adam", "gravatar_hash": "67b696a0cf7d7be34352a4c1c4e5f183", "author_url": "http://www.darkrockstudios.com/", "date": "Aug 12, 2008", "message": "Do you guys feel, such that Asian children, and the Iraq... Thank you?"}, {"author_name": "Sean Patterson", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Aug 12, 2008", "message": "What has been the hardest feature to implement in the system?\n\nWhat was the surprisingly easiest feature to implement in the system?"}, {"author_name": "wds", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Aug 12, 2008", "message": "What's the test coverage like on the stackoverflow code? Do you feel you're covering enough? How much did it help to have automated tests? (assuming you do, I seem to recall that from a previous podcast)"}, {"author_name": "brian", "gravatar_hash": "7eb788f6132eac5f7b8ca5b43924ad42", "author_url": null, "date": "Aug 12, 2008", "message": "How does it feel to see your creation being used and well received?  \n\n(some peeps in beta are callin it \"crack overflow\", 'cause it can be awesomely addicting)\n\nUsing it feels more like game then a boring old forum.\n\nDo you think you can successfully monetize it at release or are you waiting for \"critical mass\"?"}, {"author_name": "Jim", "gravatar_hash": "a7eb6d9e84ea1a901f245f568c4e62c2", "author_url": null, "date": "Aug 12, 2008", "message": "What browsers are people using on stackoverflow?  Operating systems?  Screen resolutions?  Countries?  Any other interesting stats that can be shared?\n\n(I assume this is being tracked.)"}, {"author_name": "Alan Le", "gravatar_hash": "e3c910014ce8385fa92563f111424d16", "author_url": null, "date": "Aug 12, 2008", "message": "Will you release API for StackOverflow for other developers to extend it? Also, how are you planning to deal with mischievous users (spammers, griefers, marketers, etc) on stackoverflow?"}, {"author_name": "Scott Marlowe", "gravatar_hash": "fa5987941c18b93b6cc8af64c296477b", "author_url": "http://www.scottmarlowe.com", "date": "Aug 12, 2008", "message": "How about some info on how the three of you come to a consensus on design and choice of technology decisions? Is it a true democracy?"}, {"author_name": "Jared", "gravatar_hash": "5ff1e1b35d1fc13baf08d807fb2097a7", "author_url": "http://www.updike.org/", "date": "Aug 12, 2008", "message": "I'm impressed with even the blog.stackoverflow.com comments page. It looks like you have included a lot of useful features by re-using great resources for building web apps, for example I heard you mention JQuery, Markdown and some sort of custom rich-text editing box, I see Gravatars and reCAPTCHA. What is the complete list of great web-app-y resources you have re-used this way (for our greater edification), and has the MVC AJAX stuff ever gotten in the way or are do the newest tools for ASP.NET treat other HTML/JavaScript components as first class citizens? Have there been downsides to using so many disparate pieces of technology, in terms of the pieces fighting with each other?"}, {"author_name": "Rob", "gravatar_hash": "29d4625b3e15ecef1ff05565fbfacd58", "author_url": null, "date": "Aug 12, 2008", "message": "1) What sort of software engineering practices did you use when starting work on stackoverflow? Did you sit down and draw up formal documents before writing any code, or did you go the route of \"code now, document later?\"\n\n2) What techniques are you using to identify areas that need special tuning (i.e. queries and algorithms)?\n\n3) What, if any, aspects of the stackoverflow code base have you found to be unqiue?"}, {"author_name": "Rob", "gravatar_hash": "c290d3851c7837081d05b3491cbc331b", "author_url": "http://cantgrokwontgrok.blogspot.com", "date": "Aug 12, 2008", "message": "Some of these have been have been asked already, but I thought I would add anyway so they is more likely a chance they get asked :)\n\n1. Whats the part of the system you found most challenging to complete, and are most proud of? (they may not be the same).\n\n2. Jarrod, Geoff, would you have liked to have been a bit more high-vis? Such as participating in the podcast?\n\n3. For the team, how has it been responding to the army of geeks and being directly in the firing line? ^_^\n\n4. How challenging has it been working so far apart? What tools have you used for collboration etc.\n\nLastly, a big thank you to you all for your hard work, I am really liking the site and look forward to seeing it mature. I am sure I am not alone here as well :)"}, {"author_name": "Christian", "gravatar_hash": "b9712b3a496340ff7492ac3c40f5d3b4", "author_url": null, "date": "Aug 12, 2008", "message": "What motivates you guys to work at slave wages? Do you make lots of money in another job, do you believe so much in the project or is Jeff such a good friend of yours?"}, {"author_name": "Benjamin Perdomo", "gravatar_hash": "bc3e5f25463559d4e90762d1d7d6066d", "author_url": null, "date": "Aug 12, 2008", "message": "Did you plan to make localized (multilanguage) versions of stack overflow? If so, what did you do? Resources? Tags editable on database?"}, {"author_name": "Name (required)", "gravatar_hash": "ec6832a9b878dec35d6928dd66e061fa", "author_url": null, "date": "Aug 12, 2008", "message": "What does Joel do for stackoverflow?\n\nIf you were a programming language which would you be?"}, {"author_name": "Stefan Ciobaca", "gravatar_hash": "82e8780cc5e4d583081079cb8c120bbc", "author_url": null, "date": "Aug 12, 2008", "message": "1. How many people stopped following stackoverflow because Joel insisted on allowing audio only questions in the podcast? Does he admit it was a mistake? Do you think this was a decisive cause of the podcast becoming boring?\n\n2. What took so long to develop? It seems to me that the first version of such a (simple?) site would take a week (?) maybe. Is it because you used Windows, which takes more time to setup as a server? Or is it the stack, which makes it more difficult to create stuff that seems easy? Or is the product really complex?"}, {"author_name": "Christian", "gravatar_hash": "b9712b3a496340ff7492ac3c40f5d3b4", "author_url": null, "date": "Aug 12, 2008", "message": "What tools do you use to build and push the site? Is it a one click solution?"}, {"author_name": "Ryan", "gravatar_hash": "fa327f6d5b410d974d6601ea6a7b1fd6", "author_url": "http://www.mantratechnology.com", "date": "Aug 12, 2008", "message": "Dawgless, lookin' good.  Keep up the fro-hat."}, {"author_name": "James Coulter", "gravatar_hash": "cbcd4473447deeb8e31284cc2fd6df26", "author_url": "http://jcoulter.co.uk", "date": "Aug 12, 2008", "message": "1. What most annoys you about how stackoverflow is being used?\n\n2. What design process, if any, did you go through before you started to cut code?\n\n3. How do you prioritise what to do next in terms of bug fixes or new features?\n\n4. Have you managed to test as you go along, or did time pressures force you to skip testing? Has this resulted in more bugs than you anticipated?\n\nLiking stackoverflow so far. Keep up the good work."}, {"author_name": "Espenhh", "gravatar_hash": "ebd2c5e2b2e583b6934435f5f648dc30", "author_url": "http://espenhh.com", "date": "Aug 12, 2008", "message": "1) How do you manage to get all the planning and the \"teamwork-part\" of the programming done when you are sitting far apart? I know you use skype, but when programming I personally like to sit down beside my colleges a couple of times every day. Espessially when I am in such an early face of a project like you are in now. Stuff like commenting each others code, how do you do that?\n\n2) What feelings do you have of the code you write, do the person who originally whote it \"own\" it, or do everyone work on \"each others code\". Of cource I don't mean total separation of code, but say for example that Jarrod implemented most of the tagging-features; if something has to be changed or bugfixed, do you then prefer to send that task to him, or can anyone of you handle it? On projects I have worked on we have allways strived to make the code \"owned by everyone\", but it allways turns out to be easier in theory than in practice. Do you have any tips?\n\n3) Pirate or ninja? =)\n\n\nI'm looking forward to listening to the podcast, hope you find time to answer some of my questions (at least the third one...)"}, {"author_name": "joe schmoe", "gravatar_hash": "8f2a9478253d99b6ca2dce3474192118", "author_url": null, "date": "Aug 12, 2008", "message": "1) Were Jeff's management skills an 'epic fail' as some had predicted?\n\n2) What do Geoff and Jarrod do while not working on stackoverflow (professionally and for fun)?\n\n3) Any thoughts/comments on IIS7 now that SO's been (semi) live for a few weeks?"}, {"author_name": "Pradeep", "gravatar_hash": "9e3301f8b90b59413411e99127725169", "author_url": null, "date": "Aug 12, 2008", "message": "Jeff was a firm believer of the Zengarden style design, and Joel in the podcast dismissed it as impossible in a real world application, and I see there are tables in the site markup.\n\nWhat are the reasons, design challenges which forced you to relax the rule.\n\na.k.a Why did Jeff jump the shark?"}, {"author_name": "Timon", "gravatar_hash": "df7a6b9372d4f0acefb65ab5fa8d1512", "author_url": null, "date": "Aug 12, 2008", "message": "Is the following idea crazy or unimplementable?:\n\nA community-generated podcast consisting of: 1) audio questions posted to stackoverflow much like text submissions 2) user-submitted responses tied to the original questions and moderated by other users or the owner of the question, then 3) a periodic bundling of the best stuff into an audio podcast?\n\nIt seems hard to sustain a huge amount of podcast production with a small team.  I would think the only way to make participation sufficiently easy would be a phone number with a short menu like \"press 1 to reply, 2 to post a new question\", etc.\n\nAnyway, love the show"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 12, 2008", "message": "ok, podcast is in the can! Thanks for all your questions!"}, {"author_name": "Ceb", "gravatar_hash": "259814d4507d09b600fc132e352fbcc2", "author_url": null, "date": "Aug 12, 2008", "message": "Damn, now I'll never find out what the real story is behind the Jeff, Joel, Geoff, Jarrod and Jeremy (the designer) name similarities (coincidence - I think not!)"}, {"author_name": "Stephen Hill", "gravatar_hash": "b3b929eac30b663d37bad00f2061403b", "author_url": "http://gatekiller.co.uk", "date": "Aug 13, 2008", "message": "Ok, this question is for Geoff and Jarrod:\n\nHow do you feel living on what Jeff calls \"Salve Wages\" or is the pay really, not that bad?"}, {"author_name": "Daniel Schaffer", "gravatar_hash": "46fb7257c23c93335ceff2f1a882fa5a", "author_url": "http://www.dandoes.net", "date": "Aug 13, 2008", "message": "I know you've already recorded the podcast, but hopefully someone can comment on this anyways.\n\nThe team I'm on recently switched our source control software from SourceGear's Vault to SVN, using Tortoise as the client. Everything I've heard about .NET development and source control has been \"Use SVN! It's great!\"; unfortunately, our experience has been less than stellar - I might even call it excruciating.\n\nFirst, you should know that our team is geographically separated. We have a headquarters in Washington, DC, and several remote developers that work from home around the country.\n\nSecond, we have a fairly extensive code base. Our main repository contains at least 60 dozen different projects. We have about 20-30 solutions, each of which have anywhere between 2-12 or so projects referenced. There are a handful of projects that are re-used in many of the solutions, and those solutions may not necessarily be part of the same product. By, the way, by \"solution\" and \"project\", I am referring to the Visual Studio concept of those words.\n\nFor branching, the procedure we've been following is this (a very succinct version):\n1. At the start of a release, create a new branch.\n2. Do your work, QA, etc\n3. Merge the branch back into trunk and tag it\n\nThe problem here is that whenever we branch, we're branching about 30,000 files, most of which aren't actually needed by the solution. Unfortunately, there's no good way to just branch only the files we need. This doesn't impact our HQ folks so much, but it takes a long time for our remote developers who are going over the WAN.\n\nOn top of that, it seems like every time I do something more complicated that an update or a checkin, something gets corrupted and I need to do a \"clean up\", or sometimes I even need to kill my entire working copy and update from scratch. Source control should not be this difficult.\n\nSo, I'm wondering, is there something I don't know that would make this easier? Are there other solutions that are maybe designed specifically for .NET development teams? Please help!"}, {"author_name": "Arron", "gravatar_hash": "a31c67f29ac59ea5676387c81467c993", "author_url": "http://www.unkwndesgin.com", "date": "Aug 13, 2008", "message": "@Daniel Schaffer that's defiantly something that should be asked on the system not here."}, {"author_name": "Ian Anderson", "gravatar_hash": "60b1c7dc18e08e1a16f313354814744f", "author_url": "http://thefirstpost.co.uk", "date": "Aug 13, 2008", "message": "Where for the love of all that's holy did Geoff get that shirt? It's wearing him..."}, {"author_name": "Ian Anderson", "gravatar_hash": "60b1c7dc18e08e1a16f313354814744f", "author_url": "http://thefirstpost.co.uk", "date": "Aug 14, 2008", "message": "@Daniel Schaffer\n\n1. Yes, you branch _all_ the files in svn and it takes about an extra byte. Are you talking about having to create a working copy of the branch? Yes, this will take however long to create on your local machine but every operation after that will be incredibly cheap in bandwidth because svn does everything in diffs\n\n2. You should post the .net part of that question on SO... :)"}, {"author_name": "Ian Anderson", "gravatar_hash": "60b1c7dc18e08e1a16f313354814744f", "author_url": "http://thefirstpost.co.uk", "date": "Aug 14, 2008", "message": "Nice to hear from Geoff and Jarrod on the podcast - thanks for an awesome app"}]}