{"response": [{"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Aug 25, 2008", "message": "and, you say expert sex change."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 25, 2008", "message": "It's just FUN to say!"}, {"author_name": "Eric Haskins", "gravatar_hash": "d23fc7a4a2452a880efbf87061b0d678", "author_url": null, "date": "Aug 25, 2008", "message": "I started listening to that the other night, but I only got a few minutes in before I got interrupted. Now I have to actually listen to it. :)"}, {"author_name": "chakrit", "gravatar_hash": "104c34a4803355ade79413372205138a", "author_url": null, "date": "Aug 25, 2008", "message": "cant wait to join the beta! :)"}, {"author_name": "Juan", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Aug 25, 2008", "message": "Listening to it right now (Lol @ the hacker badge stuff)"}, {"author_name": "Tom", "gravatar_hash": "375e4cbc9df29840614f17775a8b15ba", "author_url": "http://futuresoundings.blogspot.com/", "date": "Aug 25, 2008", "message": "Just to say wow. It sounds like you're definitely improving and working on decent rules, systems, positive social feedback loops etc to make a great site. Just applied for a beta account, but if I dont' get it, i'll still be on the look out for when it comes out of testing. An improvement on the wiki style, taking the best parts of different areas. \n\nAs for letting go of the system and leeting it work and tweaking it -reminds me of the recent newscientist.com article - Law and disorder - which talks about letting go of manual micromanagement control, and reaping the benefits.\n\nOne thing popped into my mind - in the future could boards move away from a liner vertical thread system, and actually go a more visual route, more analogous to actual threads - actually be able to visually able to tease apart different parts of the thread. Maybe asking too much! However, putting the current best answer next to the question and making that editable is a great step in of itself.\n\nKeep it up, sounds great :)\n\nTom"}, {"author_name": "Jörg W Mittag", "gravatar_hash": "1f1d81bc927dd67f05ea41f4c8a61e9f", "author_url": null, "date": "Aug 25, 2008", "message": "At about 20:20 when talking about OpenID there is a common misconception about OpenID, which I already meant to correct way back when you originally mentioned it on the Stack Overflow Podcast:\n\nWhen you implement OpenID you *do not* pick up an additional dependency on an external service. You *trade* one external dependency against another: if you have a \"Lost Password\" link that allows a user to reset their password and e-mail it to them, you have *already* made the decision to outsource your user's security to an external e-mail provider. And you *already* trust your users to pick an e-mail provider that's secure.\n\nAll you do with OpenID is trade that dependency for an OpenID provider. So, you end up really the same as before.\n\nActually, you might even be better off, because now you have outsourced your identity to a provider who is actually specialized on identity instead of an e-mail provider whose security officer might not even realize the fact that they are also an identity provider.\n\nOf course, if you *do not* provide a \"Lost Password\" link or whitelist the e-mail providers that a user can use, then you will also want to whitelist OpenID providers or not offer OpenID at all: OpenID is not a panacea, it is not designed to replace every authorization scheme ever invented -- it is designed to replace e-mail based authentication.\n\njwm"}, {"author_name": "Matthew Hall", "gravatar_hash": "9a5b8b9ad87e92bf875f774907ba9903", "author_url": "http://paperclips.sourceforge.net/", "date": "Aug 25, 2008", "message": "So.. is it too late to join the beta?"}, {"author_name": "Josh Parris", "gravatar_hash": "92f446269f65ef4213e94bd99aa3e475", "author_url": "http://parris.josh.com.au/", "date": "Aug 25, 2008", "message": "I can haz a beta invite plz?"}, {"author_name": "Ian Patrick Hughes", "gravatar_hash": "78897c96c45c02fa88b191c854fa83a8", "author_url": null, "date": "Aug 26, 2008", "message": "And, yes, 'hate' is a strong word for webforms, btw. :)"}, {"author_name": "Fred", "gravatar_hash": "18b73f008d7150071f1adab758290a29", "author_url": null, "date": "Aug 27, 2008", "message": "Hi,\n\nI have not seen the badge system.  \nI saw the first similar thing to what you talk about in the Wolfenstein games (I do not own a Xbox). \n\nAt least Enemy Territory had this where your abilities improved when you did good things. \nhttp://en.wikipedia.org/wiki/Wolfenstein:_Enemy_Territory\n\nThe newer Enemy Territory Quake Wars has even more elaborate stats and they are public. Have a look at\nhttp://stats.enemyterritory.com/\n\nOne can compare ones skills in many dimensions with friends and others.\n\nAlso maybe that would be a useful reference when looking for a new job. Will stackoverflow badges become a point on your resume ? Like participation in open source projects, and similar things not directly related to former employers."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": null, "date": "Aug 27, 2008", "message": "Stack Overflow user gomercobs has an \"exists\" function for jQuery.\n\nhttp://stackoverflow.com/questions/31044/is-there-an-exists-function-for-jquery"}, {"author_name": "Isaac Lin", "gravatar_hash": "408975adb6e2f531f290e7fe0209a3a9", "author_url": null, "date": "Aug 28, 2008", "message": "When you say during the recording that the site should be able to run by itself without any intervention, I feel you are forgetting the lessons expressed by one of your idols, Clay Shirky, in his talk, \"A Group is its own Worst Enemy\", and the examples he gives such as LambdaMOO:\nhttp://www.shirky.com/writings/group_enemy.html\n\"LambdaMOO Takes a New Direction\": http://www.cc.gatech.edu/classes/AY2001/cs6470_fall/LTAND.html\n\nShirky's thesis is that human nature being what it is, attempts to have a purely technological way of controlling social interaction invariably fails, and so any tool that involves social interaction should take this into account. I know you think you have come up with ways to give incentives for desired behaviour, but I believe you need to think more like a persistent bored teenager trying to game the system (perhaps working together with others, or using sock puppets). For example, game-playing users could post lots of trivial questions and answers, and post links to them in some common forum, so they can vote for each others' answers.\n\nI also think you may not have given enough thought to the consequences of your point system; as pointed out by Michael, with a high barrier to being able to fully edit a post, the system may end up dominated by hardcore early adopters (e.g. beta testers) who attained a high reputation rank. The casual newcomer may not want to make how ever many posts will be required to attract enough people to vote up their posts, so the only new users with full edit capability (i.e. those who can integrate the latest information and combine together all additions into a more sensible whole) will be fanatical badge collectors who are willing to exploit the rules to inflate their rank."}]}