{"response": [{"author_name": "Joel Spolsky", "gravatar_hash": "d1129adecd8c4e2a22b50605d18e376d", "author_url": "http://travel.stackexchange.com", "date": "Nov 30, 2011", "message": "<p>The problem with that question was that it wasn't real... it wasn't a question that someone was actually having, just an entertaining conversation topic.</p>\n\n<p>Think about it this way... if we allowed questions that weren't real, you could go to the travel site and ask:</p>\n\n<ul>\n<li>What is the best way to get from the Miami airport to Downtown Miami?</li>\n</ul>\n\n<p>And we'd allow it. then you could ask</p>\n\n<ul>\n<li>What is the best way to get from the Denver airport to Downtown Denver?</li>\n</ul>\n\n<p>And we'd allow it. And then you'd realize that you could ask 1,000,000 questions, one for every airport in the world.</p>\n\n<p>Thus, the rule: only real questions, please... not conversation-starters.</p>\n"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Dec 06, 2011", "message": "<p>The travel site seems to be fine with localized questions like that: http://meta.travel.stackexchange.com/questions/264/should-localized-questions-with-generic-answers-be-generalized</p>\n\n<p>is this in sync with what you say or not? My gut feeling is that this is a problem, because these are essentially shopping questions and as you say, there are potentially millions of them. I'd much rather see some generic \"how to find travel information and routes in x country\" type questions. But the travel community seems to disagree with me, so this can be a special case.</p>\n"}, {"author_name": "Joel Spolsky", "gravatar_hash": "d1129adecd8c4e2a22b50605d18e376d", "author_url": "http://joelonsoftware.com", "date": "Dec 07, 2011", "message": "<p>You see, if the rule is \"only real questions,\" then you won't get a million bogus questions -- you'll get things where there really is a hole in the internet. The internet might have good information about getting to the Denver airport but be surprisingly crappy about Albuquerque.</p>\n"}, {"author_name": "Shelby Moore III", "gravatar_hash": "def49e4f02dea4911a431380ac6ec823", "author_url": "http://copute.com", "date": "Dec 08, 2011", "message": "<p>Should it cost some rep to ask a question?</p>\n\n<p>Currently afaik, the only deflation of rep money supply is via negative performance (down vote), which costs both parties.</p>\n\n<p>The rep could be awarded to the winning answer.</p>\n\n<p>Wonder if people might spend real money to ask questions. Would the rep ever be convertible to fiat?</p>\n"}, {"author_name": "Jon", "gravatar_hash": "2f91e7ffad34f35c3d035838acf156ac", "author_url": null, "date": "Dec 21, 2011", "message": "But if the question is accepted by the community, as reflected in upvotes, favorites, views, and answers, why does \"not a real question\" or \"too subjective\" supercede this? The community has said that they don't mind that this question isn't real/subjective."}, {"author_name": "Piskvor", "gravatar_hash": "96036d8a66279598cc0ae0ea3181edbb", "author_url": null, "date": "Dec 22, 2011", "message": "@Shelby Moore III: AFAIK, this has been suggested a myriad times on Meta.SO, and promptly declined in each case. People are willing to cheat, lie, and murder (or at least sockpuppet and falsely spam-flag) for manipulating an integer of questionable value; linking this to actual currency (intrinsic value of money aside) would multiply these problems thosandfold.\n\nFor further reading, you may want to start here: http://meta.stackoverflow.com/questions/21238/why-cant-people-make-money-off-stackoverflow-just-like-a-regular-personal-blog and continue through the related/linked questions."}, {"author_name": "WordPress DoSnet", "gravatar_hash": null, "author_url": "http://codeseekah.com/2012/04/18/wordpress-dosnet/", "date": "Apr 18, 2012", "message": "[...] stackoverflow.com [...]"}, {"author_name": "Moderation As A Positioning Tool &laquo; The Alliance manual", "gravatar_hash": null, "author_url": "http://alliancemanual.wordpress.com/2012/04/30/moderation-as-a-positioning-tool/", "date": "Apr 30, 2012", "message": "[...] quote is worth reading from the ever-terrific StackExchange blog: I’ve come to realize that the conservative school of community moderation is the right school of [...]"}]}