{"response": [{"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Nov 02, 2011", "message": "Interesting stuxnet - malware from the PLC architecture...very nice."}, {"author_name": "Christopher Allen-Poole", "gravatar_hash": "4092d1b87964c221b032b0c6e28bffe3", "author_url": "http://allen-poole.com", "date": "Nov 02, 2011", "message": "Typo: you have \"shooping rush\""}, {"author_name": "Christopher Allen-Poole", "gravatar_hash": "4092d1b87964c221b032b0c6e28bffe3", "author_url": "http://allen-poole.com", "date": "Nov 02, 2011", "message": "I posted a question about whether an uploaded file should have virus checks on <a href=\"http://security.stackexchange.com/questions/8610/should-there-be-an-anti-virus-used-on-client-provided-files\" rel=\"nofollow\">security.stackexchange.com</a>"}, {"author_name": "Ian", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Nov 02, 2011", "message": "I wish I could use the gMail 2 factor login, but I need to access gmail from at least one location that does not have a mobile phone signal.\n\nShame I can't set it up to be used only when I change my password."}, {"author_name": "Alex Miller", "gravatar_hash": "adecb788d681f6003080386a5202df2a", "author_url": "http://www.alexmiller.net", "date": "Nov 02, 2011", "message": "@Ian - you can set it up to remember a computer for 30 days.  Also, if you have a smart phone, you can get a time based code generator app (similar to the RSA dongles) or you can print out a list of one time use codes."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Nov 03, 2011", "message": "Not sure how third party sign-ins make things that much more secure. \nIsn't it like sharing a single passwd across every site you use?\n\nOK you don't have to enter that password into a million different idiot's systems - but a single exploit targeting either the openID provider or just faking their entry screen is going to catch a lot of people at once."}, {"author_name": "cwallenpoole", "gravatar_hash": "1186a46e65dbea4c8900d524c613f926", "author_url": "http://allen-poole.com", "date": "Nov 03, 2011", "message": "@mgb I think the key is that your single sign-on site actually knows what it is doing, where a number of other sites do stupid things like forget to use SSL or encrypt passwords.\n\nThat said, I am inclined to agree. That solution simply makes the \"everything depends on your email\" problem that much worse. Going with the weakest link analogy, this is minimizing the effects of a weakest link by getting rid of all but one of yours. That has its own concerns."}, {"author_name": "cwallenpoole", "gravatar_hash": "1186a46e65dbea4c8900d524c613f926", "author_url": "http://allen-poole.com", "date": "Nov 03, 2011", "message": "@ian I totally agree. There are certain times I simply don't want to have my cell-phone. Of course, my gmail password would require take brute force attack a few centuries, so I'm not terribly concerned."}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": null, "date": "Nov 05, 2011", "message": "The question of antivirus performance is a good one. I've worked with a number of coders who basically have Jeff's attitude that it can sap performance, but they're almost always working from gut feelings and no actual metrics. I can only stress that decisions should be informed by metrics that are as much as possible <b>not subjective</b>."}, {"author_name": "Bububaer", "gravatar_hash": "5a69936e147f8cb574e00dce8ab6e3de", "author_url": null, "date": "Nov 07, 2011", "message": "If you are interested in more stuxnet details, here is an excellent analysis:\nhttp://media.ccc.de/browse/congress/2010/27c3-4245-en-adventures_in_analyzing_stuxnet.html\n\nAbstract:\nThere has been many publications on the topic of Stuxnet and its \"sophistication\" in the mainstream press. However, there is not a complete publication which explains all of the technical vulnerability details and how they were discovered. In this talk, you will get a first-hand account of the entire story.\n\nWe will discuss various techniques used in analyzing Stuxnet. First, we will share several tricks that were used to quickly identify the vulnerabilities. Second, we describe the thought processes that went into debugging and triaging the vulnerabilities themselves. Finally, we show some tips that you can use if you feel like decompiling stuff for fun :)."}, {"author_name": "Duff", "gravatar_hash": "974938b8250a08cf9e22714aff1f9fcc", "author_url": null, "date": "Nov 07, 2011", "message": "@Ian\n\nIf you have an Android, iOS, or Blackberry device you can use the Google Authenticator app to generate two-factor codes without an internet connection.\n\nAlso, you can generate a set of one-time passwords that can be stored away safely on paper or some other secure storage area.\n\nSee:\nhttp://www.google.com/support/accounts/bin/answer.py?answer=1066447\n\nTwo factor IS a pain in the butt, but IMO, it is well worth the hassle."}, {"author_name": "Ninefingers", "gravatar_hash": "893b695548c4c8a5fcf91edb92785490", "author_url": null, "date": "Nov 09, 2011", "message": "Hello from an ITSec regular who has just caught up with the podcasts ;)\n\nBlatant promotion of our site now. We have a lot of authentication-related discussion on the use of passwords, how long to make them, whether changing them makes any difference, the relative merits of two-factor auth etc (we'd agree. Use gmail's two factor auth). See http://security.stackexchange.com/questions/tagged/passwords?sort=votes&amp;pagesize=50 for example. We also run a blog covering the \"best of\" from the site (our QOTW) as well as user-contributed security-related articles, posts and discussions. See http://security.blogoverflow.com/. \n\nSo if you're interested, feel free to come over and have a look around. Many of our regular users also use the chat system - http://chat.stackexchange.com/rooms/151/the-dmz. We're always after new members and blog contributors.\n\nA very interesting podcast - thank you very much!"}, {"author_name": "Ed", "gravatar_hash": "938c7f80df7d976bb5cf121a1c5f11f0", "author_url": null, "date": "Nov 17, 2011", "message": "I usually find a lot of value in the SE PodCasts, but something has really been bugging me about them lately... and this episode has brought the issue to a head for me.  Like Jeff admits, I too have something of a man crush on Mark Russinovich.  This guy is flat out amazing.  I wanted to hear great questions put to him and to have him allowed the time to speak and for me to learn.  What I got was YOU talking, and talking, and talking... and Joel, you could've at least done him the courtesy of pronouncing his name correctly.  If you're going to have a guest on, please allow THEM to talk.  Half the time it's like your guests have to flight with you to get a work in edgewise.  Joel is huge offender in this area.  Joel, please, for the love of god, STFU every now and then...   \n\nI'm sorry if this comes across as Joel bashing, and I think it's really important to emphasize that I do enjoy many things you say (especially your delightful sense of humor).  Shows with you, Jeff, and Alex are perfectly enjoyable and stimulating and I know what I'm getting in the end.\n\nHowever, I think you guys really need to rethink the movement to having guests.  If you're going to have them on, take this commitment seriously.  I'd like to see this podcast as something of a Venn diagram with the following circles:\n\n* Open communication and transparency of your business\n* Jeff, Joel, and Alex (talent)\n* The guest(s) experience and expertise\n* Your audience's interest and time commitment\n\nThe optimal webcast is going to be at the intersection of these circles.  When things get out a whack, I find myself in one of two mental states: bored or frustrated and I think you're leaving a lot of value on the table."}]}