{"response": [{"author_name": "russ", "gravatar_hash": "fb8f14461d037d601087c32f9fa9fea5", "author_url": "http://tinisles.com", "date": "Nov 09, 2011", "message": "See Chip &amp; Pin get hacked here:\nhttp://www.youtube.com/watch?v=JPAX32lgkrw&amp;wadsworth=1\nhttp://www.cl.cam.ac.uk/research/security/banking/nopin/\n\nAdmittedly it's _better_ than other credit/debit cards, and the attack does require possession of the chip card."}, {"author_name": "VonC", "gravatar_hash": "4fc12eea3fb81ede59d064d0fdbb84ab", "author_url": "http://stackoverflow.com/users/6309/vonc", "date": "Nov 09, 2011", "message": "What do you mean \"DevDays no news\"?\n\nThe original DevDays London for this year are still going as scheduled, next Monday 14th and Tuesday 15th ;)\n\nSure, they are now only for 80 people (there are still a few places left), only 200£, and are called CodeKen London 2011:\n\nhttp://london2011.codeken.com/\n\n(Thank you Jon Dickinson, for organizing it: https://plus.google.com/106595912319775839298/posts)"}, {"author_name": "Jon", "gravatar_hash": "6e23a78f0b54aa7d8ab4844a57273f1e", "author_url": null, "date": "Nov 09, 2011", "message": "Where is the promised picture of 18 year old Joel."}, {"author_name": "mills", "gravatar_hash": "66637a674c54c8cbd202327d5b70fb4a", "author_url": null, "date": "Nov 09, 2011", "message": "Will the moot appearance be rescheduled? I was really excited to hear his interview with you guys."}, {"author_name": "Stephen Hart", "gravatar_hash": "803700d3d6549deff1353ac574fc1beb", "author_url": null, "date": "Nov 09, 2011", "message": "Chip/PIN is a great system for the CC companies, not so good for the user.  If someone learns your PIN by looking over your shoulder or watching through a camera, then steals the card, they can max it out and you have no recourse - you have agreed to be responsible for any transactions with a valid PIN.  This does not get recorded on the CC company's stats as credit card fraud, so it looks like the system is more secure.  With signed credit card slips, you have proof that it isn't your signature. \n\n   Advice - use a CC with a low limit like $500 or $1000 for wandering around shopping or a debit card with a low daily limit."}, {"author_name": "Benjol", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Nov 09, 2011", "message": "Just want to echo VonC's comment. From the outside it definitely looks like you're giving the CodeKen alternative the cold shoulder."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Nov 10, 2011", "message": "Past experience says we're not going to hear anything but crickets on the issue. Oh, if it only were different...."}, {"author_name": "slmingol", "gravatar_hash": "6a61a40ee46871d39e99835351e178ef", "author_url": "http://www.lamolabs.org/blog/", "date": "Nov 10, 2011", "message": "In case anyone is looking for the link to the Mathematics of Tetris question mentioned during the podcast: http://math.stackexchange.com/questions/80246/the-mathematics-of-tetris"}, {"author_name": "Auron", "gravatar_hash": "c2953d47b6de83f3217b48c3584fab1c", "author_url": "http://www.garthof.es", "date": "Nov 11, 2011", "message": "I certainly enjoyed more the bus between Malmö and Copenhagen than the train: a big bus for just a few people, better views of the bridge and the sea, and, if I remember exactly, cheaper."}, {"author_name": "Dan", "gravatar_hash": "c5355f878186f8cc7feade633022683d", "author_url": "http://u2tech.wordpress.com", "date": "Nov 11, 2011", "message": "I just moved from the Australia (which has Chip/PIN or optional signature) to the US and it was one of the first things I noticed.\n\nI'm surprised by how lax stores are with CC's over here. In Australia when I used to sign, they would actually compare the signature to what I sign on the receipt. Here my card is back in my wallet before I sign. Not to mention I've paid for $100+ items and not had to sign at all!"}, {"author_name": "Brett B", "gravatar_hash": "7adf1b998962e2c12b80361c882dea0d", "author_url": null, "date": "Nov 13, 2011", "message": "LambdaMOO, which is still a going concern, has had elections for its \"Architecture Review Board\" for probably over 20 years now. It's the only example I'm familiar with."}, {"author_name": "Cass", "gravatar_hash": "1973c6bd369d2f789061e0634b22b045", "author_url": null, "date": "Nov 22, 2011", "message": "Since you were looking for websites that hold elections: The Organization for Transformative Works (http://transformativeworks.org/) just finished its annual board elections. It's a non-profit dedicated to promoting and protecting transformative/fannish works, staffed entirely by volunteers from the community. The election was a bit of a wankstorm this year, so if you're looking for a case study on how not to do things..."}]}