{"response": [{"author_name": "MBraedley", "gravatar_hash": "faee7c8a4f200567714ca387446d8721", "author_url": null, "date": "Nov 17, 2011", "message": "Point of interest, Facebook is no longer sending out CDs, or even the entire record of you interaction with them anymore.  Apparently, too many people took advantage of the service, and they became overloaded, and so scaled back."}, {"author_name": "cwallenpoole", "gravatar_hash": "1186a46e65dbea4c8900d524c613f926", "author_url": "http://allen-poole.com", "date": "Nov 17, 2011", "message": "@MBraedley So how do they get around the laws in Germany (and the EU in general). Or is this only a US thing?"}, {"author_name": "G", "gravatar_hash": "b6733874a375a41e582cc5e119909240", "author_url": "http://devnotes.posterous.com", "date": "Nov 17, 2011", "message": "THANK YOU!  thanks for summarizing the trajectory of the conversation and topics.  Really appreciated."}, {"author_name": "Simon Buchan", "gravatar_hash": "ea6872cf5f32040741eabf1e7e089416", "author_url": null, "date": "Nov 17, 2011", "message": "I'm not sure what Dave's talking about with Google Reader, it is absolutely an aggregator. Maybe he wants posts to appear without clicking refresh (which would be nice if it's ascending by time so they appear at the bottom), but the only time you see only one feed is when you select one feed. I generally use folders to see a subset of my feeds at once (news, comics, programming blogs, gaming blogs, etc...)"}, {"author_name": "Adam", "gravatar_hash": "67585539b54698aa055c35805b807f32", "author_url": null, "date": "Nov 18, 2011", "message": "Great podcast! I've never been a fan of Dave Winer, but although his communication style still grates on me, I discovered I agree strongly with him on most issues. (though I still think there's a distinction between government and business)\n\nProbably the best podcast since #22 IMO."}, {"author_name": "cwallenpoole", "gravatar_hash": "1186a46e65dbea4c8900d524c613f926", "author_url": "http://allen-poole.com", "date": "Nov 18, 2011", "message": "@Simon I'm inclined to agree -- either he is opposed to bulk content, or he is being pedantic. Because of the sheer size of an item in Google reader, it is nigh impossible to track everything accurately if it is continuously loading. Perhaps its more common use is not as \"a river\", but by his definition a river is completely incapable providing any real depth or substance. \n\nPeople don't sign on to twitter to get real information, they go there for bullet points. It is not substantially different from a news ticker, which represents only the most shallow of the shallow.\n\nIf this gentlemen is seriously suggesting that this is a worthy way to spend one's life, then we should have serious concerns."}, {"author_name": "Listener", "gravatar_hash": "643791363b9abebf0d23d5b4049486fa", "author_url": null, "date": "Nov 19, 2011", "message": "The hosting of this podcast is very unreliable. Always cuts out a short way through."}, {"author_name": "Listener", "gravatar_hash": "643791363b9abebf0d23d5b4049486fa", "author_url": null, "date": "Nov 19, 2011", "message": "I try and download the mp3, download fails 30% through and a refresh gets me this:\n\nAn error occurred while processing your request.\nReference #50.86a96d4d.1321710874.1c64bfff"}, {"author_name": "Greg", "gravatar_hash": "2bcafd7457eff8a539deb22078cc14c3", "author_url": null, "date": "Nov 19, 2011", "message": "Dave was the worst guest you've had in a while.  Way too high up on a pedistal.  Thank you Alex for speaking some common sense."}, {"author_name": "Mike Warren", "gravatar_hash": "fca20f14a7459b3c6df7f1bb2458cfc4", "author_url": null, "date": "Nov 21, 2011", "message": "I thought this was my favourite (although I haven't listened to them all), Dave was really interesting and spoke a lot of sense. \nI loved the simplicty of XML-RPC when I came accross it years ago, but didn't know anything about who had pioneered it, and was appalled at the non-simplicity of SOAP. \nAlthough I'm not quite sure on the definition of a \"river of news\", isn't that what google reader gives me? If all the items were expanded I think it would be unmanageable, but be interesying to see the finished symphony. Anyway I've added scripting news to google reader for now."}, {"author_name": "Les Orchard", "gravatar_hash": "b45c48fc9e05922e2f368a9d7d7d8de1", "author_url": "http://lmorchard.com", "date": "Nov 22, 2011", "message": "@Simon and @cwallenpoole: Dave didn't say Google Reader isn't an aggregator. He said it's not a *river of news* - it's the difference between navigating a twisty series of canals vs just cruising down the Mississippi. \n\nAnd there's plenty of depth there: Skim through headlines, open tabs in the background for further reading, use Instapaper or Read It Later as a queue, etc. Your news reader doesn't have to work just like your email client.\n\nI've alternated between Google Reader and Dave's news reading tools for years, and I keep going back to Dave's. My feed reading list has fluctuated between 800 and 1500 feeds, and the river of news style of simplicity actually lets me manage to get through the bulk of that flow - believe it or not."}, {"author_name": "Les Orchard", "gravatar_hash": "b45c48fc9e05922e2f368a9d7d7d8de1", "author_url": "http://lmorchard.com", "date": "Nov 22, 2011", "message": "But, also, in Google Reader you can (and I have) gotten something river-like with folders. You see the combined stream of all the feeds in that folder. But, still, whenever I go back to a pure single-stream river, I find that I'm able to cruise through things so much faster than when I'm trying to be clever and organize things.\n\nDave's river of news tools have no unread counts, usually never any pagination, never any folders. You just get a stream of news, where the space bar and the scrollbar are your primary navigation. Seriously streamlined and stripped down, gets out of the way of the news.\n\nI don't want to overblow it, but this is the kind of paring down that Apple gets props for."}, {"author_name": "mbreslin", "gravatar_hash": "eab5001068e7e14fed338580ceefc3d1", "author_url": null, "date": "Nov 22, 2011", "message": "@Les:\n\nI certainly appreciate the 'river of news' method of reading feeds, folders seem to work better for me as I don't always care to read all of my feeds at a given time. However, I take issue with saying google reader isn't a river of news aggregator. There are a lot of features but you don't have to use any of them, simply set the page to list view and click the all items link and there you go. It's every bit as compact and streamlined as any other ron-type reader. \n\nI personally have never cared for reverse chronological order as I like to work my way threw to the newest. Reader is reverse by default I believe as I always have to change my feeds to go the other direction. No matter what folder your items happen to be in when you click the all items link they appear exactly in chronological order."}, {"author_name": "Chess", "gravatar_hash": "6bddbaa1130994585821490039200bf5", "author_url": null, "date": "Nov 22, 2011", "message": "This podcast isn't listed in InstaCast's directory but I can add it manually with a 'pcast' url (?), what would the url be?"}, {"author_name": "twqqis", "gravatar_hash": "8a76764015c059a992f85fb6c5f4a09c", "author_url": null, "date": "Nov 29, 2011", "message": "I think you're all getting stuck on the details, for example the 'river of news' thing mentioned in previous comments. What I take from this, looking from a higher level, is that people are waking up from the idea that large corporates are using (and controlling) their output to generate wealth. These corporates are hiding their actions, and aren't clear on their use/policies/intentions/etc; they're basically abusing people's content under a layer of incomprehensible T&amp;Cs or false trust.\n\nI think some people are slowly waking up to that, and we're now seeing the beginnings of change. Dave Winer has ideas on how to do certain things in a different way, and I'm very sure in the time ahead more like him will emerge."}]}