{"response": [{"author_name": "Ambo100", "gravatar_hash": "13bfc4b1fdb0d67e664981c65ee1a8ee", "author_url": null, "date": "Nov 30, 2011", "message": "I have a question for Joel. What microphone do you use?"}, {"author_name": "slillibri", "gravatar_hash": "86e545a501fd187dbac4867bb22adf33", "author_url": null, "date": "Nov 30, 2011", "message": "For Joel, so he can know what the next podcast is\nhttp://whatsthenextpodcast.heroku.com/"}, {"author_name": "Joel Spolsky", "gravatar_hash": "d77663c217e9d27b725338c06674c94b", "author_url": "http://joelonsoftware.com", "date": "Nov 30, 2011", "message": "thanks slillibri!"}, {"author_name": "Kenny", "gravatar_hash": "b327e6e9fd81483fc0143fb7b2d77d48", "author_url": null, "date": "Dec 01, 2011", "message": "Hey, \n\nI don't remember which podcast it was, but one of you was saying that in BF3 it's tricky to keep your friends together, e.g. while showing a friend new tricks etc.\n\nI just have to say this: my gf and I played BF2 (different rooms) a lot, and we always had a hard time organising joining the same server (third party voip, wait lists on servers etc) and then joining the correct team (as you're usually auto-assigned, so you have to suicide and switch team) then squadding up. Etc.\n\nThe Xbox 360 has this solved proper-style: \"Parties\" - Xbox Live Parties have been keeping together folks in-game like this and doing out-of-game voip to allow the organisation around server-choice etc and you \"follow\" each other into the same servers etc. It's like magic, coming from the PC, getting all that for \"free\".\n\nI've just bought an Xbox too, so I can pilot, and she can gun, just like the old days on the PC with BF2."}, {"author_name": "Andy", "gravatar_hash": "811103db4bcf408dba46a72f95628429", "author_url": null, "date": "Dec 01, 2011", "message": "Kenny, the PC version of BF3 has the exact same thing on Battlelog.  You create a party that has it's own VOIP and when you join a server it puts you on the same team.\n\nNow all we need is VOIP in-game for squads, at least."}, {"author_name": "Alex Miller", "gravatar_hash": "adecb788d681f6003080386a5202df2a", "author_url": "http://www.alexmiller.net", "date": "Dec 01, 2011", "message": "It's an <a href=\"http://www.electrovoice.com/product.php?id=91\" rel=\"nofollow\">EV-RE20</a>"}, {"author_name": "Frank Comparison", "gravatar_hash": "a87cb334256c56beab358591d1e7e055", "author_url": null, "date": "Dec 05, 2011", "message": "Another great podcast. Chris has got a lot more articulate than the first time I heard him speak; probably something to do with him just getting older! A good balance of presenter and guests."}, {"author_name": "Ambo100", "gravatar_hash": "13bfc4b1fdb0d67e664981c65ee1a8ee", "author_url": null, "date": "Dec 05, 2011", "message": "@Alex Miller, Wow, that's got to be expensive. I'm sure it's worth it though."}, {"author_name": "Krox", "gravatar_hash": "ab1521ffa78d49f269f28f74069520e6", "author_url": null, "date": "Dec 08, 2011", "message": "Some nice trolling by moot there.\n\n\"We had over 9000 applications.\"\n\nhttp://knowyourmeme.com/memes/its-over-9000"}, {"author_name": "erickson", "gravatar_hash": "ffbf4e85b8ffbae4e9039b9c0cf07bc8", "author_url": null, "date": "Dec 09, 2011", "message": "I wanted to comment on the SOPA/Protect IP discussion.\n\nIt seems to me that these laws are really aimed at WikiLeaks. At least they would be very effective at criminalizing any support of such sites.\n\nMaybe the RIAA and MPAA are just cover, or just someone Congress can extract some money from for something the State Dept. was going to make them do anyway.\n\nWhat do you think?"}, {"author_name": "Greg", "gravatar_hash": "7cbe0d5d91e17cf0078dfe2bbeb5385d", "author_url": null, "date": "Dec 10, 2011", "message": "For Christ's sake, Joel!  You have to figure out how to stop saying \"Uhhh\" and \"Ummmm\".  I know everybody does it, but you do it to a maddening extent.  You host a public broadcast and need to learn how to overcome it."}]}