{"response": [{"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Mar 02, 2012", "message": "An excellent post if I should say so myself.  Great job!"}, {"author_name": "Uval", "gravatar_hash": "4a89776ad0caa7ac44eb10a2610dec1d", "author_url": null, "date": "Mar 02, 2012", "message": "Haven't you mixed up the legend colors in the \"Job Application Over Time\" diagram? It would make more sense if application via profile would be more popular now (i.e. should be blue)."}, {"author_name": "Uval", "gravatar_hash": "4a89776ad0caa7ac44eb10a2610dec1d", "author_url": null, "date": "Mar 02, 2012", "message": "Sorry, no mix up (should have read more closely before submitting :)"}, {"author_name": "Danny", "gravatar_hash": "a4a032fd90f7f7e615371a138035eb22", "author_url": "http://stackoverflow.com/users/375/danny-whitt", "date": "Mar 03, 2012", "message": "Wow!  This is an excellent and thought-provoking piece, Dennis.  Something, somewhere inside if me has always understood this and this post kinda' brings it all together... Thanks!"}, {"author_name": "James Bond", "gravatar_hash": "495a33696519c6a722cde26835678c09", "author_url": null, "date": "Mar 03, 2012", "message": "I have an interesting UX problem with the submittion process - I start the application but I just want to quit in the middle - I didn't see an obvious way(close/exit button or keyboard's Esc) to do that."}, {"author_name": "Nathan @ Blogspot SEO", "gravatar_hash": "892da2e33795e46548830f2644b236f2", "author_url": "http://www.blogspot-seo.com/", "date": "Mar 04, 2012", "message": "I have always used Google Analytics to analyse how a user navigates through my website, then after being able to improve navigation and how a user can access certain content (amongst other things). I noticed you mentioned another tool called KissMetrics; what does this bring to the table that Google Analytics doesn't? Thanks Demis"}, {"author_name": "Karim Adel", "gravatar_hash": "2b7a747b6b87730a84ad1c30e08fd604", "author_url": null, "date": "Mar 05, 2012", "message": "Great post.\nbut i have a question , why you want to host the CVs at a 3rd party?\nwhy not host the CVs at your site? and then the viewer can be created by converting the doc or pdf to swf (flash) and displaying it using flash (something like FlashPaper)\ni think this method wont have the latency problem.\njust wondering :)"}, {"author_name": "www.realjobs.com.au", "gravatar_hash": "36b6fe38a09145199ad3a8b0b706b136", "author_url": "http://www.realjobs.com.au/", "date": "Mar 05, 2012", "message": "So... what was the end result of your research?\nHow are you handling viewing the CV's?"}, {"author_name": "Demis Bellot", "gravatar_hash": "1257196ff88132651f94ac85f662c038", "author_url": "http://www.servicestack.net/mythz_blog/", "date": "Mar 05, 2012", "message": "@Karim KissMetrics allows us to do in-app specific metrics, i.e. important Customer Actions we want to record independently - Google analytics provides the general traffic overview of the site."}, {"author_name": "Karim Adel", "gravatar_hash": "2b7a747b6b87730a84ad1c30e08fd604", "author_url": null, "date": "Mar 06, 2012", "message": "#Demis Thanks for your reply. but i think you misuderstood my question.\ni was asking why you didn't implement the document viewer by hand instead of using outside solutions like \"Google Docs\", \"Zoho Viewer\" and Scribd?\nthis can be done by converting the uploaded document to pdf and then converting the pdf to a flash viewer.\ni think the pluses of implementing this solution by hand is that you can control the performance and latency instead of being dependant on a 3rd party."}, {"author_name": "Ian", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Mar 06, 2012", "message": "Letting the job seeker post their own CV, means your clients don’t need to have a system on their website for anyone to apply for a job, as they can just link to the advert you are hosting.\n\nShould you allow all employers to put free adverts up that are only seen if accessed by a direct link.  Then employers will be able to use you for the work flow for ALL jobs including jobs they don’t wish to pay to advertise with you."}, {"author_name": "Demis Bellot", "gravatar_hash": "1257196ff88132651f94ac85f662c038", "author_url": "http://www.servicestack.net/mythz_blog/", "date": "Mar 06, 2012", "message": "Apologies @Karim my answer was for @Nathan :)\n\nBasically because we didn't trust the conversion tools to do a great job with the various formats and layouts of CVs we receive. We simply preferred to outsource the conversion/viewing to companies that specialize and build their business models around online document conversions / viewers."}]}