{"response": [{"author_name": "Aaron", "gravatar_hash": "0cbe44e566b0668184262f7d35b44829", "author_url": "http://icelava.net", "date": "Mar 05, 2012", "message": "I didn't really find it that big a deal. I lost over a thousand points but life goes on unaffected and per normal.\n\nIt's not like I lost that hard-fought epic dagger and leather boots. :-)"}, {"author_name": "Tom Wijsman", "gravatar_hash": "d3b75bb3bda58d5d4a7d31b820f856c9", "author_url": null, "date": "Mar 05, 2012", "message": "Where can I request \"we won’t display reputation lost to deleted questions on your profile unless you explicitly ask for it\"?"}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": null, "date": "Mar 05, 2012", "message": "@Tom Wijsman\n\nIt's going to be a pref or checkbox or similar on your profile, not a request to a person or the company.  We'll be getting that deployed soon-ish, as Shog said we're rolling pretty much all of this out as we speak."}, {"author_name": "Matthew Read", "gravatar_hash": "9f45abdea17c709041812609c7fdfb69", "author_url": null, "date": "Mar 05, 2012", "message": "Great solutions guys.  Well done, as usual."}, {"author_name": "Cody Gray", "gravatar_hash": "3f8912af19fe86b7b34a0b011a962460", "author_url": null, "date": "Mar 05, 2012", "message": "It's fantastic that you're listening to the community and trying to come up with workable solutions. The past few days have been a bit of a trying time for the Meta crowd, occasionally bordering on some unconstructive discussions, but it's very reassuring to see that our voices are heard and something good can come out of the banter. \n\nI like the solutions you've come up with so far; they seem like a great compromise for both sides of the debate. I wasn't originally convinced that reputation for these questions needed to be preserved, but you make a very compelling argument in favor of it."}, {"author_name": "Mehrdad", "gravatar_hash": "df0bd8a818111607704dab056fcfc091", "author_url": "http://mehrdadafshari.com", "date": "Mar 05, 2012", "message": "I miss the boat programming question and cannot find it anywhere. That one was a hard delete by Jeff, and is not visible, even to 10k+ users. Anyone knows where it can be found? \n\n(Better yet: can we have it in the archive thingy?)"}, {"author_name": "Adam Rackis", "gravatar_hash": "405f9b1b8904fbebe7c29246a3821797", "author_url": "http://adamrackis.com", "date": "Mar 05, 2012", "message": "This is a great, pragmatic fix.  Thanks!"}, {"author_name": "kaiser", "gravatar_hash": "b633452832ed5613b18a4432b0149ae9", "author_url": null, "date": "Mar 05, 2012", "message": "+1 for @Tom Wijsman Q"}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": null, "date": "Mar 05, 2012", "message": "The third point is a very welcome change. While some might believe otherwise, moderators would rather leave deletion up to the community unless it requires immediate intervention.\n\nI think we'll still get cases where users will ask us to help speed the process along (I wish more 10k+ users cast delete votes), but I think this change allows us to not take action in many cases.\n\nAs for reputation, I just have to figure out how to make sure my Meta rep stops overtaking my rep on the main site :) Sigh, time to place more bounties. Seriously, bounties are the Jenny Craig of rep diets."}, {"author_name": "Maxim Zaslavsky", "gravatar_hash": "de9ed68c2a16bee84feff09f6df58b47", "author_url": null, "date": "Mar 05, 2012", "message": "How is the updated reputation system implemented, in terms of keeping the information always up-to-date?"}, {"author_name": "Gamecat", "gravatar_hash": "0b4b433679e1fb52f7e2ef4ea492496d", "author_url": null, "date": "Mar 06, 2012", "message": "Keep up the good work.\n\nFirst I was annoyed due to the recent delete marathon, but then again, site quality is more important than personal reputation. And this morning it looks like most of the deleted questions are undeleted anayway so I'm experiencing some kind of reputation roler coaster, which is kind of fun (and I don't have to throw up afterwards)."}, {"author_name": "jalf", "gravatar_hash": "de77b4f64cbf825db2a08128228dc929", "author_url": null, "date": "Mar 06, 2012", "message": "This sounds good, and I'm very pleasantly surprised that you didn't just treat it as a \"people are upset that their rep score went down\", but actually addressed the existing problems that were made more visible by it.\n\nOf course it remains to be seen what happens now. I still believe that a big part of the problem lies in the community culture itself, and we, the community *as a whole* will have to fix that somehow.\n\nAnything you at SE HQ can do to nudge things in the right direction is obviously welcome, but in the end, we need to make sure that MSO better reflects the community *as a whole*, and not just those who choose to participate on MSO.\n\nThe downright *shock* (and reactions of flat-out denial) when confronted with this, which those who do *not* frequently visit MSO know as a plain fact, was really very telling. And we, as a community, whether or not we frequent Meta, will need to fix that.\n\n&gt; I think we’ll still get cases where users will ask us to help speed the process along (I wish more 10k+ users cast delete votes), but I think this change allows us to not take action in many cases.\n\nBut we do. Those are votes to *not* delete. Every time I visit a question without voting to delete, I am implicitly voting to *not* delete it. The only way we can cast \"don't delete\" votes is by doing nothing. If you then perceive this as \"no one cares, and it *needs* to be deleted, so I'll do it myself\", then something went terribly wrong along the process. Our votes to *not* delete were transformed into laziness and an implicit consensus to delete."}, {"author_name": "mafutrct", "gravatar_hash": "a7c22254d91baa9ca18786a9d46549f0", "author_url": "http://mafutrct.de", "date": "Mar 06, 2012", "message": "jalf: You could upvote it, increasing the number of deletion votes required."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Mar 06, 2012", "message": "Small correction, Jalf - if you don't want something deleted, VOTE TO RE-OPEN IT! We should not be keeping very many closed, unlocked, posts around on the site outside of duplicates (which have value as \"signposts\" pointing to answered questions). \n\nSo if you think something has value as a living question, vote to re-open - no one gets to cast delete votes on open posts..."}, {"author_name": "jalf", "gravatar_hash": "de77b4f64cbf825db2a08128228dc929", "author_url": null, "date": "Mar 06, 2012", "message": "@Shog9: sure, but the same problem exists with close votes, then. I can't vote to \"keep open\". All I can do is wait until it has been closed, and then vote to reopen.\n\nThat's not a problem in itself, but it does mean that it's very dangerous to interpret \"there are too few close/deletion votes cast\" as \"people are lazy, and I need to speed this up\", because the reason it's slow going is that most people do not want it closed/deleted."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Mar 06, 2012", "message": "Since I have been critical in the past, I should note that this post seems thoughtful on the count of both ends -- not encouraging material you don't want, but not discouraging people who have contributed in the past.\n\nNow if we could only get a reasonable Captcha on the blog comments... :)"}, {"author_name": "Keng", "gravatar_hash": "15769bbea999aee421458f52e7c9d011", "author_url": null, "date": "Mar 06, 2012", "message": "I will be frank here, I don't really care what you guys do with rep but if you take away 20% of rep points again, I will take it personal and will do more than than I did last time (which was to school Jeff on how not to be a Troll when discussing a bad move on a social network site)."}, {"author_name": "bimargulies", "gravatar_hash": "e6eeaf8698180e971e169a925d8e0f4f", "author_url": null, "date": "Mar 06, 2012", "message": "Jalf's claim that every visit is a vote is just, in my opinion, silly. I google for something. I see a link/snippet that suggests utility. I visit. \"Oh, more obsolete bloviation about the best book evuh' or list of dumb jokes or whatever. If I want to upvote, I'll upvote. Don't count me in because I visited by mistake."}, {"author_name": "Coincoin", "gravatar_hash": "621f5ee6cf6e295d1b5fa45bde67c803", "author_url": null, "date": "Mar 06, 2012", "message": "Do you plan on reimbursing already lost rep? I lost quite a big chunk of it (15-20%) one or two years ago and I was basically told to stop complaining and live with it."}, {"author_name": "Norman Ramsey", "gravatar_hash": "7dd45a27a5616b8a5608b84007e4e08f", "author_url": null, "date": "Mar 08, 2012", "message": "How pleasant to know that something sane and sensible emerged from the firestorm!"}]}