{"response": [{"author_name": "Jeremy Banks", "gravatar_hash": "bd192f0a40308fe9ecb9aa2a72ee8d81", "author_url": null, "date": "Mar 22, 2012", "message": "\"if someone has invested serious effort into an answer and has linked to it on their blog or from their résumé, then snatching it from them without due consideration won’t endear them to you.\"\n\nI find it interesting that the team holds this position with respect to migrations, where the content is preserved and redirected-to, but not with respect to deletions, where it is gone for good."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Mar 22, 2012", "message": "We're hardly fans of useful content being deleted on a whim, @Jeremy. It takes four votes to migrate a question, but <em>at least</em> eight to delete. \n\nIndeed, there's been a whole lot more discussion in the past on deletion (including at least three dedicated blog posts) than migration. Because migration <em>is</em> less destructive. \n\nIt can still be rude. And unlike deletion, there's no community veto: once a post is migrated, the source is locked and the answers deleted - if the destination rejects it (by closing and deleting), it's gone without the origin getting a chance to override it. It breaks <a href=\"http://blog.stackoverflow.com/2009/04/the-stack-overflow-question-lifecycle/\" rel=\"nofollow\">the lifecycle</a>.\n\nSo sure, it's <em>usually</em> less destructive, and hence the bar is lower... But that's no reason to take it lightly."}, {"author_name": "caf", "gravatar_hash": "a8902021770f66465986c21ee4085b34", "author_url": null, "date": "Mar 22, 2012", "message": "Hallelujah! The migration police irritate me greatly.\n\nPerhaps once a question has been marked as answered, it shouldn't be possible to migrate it?  After all, the question writer was obviously happy with the response they got on the original site."}, {"author_name": "M.Babcock", "gravatar_hash": "a21a819be232ea239bc75ac94ef623bd", "author_url": null, "date": "Mar 22, 2012", "message": "Does your comment about migrating imply that I should stick with a chat on SO which more than likely belongs on SU or possibly SF? I personally find a challenge in answering network questions, but they have the ability to be seen as off topic once _they no longer are a programming question_. Is there any salvation from the crowd of SO users who believe SO only falls in the scope of programming questions (and hence refuse to help users diagnosing apparent network issues identified by their program running on the network)\n?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 22, 2012", "message": "&gt; It can still be rude. And unlike deletion, there’s no community veto: once a post is migrated, the source is locked and the answers deleted – if the destination rejects it (by closing and deleting), it’s gone without the origin getting a chance to override it. It breaks the lifecycle.\n\nThat's not the way it's supposed to be, though; I recommended that we implement ...\n\nhttp://meta.stackoverflow.com/questions/35744/allow-diamond-moderators-to-reverse-question-migrations/35800#35800\n\n... over a month ago. You may recognize it. :)"}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Mar 23, 2012", "message": "The only winners for migrations are moderators, who can now permanently dispose of questions at a whim.  Neither askers nor answers are happy when a question is migrated.\n\nConsider abolishing migrations altogether.  You can replaced by a new type of close vote (\"doesn't belong here\").  The close vote could have a suggestion for the appropriate site."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Mar 23, 2012", "message": "@Andomar, Moderators don't enjoy migration either.  If we wanted to \"permanently dispose of questions at a whim\" it would be a lot easier to just delete them.  There are exceptional cases like TeX where 99% of migrations go very smoothly, but migrations between most sites are just a plain hassle.\n\nWe already have the \"off-topic\" close reason, so \"doesn't belong here\" would be redundant.  It would be an improvement to be able to suggest a site rather than migrating a question.  (I'd also suggest searching on the target site before suggesting that the OP just repost their question.)"}, {"author_name": "Nick Chammas", "gravatar_hash": "9b7fe7ecbea69ba0bf0166b2d8c21b5f", "author_url": null, "date": "Mar 23, 2012", "message": "@Andomar - \"Neither askers nor answers are happy when a question is migrated.\"\n\nWhen an asker gets a better audience for his/her unanswered (or unsatisfactorily answered) question on the migrated-to site, then the asker will get better answers and they will be very happy. Likewise, the answerers on the migrated-to site will be happy to receive an interesting question they can answer. \n\nFor example, zespri was initially unhappy with the migration of his question from SO to DBA.  He thought it wouldn't get much attention.  Then, this happened: http://dba.stackexchange.com/q/14789/2660\n\nOf course, questions that are already answered to the satisfaction of the asker should generally stay on the site where they were first asked.\n\nI can understand that answerers on the migrated-from site will be unhappy to lose a question they can answer.  If they like answering that kind of question but find that those questions are better suited on another site, then they should start hanging out on that other site!"}, {"author_name": "Iain", "gravatar_hash": "5ed89f9c3282d40e51e5573a30a8fe97", "author_url": "http://serverfault.com/users/9517/iain", "date": "Mar 24, 2012", "message": "I'd like to see migrations stopped. \n\nContinue the voting but rather than migrate, leave the OP a comment to the effect that the question was considered off topic for this site. Tell the OP that it may be on topic for $VotingResultSite, leave them a link to 'Questions with similar titles' on $VotingResultSite and a link to $VotingResultSite's faq. \n\nIf the OP then decides they want to ask their question elsewhere they can copy+paste easily enough."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Mar 24, 2012", "message": "What an excellent suggestion, @Jeff...\n\n@Nick, this can certainly work, but it's not magic - there needs to be a clear advantage for both those asking and answering. Hence the focus on finding the right <em>community</em>: ideally both those asking and answering feel they're among their own, that they've been guided home - not shipped off to <a href=\"http://en.wikipedia.org/wiki/Devil%27s_Island\" rel=\"nofollow\">Devil's Island</a>...\n\nIMHO, this comes down to communicating intent. When I see a user with high reputation on both sites flagging an unanswered question for migration and then leaving neither comments nor answers before or after the question has been relocated, it's hard for me to understand why he bothered - think how this must appear to the person asking the question!"}, {"author_name": "Nick Chammas", "gravatar_hash": "9b7fe7ecbea69ba0bf0166b2d8c21b5f", "author_url": null, "date": "Mar 24, 2012", "message": "@Shog9, I agree that communicating the reasons for the migration, if really necessary in the first place, is critical. I've heard people say that first-time askers who have their question migrated rarely come back to Stack Exchange, and I understand why--it comes off as rude if not communicated clearly."}, {"author_name": "CodeInChaos", "gravatar_hash": "de77f20e754d01f28466b3bfe992da40", "author_url": null, "date": "Mar 26, 2012", "message": "The issue with comments is that if you're not explicitly telling the OP not to crosspost, he likely will.\n\nMigration flags are a bit strange. About half of mine get denied, the other half accepted, but I don't recognize a clear pattern. Typically those are questions which aren't really off-topic on SO, but fit another site much better.\n\nIn my experience migration leads to higher quality answers. The answers on SO are often bad or plain wrong(and still get upvoted)."}, {"author_name": "Clayton Stanley", "gravatar_hash": "5a4f9711c8d10c6a8e6d3d6cdaa439f4", "author_url": null, "date": "Mar 29, 2012", "message": "Why not think of sites as tags, and allow tagging questions with multiple sites? (seems reasonable for many SO, SF, SU questions). \n\nIt would of course get tricky for assigning reputation, but those are technical challenges."}]}