{"response": [{"author_name": "Shaun Farrugia", "gravatar_hash": "5b51a4d86dee6576be6c2faa6b8a0f4c", "author_url": "http://www.bugtank.com", "date": "Mar 01, 2012", "message": "Longtime listener, never called.\n\nJeff,\nThanks a ton for all of the hard work and courage you put into this.  You weren't just a technical leader for us, you were also a leader of men.  You taught a lot of us the importance of being honest with ourselves and having the courage to say what we want and what we see.  \n\nI loved the fun playfulness you described fatherhood with and I respect you so much for just being you, even in the face of people \"who know better\".   It was nice to see truth to power in a lot of cases; not a knock on joel, but many people would simply bend to whatever joel would say - you didn't.  I respect that.  Thank you for teaching me that what I hold in my head is just as important and valid as anyone else."}, {"author_name": "Ryan Tate", "gravatar_hash": "6c08091427764bcb7e0623c69603c27c", "author_url": "http://ryantate.com", "date": "Mar 01, 2012", "message": "I've listened to every episode (except this one, just downloaded), and it was fascinating to hear the thought process behind the scenes and to watch the idea of the site evolve over time. The moments when people were grumpy from overwork or when there were disagreements only made it more credible and authentic to the startup experience. There were also some excellent guests, e.g. Steve Yegge, and some great tangents, e.g. on the sometimes crazy religion around unit testing.\n\nCongratulations on accomplishing what you set out to accomplish, and thanks for making this podcast along the way, even when it must have seemed like a chore."}, {"author_name": "Sean Patterson", "gravatar_hash": "738d2d43b815d13c3ecdbaa5ed30986f", "author_url": "http://about.me/dillieo", "date": "Mar 01, 2012", "message": "All the best to you Jeff! I was fortunate enough to have started following your blog shortly before you announced StackOverflow, so was able to get in on the beta.  Your insights have been very insightful and helpful to me through all of this and I can't thank you enough. \n\nBest of luck on your next endeavors and the added family time! \n\nNow I gotta go clean out all my old \"answers\" that were really \"comments\" before the system was implemented..."}, {"author_name": "Eric Lippert", "gravatar_hash": "6fbdff3ffb6f111d172759b4f05bea0e", "author_url": "http://blogs.msdn.com/ericlippert", "date": "Mar 01, 2012", "message": "Thanks for the kind words guys, I appreciate it.\n\nIn the interests of total accuracy: I am far from being the lead designer of C#. Anders Hejlsberg is the lead designer of C#, Mads Torgersen owns the language specification, and we have numerous high-level architects like Peter Golde, Matt Warren and Neal Gafter on the design team as well. I'm just the design team member who is noisiest in the community. :-)"}, {"author_name": "David Heffernan", "gravatar_hash": "3c0aac2191718ef0309dbc034d9b9961", "author_url": null, "date": "Mar 01, 2012", "message": "Great work Jeff. Enjoy whatever comes next."}, {"author_name": "Ben", "gravatar_hash": "2a8e6cd0088eca2b96580d83b5c1238c", "author_url": null, "date": "Mar 01, 2012", "message": "Hey Jeff. You leave a huge legacy with the StackExchange group of sites. StackOverflow in particular has been of real benefit to me over the years. Thanks a lot."}, {"author_name": "Joel", "gravatar_hash": "ff4fcce308200db766517210582cd6cf", "author_url": "http://bestattendance.com", "date": "Mar 01, 2012", "message": "Thanks for all of your hard work Jeff.  I've learned a lot from your blog, podcast, and StackOverflow.  I think you made the world just a little bit better."}, {"author_name": "Kaveh", "gravatar_hash": "eef361d616082b83f1f1a1e74dc572d8", "author_url": null, "date": "Mar 01, 2012", "message": "Many thanks Jeff for creating SO and SE. I wish you and your family all health and happiness. Good luck in your future endeavors."}, {"author_name": "Dwight Brown", "gravatar_hash": "8e69fc2e2e071e51f54ebad3f1e0de68", "author_url": "http://www.sportsfirings.com", "date": "Mar 02, 2012", "message": "Is this the final Stack Exchange podcast, period, or just the last one with Jeff? In other words, will the SE podcast continue with just Joel, or perhaps with Joel and a different co-host?"}, {"author_name": "Martin", "gravatar_hash": "dc929a5f53d59c4a2fb222b79d194199", "author_url": null, "date": "Mar 02, 2012", "message": "I very much hope the podcasts will continue; I say this as someone who has listened to them all from #1 and even had a suggestion for a guest taken up. Joel has done one or two on his own and they went very well. The dynamic was different, but Joel is good at getting the best out of smart, opinionated guests and I would love to hear him continue."}]}