{"response": [{"author_name": "tim", "gravatar_hash": "94a0e83767dbc71db135454693540015", "author_url": null, "date": "Mar 06, 2012", "message": "The boat programming question should never have been deleted.  There was a great answer for that one."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Mar 06, 2012", "message": "I think this \"play the lottery\" vs. \"make the world better\" tension exists in all sorts of domains.\n\nAs a musician, should I plug away at small venues and write my music, or try to come up with a catchy jingle and hook that will get me famous quickly.\n\nAs a software developer, should I make some open source software work better, or should I try to come up with the next faddish game to run on Facebook?\n\nShould I blog well-thought and well-researched essays or glorified tweets with quick emotional reactions to the news or other people's posts?\n\n--\n\nI think the market allows some people to grind out a living making the world a better place, while allowing space for people to \"play the lottery.\"\n\nAnd I think the reputation system as it stands can do the same thing.  How many times will people lose on lottery posts and keep playing?  Doesn't the reputation system prevent them from playing repeatedly?"}, {"author_name": "Doug T", "gravatar_hash": "680652ec4feb1969c39cfba008214ea9", "author_url": "http://ilearnstuff.blogspot.com", "date": "Mar 06, 2012", "message": "With the old-style phones in the background it sounds like an NPR fundraiser."}, {"author_name": "Benjol", "gravatar_hash": "501465a53bf1042de206d7d79cc68942", "author_url": null, "date": "Mar 06, 2012", "message": "I'm not at all comfortable with the idea that 'disembodied' rep continues to exist after a post has been deleted. To me that is solving the wrong problem, the wrong way.\n\nIf that rep had value, it means the post had value, which means you shouldn't delete it.\n\nSTOP Nick implementing that now, and get him implementing Pekka's suggestion (or some variant of it). That seems much more logical to me."}, {"author_name": "THenrich", "gravatar_hash": "886427a445a180eb6618d77ee4ec4894", "author_url": null, "date": "Mar 07, 2012", "message": "Boring podcast. I had to turn it off after 10 minutes. I guess some people are too involved and interested in the world of reputation mechanics and how questions live in the backend. I understand this is for some people who work at SE."}, {"author_name": "ChrisF", "gravatar_hash": "8d450f5636c06655f01d530470154fd9", "author_url": null, "date": "Mar 08, 2012", "message": "Joel - why do you keep confusing closed and deleted? Actually I see this a fair amount in Meta questions. It's an important distinction when talking about duplicates. Duplicates are not usually deleted.\n\nClosed is a temporary state (except for duplicates) and should either lead to the question being edited and reopened or deleted. Having your question closed is not necessarily the end of the world."}]}