{"response": [{"author_name": "George Edison", "gravatar_hash": "ddceaa7c14fb7186bc38cb5c83ca8861", "author_url": "http://quickmediasolutions.com", "date": "Mar 06, 2012", "message": "I absolutely love the new theme - it looks far more polished than the \"sketchy\" theme and is much more usable."}, {"author_name": "LessPop_MoreFizz", "gravatar_hash": "2a50d7684f3805c9850ea1a4d1cae595", "author_url": null, "date": "Mar 06, 2012", "message": "Perhaps keep Sketchy for Beta Metas?\n\nThat's the 'behind the scenes' section where all the actual *construction* takes place anyway, no?"}, {"author_name": "Simon Sheehan", "gravatar_hash": "1add119a20dbc042cc63eb865904adfd", "author_url": null, "date": "Mar 06, 2012", "message": "Now all we need are new trilogy site themes.."}, {"author_name": "Scott", "gravatar_hash": "b749f45bd28d6e15603cf3a41cf4d339", "author_url": null, "date": "Mar 06, 2012", "message": "I really think those red highlighted items should be bolded too.  Just making them red, they don't stand out like they are intended to because it is a weak red.  The same issue is on the front page of StackExchange.com"}, {"author_name": "tylerrrr07", "gravatar_hash": "54e586bab435648f3467e9740e661cdc", "author_url": null, "date": "Mar 06, 2012", "message": "\"The crux of this change is that it’s high time we stopped equating beta sites with being somehow unfinished.\"\n\nI like the new theme but looking at the \"crux of this change\" - Is it just me or does tagging a site with \"beta\" give an unfinished vibe? I don't have a better term off the top of my head but I think if the goal is to get rid of the unfinished feeling of the sites the term beta probably has to go.\n\nOverall I like the change! This is just something that stuck out to me when reading through the post."}, {"author_name": "Iszi", "gravatar_hash": "8f8571493d71202986f2a6ab0dbd7c23", "author_url": "http://security.stackexchange.com", "date": "Mar 06, 2012", "message": "I wish I could up-vote @LessPop_MoreFizz here.  That makes a fair amount of sense."}, {"author_name": "Svick", "gravatar_hash": "0ec0f5be7749c8cc8ccda4a809103f36", "author_url": "http://blog.svick.org", "date": "Mar 06, 2012", "message": "What? “Under construction” images and none of them is an animated GIF?"}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": "http://stackoverflow.com/users/419/kev", "date": "Mar 06, 2012", "message": "I hated the sketchy look and it made me feel like not using a beta site or hanging around too long. This is way better, along with some of the other SE style tweaks. +1"}, {"author_name": "ajax333221", "gravatar_hash": "b364b3251701798497998ae1ed2812c6", "author_url": null, "date": "Mar 06, 2012", "message": "wow it looks awesome.\n\nI hate the sketchy one (no offense)"}, {"author_name": "awe", "gravatar_hash": "bb430dc40c4648586562d2ef22c8557b", "author_url": null, "date": "Mar 08, 2012", "message": "I like the Scetchy look as an idea for a fresch site, but for Beta sites that have been around for a while, it is truly harming the growth beyond hard-core StachExchange users. People that are not familiar with the Area51 process, will be scared off by the sketchy look, and I welcome this new look (which is really based on the general stackexchange.com look - which is really the most logical thing to do). I have previously asked the SE team to apply a graphical theme on the music.stackexchange.com site although it was still in beta, because I felt the sketchy theme was not inviting to new members. I had aready seen that \"User Experience\" had got their own graphical theme while still in beta, but I guess they were in a special position as the site were all about looking good. I can't wait till this new beta theme is applied to Music SE."}, {"author_name": "Purmou", "gravatar_hash": "94cde2c6343d22234ceaf589398a5e0f", "author_url": "http://stackoverflow.com/u/814761", "date": "Mar 13, 2012", "message": "The new theme looks great, though the favicons really bug me.\n\nThe speech bubble just doesn't suit the concept of \"beta\" (as defined by this post, at least), which is not necessarily an unfinished site but rather an endlessly growing one.\n\nSo the speech bubble is just a little out of place to me. I do like how you're keeping the one or two prominent letters from the site title though. Those, besides the eventual custom theme, really reflect that community. And people may think that those letters aren't important, but I think they serve a huge purpose in the growth of a site, which is really what this new beta theme tries to capture. So good thinking on your part.\n\nAgain, excellent work! Love the new modernized theme, but still think the favicon could be worked on. :)"}, {"author_name": "awe", "gravatar_hash": "bb430dc40c4648586562d2ef22c8557b", "author_url": null, "date": "Mar 14, 2012", "message": "@Purmou: The main reason for the theme change is to make the site look LESS unfinished. This is to communicate to new users that this is a site in progress, not an unfinished site. Designing a favicon that \"looks beta\" is not what we want here. The speech bubble communicates that this is a site for a questions and answers community, which is more like the message we want with the design. The message is NOT \"this is a beta\"!\n\n @tylerrrr07 even say that he feels it should not include the text \"beta\" in the heading, but I would no go so far. It is after all a beta."}, {"author_name": "cole", "gravatar_hash": "f29cb8c4dec3289a47a8a8b3b2131de3", "author_url": "http://jcolebrand.info", "date": "Mar 19, 2012", "message": "Should we add \"public\" to the beta moniker, and make it somehow evident what a public beta is? I mean, this would likely be a Jin question, but something to think about. \"Beta\" at this point seems a little odd to a non-stacker"}, {"author_name": "cole", "gravatar_hash": "f29cb8c4dec3289a47a8a8b3b2131de3", "author_url": "http://jcolebrand.info", "date": "Mar 19, 2012", "message": "Also, would it be worth keeping sketchy for the private betas? Because those _are_ under construction. Or was that said and I missed it?"}, {"author_name": "Le Do Hoang Long", "gravatar_hash": "51d44174b0768f7703925d969ca149df", "author_url": "http://ledohoanglong.wordpress.com", "date": "Mar 19, 2012", "message": "It looks great. But like Purmou, I think we should work on the favicon."}, {"author_name": "musiKk", "gravatar_hash": "9844056bd910559e1fb27e8279616102", "author_url": "http://stackexchange.com/users/63571/musikk", "date": "Mar 20, 2012", "message": "What's wrong about the favicon? It blends perfectly with the icon of SE. I really like it.\n\nI also welcome the change overall. German Language &amp; Usage has been in beta for exactly 300 days now and the sketchy look didn't really reflect that. That being said maybe the sketchy beta look could stay for the first 90 days and be replaced by the stylish beta look after that. For those that miss the sketchy look too much."}, {"author_name": "UncleZeiv", "gravatar_hash": "bd24dab59beada36b501670cd01b8e2c", "author_url": "http://unclezeiv.kerid.org", "date": "Mar 20, 2012", "message": "I like the new theme but the total absence of graphics and its extreme \"plainness\" gave me the impression of a parked domain. Maybe add a Stackoverflow logo?"}, {"author_name": "cornbread ninja", "gravatar_hash": "f217db2e735fe6534dc9aa760dc2ab9e", "author_url": "http://cornbreadninja.blogspot.com", "date": "Mar 22, 2012", "message": "\"I like the new theme but the total absence of graphics and its extreme “plainness” gave me the impression of a parked domain.\"\n\nThis.  I miss sketchy already."}, {"author_name": "Raphael", "gravatar_hash": "6a4d2d42ded7e86ca65f2d45b6cad765", "author_url": "http://lmazy.verrech.net", "date": "Mar 22, 2012", "message": "Now betas look better than some older golden sites."}, {"author_name": "CoffeeLover", "gravatar_hash": "35fb549592e47de1251d71b8534e4b11", "author_url": "http://mysenseocoffeemaker.com", "date": "Apr 07, 2012", "message": "it looks great, nice \"under construction\" icons too :)"}]}