{"response": [{"author_name": "Chris", "gravatar_hash": "bd97ad406560c9276d29e19222785d2d", "author_url": null, "date": "Dec 15, 2011", "message": "Good ideas.  Its great to see communities coming up with inventive ways to drive the site."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Dec 15, 2011", "message": "You own your community!\n\nDo what we say!\n\n*Eye Roll*"}, {"author_name": "Powerlord", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Dec 15, 2011", "message": "It that what the Holiday 2011 Hat Dash is about on Gaming?\n\nhttp://blog.gaming.stackexchange.com/2011/12/holiday-2011-hat-dash/\n(dunno if HTML works on this blog or not, so I didn't try linking it)"}, {"author_name": "tim", "gravatar_hash": "94a0e83767dbc71db135454693540015", "author_url": null, "date": "Dec 15, 2011", "message": "The power of the internet.  Increase SE's valuation by asking its users to do even more work."}, {"author_name": "Isaac", "gravatar_hash": "2bb572e05887045b95d99d8a5819eb14", "author_url": "http://judaism.stackexchange.com", "date": "Dec 15, 2011", "message": "@JohnMcG and @tim,\n\nAs a participant in one of the listed initiatives, I really don't get this cynicism.\n\nWe work hard to grow our community not because SE commands us to, but because we want an excellent online Jewish Q&amp;A community to exist, and to serve people with Judaism questions all over the world. If SE figures out a way to make money in return for the technological and human resources they put into facilitating our community, that's fine with me; it just means that the flow of those resources is more likely to continue into the future. And I, for one, appreciate hearing about other communities' best practices."}, {"author_name": "Abby T. Miller", "gravatar_hash": "673e91ced57dd8a3e73dd888b07ff95c", "author_url": null, "date": "Dec 15, 2011", "message": "Thanks for your note, @Isaac, and to Laura for your excellent post. These activities encourage users to participate more in their community, and more importantly, they should be fun. Engaging with your fellow users is a great way to make the 'chores' that exist on sites be less of a... chore."}, {"author_name": "Paulo Cereda", "gravatar_hash": "7132861acd90c364b5eb878c32bce117", "author_url": "http://tex.stackexchange.com/", "date": "Dec 15, 2011", "message": "On TeX.sx, we have two fronts. The first one is called \"'Answer the Unanswered' session\":\n\nhttp://meta.tex.stackexchange.com/questions/1560\n\nIt's a great approach and it's worth a reading.\n\nThe second one is about tags. Tags play an important role in our community; they are really useful when searching for specific topics or even to better classify our own questions. So we have \"'Write a nice description for a blank tag' marathon\" and \"Who designs the best tag wiki?\":\n\nhttp://meta.tex.stackexchange.com/questions/1685\nhttp://meta.tex.stackexchange.com/questions/1775\n\nIt's a great experience for our community and it's working marvellously."}, {"author_name": "Abby T. Miller", "gravatar_hash": "673e91ced57dd8a3e73dd888b07ff95c", "author_url": null, "date": "Dec 15, 2011", "message": "@Paulo, those sound awesome! We will have to be sure to check them out."}, {"author_name": "Laura Dobrzynski", "gravatar_hash": "5028fddccddf5610dac7383b00da7619", "author_url": null, "date": "Dec 15, 2011", "message": "@Paulo That's great, and they both seem like something that any site could adopt. Thanks for sharing the links!"}, {"author_name": "ladenedge", "gravatar_hash": "b3ab537180981d93ad05ac10ce4c9c3b", "author_url": null, "date": "Dec 15, 2011", "message": "Literature.SE is having its second book club meeting this weekend.  The club helps generate new content on the monthly book pick while being an engaging experience for the participants.\n\nCome join us if you happen to have time this Saturday!\n\nhttp://meta.literature.stackexchange.com/questions/292"}, {"author_name": "Benjol", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Dec 16, 2011", "message": "I think semantics is important, and I welcome your use of \"driven\" in \"Stack Exchange is fundamentally driven by the people who use it\". \n\nA lot of grief has been caused by people misinterpreting \"run by the community\" and then getting upset (to put it mildly) by unilateral decisions from the 'overlords'...\n\nSo +1 from me."}, {"author_name": "Laura Dobrzynski", "gravatar_hash": "5028fddccddf5610dac7383b00da7619", "author_url": null, "date": "Dec 16, 2011", "message": "@ladenedge Thanks for sharing! Book club sounds great.\n\n@Benjol @Mike Thanks for reading. :)"}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Dec 20, 2011", "message": "@Benjol,\n\nI guess I've been burned by employers who told me to \"take ownership\" of something, by which they apparently meant \"accept responsibility when things go wrong\" and not \"exercise control over it as would someone who owns it.\"\n\nThe members of the SE community are not \"owners\" in any meaningful sense.  If the site takes off and attracts an expensive advertiser, they don't stand to benefit.  The SE overlords can decide tomorrow to shut it down if they so choose, or completely change the rules, and so on...\n\nI'm not saying that isn't as it should be.  But under these circumstances, I don't care for the use of \"ownership\" to motivate certain behaviors."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Dec 20, 2011", "message": "> The SE overlords can decide tomorrow to shut it down if they so choose, or completely change the rules, and so on…\n\nWhich is why our Creative Commons license is relevant, since you can <i>always</i> get your content out and republish it however you see fit. You own and control your  content through Creative Commons; you are merely licensing it back to the world, and to that particular Stack Exchange site.\n\nYou should think of Stack Exchange sites like public parks, a shared resource for everyone to benefit from and enjoy. See the second presentation here:\n\nhttp://www.codinghorror.com/blog/2011/12/building-social-software-for-the-anti-social.html"}]}