{"response": [{"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Dec 12, 2011", "message": "Joel / Abby,\n\nSec 102:\n\n\"A service provider shall take technically feasible and reasonable measures designed to prevent access by its subscribers located within the United States to the foreign infringing site (or portion thereof) that is subject to the order...Such actions shall be taken as expeditiously as possible, but in any case within five days after being served with a copy of the order, or within such time as the court may order.\"\n\nHow exactly does this take down stackexchange?"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Dec 12, 2011", "message": "Of course Google, Yahoo, YouTube and every other company who reproduces material is going to fight SOPA, they want to earn that extra $$$.\n\nJoel, if tomorrow you became a hit singer, and your one hit single was worth millions of dollars.  You yourself are entitled to this because you put forth not only the creativity but you put forth the EFFORT.  You stayed up long nights writing the lyrics and you sweat your a** off recording it.\n\nThen one day your best friend hears it and copies it and throws up a youtube video with YOUR music in the background.  The video is a big hit not only for the actual video content but also for YOUR MUSICAL soundtrack right in the background.  Your best friend generates $$$ due to advertising on YouTube.  Your best friend just got over 100 million views of the video.  His pockets just got heavier, and YouTube o.. we won't even go there..lets just say they made a nice chunk of change.\n\nBut you, poor little you...all that sweating, staying up at night only to have your content stolen is now down the drain.  Of course you should support SOPA, it protects the little guys.  And of course the big guys are going against SOPA, if they didn't their bottom line would dramatically take a hit.\n\nIf you don't support it, then you are part of the problem."}, {"author_name": "Nico Burns", "gravatar_hash": "231065ec11e02fd1befbcf71dc6e11a3", "author_url": null, "date": "Dec 12, 2011", "message": "JonH, well personally I would have no problem with my friend, or even a complete stranger using my music or code or whatever for there own purposes. Currently pretty much every popular song is available on youtube, and it is fairly clear that this has had a positive, not a negative impact on sales.\n\nYoutube already has a (very effective) system in place for removing or muting videos which feature music which somebody else owns.\n\nThe problem with SOPA is it requires site owners to be responsible for the content on their site, even if that content is user generated. This means that one malicious person can take down a whole site just by posting copyrighted material. That is why we are against this bill."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Dec 12, 2011", "message": "You are ok with losing the money you worked so hard to earn?  Of course SOPA should go after the site owner, they are allowing it to happen!!  And no the site will NOT be taken down by one single user, where exactly in the bill did you read that?  Can you give me the section number so I can read it myself?"}, {"author_name": "Almo", "gravatar_hash": "867c75a2d17ed1f6877aef2e71167dee", "author_url": null, "date": "Dec 12, 2011", "message": "I buy music from iTunes. I don't download movies for free and watch them.\n\nBut SOPA goes about this the wrong way, because with the amount of content posted to something like StackExchange, it's not possible for them to police all of it themselves."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Dec 12, 2011", "message": "The problem with SOPA is that it doesn't require YouTube to take down the video - it requires ISPs to block YouTube. There is no need to go after individual websites, just a single letter to the 3-4 major cable companies and you can censor an entire nation.\n\nThen shouldn't this be extended to patent cases? What about people using an Android device that blatantly violates Apples patents to access the internet? Or an Apple device that breaks Microsoft's patents, or a Microsoft device that steals Samsung's patents."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "7f4a7293a3b41e6f21b37282dededac7", "author_url": null, "date": "Dec 12, 2011", "message": "JonH - where you are wrong here is the assumption that you have made a bunch of sales if the friend had not placed the video on YouTube. The fact of the matter is that either 1) the song is already popular, and so people are buying your song anyway. You still make your money. or 2) the song was not already popular, in which case it's likely the YouTube video added something to the song; there's new creative work there and so the friend deserves his cut. And while he's at it, the video likely also helps boost direct sales of your original single. In simple terms, music on YouTube is not a substitute for CDs or iTunes, and it's foolish to believe it cannibalizes those sales.  YouTube (and similar technologies) are much more likely to help than hurt."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Dec 12, 2011", "message": "@Joel Coehoorn,\n\nI respectfully disagree.  For 1 to hold true that would mean pirating, copying, stealing, and ripping do not exist.  That's far from fact and too many sites and or technologies make it so simple to \"rip\" music / video content for personal purposes.  For 2, what if the video existed only to play the song and serve no other purpose?"}, {"author_name": "Nicol Bolas", "gravatar_hash": "7b1af0a134b3cf0892025b0ec4ba65a9", "author_url": null, "date": "Dec 12, 2011", "message": "@JonH\n\nThe problem with your point is that there is *already* a remedy for getting that YouTube video pulled: file a DMCA claim with YouTube. That's all you have to do, and it will be pulled.\n\nThis method works, is implemented, and YouTube very fervently addresses DMCA claims in a timely fashion (perhaps too fervently in some cases). So... why do you need something *more*, when you already have the ability to get the video pulled for violating your copyright?\n\nWhy do you need the SOPA's powers to ISP-ban YouTube?"}, {"author_name": "Krosti", "gravatar_hash": "d081c91144c6ca3ddc0364e6e4372a17", "author_url": null, "date": "Dec 12, 2011", "message": "@JonH First of all, I am one of the musicians you are talking about that his friends took his music and became youtube success. Believe me it doesn't hurt if you are not greedy about the money that you already didn't have anyway. Second, it's their context that makes the youtube video successful moreover you don't really earn too much of a quantity. So we are licking rock for water here. \n\nGoing back to the discussion, this law or whatever it is destined to fail just as the DRM stuff and etc. You might not know it but the time has passed and people are not that stupid to get ripped off by actually buying the album of some artist. That's just ridiculous pricing for an album. \n\nMusicians and singers other than the mainstream big-shot pop league, you have one and only one option. Performing your art live or making a twist that would make you distinguished. Otherwise some auto-tuned idiot can look like she can sing but no way. \n\nHad it been as you said, there would be no \"the-incredible\" Soundcloud which we spend most of our time listening to people's hard work for free. But we don't steal or make up our own stuff from there because it has its own dynamics. You should be the one explaining why it works so nicely in Soundcloud where anybody can use those songs in any video and \"earn millions\"."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Dec 12, 2011", "message": "@Nicol Bolas,\n\nThis is just a piece of the problem, my example does not and should not represent the only thing SOPA plans to do.  \n\nFolks I am not here to argue for or against, my point is to read the actual bill itself (hence I posted section 102).  Many posted on the stackoverflow meta site about this topic without reading the fine print.  This is not one of those instruction manuals where you read the first sentence and toss out the rest.  You have to actually read this bill.  You also have to understand the wording on the bill because it gets a bit tricky."}, {"author_name": "Abby T. Miller", "gravatar_hash": "673e91ced57dd8a3e73dd888b07ff95c", "author_url": null, "date": "Dec 12, 2011", "message": "@JonH, responding to your original comment: that provision doesn't \"take down\" Stack Exchange, but it would legally require ISPs to block United States users from viewing Stack Exchange sites if there was one little infringement that slipped onto the network undetected. That is dangerous to the company and unfair to everyone."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Dec 12, 2011", "message": "@abby - From section 102: \"...to the foreign infringing site (or portion thereof) that is subject to the order…\""}, {"author_name": "George Edison", "gravatar_hash": "ddceaa7c14fb7186bc38cb5c83ca8861", "author_url": "http://www.quickmediasolutions.com", "date": "Dec 12, 2011", "message": "I am strongly opposed to SOPA.\n\nEven though I am not an American, as the owner of several websites that allow user-generated content to be posted with minimal effort (well, okay, enough effort to deter spammers), I recognize the serious implications that SOPA poses if it were to pass.\n\nThe DMCA, which is and has been law for quite some time, has already given us plenty enough trouble already."}, {"author_name": "Nerevar", "gravatar_hash": "66eb324397667baee5368db6fb5f3865", "author_url": null, "date": "Dec 12, 2011", "message": "Give it up, people.\n\nAlso the inclosure processes were harmful and they weren’t fair. But they were enforced, eventually.\n\nGive it up."}, {"author_name": "anonymous", "gravatar_hash": "cf8093eb2d8ab79adba19969aab1b550", "author_url": null, "date": "Dec 13, 2011", "message": "That is the end of venture capital for social networking startups. Who will invest in user-generated content, when there is no economic way to police it?\n\nThese social networking sites generate 1000s of user comments and content for every penny of monetization.\n\nThis will transfer a monopoly to the social networks owned by the big banks (JP Morgan, Goldman Sachs, etc), i.e. Facebook.\n\nFollow the money trail. That is what this stage of fascism is always about."}, {"author_name": "ammoQ", "gravatar_hash": "d1fc3a85db4ff7618a7639742f356b3b", "author_url": null, "date": "Jan 26, 2012", "message": "All that discussion about the poor musican being ripped off seems pointless when we consider that Vevo, run by Sony Music, Universal Music and others already actively posts countless first class music video clips of the music they own on youtube, probably to generate more sales of that music. If youtube coverage boosts sales even for famous artists like Lady Gaga, it's hard to believe that it wouldn't help an unknown newcomer even more. If I made music and my friend posted one of my songs on youtube and it got 100 million hits - chances are, I would sit next to Rihanna during next years Grammy awards."}, {"author_name": "Gratis internet", "gravatar_hash": "fbbaefb643694a33aeb31e9a5e5f7ad4", "author_url": "http://www.gratisinternet.org", "date": "Apr 11, 2012", "message": "Great info... keep up the good work... will be back again.<a href=\"http://www.gratisinternet.org\" rel=\"nofollow\">gratisinternet</a>"}]}