{"response": [{"author_name": "gregory", "gravatar_hash": "7f1e09c363f9a2f7421e8715b760eb24", "author_url": null, "date": "Dec 08, 2011", "message": "When you removed off topic I stopped reading the forums. A great place and a horrible decision."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://about.me/cky", "date": "Dec 08, 2011", "message": "OMG, rchern on the podcast! q: I've got it downloading on my SoundCloud app now, and will be listening on my commute home tonight.\n\n(Yes, that's quite the compliment---as I've not been very faithful with keeping up with the podcast. At all.)"}, {"author_name": "Ward", "gravatar_hash": "f347c53c9cb1ddcb816daeb22aaf89c8", "author_url": null, "date": "Dec 08, 2011", "message": "The off-topic forum went rather spectacularly in a direction Joel didn't want associated with his name, so shutting it down made some sense.  But that took most of the vibrancy away from the forums because the most active posters went elsewhere.  Eventually the general \"Joel on Software\" discussion was shut down and all that remains now is the very slow \"Business of Software\" group."}, {"author_name": "George Edison", "gravatar_hash": "ddceaa7c14fb7186bc38cb5c83ca8861", "author_url": "http://www.quickmediasolutions.com", "date": "Dec 08, 2011", "message": "I think you meant to say \"thoroughly\" and not \"thoughly\" in the third bullet point."}, {"author_name": "Berlin Brown", "gravatar_hash": "8396048b39279996e7ee6c1acdac2bf7", "author_url": null, "date": "Dec 08, 2011", "message": "I am from crazyontap bitches.  We aren't crazy.  \n\nhttp://www.crazyontap.com/"}, {"author_name": "Berlin Brown", "gravatar_hash": "8396048b39279996e7ee6c1acdac2bf7", "author_url": null, "date": "Dec 08, 2011", "message": "Somebody committed suicide by the way and I guess used the forum (?off) for some of his last posts"}, {"author_name": "Dr. Horrorwitz", "gravatar_hash": "8a05df3d579689c27fea5e92bf94781c", "author_url": null, "date": "Dec 09, 2011", "message": "Don't listen to Berlin! He's crazy."}, {"author_name": "less is more", "gravatar_hash": "d10ca8d11301c2f4993ac2279ce4b930", "author_url": null, "date": "Dec 09, 2011", "message": "Takes one to know one, Doktor. But since I know you're crazy, I must be, too. Don't listen to me! I'm crazy."}, {"author_name": "Adam", "gravatar_hash": "67585539b54698aa055c35805b807f32", "author_url": null, "date": "Dec 09, 2011", "message": "Not a bad episode, but I tend to think that when there is an outside to challenge Joel and Jeff, the conversation is a lot more interesting. This week was mostly a lot of people agreeing with each other."}, {"author_name": "Xiahouzi", "gravatar_hash": "416b2f78f778b947c854c01dea6c4e18", "author_url": null, "date": "Dec 13, 2011", "message": "IMO Area 51 is going poorly. Most of sites now get less than 200 visitors per day. I guess this is worse than the version 1 sites.\n\nI also don't agree with point 3. I haven't seen much scrutiny on proposals. Go didn't work and there is Poker, MTG and Chess coming out soon which are just tags on the board games site.\n\nStack Exchange network now has a long tail of Q&amp;A sites which don't meet the networks benchmark for a decent quality site in terms of traffic, questions per day etc."}, {"author_name": "Pat", "gravatar_hash": "cf5be907f3bff0fa48980e7bfe5bf009", "author_url": null, "date": "Dec 13, 2011", "message": "Agree with Adam.  The meta-focused podcasts are, from this listener's perspective, largely a waste of bits.  Maybe you should have a meta-podcast where those interested in how the sausage is made can tune in.  The moot and Dave Winer guest shows really restored my flagging enthusiasm for this podcast: please bring more along those lines.\n\nPlease have a little more respect for your listeners' time and don't give Alex a microphone.  When he has created something or otherwise done something interesting that gives him experience and insight and he has something to teach or inform me, then bring him on to talk about that.  I have been a chief of staff, hired them, and had them reporting to me so I know something about the value of the role both for the exec and as a career development accelerator for the person in the position, so I don't knock him or his role per se, but there is just no place for it on the podcast if he doesn't have any street cred or valuable insight to add.  It is clear he is early in his career and overestimates how insightful his comments are."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Dec 14, 2011", "message": "@Pat occasionally we mix some meta podcasts in for flavor; the plan is (and has been for a while) for the vast majority of podcasts to have a special guest."}, {"author_name": "Kevin Burke", "gravatar_hash": "41910a452554b187d044c00c576866b1", "author_url": "http://kev.inburke.com", "date": "Jan 20, 2012", "message": "What happened to the podcasts? I really enjoyed listening to them."}, {"author_name": "booyaa", "gravatar_hash": "76eb5847f0ecf87aba817ee37547c537", "author_url": "http://booyaa.org", "date": "Jan 24, 2012", "message": "yeah why no more podcasts? this was my favourite podcast because of the perfect balance of hard earned wisdom and humour."}, {"author_name": "Mueller", "gravatar_hash": "4b2e13222294f1539ae0ca1ce2d0eb81", "author_url": null, "date": "Jan 24, 2012", "message": "If you were the stack exchange podcast... where have you been for the month of January?\n\nI'm sure it is a lot of work.  But I believe it adds a lot of value to the community"}, {"author_name": "gaijintendo", "gravatar_hash": "eeb5b38ae47bafee6e06c3f0f04868a0", "author_url": null, "date": "Jan 27, 2012", "message": "Irregular podcasts, of higher quality is worse than regular .. of variable.\n\nIf you can't make the time, delegate to other teams and so on. Don't feel the need to make them an hour long. Something must have happened in the last month, even if it was just you got a Kindle for Christmas.\n\nA spoken word is worth a thousand blog posts!\n\nIt is like holding your breath, except it is your brain instead of your lungs! Podcast pretty please¬"}, {"author_name": "Andrew", "gravatar_hash": "9ebec172e390886892c81c90b3d23058", "author_url": "http://theandrewbailey.com/", "date": "Jan 31, 2012", "message": "can has podcast?"}, {"author_name": "Krox", "gravatar_hash": "ab1521ffa78d49f269f28f74069520e6", "author_url": "http://www.undra.se", "date": "Feb 06, 2012", "message": "I guess this is why:\n\nhttp://www.codinghorror.com/blog/2012/02/farewell-stack-exchange.html\n\nA bit cynical question maybe but will the podcast continue without Jeff?"}, {"author_name": "Matthew D.", "gravatar_hash": "0b5ae01969bf4657b8fc2651d165c05b", "author_url": "http://apple.stackexchange.com/users/7833/daviesgeek", "date": "Feb 08, 2012", "message": "Why aren't you on iTunes? I have an iPod and I'd like to listen to your podcast on my iPod, but I'd rather not download the MP3 and put it into iTunes. BTW, thank you so much Stack Exchange team!!!!"}, {"author_name": "Mike Waweru", "gravatar_hash": "9581e81327743d5f4ee3d1d27ceee7a5", "author_url": "http://trader.qnetlife.net", "date": "May 27, 2012", "message": "I agree with Pat- deny Alex the microphone ;-). I like him though!"}]}