{"response": [{"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 22, 2011", "message": "\"I have actually been laughed at by my previous boss for \"always looking up\nsomething crazy with graphs and funky equations and shit\"\"\n\nIf that's the way you want to put it on your resume good luck!"}, {"author_name": "Stefan", "gravatar_hash": "92e5c51218f00220e0362c47b2a94b9a", "author_url": null, "date": "Aug 22, 2011", "message": "@JonH: That's why the screenshot provided clearly shows \"Personal Statement\" as a toggle-able checkbox.\n\nMaybe the export just needs a \"filter profanity\" switch.\n\nIt would be cool if there were more output formats than just PDF available. From casual perusing, it looks like many places explicitly ask for a document format of some kind, and there's a good chance BigCorp Enterprises has some Microsoft Word macro they need to run to filter resumes.\n\nAside from that, the output PDF is absurdly pretty."}, {"author_name": "UncleZeiv", "gravatar_hash": "bd24dab59beada36b501670cd01b8e2c", "author_url": "http://unclezeiv.kerid.org", "date": "Aug 23, 2011", "message": "@Stefan: big corps that require Microsoft Word macros don't deserve to be on careers.stackoverflow! They are unlikely to be the cool places to work for that they are trying to attract."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 23, 2011", "message": "@UncleZeiv, you cannot just assume places that don't use Microsoft Word are \"cool places to work\".  In a tough economy a lot of folks are just looking for work, not singling out only \"cool places\".  When you have bills and a family to feed you just want to find a job.  And yes a lot of companies require word resumes so you cannot eliminate those companies...at least I cannot."}, {"author_name": "AaronC", "gravatar_hash": "ba81587cc2446ce72aa81f36f6fc0a19", "author_url": null, "date": "Aug 25, 2011", "message": "I'd hate to think I'm dumb but how do I enter in my phone number and have it shown on my CV PDF export?  I can't find it for the life of me."}, {"author_name": "Nick Larsen", "gravatar_hash": "d46110040c962c94a7216c9c0dfabda6", "author_url": "http://stackoverflow.com", "date": "Aug 25, 2011", "message": "@AaronC: that was turned on this morning, sorry for the confusion."}]}