{"response": [{"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://quickmediasolutions.com", "date": "Aug 15, 2011", "message": "You can also view the Python vs. Perl question with this cool UserScript: http://stackapps.com/questions/2505/stack-exchange-deleted-question-viewer"}, {"author_name": "Leszek Cyfer", "gravatar_hash": "cebcc4affb8573b938d909aabded2d75", "author_url": null, "date": "Aug 15, 2011", "message": "So in the end what are the strengths and weaknesses of Perl and Python - and where do they excell - is a beginning programmer supposed to toss a coin to choose?\n\nGorilla and shark comparison seems stupid to me. Perl and Python not so. \n\n- \"Do I own Perl? Do I own Python?\"\nNo problem with having either one or both. Is it worth it?"}, {"author_name": "TehShrike", "gravatar_hash": "b0d8ecb1f35283c9ac7fd219916efb90", "author_url": "http://joshduff.com", "date": "Aug 15, 2011", "message": "Now if only I could figure out how to +1 this on Google Plus!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Aug 15, 2011", "message": "> No problem with having either one or both. Is it worth it?\n\nI don't know, <i>what problem are you trying to solve?</i>"}, {"author_name": "Nakilon", "gravatar_hash": "f91efda1043d10f4b4aee0a156e2cfd1", "author_url": null, "date": "Aug 16, 2011", "message": "Yeah, commonly questions \"Gorilla vs Shark\" suck, but taking the rule \"everything with '\\S+ vs \\S+' in title should be closed\" is very wrong, but very usual mistake.\nThere are questions of \"What is better tool to solve this task: Gorilla or Shark\", which can be objectively answered by giving cons and pros about both tools, so question could choose. It's very normal question as I think. But people are to afraid of them and close them. It's not right!"}, {"author_name": "Ian", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Aug 16, 2011", "message": "“Google+ versus Facebook” does have a good short answer,  “Google+ has circles, circles are important because…,  Facebook has lots of users, this is important because”.  In a years’ time I don’t think there will be a good answer."}, {"author_name": "Bruce Atkinson", "gravatar_hash": "2fd8499820f056adfeb8e35d9cdce23b", "author_url": null, "date": "Aug 16, 2011", "message": "This is where I think stack overflow has it all wrong.  This is a question that I would love to answer in a constructive way with facts and experience.\n\nAsking which one to start with is a perfectly valid question and has nothing to do with sharks and gorillas.  I use both and they both have their strengths.  I also use Powershell and gasp vbscript.  I even use (shocker) plain old NT batch.  I've been known to dabble in Groovy as needed. If I was a new person in need of scripting I know I would like to hear from people that have solved problems with the different scripting languages.  Yes, it has been necessary for me to use all of the above.\n\nI've been programming for over 31 years and to hear that \"nobody needs to know the answer to the question\" shows me a serious lack of understanding of what the question is and the needs of people in the industry."}, {"author_name": "UncleZeiv", "gravatar_hash": "bd24dab59beada36b501670cd01b8e2c", "author_url": "http://unclezeiv.kerid.org", "date": "Aug 16, 2011", "message": "\"Language comparisons are rarely meaningful and even less often fair. A good comparison of major programming languages requires more effort than most people are willing to spend, experience in a wide range of application areas, a rigid maintenance of a detached and impartial point of view, and a sense of fairness\" - Bjarne Stroustrup\n\nI think it would be better to ask two separate questions: \"is Python a good language to learn programming?\" and \"is Perl...\". This way, only Python experts would answer to the first one and only Perl experts would answer to the second one."}, {"author_name": "Michael", "gravatar_hash": "4bfb433d859e35f8154943ddc61c73f6", "author_url": null, "date": "Aug 16, 2011", "message": "I disagree with Bruce - the SE network *needs* to be harsh with regard to these kinds of questions.  The Perl v. Python style of question appears far too often on Programmers.SE, and it's part of the reason I can't stand reading that site anymore.  The tone of the questions sound like someone who is desperately trying to avoid failboating their career by picking the \"wrong\" language to learn, as if there were such a thing.  A sufficiently motivated programmer (the kind we're trying to attract here) will be able to answer that question for himself far better than anyone else could.  Attempting to answer that question for someone else basically amounts to a waste of your time.\n\nOh, and flying shark FTW.  Hands -- err, fins -- down."}, {"author_name": "Bruce Atkinson", "gravatar_hash": "2fd8499820f056adfeb8e35d9cdce23b", "author_url": null, "date": "Aug 16, 2011", "message": "@Michael, It really isn't Perl v. Python.  It is really what problems do you need to solve and which language lends itself to those problems.  Listening to people that use these languages and the problems that they are solving will help new users understand what fits in their scenario.  I personally use Perl to process text files, especially multiple text files, quickly and Python for XML.  \n\nPeople will have different opinions as to which one is better for doing one task over the other, but listening to them helps a person to decide which one they would prefer.  Even after 31 years I continue to learn from reading how others use these languages.  I can filter out the \"my language is better then yours\" people.  It's easy to to that.  To not have the question because these kinds of people exist doesn't make sense.  Answering them rather then trying to word smith or eliminate the question is more productive.\n\nTo disallow these because you don't need it is wrong.  You say you can't read the site anymore is ridiculous, you don't need to read the questions and answers that don't apply to you.  That doesn't mean others don't want to read them.\n\nI have always helped people when they ask me questions. I try to learn what their needs are and give my best answer.  I try to steer them to where to get more information.  I always try to guide them on on how to research the answers to their questions.  I have stepped in many a time when someone is turned away from someone like you.  I do not believe your attitude is helpful to people starting out.  I pretty much stopped participating on Stack Overflow after attempting to answer questions that were deleted before I could post my answer."}, {"author_name": "Stefan W.", "gravatar_hash": "888b31af96427e8bd603631fa2af32f5", "author_url": null, "date": "Aug 16, 2011", "message": "Python vs. Perl is more like sheep vs. chicken - isn't it? ;)"}, {"author_name": "Nobody in particular", "gravatar_hash": "1ad953887cf022eb10446a2483db385e", "author_url": null, "date": "Aug 16, 2011", "message": "I thought gorilla v shark was a settled question: http://www.schlockmercenary.com/2005-10-23\n\nAs to languages, you might as well be asking coke v pepsi or vim v emacs.  Just pick one that can do what you need done and move on."}, {"author_name": "matt", "gravatar_hash": "35fe1d8db79d0f9d10c87a0cbc4096af", "author_url": null, "date": "Aug 16, 2011", "message": "Is the shark in the picture doing a Shōryū-ken? Does the gorilla have a special move?"}, {"author_name": "Eduardo", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": null, "date": "Aug 16, 2011", "message": "+1 Bruce Atkinson"}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Aug 16, 2011", "message": "If anyone feels that they need an answer to Perl vs Python, then they can google \"Perl vs Python\" and read some of the 6 million sites that come up.\n\nI needed the answer to this question once, and similar questions (Java vs C#, Emacs vs Vim, Eclipse vs Netbeans, etc.)\n\nEach time I'm faced with such a dilemma, I find that hundreds of essays have already been written on the subject, at which point it is the height of laziness to ask a group of experts to fight it out one more time."}, {"author_name": "Stefan", "gravatar_hash": "92e5c51218f00220e0362c47b2a94b9a", "author_url": null, "date": "Aug 16, 2011", "message": "Is a Shark's bite worse than a Gorilla's punch? I don't see how this is any better at its core; it almost seems as if any question could be valid so long as you can form an objective null and alternative hypothesis to the solution. Isn't this really the heart of Shark vs. Gorilla, though?\n\nOccasionally I'm forced to choose between Shark and Gorilla for some specific task. In general without context, neither is the correct solution. If I'm attacking a naval base by sea, though, I choose Shark every time.\n\nPerhaps the real question here (not for UX or stackoverflow) could be \"I'm attempting to create a web presence for my business. Should I bother with Google+\" or \"I'm writing a social web game. How important is facebook integration/the ability to play as a facebook application\". \n\nShark and Gorilla are probably acceptable answers to any given question, but alone they form no question at all."}, {"author_name": "Dan Levine", "gravatar_hash": "f545aac1c92279c305c0b6036a74b882", "author_url": null, "date": "Aug 16, 2011", "message": "I'd just like to point out that the gorilla and shark in the picture appear to be *high-fiving* each other, not fighting. I think they're buddies."}, {"author_name": "Bruce Atkinson", "gravatar_hash": "2fd8499820f056adfeb8e35d9cdce23b", "author_url": null, "date": "Aug 16, 2011", "message": "Dan Levine +1.  I see it as the shark helping the Gorilla escape from the destruction of developers that would rather blow up then help someone."}, {"author_name": "scott", "gravatar_hash": "5591d4ea15683f410dc636b2ee4ac74a", "author_url": null, "date": "Aug 16, 2011", "message": "I just read the cached question and answers.  It's not the question that's bad, it's the answers.  I'll admit that it's an inherently difficult question to answer well, but that doesn't make it a bad question.  Language comparisons are an excellent way to learn about different languages.\n\nThe problem to be solved is how does one go about deciding the next thing to learn.\n\nPossible well written answers could have been:\n\n1) A list of the best Perl vs. Python articles found on the web.\n2) A sample algorithm written in both languages to compare syntax differences\n3) A list of community sites for both languages as a jumping point for diving into either language\n4) An overview of major features of both languages\n\nMost answers were from people who just championed one language over another.  If those answers bubble to the top, the voting system is broken, not the question."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": null, "date": "Aug 16, 2011", "message": "scott wrote:\n&gt; It’s not the question that’s bad, it’s the answers.\n\nA question that gets [only|primarily] bad answers IS a bad question!\n\n&gt; 1) A list of the best Perl vs. Python articles found on the web.\n\nSo instead of speculating on the results of the fight, just link to other people doing the speculation? How is that BETTER?!\n\n&gt; 2) A sample algorithm written in both languages to compare syntax differences\n\n...which doesn't really answer the question, forces one or both samples to write to the lowest common denominator, and / or depends on someone knowing both languages' idioms well. At best, this is CodeGolf: http://codegolf.stackexchange.com/\n\n&gt; 3) A list of community sites for both languages as a jumping point for diving into either language\n\n&gt; Back to a list of links, but now they don't even attempt to answer the question.\n\n&gt; 4) An overview of major features of both languages\n\nOr you could just bring up the Wikipedia pages for both and skip the \"vs.\" charade. \n\nSo the options for answering are, answer badly or answer with non-answers. This is a bad question..."}, {"author_name": "Bruce Atkinson", "gravatar_hash": "2fd8499820f056adfeb8e35d9cdce23b", "author_url": null, "date": "Aug 16, 2011", "message": "@Shog9, People answering badly does not make a good question bad. It seems the problem is that you are viewing it as a fight.  One thing that I have learned over the years is that any idiot can show how something is bad or wrong.  It takes no skill to do that. The question asked really isn't a versus question.  It is more like where do I start and which one do I start with.  It is really a discussion question and a discussion question with merit.  On one hand there are a lot of loud chest pounding people that can pollute the discussion, but on the other hand the question can also be discussed and answered in a productive way. It's those productive answers from experienced people that I want to read and I can easily ignore the people that just want to pound their chest.\n\nYou are completely ignoring the value of trusted people providing experienced answers over anonymous google results of unknown relevance."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": null, "date": "Aug 16, 2011", "message": "Eh, Bruce - long time no see! You should really check out the Programmers.SE site again - they're *trying* to make this whole \"experience-based advice\" thing work in a Q&amp;A format, and most of what's lacking is... experience.\n\nYou're dead right that these are not \"versus questions\", at least not when answered well. Jeff pretty much made this point in the post here - the best answers you can hope for will ignore the \"vs\" bit and just give you some good info from experts in one side or the other... But that's just more reason to skip the \"X vs Y\" charade entirely, and ask a question on X and then Y... or better yet, ask a question on the task you're trying to accomplish, and let X &amp; Y experts jump in with their own takes on it without pitting their specialties against each other directly.\n\nSo given the choice between a question that *begs* for chest-pounding over substance, and one that asks for assistance with a real problem... Why should we do anything to encourage the former?"}, {"author_name": "shankar", "gravatar_hash": "5b66fa39fd97d13b317135bbfb36a5bd", "author_url": "http://www.shankarscodex.com", "date": "Aug 16, 2011", "message": "perl vs python is a perfectly valid question. people ask questions for self-advancement. time &amp; effort are precious. this person is trying to learn something new and doesn't want to waste time in a technology that may not have a future. that is the fundamental reason behind such questions.\n\nthis question (just like so many other things in life) does not have a definitive answer. even the so-called experts cannot answer such questions. and that is the reason this question is being booted out, not constructive.\n\nit is unfortunate that you want to make stackexchange a place meant only for definitive answers (like 2+2 = 4) and shun constructive discussions. this question is indeed valid, he has to find a different forum to ask the question."}, {"author_name": "Fabien7474", "gravatar_hash": "acd99d878d16d4a0c99085092b97f0d0", "author_url": "http://Www.Irofoot.com", "date": "Aug 16, 2011", "message": "I definitely agree with Bruce. FYI I have discovered SO website when I needed to ask the question 'What is the best framework to choose for a website from scratch'? \nOf course I had done some research before and wrote the results inside the question itself. However answers helped me a LOT and I made my final choice based on these answers. Today my question would have been closed for sure and it would be a big lost (for the Internet itself)"}, {"author_name": "sickgemini", "gravatar_hash": "7d12b75860d62798b001fbaee38e7f29", "author_url": null, "date": "Aug 16, 2011", "message": "This topic is covered pretty well here too:\nhttp://www.amazon.com/Shark-vs-Train-Chris-Barton/dp/0316007625"}, {"author_name": "Aarobot", "gravatar_hash": "687f8a43b58fe35c8b2933f1f16b13cb", "author_url": null, "date": "Aug 16, 2011", "message": "Not remotely surprised at the cranky responses. People just *love* their polls, any time, any place. Anybody can participate, no purchase necessary, and as long as you pick one of the most popular options, it's OK if you fail because now it's the internet's fault.\n\nDiscounting the numerous straw-man arguments presented in the comments, it all boils down to this: \"X vs Y\" is what people \"ask\" when they want to feel included but don't actually have anything to say. It's not a question, it's a conversation-starter; an ice-breaker at a party for nerds. I've been guilty of it too; a lot of us have. It's okay; just move on, don't make excuses, and just wait until you have a specific question before you try to ask one.\n\nFor a lot of the more prolific contributors, one of the things that drew us to Stack Overflow in the first place was the fact that its Q&amp;A format offered an alternative to the morass of rants and platitudes consistently offered on other, less-modern discussion forums. Just because you have something on your mind, doesn't mean you're entitled to an audience, particularly if you couldn't be bothered to develop your question or answer beyond idle chit-chat.\n\nIt's especially ironic that those arguing in favour of \"vs\" questions under the auspices of choosing the \"best tool for the job\" are conveniently ignoring the possibility that a Q&amp;A site might not be the best tool for facilitating these discussions."}, {"author_name": "Fgxn", "gravatar_hash": "5a5d854a0d7bf181b951af2a1b97a033", "author_url": null, "date": "Aug 16, 2011", "message": "@Aarobot I'm not \"ignoring the possibility that a Q&amp;A site might not be the best tool for facilitating these discussions.\" Just because we disagree on the answer doesn't mean I haven't considered the question!\n\nSo, let's see what features you'd want in a site that WOULD host these discussions:\n\n1) The ability of users to vote for on answers;\n\n2) The ability to readily see the historical participation of the answerer, so that you can factor their profile into your interpretation of their answer;\n\n3) The ability to suggest and accept edits to each other's answers;\n\n4) The site structure lends itself to a solution of the \"chat room/forum problem\" (http://scobleizer.com/2009/11/02/the-chat-roomforum-problem-an-apology-to-technosailor/);\n\nWe could continue to list more, but I think this is sufficient to make the point. So now let's consider: Who has built a site like that? Well, StackExchange comes to mind - I can't say I've ever seen any others, but I certainly welcome suggestions!\n\nOn the other hand, I know that \"StackExchange doesn't welcome (or even support)\" this kind of question (http://meta.stackoverflow.com/questions/36818/would-you-recommend-stack-exchange-sites-vs-other-types-of-forum/36828#36828) - so I choose not to participate in any of the SE sites. But for you to assert that I \"haven't considered\" other tools just because I find the SE framework a GOOD SOLUTION to the problem of having lengthy \"X vs. Y\" debates is disingenuous in the extreme."}, {"author_name": "Gordon", "gravatar_hash": "ccf1918632da8fb6f1158ec4edc83b71", "author_url": null, "date": "Aug 16, 2011", "message": "What if there is more than a Gorilla and a Shark?\n\nTabs in vim on Windows vs. Spaces in Emacs on Linux vs. No indentation in textmate on Mac?\n\n\nobviously the correct answer is jQuery.\n\n\n(can I come out and walk on top of the bridge now? ;-)"}, {"author_name": "Ben Newman", "gravatar_hash": "8e133670c6e7e6c6b20a010c1253ec0c", "author_url": null, "date": "Aug 17, 2011", "message": "Agreed, Gorilla Vs. Shark doesn't have any of the scientific grounding that Enterprise vs Star Destroyer"}, {"author_name": "Pedro", "gravatar_hash": "23ca5782180a1b344c0abd6ba2eae463", "author_url": null, "date": "Aug 24, 2011", "message": "Obviously the Gorilla would win."}, {"author_name": "Darren Woodford", "gravatar_hash": "7aec72633e3784dcd7cfbed5061d7a72", "author_url": null, "date": "Jan 18, 2012", "message": "When someone asks X vs Y (Python vs Perl etc) they are asking for advice rather than a specific question. I think it is fair for SE to say this is not the place to ask this type question even though it may be a good question. The problem with advice is that it is very subjective and everybody has their own opinion. So the thread turns into a lengthy discussion and many of the \"answers\" are links to further information or requests for clarification. You also get people saying I use X or Y and I love/hate it. The advice given is also only as good as the other factors taken into consideration. In the choice of language this would be: What will you be using it to do? What sort of job do you have or are you looking to get? What sort of salary do you want? etc etc. We could extend this to someone saying should I become a Doctor or a Lawyer. No doubt people would argue for both but does that make one wrong or right? If someone becomes a Lawyer on the basis of this advice and regrets it does that make the advice wrong? Does that mean no-one should ever ask that question or ask existing Lawyers and Doctors what their job is like? Obviously not and so these questions will always be asked. It would be foolish for someone to invest 6 months learning a programming language only to find out it is no use to them. A little bit of advice from those who know the language would be advantageous. There is nothing wrong with discussion but SE is not the place for it. I don't know where it is but I like the tough stance of SE at the moment. The Q&amp;A format of SE is excellent and would probably do a good job of it but it would pollute the quality Q&amp;As that are there. Perhaps programmers.stackexchange.com could be more tolerant of this type of question?\n\nPS What about Shark vs Star Destroyer. I would like to see that in return for all the recurring \"Jaws\" nightmares I had as a child."}, {"author_name": "Cinquero", "gravatar_hash": "2287f870f9305d42d75b842128700a33", "author_url": null, "date": "Feb 12, 2012", "message": "Sorry, but I think this is all really nonsense. If questions are too generic, ok, then you could argue that they are of bad quality. That's ok. \n\nBut what about Java vs. Perl? Java's compiler complains when you forget to catch exceptions at compile time! Perl does not care at all - NEVER!. Look at the Net::FTP module -- it dies when there are network issues. THIS IS NOT DOCUMENTED AT ALL! And Perl doesn't warn you! So you switch it live, and you get bad data because the programming language JUST DOES NOT CARE FOR PROPER CHECKS!\n\nSo you are basically supposing that we don't warn people from using languages that just don't care for things real developers have had issues with for years? Great. Really great achievement.\n\nScripting languages vs. real languages is not a fundamental question. It is a question of real-life experience, good practices and good quality."}, {"author_name": "Rhys", "gravatar_hash": "f599355b7daea49a5e77aebe635c18cf", "author_url": null, "date": "May 04, 2012", "message": "The Google cache link has expired, but I happen to have over 10k rep on Stack Overflow so could take a look. \n\nSince I've only dabbled in either language, I found the answers to this question extremely valuable and interesting. Actually, much more interesting than 99% of other Q&amp;As on the site, and this is reflected in the huge number of upvotes that the question and answers received. I don't understand what's to be gained by censoring such questions. If you discover your shop's selling something immensely populuar with your regular customers, moreso than your regular wares, it's crazy to ban it. (I believe this is known in Silicon Valley terms as \"pivoting\".)\n\nThere might be naive and ridiculous questions that you don't want on your site, which is fair enough, but unfortunately these days there are far too many little Hitlers casting their close-votes on anything remotely open-ended or requiring (*shock!*) judgement and experience, rather than lines of code as an answer. Even when it's a great question asked by a respected long-time contributor, like this: http://stackoverflow.com/questions/10368942/is-there-a-way-to-group-languages-by-their-approach-to-compatibility, where people cared enough to vote for it to be re-opened, it was immediately closed again.\n\nIt should be *much easier* to keep interesting questions open. Like, 1 upvote should cancel out 3 close votes. If 1 person in 3 finds a question interesting, that's still way better than most questions which technically fit the rules but are otherwise cretinous and a waste of everyone's time (but stay open). Close badly written, naive, poorly-researched questions, but lay off the interesting ones!"}, {"author_name": "Maninder", "gravatar_hash": "8e5d00aaebb9fa810603a79727d5c831", "author_url": null, "date": "Aug 09, 2012", "message": "I want to develop a media player which includes both audio and video streams. So I need suggestions about using which of them :- JMF , Javazoom and Xuggler."}, {"author_name": "Mac", "gravatar_hash": "d22164b2f3535bf852eb9a3c2086714c", "author_url": null, "date": "Dec 13, 2012", "message": "One other issue with \"Gorilla vs. Shark\" questions that didn't make the dot points is that quite often such questions end up masking the fundamental reality that, actually, perhaps an anaconda (for lack of a better cliche creature of terror) could beat them both.\n\nThat is, by asking which of two options is best, it may be masking that fact that neither is a good fit and there's something even better."}, {"author_name": "BryanH", "gravatar_hash": "24b1ed0d2cd5db2f9ea46b8c38b5c4f7", "author_url": "http://hbjitney.com", "date": "Jan 16, 2013", "message": "Ha. The Jedi Master answer to \"what language should I learn, Blub or Not Blub?\" is LEARN BOTH. Once the Padawan has learned both, she will know the answer to her own question, not before.\n\nAlso, one must weld pages 14 and 15 of \"Pragmatic Programmer\" to one's laptop and read them every single day. \n\nDo this, and one will have learned."}]}