{"response": [{"author_name": "Andy", "gravatar_hash": "811103db4bcf408dba46a72f95628429", "author_url": null, "date": "Aug 01, 2011", "message": "tl;dr == \"too long; didn't read\" in case anyone isn't fluent in LOLCatese."}, {"author_name": "Gonzo", "gravatar_hash": "823502cc91a8ecbf24fd2f61c7a219c8", "author_url": null, "date": "Aug 01, 2011", "message": "I like the \"create one\" part. It addresses the fact that you simply aren't going to get good employees if you're not a good employer. Not in this market anyway. I have say in the ads that go out and sit on the interview panel where I work, but I have failed to impress upon those above me how damaging the culture is to the bottom line."}, {"author_name": "Dave", "gravatar_hash": "9cd73f35aefc8548a3d6ad6c22139f61", "author_url": null, "date": "Aug 01, 2011", "message": "I got my current job after seeing a Careers 2.0 sidebar ad on Stack Overflow. The anecdote I can add to this story is that BY FAR the most striking element of the job listing was that it referenced the Joel Test, listing out which checkboxes the company checked (11/12, as it happens). I'd never seen that in a listing before and it got my intention strongly and immediately."}, {"author_name": "Joe Z", "gravatar_hash": "c245af4580409c11120f4ece20b7d4b9", "author_url": null, "date": "Aug 01, 2011", "message": "Ads written in a personal voice are so much more attractive, especially if it's clear a developer had a strong hand in crafting the ad.  It means good things about the involvement of the team that you will be working with... and who wants to be hired by robots (or the HR equivalent)?"}, {"author_name": "Turowicz", "gravatar_hash": "b2864ecc0dd4f3ba765287f29abbf423", "author_url": "http://turowicz.com", "date": "Aug 02, 2011", "message": "The best listing I saw on Careers 2.0 was \"Code Warrior\". I'm sure it's got the most views of them all."}, {"author_name": "Joerg B", "gravatar_hash": "1df1f7cf93dd8f04098724420457886c", "author_url": null, "date": "Aug 02, 2011", "message": "Just checking telecommute may increase the hits. But if the site gets too many 'telecommute' ads that turn out to allow telecommuting only once a week or have other restrictions, that diminishes the value of this cue, first for potential applicants, ultimately for all.\n\nAnd there is a big difference between regionally restricted part-time telecommuting vs. full-time  \"work from anywhere\" positions. It would be great, if one could search for the latter without having to browse through pages of 'telecommute in Reykjavík region' (or 'telecommute, bay area home required') ads."}, {"author_name": "Korneel Bouman", "gravatar_hash": "2c3f79bed945b193634cf6794df49661", "author_url": "http://careers.stackoverflow.com", "date": "Aug 04, 2011", "message": "@Joerg Agreed, we've just put extra guidance in place to ensure the telecommute option is only selected for true \"work from anywhere\" jobs."}, {"author_name": "Jens Roland", "gravatar_hash": "eafc9ff73a64e9d0d6f949c77d6135b7", "author_url": null, "date": "Aug 09, 2011", "message": "The site TopProspect does something interesting with job listings: they let employers offer rewards for people who refer the right candidate. How about doing something similar for the Careers 2.0 service?"}, {"author_name": "Chris Marisic", "gravatar_hash": "7c596ac963857fc409b0abe9dc01db47", "author_url": "http://imt.bz", "date": "Aug 09, 2011", "message": "Jeff,\n\nTo give you some serious real world feedback about SO careers, I recently hired 2 developers and 1 web designer. Traditional media (Newspaper, Craigslist, Dice) completely failed at producing me qualified applicants. For both of the developers I hired they came through my SO careers job posting.\n\nI also appreciate that you don't behave like Dice which is to guard the description and title like a hen house from a fox. In the first 15 days I was able to locate my senior developer, and in the last 15 days I was able to locate my mid-level developer through the same job posting with SO. The treatment I received from this has shown me for all future hiring I will start on SO first, and then consider other media ONLY if I don't get hires directly."}, {"author_name": "Erika", "gravatar_hash": "91877569582166f197294b183e025852", "author_url": "http://www.kik.com", "date": "Dec 12, 2011", "message": "TL;DR is spot on. The short essential points with a final \"bam!\" - a funny or outrageous point is my favorite. Also removing requirements that aren't relevant is key - great devs don't necessarily need degrees or 5+ year experience if they are wicked smart. \n\nAt least that's how we feel at Kik"}]}