{"response": [{"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Aug 09, 2011", "message": "An additional note about writing good tag wikis: avoid starting them with \"questions about\" or \"concerning\" or the like. It's very redundant when you're looking at a page full of tag wikis and all of them say \"Questions about XYZ\"."}, {"author_name": "Lukas Eder", "gravatar_hash": "eb96efa7a5664ba1c4ebf586abd4121f", "author_url": "http://www.jooq.org", "date": "Aug 09, 2011", "message": "A very nice idea, especially for meta, where tagging has a slightly different meaning which wasn't clear to me in the beginning..."}, {"author_name": "Zabba", "gravatar_hash": "c510febb9bed68b5cc4a09f076701e0f", "author_url": null, "date": "Aug 09, 2011", "message": "Font too small; I didn't feel like reading anything more than 6-7 words. Maybe each tag wiki needs a succint 6-7 word description as well."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Aug 09, 2011", "message": "@zabba the screenshots had to fit in 600px width; I think the tag wiki excerpts are plenty readable on the actual site. Certainly no smaller than Facebook's default text size..."}, {"author_name": "Martin Bean", "gravatar_hash": "6b17165d23ead15e66854ff882c59e0c", "author_url": "http://www.martinbean.co.uk/", "date": "Aug 09, 2011", "message": "I can't say I like it. Before I could start typing the name of a tag, it would come in an auto-complete drop-down, I can then use the up/down arrow keys and hit Enter to select my tag.\n\nNow, I feel as though I have to read the tags to find the one I'm wanting, use my mouse (or in this case, MacBook trackpad) to then hover over the tag and click. Sounds fun. It isn't.\n\nIt probably takes me 2–3 times longer to tag a question, and I'm probably less inclined to use Stack Overflow now I know I'll have this to deal with."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Aug 09, 2011", "message": "@martin keyboard works fine as well. Try your arrow keys and press enter."}, {"author_name": "Zabba", "gravatar_hash": "c510febb9bed68b5cc4a09f076701e0f", "author_url": null, "date": "Aug 09, 2011", "message": "@Martin Bean, I agree with you on the extra time. Maybe this needs to be an option - newer askers of questions, say those with less than 200 votes are shown the tag details, more experienced ones should be able to turn it on/off; preferably on-page (as opposed to a dedicated settings page). Also, an elevator pitch for the elevator, not something I want to \"listen\" to every time I use the elevator."}, {"author_name": "Jakob Eriksson", "gravatar_hash": "420430937af91f300a417cb0343fe8c9", "author_url": "http://www.magmito.com/", "date": "Aug 09, 2011", "message": "I would say, when a user has used a tag a couple of times, maybe the description is not necessary anymore?"}, {"author_name": "Scott", "gravatar_hash": "6285ff8f79ce11a5c9161011137258bc", "author_url": null, "date": "Aug 09, 2011", "message": "This feels a bit bulky to me. The description takes up at least 3 times the space of the tag itself. I was expecting the dropdown the stay the same but with the description to the right of each tag.\n\nI think you need to limit the basic description further so they are really concise and clear.\n\nAlso, it's not clear that you can click the boxes to insert the tag - I just get the I-beam cursor, not the pointer (Google Chrome)."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Aug 09, 2011", "message": "> I think you need to limit the basic description further so they are really concise and clear.\n\nBe the change you want to see, man! Mouse over the tags and click those \"edit\" links here:\n\nhttp://stackoverflow.com/tags"}, {"author_name": "Stephen McInerney", "gravatar_hash": "6cc1d82c11563b440c57280ad587ee47", "author_url": null, "date": "Aug 09, 2011", "message": "Really slows down tagging to a crawl, as the others said. Please allow us to disable this until the speed is fixed..."}, {"author_name": "jhaysonn", "gravatar_hash": "2556cb990ba61a25de484b664aecdbe0", "author_url": "http://music.pissinggraffiti.com", "date": "Aug 09, 2011", "message": "Thanks!! I always end up getting told I'm using bad tags and this looks great!  I love these sites so much!"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Aug 09, 2011", "message": "My gosh it is hard to please some of you, I think this is much better even for high rep users.  I'm at 10k+ and I admit when I have a question I just quickly use the autocomplete feature to put in anything (I know bad bad bad)...this forces me to rethink that, sacrifice a few seconds to get better tagging so that searching / finding is 10x better.  Stop your complaining this is a GOOD thing."}, {"author_name": "Ian", "gravatar_hash": "53e51f63f53abd70f19755fa14d48a44", "author_url": null, "date": "Aug 09, 2011", "message": "Thank goodness for this.  Perhaps now the much abused EMBEDDED tag will no longer be used for web page questions.  I have lost count of the number of retags that I have done to keep irrelevant questions from appearing under this tag alone."}, {"author_name": "Nick Wiggill", "gravatar_hash": "e7a72f7d8c02aaabc041f1d48bed428f", "author_url": "http://www.handcraftedgames.com", "date": "Aug 09, 2011", "message": "That's wicked guys -- keep up the amazing work, stackexchange is the best!"}, {"author_name": "BrunoLM", "gravatar_hash": "ef1a0f00d57917768acdc5b379ca1b28", "author_url": "http://goo.gl/KIObS", "date": "Aug 09, 2011", "message": "I think this is amazing. Now I see a little more value on tag wiki. And it makes clear that tags have a significant value and you should tag your question properly.\n\n+Jeff Atwood Can you make up/down arrows go up and down instead of right and left? I feel confused...\n\n\nAnd people, more time to tag? Can't you type faster then the dropdown delay?"}, {"author_name": "Mohamad", "gravatar_hash": "d5b87af3621bd16385a386558b32644e", "author_url": null, "date": "Aug 09, 2011", "message": "Sorry to hijack this post, but this seems relevant. Any chance the tag-wiki association columns will be included in the datadump going forward? There's an open question on Meta: http://meta.stackoverflow.com/questions/99669/can-we-include-tag-wiki-associations-in-the-data-dump"}, {"author_name": "Nate", "gravatar_hash": "0721b82c5a9f469013a1c54d58c5cca7", "author_url": null, "date": "Aug 09, 2011", "message": "Awesome idea!"}, {"author_name": "Michael", "gravatar_hash": "29d7c49f6f174710788c79011219bae1", "author_url": null, "date": "Aug 09, 2011", "message": "I'm so happy that you displayed the descriptions with the tags.  You are doing such a great job with stackoverflow!  People need to get with the program and learn how to use tags the *right* way."}, {"author_name": "Chmouel", "gravatar_hash": "b306ae95de49ed804955160aab9dccd7", "author_url": null, "date": "Aug 09, 2011", "message": "What about getting a bit crazy and detect tags by auto-learning from previous posts helped by bayesian type of learning? and the suggeted tags would be on top..."}, {"author_name": "Rogier", "gravatar_hash": "edaf47fb949ddcf8b988bca112c2fd4a", "author_url": null, "date": "Aug 09, 2011", "message": "Why the tagging system anyway, it is handy for general tags as \"Javascript\" or \"C#\", but a good search engine will work miracles where tags will come up with more nonsense result if not good tagged by authors. I was surprised to see so much effort was put in this new tagging system while it is clearly a thing of yesteryear."}, {"author_name": "Steve", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Aug 09, 2011", "message": "I think I agree with a few folks above... I much prefer the old, linear vertical list.\n\nThe trick is, *I Know* what the tags are that I'm entering, the drop down is only for the convenience for me to know if I should use \"vb-script\" or \"vbscript\" (for example) which I got from the counts after each tag name... or to save typing time via quick selection.\n\nI can't think of a single time in my life that I would write a question and not know what the applicable tags might be.  Better yet, there are 100's if not 1,000's of other users on this site that could better re-tag questions than most beginners would (even with help)\n\nE.g. (completely bogus) if I was to ask a question about \"how to implement a login system using openID in cobol for mobile device X\"\n\nIn the tag box I would type: \"cobol, openid, robot-phone\" and simply pick the matches in the list as they pop up. I don't need to know that openid is a cool way of logging into multiple online services and saves kittens and unicorns while shutting down potential bad security implementations, yada, yada, yada...\n\nAdditionally I find the delayed loading for all the additional data to be distracting."}, {"author_name": "Tom Wijsman", "gravatar_hash": "d3b75bb3bda58d5d4a7d31b820f856c9", "author_url": "http://127.0.0.1", "date": "Aug 09, 2011", "message": "Very nice improvement, an answer to the \"Can we have better tag wiki excerpts saga?\" :)"}, {"author_name": "Graham Perrin", "gravatar_hash": "0c02caffb6b5bb7c900b09203e783b28", "author_url": "http://cheekymonkey.bounceme.net/", "date": "Aug 09, 2011", "message": "A much nicer interface, thanks! \n\nA bug: <a href=\"http://meta.stackoverflow.com/q/101524/166799\" rel=\"nofollow\"> info for a tag refers to questions (not info)</a>"}, {"author_name": "David Hogue", "gravatar_hash": "a5deff67d53168f16385d7b14ee20bd9", "author_url": "http://davidhogue.com/", "date": "Aug 09, 2011", "message": "Nice, I like it."}, {"author_name": "Kublai Khan", "gravatar_hash": "0d825a4fb8f4417045815f4c921aa0cc", "author_url": null, "date": "Aug 09, 2011", "message": "good, this should stop people from tagging GET for questions about java get methods"}, {"author_name": "nick", "gravatar_hash": "3eda6fcd3204ef285fa52176c28c4d3e", "author_url": null, "date": "Aug 09, 2011", "message": "A waste of time. Over-Engineered.\n\nIsn't the community aspect of Stack-Overflow supposed to resolve such issues? Instead you design a heavy-weight object on a webpage to slow everything down."}, {"author_name": "Poma", "gravatar_hash": "8b62258aac6cc2ac7e835c114547892d", "author_url": null, "date": "Aug 09, 2011", "message": "I think there must be an option to disable wiki for tags I already used few times cause I already know whats written there."}, {"author_name": "UncleZeiv", "gravatar_hash": "bd24dab59beada36b501670cd01b8e2c", "author_url": "http://unclezeiv.kerid.org", "date": "Aug 09, 2011", "message": "We should probably have a blog comment bingo here, and \"I’m probably less inclined to use Stack Overflow now I know I’ll have this to deal with\" should be one of the entries :)"}, {"author_name": "David H", "gravatar_hash": "0eb86da4a958c2ecb09afef3675885a7", "author_url": null, "date": "Aug 09, 2011", "message": "&gt; @martin keyboard works fine as well. Try your arrow keys and press enter.\n\nIt would be good if the first tag in the list was auto-highlighted by default. \n\nThat way I can type 'c#' (tag completer pops ups with 'c#' tag highlighted) and click enter.  Eliminates the need to click 'down arrow' for any instance when the tag you want is first in the list.  Also eliminates the 'down arrow' click when you want to select something other than the first in the list.\n\nI know you can just type the tag and (assuming you've typed it correctly) hit space, but this isn't as intuitive or obvious."}, {"author_name": "sgMarshall", "gravatar_hash": "d087e49079ba7578681db200fb417f51", "author_url": null, "date": "Aug 09, 2011", "message": "Nice improvement. I still fail to understand why tags aren’t nested and we have to deal with all these versioning tags. It also seems like entering a version/typeof tag should include the parent tag. Why should I have to type photoshop and image-editing  or mvc and mvc3 for instance? More importantly, if I ignore an area I’m forced to re-ignore the subset when someone makes a new tag for that same family."}, {"author_name": "Dung Tran", "gravatar_hash": "094e440df0620aa4e6e547eddfa35a3b", "author_url": "http://windymate.com", "date": "Aug 09, 2011", "message": "Pretty nice! love it! :P"}]}