{"response": [{"author_name": "Chris Lutz", "gravatar_hash": "4e698bea14e1d5f5c86d0359e5f24d28", "author_url": null, "date": "Aug 10, 2011", "message": "A dozen upvotes isn't cool. You know what's cool? A hundred upvotes."}, {"author_name": "Jason Punyon", "gravatar_hash": "c88159de92d664d35761fe5828cc5ccd", "author_url": "http://jasonium.com", "date": "Aug 10, 2011", "message": "Joel doesn't make this part of the argument but here it is anyway:  It would be really dumb for us to build a careers service giving unfair advantage to the high rep stackoverflow users.  There simply aren't enough of them out there to make it worth our while (and a bunch of them already have great jobs so we'd just annoy the crap out of them).\n\nWe used to have a feature where employers could sort by reputation, but it was dumb dumb dumb!  Employers would all try to contact the same set of people because high rep beat out all the other signals.  We've since ripped that out for a better algorithm that takes a more well rounded approach to ranking candidates.\n\nThe lesson here is tag your careers profiles appropriately so we can give you proper credit for everything."}, {"author_name": "Chris Lutz", "gravatar_hash": "4e698bea14e1d5f5c86d0359e5f24d28", "author_url": null, "date": "Aug 10, 2011", "message": "On a more serious note, might it not also be a good idea to let people highlight excellent questions they've asked? I've seen quite a few questions (and written one or two, in my humble opinion) that show more understanding of the language than many answers to far more simple questions (even answers from me sometimes)."}, {"author_name": "Antony", "gravatar_hash": "f46eeca946f86d3b74d982c93cdb5da4", "author_url": null, "date": "Aug 10, 2011", "message": "@Chris - great idea. Then Joel can link 'how to move the turtle' in his profile"}, {"author_name": "Evan W.", "gravatar_hash": "ad045517c7f91eb4619dbda8830d6714", "author_url": "http://techerator.com", "date": "Aug 10, 2011", "message": "Now if only I could get an invitation to Careers 2.0!"}, {"author_name": "Caleb Cushing", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://xenoterracide.com", "date": "Aug 10, 2011", "message": "Now if only I ever got anyone searching my resume on Careers... Also, it kinda sucks that it only shows the top percentages for SO, my best SE site is U&amp;L . Careers would do better to allow for more than just programming."}, {"author_name": "Stefan", "gravatar_hash": "92e5c51218f00220e0362c47b2a94b9a", "author_url": null, "date": "Aug 10, 2011", "message": "What? Your top questions don't include http://stackoverflow.com/questions/1003841/how-do-i-move-the-turtle-in-logo.\n\nI find that absurd."}, {"author_name": "Stefan", "gravatar_hash": "92e5c51218f00220e0362c47b2a94b9a", "author_url": null, "date": "Aug 10, 2011", "message": "A bout of confusion. Top questions might also be useful."}, {"author_name": "Oliver", "gravatar_hash": "13c44ef2d9d79dcca761a584be868def", "author_url": "http://ogware.wordpress.com", "date": "Aug 11, 2011", "message": "Jeff, while I agree with pretty much everything in your article, you seem to have completely missed the point of the question that triggered it: It's not about users being afraid to have a low SO rep listed on their Careers 2.0 page. It's about them not being able to even have a listing in the first place because they lack the rep points to receive an invite."}, {"author_name": "David Fullerton", "gravatar_hash": "0fda7d8abd0542ef6194287ea39d8a8b", "author_url": null, "date": "Aug 11, 2011", "message": "@Oliver If you're looking for an invite, fill out the form at http://careers.stackoverflow.com/cv/get-one.  Even if you don't have high rep, if you can link to some awesome answers you've given or other stuff you've done you'll get an invite."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Aug 11, 2011", "message": "<blockquote>We used to have a feature where employers could sort by reputation, but it was dumb dumb dumb! Employers would all try to contact the same set of people because high rep beat out all the other signals. We’ve since ripped that out for a better algorithm that takes a more well rounded approach to ranking candidates.</blockquote>\n\nAnd guess why that feature existed? Because employers asked for it... clearly part of the challenge of careers is educating <i>employers</i>."}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Aug 11, 2011", "message": "By any measurement, Stack Overflow is closer to a forum than to a wikipedia.  95% of activity is on new topics, and even the top questions die within a few hours.  Wikipedia is about building a knowledge base, with 95% of activity on topics that are years old.\n\nYou can easily verify this on SE data."}, {"author_name": "Oliver", "gravatar_hash": "13c44ef2d9d79dcca761a584be868def", "author_url": "http://ogware.wordpress.com", "date": "Aug 11, 2011", "message": "@David: Thanks, but I already got my profile way back when they were free to get. Didn't know about the get-one form. That certainly kind of evaporates my argument... ;)"}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": null, "date": "Aug 13, 2011", "message": "I wish I could upvote Caleb's comment ... <i>\"Careers would do better to allow for more than just programming.\"</i>\n\nI know you folks have a lot going on, but this is the next announcement I'm really looking for. Careers for other Stacks."}]}