{"response": [{"author_name": "Geoffrey Van Wyk", "gravatar_hash": "4baac68c8723d36ac46fb8bc91019e75", "author_url": "http://roadsofcode.wordpress.com", "date": "Aug 03, 2011", "message": "I hope the Biblical Hermeneutics or Christianity site will launch this decade."}, {"author_name": "Geoffrey Van Wyk", "gravatar_hash": "4baac68c8723d36ac46fb8bc91019e75", "author_url": "http://roadsofcode.wordpress.com", "date": "Aug 03, 2011", "message": "When are you guys going to invite Richard Stallman?"}, {"author_name": "Paul Lofte", "gravatar_hash": "39ae5142617860dd8883e7a5ccc4c092", "author_url": null, "date": "Aug 03, 2011", "message": "Towards the end of the podcast the team references advice given by Miguel about managing distributed teams.  I found the soundbite interesting and wanted more information.  I found a write up by Jeff on his blog from May 2010 that references this as well.  Thought I would share.\n\nhttp://www.codinghorror.com/blog/2010/05/on-working-remotely.html"}, {"author_name": "Steve", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Aug 04, 2011", "message": "I hate to be nit picky on this but, well, I'm going to be ;-)\n\nIs there any chance that the StackExchange podcast files can be named something legible and meaningful?\n\nSaving files like: \"bDGwYREGxedw.128.mp3\" to my PC makes trying to find this file a royal PITA.\n\nI often download the podcasts when I see the new blog post (at work) but I don't get the chance to listen until later (e.g. the commute /at home).\n\nI can obviously (and have done so) rename every single podcast download - but it gets pretty annoying after a while."}, {"author_name": "Sean", "gravatar_hash": "a61e911f12f12082434c22112640b910", "author_url": "http://about.me/dillieo", "date": "Aug 04, 2011", "message": "Thanks for another great podcast. Having Jeff, Joel, and Miguel are the top 3 of my 4 favorite people to listen to, for your depth of knowledge on a wide variety of topics, plus you mesh well together.\n\nNow if you can get Scott Hanselman to join you three (I know he's been on before) I'm sure unicorns and other feats of wonder will magically occur.\n\nKeep up the great work!"}, {"author_name": "Steve", "gravatar_hash": "7edf2b47214907a9bf6221d072eb34f4", "author_url": null, "date": "Aug 10, 2011", "message": "Jeff, you brought up BrowserID a couple times around when you guys were talking about Costanza Wallet. Joel thought it was supposed to be built into the browser, but you said it wasn't. I think both are true.\n\nIdeally, your browser will interface directly with GMail or Yahoo or whatever to verify your e-mail, and authorize you to log into stackoverflow. If your browser doesn't have the support, it falls back to browserid.org: http://lloyd.io/how-browserid-works\n\nI look forward to your blog post about it that you said you'd like to write."}, {"author_name": "Steve", "gravatar_hash": "7edf2b47214907a9bf6221d072eb34f4", "author_url": null, "date": "Aug 10, 2011", "message": "Correction, Joel thought it was built into the browser, and you said it was just a simple piece of javascript."}]}