{"response": [{"author_name": "Oak", "gravatar_hash": "f7d4d2fea0deac168bc7e00e6d8f1db5", "author_url": null, "date": "Aug 31, 2011", "message": "Jeff, regarding your concern with gaming - I remember one of the goals of stackoverflow was to make finding answers to questions easier than browsing through gazillion forum thread pages or using a certain sex-changing service. I don't really see why it can't also apply to recreational activities, not only potentially-professional ones. In fact, you have dozens of recreational suggestions on area51, a whole category, and I think it's a good idea. People face problems, real ones - even for recreational activities - and they want answers. Why not help make the Internet a better place?\n\nAlso, I think it's a good sign that gaming (and android) have a 2:1 relation between views and questions, compared to the standard 1:1 across most other sites. I interpret it to mean that the average gaming (and android) question represent a problem for a lot of other people as well, and that there are less esoteric questions that only deal with a very narrow situation."}, {"author_name": "MBraedley", "gravatar_hash": "faee7c8a4f200567714ca387446d8721", "author_url": null, "date": "Sep 01, 2011", "message": "Alex, can you link to that SuperUser question about switching audio outputs?  Having something like that would really help me at home."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Sep 01, 2011", "message": "Although SO with it's auto-link and auto-login features makes it very difficult to maintain separate identities and it's obviously in SO's interest to have genuine IDs to sell to advertisers.\n\nThere is a reason for having different identities for different SO sites - it's not a bug! As a gay, Jewish, VBA programmer Joel may not be aware that there are certain lifestyle choices that may lead to some people being unfairly discriminated against by employers"}, {"author_name": "Paperjam", "gravatar_hash": "6b6024b00046764125803fe07c5b5f95", "author_url": null, "date": "Sep 03, 2011", "message": "Perhaps I'm just having a curmudgeon \"get off my lawn\" moment, but I'm finding myself increasing annoyed with Alex participating in the podcast.\n\nI have nothing against Alex, but I've never liked the radio format where you have a bunch of hosts with microphones commenting. It's always struck me as unprofessional and non-conducive to creating good content.\n\nThere's too much noise to signal, so to speak, in that the hosts are seemingly only ever able to make bad one-liners and superfluous, uninteresting commentary. I personally avoid listening to the radio simply because of this.\n\nI suppose I'm just too used to the old style where it was just Jeff and Joel. Well, mostly Joel, with Jeff occasionally saying \"OK\" to Joel's long dissertation on why the Earth is shaped like a banana, then proceeding to change the subject. But I just wanted to point out my, and possibly others', general frustration with and dislike of the new format."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Sep 04, 2011", "message": "@Paperjam is Alex really participating <i>that much?</i> I felt like it was quite rare, no more than a few minutes out of every 60+ minute podcast at most."}, {"author_name": "ChaosGamer", "gravatar_hash": "27c94dede0a083a9a103f7e7f63e6cd7", "author_url": null, "date": "Sep 04, 2011", "message": "So, Jeff, are you stil interested in having over-the-internet Guest? \n\nP.S. how do you login in this place?"}, {"author_name": "ChaosGamer", "gravatar_hash": "27c94dede0a083a9a103f7e7f63e6cd7", "author_url": null, "date": "Sep 04, 2011", "message": "Oh. Nevermind."}, {"author_name": "Paperjam", "gravatar_hash": "6b6024b00046764125803fe07c5b5f95", "author_url": null, "date": "Sep 07, 2011", "message": "@Jeff You're right that he's not participating as much as I made it sound. I may be overly-sensitive as a result of other programs that have adopted this type of format and have subsequently been ruined, from my perspective at least.\n\nIndeed you can't please everyone, and I'm certainly not trying to make the case that my view represents that of your larger audience. I've been a listener long enough to know you guys typically (and rightly) make fun of people like that - which, incidentally, is one of many reasons I've listened for so long.\n\nI just want to point out what I believe the risks are to embracing this format, especially if Alex (or any other additional \"personality\") increases their air time relative to the rest. \n\nI have confidence that the SE podcast will continue to be among the best out there so long as you guys are at the controls. Again, I just wanted to point out what may ultimately be a trivial and anecdotally-defended observation."}, {"author_name": "THISISATEST", "gravatar_hash": "7e41abd1ace04fa71f9439f8f3bfd491", "author_url": "http://avg.com", "date": "Sep 12, 2011", "message": "alert('\"rankmyhack\"')HELLO"}, {"author_name": "Pat", "gravatar_hash": "cf5be907f3bff0fa48980e7bfe5bf009", "author_url": null, "date": "Sep 15, 2011", "message": "I am in violent agreement with @Paperjam.  Who is Alex anyway?  You click on his name and you get a photo of a rocky shoreline and the revealing information that he likes good food and works for an internet startup.  I am sure he is a nice guy and a decent \"producer\", but he reinforces my biggest pet peeve about the podcast:  too meta.  I don't really care about how the podcast is built, and he adds nothing other than one-liner jokes, and occasionally demonstrating that Joel's anachronistic tech references go completely over his head.  He is the Ed McMahon of the podcast.  Please don't turn the podcast into a clone of the Howard Stern show where the sidekick \"personalities\" become the focus.  Also Joel's rambling fake-confused intros that make it seem like he is having trouble context-switching from his previous engagement is getting old.  OK, thanks, I have got all of my curmudgeonly bitching done for the week now!"}]}