{"response": [{"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.semiaxis.com", "date": "Aug 19, 2011", "message": "Ah, the evolution of Community Wiki.\n\nYou've come a long way baby!\n\n(Glad I can still use you to avoid rep gain on meta...)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Aug 19, 2011", "message": "I'm going to go through and upvote all your old meta posts now, Adam. <i>Because I care.</i>"}, {"author_name": "Margaret", "gravatar_hash": "98f688a1ba2e5000d77f31882aee6ea5", "author_url": "http://mmaster.deadjournal.com", "date": "Aug 19, 2011", "message": "@Jeff:\n\nBut won't that get flagged as \"suspicious voting behaviour\"?\n\n;)"}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.semiaxis.com", "date": "Aug 19, 2011", "message": "Hrm, let's see here...\n\n1,000 non community wiki posts, 10 rep each...\n\nI'm going to have to hold, like, *at least* 20 bounties to bleed off all that extra rep.\n\n;P"}, {"author_name": "Andrew Stacey", "gravatar_hash": "c9359d5d299cd6f7b0bf8cc123c69234", "author_url": "http://www.math.ntnu.no/~stacey", "date": "Aug 20, 2011", "message": "There is a type of question that should still be Community Wiki.  There are, occasionally, questions where there it is clear from the outset that the answerer and the answer should not be linked so closely as in a usual answer.  These are cases where the answer does not take any particular effort by the answerer and where the answerer should take neither the credit nor the blame for the answer.\n\nAn obvious such is a question such as \"What is the best book for a beginner learning LaTeX?\".  It's a reasonable question (not fantastic, but okay) but the most likely answers are just a list of books, maybe with a very short \"I like this because it's short.\".  The voting on such a question would help someone see which books are considered the best, and this isn't really related to the person who listed the book.  So the votes on an answer shouldn't really be reflected in the answerer's reputation.\n\nOf course, such questions shouldn't be the norm, and making it harder to make questions CW discourages them, which is a good thing.  But they can also be a useful way of drawing people in to the site.\n\nIn this particular case, it's easy to say that each person answering should just make their answer CW, but that involves a concious act by the answerer and they might not be aware of what that means (being more focussed on the *editing* than the *voting*).  Making the question CW is a simple way of ensuring that all the answers are CW.\n\nSo whilst I agree with the general principle that CW has been misused, it's not completely useless.  Make sure you hold on to the baby when you pull the plug."}, {"author_name": "Kaveh", "gravatar_hash": "eef361d616082b83f1f1a1e74dc572d8", "author_url": null, "date": "Aug 20, 2011", "message": "It is a good improvement over the current situation, but it still needs improvement.\n\nThe problem is essentially this: a question is good and interesting, but the effort to write the question is not much, so users want to say: hey, the answer to this question is interesting to us and we want to know the answer, i.e. give the feedback to others that please answer this question, but they don't want to give reputation to the OP because asking the question didn't need much effort by the OP. A vote represents both the interest of the users in knowing the answer and awarding the OP for asking the question.\n\nSo we make the question CW and the OP does not gain reputation. Now the problem is that it also forces the answers to be CW also, but why? An answer to such a question may justly deserve the reputation from votes, it can be a very high quality answer which needed high levels of knowledge and effort. I think it should be possible to make a question CW without forcing its answers to be CW also. It should not be difficult to implement this and this will be a handy possibility for moderators to make a question CW without making the answer CW also."}, {"author_name": "MatthewRyanRead", "gravatar_hash": "9f45abdea17c709041812609c7fdfb69", "author_url": null, "date": "Aug 20, 2011", "message": "Great post, Grace.\n \n@Andrew, I disagree.  Questions that solicit one line answers should be discouraged; itemized lists aren't useful.  If someone provides a great answer that goes beyond sticking in a book name with no thought and actually describes why the book is so great and how it helped them, they should be rewarded with rep!  Crappy lists should be closed, and well-written recommendations should not be CW.  No room for it there."}, {"author_name": "Aarobot", "gravatar_hash": "687f8a43b58fe35c8b2933f1f16b13cb", "author_url": null, "date": "Aug 20, 2011", "message": "Congratulations Andrew, that was a brilliant demonstration of completely and utterly missing the point. One has to wonder if you stopped reading after the 3rd line.\n\n\"What is the best book for a beginner learning LaTeX?\" is exactly the kind of question you *don't* want littering your site:\n\n1. It has no inherent value to the internet because Joe Average can find far better quality results on Amazon.\n\n2. It has negative value to the community because instead of attracting experts and enthusiasts, it will drive the majority of them away.\n\n3. The criteria are not even close to being specific; there are hundreds of such books and all of the answers and votes amount to nothing more than personal preference. No genuine indication of the quality of the answer OR the book itself.\n\n4. Because beginners invariably outnumber experts, the question will soon start to eclipse all others in votes and become one of the highest on the site, and then continue to get bumped to the front page over and over and over again.\n\n5. Once that happens, it just sits there, becoming more and more obsolete over time, yet inviting others to post similar questions and perpetuating the myth of community wiki as a Get Out Of Jail Free card, while moderators and experienced users futilely try to explain that yes, that *used* to be considered an acceptable question, but not *anymore*, so we're keeping it around for *historical* purposes, but please don't *copy* it, and nobody listens and nobody cares, and your best contributors start leaving in disgust because the crap just keeps coming.\n\nPlease, get it through your head: If your answer to \"Why should this be Community Wiki?\" includes the word \"reputation\" anywhere, you're doing it wrong."}, {"author_name": "Grace Note", "gravatar_hash": "b487224adf8dfd030f683530eb201ca7", "author_url": "http://gaming.stackexchange.com", "date": "Aug 20, 2011", "message": "Andrew Stacey, that's both an example of something that works, and something that could be improved. In this case, it is the answers which would need improvement - you could stay with just one-line answers, or you could encourage users to actually provide greater information than just the link to the book. Explain why it is useful to those learning the system, and even comparisons to other books - you can go a long way towards improving such answers beyond their one-line nature, and that removes the concern about reputation. Remember that the important thing is the votes, not the reputation.\n\nNevertheless, it's understood that sometimes, community wiki is something to be used. It's a specialty tool, not something to be universally avoided or loathed. As long as it isn't a prevalent presence on your site, it's fine to have a handful of questions which end up as community wiki. However, now that all the contributions to such *are* community wiki, why not take advantage of that, and improve what answers you do get? It is encouraged by the effect, after all. ♪"}, {"author_name": "Andrew Stacey", "gravatar_hash": "c9359d5d299cd6f7b0bf8cc123c69234", "author_url": "http://www.math.ntnu.no/~stacey/CountingOnMyFingers", "date": "Aug 20, 2011", "message": "Matthew: Your reply to my comment gives no justifications, so I shall ignore it.\n\nAarobot: Sorry, I stopped reading after the first line so I don't actually know what you said.  More seriously, your reply seems far more like a \"This question would be off-topic on  and so therefore must be off-topic for TeX-SX.\" than a reasoned argument.  Based on the assumption that it is off-topic, you proceed with your argument.  Since I disagree with that assumption, it is pointless to dispute the points.  I've checked your account and you don't appear on TeX-SX, so how do you know what is on-topic or off-topic there?\n\nSetting that aside, your argument should have started with the assumption that this question was on-topic and *then* showed why my primary assertion (that there is still a situation where CW may be useful) was wrong.  As you attacked my example question (which I admitted wasn't a great question), and not my actual point, your list is irrelevant.\n\nGrace: Thanks.  I completely agree with your comment.  That's what I felt was missing from the actual post and hence why I commented.  Community wikis are often in need of more housekeeping than other posts, but that doesn't make them necessarily bad.  Indeed, it could make them great.  I was just looking at another of our CW questions and thinking, \"This is a mess, it needs cleaning up.\".  But the cleaning up is actually quite easy as it is simply a matter of organising the material.  No-one has to generate it for themselves.  One line answers can be a good way of quickly getting the information needed to make a single good summary post.\n\nIndeed, I'd say that that's the best use of a CW question-and-answer: when the spirit is far more \"let's get together, pool our knowledge, and write an article on X\" then \"Can someone answer my question?\".  Most often, the best CW questions are those with a *single* answer which summarises something.  But often the \"one line answers\" are what's needed to gather the information to make that post in the first place.\n\n(I see I've gotten a mathematical reCaptcha.  This'll be fun!)"}, {"author_name": "Robert (Jamie) Munro", "gravatar_hash": "6ce283360ffa5a15eebb82b7ff2a7d23", "author_url": null, "date": "Aug 20, 2011", "message": "Andrew's example question is from a class of question which I think might need different handling to a normal question. Community wiki might be that different handling, but I'm not sure that it does the right thing.\n\nHis example was possibly not ideal. A better one might be http://stackoverflow.com/questions/3178448/list-of-html-to-pdf-converters . It's on topic. The problem is that there are multiple valid answers. They work best when people post each answer separately rather than as a list, so that the best solutions bubble to the top of the voting. People can edit answers and add comments all in one place about the particular thing.\n\nThe problem is that the voting rep goes to whoever was first to suggest the thing that people like, rather than who wrote the best answer. I think discouraging this kind of question would be a shame, as there aren't other sites on the net with knowledgeable communities to ask them on."}, {"author_name": "tzenes", "gravatar_hash": "947c457cb4e5480cb8b2f09e49794834", "author_url": null, "date": "Aug 20, 2011", "message": "Thank you for voicing what I've half true for a long time. CW used an excuse is harmful, but worse if the questions which were marked as CW only to have great answers render no reputation to hardworking users who deserved it. Questions should stand on their own right, not have CW as some double standard"}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Aug 21, 2011", "message": "So what is an example of a question that is, and should be, CW? Why don't you simply remove CW outright?\n\nYou spend a lot of text talking about all the ways in which CW is harmful (which I've been saying for at least the past 18 months), and then end with a two-liner about how CW should be used, but without providing a single example of such. If an example exists, let us see it. If it doesn't, it rather undermines the case that CW deserves to exist *at all*."}, {"author_name": "Grace Note", "gravatar_hash": "8386bd0bd1eab541b2b956be31d9cb40", "author_url": "http://gaming.stackexchange.com", "date": "Aug 22, 2011", "message": "jalf, there aren't many good examples of questions that are, and should be, community wiki. In most cases such questions either shouldn't be community wiki, or shouldn't be asked. That said, the questions do exist, and so I have an example for you.\n\nSuper User has the following community wiki question from its early days: http://superuser.com/questions/100360/what-to-do-if-my-computer-is-infected-by-a-virus-or-a-malware - \"What to do if my computer is infected by a virus or a malware?\". It encourages a unison effort to create a general FAQ for virus/malware care (and also reminds people that specific virus/malware questions remain appropriate). The top answer in fact has 5 significant contributors (plus 3 editors). \n\nThis is what I refer to in my blog post, near the only highlight, as \"preserve the value [...] while stifling their growth\". Unchecked, this kind of question could gather everyone's home remedies, and then some. As community wiki, it encourages people to contribute by adding to the existing content, with a small benefit of also discouraging unwarranted and low quality posts. It serves as a symbol of effort of the users, not merely ambitions."}, {"author_name": "Torben", "gravatar_hash": "5fa8a2ac688a0d4bcdf3d8ffb923d35b", "author_url": null, "date": "Aug 22, 2011", "message": "+1 to jalf! Examples of correct use are missing. http://meta.stackoverflow.com/q/103393/136036"}, {"author_name": "Michael Pryor", "gravatar_hash": "4b17d5b9e0699571a698ef6aa6fbc900", "author_url": null, "date": "Aug 24, 2011", "message": "@Grace If CW is being used incorrectly almost all of the time, or shouldn't be used at all, why doesn't that feature get removed?"}, {"author_name": "Grace Note", "gravatar_hash": "8ef778ca7c04ef190fdbc3d6347b182f", "author_url": "http://gaming.stackexchange.com", "date": "Aug 24, 2011", "message": "Michael,\n\nThere's a lot of good argument for removing the feature - suggested edits largely override its necessity for opening editing, and indeed it is largely abused and people misunderstand it.\n\nThe auto-application of community wiki in response to heavy editing and heavy answer count, that is the kind of thing which shouldn't be community wiki. In ways, I feel that taints the understanding of what community wiki is for, which leads to more abuse. A defense measure is necessary but we should develop something rather than taxing an already misunderstood device.\n\nIn the usage for answers, I standby that it is a functional tool. It may be misused, but in those cases it is rather harmless and ineffectual, not detrimental. When it isn't misused, it can lead to great collaborative effort, presenting the option of cooperative contribution without being obnoxious about it.\n\nQuestions? I could say that I'd be fine with removing community wiki from questions completely, not merely just restricting its access. However, there are a handful of those \"valuable but dangerous\" questions like the Super User virus care question that do make good use of it. I think that until we can devise a stronger and better system to handle these, we can't get rid of community wiki quite yet"}, {"author_name": "Doug Erickson", "gravatar_hash": "ffbf4e85b8ffbae4e9039b9c0cf07bc8", "author_url": null, "date": "Aug 30, 2011", "message": "Hey, while we're (sort of) on the topic of Community Wiki, I think we should talk about getting rid of the annoying conversion of posts to CW as a shoddy workaround to the bumping game.\n\nCan some effort be expended on actually fixing the problem (by limiting the effect of bumping actions) rather than punishing people who take the time to maintain their posts?\n\nhttp://meta.stackoverflow.com/q/8654/135396"}, {"author_name": "sgMarshall", "gravatar_hash": "d087e49079ba7578681db200fb417f51", "author_url": null, "date": "Aug 30, 2011", "message": "I’d like to see community wiki used to convey questions which contain their own answers and lists of information (lists of links and general information) which are likely to change over time and would benefit from others being able to edit to keep the information up to date."}, {"author_name": "Roy", "gravatar_hash": "2ca16d6263e77a9af0aec00b75106517", "author_url": null, "date": "Dec 01, 2011", "message": "Is a question can be turned into community wiki when the following happenes:\n\n1.The body of the post has been edited by at least five (5) different users.\n\n2.The post has been edited ten (10) times by the original owner.\n\n3.The question generates more than 30 answers (15 on Super User). In this case, the question and all answers will enter community mode, as will any future answers.\n\n4.A moderator has reason to believe that the question serves better in community wiki mode."}]}