{"response": [{"author_name": "Robert Cartaino", "gravatar_hash": "9dfd656461a1d0a2db33f3ed4183f4c0", "author_url": "http://stackoverflow.com/users/98786/robert-cartaino", "date": "Aug 17, 2011", "message": "Thanks, Alex. Great overview of the setup and process... but no mention of \"ON AIR\" light? ON AIR light is sad."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Aug 17, 2011", "message": "vote close - move to meta"}, {"author_name": "Justin Nelson", "gravatar_hash": "d787caaf04b85641692a24099fcee990", "author_url": null, "date": "Aug 17, 2011", "message": "I have a guess what a mix-minus feed is.  But could you please provide a quick description of what that means?"}, {"author_name": "Chris Boylan", "gravatar_hash": "4d3669c28a93c209801c8063cc11aa39", "author_url": null, "date": "Aug 17, 2011", "message": "A mix-minus feed is simply the mix of all inputs running through the board, minus your own input, so you aren't getting yourself back after a small processing delay. It's used when the input is coming from someone remote (via phone, Skype, ISDN, whatever). If you've ever had a phone call where you could hear yourself back about half a second after you speak, you'll understand why that's so distracting.  \n\nThe tough part in this case is that they need to generate multiple mix-minuses.  As a result, they basically need to take each input discretely and create multiple mixes in software (or have a mixing board with a ton of mix busses)."}, {"author_name": "colin", "gravatar_hash": "7c5686ad6187300e94ac1da5c5765d5a", "author_url": null, "date": "Aug 17, 2011", "message": "Justin, a mix minus feed is everything but your own audio, just because people get disconcerted when they hear themselves back from the remote end, especially if there is a time lag."}, {"author_name": "Justin", "gravatar_hash": "fa8cd7ca9f44b29511490e5ad8013cad", "author_url": "http://recordingquestions.com", "date": "Aug 17, 2011", "message": "You guys really need to properly post-process your podcasts audio with compression and limiting.    This way I wont have to crank the volume to absurd levels and risk going def when someone laughs into the mic."}, {"author_name": "Alex Miller", "gravatar_hash": "adecb788d681f6003080386a5202df2a", "author_url": "http://www.alexmiller.net", "date": "Aug 17, 2011", "message": "@Justin which episodes are you referring to?  All of our recent ones have all channels recorded independently and then we run dynamic compression across everything individually before combining it all into the final product and leveling."}, {"author_name": "Neil Fein", "gravatar_hash": "a3988c74befe682a08e8461f005106df", "author_url": "http://magnificentnose.com", "date": "Aug 17, 2011", "message": "That's a pretty serious setup for podcasting."}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Aug 17, 2011", "message": "You mention that the episodes are \"edited\" - is that accomplished using Reaper as well? Also, you mention that your mixer does the mix-minus, but then you also say you picked Reaper because it can do mix-minus in software - are both required?"}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Aug 17, 2011", "message": "@Neil Fein  It's the money effect... :)"}, {"author_name": "Alex Miller", "gravatar_hash": "adecb788d681f6003080386a5202df2a", "author_url": "http://www.alexmiller.net", "date": "Aug 17, 2011", "message": "We originally picked Reaper before we had the Yamaha board and back then we needed to do mix-minuses in software.  All Reaper is used for now is capturing the individual audio tracks.\n\nNow we use Audacity for editing"}, {"author_name": "Benedict Cohen", "gravatar_hash": "e164876f30b5aa511b02c6241b5315da", "author_url": "http://benedictcohen.co.uk", "date": "Aug 18, 2011", "message": "Interesting to know. The remotes stikes me as a bit OTT. What was the reason for picking 4 mac minis instead of 1 mac mini with a better audio interface?\n\nA bit of post production would be good. On the last podcast Joel was very sibilant-y. It made it uncomfortable to listen to with earphones. A bit of de-essing would have sort it out."}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": null, "date": "Aug 18, 2011", "message": "I just want to say, the audio quality has gotten a LOT better in these last 3-4 podcasts. I complained a few times in these comment threads so it's only fair that I let you know: it's working. \n\nThanks very much. The effort is appreciated."}, {"author_name": "Michael", "gravatar_hash": "304d6e1b17c5bdd141f9dc5aef93587b", "author_url": null, "date": "Aug 18, 2011", "message": "One thing I find annoying is that Joel's audio is always really loud with lots of bass (and I hear every little movement or breath as a big boom) while Jeff's is always quiet but clear.\n\nI find myself constantly adjusting the volume depending on who is talking.\n\nAlso, it'd be great if a voribs .oga file of the podcast was offered so I can play it in my browser without a plug-in."}, {"author_name": "Michael Haren", "gravatar_hash": "f4f4b5a6f27f72b32d42463b1a25e0df", "author_url": "http://blog.wassupy.com", "date": "Aug 18, 2011", "message": "Could you go into more detail as to why you need this daunting setup? \n\nI can infer what the issues were but it still seems crazy that you have a budget for all that gear and yet there isn't a turnkey solution you can buy that makes all this easier for you.\n\nThank you for sharing, though, and I have pretty much always enjoyed the quality so keep up the good work :)"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Aug 19, 2011", "message": "&gt;Joel’s audio is always really loud with lots of bass\n\nWell he is the boss. On the next podcast he also has the Darth Vader effect when he explains how he will crush the rebel hyphen site."}, {"author_name": "Good Burger", "gravatar_hash": "fa3c01f8942317b0494adccc66f785ba", "author_url": null, "date": "Aug 19, 2011", "message": "That setup is sik! Makes me wanna build my own podcast mini-studio."}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Sep 04, 2011", "message": "I've been pricing out your components and I've gotten sticker shock - I'm already up to $8,000 and that doesn't include the Mac Pro, the Dell, the microphone stand, boom, shock mount, pop filter, or any of Joel's computer setup. I'm sure there's a good reason for selecting the components you did, and I'm curious about the reasons.\n\nMy primary shock came when pricing out the mixer - $2400 for the 01v96 and another $420 for the MY8-DA96. Since you mentioned that you would have at most six participants (2-3 in studio, 2-3 remote) why not get the Mackie Onyx 1640i with 6 aux sends for $1500? It has Firewire, too, removing the need to use a Focusrite to get the audio into the recording computer, saving another $300.\n\nI will admit, I don't fully understand the reason for some of the equipment. The MY8-DA96, for example - what does this hook to? Skimming over the list of equipment I don't see anything else with a 25-pin connector."}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Sep 13, 2011", "message": "Sorry, disregard that last paragraph I figured it out - the 25-pin connector splits into lots of 1/4\" jacks"}, {"author_name": "Piotr Dobrogost", "gravatar_hash": "b12f7c10f72b7ac3daaa98f0a3bc0718", "author_url": null, "date": "Apr 05, 2012", "message": "Kyle asked very good questions here and it's pity they haven't been answered :("}]}