{"response": [{"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Jun 27, 2010", "message": "Keep up the good work you're doing on Area 51.\n\nAny ideas when the first beta will roll out..?\n\n:)"}, {"author_name": "Bruce", "gravatar_hash": "fa77808af6252bd44a8924e902e96c71", "author_url": null, "date": "Jun 28, 2010", "message": "If you've learned to trust the community, how about re-opening the apocalyptic defense proposal?\n\nOh right, because \"trusting the community\" is just something you pretend to do and have no intention of actually following through on your claims. Right. I forget that sometimes."}, {"author_name": "FarmBoy", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Jun 28, 2010", "message": "Bruce,\n\nGet over yourself.  We should all be thankful that the SO and SE teams apply good judgment in those cases where the community is going astray.\n\nIf you are aware of an internet community that is both more useful and more community driven than this one, I'd like to know."}, {"author_name": "Scott", "gravatar_hash": "6285ff8f79ce11a5c9161011137258bc", "author_url": null, "date": "Jun 28, 2010", "message": "Ha, I thought this post sounded familiar...then I remembered the draft appeared in my Google Reader feed.\n\nI'm really excited to see the first betas. It seems like the top proposals have been a bit static with the committal for a while - e.g. Web Apps on 90%, Pro Webmasters on 75%."}, {"author_name": "Bruce", "gravatar_hash": "fa77808af6252bd44a8924e902e96c71", "author_url": null, "date": "Jun 28, 2010", "message": "\"those cases where the community is going astray.\" - FarmBoy\n\n\"Learn to trust the community.\" - Robert\n\nI let these quotes speak for themselves. I have nothing more to add."}, {"author_name": "FarmBoy", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Jun 28, 2010", "message": "Trusting the community needn't imply that the community is infallible or ultimately sovereign.\n\nBut you know this.  You aren't arguing honestly, Bruce.  You are a scoffer."}, {"author_name": "Skilldrick", "gravatar_hash": "2b0a93dc132be4bf3b15b50c8a7e8089", "author_url": "http://www.skilldrick.co.uk", "date": "Jun 28, 2010", "message": "I think Stack Exchange will start with a techie bias, just as Stack Overflow started with a .net bias. Even though SO still has that bias, it isn't dominated by it. I think SE will likely follow a similar trajectory, as it gets discovered through Google rather than through Stack Overflow."}, {"author_name": "Bruce", "gravatar_hash": "fa77808af6252bd44a8924e902e96c71", "author_url": null, "date": "Jun 28, 2010", "message": "Likewise, a moderator is not infallible nor should he be the ultimate sovereign. This is more about the open statement that Robert trusts the community while simultaneously doing the opposite. Actions speak louder than words, my dear FarmBoy."}, {"author_name": "FarmBoy", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Jun 28, 2010", "message": "I'm thankful for a sovereign moderator that trusts the community in 99% of the cases, while making an exception for such foolishness as the the apocalyptic defense proposal.\n\nThe words and actions seem consistent to me.  I'll again comment that if you are aware of an internet community that is both more useful and more community driven than this one, I’d like to know."}, {"author_name": "Bruce", "gravatar_hash": "fa77808af6252bd44a8924e902e96c71", "author_url": null, "date": "Jun 28, 2010", "message": "FarmBoy, ever visited a wiki dedicated to a game or topic you enjoy? In many cases the creators abandon the sites and yet the community remains, adding content and removing vandalism without and need for heavy-handed removals or bannings."}, {"author_name": "FarmBoy", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Jun 28, 2010", "message": "Umm . . . the general horribleness of such sites is the very reason for SO staggering success.  So yes."}, {"author_name": "Bruce", "gravatar_hash": "fa77808af6252bd44a8924e902e96c71", "author_url": null, "date": "Jun 28, 2010", "message": "I use that kind of site on a regular basis. Sometimes daily, but at least weekly when I want to look something up from whatever game I'm playing. I've always been able to find what I want quickly and easily. So when you claim they are in a state of \"general horribleness\" I'm going to have to ask you to elaborate."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Jun 28, 2010", "message": "@Bruce: I love how you said you had nothing more to add 3 comments ago. Anyway, I think you'll find that quite a large part of the StackExchange community agrees with the closing of that proposal.\n\nSo in short, get over yourself. There's a big difference between trusting the community and \"allowing any arbitrary subset of the community do anything they like with your blessing\"."}, {"author_name": "Bruce", "gravatar_hash": "fa77808af6252bd44a8924e902e96c71", "author_url": null, "date": "Jun 28, 2010", "message": "So you're fine with \"trusting the community until they do something I don't like\", then? That's not trusting the community at all. If the community is trusted, it should be given the tools required to manage itself and then be left alone. Anything less than that is not trust by definition."}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": null, "date": "Jun 28, 2010", "message": "I would really be interested in seeing what the community does with the Apocalypse Defense proposal.  There is the idea that most users think its silly, but it has a group of supporters, and people who would commit to it.  It would have probably reached the critical mass that any other proposal would need to qualify, if not for the intervention.\n\nAll I would ask is to give it a shot. Then base the policy off of the success or failure of this questionable type of proposal.  It could be beneficial publicity and traffic wise.\n\nWe all kinda dislike that fun \"subjective\" questions generate a lot of interest, but it speaks to our nature as humans.  I'd say tap this potential, instead of squashing it.  At least as a trial"}, {"author_name": "Robert Cartaino", "gravatar_hash": "9dfd656461a1d0a2db33f3ed4183f4c0", "author_url": "http://stackoverflow.com/users/98786/robert-cartaino", "date": "Jun 29, 2010", "message": "Let's be honest: Apocalyptic Defense was a humorous proposal. Even if you <em>believed </em>the proposal was made in earnest, it wasn't treated that way: http://meta.stackoverflow.com/questions/53811/why-was-apocalyptic-defense-closed/53882#53882. That leaves us with one giant broken window, creating a tendency for a long stream of joke proposals to follow. And most people are not funny.\n\nHa, ha, someone hijacked the process with their version of getting Hank the Angry Drunken Dwarf elected to \"People's Fifty Most Beautiful\" contest. So, how would you <em>like </em>us to respond? \n\nhttp://www.ding.net/hank/\n\nWe can either (1) replace the public proposal system with a private submission/approval process where we must review EVERYTHING before it goes through... or (2), we can add a Moderator/\"human exception handler\" to deal with the 0.01% of people whose motivation is to show contempt. We chose to do the latter."}, {"author_name": "Tony", "gravatar_hash": "886427a445a180eb6618d77ee4ec4894", "author_url": null, "date": "Jun 29, 2010", "message": "The SE sites will need better discoverability and marketing. Very few people knew the older ones. The new method of choosing what sites go up is OK but it doesn't change the fact that if very few people know about them, these sites will also eventually linger and rut. \n\nMaybe you can use a chunk of that $7 million to tell the world about the sites."}, {"author_name": "Bruce", "gravatar_hash": "7812f3e4826c1192fde80e2f7858fe76", "author_url": null, "date": "Jun 29, 2010", "message": "Or you could just do it like Time did it when moot was voted one of the most influential people: man up and admit your community knows itself better than you do."}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": null, "date": "Jun 30, 2010", "message": "Robert said: \"people whose motivation is to show contempt.\"  \n\nIt not necessarily about people who are holding the system in contempt.  I believe the message that is coming across here is about fun vs work.  The direction SE is heading in is to do 'work', something that isn't meant for entertainment, but to provide a useful, practical service.  The whole idea isn't being meant to support 'Fun'.  And thats ok."}, {"author_name": "Ward", "gravatar_hash": "f347c53c9cb1ddcb816daeb22aaf89c8", "author_url": null, "date": "Jun 30, 2010", "message": "I think what it comes down to is that SO and SE are almost completely serious.  They have a very limited tolerance for humor, and it pretty much has to be \"approved\" humor, like the unicorns.  Apocalyptic Defense never got any official buy-in, so it didn't last.  A humorous proposal that happens to appeal to Jeff or Joel or whoever might be allowed to go forward."}, {"author_name": "Bruce", "gravatar_hash": "85ad295c1acd3306b4b3a2d107221f13", "author_url": null, "date": "Jun 30, 2010", "message": "If the community is to be trusted, the level of seriousness tolerated on the site shouldn't be up to Jeff or Joel or any individual whatsoever. What about \"trusting the community\" is so difficult for you people to understand?"}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Jul 01, 2010", "message": "Bruce,\n\nYou seem to think that trust and authority can't coexist.  My boss trusts me, and he allows me great freedom in how I accomplish my work.  But if I take a crap on his desk, he would fire me.\n\nDoes that mean he doesn't trust me?\n\nYou are thinking in binary, as if anything that isn't unquestioning, absolute trust is not trust at all.  But we all experience various degrees of trust, none of which are invalidated by their limitations.\n\nOr perhaps you think that \"trusting the community\" necessarily implies that the community is the authority.  But trust has never meant that.  In any case, it seems that you are the only one here having difficulty with the concept of trusting the community."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jul 01, 2010", "message": "@Robert,\n\nThere is an inconsistency between the stance that some proposals aren't serious and SO.com's use of aliens and area51 as a public facing site. \n\nNote also the hijacking of SO with unicorns for a day.\n\nInconsistent."}, {"author_name": "FarmBoy", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Jul 01, 2010", "message": "\"They are like children sitting in the marketplace and calling to one another, saying: 'We played the flute for you, And you did not dance; We mourned to you, And you did not weep.'\"\n\nRobert, thanks for a good answer.  And thanks for your work.  I believe that the SO/SE team is making the Internet a better place.\n\nPlease do me one favor.  When Tim and Bruce finish building their Internet-changing web applications, please visit their blogs and pester them with petty perceived inconsistencies."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jul 02, 2010", "message": "@FanBoy\n\n\"Please do me one favor. When Tim and Bruce finish building their Internet-changing web applications, please visit their blogs and pester them with petty perceived inconsistencies.\"\n\nI have no interest in writing internets applications.  Especially one whose value is solely dependent on the content form other people.  I will be the first to say Jeff and Joel and company did a great job, but, as you note, I do find inconsistencies and point them out.  If you choose to mock me for that then it is your right.  \n\nI never claimed the Armageddon site should live - I just find it amusing that one reason it is discarded is that it is not serious - yet the unicorns and area 51 theme are proudly put in front of the public... \n\nYou don;t find that inconsistent?"}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Jul 05, 2010", "message": "tim,\n\nYou have the right to point out inconsistencies, but it would be more useful if you had a point.  Otherwise, the verse above captures your heart perfectly.\n\nAs for whether I see it as inconsistent, I would say that having an entire QA site dedicated to a joke-topic is a bit different than, say, having a unicorn theme for a day, or having a whimsical them for the staging area that might as well be a private site.  (In that if you are not already particularly interested in SO/SE, you will never find that site.)\n\nI see why you call me FanBoy, but I'm more of a curmudgeon here.  I get cranky with the anti-authority attitude that is displayed by various participants whenever the team makes a decision."}, {"author_name": "Peter Boughton", "gravatar_hash": "e915239e11bb00291ce4e4b17b83bc66", "author_url": "http://www.sorcerers-isle.net", "date": "Jul 05, 2010", "message": "How can I get NON-DAILY updates for proposals I'm interest in?\n\nI want to know what's happening, but the daily trickle of \"X more users\" is annoying.\n\nWhy isn't there a preference for daily/weekly/monthly updates?"}]}