{"response": [{"author_name": "gnovice", "gravatar_hash": "f10d46954aba4a7207ea3ba66d4e6f86", "author_url": null, "date": "Jun 24, 2010", "message": "Have you considered virtual conferences? The MathWorks did one last year, and it was pretty cool. They've got another one slated for the fall. They use Unisfair (http://www.unisfair.com/).\n\nIt's no replacement for direct interaction with other humans (and their ponies), but maybe it could tide people over until the spring. ;)"}, {"author_name": "Joel Spolsky", "gravatar_hash": "95e6837f350869bfb44e069a98885c58", "author_url": "http://stackoverflow.com", "date": "Jun 24, 2010", "message": "Ugh, no. I participated in a virtual conference recently, it had 21 people there and was a complete waste of time for just about everyone involved. We already have much better ways to communicate on the internet than sitting down for a day watching a low quality video stream. DevDays are about ways to communicate face to face."}, {"author_name": "Arnold Zokas", "gravatar_hash": "625642719449cabc1d84b5e05918325a", "author_url": null, "date": "Jun 24, 2010", "message": "Two-day conference sounds good. If you do that, please provide an option to pay for individual days for people who can't take 2 days off work. :-)\n\nConsidering this was a new conference, things worked out rather well (at least in London, anyway). Thanks for all your hard work. I look forward to attending the next one."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack-peterson", "date": "Jun 24, 2010", "message": "So, the DevDays bus isn't stopping in Des Moines. :("}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Jun 24, 2010", "message": "If you're going to do the east coast, can you do a centralized east coast run? Maybe Northern Virginia/Washington DC (4 hours from NYC, 5 hours from the Research Triangle area of North Carolina (--Where many game companies and software companies are based), and it has three major airports for anyone that wants to fly in."}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": null, "date": "Jun 24, 2010", "message": "I agree that $100 is dirt cheap. But there is one thing I ask you to keep in mind for next DevDays: keep it accessible. The last one was very accessible because it was only $100 and only one day - easy to get time off work for that, and easy to pay for. Please don't make it prohibitively expensive like all those other of conferences with 4-digit prices. Please don't make me pay for three days if I only want one (I'm looking at you, NDC!). And please, please don't make me purchase a ticket in advance - I don't normally know where I'll be next week, how can I book a ticket two months in advance?"}, {"author_name": "Lars Mæhlum", "gravatar_hash": "1d8ca7f9b479faa20672e5152144d951", "author_url": null, "date": "Jun 24, 2010", "message": "Why not combine the 2011 European tour with NDC 2011?\nI would love to see you guys there with a 3 day stand and a couple of talks.\nMaybe something about building an awesome, community driven site perhaps?"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jun 24, 2010", "message": "It was successful because it was priced at a 'just do it'  level and one day means I can beg a day off and have no hotel bill.\nIf it's going to be $x000 corporate level and 3days of time off and hotels then it needs to be more than some fun and a fogbugz sales pitch for me to get that approved."}, {"author_name": "Raj More", "gravatar_hash": "3508265a1d14b20293d7b19c8af83298", "author_url": null, "date": "Jun 24, 2010", "message": "I can help with setting it up. I'm sure I will learn a lot in the process."}, {"author_name": "Kibbee", "gravatar_hash": "2b568071163c0d009635cfa63cf6e6ac", "author_url": "http://www.kibbee.ca", "date": "Jun 24, 2010", "message": "I agree with many of the others.  Once you get to the point where you have to pay for a hotel, plane ticket, plus even more expensive ticket, and meals while you are travelling, you're probably going to be spending $1000, and that's assuming the price of admission is $500.  That makes it inaccessible to a lot of people.  Lucky you if you happen to live in one of the host cities, but for everyone else, probably not worth it unless you can get your employer to pay."}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": "http://echoreply.us/tech/", "date": "Jun 24, 2010", "message": "It would be nice (maybe next year) to see a spot in Asia."}, {"author_name": "Michael Todd", "gravatar_hash": "d819a10cdc6dacc185f02f4e2c1e3498", "author_url": "http://www.ccrfcd.org", "date": "Jun 24, 2010", "message": "I'm definitely there if it comes to Vegas."}, {"author_name": "Cory", "gravatar_hash": "0ecba8fe683c89e1e1dd6470d7f02575", "author_url": "http://www.corytaylor.ca", "date": "Jun 24, 2010", "message": "Try not to leave out Canada! I really enjoyed attending DevDays in Toronto last year, hope I can attend again this year."}, {"author_name": "Paul Nathan", "gravatar_hash": "fc3225dc3119500fcbf7af646a83c914", "author_url": null, "date": "Jun 24, 2010", "message": "There's a big  physical distance on the West Coast. If I lived in LA, I wouldn't go to Seattle, and vice versa. \n\nI'd be able to do a 'reasonably cheap' dev days in Seattle, Spokane WA, Portland, OR or Boise ID. (one day drive, or a weekend trip).\n\nPlease consider the levels of hassle your attendees would have to go through and tune appropriately for most of us. :)"}, {"author_name": "Bob", "gravatar_hash": "6dc4b57fcb20324a36ca10fbe92dbf7e", "author_url": null, "date": "Jun 24, 2010", "message": "How about keeping it local with all 30 sites? You could make a little stackoverflow site where people need to propose speakers. Then everyone could upvote/downvote to determine which speakers want to come.\n\nBy leveraging the community and delegating, we can have the devDays in just as many cities as last time...."}, {"author_name": "Leonardo Cortez", "gravatar_hash": "6328b2c01f9a31d88bb008200e47449a", "author_url": null, "date": "Jun 24, 2010", "message": "I'm very glad to see Australia being considered as one of the possible locations for the next round of DevDays. And I also think that although the $100 admission was an amazing deal, it was too cheap to be sustainable. Hopefully a compromised will be reached so the program will continue on a regular basis."}, {"author_name": "Mark", "gravatar_hash": "3fe1ab2f3897d8e3931c5b297c29e994", "author_url": "http://www.markness.net/", "date": "Jun 24, 2010", "message": "Super glad to see DevDays may be heading down under as well. When I first signed up with my employer 3 years ago he promised he would send me to the occasional conference/dev day style thing but it hasn't happened to date. This could be my first ;)\n\nI know the director of an events management company if you do decide to head down under, I'd be happy to put the two of you in contact."}, {"author_name": "beggs", "gravatar_hash": "5bbfbef049a7145351f7212f7b7a1dfb", "author_url": "http://confusion.cc", "date": "Jun 24, 2010", "message": "You should have the APAC conference in Singapore.  I can get help setting it up for you I know some good conference organizers."}, {"author_name": "didxga", "gravatar_hash": "b88052694be62101cd64a8167d057823", "author_url": null, "date": "Jun 24, 2010", "message": "It would be great if the conference will be hold in Chengdu China one day!"}, {"author_name": "Jason", "gravatar_hash": "8170deb73d6e2169e227aa588a0b32b8", "author_url": null, "date": "Jun 25, 2010", "message": "I understand the logistical headaches of repeating last year's format, but PLEASE PLEASE PLEASE do not just do East and West coast.  At a minimum throw in a middle-of-the-country location for the great unwashed masses.  Austin is a great tech hub that is centrally located between the two coasts."}, {"author_name": "aardvark", "gravatar_hash": "ceebf6fd6d0828379c6f8bc98d8a0778", "author_url": "http://www.brucealderman.info/harmful/", "date": "Jun 25, 2010", "message": "Can you clarify, please? Will the Kansas City Dev Days be the \"East Coast\" or the \"West Coast\" stop? Or are we getting passed over again?"}, {"author_name": "alex", "gravatar_hash": "e96a421d76c1fc107a5d291c6999b2ef", "author_url": "http://www.alexanderdickson.com", "date": "Jun 27, 2010", "message": "Coming to Australia?\n\nOh boy oh boy!\n\nCaptcha: less flowery"}, {"author_name": "scunliffe", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Jun 29, 2010", "message": "similar to @configurator, @Cory, @mgb, I was at the Toronto show and I enjoyed the accessible price point.  I'm fine with bringing it up to cover costs and all that jazz... And even doing the 1 west coast, 1east coast thing.\n\nAs\n For location, I can probably swing the 10hour drive to NYC, but an FLA location is gonna break the budget.\n\nRegardless, I'm looking forward to it!"}, {"author_name": "Michael Greenspan", "gravatar_hash": "52bcab1a8d0b06d7b3da9a815980e68f", "author_url": null, "date": "Aug 30, 2010", "message": "Toronto was great - please don't leave out Canada."}, {"author_name": "Michelle", "gravatar_hash": "14bc1562a8c8a7587bef96cc558a9e38", "author_url": null, "date": "Sep 09, 2010", "message": "Please don't abandon a successful business model; one day, many regional events and inexpensive.  I would have paid $200 - $250 for last year's Toronto event.  Provide your requirements to a local company to co-host and do the planning.  Bring along a core of speakers, and supplement with the most interesting local speakers."}, {"author_name": "Benny", "gravatar_hash": "ee98cccb68318cf0ec167c05fd3ace7e", "author_url": null, "date": "Mar 05, 2011", "message": "Maybe in Melbourne, Australia?"}, {"author_name": "MadMurf", "gravatar_hash": "66dd88f90fe78bb543e8bdc0fa0e0714", "author_url": null, "date": "Apr 03, 2011", "message": "And it begins... when you say one big city you'll be opening a can of worms in Australia... I'd vote for Sydney but I'm biased... hopefully Sam Saffron will have some say int.........."}]}