{"response": [{"author_name": "Kev", "gravatar_hash": "a9840656ceee0faa528806c4c04a9399", "author_url": null, "date": "Jun 08, 2010", "message": "In http://stackoverflow.com/legal/trademark-guidance under the section \"Design of Your Product\" you state:\n\n\"Do not copy the look and feel of our products.\"\n\nTo what extent does that apply? \n\nThere's a fair few clones out there looking remarkably like the SO/SE UI (shapado.com for example).\n\nWill you be applying pressure to the clones or does this only apply to apps built using the upcoming SO API?"}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": "http://stackoverflow.com/users/20654/oscar-reyes", "date": "Jun 08, 2010", "message": "I have always thought that legalese is a sort of ( procedural ) programming language in the sense it is written to be unambiguous, although they use some wildcards: \n\n\n*..including but not limited...* \n\nProbably a formal language for law would be more effective, then you'll use a compiler ( parser ) to see if you infringe the agreement. \n\nOn a second thought, I guess at the end it would look like C++, ( and there would be obfuscation contest also )  so.. nevermind."}, {"author_name": "Martin", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Jun 08, 2010", "message": "Legalese or not - no one will ever read them."}, {"author_name": "Portman", "gravatar_hash": "57dcebe24f9d0359c214d21c8844c849", "author_url": "http://www.portmanwills.com", "date": "Jun 08, 2010", "message": "Jeff,\n\nIf you like and recommend the attorney who helped you draft your ToS and Privacy Policy, you should give him or her a shoutout in this blog post.\n\nI know *TONS* of entrepreneurs and small business owners who are actively seeking a firm to help them craft these kinds of documents. Having worked with several  major firms, I can confirm that a lot of them don't \"get\" consumer websites, and spew out excessive  legalese when you ask for a simple ToS.\n\nThese Stack Overflow docs are terse but clear, and I think it would be great if you could help other people bring the same level of awesomeness to their legal docs."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 08, 2010", "message": "There's one oddity worth mentioning:\n\n\"As a name, Stack Overflow, is always written \"Stack Overflow\" (two words, capital letters).\"\n\n... except in the logo, where it's a single word with no capitals. Yes, I know it's a logo... but it's still probably the place the name is most commonly seen.\n\nI'm not actually suggesting anything, in terms of either changing the document or the logo... just pointing out an odd situation."}, {"author_name": "Joel Spolsky", "gravatar_hash": "d95216e70bed7430716b91ddd6df55fe", "author_url": "http://stackoverflow.com", "date": "Jun 08, 2010", "message": "@Portman, lawyers never write that kind of stuff. You have to write it yourself and then get your lawyer to edit it."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 10, 2010", "message": "@Jon \n\n\"except in the logo, where it’s a single word with no capitals.\"\n\nstackoverflow.com is the correct derivation from the logo, though. (And seriously, who puts \"dot-cawm\" in their logo these days?)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jun 10, 2010", "message": "@Jeff: But should the logo represent the name of the site or the URL? My point is that it wouldn't be unreasonable for people to assume that the name of the site would be shown in the logo... hence the confusion which has reigned in the past. (Don't get me wrong - I'm very grateful for the clarification provided in this document.)\n\nAs far as I can see, the \"Stack Overflow\" form is only present in the home page as the title element - whereas the prominent logo would suggest that it's called \"stackoverflow\"."}, {"author_name": "Zakaria", "gravatar_hash": "1e5fda1286b576396465d145426e701b", "author_url": "http://tukangprogram.com", "date": "Jun 23, 2010", "message": "Man, you miss the ALL CAPS section. :-)"}]}