{"response": [{"author_name": "Lasse V. Karlsen", "gravatar_hash": "1b11262da6d1cd26b1b0bc99a2620cee", "author_url": "http://www.vkarlsen.no", "date": "Jun 10, 2010", "message": "Suggestion. Wouldn't it be possible to prevent deletion of a question once it has more than a threshold of upvoted answers (even 1 upvote would be enough to make an answer count) and/or a threshold of upvotes on itself?\n\nThus, instead of being able to delete the question, you're forcing the person(s) that want to delete it to flag it instead.\n\nDon't know if this would solve anything, or just shift problems elsewhere, but looking over the examples people are asking why were deleted it seems there is a uniform pattern here, that the question has enough upvotes to suggest there's at least something interesting here, or enough voted-on answers that at least someone took their time answering the question.\n\nEither could suggest you're not allowed to just plain delete it, but instead need the help of a moderator, even for actually deleting it, or merging it."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 10, 2010", "message": "@Lasse isn't that what we already implemented, as I mentioned at the top of the blog post?\n\nhttp://meta.stackoverflow.com/questions/50523/should-delete-votes-be-limited-like-close-votes\n\n(and remember, the question must be CLOSED first to even be eligible for any deletion votes)"}, {"author_name": "Jonathan Sampson", "gravatar_hash": "3eada417ab749e3a7a5d51d451b2cc3a", "author_url": "http://sampsonresume.com", "date": "Jun 10, 2010", "message": "Nice addition. Just this morning I discovered this by accident, but was immediately satisfied with the difference in behavior. Great work, and I think this will really be appreciated by those googlers who at times stumble onto the site to get a \"question not found\" page."}, {"author_name": "Justin Nelson", "gravatar_hash": "d787caaf04b85641692a24099fcee990", "author_url": null, "date": "Jun 10, 2010", "message": "Awesome.  I'm glad that you are taking an anti-deletion stand.\n\nAlso, I'd like to petition for a 20k user to gain the ability to merge questions."}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Jun 10, 2010", "message": "Are you sure comments on the source question should be merged across? In my experience comments directly on the question are usually very specific to the question and since SO 'exact duplicates' are very rarely actually exact duplicates, the comments won't make much sense moved to another."}, {"author_name": "Maxim Z.", "gravatar_hash": "de9ed68c2a16bee84feff09f6df58b47", "author_url": null, "date": "Jun 10, 2010", "message": "How will merging be reflected by the API?"}, {"author_name": "Andomar", "gravatar_hash": "1bb61f439a7246fc13034562deb9737f", "author_url": null, "date": "Jun 10, 2010", "message": "In addition to what Lasse says, perhaps questions that were reopened once should require a moderator to delete.  After all, if five 10k people vote to reopen a question, it's hard to say that no reasonable person would find the information useful."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Jun 11, 2010", "message": "u62,\n\nWe usually do a quick scan of the comments to see if they're going to remain relevant once migrated.  You're right, we usually end up deleting a lot of them."}, {"author_name": "Aaron", "gravatar_hash": "4784644a7b852ad6458f0e6e93abb77c", "author_url": "http://nelaaro.blogger.com", "date": "Mar 08, 2011", "message": "http://meta.stackoverflow.com/questions/52530/are-duplicates-creating-broken-windows/82168#82168\n\nMy answer to your original broken windows question."}]}