{"response": [{"author_name": "Arjan", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "Jun 19, 2010", "message": "Given that nice button to award the bounty, I can see one feature request coming: split bounties to multiple answers. ;-)\n\n(But a workaround for that: just add another bounty after rewarding the first. Very nice improvements!)"}, {"author_name": "Pekka", "gravatar_hash": "628d6cb4c2ad9d7b38a62f76a3bb7651", "author_url": null, "date": "Jun 19, 2010", "message": "This is freaking brilliant! This is a huge improvement and will bring life into the bounty system, also enabling people to give a \"push\" to other people's questions they need answered themselves. Great stuff!"}, {"author_name": "VonC", "gravatar_hash": "4fc12eea3fb81ede59d064d0fdbb84ab", "author_url": "http://stackoverflow.com/users/6309/vonc", "date": "Jun 19, 2010", "message": "This is great! A lot was already done to improve from the original bounty system (http://blog.stackoverflow.com/2009/01/reputation-bounty-for-unanswered-questions/), but this brings it to a all new level. \n\nThank you to Robert Cartaino for your suggestion (which I have marked as \"accepted\" in http://meta.stackoverflow.com/questions/1413/why-an-answer-cant-be-accepted-after-an-unresolved-bounty/49224#49224), and thank you SO team for making it a reality."}, {"author_name": "Pekka", "gravatar_hash": "628d6cb4c2ad9d7b38a62f76a3bb7651", "author_url": null, "date": "Jun 19, 2010", "message": "I am *so* going bounty shopping in the next few days. Anybody need a bounty on a question in the php/html/css/javascript/jquery tags? It has to be a very good and deep question."}, {"author_name": "ChrisF", "gravatar_hash": "ee006a67bbbb535dc04afc6a03b1843f", "author_url": null, "date": "Jun 19, 2010", "message": "While this is probably a positive change, it still leaves the problem of *new* users wanting a solution to an existing question. At the moment their only options are:\n\na) Answer the question with a \"me too\" answer\n\nb) Ask the question again.\n\nBoth approaches are likely to get them downvoted and possibly snide comments, which will leave them unwilling to return.\n\nHas any thought been put into how to solve this problem?"}, {"author_name": "paxdiablo", "gravatar_hash": "a6e7ad8582ac390cd668b2b0d6b3058c", "author_url": null, "date": "Jun 19, 2010", "message": "I'm curious as to whether a bounty award pushes the answer up the list in any way. In the old system, a bounty award was tied to an accept which automatically made the answer top of the pile. Does a bounty award still do something like this or is it tied solely to votes (and accepatance) now?"}, {"author_name": "Oliver Giesen", "gravatar_hash": "13c44ef2d9d79dcca761a584be868def", "author_url": "http://ogware.wordpress.com", "date": "Jun 19, 2010", "message": "Great job! This sounds 99% optimal!\n\nHowever, I think auto-awarded answers should be visually distinct from manually awarded answers. I'm not even sure whether the auto-awarded answers should be displayed as such (except to the bounty owner). \n\nAlso, with the bounty being paid upfront, is there really a need for auto-awarding answers at all?"}, {"author_name": "detly", "gravatar_hash": "d04ab2422a8f061608f58708de9bb138", "author_url": null, "date": "Jun 19, 2010", "message": "They're great changes, but the \"2 upvote\" threshold for auto accepting is a bit low. I have a question that I'd love to start a bounty on, since none of the current answers actually help. Trouble is, a couple of the answers have... one upvote! Why!? They don't work and there's no elaboration on how they might. Yet were I to issue a bounty, they'd be one vote away from getting it!\n\nSo the question has no answer, but I'm not really willing to part with a slice of rep only to see it go to a response that's not actually useful. (Don't get me wrong, I appreciate the effort, but... if something doesn't work, then it just doesn't).\n\nSo the question remains in unanswered limbo, which was one of the problems the bounty system was meant to solve (I think).\n\n(The question: http://stackoverflow.com/questions/2718590/free-static-checker-for-c99-code )"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Jun 19, 2010", "message": "While you're overhauling the bounty system, might I suggest you take a look at this old feature request: http://meta.stackoverflow.com/questions/7753/please-give-us-the-ability-to-sort-featured-tab-by-bounty-amount  :)"}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": "http://careers.stackoverflow.com/kyle", "date": "Jun 19, 2010", "message": "@delty\n\nOnly answers submitted after the bounty is started (with a score of at least 2) are elegible for auto-acceptance."}, {"author_name": "detly", "gravatar_hash": "d04ab2422a8f061608f58708de9bb138", "author_url": null, "date": "Jun 19, 2010", "message": "Ah... Possibly should've read that :)"}, {"author_name": "benson margulies", "gravatar_hash": "e6eeaf8698180e971e169a925d8e0f4f", "author_url": null, "date": "Jun 19, 2010", "message": "Now we know how to help area51 proposals get through committed. Dump some rep onto committed persons."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 19, 2010", "message": "> I’m curious as to whether a bounty award pushes the answer up the list in any way.\n\nNo, but starting a bounty does bump a question to the homepage.\n\n> I have a question that I’d love to start a bounty on, since none of the current answers actually help. \n\nThat's fine, since auto-accept is only valid for <b>answers added after the bounty starts with +2 or more score</b>\n\n> it still leaves the problem of *new* users wanting a solution to an existing question\n\nPer http://stackoverflow.com/faq#bounty\n\n\"In order to get good answers, you have to put some effort into the question. Edit your question to provide status and progress updates. Document your own continued efforts to answer your question. This will naturally bump your question and get more people interested in it.\""}, {"author_name": "weinzierl", "gravatar_hash": "b97599f860cfcaa4c31f7fc78096a857", "author_url": "http://weinzierl.name", "date": "Jun 19, 2010", "message": "I already like the new system.\nI always wanted a way to say \"Thank You!\" to users that go out of their way to answer a question.\nSometimes you just can't accept an elaborate and correct answer because there is an even better one.\n\nWith the old system I really wouldn't know what to do with:\n\nhttp://stackoverflow.com/questions/3032951/how-to-calculate-2n-1-efficiently-without-overflow/3033004#3033004"}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Jun 19, 2010", "message": "Sounds great - now we'll see 50 rep bounties! (Maybe that's not so great...)\n\nWhy can we only have one open bounty per user? Seems like a weird restriction."}, {"author_name": "marco.ragogna", "gravatar_hash": "b152453e24627505b5889e888585e55f", "author_url": null, "date": "Jun 20, 2010", "message": "I did some questions in the past that has been auto-accepted without a \"real\" answer.\n\nThe new modifications are really welcome!\n\nIt is also nice that we can put bounty on not owned questions"}, {"author_name": "fpr", "gravatar_hash": "04340820248172adffeacedb541711f9", "author_url": null, "date": "Jun 20, 2010", "message": "\"all bounties are completely independent of and unrelated to accepting an answer\"\n\nGreat.\n\nI have just answered a question with a bounty, OP did accept it but didn't awarded this bounty, propably because he didn't know that he should do it separately.\n\nIf I don't get 2 up votes by the time bounty expires, I won't get even half of extra points.\n\nThat sucks!"}, {"author_name": "dboarman", "gravatar_hash": "0c5a5aa70c6436d498bd65ff828d4fb0", "author_url": null, "date": "Jun 20, 2010", "message": "Absolutely great work. Proves that our voices are heard (not that I doubted in the first place)."}, {"author_name": "ChrisF", "gravatar_hash": "ee006a67bbbb535dc04afc6a03b1843f", "author_url": null, "date": "Jun 20, 2010", "message": "Jeff,\n\nI wasn't talking about new users wanting to bump their own question but *someone else's*.\n\nSee http://meta.stackoverflow.com/questions/54329/what-can-we-do-for-new-users-who-want-to-ask-a-question-thats-already-been-asked"}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Jun 20, 2010", "message": "@detly - The bounty system is best thought of as an incentive, or a payment to \"feature\" your question.  It is no guarantee that it'll work.\n\nThat becomes even more true now that we can post repeat bounties to the same question.\n\nI've placed a 500 rep bounty on your question, and you can see if it brings the needed attention to it over the next week or not.\n\ncaptcha says, \"dinky that\"\n\nIndeed, Mr. Captcha, indeed."}, {"author_name": "detly", "gravatar_hash": "d04ab2422a8f061608f58708de9bb138", "author_url": null, "date": "Jun 20, 2010", "message": "Adam, I saw that, thanks :)\n\nIt's economics, really. My rep is &lt; 1k, so if I&#039;m going to slice off 100 or so for a bounty, I want to be reasonably sure I&#039;ll at least get a good lead out of it. I&#039;m not concerned so much about accumulating reputation, but simply my ability to offer other bounties later.\n\nWhether or not the auto-accept mechanism works on new questions is irrelevant - the fact is, it&#039;s not hard for a not-so-useful answer to get enough votes to put it over the edge, before or after the bounty starts. That a couple of questions are almost there already just illustrates that future questions might get there too (coupled with the extra attention and bumping that a bounty entails, it&#039;s probably even more likely).\n\nIf I had 10^23 rep, I&#039;d fling it around like nobody&#039;s business and this wouldn&#039;t worry me at all. But I don&#039;t, so it does.\n\nBut don&#039;t get me wrong, this is a minor gripe with a system that works so much better than any other approach that a desperate coder can try :)"}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Jun 21, 2010", "message": "\"If I had 10^23 rep, I'd fling it around like nobody's business and this wouldn't worry me at all. But I don't, so it does.\"\n\nYes, but Jon Skeet already knows everything and doesn't need questions answered."}, {"author_name": "JasonMichael", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": "http://www.jmrtechnet.com", "date": "Jun 21, 2010", "message": "How about making the bounty reward, hard, cold cash $$$."}, {"author_name": "Evan Plaice", "gravatar_hash": "9798931483c6fe5af55ec68698ffd0a0", "author_url": null, "date": "Jun 21, 2010", "message": "These questions were touched on in the post but still need definitive answers:\n\nHow much rep is required to place a bounty on someone else's question?\n\nCan multiple users contribute rep to the same active bounty?"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jun 21, 2010", "message": "Thank you Jeff and team.  This addresses some requests I have been making for a while.\n\nI still don't like the auto-accept, but it sure does fix a lot of broken-ness."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 21, 2010", "message": "@Evan this is all answered in the /faq for each site, if you scroll down to the bounty section, but since you asked:\n\nIt takes 100 rep to start a bounty (minimum bounty is 50 rep) and each question may only have 1 active bounty from 1 user at any given time."}, {"author_name": "detly", "gravatar_hash": "d04ab2422a8f061608f58708de9bb138", "author_url": null, "date": "Jun 21, 2010", "message": "@JasonMichael - I don't know about you, but I find cash quite cosy and warm. You need to sort of pile it up before you try to sleep on it."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 22, 2010", "message": "@tim\n\nWait a second, is that a ... POSITIVE ... comment left by tim? Did I read that correctly? Was there a transcription error in the server? :)"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Jun 22, 2010", "message": "And, Happy Father's Day, Jeff"}, {"author_name": "Evan", "gravatar_hash": "9798931483c6fe5af55ec68698ffd0a0", "author_url": null, "date": "Jun 24, 2010", "message": "@Jeff Thanks, I was just asking the obvious questions because the details were missing from the blog post."}, {"author_name": "Jean", "gravatar_hash": "75da740d43c5780539214f24ce1148a6", "author_url": null, "date": "Jun 24, 2010", "message": "It's good to see the bounty system change, however the change doesn't address the problem of getting no answer at all (not even a useless one) and losing the rep for nothing. See the discussion here for more including exemple questions with 0 answer and a lost bounty. \n\nhttp://meta.stackoverflow.com/questions/21609/should-bounty-be-returned-if-there-is-no-answer-at-all/53700#53700"}, {"author_name": "Jean", "gravatar_hash": "75da740d43c5780539214f24ce1148a6", "author_url": null, "date": "Jun 24, 2010", "message": "(And to be clear, I am not asking for a refund but for something to make it worth the bounty when asking a question with a low probability of getting an answer ... like having the bounty restarted after a month or two using the same reputation points which have not been awarded instead of having them go to waste in /dev/null )"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 02, 2010", "message": "@jean the rep didn't go to /dev/null , the question was featured and got additional attention that a \"normal\" question does *not* get."}, {"author_name": "Nils", "gravatar_hash": "678a1dddd660e81247ab882808be0488", "author_url": null, "date": "Jul 22, 2010", "message": "I like this new system, well done (again)!\nAnyways, I was thinking, why not giving the author of a question some reputation if some places a bounty on that particular question. That way you could not only bring attention to good questions by newcomers, but also grand him some reputation points."}, {"author_name": "Lucas Berger", "gravatar_hash": "7d35cb797bbe338b04f3ca4896fbf9cc", "author_url": null, "date": "Aug 02, 2010", "message": "Though I understand you have \"Bounty awards are no longer tied to accepted answer in any way.\"\n\nI recommend, if there is an outstanding bounty and you have just accepted an answer, to display a color box reminding the user to assign bounty.\n\nThis will help with first time users, as I was using bounty for the first time and thought I was assigning the bounty by accepting an answer.  Unfortunately, the person who got the bounty only got half what I offered."}, {"author_name": "Timwi", "gravatar_hash": "31cc9cb4506590953962068f85e0fa81", "author_url": null, "date": "Aug 10, 2010", "message": "I still don’t understand why I should ever use this bounty system. I don’t see how it increases the visibility of a question significantly; questions just go under in the noise of all the other questions, no matter how they are marked and highlighted. In fact, the more they are marked and highlighted in various ways, the more this marking and highlighting is only distracting and confusing. But back to the bounty system: I feel completely disinclined to ever put a bounty on something if I have no control over what happens to the bounty. If none of the answers answer the question, the bounty always goes to a wrong answer. Why would anyone want to incentivise having wrong-but-popular answers? Finally, I don’t understand why the 24-hour limit. It only makes things unnecessarily harder."}, {"author_name": "Tshepang Lekhonkhobe", "gravatar_hash": "88e60659e997d36af3ff348b3251e1a6", "author_url": "http://tshepang.tumblr.com", "date": "Dec 12, 2010", "message": "The 3rd and 4th links on this post are dead."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 13, 2010", "message": "@tshepang oddly enough those were wrong links this whole time. fixed!"}]}