{"response": [{"author_name": "{b,r}adp", "gravatar_hash": "c81f585328c241594864f888f1154025", "author_url": null, "date": "Dec 04, 2013", "message": "http://chat.meta.stackoverflow.com/transcript/message/203666#203666\n\nYou're welcome :)"}, {"author_name": "Almo", "gravatar_hash": "867c75a2d17ed1f6877aef2e71167dee", "author_url": "http://nestorgames.com/#linkage_detail", "date": "Dec 04, 2013", "message": "Woa. Cool."}, {"author_name": "Soner Gönül", "gravatar_hash": "8348bcf40f55bc5818651824369caff1", "author_url": "http://sonergonul.net/", "date": "Dec 04, 2013", "message": "New design looks nice but how can I see hot questions without going http://stackexchange.com/questions link?"}, {"author_name": "Mariusz", "gravatar_hash": "57b2d849509d2058cee4344af8785de9", "author_url": null, "date": "Dec 04, 2013", "message": "A little bit too black this new black of yours is. Less-black black would be a little bit more eye friendly."}, {"author_name": "David Fullerton", "gravatar_hash": "0fda7d8abd0542ef6194287ea39d8a8b", "author_url": null, "date": "Dec 04, 2013", "message": "@Soner Network hot questions are now on the homepage of every site, in the sidebar, or you can go to http://stackexchange.com/questions?tab=hot"}, {"author_name": "Adam Rosenfield", "gravatar_hash": "924800e76876546c5c575c0175e1f434", "author_url": "http://adamrosenfield.com", "date": "Dec 04, 2013", "message": "There used to be a drop-down menu from the top bar from which I could easily get to my Activity page, now I can't do that any more (there were a few other options in that drop-down menu, but Activity was the only one I usually used).\n\nNow I need to click on the area of my icon/rep/badge counts to get to my user page and then find the Activity link on the middle-right.  Much more effort and an additional page load.\n\nI don't like that my name got removed from the top bar, either.  Maybe that makes sense on mobile, but not on a desktop browser where I have plenty of horizontal space.  I don't like the increasingly popular trend nowadays of replacing text with icons to unify mobile and desktop interfaces, it's a huge mistake."}, {"author_name": "Romain", "gravatar_hash": "fe3e2222a4cf39d0cc39a34c6ad26d35", "author_url": "http://romaingillot.com", "date": "Dec 04, 2013", "message": "I like the new dark design of the top bar! However, it's only for Stack Overflow and not for all Stack Exchange sites, too bad :-)."}, {"author_name": "puddin tame", "gravatar_hash": "15769bbea999aee421458f52e7c9d011", "author_url": null, "date": "Dec 04, 2013", "message": "I liked the chart that dropped down when you clicked on the triangle.  it gave a good dashboard of the stuff I'm interested in.  but now I don't get to see that stuff."}, {"author_name": "Jin", "gravatar_hash": "70ad2c2830eb9a7753bd6312f3811e3e", "author_url": "http://www.8164.org", "date": "Dec 04, 2013", "message": "@Romain we're rolling it out to all the other SE sites soon."}, {"author_name": "Daniel Imms", "gravatar_hash": "b67eb0f1547c245ea8c38fa3f1ecfa5e", "author_url": "http://www.growingwiththeweb.com", "date": "Dec 04, 2013", "message": "Because it's so black it really stands out, perhaps even distracting from the page content. Plus it doesn't seem to match the look and feel. A gray like it was would be better imo.\n\nThe features are great though!"}, {"author_name": "Reese", "gravatar_hash": "efccffc5e8d68195b2b6210e88ab9b5e", "author_url": null, "date": "Dec 04, 2013", "message": "I must agree with a few others on here - I like the features, but the black is kind of hard to look at. The text, being slightly grey and not bright white, is quite hard to read (or at least doesn't stand out like it used to). Brighter text would be a huge plus, if not a less-black, more dark-gray bar would be more eye-appealing."}, {"author_name": "Gonzalo", "gravatar_hash": "9642e8bd2c0a4aa406f0d856cde7a6f2", "author_url": "http://nerian.es", "date": "Dec 04, 2013", "message": "I little bit less dark would be better, like:  #363636;"}, {"author_name": "Alex Gray", "gravatar_hash": "50e7ed4eb2e7af000ea7d161748958f1", "author_url": "http://mralexgray.github.com", "date": "Dec 04, 2013", "message": "I love change.  I hate this.\nIt looks like a cheap bootstrap knockoff.\nAnd where is \"Hot Questions\".\n\nPS: Dial down the captcha \"paranoia\" setting... I had to refresh like 40 times to get anything remotely legible, in order to post this, lol!"}, {"author_name": "Shashank", "gravatar_hash": "3a75bbd20c63eb9b569fa7617fa6b4ef", "author_url": null, "date": "Dec 04, 2013", "message": "Love the functionality but really hate the \"black\" color of the top-bar. It stands out and is a distraction. \nOver all effect is akin to putting spinner wheels on an Aston Martin Vanquish(Ugh!)"}, {"author_name": "Oleg", "gravatar_hash": "9df7cd2073622a0e5d25dac3b31a277f", "author_url": null, "date": "Dec 04, 2013", "message": "This looks like something hacked over a weekend. Misaligned and too much contrast. Where can I downvote this?"}, {"author_name": "Tim Pietzcker", "gravatar_hash": "251f2449ffba9fbcc3491db6564ff4a2", "author_url": null, "date": "Dec 04, 2013", "message": "I'm with Adam and Alex - I miss the \"Hot questions\" that were a great inspiration to browse other SE sites I wouldn't regularly visit otherwise. And I miss the \"Activity\" link, too. Sad."}, {"author_name": "Simon Whitehead", "gravatar_hash": "d15c5670dad6eab33c0cccbd7f6b2669", "author_url": null, "date": "Dec 04, 2013", "message": "I don't mind it. It feels more modern*.. I'll just have to get used to the \"Hot questions\" being on the home page.\n\n* My design/creativity skills are extremely low. Therefore my opinion on how it looks should be discarded pretty quickly."}, {"author_name": "Jon Ericson", "gravatar_hash": "197b4243bd82fb459f5e4e4486286ed9", "author_url": null, "date": "Dec 04, 2013", "message": "@Oleg: I'm afraid you missed your opportunity: <a href=\"http://meta.stackoverflow.com/questions/207420/the-new-top-bar-is-out-on-meta-consider-it-a-beta\" rel=\"nofollow\">The new top bar is out on meta. Consider it a beta</a>.  But there a ton of new <a href=\"http://meta.stackoverflow.com/questions/tagged/top-bar\" rel=\"nofollow\">meta questions</a> where you can provide feedback. ;-)\n\nI felt a bit like you did the very first time I saw the mockup.  But after using it on Meta.StackExchange for the last few weeks, I couldn't wait for it to go live everywhere.  The killer app, in my opinion, is seeing reputation increases on old questions on sites that you don't visit very often.  And let's be honest, the old bar was probably not winning design awards either."}, {"author_name": "BrunoLM", "gravatar_hash": "ef1a0f00d57917768acdc5b379ca1b28", "author_url": "http://about.me/brunolm", "date": "Dec 04, 2013", "message": "I like it. I would really like if it was fixed, so we wouldn't need to scroll all the way to the top to navigate elsewhere."}, {"author_name": "Tim", "gravatar_hash": "ff876b738089ceb94aff6c34c4534d08", "author_url": "http://www.thrillist.com", "date": "Dec 04, 2013", "message": "Somebody plays Cards Against Humanity"}, {"author_name": "Monse", "gravatar_hash": "53ade166f36c2604c7fcf2ea621373c2", "author_url": null, "date": "Dec 04, 2013", "message": "Sorry I don't like it."}, {"author_name": "Izzy", "gravatar_hash": "e2b29bd68eb03763a0e18c691ecf9fa5", "author_url": null, "date": "Dec 04, 2013", "message": "Like Adam and Puddin I miss the \"Dashboard\". Guess with the new design it should go on top of the Achievements popup – as with the old design, achievements was what came beneath the Dashboard. Moreover: Are the links to Meta/Chat/Review gone for good? I cannot see them here on MSO. For \"review\" it might be my \"low rep\" on that site. But Meta should be visible for everyone. Also, the \"old\" inbox looked compacter (I liked that more; the new seems to \"waste space\" a little – did it get smaller, while using a slightly larger font size?)\n\nApart from that, I don't want to sound \"ranty\": The overall design looks nice!"}, {"author_name": "Jack Lemon", "gravatar_hash": "4505adc6af7f871038ebe06a46564e94", "author_url": null, "date": "Dec 04, 2013", "message": "Eew, ugly, sorry but it looks so negative, the positive white and especially minimalistic view was so much better and way in the trend of things.\n\nPlease change back, I feel so overthrown by black here, I am sinking..."}, {"author_name": "Dmitry", "gravatar_hash": "cd133b0cba69adf35ff11a34e3ff90dc", "author_url": "http://www.twitterbootstrapmvc.com", "date": "Dec 04, 2013", "message": "Functionality is great. Color is ok. I don't mind black. People will get used to it.\n\nBased on the screenshot that compares the old vs the new, one should also get a pretty good bump in reputation with the transition ;)"}, {"author_name": "Chris", "gravatar_hash": "fdcb35ac84af40ea61399aec70d54814", "author_url": null, "date": "Dec 04, 2013", "message": "Not a fan of the black. Google released the black bar and they realized it was a mistake and have slowly been changing it back to light gray. Hopefully Stackoverflow also gets rid of the black eventually and either a light gray, or do what use JS to do like iOS does with it's top menu where it creates the color based on the color of the app."}, {"author_name": "Derek", "gravatar_hash": "d6fab176b3d9d3026ee3eec2dba19fbe", "author_url": "http://derek1906.site50.net", "date": "Dec 04, 2013", "message": "The new design is really nice, but one thing I don't like is the color black. It creates a huge contrast between the page color and the navbar color which isn't really a good thing. The old gray color is the best in my opinion. Maybe you guys should add an option for us to choose the color ;)"}, {"author_name": "SirDarius", "gravatar_hash": "250889c646cd2a916920d9252f7c6f42", "author_url": "http://www.zenhaven.org/", "date": "Dec 04, 2013", "message": "The header hurts my eyes. There is too much contrast with the rest of the page. Please consider at least giving a chance to users to adjust the color in their profile."}, {"author_name": "James Walker", "gravatar_hash": "a1b0ec38475a4a2373681c5679c02b39", "author_url": "http://www.jwwalker.com", "date": "Dec 04, 2013", "message": "The gray on black is too hard to read.  And I agree with all that Adam Rosenfield said."}, {"author_name": "Jeremy", "gravatar_hash": "4a9322d9c5a7b5d9c499c40a9e18f3c3", "author_url": null, "date": "Dec 04, 2013", "message": "Look, I understand SO is made by developers, not designers, but really?  The concept of \"contrast\" has just been completely ignored: there is way too much contrast between the black bar and the rest of the site, while there is way too little contrast between some of the grays and blues inside the toolbar and the black background.\n\nI &lt;3 the new toolbar functionality-wise, but the look of it is kinda terrible; please ditch the black!"}, {"author_name": "Tim Pietzcker", "gravatar_hash": "251f2449ffba9fbcc3491db6564ff4a2", "author_url": null, "date": "Dec 04, 2013", "message": "Ah...found the new Hot Questions spot. Well OK then :)"}, {"author_name": "nathanvda", "gravatar_hash": "30a45c64b2ef288f7ec098c5fb353a22", "author_url": null, "date": "Dec 04, 2013", "message": "Still need to get used to the black. It seems pretty harsh, but might get used to it :) \n\nBefore, when you started typing in the search-box, it automatically expanded. I really liked that. It removed the clutter, it gave me the room to type, and most of the times I need more room to type a search term on SO. Unfortunately that feature is gone. Is that intentional?"}, {"author_name": "Greg", "gravatar_hash": "6c3287cdd50dfcc506ddab6f445d4fb5", "author_url": "http://GregThompsonJr.com/", "date": "Dec 04, 2013", "message": "The black isn't so nice alongside the rest of the content."}, {"author_name": "jquiroga", "gravatar_hash": "1bc94d9e32d31729320bd980e159b78a", "author_url": null, "date": "Dec 04, 2013", "message": "Pure black does not feel right, and here is why:\n\nhttp://ianstormtaylor.com/design-tip-never-use-black/"}, {"author_name": "Alec", "gravatar_hash": "6c9ad74e5d192e2207eb5008e6af8224", "author_url": null, "date": "Dec 04, 2013", "message": "Please (on the maths one at least) don't set the background of accepted answers as green\n\n(also I don't think the identity was ever lost? I don't see why this has been done) but for fear you think I'm resistant to change, please just the above!"}, {"author_name": "Alec", "gravatar_hash": "6c9ad74e5d192e2207eb5008e6af8224", "author_url": null, "date": "Dec 04, 2013", "message": "No I must complain, please not black. It looks so out of place. I hope none of the links have been removed either."}, {"author_name": "Alec", "gravatar_hash": "6c9ad74e5d192e2207eb5008e6af8224", "author_url": null, "date": "Dec 04, 2013", "message": "The white background of my generated (and quite nice) icon really goes well with the black (sarcasm) please put names back there. Or both! Do not do logo-only, that makes no sense if the name was to be functional (Am I logged in? Not my name =&gt; no) \n\nI was also used to clicking names to view details about users, it worked with that!\n\nSorry for the combo-breaker, the Capatchas are getting harder (I feel like a robot) this will probably be the last."}, {"author_name": "Alec", "gravatar_hash": "6c9ad74e5d192e2207eb5008e6af8224", "author_url": null, "date": "Dec 04, 2013", "message": "Where's chat gone!? There's actually a gap where it ought to be!"}, {"author_name": "Jim Tollan", "gravatar_hash": "248e86d3e5c4bc390d48f23cd17d7bb7", "author_url": null, "date": "Dec 04, 2013", "message": "sorry, i know we're talking about progress, but on a few levels i think *we* fail here:\n\n1. FAR too black (glad others said it too, i thought it was just me)\n2. The activity features were really nice, the new bar seems more to be focussed on flattering my ego - i.e. all about me, rather than what the community id offering\n\nThe above notwithstanding, I approectiate we can't stand still, but too much too soon 1 :)"}, {"author_name": "Chris", "gravatar_hash": "1fe1bd4d9325c160f94fe80284151a0f", "author_url": null, "date": "Dec 04, 2013", "message": "The black is too harsh and contrasty with the page, definitely a distraction, while everything within the bar isn't contrasty enough.  E.g. the Stackexchange button gets lost with its deep blue against a black background and the grey font colors and icons are also to dark to stand out nicely."}, {"author_name": "Alec", "gravatar_hash": "6c9ad74e5d192e2207eb5008e6af8224", "author_url": null, "date": "Dec 04, 2013", "message": "I'm sorry for that odd post about the green background, I don't know what I saw. Anyway, lets be serious:\n\nhttp://alec-teal.co.uk/Screenshot.png\n\nLeft or right? I had a tab open (Shock) with the black bar it made the background feel too white with Stackoverflow. It looks really bad on maths.stackexchange. \n\nPlease undo this. I like chat, review, help and about being there, it's not like there's a lack of space.\n\nI also don't like how when I've clicked that weird tray icon (or the graph) I get the dashed box of a clicked link around it, it's really obvious with the black."}, {"author_name": "Jim Tollan", "gravatar_hash": "248e86d3e5c4bc390d48f23cd17d7bb7", "author_url": null, "date": "Dec 04, 2013", "message": "btw - i think #444 is a good balance between the black that no-one likes and being stubborn :)"}, {"author_name": "Jossie", "gravatar_hash": "cd9e799ae6bb6fc2c507672449ccc2f5", "author_url": null, "date": "Dec 04, 2013", "message": "This new toolbar, I don't like it. How can I make it go away?\nAt least how do I make it white?\n(no racist) but the colors clash too hard, for example math.SE."}, {"author_name": "Phil", "gravatar_hash": "1378d912f45365d4bdd16cb531aa4ee2", "author_url": null, "date": "Dec 04, 2013", "message": "My biggest wish is to have this bar at the top of chat.se so that I can see notifications when I'm moaning in SE chat rooms. Please make it so! :) \n\nmeta question: http://meta.dba.stackexchange.com/questions/907/chat-and-the-se-toolbar"}, {"author_name": "Andrew", "gravatar_hash": "43e9a4a9b279971cc1e7f659523c674c", "author_url": "http://www.robodesigners.com", "date": "Dec 04, 2013", "message": "It's ok, but hiding the meta link will take some getting used to.  Also, I wish it was ~5 pixels shorter... It feels heavy and obtrusive on my screen."}, {"author_name": "Monica", "gravatar_hash": "1bfa4ff176b22f138985ddacbc59506f", "author_url": null, "date": "Dec 04, 2013", "message": "Nice job.  Thanks for being so responsive to the feedback from the beta test.\n\nRe: \"This led to some of us, well, compulsively cycling through sites and refreshing to see if we’d gained any rep.\" -- really?  You didn't just bookmark the reputation tab on your network profile like I did? Much easier! :-)"}, {"author_name": "Jim Tollan", "gravatar_hash": "248e86d3e5c4bc390d48f23cd17d7bb7", "author_url": "http://downencygui", "date": "Dec 04, 2013", "message": "hey, looks like we all fancy ourselves as designers now - lol.\n\nhere's my *regrade*: http://emociao.com/images/SO-1.png\n\ntopbar background changed to: #606060\nthe textcolor changed to #CCC\n\nStill a mile from what makes me happy, but far better (imho) than the current rushed version.\n\nagain, sorry guys, you do an otherwise great job on all other fronts."}, {"author_name": "Scott", "gravatar_hash": "c056c352518943b11095c83a4ef2b31f", "author_url": null, "date": "Dec 04, 2013", "message": "I like the black.  It's much cleaner looking and it works across ALL sites, which is what the whole point was.  Great job!"}, {"author_name": "marczellm", "gravatar_hash": "13f326b7f071dbff3bd23d1c9713ec6b", "author_url": null, "date": "Dec 04, 2013", "message": "I don't like this stuff:\n- disturbs the unique design of the SE sites\n- I don't have a profile pic so I don't immediately see that I'm logged in, instead it takes time to realize it\n- I don't give a **** about my reputation and badges, I care about the content\n- the one-click available links are useless, and more useful things are some clicks away.\n- etc."}, {"author_name": "Alec", "gravatar_hash": "6c9ad74e5d192e2207eb5008e6af8224", "author_url": null, "date": "Dec 04, 2013", "message": "It's like Gnome3.\n\n\"Letting you do less in more clicks\"\n\nBTW I've just found chat, it you click where it says \"stack exchange\" you can see it there. (see, like Gnome 3! Moving stuff people knew how to use and find for no reason!)"}, {"author_name": "Jezen Thomas", "gravatar_hash": "21c72bd81a69ba719941413457fbde7d", "author_url": "http://jezenthomas.com", "date": "Dec 04, 2013", "message": "So, I hope you guys have understand that black was a poor choice."}, {"author_name": "achedeuzot", "gravatar_hash": "b1cd8e98b8707a7269760c6bbb7a25b7", "author_url": null, "date": "Dec 04, 2013", "message": "I like the new content but the black color is really too disturbing. The browser is gray, and the page too so the black stands out too much in the overall look'n'feel.\n\nAlso, I liked seeing my username instead of my picture (which is not set so kinda useless). So I like @marczellm said, it's not as easy to spot if you're logged in.\n\nI didn't use the other features extensively so I don't have any opinion about them..."}, {"author_name": "tohecz", "gravatar_hash": "00c5384c01d44ec1bbc4c035638c3042", "author_url": "http://tex.stackexchange.com/", "date": "Dec 04, 2013", "message": "Couple remarks:\n\n- It doesn't work properly on the sites (messed up the whole logo of TeX.SX, for one.\n\n- I agree with those above: I've never clicked \"review\" or \"help\". I click \"meta\" and \"chat\" daily.\n\n- The black is unifying, but it's like if you said that we'll all be bald because it's unifying. (This is not against bald people. Like some people can be bald, some top bars can be black. But imagine all peopler were bald.)\n\nFor the positive things I like:\n\n- Seperating Inbox and Achievements properly\n\n- Making it one click easier to get to my other sites."}, {"author_name": "Jeff Roe", "gravatar_hash": "c7ce389e2f59cb301fc7a1aac8551d9e", "author_url": null, "date": "Dec 04, 2013", "message": "Now you know what the Visual Studio designers felt like when they rolled out their ALL CAPS menu bar!"}, {"author_name": "Stephen Thomas", "gravatar_hash": "fba68ab6f73742c99dec0e76a96137da", "author_url": "http://sathomas.me", "date": "Dec 04, 2013", "message": "Way too black. Distracts from the content."}, {"author_name": "jpmc26", "gravatar_hash": "828ad534ed0befce514f103afbe715cf", "author_url": null, "date": "Dec 04, 2013", "message": "I'm with everyone else on the black color. The new bar needs to blend in with the rest of StackOverflow like the old one did. The StackOverflow color schema always felt very welcoming; the new one feels like those flashing ads trying to get your attention and annoying you. =( I think it should be a more subdued color scheme. That bar isn't what people visit StackOverflow for, so it should be something that is easily ignored until we need it.\n\nI also miss the little pop up that came from clicking the little down arrow beside my username. I can't recall everything on it off-hand, but I do know I used it daily. It was a very handy quick reference.\n\nI do like the idea of \"Site Switcher\". I used to have to go into my user page to do that. Now it's more at my fingertips.\n\nI don't feel very excited about any of the other changes, but I'm willing to give them a chance. The color schema and loss of functionality, though, are things that immediately bother me as a user."}, {"author_name": "AndrejaKo", "gravatar_hash": "5f1dc98ddd586f6972fc1d3f2b8c13ec", "author_url": null, "date": "Dec 04, 2013", "message": "The black bar is !!!REALLY REALLY HORRIBLE AND DISTRACTING!!! \n\nOf the other changes, I only really dislike the fact that the chat button is now hidden. That's simply a bad UI decision. Also the whole bar looks a bit too user-centric. I mean, what's the point of my picture being here? The \"it's easier to see if you're logged in\" explanation is simply ridiculous. The look and feel of SE is considerably different for users who are not logged in, with all the \"help\" bars and advertizements, so just adding a small change to that one bar is no going to make it any easier to see if you're logged in or not.  \n\nThe new site list looks a bit more useable than the old one at the bottom of the page."}, {"author_name": "AndrejaKo", "gravatar_hash": "5f1dc98ddd586f6972fc1d3f2b8c13ec", "author_url": null, "date": "Dec 04, 2013", "message": "Also why hide the META link? It was there in a convenient location and was easy to access. It's not like a meta site is a whole different SE site. As someone mentioned, the GNOME3 idea of doing half the work in twice as many clicks seems to be strong in the new black bar."}, {"author_name": "Peter", "gravatar_hash": "ac7dc7fe5149761695d2aa12c65f1486", "author_url": null, "date": "Dec 04, 2013", "message": "Please make this top bar not that black, I can barely see anything on it."}, {"author_name": "Martha", "gravatar_hash": "f86f8f8ff9e1217108e14251ba80ba60", "author_url": null, "date": "Dec 04, 2013", "message": "Just some more repetition:\n\n1. Please don't hide the link to meta.\n\n2. The black is just ugly. (Black is *not* the only color that goes with everything: try white. Or gray. Or heck, green.)"}, {"author_name": "RSW", "gravatar_hash": "0d910ac1804615a41af627c45de79862", "author_url": null, "date": "Dec 04, 2013", "message": "I agree with the earlier commenter who said \"I love change. I hate this\". It's actually only the black that I hate. And lest you think I dislike dark colors, I should say that my company's entire web site has a black theme because of *my* input...so I'm not against black on a site. \n\nThe black on the new top bar just stands out too much like a sore thumb instead of feeling like its integrated into the site. And as for the suggestion that black is the only color that would work with all the various site themes, I don't know why gray wouldn't work for the same reasons (grays being various \"shades\" of black/white)."}, {"author_name": "Jim Tollan", "gravatar_hash": "248e86d3e5c4bc390d48f23cd17d7bb7", "author_url": "http://downencygui", "date": "Dec 04, 2013", "message": "oh how silly, but had to do it. take a look on meta at this thread and in particular, the answer by philis re the firefox addin -stylish. works REALLY well, change the bar to how you like it:\n\nhttp://meta.stackoverflow.com/questions/209957/is-anyone-else-personally-terrified-of-the-new-bar-at-the-top"}, {"author_name": "Ken Fyrstenberg", "gravatar_hash": "4f1bef5f5ee11c86e7d9a13f5887f2df", "author_url": "http://thelostpixel.com/", "date": "Dec 04, 2013", "message": "It looks good. But as many the black may be too black, or rather, the bar is too thin to be black as the white page swallows it up sort of making me squint the eyes.\n\nDark grey is the new black - I think that would reduce the contrast a bit and let it be more a part of the whole page without melting into it.\n\nThe new inbox is better than before but there is still a thing that may not be a thing but it's sometimes hard to remember all the comments. If you have read one you have read em' all. Maybe you could consider only marking the actual comment read for read. It's easier I believe to come back and do follow-ups that way.\n\nIn any case, good work! &amp;B-)"}, {"author_name": "Izzy", "gravatar_hash": "e2b29bd68eb03763a0e18c691ecf9fa5", "author_url": null, "date": "Dec 04, 2013", "message": "I took the style from the Meta link Jim posted and modified it a little:\n\nhttps://i.stack.imgur.com/OHYFL.png\n\nNow I can live with the colors. Still like the new \"Site Switcher\" functionality. Still miss some of the previous functionality (full ack to the Gnome comments, after finding some of the missing links)."}, {"author_name": "Jeff", "gravatar_hash": "d7f82e7252789439e06235828e15655b", "author_url": null, "date": "Dec 04, 2013", "message": "It was very nice to see the list of hot questions from other sites in the top menu bar.  I've learned so much from those questions and answers about topics that I wouldn't normally look at.  It's inconvenience to go to a different page (http://stackexchange.com/questions) and see them spread out (6 questions in 1200 pixels for me).\n\n--Jeff"}, {"author_name": "Solomon", "gravatar_hash": "33b65dfeca7f2466aa90fb61735d96ba", "author_url": "http://dream-portal.net", "date": "Dec 04, 2013", "message": "Love it.  This is certainly one of the best programmed and thought out sites I ever visited!  Well done!"}, {"author_name": "Mitch wheat", "gravatar_hash": "bf491c31ba2b4018e150397ba2e4f80b", "author_url": null, "date": "Dec 04, 2013", "message": "Looks like the Google bar, that google fairly quickly abandoned.\n\nNot an improvement."}, {"author_name": "xiangzhuyuan", "gravatar_hash": "e5e6392782fb2b1856409b89a62ae9f8", "author_url": "http://yyxzy.org", "date": "Dec 04, 2013", "message": "yes, I found that, I like it,\nIt's more usable then before,"}, {"author_name": "Adam Beneschan", "gravatar_hash": "508c3cc96cdca194c0204f1f7c2758e0", "author_url": null, "date": "Dec 04, 2013", "message": "I'm with Adam Rosenfield here ... I very often clicked on the \"activity\" link, and it's gone.  I'll get used to doing it the new way, I guess."}, {"author_name": "charlietfl", "gravatar_hash": "8d3d9dfbd040f9cbc1a6b82f0da2b345", "author_url": null, "date": "Dec 04, 2013", "message": "How about a style switcher for color choices?"}, {"author_name": "Bishan", "gravatar_hash": "c0090ed4c75ee4ac917bf94062ed5567", "author_url": "http://www.technetalk.com/", "date": "Dec 04, 2013", "message": "too black. is there any way to change color ?"}, {"author_name": "Jess", "gravatar_hash": "e7085d5f3517ef104816a885e6708c6f", "author_url": null, "date": "Dec 04, 2013", "message": "I think it looks really cool.  I guess I'm in the minority though."}, {"author_name": "Zev Eisenberg", "gravatar_hash": "c85028af274331beade5f06525d8cb06", "author_url": "http://ZevEisenberg.com", "date": "Dec 04, 2013", "message": "I would love to see Retina display support. The logo and other graphics are small enough that you really notice the difference."}, {"author_name": "Daniel", "gravatar_hash": "bd4b8525890e60382f1632b20947120d", "author_url": null, "date": "Dec 04, 2013", "message": "The features are great, I would also love to have a chat button above for active chat rooms, instead of navigating too chat rooms, adding flexibility of conversations, also I think a top bar with #3a3a3a and a site background with #f0f0f0 would do, or the current topbar of stackexchange.com itself. Or for the best maybe let users pass designs and that most voted design would be implemented, besides users are the one who uses this site everyday. When comes to the logo, yup we it's great to have the original, but I think minimal is better just as the current logo of the topbar implemented in stackexchange.com, just a comment and suggestion...."}, {"author_name": "Vish", "gravatar_hash": "5b1140708fab49c1b1ee3fe96429b9c5", "author_url": null, "date": "Dec 04, 2013", "message": "Everything is cool except black color :)"}, {"author_name": "who", "gravatar_hash": "5f533b551196ee3636013ed40e8634b8", "author_url": null, "date": "Dec 04, 2013", "message": "A little hint of gray would be nice to look at . This top bar oddly look likes Google's ribbon , that they used for sometime ."}, {"author_name": "copper.hat", "gravatar_hash": "5672645e7bfd4d6d8fa2f5624fbea2c6", "author_url": null, "date": "Dec 04, 2013", "message": "I like it except for the Henry Ford colour scheme. I think the black is a little harsh and eye-catching."}, {"author_name": "who", "gravatar_hash": "5f533b551196ee3636013ed40e8634b8", "author_url": null, "date": "Dec 04, 2013", "message": "On a side note , its distracting to look , a sudden black in a sea of ribbon; kinda intrusive ."}, {"author_name": "Burhan Khalid", "gravatar_hash": "450fd2737dd0355700a574bd12842509", "author_url": null, "date": "Dec 04, 2013", "message": "Way to ruin one of the critical features of the website. Put an option for those people who want to use the old version."}, {"author_name": "Caleb", "gravatar_hash": "5674a08a7862c06e43a8443a7c979886", "author_url": null, "date": "Dec 04, 2013", "message": "I miss being able to see top questions on all sites in the top bar. I hope you can bring that back."}, {"author_name": "DonAntonio", "gravatar_hash": "74f1a3b505a960a466b65b6800a6eb75", "author_url": null, "date": "Dec 04, 2013", "message": "Before the change one could see the total points obtained in the last day, last week, last month...not that's gone! A pity, the black color is pretty freaky...I wish this change would be undone."}, {"author_name": "mg1075", "gravatar_hash": "7128c3ba79c4a2b633da934fc062f281", "author_url": null, "date": "Dec 04, 2013", "message": "The black bar seems problematic, not from an aesthetic \"it looks cool\" perspective, but rather in terms of usability.\n\nIt is easy enough to read the \"Stack\" in \"StackExchange\", but it is more difficult to read the \"Exchange\", because the combination of black background and blue text is one of the most difficult formats for reading comprehension. The blue on black logo also makes the logo less discernible. So, if one of the goals of the black bar was to increase the visibility of the logo, has that been achieved? Another way to look at the issue: what if IBM put their famous logo in blue text on a black background: would it fly?\n\nFrom an end user perspective, though, the most disconcerting feature of the black bar is how distracting it is. The level of distraction depends on the design of the sub-site in which the black bar sits. For instance, the black bar is not so glaring on the User Experience site, because the black bar sits above a large blue banner. But on a site like stackoverflow, the black bar immediately hits the white of the canvas, thereby calling more attention to the bar itself (as a rectangular black object, not as a content holder). If users are being distracted by a #212121 rectangle, the issue needs to be resolved. \n\nPrior comments have already mentioned Google's short-lived use of the black bar. I am sure there are those of us who will get used to dealing with the black bar, but I am also sure there are many stackexchange users who will be happy once the black bar disappears, just as they were happy after Google abandoned its own black bar experiment."}, {"author_name": "tinstaafl", "gravatar_hash": "52d39acf2c17782acd55688ce69c46d4", "author_url": null, "date": "Dec 04, 2013", "message": "Most ridiculous thing I've seen in a long time.  Who ever heard of a feature where you can't read the writing and if you want to access a feature you have to kind of hover the mouse around to find it.  Here's an idea, try being straight and sober next time you want to design something like this."}, {"author_name": "Vivek", "gravatar_hash": "84365b44d62298b314e44ce24b202662", "author_url": null, "date": "Dec 04, 2013", "message": "I like the new features that have been added to the top bar but the black color is a bit distracting.\nAlso, I miss the earlier ubiquitous access to hot questions. That was a good way to explore other stackexchange sites. Now although its available on the sidebar of the main page, once you click a link its gone from there as well."}, {"author_name": "Sheikh Heera", "gravatar_hash": "3232415a0380253cfffe19163d04acab", "author_url": "http://heera.it", "date": "Dec 04, 2013", "message": "Really cool but I was hoping a fixed bar so I can see all the notifications (rep changes etc) even when I'm in the middle of the page."}, {"author_name": "chb", "gravatar_hash": "937f97cf9707a22aaab18d6411d6869a", "author_url": null, "date": "Dec 04, 2013", "message": "As others have mentioned, the starkness of the black you've chosen detracts from the overall page. Not to mention that it doesn't really do any favors to the blues of the SE logo."}, {"author_name": "delta", "gravatar_hash": "243b391554f5230382109cc3becd6efd", "author_url": null, "date": "Dec 04, 2013", "message": "bring hot questions back please!"}, {"author_name": "Wajeeh", "gravatar_hash": "7fad71e9551fd4fbfee32e3bf450dedc", "author_url": null, "date": "Dec 04, 2013", "message": "Its not eye friendly, its too black. Please change it plsssssssssssss"}, {"author_name": "Umur", "gravatar_hash": "93a009faf6efa4f7bd38fb84a247a826", "author_url": null, "date": "Dec 04, 2013", "message": "Why the hell black? Just anything else would be better."}, {"author_name": "statci", "gravatar_hash": "e5beabf8fce07cd0ade14f36b5bf315e", "author_url": null, "date": "Dec 04, 2013", "message": "black color looks really bad and imho former was better than this new  black complicated bar"}, {"author_name": "Leon", "gravatar_hash": "6641216eac308eb68b52fc9cd43525cf", "author_url": null, "date": "Dec 04, 2013", "message": "This is really terrible and seems to have skipped any UX review whatsoever. You even have Meta and beta testers for the Android app, how could this fail so badly?\n\nNot since that terrible Skype for Mac redesign, has such a prominent company got something so wrong. \n\nThen again, both are drinking the M$ juice..."}, {"author_name": "Saurav", "gravatar_hash": "785a56febb454acbc1f66895a95bddff", "author_url": null, "date": "Dec 04, 2013", "message": "I don't like the new bar at all. will be making some changes to userstyle extension to revert to old bar."}, {"author_name": "Gaetane le Grange", "gravatar_hash": "14cb5e8558cac37d1ed89a449c219ee6", "author_url": null, "date": "Dec 04, 2013", "message": "Well, as someone always looking for new ways of sticking it to the man, I recommend:\n\n1. Something like Stylish for Chrome (they all seem a bit buggy, but hey, rebellion isn't perfect)\n\n2. \n    div.topbar {\n        width: 100%; background-color: rgba(33, 33, 33, 0.87); \n        //Or mauvelous, anyone?\n        height: 34px; top: 0px; position:fixed;\n    }\n    body.new-topbar {\n        padding-top: 34px;\n    }\n    #notify-container, #overlay-header, #custom-header {\n        // I dunno, but thought better safe...\n        top: 0px; position: fixed;\n    }\n\n3. Howz your corporate branding now, SO? ;)\n\nNow we can all be happy and stop complaining. You're welcome ^_^\n\nPower to the people..."}, {"author_name": "hagman", "gravatar_hash": "5414270343c53e5986c1af9402bdffb4", "author_url": null, "date": "Dec 04, 2013", "message": "It really took me a while (including reading this post) to find where the \"recent badge\" events had gone. I think in the general achievements list where they are now they could gain from a little visible highlighter, e.g. put a gold/silver/bronce bullit into the column where the rep gains (e.g. \"+10\") are ...\nJust my two cents."}, {"author_name": "Gowri", "gravatar_hash": "5e446acc983e5df2ca06e6ec35305955", "author_url": "http://code-cocktail.in/", "date": "Dec 04, 2013", "message": "My eyes begging, don't see it. It's too black. Please make it lighter"}, {"author_name": "arun", "gravatar_hash": "e90f935b2cbce2f47b0c8e52927cc2a3", "author_url": "http://bit.ly/gplus2deostroll", "date": "Dec 04, 2013", "message": "Before you had the feature where scrolling on your name would give you a small popup with your reputations earned and stuff...please bring that on back."}, {"author_name": "Ron Klein", "gravatar_hash": "620ed2c3129f0c0887efbc5a54d6125c", "author_url": "http://ronklein.co.il", "date": "Dec 05, 2013", "message": "I like it. More usable."}, {"author_name": "barti_ddu", "gravatar_hash": "5addfdcb62bd8c8550456d24377b7b64", "author_url": null, "date": "Dec 05, 2013", "message": "Too much contrast for my eyes :/\n\nFunctionally great."}, {"author_name": "Konstantin Yovkov", "gravatar_hash": "a45951a4ca06fcfc31ce28f5acc50f6c", "author_url": "http://kocko.eu", "date": "Dec 05, 2013", "message": "Please make it lighter !"}, {"author_name": "Benjol", "gravatar_hash": "501465a53bf1042de206d7d79cc68942", "author_url": null, "date": "Dec 05, 2013", "message": "The tab of this page reads \"A New Top Bar f...\" in my browser.\n\nSays it all :)\n\nI hate the way it imposes itself on what were otherwise fairly harmonious designs (Christianity, Mi Yodeya, Programmers...)"}, {"author_name": "Maroun", "gravatar_hash": "a29147752792d81b50882c816af9807f", "author_url": null, "date": "Dec 05, 2013", "message": "We'll get used to it."}, {"author_name": "Aerus", "gravatar_hash": "91f44d555b056927e200255d18a289bc", "author_url": null, "date": "Dec 05, 2013", "message": "I, as many others, don't like the black. \n\nI'm sorry if this was suggested before, I didn't go through all comments but if the black is staying, please give us a setting where we can change it to a color we like."}, {"author_name": "Dan", "gravatar_hash": "5df93b4f71fec2e5a7b2402a15f70d23", "author_url": null, "date": "Dec 05, 2013", "message": "Too much black, hard to see things inside of it."}, {"author_name": "Khoa Ph", "gravatar_hash": "16bebb36e0e28572a316ba0450e190d1", "author_url": "http://www.fantageek.com", "date": "Dec 05, 2013", "message": "still don't get familiar with the new bar"}, {"author_name": "SteffLocke", "gravatar_hash": "22f7da1eca15c0c414ba507b1a7e49d9", "author_url": "http://steff.itsalocke.come", "date": "Dec 05, 2013", "message": "Black could be less black, but overall it works and the new feature layout is great, and for those who hate it there's the option of scrolling away from it.  \n\nPlus side for me, it finally forced me to get around to changing my SO pic from the pregen pic as it looked bad on the new bar and made it difficult to tell if I was logged in."}, {"author_name": "surya", "gravatar_hash": "8bf688ba7ac4371539003fc279f383db", "author_url": null, "date": "Dec 05, 2013", "message": "Its does not fit well.. may be less black"}, {"author_name": "Radu Maris", "gravatar_hash": "aa6e26d30ce7ba852cef63482429b9e2", "author_url": "http://google.com/+MarisRadu", "date": "Dec 05, 2013", "message": "I to think that the black is to black. A little lighther would be great."}, {"author_name": "Alwin", "gravatar_hash": "5788d295793edcb28a326545959b98f6", "author_url": "http://joomlabasics.info", "date": "Dec 05, 2013", "message": "Less black please...not able to see"}, {"author_name": "Qpirate", "gravatar_hash": "b0dbac6e2734489591163699ba615d23", "author_url": null, "date": "Dec 05, 2013", "message": "Would it be possible to have the menu bar float with the scroll?"}, {"author_name": "PeterM", "gravatar_hash": "4c83e992063d44b7809e302460f301de", "author_url": "http://maslosoft.com/", "date": "Dec 05, 2013", "message": "Really like comments feed it is now much more usable, thanks!\n\nAlso like explanation of choosen color."}, {"author_name": "Faizal", "gravatar_hash": "955d915b9e45d210f6503ef0bfb2bf1b", "author_url": null, "date": "Dec 05, 2013", "message": "too black..please grey it out. No hover to popup any more? I have to click now?? Where is the chart of recent activities that use to pop up? come on!!"}, {"author_name": "Ebram Tharwat", "gravatar_hash": "70789f50fa32e28a4b237d7b973cec43", "author_url": null, "date": "Dec 05, 2013", "message": "Nice look. I liked the Achievements popup.\nBut i think you need to make the top bar more \"bright\" or \"shine\""}, {"author_name": "Adrian", "gravatar_hash": "24e4d07d5480c4eec199804438e2a837", "author_url": "http://www.seoadsem.com", "date": "Dec 05, 2013", "message": "Too black, add that great grey that you had back please."}, {"author_name": "Vitor Canova", "gravatar_hash": "a708d1765d1b577b75aa651d65dc2901", "author_url": null, "date": "Dec 05, 2013", "message": "I really love it. The old \"one box for everything\" made me nuts many times. \n\nGood work guys."}, {"author_name": "Timmy", "gravatar_hash": "6ee2967276a0a4ea2acd04fd0a9e800d", "author_url": "http://timmyomahony.com", "date": "Dec 05, 2013", "message": "I'm probably a little late to this, but why not have the same layout and features and simply change the colour to match with whatever site you are viewing? The black looks awful."}, {"author_name": "cja", "gravatar_hash": "f7946665a091045422f2da4e84734fc4", "author_url": "http://www.cja.org.uk", "date": "Dec 05, 2013", "message": "Bar is too black.\n\nLike the functionality of the bar."}, {"author_name": "Jimmery", "gravatar_hash": "33872cdddd0c765e8e5a9f75bb5904c3", "author_url": "http://stackoverflow.com/users/1037617/jimmery", "date": "Dec 05, 2013", "message": "Lots of hate on the black colour - I have to say I love it - its striking and works well across all the sites.\n\nI say keep it as it is and ignore the haters! :)"}, {"author_name": "Scott", "gravatar_hash": "fb465ea2879cadff3471db84544befb2", "author_url": null, "date": "Dec 05, 2013", "message": "I like the functionality. But it's too black. It's distracting.\n\nAnything lighter than: #343434 would be great."}, {"author_name": "Jim Tollan", "gravatar_hash": "248e86d3e5c4bc390d48f23cd17d7bb7", "author_url": "http://downencygui", "date": "Dec 05, 2013", "message": "as noted in the thread earlier. the functionality is great. if the only issue is the color/styling, then use Styler (see the meta thread for a kickoff: http://meta.stackoverflow.com/questions/210041/gallery-of-custom-styles-and-or-scripts-for-the-top-bar/210050).\n\nI did this and am happy with my own light grey version, amended to suit my eyes. the change for ONE is easier than pushing for a new concensus on a re styling of the black -i don't think it'll happen."}, {"author_name": "Scotty.NET", "gravatar_hash": "0a1e4f45031c4b1efa61957a93678241", "author_url": "http://stackoverflow.com/users/1123275/scotty-net", "date": "Dec 05, 2013", "message": "Feature wise it is great but style wise not so great. Can it be 31px still to be same as the old one? I guess you have a reason to make it bigger?"}, {"author_name": "Vishwas Sharma", "gravatar_hash": "c6f4588494d566710dac74937269c7dc", "author_url": null, "date": "Dec 05, 2013", "message": "Seriously need to change background color of tab, can't see my profile pic also and where are hot questions? We will have to always go to a site's homepage for them. Those were better when available in single click."}, {"author_name": "Nizar Basbous", "gravatar_hash": "0b4b3f7896e4ff10162490041831644c", "author_url": null, "date": "Dec 05, 2013", "message": "Why my profile image plinks after clicking refresh ?"}, {"author_name": "alberto", "gravatar_hash": "78090220abb50b2fee758d8acb89ca67", "author_url": "http://albertopasca.it", "date": "Dec 05, 2013", "message": "No, \"the black is too black\". I prefer an opaque black or something better clear.\nThe label \"exchange\" in blue on black is not readable."}, {"author_name": "STGdb", "gravatar_hash": "adafcd207e90b1c706ce6d0a1325b82f", "author_url": null, "date": "Dec 05, 2013", "message": "+1 @ alberto (and many others)\n\nThe black is too black"}, {"author_name": "llnk", "gravatar_hash": "3535689c965d66db3d2a936ced96192a", "author_url": null, "date": "Dec 05, 2013", "message": "awful color and design.\n\nHire a competent designer please"}, {"author_name": "Paddy", "gravatar_hash": "9ea2a1db1959c5c29bcaca18980eabb6", "author_url": null, "date": "Dec 05, 2013", "message": "Unlike the rest, don't mind the black, but find the gray text on the black bar very hard to see...."}, {"author_name": "hayesmaker", "gravatar_hash": "a4209faf93bf06c3aad3fedc55b28963", "author_url": "http://hayesmaker.com", "date": "Dec 05, 2013", "message": "This black is horrific, you do not only have 1 choice, you have 16,7million choices, change it to one of the others."}, {"author_name": "kgiannakakis", "gravatar_hash": "24059909b82438e84ac480148dbdc4d6", "author_url": null, "date": "Dec 05, 2013", "message": "I am not a designer, but I believe that the font color should be white and not gray. Also, on mouse hover do not change the background, but the foreground color. Icons on the left are also not very informative. They ratio gray to black should be higher.\n\nWordpress is also using a black toolbar. For some reason, it is more readable than StackExchange's."}, {"author_name": "Swati", "gravatar_hash": "8aaa6c0debcb49f03bc82ce09c8051e0", "author_url": "http://maplewallet.com", "date": "Dec 05, 2013", "message": "Great functionality. I do find the black distracting and way too \"black.\" Kind of hurts my eyes. I feel that it's constantly asking for my attention.\n\nComing soon. A user script to change the color of the black."}, {"author_name": "Fyodor", "gravatar_hash": "2e6b344700ae233c31f3b945c041c124", "author_url": null, "date": "Dec 05, 2013", "message": "Totally agree with this comment:\n\"Less-black black would be a little bit more eye friendly.\""}, {"author_name": "FastTrack", "gravatar_hash": "d356e0c4d4888434ed5a74c6cda58a35", "author_url": "http://www.xtracktech.com", "date": "Dec 05, 2013", "message": "I'm in total agreement with this comment from above:\n\n\"Less-black black would be a little bit more eye friendly.\"\n\nAt first glance, the top bar didn't really look \"finished\" to me because of it being way too black."}, {"author_name": "Dan", "gravatar_hash": "965d4cac1473f9a92aaafa7d4fd675ab", "author_url": null, "date": "Dec 05, 2013", "message": "Great features, too black ..."}, {"author_name": "Stephen Ostermiller", "gravatar_hash": "145a1b478f3f9d93f86969b551f34e26", "author_url": null, "date": "Dec 05, 2013", "message": "Can we have this on the chat site too?  The chat site still feels like it was tacked on at the last minute.  It is too hard to get back to the main site from chat."}, {"author_name": "FastTrack", "gravatar_hash": "d356e0c4d4888434ed5a74c6cda58a35", "author_url": "http://www.xtracktech.com", "date": "Dec 05, 2013", "message": "Looks like a lot of \"too black\" comments here - LOL... Really though, it is WAY too black. You guys should look at the Wordpress top bar, which is also very dark, but is a lot nicer-looking and easier on the eyes."}, {"author_name": "lorem monkey", "gravatar_hash": "3d772ad6e17170d16aae014e8990b12a", "author_url": null, "date": "Dec 05, 2013", "message": "Coll new features - but as many said before: the black is just to dark. It's somehow distracting and my eye keeps bouncing back.\n\nI would vote for a lighter/brighter one if I could? Could I? +1!"}, {"author_name": "Omer Katz", "gravatar_hash": "5bf5f3464f90521d91dc889b71d2955a", "author_url": "http://omerkatz.com", "date": "Dec 05, 2013", "message": "The color is horrible. The functionality is great."}, {"author_name": "Jf Beaulac", "gravatar_hash": "4637315b2c9e477b9da2a938f656f305", "author_url": null, "date": "Dec 05, 2013", "message": "I like the new bar, but it's a little too dark for my taste."}, {"author_name": "FastTrack", "gravatar_hash": "d356e0c4d4888434ed5a74c6cda58a35", "author_url": "http://www.xtracktech.com", "date": "Dec 05, 2013", "message": "Bottom line here Stack Exchange employees - CHANGE THE DARK AS NIGHT COLOR TO SOMETHING MORE EASY ON THE EYES."}, {"author_name": "StingyJack", "gravatar_hash": "8ff75049b31c4a05033be39792f1c2be", "author_url": null, "date": "Dec 05, 2013", "message": "The font and foreground colors are not distanced enough from the black to be easily visible. Dark blue/grey on black? Cannot read without squinting"}, {"author_name": "Rumit", "gravatar_hash": "dacead8eef07e19fb0c7fcac773b8824", "author_url": null, "date": "Dec 05, 2013", "message": "I like the new bar. Features and options improvements are great. But color is too dark to match with rest of the page. I think old gray color would suit better"}, {"author_name": "einpoklum", "gravatar_hash": "10c44e0d9568e48d05708ae196ad936f", "author_url": null, "date": "Dec 05, 2013", "message": "I like the new bar features, but not the graphics:\n\nBar color: Black is too forceful for the SX site designs. Before we had more subdued colors, differing with the site's color scheme. Why not keep that?\n\nBar height: Too high. You only need this height for the user avatar, I believe; everything else fits in a thinner bar.\n\nUser Avatar: There not much benefit in _me_ seeing _my_ avatar. The name is more relevant. Kill it (or make it optional) to allow the bar to go back to being thin."}, {"author_name": "Scott", "gravatar_hash": "c056c352518943b11095c83a4ef2b31f", "author_url": null, "date": "Dec 05, 2013", "message": "I really don't understand what is wrong with all you people who hate the black.  You do realize WHITE is what is hard on your eyes, not black, right?  Why do you think the most popular environment theme settings for Visual Studio are dark Expression-like ones?  You do also realize that your monitor has its own settings that can be adjusted for brightness and contrast, right?"}, {"author_name": "FastTrack", "gravatar_hash": "d356e0c4d4888434ed5a74c6cda58a35", "author_url": "http://www.xtracktech.com", "date": "Dec 05, 2013", "message": "@Scott: You're in the minority... The top bar is tough to read, the colors are too close and makes you have to strain your eyes to see what's going on."}, {"author_name": "Guy", "gravatar_hash": "85e91eebb96da29fe09915e4670628b3", "author_url": null, "date": "Dec 05, 2013", "message": "Missing the 'my recent actions' type floatover :("}, {"author_name": "nkint", "gravatar_hash": "26dbc73d18803037e09f13c0374a543f", "author_url": null, "date": "Dec 05, 2013", "message": "please change the black"}, {"author_name": "barbara beeton", "gravatar_hash": "4871da0aec379a1c906a0b4f260d2a6e", "author_url": null, "date": "Dec 05, 2013", "message": "the reverse text on the black bar is very hard to read.  while this is probably at least partially a problem with the monitor i'm using, that is not fixable, so i'm left to guess what the little patches of gray mean.  finding a link to \"meta\" was quite a trial; the disappearance of that link on the bar was disappointing."}, {"author_name": "BrianDHall", "gravatar_hash": "4c0dd8e60531fc7d6a56e3f6d569951d", "author_url": null, "date": "Dec 05, 2013", "message": "I love the top bar, but the lack of Hot Questions (cross-site) completely breaks how I most like to explore the site.\n\nMy favorite thing with Stack Exchange is coming in, check to see if I have any messages or reputation changes, etc, and then pop open hot questions as if it was a news feed - open all the questions in separate tabs, maybe discover a new site in the process...good times!\n\nNow I come in, check the usual, and then...all done. [X] and back to work.\n\nThanks for the productivity gain in my other work, but it reduces my pleasure with the Stack Exchange site itself, and my likelihood of contributing on a variety of sites."}, {"author_name": "Babak Sorouh", "gravatar_hash": "315a727fe8efd98d405c01d4d36cd47c", "author_url": null, "date": "Dec 05, 2013", "message": "Thanks for designing a new bar. May I ask for an icon indicating how much upvotes( or downvotes) you give others. I miss it near the green icon on the bar. Thanks."}, {"author_name": "Scott", "gravatar_hash": "c056c352518943b11095c83a4ef2b31f", "author_url": null, "date": "Dec 05, 2013", "message": "@FastTrack - I have no idea what you are talking about.  I don't see any way that the top bar is hard to read.  I don't strain one iota.  Your monitor settings must be jacked."}, {"author_name": "Alex", "gravatar_hash": "f947eb687f7142a889fbc7dadd83f1c9", "author_url": null, "date": "Dec 05, 2013", "message": "Looks tight on retina display!  Nice!"}, {"author_name": "Abhijit", "gravatar_hash": "0b169e1f01cd8d7870e2136279ff11a9", "author_url": "http://myprogrammingexp.wordpress.com", "date": "Dec 05, 2013", "message": "I am not really fond of this top bar."}, {"author_name": "Mehdiway", "gravatar_hash": "549ee6a4145f735a0ad69d502884e6e0", "author_url": null, "date": "Dec 05, 2013", "message": "I miss the pure white StackOverflow :("}, {"author_name": "Kostya", "gravatar_hash": "cf90bb1fa48b121b8d51633bb3b83d23", "author_url": null, "date": "Dec 05, 2013", "message": "I like the new design, but please put back the cross-site hot questions list. Thanks"}, {"author_name": "Ben Swayne", "gravatar_hash": "b949cb93e1c1ee9cbd8a13d02093a7be", "author_url": "http://www.benswayne.com/blog", "date": "Dec 05, 2013", "message": "Much improved! I like both the design and usability improvements!"}, {"author_name": "Asad", "gravatar_hash": "6533221b6a899d4c1962846cb3ca73ef", "author_url": null, "date": "Dec 05, 2013", "message": "Too much black. With low brightness, difficult to see the text on the bar."}, {"author_name": "wolfies", "gravatar_hash": "fd9ebb32605eaee03a0cc80bd7aa60c4", "author_url": "http://math.se", "date": "Dec 05, 2013", "message": "Too much black. Sorry - it is ugly."}, {"author_name": "sevensideddie", "gravatar_hash": "306f5f9b584249a7ee798302e83aecac", "author_url": null, "date": "Dec 05, 2013", "message": "Here's a magic way, with 4 characters worth of work, to have an integrated ribbon that pulls individual site colour: use rgba(33, 33, 33, 0.7) instead of rgb(33, 33, 33) in the background color CSS.\n\nThis looks miles better on every site I've tried it on. On RPG.SE especially, it reveals a big strip of artwork that the heavy black bar was obscuring.\n\n(If it doesn't work in all browsers, use the user agent sniffing that's undoubtedly already in the site's codebase. Design for those of us who use modern browsers; fall back gracefully for the benighted who don't.)"}, {"author_name": "Izzy", "gravatar_hash": "e2b29bd68eb03763a0e18c691ecf9fa5", "author_url": null, "date": "Dec 05, 2013", "message": "@Swati (and others): The UserStyle for a light bar is already there. I combined several suggestions from http://meta.stackoverflow.com/questions/210041/gallery-of-custom-styles-and-or-scripts-for-the-top-bar/210050 and from this blog (light, floating, etc.), and put the \"Mash-Up\" on UserStyles:\n\nhttp://userstyles.org/styles/95794/stackexchange-multicollider-superdropdown-fixes\n\nTested with SO, Android, DBA, AskUbuntu, SuperUser, ServerFault. Should work on other *.stackexchange.com sites as well, but I didn't test them all ;)"}, {"author_name": "Steve Robillard", "gravatar_hash": "b69575d36c15da911d08f755ebf1140e", "author_url": null, "date": "Dec 05, 2013", "message": "I am now middle aged and may not have the eyesight I did 20 years ago, but I would appreciate a little more contrast between the new top bar background color (black) and the icons and text."}, {"author_name": "Jonathan", "gravatar_hash": "6ade0c05a2022323308f1e732d1e63c0", "author_url": "http://stackexchange.com/users/91745/jonathan", "date": "Dec 05, 2013", "message": "I really like the new bar. It looks great and works a lot better than the older one.\n\nHowever, I think you should bring the Hot Network Questions back. Personally I often looked at it and read multiple discussions on your network. I understand that semantically it makes more sense to show it on the homepage, but I really think this will cost much page views."}, {"author_name": "Jacky", "gravatar_hash": "aa028d592530c0425bf0b7572d0eec14", "author_url": null, "date": "Dec 05, 2013", "message": "Hmmm. Could we be in control of the color scheme? I dont really like the black color. Seems rather inconsistent with some of the forums that have lighter color schemes like StackOverflow. I like the old light-grey more."}, {"author_name": "Elye", "gravatar_hash": "219032be97d76297476d3b4c25f8e775", "author_url": null, "date": "Dec 05, 2013", "message": "Sorry, Don't like the color"}, {"author_name": "Scot", "gravatar_hash": "27393b956c2c767aa5d271d3972c0086", "author_url": null, "date": "Dec 05, 2013", "message": "I spend _a lot_ of time on [Super User](http://superuser.com), but not much time on Meta, and I never go to blog.stackoverflow.com unless I’m directed there by a link. \nHow am I supposed to have seen this post before today?\n\nYou say,\n“Previously, if you wanted to know your reputation on every site\nyou were active on, you had to visit _every one of those sites_.” \nThat’s not true; “http://stackexchange.com/users/<i>nnnnnn</i>/<i>myname</i>?tab=accounts” has been around for a long time -- and it shows badges, too. \nIt also provides links to all the sites that you’ve joined. \nOh, you want _recent reputation changes_?"}, {"author_name": "Scot", "gravatar_hash": "27393b956c2c767aa5d271d3972c0086", "author_url": null, "date": "Dec 05, 2013", "message": "You tricked me!  Is this a Stack Overflow site or isn’t it?  If it is, why doesn’t it support markdown?  And why doesn’t it at least have instructions by the “<b>Leave a comment</b>” box documenting the formatting rules/conventions?"}, {"author_name": "Pablo", "gravatar_hash": "10468ad8d146df7dc85e4f8c51ef542e", "author_url": null, "date": "Dec 05, 2013", "message": "I like the bar except I can't go directly to the reputation tab now."}, {"author_name": "Arilaan", "gravatar_hash": "2e99be2605ef6ea1a9d741d7d6be386b", "author_url": null, "date": "Dec 05, 2013", "message": "Sorry, not a fan of the dark (dark) black. I do like that my Stack exchange sites are listed when I click on Stack Exchange, rather than a list of top questions from any sites. Maybe the Hot New Questions could be kept as a separate, additional icon. \n\nI preferred the independent look and feel the sites had before though, and think the black works best on the meta site because it is a closer match with the default font colors there. Now I feel like I'm in meta forever! Can't escape!"}, {"author_name": "Camilo Martin", "gravatar_hash": "14570e9514625800a440f40fec36ed6e", "author_url": null, "date": "Dec 05, 2013", "message": "I really like the features.\nI really hate the black."}, {"author_name": "Steven Gallagher", "gravatar_hash": "3b6533f664763eaa708b6faa848f6de1", "author_url": null, "date": "Dec 05, 2013", "message": "Don't like the black. Nope. Not at all. Love SE. Hate the color. Not racist either, it just hurts."}, {"author_name": "neminem", "gravatar_hash": "aca64a61990c7f3a4868b68063429683", "author_url": null, "date": "Dec 05, 2013", "message": "I also miss the list of hot questions from other SE sites, that was kind of fun to look at, and also agree that while black isn't bad, dark-grey-on-black is. If you're going to keep the darkness of the background, you should at least lighten the foreground items a bit (everything except the left half of the site logo - that *includes* the *right* half of the site logo). I like it other that."}, {"author_name": "concerned", "gravatar_hash": "927a8a2b768a581210ab5462ab283494", "author_url": null, "date": "Dec 05, 2013", "message": "The bar looks wrong when zoomed in on Chrome, especially the icon images look blurrier than before. This was masked much nicer on the grey background. Also I agree with the other points raised here:\n- The black is too black\n- The name is missing, why?\n- The interesting questions from other sites are gone!\n- It looks like a Bootstrap knockoff"}, {"author_name": "Person", "gravatar_hash": "e18dad97d8d08c0b848b6ba6c987099b", "author_url": null, "date": "Dec 05, 2013", "message": "Two things:\n\n- Give it a little padding (lets say 15 pixels). On EE.SE it looks like it's cutting the breadboard off. It would look not so smooshed then.\n- Please make the drop down boxes wider. It's super annoying to have to scroll through so much more because of the word wrap. Please make the drop-downs wider so we can easily/\n\nOtherwise, it's great and fresh. The black may need a little getting used to... but maybe have it black only on the logo/inbox part and have it curved on the bottom edges? That would give some unification without the \"BLACK IT BURNS!!!\" effect."}, {"author_name": "Jason", "gravatar_hash": "eccdcef378f17549482325c2051c4048", "author_url": "http://na", "date": "Dec 05, 2013", "message": "its WAY too hard on the eyes. is there no designer at Stack Exchange? It's hard to read, and the dark font on dark background is horrible. If you are going to stick to dark and dark theme, font size must be much larger at least."}, {"author_name": "Alec", "gravatar_hash": "6c9ad74e5d192e2207eb5008e6af8224", "author_url": null, "date": "Dec 05, 2013", "message": "It's a bit better now (it actually has changed though!)\n\nI'd love my username to be shown BTW"}, {"author_name": "Evgeni", "gravatar_hash": "bf11af111cab6e513d68e5e30762deb5", "author_url": null, "date": "Dec 05, 2013", "message": "I was hoping it was an A/B test that will go away in a couple of weeks.\n\nIs it really necessary to increase consistency across sites?\nIs it really necessary to have a bunch of utilities stand out more?\n\nThe price to pay is aesthetics, and that's the main reason I started typing answers into this site rather than some of the other similar forums..."}, {"author_name": "მამუკა ჯიბლაძე", "gravatar_hash": "8e694b597646b8c8a99c1d258baa2633", "author_url": "http://mathoverflow.net", "date": "Dec 05, 2013", "message": "Functionality is good. Color is too taste-specific. For example I certainly prefer white. And I cannot think of any functionality-related reason for making it black."}, {"author_name": "Tobberoth", "gravatar_hash": "b97dddaa7e8981b40170c738c939ee2e", "author_url": null, "date": "Dec 06, 2013", "message": "I can't believe how weak eyes some people commenting here have. It hurts your eyes? It's hard to read? Are you guys kidding me? You need glasses, not a redesign.\n\nThe bar looks fine, it makes perfect sense that it stands out in contrast with the page since it has unique functionality relating to the stackexchange network."}, {"author_name": "Stéphane Bruckert", "gravatar_hash": "aa56a00a9f9ee1f6a72376071da280f0", "author_url": "http://www.stephanebruckert.com", "date": "Dec 06, 2013", "message": "Got used to the last one, will have to get used to the new one."}, {"author_name": "GriffinEvo", "gravatar_hash": "f428e03b88c120a3bf6c69a84925f222", "author_url": null, "date": "Dec 06, 2013", "message": "Would be better in my opinion if it at least differed between the main page and the meta - switching between the two in biology SE is not exactly a clear difference in the page colours and styles."}, {"author_name": "tharun", "gravatar_hash": "1968979a5ceeb648c1d2400f3f810149", "author_url": null, "date": "Dec 06, 2013", "message": "The black isn’t so nice."}, {"author_name": "himselfv", "gravatar_hash": "d1d9c0113195fe1984fe535393854e8d", "author_url": null, "date": "Dec 06, 2013", "message": "+1 against black."}, {"author_name": "sp00m", "gravatar_hash": "2e4cac4331c2f387124ee2062cc311b0", "author_url": "http://christophe-maillard.com", "date": "Dec 06, 2013", "message": "I find it nice! Good job guys, back to black ;)"}, {"author_name": "Boris", "gravatar_hash": "48a72c0412f8e1bf83d5d87947b4a1ca", "author_url": null, "date": "Dec 06, 2013", "message": "I remember google once had the same black thing, but they have put it down very quickly. Did you hire heir job-less designerm"}, {"author_name": "Euclides Mulémbwè", "gravatar_hash": "531a1e978a54ffbbd0e5db8e256fba83", "author_url": null, "date": "Dec 06, 2013", "message": "Looks great..."}, {"author_name": "Euclides Mulémbwè", "gravatar_hash": "531a1e978a54ffbbd0e5db8e256fba83", "author_url": null, "date": "Dec 06, 2013", "message": "Looks great, easy to use..."}, {"author_name": "Hafiz", "gravatar_hash": "81b7a4e882aab61fcd6d30c03b155b3b", "author_url": "http://kaasibtech.com", "date": "Dec 06, 2013", "message": "look and feel: Icons e.t.c. are better, but I suggest that color should remain grey, that is much more readable and non-disturbing."}, {"author_name": "S List", "gravatar_hash": "902d344133e1ff7290d8a572ccbecd83", "author_url": null, "date": "Dec 06, 2013", "message": "Not sure why a black bar should make my eyes hurt, but it does.  Maybe it's all the blinding white surrounding it.  I feel as though I'm peering through a letter box into a pitch black room."}, {"author_name": "FastTrack", "gravatar_hash": "70355d1dfce4010d570f265a3a0e2c46", "author_url": null, "date": "Dec 06, 2013", "message": "Seriously guys, the black bar really looks bad... Don't you have any designers or are you all programmers?"}, {"author_name": "Christian", "gravatar_hash": "83f70a25385692165ac67f3cde4519b1", "author_url": null, "date": "Dec 06, 2013", "message": "The color is very distracting, does not look good and takes the focus away."}, {"author_name": "sam", "gravatar_hash": "e2c87d748e27e20891c0cb50ff7c1ec3", "author_url": null, "date": "Dec 06, 2013", "message": "Good functionality and i like how the menu's look, but in my opinion main links shouldn't be in a dark colour on a dark background..."}, {"author_name": "Fardjad", "gravatar_hash": "4ad1c6176652d437e0fadb39ff275323", "author_url": null, "date": "Dec 06, 2013", "message": "The black bar looks distracting..."}, {"author_name": "Denis", "gravatar_hash": "cbd7e425787691c8ec475b7eb3db470d", "author_url": null, "date": "Dec 06, 2013", "message": "The new bar is nice. +1 to bringing back hot questions, though."}, {"author_name": "kostja", "gravatar_hash": "836346d20b57c617791aaa063fe8313d", "author_url": null, "date": "Dec 06, 2013", "message": "Love the new functionality, don't like the color. \n\nPlease please, can we have the old color settings as an option?"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Dec 06, 2013", "message": "I'm not particularly fond of the black, but then, it's probably the only sane choice seeing as there are dozens of different Stack Exchange with dozens of different colour themes and the goal was to have the same bar for the lot of them. \n\nThere are more pressing issues on the Network that need taking care of than the colour of the top bar or the number of clicks required to reach a feature."}, {"author_name": "Izzy", "gravatar_hash": "e2b29bd68eb03763a0e18c691ecf9fa5", "author_url": null, "date": "Dec 06, 2013", "message": "I didn't know black is the only neutral color. White is neutral. Gray is neutral. And there are many different shades of gray..."}, {"author_name": "e-sushi", "gravatar_hash": "7b0b1f0c80b17abb9b5daece7d94b1c8", "author_url": "http://stackexchange.com/users/2782207/e-sushi", "date": "Dec 06, 2013", "message": "3 words: “I love it!”"}, {"author_name": "Sridhar Sarnobat", "gravatar_hash": "d41a2395acf5a5fdb979702ca5fb9056", "author_url": "http://www.rohidekar.com", "date": "Dec 06, 2013", "message": "I also think it's too much of a contrast. It's hard work for the eyes to go from one to the other."}, {"author_name": "ruocaled", "gravatar_hash": "76c3dfb06510316c72c2a03731872fc0", "author_url": null, "date": "Dec 06, 2013", "message": "Too dark it's very distracting from the main content. Google tried that and the feedback was not good so they rolled back to white/gray. Don't make the same mistake."}, {"author_name": "kaleissin", "gravatar_hash": "88bb2d5fc7f38e2154315bbdff300298", "author_url": null, "date": "Dec 06, 2013", "message": "Many dark avatars (like mine) won't look good on the bar, be it black or dark grey. Besides, I don't recognize the avatar but the username, and so have to make a double take every time I scroll up: \"Hey, I thought I was logged in? Oh.\""}, {"author_name": "Jason Gill", "gravatar_hash": "ecfd9f9e4ad1d98118f30563b31d1b8a", "author_url": "http://www.gillumiante.com", "date": "Dec 06, 2013", "message": "I was openly mocked for suggesting the grey color blended too much with browser chrome and was hard to notice. And yet, here we are..."}, {"author_name": "A Sch", "gravatar_hash": "923ffe377830e2599bb60d255b2b0f02", "author_url": "http://stackoverflow.com/users/1113023/meetamit", "date": "Dec 06, 2013", "message": "It was nice how clicking on one's score used to link directly to the reputation tab of the profile page. Easy to bring that back, no?\n\nAnd yeah... very dark header with rather dark text on very bright bg is not cutting it. It grew on me a bit, but not enough."}, {"author_name": "Leo Prince", "gravatar_hash": "30dfb36785ab609cd63998c6dd47b281", "author_url": null, "date": "Dec 06, 2013", "message": "Cool.. :)"}, {"author_name": "RSW", "gravatar_hash": "0d910ac1804615a41af627c45de79862", "author_url": null, "date": "Dec 06, 2013", "message": "Ughhh! I commented yesterday on my dislike for the new black bar...but haven't been back on since then. I just jumped back on SO again today to get a problem solved and...oh man...I...CAN'T...STOP...LOOKING...AT........THAT...BLACK...BAR!!! AHHHHHHHHHHHH!!!!!! MAKE IT GO AWAY!!!!! AHHHHHHHHH!!!! I JUST NEED TO GET MY ANSWER AND BE ON MY WAY!!!! AHHHHHHH IT'S SUCKING ME INTO IT'S VORTEXXXXX!!!! AAAAHHHHhhhhhhhhh........."}, {"author_name": "RSW", "gravatar_hash": "0d910ac1804615a41af627c45de79862", "author_url": null, "date": "Dec 06, 2013", "message": "Oh...wow...what is this place?...\n\nSo strange here...somehow familiar...\n\nLast I knew this horrendous black hole at the top of SO was sucking me in...now I'm here....but WHERE is this?\n\n(musing plays softly in the background...\"Welcome back, welcome back to Expert Sex Change...oh how we've missed you old friends...)\n\nNo!!!! The BLACK BAR WAS ALL A SECRET PLOT BY INFILTRATORS....AHHHHHHH!!!! get me out of this HELLLLLLLLLLllllll!!!!!"}, {"author_name": "Jo", "gravatar_hash": "68a667d8e405c7140c68268fea988b98", "author_url": null, "date": "Dec 06, 2013", "message": "Hate it."}, {"author_name": "RNVP", "gravatar_hash": "daa8c884535e0753c79fac503f27312c", "author_url": null, "date": "Dec 06, 2013", "message": "Please add\n\nhttp://meta.stackoverflow.com/questions/210041/gallery-of-custom-styles-and-or-scripts-for-the-top-bar\n\nto the entry above!"}, {"author_name": "A. Donda", "gravatar_hash": "86c8ffa163d44192ee9b608b4e1213ab", "author_url": null, "date": "Dec 06, 2013", "message": "love it, much better than the old bar!"}, {"author_name": "Jessica Brown", "gravatar_hash": "13c48d7064b44515bfb90144096b54b2", "author_url": null, "date": "Dec 06, 2013", "message": "Feature-wise the new bar is great. But the black is just too much contrast and hard to read next to the nearly white page. Please reconsider the colors or give an option to override with a user-preference"}, {"author_name": "Jessica Brown", "gravatar_hash": "13c48d7064b44515bfb90144096b54b2", "author_url": null, "date": "Dec 06, 2013", "message": "Oh, and please bring the username back on the bar. The avatar does not give me confidence that I'm logged into the account I think I am."}, {"author_name": "Khushal Khan", "gravatar_hash": "af2f01d564c7faff56395e51433dcd4d", "author_url": "http://ekwinox.com", "date": "Dec 07, 2013", "message": "I think its good because all Q&amp;A sites somehow seems at one place"}, {"author_name": "Sohil Memon", "gravatar_hash": "c7d8048d0f5184a1800b787126c61bfc", "author_url": "http://www.idroidspace.com", "date": "Dec 07, 2013", "message": "Ah ha! Looking more creative than the previous one. Choosing blue color is too awesome!"}, {"author_name": "Cristi", "gravatar_hash": "fab993cb48ce680ae29bf447f0586e6a", "author_url": null, "date": "Dec 07, 2013", "message": "Waaaay tooo black for me... very hard to read!"}, {"author_name": "Peteson", "gravatar_hash": "fcd0c29758dc76d7d4175fca8c5eae81", "author_url": null, "date": "Dec 07, 2013", "message": "I miss my username... and I too dislike the new black. Can you implement a color wheel of sorts and let the users pick their own colors?\n\nSome websites have two themes (dark / light) and let the users decide... just do this for the bar and we will rejoice. yay."}, {"author_name": "kahouli", "gravatar_hash": "e94062110cb64fe760c3e2a2c838331c", "author_url": "http://tkahouli.blogspot.com/", "date": "Dec 07, 2013", "message": "Can you implement a color wheel of sorts and let the users pick their own colors?"}, {"author_name": "Alec Teal", "gravatar_hash": "6c9ad74e5d192e2207eb5008e6af8224", "author_url": null, "date": "Dec 08, 2013", "message": "I still find tabs with the old stackoverflow bar, and it was MUCH nicer! PLEASE PLEASE bring it back."}, {"author_name": "sqageek", "gravatar_hash": "fa4e7006ddb359d997d2788e2e46ecad", "author_url": "http://www.sqageek.com", "date": "Dec 08, 2013", "message": "Looking good."}, {"author_name": "Motti", "gravatar_hash": "6183c6f9d621a125cd3aa0f7ae324285", "author_url": "http://lanzkron.wordpress.com", "date": "Dec 09, 2013", "message": "Any chance on allowing third party sites to embed this \"flare\" like? I would like to add the top bar to my private home page."}, {"author_name": "Ben-G", "gravatar_hash": "de23af005c790b22f8ce4d201e6ca027", "author_url": null, "date": "Dec 09, 2013", "message": "Dislike black, very difficult to look at. Preferred grey a lot."}, {"author_name": "Lucian", "gravatar_hash": "c58498f6e687e2ebda680abd0e4e1d8e", "author_url": null, "date": "Dec 10, 2013", "message": "The functionality of the menu is really nice, but the black gives the sensation of \"lack of inspiration\". Seriously, it seems that the black color was put there by a programmer that does not care much about the graphic identity, not by a web designer. \n\nWhile I understand that black is neutral and can be used on all stackexchage sites to give a sense of \"unity\" I think it achieves an important, undesired side-effect: its strong, it's obtrusive and it calls for too much attention than it deserves.\n\nI'm sure you are expecting some negative feedback on such a big UI change (we all know users are not big fans of changes at first), but from my sincere point of view I could never get used to the black thing, in the very same way I hated every moment the famous Google Black bar (with happily is now fixed)."}, {"author_name": "Eduardo", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": "http://www.bizcacha.com", "date": "Dec 10, 2013", "message": "+1000 Lucian."}, {"author_name": "Izzy", "gravatar_hash": "e2b29bd68eb03763a0e18c691ecf9fa5", "author_url": null, "date": "Dec 10, 2013", "message": "It was already said before, but today I found myself in that situation multiple times: the notifications for the review queue (especially \"pending edits\") is strongly missing! That might not look like a big problem on large sites like SO, as there are probably always \"pending edits\" (and they rather would like a \"flashlight with a gong\" for the rare event the queue is empty). But on smaller sites, it really might pose a problem.\n\nMost of the other things I was able to work around via my own UserStyle, but this one cannot be done this way. Please, bring back those notifications rather sooner than later!\n\nBtw: Some feedback to user comments here would be nice as well. Currently it looks like this blog entry was abandoned by its author..."}, {"author_name": "Tobu", "gravatar_hash": "4f8bbcc8db2dec991759296449d8cbee", "author_url": null, "date": "Dec 11, 2013", "message": "Good things:  the bar doesn't cover up content — some Google services are getting unusable because of this.\n\nCriticism: the association bonus doesn't warrant a +100 notification every time I sign up on a stackexchange site.  Consider those points part of the base score."}, {"author_name": "Tobu", "gravatar_hash": "4f8bbcc8db2dec991759296449d8cbee", "author_url": null, "date": "Dec 11, 2013", "message": "Oh, and the bar isn't enabled on the http://stackexchange.com/ domain itself."}, {"author_name": "Manav", "gravatar_hash": "6232eecfd05cb56654ba3a8faae414f6", "author_url": null, "date": "Dec 18, 2013", "message": "I tried living with it for a few days. Nope, it's just too obtrusive and ugly. What finally  drove me to the comment was the green on black points notifications -- they are there for an old answer, I know about them, I do not want to go and click on them to make the notification disappear.\n\ntl;dr; Too obtrusive. Doesn't seem to fit within the rest of the design."}, {"author_name": "Maxim Veksler", "gravatar_hash": "65f72e0e6bd2952959ac6aec54255ec6", "author_url": "http://iodie.com", "date": "Dec 19, 2013", "message": "The new bar color scheme is horrible. It does not communicate with the rest of the website (very pleasant) color scheme, and draws attention from the content to the upper bar for no apparent reason. \n\nBottom line, on a personal taste note - I don’t like it. Please don’t turn into expertsexchange."}, {"author_name": "Ian", "gravatar_hash": "eb91b1e453fe246b3781c55172f92df3", "author_url": null, "date": "Dec 19, 2013", "message": "I love the new bar! You're like James Cameron :D"}, {"author_name": "wik isharepoint", "gravatar_hash": "939be19810b719162b93506072bc9ee4", "author_url": "http://www.kwizcom.com", "date": "Dec 24, 2013", "message": "Functionality is considerable. Color is amazing. I don’t mind black color combination. People will get used to it."}]}