{"response": [{"author_name": "Jeremy", "gravatar_hash": "e0f502a6b3a7c216b85ed88d3d0b2799", "author_url": "http://AppointmentsBook.com", "date": "Mar 08, 2013", "message": "Shog9 Great blog! I've linked it to this question: http://meta.stackoverflow.com/questions/160611/is-10k-reputation-the-same-as-it-used-to-be/160629 Cheers! Keep up the fantastic work:)"}, {"author_name": "joequincy", "gravatar_hash": "132945386d6e620930153d756b1e4f2b", "author_url": null, "date": "Mar 08, 2013", "message": "Sheesh OCTOBER. Attention seeking much?\n\nGlad to see so many of the nominees coming forward with extensive experience and good karma on their records. I have a good feeling that this next wave of Mods will fit right in with the excellent existing crew."}, {"author_name": "Vladimir Kocjancic", "gravatar_hash": "64233179059df37d653061e2bcee9ff8", "author_url": "https://www.lotushints.com", "date": "Mar 09, 2013", "message": "You have to look this from strictly users POV. Why should a user care or select who the moderator is? Does a user know any of the candidates and would he/she be able to make a right decision? My guess is no. And since, I as a user don't know who are all those people behind user names, I can only make a decision based on their reputation. Hence, users with high reputation ratings will be elected in which case, you could also write a program to scour the list of all users, sort it by ranking and select top bunch. And on the plus side, users won't be bothered with it."}, {"author_name": "AshRj", "gravatar_hash": "909aa23f4e7adfa2519ac2697fda6f30", "author_url": null, "date": "Mar 09, 2013", "message": "Maybe its just me, but CAPITALIZED blog headers are a pain to read, especially in the community bulletin."}, {"author_name": "sujay kumar banerjee", "gravatar_hash": "a6cd12096335c3702086a4181f7981a0", "author_url": "http://sujay.kumarbanerjee@yahoo.com", "date": "Mar 09, 2013", "message": "i sujay kumar banerjee and today i present here"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Mar 09, 2013", "message": "@Vladimir: while reputation definitely has a pretty big influence on voting, it's not true that the folks who get elected are always the folks with the most rep. \n\nIndeed, the whole point of all of this pageantry is to give folks a chance to express their opinions on what they want to see from the moderators. IMHO, that's worth the occasional hassle."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.billthelizard.com", "date": "Mar 09, 2013", "message": "Vladmir said:\n\n\"And since, I as a user don’t know who are all those people behind user names, I can only make a decision based on their reputation.  Hence, users with high reputation ratings will be elected in which case, you could also write a program to scour the list of all users, sort it by ranking and select top bunch.\"\n\nIf you look at the election page, you can see each user's Meta participation history and their flagging history right on that page.  You also have a link to their profile, where you can see practically every action they've ever taken on the site (except for the deleted ones, in most cases).  You have a *lot* more information about these folks than just their reputation."}, {"author_name": "Donal Fellows", "gravatar_hash": "965220a70d38e6a29466f44cdb4f804e", "author_url": null, "date": "Mar 10, 2013", "message": "@Vladimir By contrast, I tend to vote for people who I believe — on the basis of their statements and activity — have a theory of moderation most closely aligned to what I believe it should be. The part I don't look at (well, not much) is the reputation. That's in many ways a function of which tags they are active in, not how much good they are doing. Some tags don't get quite the love they deserve.\n\nThat said, those with a very high reputation are often very well versed in what the spirit of Stack Overflow is, and what role a moderator has. Yet for all that, I think you'll find that the more telling statistics are actually the other ones listed (meta participation, helpful flags). The silly thing is I'd do fairly badly at those things because I don't actively search for things to flag or spend much time on meta, but then again I'm not standing for election. (I just cannot give the commitment without giving up on shepherding my favorite tags, which I do because of what I feel I owe to the community they represent. That's my perspective; you can listen or ignore as you see fit.)\n\nRead the pitches that they put forward. Look at the statistics and history of activity. Make your own mind up on who will be the kind of moderator you most want. Only then vote. Or don't, if none of the candidates convince you. It's only a silver badge…"}, {"author_name": "msh210", "gravatar_hash": "78a50094ca87aaed01e076f4c8808ed8", "author_url": "http://judaism.stackexchange.com/users/170/msh210", "date": "Mar 10, 2013", "message": "Now that every blog post is advertised on every Stack Exchange site's every page (in the \"Community Bulletin\"), it is less reasonable then ever to have posts that relate to one site only, even if it is the flagship. I daresay most people -- even the vast majority -- who see this blog post advertised don't use Stack Overflow on anything like a regular basis, care not a whit about who the moderators will be, and have no knowledge of the site mores to properly cast an informed vote."}]}