{"response": [{"author_name": "Jonathan Leffler", "gravatar_hash": "7d0d66b076e3bc70819e50f8a25af8df", "author_url": "http://what'sawebsite?", "date": "Mar 18, 2013", "message": "Funny seeing an invitation to vote in the SO moderator election; I though that was over a week or so ago."}, {"author_name": "a person", "gravatar_hash": "649e6961e8061fc7bc6f965fd23b1ea8", "author_url": null, "date": "Mar 19, 2013", "message": "Would be super sweet to have time links in front of each topic in the list."}, {"author_name": "nadrimajstor", "gravatar_hash": "ff802135d161b3c16a669c28a3bb7239", "author_url": null, "date": "Mar 19, 2013", "message": "I'm still listening. :D"}, {"author_name": "Curious George", "gravatar_hash": "eb8397aa323894b79d0642db18734cf7", "author_url": null, "date": "Mar 19, 2013", "message": "They should have asked Mr. Lippert why he voted down 400 times and only voted up 1 time. What was good enough to deserve an upvote from the Eric himself?"}, {"author_name": "Pops", "gravatar_hash": "530739b407ba3f54e28de67fa4de4230", "author_url": null, "date": "Mar 19, 2013", "message": "@Curious George: \"I was trying to clear a downvote after an edit and accidentally turned it into an upvote.\" –Eric Lippert, 27 Mar 2012 (http://meta.stackoverflow.com/questions/127039/what-is-the-lowest-up-down-vote-ratio-and-what-is-the-average#comment345178_127040)"}, {"author_name": "gaijintendo", "gravatar_hash": "918b215b804b7dbf8e343398fde0909c", "author_url": null, "date": "Mar 19, 2013", "message": "Does Soundcloud do deep linking? It seems to need to download the whole audio track to allow you to reach a point in time. No seeking. I can add these as comments if that is helpful.\n\n 4:00 - Eric joined Microsoft right out of college and was originally working on VB\n\n\n 6:24 - It’s time for everyone’s favorite game: Name the Worst Feature of that Microsoft Technology!\n\n\n~7:45 - If you’re a non-programmer and still listening, make sure to email us for your free prize\n\n\n22:00 - Eric now builds “static analysis” programs which actually means something real when he’s talking about it\n\n28:25 - We actually have some listener questions this week!\n\n28:51 - First up – what problems with C# would Eric fix with magical genie powers? (first at 30:00)\n\n31:27 - But wait, there’s a second one he wants to change too!\n\n42:12 - David has some interesting stuff to talk about! Make sure to check out Sustainable Living\n\n44:14 - Check out the meta question (its a problem we have to deal with a lot): Lots of not-always-useful but well-intentioned answers\n\n49:45 - A public service announcement: please don’t forget how to dog"}, {"author_name": "ericlippert", "gravatar_hash": "6fbdff3ffb6f111d172759b4f05bea0e", "author_url": "http://ericlippert.com", "date": "Mar 19, 2013", "message": "@CuriousGeorge: 400 downvotes is a tiny number compared to the hundreds of thousands of questions and answers I've read. I add value in ways other than upvoting."}, {"author_name": "ericlippert", "gravatar_hash": "6fbdff3ffb6f111d172759b4f05bea0e", "author_url": "http://ericlippert.com", "date": "Mar 19, 2013", "message": "Thanks to Joel, David, Jay and Alex for having me on the podcast; I had a great time. I've posted some supplemental links to articles on the topics we discuss, here: http://ericlippert.com/2013/03/19/keeping-it-sharp/"}, {"author_name": "Radu Murzea", "gravatar_hash": "7045d2574ce2f38a399636534356e14c", "author_url": null, "date": "Mar 19, 2013", "message": "Sooo... I took a look at Eric Lippert profile on StackOverflow and I found something interesting: in the 4 years in which he answered over 2000 questions, he upvoted 1 single time (!!). Just 1 upvote. Really interesting...\n\nAwesome reputation, though :D ."}, {"author_name": "Radu Murzea", "gravatar_hash": "7045d2574ce2f38a399636534356e14c", "author_url": null, "date": "Mar 19, 2013", "message": "Hmmm... didn't see that this came up earlier in the comments :)"}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Mar 19, 2013", "message": "Someone in the podcast says you join Stack Overflow because you:\n- Genuinely want to help people\n- Want to show off how smart you are\n\nI don't think that's true.  The people that you want to help, or that you want to know how smart you are, are not always on Stack Overflow.\n\nInstead, I think most people join Stack Overflow because they want to get better at something.\n\nThat's why duplicates are a good thing: they help new people get better.  It's silly for old people to close questions that were valid when they were new.  Just because the old guard has enjoyed the learning experience doesn't mean the new guard shouldn't."}, {"author_name": "michalb_cz", "gravatar_hash": "7a9290e3044aeb59f8557db1023fc55f", "author_url": null, "date": "Mar 20, 2013", "message": "Thanks for the great podcast. Is there any transcription? \n\nI come back to this podcast after a loooong time, but I vaguely remember that every podcast had official transcription (which is absolutely cool for non-natives/english learners)."}, {"author_name": "Tshepang Lekhonkhobe", "gravatar_hash": "88e60659e997d36af3ff348b3251e1a6", "author_url": "http://tshepang.net", "date": "Mar 20, 2013", "message": "The experience of the whole thing was lessened by the constant distractions (and unfunny jokes). Hearing from Eric was engaging enough to reduce talking about admin stuff (especially in the last several minutes when Eric was kinda ignored). I do, however, appreciate the promotion of Sustainability site (currently having a shocking 60 visits/day).\n\nI rarely listen to these podcasts, so I can't tell if it is normal that the main guest doesn't get to talk as much as I hope. Maybe it's the case that Eric is really here for the Answering, and not much interested in how the site is ran?\n\nIn summary, I wanted more Eric, and less ."}, {"author_name": "Tshepang Lekhonkhobe", "gravatar_hash": "88e60659e997d36af3ff348b3251e1a6", "author_url": "http://tshepang.net", "date": "Mar 20, 2013", "message": "(that should have been less \"other guys\"; the text disappeared because of putting it in angle brackets)"}, {"author_name": "Rifaj", "gravatar_hash": "cbb33394e229c3acca54db6ab3dfcada", "author_url": null, "date": "Mar 21, 2013", "message": "Interesting.."}, {"author_name": "Kırıkkale Web Tasarım", "gravatar_hash": "a3b0fa7ea1efa6d9903495dc60cd5066", "author_url": "http://www.kirikkalebilisim.com", "date": "Mar 22, 2013", "message": "Thanks."}, {"author_name": "Nicolas Raoul", "gravatar_hash": "c3af87f6b1d4d247d01ce3b73d918fc7", "author_url": "http://nrw.free.fr", "date": "Mar 28, 2013", "message": "Another reason: content is licensed Creative Commons, so answering benefits not only a company or person. It is more universal, a bit like editing Wikipedia.\n\nAlso, on QA sites where I have less than 500 points and feel that I could be in a situation where I really need an answer, getting the potential to grant bounties is a motivation."}, {"author_name": "Jim Lawruk", "gravatar_hash": "23ed258730d5bc9526140ee261b2bea3", "author_url": "http://www.lawruk.com", "date": "Apr 01, 2013", "message": "This was surely one of the better podcasts. The language discussion was super interesting. Eric, we hope you can come back to the podcast soon."}]}