{"response": [{"author_name": "PJ", "gravatar_hash": "e1a9bed3bf6ee54cf86f952c87059afc", "author_url": null, "date": "Jul 08, 2011", "message": "What about Central US?  We enjoyed seeing you here in Austin, and even Dallas isn't too far away... Denver/Boulder would be nice excuses to get someplace cooler for a few days, too.\n\nI guess we're just in 'flyover' country."}, {"author_name": "JH", "gravatar_hash": "56217ee0cb1fc7a94a70a11794f2fe7e", "author_url": null, "date": "Jul 08, 2011", "message": "I agree with you PJ.  Second year in row Chicago got snub.  Even though it's home of a little web site called GroupOn.  Dev meetup scene is pretty strong here. But I guess we are just chop liver over here."}, {"author_name": "Octavian Damiean", "gravatar_hash": "32d851b22e4659bca3a94b6286cada76", "author_url": null, "date": "Jul 08, 2011", "message": "You also have a remote developer living in Germany. ;)"}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": null, "date": "Jul 08, 2011", "message": "I hope that the next round can touch down somewhere in Asia, perhaps Singapore or Hong Kong? I was hoping to try and get to Australia, but I'm not sure it's going to be possible."}, {"author_name": "ivantod", "gravatar_hash": "263270eb36dc1f3d462ec30ae732648d", "author_url": null, "date": "Jul 09, 2011", "message": "Well you clearly didn't consider the European users as much as you should have because one of the biggest (if not the biggest) European Java conferences, Devoxx 2011 is also starting on the same date, 14 November which makes it impossible to attend both.\n\nBut knowing the attitude of the SO DevDays organisers towards Java, perhaps you did and this is deliberate.\n\nThose in Europe and who are primarily interested in Java would do good to check out Devoxx instead as their price for 2 days is not substantially different but includes a few more things such as access to video recordings of all sessions post-conference.\n\nDisclaimer: I am not in any way affiliated with Devoxx."}]}