{"response": [{"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jul 27, 2011", "message": "Instead of this post, change area51 so the stats are \"not so freightining\".  I was checking up on gardenining the other day and the area51 stats are very concerning.  Change it so you don't have to make posts like this.  In essence, your post is basically saying \"Ya we know your beta site is worrying but dont worry about it...\" Ok if you don't want me to worry change the stats so they aren't bold, red and telling me to be \"worried\"."}, {"author_name": "Robert Cartaino", "gravatar_hash": "9dfd656461a1d0a2db33f3ed4183f4c0", "author_url": "http://stackoverflow.com/users/98786/robert-cartaino", "date": "Jul 27, 2011", "message": "> if you don’t want me to worry change the stats so they aren’t bold, red and telling me to be “worried”.\n\n@JonH -- Indeed, that's the next step. Even after we make the cosmetic changes so not to look so foreboding, users will still have the inevitable question as to \"when?\"... So I put this blog post together to provide an interim step between now and coming up with those \"when\" statistics."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jul 27, 2011", "message": "Sounds reasonable.  Thanks"}, {"author_name": "Cerberus", "gravatar_hash": "6b81eca9fe11d9a8d01394c28ed5f4e8", "author_url": "http://paleografie.tk", "date": "Sep 18, 2011", "message": "It's good to hear that closing a site doesn't depend on those stats so much! I never knew that.\n\nYou might also consider linking from the stats page to this blog, in addition to the cosmetic changes."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Oct 07, 2011", "message": "It looks like some progress has been made on making the statistics less \"Worrying\", but I think the presentation still \"Needs Work\".  One helpful hint is to move the  statistics that usually get to \"Excellent\" early in the process (Answered % and Answers/Questions) to the top of the list and X/day stats (which won't look good until the site nears launch) to the bottom of the list.  \n\nAnother hint would be to separate statistics between ones that users can address via asking, answering and voting from those that are out of our control (basically traffic).  That way we won't be as tempted to artificially boost the numbers.\n\nFinally, I'd like to see the graph of these stats over time.  Its not such a freak-out experience to see visits slowly climbing over time as it is to see that our visits are \"only\" 211 per day or whatever."}, {"author_name": "awe", "gravatar_hash": "bb430dc40c4648586562d2ef22c8557b", "author_url": null, "date": "Mar 14, 2012", "message": "Jon: You say that \"traffic\" is out of our control - well, not really. You can do \"adverticing\" by sharing links for interresting questions to people you think might be interrested, or on fora that have potential users."}]}