{"response": [{"author_name": "Lri", "gravatar_hash": "16bbc7f782efd1c489a0d0d9e6075291", "author_url": "http://www.lri.me", "date": "Jul 11, 2011", "message": "So now you can see the question and other answers when editing, and there's an easy way to get back to the question's page when editing a question. Great.\n\nFor me the biggest barrier to editing posts is that it would bump the question and likely increase noise on the lists of active questions."}, {"author_name": "Michael Kohne", "gravatar_hash": "267cfaf8c1f76da3d8b3c7576a903613", "author_url": null, "date": "Jul 11, 2011", "message": "Nicely done! If you want more anonymous&amp;low rep edits, I suggest you extend this to everyone, but no matter what - nice job!"}, {"author_name": "Jesse Gavin", "gravatar_hash": "09e59b0f8ac4ce9f50db49dc35cedb17", "author_url": "http://codegavin.com", "date": "Jul 11, 2011", "message": "This makes me very happy because nearly every time I would  an edit in the past, I would have to open a new window so that I could have the original page side-by-side for reference."}, {"author_name": "Graeme", "gravatar_hash": "2fcdc79d20203f12b3bdd7723de5a6f1", "author_url": "http://cutthechatter.com", "date": "Jul 11, 2011", "message": "One gotcha - after editing a question, I accidentally clicked on one of the tags rather than \"Save edits\", which took me to a different page. Clicking \"back\" took me back to the question page, but my edits were lost. I know it was my own fault and you can only do so much to prevent people making mistakes, but just a warning to others."}, {"author_name": "Trufa", "gravatar_hash": "b685494fc3e6341655360971b1178e0d", "author_url": null, "date": "Jul 11, 2011", "message": "Very, very useful feature! Thanks!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 11, 2011", "message": "@graeme there is a javascript \"you've started editing a post, are you sure you want to leave?\" dialog block if you actually enter content, and has been for a while. Can you repro that? And if so on what browser?"}, {"author_name": "Jonathan Sampson", "gravatar_hash": "a84a8714fd33f6676743f9734a824feb", "author_url": "http://sampsonblog.com", "date": "Jul 11, 2011", "message": "Nice work, SE Team! Much better than the crude GreaseMonkey script I had worked up in the past to do this. You guys never cease to amaze me! Keep up the fantastic work."}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Jul 11, 2011", "message": "Pretty much all edits I've seen deal with language, code formatting, or broken hyperlinks.  It is hard to see how such edits keep old answers relevant.\n\nUnlike Wikipedia, were articles are continuously improved, older Stack Overflow questions are dead.  They're logs of past conversations between developers. They're useful, but they do not reflect contemporary knowledge."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 11, 2011", "message": "@andomar that is true of <i>some</i> questions, but other more highly trafficked questions do indeed get updated and refreshed over time.\n\nRemember too that anonymous users can submit edits and corrections at any time, as of a few months ago:\n\nhttp://blog.stackoverflow.com/2011/02/suggested-edits-and-edit-review/"}, {"author_name": "Joey", "gravatar_hash": "d54ed51c0f03cb461741c3ec77a837b2", "author_url": null, "date": "Jul 11, 2011", "message": "So, for newly posted questions the likelyhood of edit wars increases now since it's even easier to edit quickly? :-)"}, {"author_name": "Waldir", "gravatar_hash": "d04d5b6e71776eb13d195ba7cc94b995", "author_url": null, "date": "Jul 12, 2011", "message": "Has anyone done some statistics to evaluate the acceptance rate of edits by non-editor users (&lt;2000 rep) according to their rep? I would guess that the threshold of virtually 100% constructive/accepted edits is hit way before 2000 rep., so perhaps this limit could be lowered which would greatly reduce editing overhead (and, as Wikipedia&#039;s success demonstrates, enhance participation through the mechanism of instant gratification).\n\nAnother solution that I think would be interesting to try is to make the editor privilege depend only in the number (and ratio) of accepted edits by a user, rather than their overall reputation. Does this make sense?"}, {"author_name": "FriendOfGeorge", "gravatar_hash": "3a745a3e19b10935153c203a94dd6952", "author_url": null, "date": "Jul 13, 2011", "message": "I love the inline editor."}, {"author_name": "Plato", "gravatar_hash": "932afee1556549876bb8c55a035bb1de", "author_url": null, "date": "Jul 21, 2011", "message": "Extend this to everyone!"}]}