{"response": [{"author_name": "jcolebrand", "gravatar_hash": "c4cca9bfec5d5e77f625d9fbe8e37a41", "author_url": "http://stackoverflow.com/users/109749/jcolebrand", "date": "Jul 13, 2011", "message": "$100,000,000,000 ... it's only fair that you pay your devs that much so I can ask for a marginal increase to match the average in the country that just shot up."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jul 13, 2011", "message": "Even for a developer *looking* for a job like I am, this is very interesting. Thanks for continuing to be so open about how you run things!"}, {"author_name": "Greg Bray", "gravatar_hash": "da1209aa320f9bbebbf128ac6a0751d3", "author_url": "http://blog.theg2.net", "date": "Jul 13, 2011", "message": "Great post and I love the transparency. Also remember that eventually something will get posted to sites like GlassDoor.com if your business survives long enough and it is best to not have any surprises. I recently went through a round of interviews and while the information was not completely accurate the site did come in handy for getting a feel for the company and salary range. Not as handy as my SO Resume, but interesting none the less :-P\n\nSide note: I'm in a mid-size market (Salt Lake City) and got two competitive offers after applying to about a dozen jobs. One was from a position I found on Careers.StackOverflow.com that scored very high on the Joel test, but I decided to accept the other position since it was at a \"top 5 global brands\" company and in an industry I was actively perusing. I'm a bit surprised they hadn't even thought of posting the position on the Careers site. Sounds like your sales staff need to work more on selling to the \"big boys\"."}, {"author_name": "Adam", "gravatar_hash": "f0eb53c993d09b1135375938f9727c28", "author_url": null, "date": "Jul 13, 2011", "message": "I appreciate the last category in your chart:\n\nI used to be able to whistle the frequency to make a friends modem think I was a 300 baud modem, thus issuing a \"CONNECT\\r\\n\"."}, {"author_name": "dd", "gravatar_hash": "a65ecbb7d583a75511cff7d78dd7d6e7", "author_url": null, "date": "Jul 13, 2011", "message": "Anyone who has dedicated enough time to master the lost art of modem whistling should be able to name their own salary."}, {"author_name": "Jonathan Sampson", "gravatar_hash": "a84a8714fd33f6676743f9734a824feb", "author_url": "http://sampsonblog.com", "date": "Jul 13, 2011", "message": "In a world where many developers I know are over-worked and under-paid, it's nice to see a company that takes care of their developers. Unfortunately it doesn't appear to be common sense that if you give your team the best, and show them you care, they perform better and produce more reliable work (generally speaking). Keep up the great work, SE team."}, {"author_name": "Jeremy", "gravatar_hash": "07241e516711a772da746cfb2e0bc637", "author_url": null, "date": "Jul 13, 2011", "message": "So.. how much should you pay?"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Jul 13, 2011", "message": "Darn it, I've spent all this time developing my modem *whispering* skills.  I feel like such a fool now."}, {"author_name": "nick floyd", "gravatar_hash": "442a479739f9050d2e4aed17466e2758", "author_url": "http://archcoder.com", "date": "Jul 13, 2011", "message": "You pay them enough to keep pay off the table. You can also pay them by giving them interesting / fulfilling work to do."}, {"author_name": "Lisha Sterling", "gravatar_hash": "721c584d3cc4bc2a3862595b75653094", "author_url": null, "date": "Jul 13, 2011", "message": "\"Time spent programming before graduation\" is a STUPID rule. Seriously. Very stupid. If someone is working as a programmer in a professional environment, it doesn't matter whether they have that degree already or not. Even you put in parentheses \"if they went to college\". So, what if your employee has been working for you for 10 years and then decides to go get a BS in CS because they have decided that they want to do some academic world research, and maybe expand their horizons... are you going to change their salary back down to a \"just graduated\" salary after they finish that BS? Of course not!!\n\nI wrote software to put myself through college, got degrees in Latin American Studies and Migration Studies, and then realized that I didn't want to live in poverty long enough to get my PhD, so I went on working as a programmer. One potential employer at that point tried to pay me as an inexperienced programmer because I'd just graduated. Another looked at the work I'd actually been doing and offered me a salary based on the experience I really had. You don't have to guess which job I took."}, {"author_name": "Eric Means", "gravatar_hash": "551a00c7fe65373fabbd74cfeda448c8", "author_url": null, "date": "Jul 13, 2011", "message": "Rule #1 of establishing programmer pay rates should be, \"Do not put levels on the evaluation scale that cannot be achieved\".\n\nIf the scale goes from 1-5, and you don't have any 5s in your organization, either your organization or your scale is fucked.\n\nThe last two companies I worked for eventually admitted (in roundabout ways) that despite there being a 5 on the scale, it was for all practical purposes impossible to actually achieve a 5, because then you would have \"nothing to aspire to\".\n\nThat will trip a programmer's BS alarm instantly, and it was a major contributor to my leaving both organizations. If I'm a 5 -- and I know if I am -- and you rate me a 4, it doesn't matter if you pay me 10% above the \"market average\", because I *know that average is based on false premises* and you're cheating me out of something I have worked hard to earn; neither is good for you."}, {"author_name": "Tim", "gravatar_hash": "b57ac1826087035b951a24a3bfa5c0d4", "author_url": null, "date": "Jul 13, 2011", "message": "There is another system that works very well:\nEvery employees salaries are completely public.  In addition to this, employees set their own salary.\n\nThis has been shown to have three effects:\n1.  People tend to actually value themselves lower than they might otherwise outside.\n2.  General happiness is higher.\n3.  People who are earning too much feel guilty, and either work harder or don't raise their salaries.  They're also expected to perform at that level.  If someone sets their salary 5k higher than the guy next to them who churns out the same amount of code but has 1/3rd the defects (and that were the only difference), then questions would be asked.\n\nIt's an interesting system which I wish more places used."}, {"author_name": "Tobias", "gravatar_hash": "435492f211c16769668457fde25bbc0f", "author_url": "http://tobiascohen.com", "date": "Jul 13, 2011", "message": "&gt; Transparency is essential to insure fairness.\n\nI think you mean \"ensure\", not \"insure\"."}, {"author_name": "Chris", "gravatar_hash": "b6cc7f6c9fc6f5401fdd2664f602506d", "author_url": "http://chrismay.org", "date": "Jul 13, 2011", "message": "I noticed that, while you gave the criteria for how you arrive at a salary, you don't actually say what any of the \"ratings\" translate to in terms of salary.  So.... \"How much should you pay developers?\" wasn't really answered at all.  Or did I miss something."}, {"author_name": "Hemal", "gravatar_hash": "1a857cc33f44985222d2e698efd650b3", "author_url": null, "date": "Jul 14, 2011", "message": "@Tim: I have often wondered why salaries are not public. I saw one justification here, that employees would consider it a privacy issues. Can you cite any organization that follows this system?"}, {"author_name": "Sean McArthur", "gravatar_hash": "a409fb78297b2f8c855180cad3796dc7", "author_url": "http://seanmonstar.com", "date": "Jul 14, 2011", "message": "Indeed, as Lisha says, not counting time before graduation is non-sense. I have no degree, so if I ever was crazy enough to go to school now, your system suggests that my current years of experience don’t count. Odd, since the places I work feel differently."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.systempuntoout.com", "date": "Jul 14, 2011", "message": "Update the Joel Test with the thirteenth point:\n13. Do you have a transparent and robust way to pay like Stack Exchange?"}, {"author_name": "Nick", "gravatar_hash": "66ad65ecccd726926c526e77c0185633", "author_url": null, "date": "Jul 14, 2011", "message": "You obviously can't go wrong with a document which has unicorns in it."}, {"author_name": "Alejandro", "gravatar_hash": "73ddc7bd5721c190ae283410574157e1", "author_url": null, "date": "Jul 14, 2011", "message": "@Hemal: One reason firms may keep wages a secret is because they can then perform wage discrimination and earn more money.  If Alice and Bob are equally productive but Bob is willing to work for $5,000 less than Alice, then the firm can make more money by paying Bob less.  However, this will only work if Bob doesn't know both Alice's salary and his productivity relative to Alice.\nLook up \"price discrimination\" for more information."}, {"author_name": "AviD", "gravatar_hash": "a88248f632c039340efa02505be355e5", "author_url": null, "date": "Jul 14, 2011", "message": "One skill I find noticeably missing, is Security. \nA ridiculously fast, brilliant programmer, who refuses to consider arcane things like SQL Injection or Cross site scripting, will be creating a ridiculous amount of damage, even in relation to his productivity.  \nI'd much prefer a slower, more meticulous programmer who consistently know to avoid those vulnerabilities, and also the many others out there. \n\nI always advise my clients to measure individual security capabilities, as one of the first steps in creating a more secure development lifecycle. \n\nAdmittedly, it's not important as Modem Whistling, but still..."}, {"author_name": "Pete Samuel", "gravatar_hash": "033203d57d1c861fd91b3262a0cbfb58", "author_url": "http://petesamuel.wordpress.com/", "date": "Jul 14, 2011", "message": "Haha, I loved the magic unicorn at the bottom of the document. Great philosophy at your company +1"}, {"author_name": "Jim", "gravatar_hash": "c02eb7e6fcaeab10ef5f881394db6a27", "author_url": null, "date": "Jul 14, 2011", "message": "The financial services industry skews the rates incredibly.  Software jobs in financial services pay *significantly* more than other industries."}, {"author_name": "Mike", "gravatar_hash": "c98e188ba63a7875d61a77d7aaa3f5c7", "author_url": null, "date": "Jul 14, 2011", "message": "The simple fact is that money talks. If you pay a developer more than your competitors then you'll not only land them, but retain them.\n\nYes, work environment and relationships with the company are very important, but you'd either have to move to an amazing company or be leaving a really shitty company to drop significantly in salary.\n\nI may be biased, but developers are often very hard working and contribute a lot to a company, so they should be compensated well."}, {"author_name": "ck", "gravatar_hash": "3477d0763cfb080cc3d6743167b060df", "author_url": null, "date": "Jul 14, 2011", "message": "And how much should you pay managers?"}, {"author_name": "Nifle", "gravatar_hash": "0061b5a55205477f4a82c5fee31760f1", "author_url": "http://www.kiva.org/", "date": "Jul 14, 2011", "message": "This is gold IMO:\n\n\"Our compensation is not based on how well you negotiate or how often you ask for raises—it’s based on a repeatable predictable system\""}, {"author_name": "Andy", "gravatar_hash": "e5906408c4fc2a0489827ce6ed2bc091", "author_url": null, "date": "Jul 14, 2011", "message": "@AviD: Great idea. I dunno if they actually consider this in any of their levels (possibly under web programming or programming tools) but if I were writing one of these, I would definitely include it in one area of consideration. Personally, I sometimes find myself working a bit slower and more meticulously in order to ensure I'm following security best practices, and no one in my current job has ever told me anything like \"don't worry about that; it's too trivial.\"\n\nSo, are you hiring? ;)\n\n\n@Lisha Sterling: I completely agree. \"Time spent programming before graduation\" can be taken only with the finest grain of salt. I spent a few years in school doing various programming work for my classes, and when I started my first job, I actually thought I had a decent handle on .NET. I was wrong. While I knew enough to recognize core concepts and keywords and such, I quickly realized I didn't know shit yet. I think I learned more in my first 3 months on the job than I had in all the years I'd ever done any programming. Anyone who claims their experience in amateur or part-time developing is a sufficient substitute for any professional experience would have a lot to prove to me on day 1. I know a couple of people like that; but they're very rare."}, {"author_name": "Andy", "gravatar_hash": "e5906408c4fc2a0489827ce6ed2bc091", "author_url": null, "date": "Jul 14, 2011", "message": "P.S. By \"Time spent programming before graduation\", I assume we're actually talking about \"time spent programming before a full-time, professional job\". If that's not the case, then you can disregard."}, {"author_name": "Drummer", "gravatar_hash": "415ce5cf32efa3b8fc4700651a7d2c93", "author_url": null, "date": "Jul 14, 2011", "message": "Way to get horizontal scrollbar on 1024x768 resolution in Firefox 5. Does nobody test their designs anymore?"}, {"author_name": "Joel Spolsky", "gravatar_hash": "95e6837f350869bfb44e069a98885c58", "author_url": "http://stackoverflow.com", "date": "Jul 14, 2011", "message": "@Lisha: The rule that programming time before graduating college does not count as \"full time experience\" is meant to say that the summer you spent hacking in BASIC on your dentist's TRS-80 doesn't count, nor does that senior project, or internships, or coops. It is not intended to say that a 20 year programmer who got a degree late in life should be penalized.\n\n@Tim: Do you have any evidence that \"every person sets their own salary\" is a workable system? I have never heard of anyone doing that. The idea that people tend to value themselves *lower* under such a system directly contradicts the science I am aware of (see under \"Illusory Superiority\" on Wikipedia for references), therefore I would predict that such a system would be doomed, so I'd love to see some reports to the contrary.\n\n@Alejandro: excellent point. Keeping wages secret can make it much easier to exploit people; if someone accepts a $60,000 wage when their peers earn $90,000 because they didn't know better, the company gets the benefit of the $30,000 difference until that guy finds out. A lot of big American companies tell you that sharing salary information is not permitted.\n\n@Jim: financial services pays well indeed! Almost every good programmer I know could be making a fortune at a hedge fund or at Goldman Sachs. That's because the work environment and the level of work interest at financial firms is, for most people, bad enough that the salary has to be higher to compensate. Believe me, those uber-capitalist firms are not oaying programmers well out of the goodness of their hearts."}, {"author_name": "Dirk Riehle", "gravatar_hash": "06b7f3ec1263dc681e1efe9fb6f6334e", "author_url": "http://dirkriehle.com", "date": "Jul 14, 2011", "message": "You write \"Public Artifacts: [...] It’s a part of compensation because the better well known you are in the industry, the higher a salary you will command.\"\n\nAs to open source, academic research (read: thorough surveys) has shown that this does not hold true in general. It is only true if the open source software is an important project and also of relevance to the employer."}, {"author_name": "Toronto", "gravatar_hash": "48ea8f4277c21a2b381c5438f0aa49be", "author_url": null, "date": "Jul 14, 2011", "message": "I think the 30-200K range for C# devs is skewed to the downside, I routinely see 100/hr+ for work as mundane as SharePoint, where you're not expected to exhibit half of the skills listed here. I've yet to see a salary below 50K, even as early as 2nd year internships. Bottom line: you're not going to find out what's out there unless you're constantly moving. Employers will always exploit your 'loyalty'."}, {"author_name": "David Thomson", "gravatar_hash": "868c787e5160d65e5272ed400c94e3d4", "author_url": "http://www.dwlt.net/", "date": "Jul 14, 2011", "message": "@Joel: Ricardo Semler wrote about employees setting their own salary in his book Maverick\n\nhttp://amzn.to/mS492K.\n\nIn the UK, I suspect that revealing employee salary to everyone may actually be against employment law here (disclosure: I'm not a lawyer)."}, {"author_name": "Mattias Nilsson", "gravatar_hash": "e339541b2b4621e08e64e2c10af27c0d", "author_url": null, "date": "Jul 14, 2011", "message": "I might be deviating a bit here, but I say: Pay me roughly the same as a similar job would pay and spend a little extra on \"employee satisfaction\". Let me do interesting things, follow my own ideas to see if they work out or just make my working life a little less annoying by throwing a bit of money on things that gets in my way at work.\nIf you do that, I am much less likely to change employer."}, {"author_name": "Vamsee", "gravatar_hash": "3f4a3ca5891cfc2ca33c52e7f25cdfc9", "author_url": null, "date": "Jul 14, 2011", "message": "Yes please keep using silly formulas. Talented ones already do something part-time that generates income for them. You will end-up with dead wood in the end with less innovation/creativity. If that works for you great."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Jul 14, 2011", "message": "I'm laughing at the, \"We don't base salary on location, but we do pay people in New York more\" section.\n\nYou can hide behind the term \"living expense,\" but the total benefits does take into account location, and isn't any different than basing the salary itself on location.\n\nPretending otherwise is rather disingenuous."}, {"author_name": "Andy", "gravatar_hash": "e5906408c4fc2a0489827ce6ed2bc091", "author_url": null, "date": "Jul 14, 2011", "message": "@Toronto: I'm not sure where you are (Toronto, perhaps?) but that's definitely not the case here. I'm in Texas, and in an area where the cost of living is, compared to somewhere like New York, ridiculously low. I know lots of developers that make less than 50K (US $); in fact, I know fewer that make more."}, {"author_name": "Eric Bieller", "gravatar_hash": "a68a00a2332594b4840993af84a511e3", "author_url": "http://www.ericbieller.com", "date": "Jul 14, 2011", "message": "In my opinion all of this analysis is unnecessary. If you find someone whom you think could be a good fit for your company, talk to them on the phone, get to know them, and ask them salary requirements. Then you know exactly what they are expecting. From there you can negotiate salary and other details..\n\nI guess I just find this all much simpler than others. Nice read though."}, {"author_name": "Ivo", "gravatar_hash": "934fea7c374a16b437f0ad0ea91fbf27", "author_url": "http://www.jansch.nl", "date": "Jul 14, 2011", "message": "Outreach is both part of the skills matrix and a separate item in the document. Does that mean it counts double?\n\nLove the document. Considering adopting it as-is.\n\nThe only thing it doesn't provide a great solution to is subjectivity. It still leaves room for personal bias when it comes to rating the skills. A great negotiator could still convince  his direct manager to up the ratings."}, {"author_name": "Warren P.", "gravatar_hash": "a13ac5227cb5d4535123e3517b5474f4", "author_url": null, "date": "Jul 14, 2011", "message": "Wow, a totally subjective ranking system.   Except for the last one. (Modem whistling).  No subjective grading would have been required, if a time limit had been selected per each grade/category. You can either do it or you can't. \n\n:-)\n\nWarren"}, {"author_name": "Mike", "gravatar_hash": "a5b9e36852ebfddcf613bdb7ab79390e", "author_url": null, "date": "Jul 14, 2011", "message": "@Hemal\nhttp://www.dailytexanonline.com/content/ut-employee-salary-database"}, {"author_name": "THenrich", "gravatar_hash": "886427a445a180eb6618d77ee4ec4894", "author_url": null, "date": "Jul 14, 2011", "message": "@Joel Spolsky You seem to hire interns frequently. Is that to save money because you don't have to pay them as a full programmer or because you're grooming them to work for you? or, what make more sense, both?"}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": null, "date": "Jul 14, 2011", "message": "@Hemal:\nAlejandro's point about price discrimination is a good one, and does apply in some cases.\n\nBut even in the case where a company chooses not to maximize profits in that way, and apply an 'equal pay for equal value' philosophy, morale problems can crop up when everyone knows each other's salary. \n\nWhat often happens is something like this: Bob knows that Alice is making $10k/yr more than him. Whether true or not, Alice thinks the services she performs for the company are more valuable than what Bob does. Or she thinks she works harder than Bob. Or she hears (truthfully or not) that Bob dated the boss, and so assumes Bob slept his way to an otherwise undeserved pay raise. Or ... a thousand other situations.\n\nWe all know how hard and how well we personally work. We know less about how hard and how well others work, so it's easy to mistakenly assume we are the hardest workers of all and should be paid commensurately. Or we may not be fully aware of how much our work impacts the customer experience, and thus over- or under-value ourselves.\n\nIt's difficult for *anyone* to be objective about who is doing the most valuable work within the company, but in most situations, it's likely much more difficult for any single employee to accurately and objectively value his own contributions to the organization. Because of this, publishing each person's total compensation numbers can be horrible for employee morale, as many employees will (rightly or wrongly) feel that they are not getting their proper share of the pie.\n\nMaking being fully open about who is making how much money *can* work in some situations, but in most, it's a can of worms just waiting to become a horrible problem. \n\nThat said, Fog Creek and Stack Exchange are doing well to remove as much subjectivity as possible from the evaluation process, and are thus a cut above the rest. But they are right to keep each person's number private between that person and management."}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": null, "date": "Jul 14, 2011", "message": "Oh, crap. I think I mixed Bob and Alice up in the above post. Would correct if I could, but regardless, the intent of the example is clear, I hope."}, {"author_name": "duffbeer703", "gravatar_hash": "974938b8250a08cf9e22714aff1f9fcc", "author_url": null, "date": "Jul 14, 2011", "message": "I'd say go for transparency. \n\nI'm an employee of government... my last 3 years salary are found here:\n\nhttp://seethroughny.net/PayrollsPensions/tabid/55/Default.aspx\n\nWhen I started out, I worked at a company that loved to jerk employees around with respect to compensation. (And I believe discriminated against women) I was a DBA making $42k out of school. My colleague in the same job make $31k. People eventually find out."}, {"author_name": "DeveloperDame", "gravatar_hash": "4c856cbd102f0504c81a24c319cbeab9", "author_url": "http://www.developerdame.com", "date": "Jul 15, 2011", "message": "Hi,\n\nFirstly love the unicore, very nice touch. Also loving the be more awesome chart.\n\nLike some others here, I also have a problem with the experience section being based on years past graduation. I know plenty of programmers that didn't go to uni that are amazing, I also know plenty that did and are also amazing. I really think that *some* businesses need to loose the opinion of  no degree == crappy dev.\n\nMy £0.02\n\n:)\n\n"}, {"author_name": "Ben", "gravatar_hash": "9dcc38f4c50d6e8c0ebbc350066178bb", "author_url": null, "date": "Jul 15, 2011", "message": "I think this is pretty spot on and fair. However, I don't believe that ALL co-op experiences are invalid. I know that my experiences were very real and very valuable to me.\n\nAt my first co-op I worked for a Fortune 500 company with over 200 individuals in their IT group. I was 20 and a Sophomore in my program. I worked on a project that was to provide business value in the range of $250-350k in savings not including productivity increases for the users. I wrote somewhere around 7k lines of COM interfacing code that functioned well, provided correct results, and was approximately 60-70% of the coding work required for this project.\n\nI would hardly say that this project and experience is not worth something over an intern that changed toner for a development company."}, {"author_name": "RigidPrinciples", "gravatar_hash": "e86f35f0e636d3b85e3deb25f8218a2e", "author_url": null, "date": "Jul 15, 2011", "message": "Excellent post. This type of transparency should exist in all companies, where everyone can see the salaries of all employees. If this were implemented, the boat would be rocked for sure, but once folks quit because they now knew the salaries of others, things would eventually even out, and the organization would be way more functional and efficient.\n\nIt's no secret that incompetence rises to the top, and being able to see the salaries of the incompetent would offer awesome perspective :)"}, {"author_name": "Grzes", "gravatar_hash": "712248df6de12dd9b8ba73869a110f1f", "author_url": null, "date": "Jul 18, 2011", "message": "I think that the new employees still negotiate the pay when they join, they just do it indirectly - through negotiating one of the initial \"levels\". In a similar way, you don't ask for promotion, you ask for an increase in one of the levels.\n\nHumans are incredibly creative to game these kind of simple remuneration systems."}, {"author_name": "Joshua lee", "gravatar_hash": "fc06ef36d84952bd06a3804448c98c21", "author_url": "http://www.topresourcescorp.com", "date": "Jul 18, 2011", "message": "Salary is a favorite topic for me (both as a recruitment professional and as a curious mind).\n\nThe programmer salary is interesting.  With the growth of e-commerce I sincerely feel like the developer's role has evolved from a backroom geek to a revenue generating super star.  Really.  How significant is it for Amazon, Ebay and some gaming sites to have the right programmers?  Just as significant to have the right sales people who bring in business.  Except in this case, the programmers help keep your business.  Why not pay them commissions?  Only one major issue.  Neither employers nor programmer employees are accustomed to being paid on this scale.  This means risk vs reward.  So a senior programmer in the LA area who might be worth say $120k should have the option to be paid $60k-$75k base + % of the gross profits of the game he/she helped develop.  The risk is that you wont make it past $85k for a poor performing website.  The reward is that if you happen to work for a great company then you might make $200k+.  The employer doesn't lose because he gets top talent at a low starting base pay and only pays out when he himself is making enough money to justify it.  :)"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jul 19, 2011", "message": "@Joshua Lee,\nI'd like to work for you.  I don't know what the typical salary is for people on stack exchange...and don't mean to steal some folks from you, but Gravell and Montrose I've seen some of their work and it should reflect a 6 figure salary.  If it isn't sorry guys :)..if it is then well everything's good."}, {"author_name": "Dave", "gravatar_hash": "331a94b12596771381a97a82f13d8423", "author_url": null, "date": "Jul 21, 2011", "message": "yo, i'm a teacher in a private college that offers courses in programming &amp; network. the whole course take 1 year to complete, at the end the programmers know : t sql, sql server, mysql, C#,asp.net, vb.net, POO, ... yeah they are no champs but they are kinda well rounded.\n\nSmall compagnies over here pay them from 22 000 $ to 28 000 $ at start. so something between 11$ and 14$ / hour.\n\nto acheive a salary of 50 000 here, you MUST have over 8-10 years of experience.\n\nso yeah, i guess they consider them like cheap labor.\n\nbtw i live in canada , quebec, saguenay-lac-st-jean"}, {"author_name": "Mark", "gravatar_hash": "307bbb6ed589fc6ef2deec1918ecd195", "author_url": "http://opendns.com", "date": "Jul 24, 2011", "message": "Hey Joel, why does the StackExchange compensation approach differ so much from Fog Creek Professional Ladder posted here?\nhttp://www.joelonsoftware.com/articles/Ladder.html\n\nThe StackExchange plan seems much more general, more subjective than the older plan, which is much more algorithmic.  Does Fog Creek still use their plan?"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jul 26, 2011", "message": "@Mark,\nUp towards the top of the article, it says that the article is pretty ancient (2009), and to \"proceed with caution\".\n\nBeing that his site isn't a wikipedia article, one shouldn't expect it to be constantly updated."}, {"author_name": "Mark", "gravatar_hash": "307bbb6ed589fc6ef2deec1918ecd195", "author_url": "http://opendns.com", "date": "Jul 27, 2011", "message": "@JonH,\nYeah, I understand.  Just think it's interesting to see the evolution.\n\nMaybe I can better phrase my question. \n\nDo/did they find the Fog Creek approach too rigid/specific?   Or do the Fogcreek and StackExchange approach differ more because it's a different org, different business (service vs. product)?\n\nAt my company, we are leaning towards something between the two."}, {"author_name": "george", "gravatar_hash": "a33787ddcf32e2469b609f11e6667d39", "author_url": null, "date": "Jul 31, 2011", "message": "This 'after programming' rule is just stupid.\nMy undergraduate degree had a duration of 5 years (combined bsc+msc).\n\nBecause I was working full-time since the 4th year, it took my 7 years to graduate. \n\nSo I was working full time for 3 full years *before* I finish my degree.\n\nWhat does that say about my case? My experience doesn't count for anything according to these rules.."}, {"author_name": "Piotr Dobrogost", "gravatar_hash": "b12f7c10f72b7ac3daaa98f0a3bc0718", "author_url": "http://piotr.dobrogost.net", "date": "Apr 21, 2012", "message": "@george\n\nYou know what's stupid? Commenting without reading earlier comments is stupid. See Joel's response to Lisha."}, {"author_name": "Jim Kimball", "gravatar_hash": "5fb7e88b4211590bc9af1d583cc70185", "author_url": "http://sharinglunch.tumblr.com/", "date": "Dec 26, 2012", "message": "I realize this thread is old, but thought I would leave a note and see if anyone is still listening.\nI am curious about the comment @Ivo made re: the subjective nature of the skills evaluation. If I were a developer in this kind of organization, my natural question would be why you evaluated me as an A instead of an A+. I would then want to know specifically what I need to do in order to get from an A to an A+. How often does this come up and how do you answer?\nI do like the approach presented here and am interested in how it works in practice."}]}