{"response": [{"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://juanformoso.com.ar", "date": "Jul 01, 2011", "message": "Dammit, I don't have like, +1, or upvotes here.\n\nI'm lost"}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Jul 01, 2011", "message": "There's one thing you forgot to mention:\nDon't ask and answer your own question just to try to farm reputation."}, {"author_name": "Matthew Miller", "gravatar_hash": "117c0d7cacdbd76827401b822b3037cb", "author_url": "http://mattdm.org/", "date": "Jul 01, 2011", "message": "@R. Bembrose: If it's providing actual, valuable information, who cares? (See http://xkcd.com/810/)"}, {"author_name": "AttackingHobo", "gravatar_hash": "0f47d8d088dfa4f8040680fd8f2112fe", "author_url": null, "date": "Jul 01, 2011", "message": "@R. Bemrose ... Uhh I think this blog post is addressing that exactly. You are wrong. \n\n\"To be crystal clear, it is not merely OK to ask and answer your own question, it is explicitly encouraged.\"\n\nAsk and answer questions if you already know them, but have not been asked before. If the question and answer are good, then you will net rep.\n\nWhat you are suggesting is to answer your own questions so horribly that you will not get rep. That will not improve stackexchange at all."}, {"author_name": "Tyler Breisacher", "gravatar_hash": "e689265ee24e0874ae8a90827c4783e7", "author_url": "http://trojansax.blogspot.com", "date": "Jul 01, 2011", "message": "The one caveat I would add is that sometimes people seem hesitant to answer questions that have already been answered. (I don't have any proof of this but it's the sense I get sometimes.) So it might be worthwhile to ask the question, wait a day or so to see if any new answers come up, and then add your own answer. Or at the very least, don't *accept* your own answer right away, because then the question shows up as \"asked, answered, and accepted\" which implies there's not much point in giving new answers unless they're drastically different from the accepted one."}, {"author_name": "Rolf", "gravatar_hash": "1c13eac0931a8095e04bcfeaaed371e8", "author_url": "http://www.rolfje.com", "date": "Jul 01, 2011", "message": "@R. Bemrose:\n\nReputation farming can only be done with good questions and/or answers. The whole *point* of earning reputation is to get people to put time and effort in stackoverflow, which they would have not done otherwise.\n\nBut then again, StackOverflow is not for altruistic people like you, religeously refusing all upvotes, and donating your badges to the red cross.\n\nMr. \"25k\"... http://stackoverflow.com/users/15880/r-bemrose\n\n;-)"}, {"author_name": "Isaac", "gravatar_hash": "2bb572e05887045b95d99d8a5819eb14", "author_url": "http://judaism.stackexchange.com", "date": "Jul 01, 2011", "message": "I would beef up the \"Jeopardy\" clause a little bit. Self-askers should make sure that they phrase the issue in the form of a *real, high-quality* question.\n\nI've seen many times that when someone already knows the answer to a question they're posting, they tend to write the question up minimally, without sufficient specification about what motivated the question and the details of the issue. It think it's important to emphasize that the question should be stated from the point of view of someone who doesn't have the answer yet and needs it."}, {"author_name": "Chankey Pathak", "gravatar_hash": "c3c59c91293af5a13a840a9855024afe", "author_url": "http://chankeypathak.blogspot.com", "date": "Jul 01, 2011", "message": "Yes, answering your own question should be allowed on stackexchange's sites."}, {"author_name": "John Saunders", "gravatar_hash": "953e26e80351a67962a6e5840fc1fc14", "author_url": null, "date": "Jul 01, 2011", "message": "I wonder what proportion of StackExchange users don't know what \"Jeopardy\" is?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 01, 2011", "message": "@john I suppose the same proportion that don't know what \"Wikipedia\" and \"Clicking a Link\" is."}, {"author_name": "rem", "gravatar_hash": "61513f2becec6bcbb9af476f817d85f8", "author_url": null, "date": "Jul 01, 2011", "message": "For making it more convenient to document something by posting a question and answering it, there should be more elaborated bookmarking mechanism on SE. When there are hundreds of threads marked simply by the \"favorite question\" star it's hard to quickly find the needed one."}, {"author_name": "Steve Wortham", "gravatar_hash": "7c4d1e4f8701946b8391d009d8d85221", "author_url": "http://www.silverlightxap.com/", "date": "Jul 01, 2011", "message": "I've done this a handful of times, but not with this kind of foresight.\n\nOrdinarily I answer my own questions when I'm able to figure out the answer before anyone else does.  \n\nIt's the kind of thing that happens with a lot of people, I'm sure.  In fact it'd be nice if more people posted follow-ups to their questions, detailing their solutions."}, {"author_name": "Oak", "gravatar_hash": "f7d4d2fea0deac168bc7e00e6d8f1db5", "author_url": null, "date": "Jul 01, 2011", "message": "@Jeff - actually, I had no idea what \"Jeopardy!\" is until a couple of years ago, and then also by chance. Though there are some international versions of Jeopardy, not all countries have them, and in some of these countries the local version is under a completely different name.\n\nI guess that for an English-only site it does cover the majority of users, but as far as i18n goes, I'd consider \"Jeopardy!\" to be a poor term to use."}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://quickmediasolutions.com", "date": "Jul 01, 2011", "message": "Thank you so much for this post. So often I have seen new (and unfortunately older) users saying that \"you shouldn't answer your own question\" and sometimes they even downvote the answer for that very reason.\n\nNow we have an official blog post we can send them to."}, {"author_name": "Eric", "gravatar_hash": "46093583d8895095adb1b0071c505af2", "author_url": "http://mindsharestrategy.com", "date": "Jul 01, 2011", "message": "I second what Tyler said earlier about the general reluctance to answer questions that have already been answered.  From the beta periods of the various Stack Exchange sites, I took it that having a large number of answers for each question was a *good* thing.  As a matter of fact, it was one of the health criteria points for moving a site from beta to launch.\n\nIf you ask a question, then immediately answer it yourself, how is this encouraging participation and community development?  Yes, it's archiving the information for all the Googlers out there, but posting on your blog would do exactly the same thing.  And this kind of behavior was explicitly *discouraged* during SE beta periods, so I don't see how it's \"explicitly encouraged\" when sites go live."}, {"author_name": "Trufa", "gravatar_hash": "b685494fc3e6341655360971b1178e0d", "author_url": null, "date": "Jul 01, 2011", "message": "I really like that you are encouraging this, I think it might add great value to the site. When you actually solve an interesting problem yourself, if you don't blog, it is a great way to not keep it to yourself and even get some feedback!"}, {"author_name": "cwallenpoole", "gravatar_hash": "1186a46e65dbea4c8900d524c613f926", "author_url": "http://allen-poole.com", "date": "Jul 01, 2011", "message": "While answering your own question is encouraged, it is also discouraged. I know it's not intended, but I can't help but feel that, from a usability perspective, the prompt: `Are you sure you want to answer your own question?` actually discourages that on at least a subliminal level."}, {"author_name": "LachlanG", "gravatar_hash": "b7cbb37e65e55cbc6921d40dd22a03cb", "author_url": null, "date": "Jul 03, 2011", "message": "@Jeff, there would be quite a lot who don't know what Jeopardy is. To the best of my knowledge it's never screened on Australian TV and I wouldn't be surprised if it's never screened in the UK either. From the odd pop culture reference I know it's a game show where the questions and answers are reversed somehow but I couldn't tell you much more than that."}, {"author_name": "Andrei Vajna", "gravatar_hash": "53d2829ef0b52fae2b3cd74c1d8aad15", "author_url": null, "date": "Jul 04, 2011", "message": "What about getting several good answers for your question, and you want to create an answer that encompasses all of them. Is that encouraged? Or should you edit your question and add a \"Conclusion\" list at the end? Which approach do you recommend?"}, {"author_name": "Richard Gadsden", "gravatar_hash": "3c291e7858e6b79e06889fa7dbf16d31", "author_url": null, "date": "Jul 04, 2011", "message": "@LachlanG Jeopardy! has never screened in the UK either, and I've never seen it.  I know that it's a \"this is the answer, what is the question\" quiz show, and that's the entirety of my knowledge."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jul 06, 2011", "message": "> rom the beta periods of the various Stack Exchange sites, I took it that having a large number of answers for each question was a *good* thing. As a matter of fact, it was one of the health criteria points for moving a site from beta to launch.\n\nThe guidelines for private beta, when sites are empty and in the formative stages, are a bit different than the guidelines for a mature, launched site. In general I am referring to <a href=\"http://area51.stackexchange.com/?tab=launched\" rel=\"nofollow\">launched sites</a> here, or sites that have at least been <a href=\"http://area51.stackexchange.com/?tab=beta\" rel=\"nofollow\">in public beta</a> for a while.\n\n> I know it’s not intended, but I can’t help but feel that, from a usability perspective, the prompt: `Are you sure you want to answer your own question?` actually discourages that on at least a subliminal level.\n\nThat's a safety feature for inexeperienced users. If you know what you're doing and have strong reason to believe your answer will help others, answer away!\n\n> What about getting several good answers for your question, and you want to create an answer that encompasses all of them. Is that encouraged? Or should you edit your question and add a “Conclusion” list at the end? Which approach do you recommend?\n\nGenerally I don't think you need to do anything; if you have 3 great answers to your question, fantastic! Anyone interested in the question will <i>certainly</i> read the top few answers at a minimum."}, {"author_name": "Steve Bennett", "gravatar_hash": "75f5707160697b2164444fc3f5054084", "author_url": null, "date": "Oct 20, 2011", "message": "&gt;That [extra prompt when answering your own question]’s a safety feature for inexeperienced users. If you know what you’re doing and have strong reason to believe your answer will help others, answer away!\n\nPerhaps suppress this prompt for &gt;X reputation?\n\nIncidentally, is there any etiquette to self-answering? Should you indicate in the question that you intend to answer it yourself? It would be awkward to discover someone else frantically typing out an answer at the same time..."}, {"author_name": "Code Jockey", "gravatar_hash": "0892df27efacf76e5054431054a0e7b4", "author_url": null, "date": "Nov 07, 2011", "message": "In response to the Jeopardy comparison, I scratch my head... most of the questions asked on Jeopardy are three to five words, aren't they? - \"Who is Jeff Atwood?\" and \"What is Visual Studio?\" or even \"What is C++?\" - don't we want to encourage slightly beefier questions than that? Just a little more context than that? Otherwise we're basically Wikpedia. I'm just sayin'"}, {"author_name": "Alois Mahdal", "gravatar_hash": "1b4e747120238b5fabd032ce55c327c5", "author_url": null, "date": "Jan 22, 2012", "message": "&gt;&gt; I wonder what proportion of StackExchange users don’t know what “Jeopardy” is?\n\n&gt; I suppose the same proportion that don’t know what “Wikipedia” and “Clicking a Link” is.\n\n@Jeff I do know what Jeopardy is--I looked it up on Wikipedia. In fact, while I believe I get the message of whole article (and agree and like), I'm still very confused about the “phrase it in the form of a question” part. Which part of the whole Wiki article should I read to get the message? I mean, did you really intend to be so cryptic for people outside U.S.?"}, {"author_name": "Waldir Leoncio", "gravatar_hash": "8e9e259e87e3d0b4d353c2d871acf2e8", "author_url": null, "date": "Feb 19, 2012", "message": "I'm SO in love with Stack Overflow now."}, {"author_name": "maanu", "gravatar_hash": "10afe4f4fe79a81d1de55e0f7537afa5", "author_url": "http://www.athimannil.com/", "date": "May 24, 2012", "message": "After google Stack Overflow is my teacher :)"}, {"author_name": "Steve Taylor", "gravatar_hash": "001b986c0c23ffeae12ff7c1b5594376", "author_url": null, "date": "Jun 01, 2012", "message": "Making users wait two days to *accept* their own answer *explicitly discourages* them from asking and answering their own questions. It's a hassle having to remember to go back to such questions two days later.\n\nUsually when I ask and answer, I don't know the answer until after I have finished at least typing the question. So the notion that I would be asking and answering purely to show off existing knowledge or to farm reputation from my existing knowledge is just plain wrong."}, {"author_name": "Chris Moschini", "gravatar_hash": "354c23d7ab1248c0d1a9c3868caa68b2", "author_url": "http://brass9.com/", "date": "Jun 05, 2012", "message": "I asked and answered my own question early on and got heavily voted down for doing so in the wrong format. The interface should be clearer about how to do this, if it really is encouraged. Someone new to StackOverflow who has an incredibly useful tidbit to share is surely going to violate this awkward format and experience the same fate - and that's going to make it very unlikely that useful tidbit ever surfaces in a search.\n\nIn the meantime it would be nice if the community could help new users to how to do this instead of voting otherwise useful info down for procedure."}, {"author_name": "Mehul Patel", "gravatar_hash": "fa99d24d5e06099753e78a254ab52790", "author_url": null, "date": "Jun 14, 2012", "message": "If none know the Answer of your question and after so many end of we found answer then we have to share so it helps to other."}, {"author_name": "Pajko", "gravatar_hash": "1c8042c263d5365942d29d9393adc284", "author_url": null, "date": "Jun 26, 2012", "message": "My new formula for the number of PI\nπ = n/2sin(360/n)\nπ = n.sin(180/n)\nπ = 180.m.sin(1/m)\nπ=360.m.sin(1/2m)\nsin-deg\nsee the proof\nhttp://rs.linkedin.com/pub/рајко-велимировић/3b/528/6b7"}, {"author_name": "B ig Daddy App", "gravatar_hash": "296961dc793170029f9cf24a3fa72311", "author_url": "http://www.bigdaddyapp.com", "date": "Jul 01, 2012", "message": "I like this rule. I have some questions I just found answers too and I can post them and answer them"}, {"author_name": "Рајко Велимировић", "gravatar_hash": "1c8042c263d5365942d29d9393adc284", "author_url": null, "date": "Aug 18, 2012", "message": "new formula for pi\nРајко Велимировић\nπ = 90.m.sin(2/m)\nπ = 60.m.sin(3/m)\nπ = 45.m.sin(4/m)\nπ = 36.m.sin(5/m)\nπ = 120.m.sin(3/2m)\nπ = 72.m.sin(5/2m)"}, {"author_name": "Рајко Велимировић", "gravatar_hash": "1c8042c263d5365942d29d9393adc284", "author_url": null, "date": "Aug 18, 2012", "message": "in the formulas for pi is missing\n\n1) sin degrees\nFor millions across the value of PI free extra precision calculator XP,XM,….. recommend m=1.0E+10000000\nto the success of the calculator you need to install netframework2.0\nhttp://harry-j-smith-memorial.com/index.html"}, {"author_name": "Benjamin Lupton", "gravatar_hash": "9400cb5aeb155ccec614652542fd274d", "author_url": "http://balupton.com", "date": "Aug 21, 2012", "message": "Completely agree with Rolf on reputation farming, as such I really do not understand what people's issues are with reputation farming? The only way people can earn reputation is if their participation in the community was useful, if it wasn't they lose reputation from down voting. As no one gets paid for having reputation, I fail to see how it can be anything other than I provided this value. I don't understand why so many people are against adding value. To me, the only possible reason I can come up with is envy.\n\nTime and time again, there is always one person who jumps on this envious bandwagon, despite the posts already being voted up as an affirmation of their value. It is real drag on those wanting to share their own knowledge, experiences and expertise to benefit others, and as such a real burdon on the community."}, {"author_name": "Benjamin Lupton", "gravatar_hash": "9400cb5aeb155ccec614652542fd274d", "author_url": "http://balupton.com", "date": "Aug 21, 2012", "message": "I retract my previous stance on envy, after a discussion on http://stackoverflow.com/q/12024020/130638 it could be that this pattern in general could just be another case of good intentions wrapped with misunderstandings, which is real great to hear. I love stack overflow :)"}, {"author_name": "Mark Rovetta", "gravatar_hash": "f96cde9082af733b54fda26564c6c03d", "author_url": null, "date": "Aug 21, 2012", "message": "As a new user of the Stack Exchange site, thank you for this explanation. I found this while reading the faq and would not have considered self-answering a question otherwise. The value of an answer should not depend upon who answers it."}, {"author_name": "rania", "gravatar_hash": "9f2a1a4c975863f381a8a1f8a7ccebc8", "author_url": "http://google", "date": "Aug 29, 2012", "message": "PLEASE DON\"T READ THIS YOU WILL GET KISSED ON THE NEAREST FRIDAY BY THE LOVE OF YOUR LIFE. HOWEVER IF YOU DON\"T POST THIS COMMENT TO AT LEAST 3 QUIZZES YOU WILL DIE WITHIN 2 DAYS. NOW YOU\"VE STARTED READING THIS DON\"T STOP THIS IS SO SCARY SEND THIS TO OVER FIVE QUIZZES IN 143 MINUTES. WHEN YOU\"RE DONE PRESS F6 AND YOUR CRUSHES NAME WILL APPEAR ON THE SCREEN IN BIG LETTERS. THIS IS SO SCARY CAUSE IT ACTUALLY WORKS!!!"}, {"author_name": "Steve Lawrence", "gravatar_hash": "bd940f981d697c02ccbbd5efaa844cb8", "author_url": null, "date": "Sep 02, 2012", "message": "It may be okay to answer one's own question, but HOW to do so is not evident."}, {"author_name": "Carl", "gravatar_hash": "fb9af9a19055a830a0caaea375a23a45", "author_url": null, "date": "Sep 09, 2012", "message": "I like this rule. I have some questions I just found answers too and I can post them and answer them"}, {"author_name": "Ricardo", "gravatar_hash": "8b23fdbfdbb8ce2dae9965d51d186051", "author_url": "http://placerdigital.net", "date": "Sep 19, 2012", "message": "Great article, Jeff, but I agree with John Saunders when he says:\n\nI wonder what proportion of StackExchange users don’t know what \"Jeopardy” is?\n\nThe world is a big place. I live in Chile, and I know what Jeopardy is because I lived in the US a long time ago, but millions of people do NOT know what that is, so it's better to think in everyone when writing an article, specially if it is such a great and nice post like this. \n\nLet's make Internet a better place for all the human beings ;)"}, {"author_name": "Louis Kessler", "gravatar_hash": "dfc2b6aae1baa3fa00ad45ebca5adedc", "author_url": "http://www.beholdgenealogy.com", "date": "Oct 12, 2012", "message": "No. I completely disagree.\n\nI don't think anyone should ask a question to which you think you already know and have the best answer.\n\nIf you are trying to get new ideas and think one particular way of thinking is the best, then you should include it in your question and ask whether that is best. That is okay.\n\nThe one place I think it is okay to answer your own question is when you really don't know the best answer, and the answers given are not quite it either, but they lead you to thinking or further web research and then you discover the best answer. Then you can include it and state so.\n\nBut preferable to that, you should make sure you wait long enough, say a few weeks or even a month, for someone else to come up with the same answer you discovered. Then you can and should give them credit for the answer. And you can document any subtleties in comments to that answer or by editing your question with a followup.\n\nAnd waiting the few weeks or month without accepting an answer will result in more answers, giving you more ideas, and maybe a better solution.\n\nI see now that Stack Exchange is not only allowing answering your own question. They're actually promoting it! \n\nClick \"Ask Question\" and on the page just below the \"Post Your Question\" button, you'll see a line that says:\n\n\"Answer your own question – share your knowledge, Q&amp;A-style\"\n\nAt the beginning of the line is a checkmark. If you select it, up pops a text box allowing you to immediately supply your answer.\n\nThe link on that line takes you to this blog post.\n\nWell, rather than the one exception I stated above, I still very much disagree with doing this and think that promoting this when we ask the question is doubly bad. I still think one should only answer their own question after others have had a chance to do so - and especially should not do it immediately when they ask it."}, {"author_name": "olivia rodriguez", "gravatar_hash": "f47112635d65885b544e5ad68b7214e0", "author_url": "http://oliviasrodriguez.nstars.org", "date": "Nov 04, 2012", "message": "I disagree on ask and answer our own answer. There are possibilities that one sided answer is there whether it is positive or negative. Answer should be analytic and perfect."}, {"author_name": "judyhenry646", "gravatar_hash": "252402b22c844f4a8fb1887e19cfb323", "author_url": "http://schoolanduniversity.forumotion.com", "date": "Nov 09, 2012", "message": "It is ok to give answer to your own question because of if people will not give answer or if you know the better answer than other then definitely we can give answer. If someone will come with better answer then we can edit and give the right answer to the question."}, {"author_name": "Rahat Khanna", "gravatar_hash": "5dfe2d035618ae32da17c4cb6fe56dc2", "author_url": null, "date": "Nov 17, 2012", "message": "I love this concept of Question - Answer pair, it Aims at sharing your knowledge with others"}, {"author_name": "Raghuveer.K", "gravatar_hash": "8088adbc801a16ae52303d2c94ed469f", "author_url": null, "date": "Dec 14, 2012", "message": "First of all its my first comment, I am happy to a member of stackoverflow, Its a best place to learn, and i agree to answer their own questions, as they may find some answers for their question after research, and that can help a lot of people like me, who are beginners to the programming world."}, {"author_name": "Xander", "gravatar_hash": "a10eee6df652c31a064f9045eb5a1331", "author_url": null, "date": "Dec 20, 2012", "message": "Ok now i know that im not supposed to ask this kind of question but i'm at the end of my game... I just cannot find the name of this game. No matter how many people (mostly gamers) i ask, no one seems to know. I have googled so much that my fingers cramped up so i'm just gonnna go ahead and ask it here. \n\nPlatform: PC  (commonly played with Joystick) \nYear: Somewhere between 1992 and 1999\n\nMain Character description: its a guy that has this black clothing, it looks like some spandex suit or w.e or a leather suit idk its all black and it doesnt show pants or shirt it looks like a one piece clothing. It's alll black. He has this pointy head or hat or w.e. The gun he has looks weird too it kind of reminds me of a candy shovel. You know those things u use to scoop candy in a candy store.\n\nGame description: The environment is aswell inside as it is outside. You have to fight ennemies. I cant remember the small ones but i do remember you having to shoot some weird looking tanks and robot ish vehichles. Also eventually jets or planes or maybe even space ships cant really remember. Also you could collect \"Apples\" and \"Presents\" and also \"candy\" if im not mistaking. Now people who have played this game and know the title know which game im talking about by now. And to be honest i dont really have any more additional info. I reaaaaaallllyy hope someone can help me out. Because i ve been searching for the title of this game for the past 6 years or so. The OS it was played on is windows 95 or 98.\n\nGreetings and i really hope someone can help me and much much thanks in advance, Xander"}]}