{"response": [{"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jul 21, 2011", "message": "+1 interesting, the math here may be a contributing factor to determine whether a site becomes a true stackexchange site or not."}, {"author_name": "bcs", "gravatar_hash": "f2d485d809e88339a6f78e584ce760b3", "author_url": null, "date": "Jul 21, 2011", "message": "Can we get these charts (and/or others) generated on a regular schedule for all the sites? Maybe as a part of data explorer?"}, {"author_name": "matt b", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Jul 21, 2011", "message": "Well, today I learned what a \"rising senior\" is"}, {"author_name": "harrison", "gravatar_hash": "3d7f613f9cb1be0ce1908eedcc0631a2", "author_url": null, "date": "Jul 21, 2011", "message": "Qiaochu: I like that you referenced Cosma Shalizi, but come on; no log-likelihood test to tell whether there's an actual power-law relationship here, or something like a log-normal distribution? :P"}, {"author_name": "Roland Tanglao", "gravatar_hash": "54ffad882c89d1aeff46c970cdaaef12", "author_url": "http://rolandtanglao.com/", "date": "Jul 21, 2011", "message": "could we please have the source code used to generate these graphs? love to learn from it!"}, {"author_name": "Alejandro Rivero", "gravatar_hash": "2f4b46fc38ea6e686de02924c72414ea", "author_url": null, "date": "Jul 21, 2011", "message": "About values of s, it is clear that s&gt;1 if you want a probability distribution (finite area) and s&gt;2 if you have some argument telling that an average of the values must indeed be finity. For s&gt;3 you have average and variance, and then most processes met the conditions for convergence towards gauss."}, {"author_name": "Qiaochu Yuan", "gravatar_hash": "5f83d135a7238dbd0db34da79f9f98f5", "author_url": "http://qchu.wordpress.com", "date": "Jul 21, 2011", "message": "@Harrison: Unfortunately I'm not sure how to actually go about running such a test. In any case, the fit is good enough that for the purposes I care about it doesn't matter if I'm slightly wrong.\n\n@Roland: the SQL queries I used are really terrible and I'm a little embarrassed to post them publicly. I couldn't figure out a way to do this that doesn't involve creating a lot of temporary tables, but I don't know much about SQL, so there must be a better way. The graphs were generated in Excel.\n\n@Alejandro: interesting observation! I am not sure about whether it applies to this case, though..."}, {"author_name": "Simon Buchan", "gravatar_hash": "ea6872cf5f32040741eabf1e7e089416", "author_url": null, "date": "Jul 21, 2011", "message": "I find it interesting that early deviation from a power-law looks like it predicts subject difficulty, though I think that might be a property of the questioners rather than the answerers: say math questions are more unique than programming, or the most unique questions are more difficult to answer for maths than programming. I'm no mathematition, but it might be interesting to do similar plots by tag, sampled w.r.t. commonality."}, {"author_name": "Simon Buchan", "gravatar_hash": "ea6872cf5f32040741eabf1e7e089416", "author_url": null, "date": "Jul 21, 2011", "message": "Re: SQL: The GROUP BY clause should give you what you want:\n\nSelect Name, Count(*) As Count\nFrom Post\nWhere PostTime &lt; CURRENT_TIMESTAMP - 28\nGroup By Name\nOrder By Count(*) Desc"}, {"author_name": "Simon Buchan", "gravatar_hash": "ea6872cf5f32040741eabf1e7e089416", "author_url": null, "date": "Jul 21, 2011", "message": "Whoops, obviously that should be PostTime &gt; CURRENT_TIMESTAMP - 28 :)"}, {"author_name": "Simon Buchan", "gravatar_hash": "ea6872cf5f32040741eabf1e7e089416", "author_url": null, "date": "Jul 21, 2011", "message": "Ugh... Sorry for the spam. I brain farted halfway through coding that up and forgot you wanted to count counts...:\n\nSelect PostCount, Count(*) As Count\nFrom (Select Count(*) As PostCount\n      From Post\n      Where PostTime &gt; CURRENT_TIMESTAMP - 28\n      Group By Name) Counts\nGroup By PostCount\nOrder By PostCount Desc"}, {"author_name": "Qiaochu Yuan", "gravatar_hash": "5f83d135a7238dbd0db34da79f9f98f5", "author_url": "http://qchu.wordpress.com", "date": "Jul 21, 2011", "message": "@Simon: cool - I didn't know you could nest SELECTs. (This is my first experience with SQL!) The queries I'm using also group by 28-day cycle so I can compare adjacent 28-day cycles (more on that later)."}, {"author_name": "Simon Buchan", "gravatar_hash": "ea6872cf5f32040741eabf1e7e089416", "author_url": null, "date": "Jul 21, 2011", "message": "@Qiaochu: Well, you *could* still do that in a single query:\n\nSelect Cycle, PostCount, Count(*) As Count\nFrom (Select Count(*) As PostCount, Cycle\n\t  From (Select Name, Cast(CURRENT_TIMESTAMP - PostTime as Int) / 28 As Cycle\n\t        From Post) A\n\t  Group By Name, Cycle) B\nGroup By PostCount, Cycle\n\nBut at this point, it's gettin pretty hard to read, with diminishing returns on dumping into a temp table, which you can requery. I suspect that query would be stupidly slow on the StackOverflow database :)"}, {"author_name": "Ivo Flipse", "gravatar_hash": "f7ae8c8fb83e502a854e2db3410f3827", "author_url": "http://superivo.wordpress.com", "date": "Jul 21, 2011", "message": "I wonder if there's a relation between the votes you receive and the amount of posts. Or perhaps you should check for the activity of a user over time. \n\nSince, Stack Overflow has a lot of users that come back when they have another problem to solve. While I suspect Super User doesn't have this loyalty. \n\nOff course, Stack Overflow has become *the* source for Programming questions, whereas Super User competes with every other tech site out there.\n\nSo if you'd check for how activity a user account has over time, I think sites with a real `community` are the ones where a relatively large group keeps coming back. If not, Lotka’s law can't really be expected to fit can it?"}, {"author_name": "Martin", "gravatar_hash": "1dce4bd2d4da7749699f3e96df18d94d", "author_url": "http://blog.erlang.de/", "date": "Jul 22, 2011", "message": "Thank you for sharing this post. We need more of this to get more people into statistics / mathematics."}, {"author_name": "John C&gt;", "gravatar_hash": "1e19ec9504874df60f417008dcbf324a", "author_url": null, "date": "Jul 22, 2011", "message": "I'm curious why you picked the date range Mar 3-30. It could be a lunar cycle, but is posting really [POM-dependent](http://en.wikipedia.org/wiki/Unusual_software_bug#Phase_of_the_Moon_bug)?"}, {"author_name": "msh210", "gravatar_hash": "78a50094ca87aaed01e076f4c8808ed8", "author_url": "http://judaism.stackexchange.com/users/170/msh210", "date": "Jul 22, 2011", "message": "Why did you choose day 2 to as the basis of the constant of proportionality?"}, {"author_name": "Katty", "gravatar_hash": "2cb7c37b7709e80c997af4a798265e5f", "author_url": null, "date": "Jul 22, 2011", "message": "Top: \"It is a bad idea to use linear regression to check for a power law.\"\n\nBottom: \"... fits Lotka’s law absurdly well\"\n\nlulz"}, {"author_name": "David Thomas", "gravatar_hash": "9d3307f42babc28cc6fb544fc764ff61", "author_url": null, "date": "Jul 22, 2011", "message": "@Qiaochu:\n\n\"...the SQL queries I used are really terrible and I’m a little embarrassed to post them publicly. I couldn’t figure out a way to do this that doesn’t involve creating a lot of temporary tables, but I don’t know much about SQL, so there must be a better way.\"\n\nYou know, there's <a href=\"http://stackoverflow.com\" rel=\"nofollow\">a website</a> that <em>might</em> be able to help with that... =D"}, {"author_name": "mixedmath", "gravatar_hash": "1066fe6e02bf9b9a52aef4c9b3f8457d", "author_url": "http://mixedmath.wordpress.com", "date": "Jul 22, 2011", "message": "Hey Qiaochu,\n\nThat's really interesting. What are other patters that you have been paying attention to? Have you been writing about more patterns?"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jul 23, 2011", "message": "I'm guessing that for the software sites (esp serverfault and programmers) there is a big weekday/weekend difference in posting. \nThe analysis does assume that 'days' are independent - if your arbitrary start day was a monday would there be a big change between day 5-6?"}, {"author_name": "Qiaochu Yuan", "gravatar_hash": "5f83d135a7238dbd0db34da79f9f98f5", "author_url": "http://qchu.wordpress.com", "date": "Jul 23, 2011", "message": "@John: well, I wanted to use months, but I wanted periods of the same length. I also wanted to be able to divide them up into weeks if necessary, since posting exhibits a fairly reliable weekly periodicity. So I've been using 28-day cycles starting from January 1st, 1970.\n\n@msh210: after seeing the SuperUser data, I realized that the rate at which people post on one day could be affected by weird variables like migration and how easy it is to convince yourself you know the answer, but it seemed to me that posting on two or more days wouldn't have the same problem to the same degree. I could be wrong, of course.\n\n@Katty: well, I didn't use linear regression there. Doesn't the visual fit just seem really, really good to you, though? \n\n@mgb: I'm not sure I understand the question. Any 28-day cycle has the same number of a given day of the week as any other. (I'm not looking at consecutive days posted, but total days posted.)"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jul 23, 2011", "message": "But it does change the posting rate for day+1 and day+2 if day was a friday compared to a monday."}, {"author_name": "Katty", "gravatar_hash": "2cb7c37b7709e80c997af4a798265e5f", "author_url": null, "date": "Jul 23, 2011", "message": "@Qiaochu: Saying \"the visual fit seems really good\" means you're doing a linear regression using the [\"eyeball norm\"](http://www.google.com/search?q=eyeball+norm) rather than the typical L2 norm."}, {"author_name": "Qiaochu Yuan", "gravatar_hash": "5f83d135a7238dbd0db34da79f9f98f5", "author_url": "http://qchu.wordpress.com", "date": "Jul 23, 2011", "message": "@mgb: I'm still not sure I understand what you mean. I'm not taking the order of the days into account...\n\n@Katty: okay, fair. But like I said, I don't really need a statistically validated fit. It's just convenient for me to have a reasonably compact way to roughly describe the distribution of activity."}, {"author_name": "T. Gu", "gravatar_hash": "96bc456c5819b8127bf3847e548617ae", "author_url": null, "date": "Jul 24, 2011", "message": "Great post, Qiaochu! I'm always floored by your answers on Math.SE (and MathOverflow), so it's awesome to see this kind of blog post here from you as well.\n\nUsing deviations from Lotka's law as a metric of healthiness is a neat idea. Do you have other healthiness metrics that support the notion that StackOverflow and Math.SE are healthier than SuperUser and Serverfault? (I know that the Area 51 site has healthiness metrics for beta sites, but not sure if these are data-driven or just intuitively chosen.)"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jul 24, 2011", "message": "@Qiaochu Yuan: sorry I misunderstood the graphs. \nI thought they were cumulative, ie. Number of people who posted on Day 0 who then posted on Day+1, Day+1+2, ....\n\nAs in the consecutive days stats in the user page"}, {"author_name": "ravenspoint", "gravatar_hash": "febff21383acf755f8b375c322e36f2b", "author_url": null, "date": "Jul 24, 2011", "message": "\"there are more users posting between five and sixteen days than expected and fewer users posting more than sixteen days than expected.\"\n\nAlice is addicted to SO.  She checks every working day, browsing until she finds a question she can answer.  Occasionally, she is really busy, and doesn't have the time.  Sometimes she is on leave.  Sometimes she can't find a question she can answer.  On a good month she posts on almost 20 days, because there 20 working days in a 28 day period.  Other times she posts on fewer days, but never, ever more than 20.\n\nI expect there are a lot of people like Alice"}, {"author_name": "tzenes", "gravatar_hash": "947c457cb4e5480cb8b2f09e49794834", "author_url": null, "date": "Jul 25, 2011", "message": "I'm not sure I fully appreciate the value of this post.  Your underlying thesis here seems to be that a healthy Stackexchange tends to have a user frequency graph of a Power Law with certain parameters.  While this is an interesting observation is it not a) surprising, or b) terribly useful.  Suppose we invent a SE who's user frequency has an unnatural \"bump\" around the 4-5 day point; in other words, some significant portion of the user base is on a much slower cycle.  This would not be characteristic of a standard \"healthy\" SE based on fitting the curve to your power law.  However, maybe this new SE has billions of page views and tons and tons of activity.  Does this make the new SE \"unhealthy\"?  Is fitting the user data to a power law a measure of health, at all?\n\nI agree it is interesting, but I think for it to be practical you will have to take it to the next level."}, {"author_name": "Qiaochu Yuan", "gravatar_hash": "5f83d135a7238dbd0db34da79f9f98f5", "author_url": "http://qchu.wordpress.com", "date": "Jul 27, 2011", "message": "@tzenes: I think you're putting words in my mouth. I didn't say anything like \"this should be our <i>only</i> measure of health.\""}, {"author_name": "Thomas", "gravatar_hash": "739987b18c70f7e1620239e5affb3cd2", "author_url": null, "date": "Aug 25, 2011", "message": "Dear Qiaochu\n\nWhat books/websites did you use to learn SQL?\n\nRegards,\n\nThomas"}]}