{"response": [{"author_name": "qiaochu", "gravatar_hash": "5f83d135a7238dbd0db34da79f9f98f5", "author_url": "http://qchu.wordpress.com", "date": "Jul 20, 2011", "message": "Quick clarification: the percentages there are for the first vote (within 24 hours) on the first post that a new user makes (within 24 hours), if that first post happens to be an answer."}, {"author_name": "Steve Wortham", "gravatar_hash": "7c4d1e4f8701946b8391d009d8d85221", "author_url": "http://www.silverlightxap.com/", "date": "Jul 20, 2011", "message": "There is a misconception about \"exact match domains.\"  It's true that the domain name can be important, but not for the reason you might expect.  \n\nIn fact Google doesn't put any direct emphasis on the domain name when determining relevance.  However, they do base relevance heavily on the link text that is used.  And because of the fact that many people use the domain name itself in the link, e.g. stackoverflow.com, then the site will rank well for the search \"Stack Overflow\".  \n\nThis importance that Google places on the link text goes for both internal and external links.  So you can use this to your advantage both in choosing your domain name, as well as choosing the wording of your internal links.  By the way, this was one of the more important things I learned from my SEO class with Bruce Clay."}, {"author_name": "Alexandre Jasmin", "gravatar_hash": "ebb42d2495567b4d80d528b06d5f3097", "author_url": "https://twitter.com/ajasmin", "date": "Jul 21, 2011", "message": "I found the bingo card story interesting.\n\nI actually developed a bingo card creator for my teacher mom once. It printed out grids of Halloween pictures with different arrangements.\n\nMaking this a business never crossed my mind though ;-)"}, {"author_name": "Gordon", "gravatar_hash": "f65024c57e12069c25a9bbfe2e1cf601", "author_url": null, "date": "Jul 24, 2011", "message": "Tufte would have a few things to say about that chart..."}, {"author_name": "BradC", "gravatar_hash": "c5c2165949f71bcd1fafbd8e694ab5f2", "author_url": null, "date": "Jul 25, 2011", "message": "I think that Patrick was actually hoping that you would link to his actual Halloween bingo page, which is http://www.halloweenbingocards.net/ and not just his main page."}, {"author_name": "Doug T", "gravatar_hash": "680652ec4feb1969c39cfba008214ea9", "author_url": "http://ilearnstuff.blogspot.com", "date": "Jul 25, 2011", "message": "Funny that the \"Ask Me Anything\" for google+ on reddit is riddled with links to share on facebook and twitter but no ability to share on google+."}]}