{"response": [{"author_name": "Justin Nelson", "gravatar_hash": "d787caaf04b85641692a24099fcee990", "author_url": null, "date": "Jul 06, 2011", "message": "Inline editing!!!  Yay!  Thanks."}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://quickmediasolutions.com", "date": "Jul 07, 2011", "message": "I am particularly interested in the mobile theme you mention right at the end. I just finished making a bunch of changes to StackMobile and I would greatly appreciate it if you would take a look at how I've laid out the content there. I would certainly be willing to share ideas / things I've learned from creating the site and hopefully my work could benefit this initiative."}, {"author_name": "Andy", "gravatar_hash": "3ec30f7629f101238ef76261d913fdc1", "author_url": null, "date": "Jul 07, 2011", "message": "Maybe someone will correct me, but I believe there were some incorrect facts about Mono/MonoTouch made by Joel.\n\nThere was a comment about Mono transforming into MonoTouch (or something similar). However, Mono is a separate entity: an open source implementation of the .NET Framework [1] (which is on GitHub [2]). MonoTouch and Mono for Android are commercial products owned by Novell built on top of Mono. It's not clear if MonoTouch is going to be maintained by Novell, but Miguel's new company, Xamarin, is going to be creating a new \"MonoTouch\" and Mono for Android [3] - they will obviously have to be called something else as MonoTouch is a Novell/Attachmate product.\n\nAlso Joel mentioned the ASP.NET implementation on Mono was dead, but I can't see to find a reference for this - GitHub still seems to be getting commits in this area and the mailing list is still active.\n\nAnyway, I enjoyed the podcast - dotnetrocks have had a few recently about the iphone/ipad/android space and as this seems to be the way things are going it'll be interesting to see if Microsoft can get back into the consumer space, or if it'll for the way of enterprise only - i.e. and Oracle/SAP/etc.\n\n[1] http://mono-project.com/What_is_Mono\n[2] https://github.com/mono/mono\n[3] http://tirania.org/blog/archive/2011/May-16.html"}, {"author_name": "Joe Shaw", "gravatar_hash": "617b24273a70222722b543cfe8beed9c", "author_url": "http://joeshaw.org", "date": "Jul 07, 2011", "message": "The Mono team wasn't spun off into Xamarin, Novell laid off the entire Mono team.  Miguel created a new startup and re-hired much of the former team.  Novell still owns the (now presumably abandoned?) MonoTouch and MonoDroid products, and Xamarin is reimplementing them from scratch to be source-compatible."}, {"author_name": "Matt Ellen", "gravatar_hash": "0552c7e9c1da444137e8b235576e516d", "author_url": "http://matthewellen.co.uk", "date": "Jul 07, 2011", "message": "The Australian dev day is 24th - 25th of Australia?\n\nHas a new calendar been instituted? Java will be really screwed."}, {"author_name": "Rory", "gravatar_hash": "3e6f0c5e5dd694b5c88ac942df905674", "author_url": "http://rory.me", "date": "Jul 07, 2011", "message": "@Joe\n\nI don't remember exactly what we said, but if it came off as implying that the Xamarin team is somehow related to Novell, it was unintentional. We moved quickly through various parts, so if it was unclear, then... well, yeah, it's a bit of a whoops and worth mentioning.\n\nIt's easy to get caught up in the moment and forget that some things need to be contextualized. I've been so into MonoTouch that I forgot other people are into other things (that was when I stopped to ask if MonoTouch itself needed to be explained).\n\nSo, in the clarification department, I wanted to add that, when talking about the brilliance of the team and what parts of MT need to be rewritten to make Xamarin Studio, I didn't go into enough detail about projects like MonoMac, the maturity of MonoDevelop on OS X, and how what you were really buying when handing money over for MonoTouch wasn't the entire package (MonoDevelop, etc.), but the few command line tools that let you build and deploy to devices.\n\nIt's a gross oversimplification, but I think mtouch is the real product, and it's difficult to to distinguish what's reusable and what has to be rebuilt.\n\nSince they already have the biggest hurdle out of the way (\"How are we gonna do this?\"), I think Xamarin Studio is largely a test of how quickly they can type.\n\nI wish I could go back and cover that in more detail. I got the MT/XS compatibility part in, but I should've said more. The biggest concern I hear about MonoTouch (once I've explained MT itself) is about whether it's going to stick around.\n\nEven though XS and MT aren't the same product, being able to fire up XS and pick up where you left off with MT would've answered that question.\n\nHopefully listeners who need to know that will stop by and read these comments...\n\nThank you for commenting - aside from clarifying, it also gives me an idea of what other content ought to be discussed further (not just here, but when talking to others about what XS and how it relates to MT)."}, {"author_name": "macbirdie", "gravatar_hash": "4e835636502acb7a084338458eaae914", "author_url": "http://onfoot.biz", "date": "Jul 08, 2011", "message": "Best episode after the podcast reboot so far!"}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyv.blogspot.com", "date": "Jul 11, 2011", "message": "This Rory Blyth dude is so scatterbrained."}, {"author_name": "Ian", "gravatar_hash": "b7d9dad6962c4d46acac3d556669dacf", "author_url": null, "date": "Jul 11, 2011", "message": "God that takes a bit of getting going doesn't it. 5 mins in I'm listening to how your relationships have unsurprisingly failed, and something about an old video of an old t-shirt."}, {"author_name": "THenrich", "gravatar_hash": "886427a445a180eb6618d77ee4ec4894", "author_url": null, "date": "Jul 14, 2011", "message": "You have to know how Rory operates to understand him, otherwise you might be put off. I have listened to him in early dotnetrocks days and read his blog. All I can say is that he's different and interesting person."}, {"author_name": "Glenn", "gravatar_hash": "d1cc522021a821538b14ba8bb5ebcc14", "author_url": null, "date": "Jul 15, 2011", "message": "Joel really ought to avoid talking about Apple development until he's more versed in it. If you don't know what WebObjects are, don't know you can write iOS apps mainly in C or C++ in addition to Objective-C, etc, then you should hold off. \n\nGenerally love the podcast as long as it keeps away from specifics of StackOverflow policies."}]}