{"response": [{"author_name": "Mike Stone", "gravatar_hash": "c8ba7ccacc70a7b826184e8d717bfcd7", "author_url": "http://smellsblue.blogspot.com", "date": "Oct 12, 2008", "message": "Well, I'm of the opinion anything that gets upvoted is game, and the community will correct itself without the need to define what fits and what doesn't, or what should be closed or not.\n\nTags, upvotes and offensive should all be able to work together to just show us what we want to see and hide the noise (as Joel has pointed out too in the podcast).  Those all have worked well and I still haven't seen closing questions being needed above and beyond those other tools.\n\nI've actually grown quite sick of seeing a particular sub group of people close questions that I think should have stayed.  As a direct result, I have weened myself off my addiction to Stack Overflow.\n\nI may come back or drop in now and then, but I'm glad to not have to see that group in action any more.\n\nJeff and Joel, you guys have done a great job with the site, but I really don't like the behavior that the Close Question feature has created."}, {"author_name": "Pat", "gravatar_hash": "b98f52ee9944357a8ef16191460ee393", "author_url": null, "date": "Oct 12, 2008", "message": "I think part of the problem is that almost none of the questions on the \"Highest Voted Questions\" page fit your criteria for a good question.\n\nIf I as a new user look at the highest voted questions I will take the impression that a good question is about discussing SO (like the faq / the scrapper) favorite programmers things (the cartoon) ...\n\nSuch questions can be useful, but I feel like you are sending two conflicting messages about what are good questions.\n\nI dno't have a solution but maybe some things can be tried like, when a question goes into community mode, points should also be hidden / become irrelevant for the whole ranking system too like they become for the asker. \n\nOr maybe the \"poll\" or \"stackoverflow\" tag can trigger a no points/no badges mode ...\n\nUltimately, this doesn't affect me (as a regular user) much except I feel it is such a wasted opportunity, the \"Most Voted\" and the \"Hot\" tab are next to useless when they could have been a source of interesting questions / new things to learn, if it wasn't for that."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 12, 2008", "message": "> I’ve actually grown quite sick of seeing a particular sub group of people close questions that I think should have stayed\n\nI find this reaction a bit strange as the percentage of closed questions is *MINISCULE* relative to the overall total number of questions. \n\nRight now there are 451 closed questions out of 27,683 total questions. You feel that 1.6% of the questions are so good and so unjustly closed that they're worth quitting the site over?\n\nI monitor the list of closed questions every day and over 90% of the time I completely agree with the reasons. The only time I disagree is usually because a user closed their own question as they thought it was \"done\".\n\nI'm not against your suggestion to make closing work more like a vote, but it's simply a question of balancing development time against other features we DESPERATELY need. I simply disagree that there's this earth-rending problem here, and that's based on me eyeballing the data every. single. day.\n\n> the “Most Voted” and the “Hot” tab are next to useless when they could have been a source of interesting questions / new things to learn, if it wasn’t for that.\n\nHave you tried looking at \"Hot\" within a particular tag?\n\nhttp://stackoverflow.com/questions/tagged?tagnames=xml&sort=hot\n\nthis also works for tag combinations if you space delimit them -- the \"related tags\" sidebar does this for you now."}, {"author_name": "Bno", "gravatar_hash": "513160ef4ed21dff0c1a59170ef8e79c", "author_url": null, "date": "Oct 12, 2008", "message": "The \"your not allowed to ask subjective / argumentative questions\" statement makes me feel a bit sad. It feels like finally having been invited to a party with all the interesting people I've always wanted to meet. But... what a disappointment, the host doesn't want us to have an interesting conversation.\n\nAnd (see Pat's reply) people do really appreciate the opportunity to talk about things they can't talk about at home.\n\nI don't see a real problem with allowing these questions. The most important goal of this website is to answer programming questions. And this web site gives the correct answers amazingly fast. Is this goal in danger?\n\nThe problem then perhaps is that some popular guests get a lot of reputation. They didn't earn it with smart answers but just because they know how to draw attention. That's unfair isn't it?\n\nBut as long as I can keep the satisfying feeling of helping somebody out with an answer to a 'real' question, getting answers to questions myself and now and then enjoying a good argumentative discussion, I like the party."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 12, 2008", "message": "> I think part of the problem is that almost none of the questions on the “Highest Voted Questions” page fit your criteria for a good question.\n\nThe problem is that there are really two audiences for a lot of questions. If you're into Xml, you aren't going to spend a lot of time on the home page, you'll be going to the Xml tag:\n\nhttp://stackoverflow.com/questions/tagged/xml\n\nOr maybe here:\n\nhttp://stackoverflow.com/unanswered/tagged/xml\n\nThen when you get bored with that you might try your hand at the lighter questions that cover broader programming topics, which are allowed.\n\nThe goal is to get people to use and like the site, not for growing my personal wealth, but because it is more *useful* the more quality programmers the site attracts and retains. That means moderators (all four of us) can't be the jackbooted thug that crushes people's occasional fun, as long as it is mixed with some real technical questions. \n\nAnd it is..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 12, 2008", "message": "> But… what a disappointment, the host doesn’t want us to have an interesting conversation\n\nThe host would prefer that you didn't discuss politics or religion in his \"house\". \n\nNot quite the same thing."}, {"author_name": "Barry Kelly", "gravatar_hash": "2facd380c5bdfbaa1a1e9c657578f135", "author_url": "http://barrkel.blogspot.com/", "date": "Oct 12, 2008", "message": "Something that disheartens me is that I observe a kind of circular loop in the system.\n\nWhenever I see someone with a crazy amount of reputation, say &gt;4000, I check out their profile to see what kinds of questions and answers they posted to get there. I invariably see answers to subjective-style questions filling the top of their sorted answer-list.\n\nYou can see where this leads: the people with most power, i.e. most rep, are those which play the popularity game best, which in turn does *not* mean creating good answers to technical questions, but rather posting zeitgeisty answers to pop questions. And I'm not sure I want to play in a community dominated by such folks.\n\nTake for instance top-rated user \"Michael Stum\", who has asked such amazing questions as \"what good technology podcasts are out there\", and provided insightful answers to such questions as \"one piece of advice\" and \"what's your favorite programmer t-shirt\".\n\nThe basic law of community websites still holds: those with most spare time (i.e. have nothing better to do) to play the game are the ones who end up holding the most cards. I don't have time for that, and it bothers me, so I become less likely to participate."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Oct 12, 2008", "message": "There are at least two *major* factors involved here: jealousy, and idealism. \n\nBarry Kelly brings up the ugly little secret that, IMHO, underlies a lot of these discussions: resentment of high-rep users. I actually expected to see this take the form of a backlash against editing, but closing seems to have become the lightening rod for it. Perhaps this is because tag editing, wiki-mode editing, and editing of one's own posts allow a bit more of a staggered introduction to the system, while the system for closing is almost opaque to users with &lt; 3K rep points. So while editing is still less open than perhaps it should be, the *impression* is that it is generally available while closing is restricted to some sort of undeserving cabal.\n\nJeff, you actually seem to help reduce this by simply closing a few questions yourself, leading by example. That said, I fully expect this attitude to persist in *some* form regardless of how many people have access to the feature or are familiar with its behavior. Seeing your question closed just feels like a put-down, and users who feel so injured will always find some excuse for their attitude: whether that's ignoring Stum's long history of *good* Q&amp;A in favor of picking out a handful of subjective and OT responses, or just throwing a tantrum and yelling \"censorship!\" \n\nThat's the Internet for ya...\n\nMike Stone's reply embodies a somewhat more high-minded ideal: that voting alone will result in a self-policing site. This attitude persists on many other sites, but is is helped greatly here by Joel's endorsement. It sounds great: Democracy FTW! In practice, it rarely works for this purpose; all it takes to subvert voting as a means of content control is a *temporary* majority of active users who find the topic in question appealing and up-vote it. Programmers have broad and varied interests, and almost anything can and will find an accepting audience: non-programming IT questions, rants and put-downs, commentary on last night's football / hockey / cricket match... You'll see it on every newsgroup, forum, and message board, and although resented by those users *not* in the OT majority, it generally does no harm... but, for SO, the cost is higher, as such \"popularity\" voting subverts the entire reputation system. After all, why take the time to post a detailed, well-researched answer when a rant on the Cubs will take less time and gain more rep? Not that all or even most users would willfully game the system that way, but when even a few users do so it ultimately de-emphasizes the efforts of all on-topic Q&amp;A... Again, see Barry's post.\n\nBTW, Barry: you're missing the point if you think \"holding lots of cards\" is the purpose of using SO. A good question with a good answer is valuable, regardless of the rep level of the users involved."}, {"author_name": "Pat", "gravatar_hash": "b98f52ee9944357a8ef16191460ee393", "author_url": null, "date": "Oct 12, 2008", "message": "Jeff,\nThanks for taking the time to answer my questions/concern, I will sure try out your tips."}, {"author_name": "1800 INFORMATION", "gravatar_hash": "acc637690f49e2b5a2146deb17874d6f", "author_url": "http://stackoverflow.com/users/3146/1800-information", "date": "Oct 12, 2008", "message": "Hi Barry,\n\nmy user information is here:\n\nhttp://stackoverflow.com/users/3146?sort=reputationhistory#sort-top\n\nAs you can see I have nearly 5000 reputation so I feel fairly well qualified to comment on this topic. I think that most people with high reputation tend to try not to focus on subjective discussion topics because they are actually pretty boring. After a while of contributing to SO, you tend to start skipping over the \"What is your favorite text editor\" questions.\n\nI've never actually closed a question so there isn't any call for resentment on that part. I have tried to focus mainly on technical questions, and I think my rep history shows that.\n\nWhile I have found that some subjective or controversial questions tend to attract more attention and hence more votes, that shouldn't really be the fault of the person that posted it, if something gets a bunch of votes you should be looking at the people that voted for it.\n\nOne thing you might be missing Barry, is that high rep users tend to spend a lot of time in the site, looking for interesting questions to answer or ask. They do this because it is fun and they like it and because they care about the site, not because there is some kind of weird power game going on. It isn't really that hard to get to 3000 points anyway, so once you get there you will have just as much \"power\" (i.e. not much) as any of the other high rated users."}, {"author_name": "Bruce Atkinson", "gravatar_hash": "0c241cebbad2e93625acc181329223cc", "author_url": null, "date": "Oct 12, 2008", "message": "Jeff, I agree with Mike Stone. I exchanged e-mails with you on this very subject as soon as open beta started.  I wish you would agree with Joel on this.\n\nWhile you say the number of closed questions is low, I have had at least 5 questions closed while I was answering them.  I have also wanted to answer questions that were already closed. I recently had a case where comments I left on a closed question were deleted. Because of these things I am not spending as much time on StackOverflow as I was.\n\nTo me if you are closing a question because it is a duplicate, a link to that open duplicate question should be posted.\n\nIf it is closed because it is \"subjective and argumentative\" then all such questions should be closed.  There are way too many of them on open on StackOverflow right now to try to draw the line.  I prefer letting the voting take care of them."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 12, 2008", "message": "> I have had at least 5 questions closed while I was answering them\n\nCan you provide links to these? It's hard for anyone reading this to judge when people can't provide evidence for their positions.\n\nLet's stick to actual evidence and numbers and examples when possible, rather than vague and broad generalites.\n\nAs of RIGHT NOW -- I'm sitting in SQL Management studio running the queries:\n\n453 closed questions out of 27,843 total questions"}, {"author_name": "Mike Stone", "gravatar_hash": "c8ba7ccacc70a7b826184e8d717bfcd7", "author_url": "http://smellsblue.blogspot.com", "date": "Oct 12, 2008", "message": "Jeff, I'll give you some proof of why I think closing questions are bad.  It's easy to glaze over the issue with the low close question number.  It may be low, but that doesn't mean it's good that they are closed.\n\nFirst of all, I saw this gem closed:\n\nhttp://stackoverflow.com/questions/158875/low-energy-low-cost-247-hardware-linux-box\n\nI am quite interested in buying a low power machine, and if I hadn't re-opened it, I may not have seen the awesome responses there.  I know you have posted on your blog about low power machines too, so if you can talk about it on your programming blog, why not people ask it on your programming forum?\n\nThe next 2 that I reopened were VM questions:\n\nhttp://stackoverflow.com/questions/151327/sharing-files-between-vm-and-host-using-virtual-pc-2007\n\nhttp://stackoverflow.com/questions/152901/horrible-vmware-keyboard-shortcuts\n\nI use a VM every day at work nowadays, so using one effectively is pretty darn important to me.  Just because not all programmers do doesn't mean we shouldn't be able to help each other out with them.\n\nThe final one I want to cite doesn't strictly belong on the site, but I reopened it because c'mon... it was a fun question, and I don't see why we can't have some fun questions:\n\nhttp://stackoverflow.com/questions/175545/worst-technobabble-youve-ever-heard\n\nIf you are afraid of the questions that will get popular that are too far off topic... why not the ability to make the questions wiki editable (in a democratic, voted way), so that asker and answerer alike won't get penalized or encouraged... this will let the fun noise exist without it bloating reputation.\n\nAnd again... the bad questions, as far as I can tell, get downvoted already, so closing questions is just NOT NECESSARY in those cases (the downvotes should hide them effectively so that closing them does nothing to enhance voting).\n\nDupes are probably the only use of closing that I'm not against (and seems to be the biggest use that I've seen), though I think dupes could benefit each other if we had a way of linking them together, so you go to one and you see them all... which would mean closing is unnecessary yet again.\n\nIt's not so much the bad questions being closed that have caused me to lose interest in the site... those are already dealt with by voting, so they don't bother me with or without the close feature.  It's the gems I cited above that get closed that have disheartened me, and I definitely think they are unjustly closed and are worth quiting the site over."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Oct 12, 2008", "message": "&gt; Can you provide links to these?\n\nHere's one of them:\nhttp://stackoverflow.com/questions/189766/whats-the-intrinsic-value-of-the-object-oriented-programming-philosophy"}, {"author_name": "Bruce Atkinson", "gravatar_hash": "0c241cebbad2e93625acc181329223cc", "author_url": null, "date": "Oct 12, 2008", "message": "Jeff, I e-mailed you some specifics when the beta first went open to the public. You replied to me and said you would have closed it also.\n\nI use google reader to follow the RSS link for questions tagged subjective.  I find them interesting. \n\nThe link that Shog9 has provided is a recent link that was already closed when I went to look at it.  It is also a subject that I find a lot of programmers go through if they get frustrated with OOP and think they have to always use it. The poster may have gotten into a rant, but the main question is worth while talking about it.  I had comments deleted from that question.\n\nIf you look at my reputation chart it is obvious that I got frustrated about a week after the beta went open. I find it interesting that people above 3000 can't agree on what should be closed. That to me is reason enough not to do it."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 12, 2008", "message": "Well, if we're waiting for people to be in perfect agreement, I think we might be waiting a very long time..\n\nThe *primary* focus of Stack Overflow isn't discussion, but answering of questions. This may dissatisfy some."}, {"author_name": "Eric Z. Beard", "gravatar_hash": "62cc585b9fd3ee7182dadbd09a7f4b47", "author_url": null, "date": "Oct 13, 2008", "message": "I will chime in here because I am the guy who goes in and re-opens closed questions when I don't agree with the person that closed them.  In fact, the very question you used as an example (by Adam) is one that was closed quickly after it was asked.  I re-opened it.\n\nThere were a few days when I was really active in re-opening questions, and it was total warfare.  Part of the reason that not so many questions get closed now is because the closers got sick of it.\n\nSince closing and opening is totally subjective, I see nothing wrong with making subjective decisions to re-open as many questions as I can.\n\nDownvotes and Offensive should be sufficient.  We don't need regular users like me arbitrarily closing questions just because it doesn't fit our conception of what belongs on the site.\n\nAs for the FAQ, honestly, it's irrelevant.  99% of the people who come to the site will not read it.  I stopped reading it after it turned into the multi-page behemoth that it is now.  There are only two things that matter: what the site allows you to do, and how the community judges your actions."}, {"author_name": "Ande Turner", "gravatar_hash": "43b502e6b5204fc75ddd66f050784e22", "author_url": null, "date": "Oct 13, 2008", "message": "I read this and thought \"hmm, I remember answering something like that...\"\n\nThe Question that I was thinking of was originally phrased like this:  \n\"Are questions about programmers not programming-related?\"\n\n... and lone behold they picked my somewhat idealistic answer:  \n\"Questions posed by programmers troubled by licensing infringements or a programmers wage concerns etc . . . are inextricably linked to programming, because they're facilitating the completion of a program.\"\n\nI think I can safely say Marxidad and I both felt this served as a good measure of where the questions go from acceptable to unacceptable.\n\nJeff, do you feel that this distinction is anyway definitive of what lies to either side of the 7th point raised by Adams poll?  Or would it be one step beyond the original intent?\n\n( Oh, the Captcha reads \"said rudely\". I certainly wasn't trying to be! ;p )"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 13, 2008", "message": "> I see nothing wrong with making subjective decisions to re-open as many questions as I can.\n\nThis is fine; all I ask is that you only open things you feel *strongly* about.\n\nIf you're on the fence -- about opening OR closing, I am not playing favorites here -- then leave it be.\n\nThat is how I do it, so I'm not advising you to do anything I don't do myself. If I see a question that I /could/ close but I don't feel *strongly* it should be closed, then I don't close it."}, {"author_name": "Eric Z. Beard", "gravatar_hash": "62cc585b9fd3ee7182dadbd09a7f4b47", "author_url": null, "date": "Oct 13, 2008", "message": "@Jeff, agreed.  I don't just re-open blindly.  I only do when I think it really is something that has value for the community."}, {"author_name": "Bobby Jack", "gravatar_hash": "9b5c260dc8b7374186b3bebc28b08ce7", "author_url": "http://www.premierpundits.com", "date": "Oct 14, 2008", "message": "\"Questions posed by programmers troubled by licensing infringements or a programmers wage concerns etc ... are inextricably linked to programming, because they’re facilitating the completion of a program.\"\n\nBy that argument, questions about the economy, environment, reproduction, nutrition, and education are all just as viable. It's very difficult to draw a line between \"programming-related\" and \"everything\" because \"related\" is such a subjective concept.\n\nWhat originally interested me about SO was the 'mailing-lists for the web' concept. The mailing lists I subscribe to have a tradition of quick question/answer turnaround within a specific domain. While discussions do occasionally arise, questions such as \"what is your favourite food\" never do. Such questions seem like either the bored irrelevances of people with time to waste, or attempts to game the system.\n\nTo those claiming that the community will police itself: Jeff merely wishes to clarify what \"programming questions\" means. If you don't wish to allow him this clarification, you might as well desire any mention of \"programming\" to be removed from the site - it should just say \"Ask a question\" on the front page, and we'll see it turn into Yahoo Answers. While the community should have a certain level of self-regulation, that community needs to be formed first, and Jeff wants some say over who belongs to that community, rather than it just being invaded by the great unwashed.\n\nI wonder if there should be a separate, more regarded, metric purely based on rewarding what the site is intended for: the best answers. Filter bad questions out and give 1 point for the best answer to each. Just a thought."}, {"author_name": "Dillie-O", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Oct 15, 2008", "message": "When you close a question as a duplicate, can you provide a link to the original question so that future users stumbling upon the question will know where to read/answer? I haven't \"jumped into the flow\" yet this morning, so I haven't checked things out yet.\n\nHave you considered spawning off \"meta overflow\" yet? I'm half joking and half serious when I say that you could use the same model you have here, but \"loosen\" the strings a little to allow those folks to ask their \"what's the best network sniffer available\" type questions and let folks answer accordingly. \n\nI'm in the same camp that is overjoyed at being able to have access to all of these gurus and want to ask some more of the subjective type questions, but also respect what you're set out to accomplish and want to help fulfill that."}, {"author_name": "Bobby Jack", "gravatar_hash": "9b5c260dc8b7374186b3bebc28b08ce7", "author_url": "http://www.premierpundits.com", "date": "Oct 16, 2008", "message": "The problem with just closing questions as duplicates is that they hang around. Even linking to the 'original' question means an extra layer of URLs to navigate to reach the answer. And they're still indexed by search engines, annoyingly.\n\nClosed questions either need to be hidden to a much greater extent, or removed altogether, at least for certain closing reasons."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Oct 16, 2008", "message": "Bobby Jack: closed dup questions that \"hang around\" have the perverse advantage of providing an additional \"hook\": users who, like the author of the dup, couldn't figure out the right search query for the original Q&amp;A, may still find the dup and follow the link to the correct answer when otherwise they would have been left empty-handed (or on expertsexchange)...\n\nThat said, a dup-specific UI that accepted a destination and automatically set up forwarding would be nice."}]}