{"response": [{"author_name": "Justin Yost", "gravatar_hash": "83149adc0e0366baebe19fcaed5f7996", "author_url": "http://www.yostivanich.com/", "date": "Oct 28, 2008", "message": "Wow, that really bites that SQL 2008 is slower. Good to hear otherwise that StackOverflow is growing at such a pace."}, {"author_name": "Douglas F Shearer", "gravatar_hash": "b1edc6a4aa373d980b49e600923df552", "author_url": "http://douglasfshearer.com", "date": "Oct 28, 2008", "message": "In-database full-text search has never seemed to be that strong in any DB server.\n\nHave you considered an external indexing solution such as Lucene?"}, {"author_name": "Sean", "gravatar_hash": "78d165178829284e853a42dc2aa493a8", "author_url": null, "date": "Oct 28, 2008", "message": "Why are you upgrading to 2008, then?"}, {"author_name": "czemike@gmail.com", "gravatar_hash": "779cbaf6a14fc4438966108193bb7214", "author_url": null, "date": "Oct 28, 2008", "message": "So is the next upgrade to separate the database into a read-only or in-memory segment optimized for reads and a transactional segment meant for writes..... or will you be moving the back end to a true enterprise DB server like Oracle or DB2?"}, {"author_name": "AugustLights", "gravatar_hash": "bcf669bee4cfec75cb72075aca55c4bb", "author_url": null, "date": "Oct 28, 2008", "message": "Congrats, now finally Hanselman can get off your case on that issue..."}, {"author_name": "AugustLights", "gravatar_hash": "bcf669bee4cfec75cb72075aca55c4bb", "author_url": null, "date": "Oct 28, 2008", "message": "How did you guys set the Read Comitted level server-wide in 2005/2008 like you mentioned on the Hanselminute podcast? Can't seem to find that. Or should I open an SO question? :)"}, {"author_name": "Paul Batum", "gravatar_hash": "b22a4ad7300801ab20c21c96b1953071", "author_url": null, "date": "Oct 29, 2008", "message": "So why not just continue to run SQL Server 2005 and use the 2008 client tools?"}, {"author_name": "Brent Ozar", "gravatar_hash": "77f776c2eaf0cc691e8a0880bb8a191f", "author_url": "http://www.brentozar.com/", "date": "Oct 29, 2008", "message": "@AugustLights - that isn't a fix for the types of loads SO's having because they're constrained to the full-text engine.  The full-text engine is just burning too much CPU to answer the queries.  They do have a few locking issues, but it's relatively small compared to the massive impact of the full-text engine.\n\n@czemike@gmail.com - the short-term fix was to cache the full text search results instead of rebuilding them every time.  It's a bummer, because I wish they could get instantaneous results built from scratch for every page view in real time, but sometimes caching is a better answer than changing architectures or a costly rebuild.\n\n@Paul Baturn - the 2008 client tools don't offer every feature when operating with SQL Server 2005.  For example, IntelliSense doesn't work when connected to a SQL Server 2005 box."}, {"author_name": "Rob Wells", "gravatar_hash": "8769281d99f8fe9c208fd6a926c383d1", "author_url": null, "date": "Oct 29, 2008", "message": "G'day Jeff,\n\nJust wondering why your going doen the separated SAS drive solution instead of heading towards a common SAN solution? I'm thinking of something like the excellent Nexsan SATABlade 1U solution."}, {"author_name": "Brent Ozar", "gravatar_hash": "77f776c2eaf0cc691e8a0880bb8a191f", "author_url": "http://www.brentozar.com/", "date": "Oct 29, 2008", "message": "@Rob Wells - as a former SAN admin, I would have bet that they would have a storage bottleneck too, but it's simply not the case.  They have zero drive queueing or latency issues.  Normally I'd tell them to separate the data/logs/tempdb/fulltext onto separate arrays right away, but that isn't anywhere near an issue yet."}, {"author_name": "Bobby Jack", "gravatar_hash": "9b5c260dc8b7374186b3bebc28b08ce7", "author_url": "http://www.premierpundits.com", "date": "Oct 29, 2008", "message": "I'd love to know what kind of traffic levels the site is seeing."}, {"author_name": "Grom", "gravatar_hash": "a14537020ec5b11fea3b956353724860", "author_url": "http://grom.zeminvaders.net", "date": "Oct 29, 2008", "message": "+1 to Lucene"}, {"author_name": "John Morrelles", "gravatar_hash": "3b86cc29e2aa43a431ee0cd6896033bf", "author_url": null, "date": "Oct 29, 2008", "message": "It still seems to me like the best tool for the job is SQL 2005 since full text performance is such a key element of the application. There's probably a Coding Horror post supporting that idea somewhere, eh?\n\nAnd if Intellisense is your other killer feature in 2008, there are lots of tools that provide that."}, {"author_name": "dlamblin", "gravatar_hash": "60fec2454b16f5fd5ec243fa98d71351", "author_url": null, "date": "Oct 29, 2008", "message": "I recall you discussing probably using lucene.net; I wanted to submit a question back then as to why you'd do that instead of A) building a simple java based lucene service, or B) using Solr, which is even simpler."}, {"author_name": "Bernard Dy", "gravatar_hash": "f3ac9b6f28ad2e46e86ddb85b217c6fd", "author_url": "http://www.burningends.blogspot.com/", "date": "Oct 29, 2008", "message": "I liked the \"site is down\" page...looked familiar. Was it from Fallout?"}, {"author_name": "Matt", "gravatar_hash": "1975f7a0352e7517ad4c4f399089b5dc", "author_url": "http://blog.web20studios.com", "date": "Oct 29, 2008", "message": "@Paul Baturn - If MS made the intellisense work in an intelligent way, like querying those super fast sys. tables they could have supported at least 2k5 and 2k8 back ends without problem, but then you'd have no motivation to upgrade your server to 2k8 and they'd make no money.  In fact they prob. do query the sys. tables, they just have an artificial check of the version first which disables the feature on 2k5"}, {"author_name": "Bryan", "gravatar_hash": "4a330b7317cb51cafd60b0c345922744", "author_url": "http://www.mediafly.com/", "date": "Oct 29, 2008", "message": "We migrated from Postgres's internal full text search to Lucene via SOLR and there is simply no going back.  The difference is night and day.\n\nNow, it's been YEARS since I used SQL Sever's full text search, but I can't praise Lucene enough.  It really is that much better."}, {"author_name": "Filip", "gravatar_hash": "9f4153be2cf81e0b6656e2761898ecfa", "author_url": null, "date": "Oct 29, 2008", "message": "I think Intellisense is not just tables, but also the whole T/SQL syntax. Probably they just did not have the time and good enough reason to add full or partial version of Intellisense for older versions of SQL."}, {"author_name": "Denis Churin", "gravatar_hash": "72422fdbf3f2e54fe3f878c985f74c73", "author_url": null, "date": "Oct 29, 2008", "message": "Hi Jeff,\nthe blanket statement that FTS is slower in 2008 is incorrect. There're indeed scenarios where it would be slower, mostly due to the massive rearchitecture of FTS that was done in 2008 to integrate FTS with the database engine. We also know of a couple of issues that we're looking at for a future CU. \nThere're key scenarios where FTS in 2008 is dramatically faster than 2005, particularly on \"mixed\" queries that have both relational parts (filters, joins) as well as search predicates.\nThe 7646 traceflag workaround you mentioned is targted at a specific case where there's contention between inserts/updates and queries. It will only helpful when such contention exists. Please see http://msdn.microsoft.com/en-us/library/cc721269.aspx for a more detailed discussion of the issue and some general recommendations.\nPlease contact me and we can investigate the issue you've hit in depth.\nThanks!\n-Denis."}, {"author_name": "Jesus DeLaTorre", "gravatar_hash": "2864c33de195efc0e94925fa39b26128", "author_url": "http://wasstock.com", "date": "Oct 29, 2008", "message": "You should release the database schema"}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Oct 29, 2008", "message": "Maybe you need to work with Microsoft's SQL Server guys to tune your database. FTS doesn't get slower than the older version for no good reason. A misconfiguration even a small one can have a big effect in the wrong way. Personally I heard little praise over the years about SQL Server's full text search. Maybe 2008 is much better.\n\nDid you do upgrade from 2005 to 2008 or a fresh 2008 install? I don't trust upgrades much."}, {"author_name": "Jon Kragh", "gravatar_hash": "3e9cbdc67744f960325f486d782c9b29", "author_url": "http://www.vastrank.com", "date": "Oct 29, 2008", "message": "I would love to hear some actual numbers on what is making a dual quad core SQL box melt down.\n\nSomething must be seriously wrong with FTS or there must be some bug somewhere in the app layer.\n\nIf you are starting to cache search queries, I would hope SQL is already doing this type of caching already.  (I know you guys are caching common stuff for users like chunks of the homepage already).\n\nI never used FTS, but I would hope the couple of guys/gals on the SQL team who know how to build a good cache would have taken care of this already.\n\nWould Google's Search Appliance be of any help taking into consideration your tagging stuff?\n\nBTW Keep up the great work!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 29, 2008", "message": "Denis Churin, thank you very much for responding -- Brent will be following up with you. He's building up a bunch of tests on 2005/2008 VMs and so forth with the actual data."}, {"author_name": "`Josh", "gravatar_hash": "495a64d940303ee6d0dcbede05c7f6aa", "author_url": null, "date": "Oct 30, 2008", "message": "Probably not the best place to post this, but finding this blog is difficult unless you know the address. Perhaps a link on the main page?"}, {"author_name": "Håvard Pedersen", "gravatar_hash": "c12c7bf227c9f6cd48cf86047da6595d", "author_url": "http://hp.fuzzy76.net/", "date": "Oct 31, 2008", "message": "\"new versions are supposed to be faster, right?\"\n\nHave you tried this thing called Windows Vista? ;) Or for that matter, compare Windows XP to Windows 98. :) If you want more features, the price has to be paid...."}, {"author_name": "Drejc", "gravatar_hash": "9b9319dade67212ce94a60fcaa09df6e", "author_url": "http://www.monex-finance.net", "date": "Oct 31, 2008", "message": "Hm ... somehow it seems to me that the site has become slower. Or ?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 31, 2008", "message": "All the slowdown you're seeing is due to 2008 full-text being dramatically slower than 2005 (for us, and our particular database, etc etc etc standard disclaimers). Brent is working with MS on the issue."}, {"author_name": "Seiti", "gravatar_hash": "a82181c1c41aa47fb6ed917592d24f92", "author_url": "http://seiti.eti.br", "date": "Nov 01, 2008", "message": "\"Have you tried this thing called Windows Vista? ;) Or for that matter, compare Windows XP to Windows 98. :)\"\nCompare Visual Studio 2005 to 2008..."}, {"author_name": "Ady", "gravatar_hash": "682a26089bbe57316ab2cc50689db0af", "author_url": "http://www.paperheads.co.uk", "date": "Nov 01, 2008", "message": "Looks like the second server is down, and as been for most of today."}, {"author_name": "Drejc", "gravatar_hash": "9b9319dade67212ce94a60fcaa09df6e", "author_url": "http:www.monex-finance.net", "date": "Nov 01, 2008", "message": "I'm not such a big fan of upgrading to the latest \"thing\" in the shop. As in most cases a proven solution is the better choice over the new and shiny one.  \nHave you considered downgrading to the 2005 version?"}, {"author_name": "Barry", "gravatar_hash": "f8c8444b35fff77d902a6e8f3b1d4a97", "author_url": "http://sqldev.wordpress.com", "date": "Jan 19, 2009", "message": "Microsoft have a fix on its way to improve the speed of full text. However, there is more to this than a simple fix. The new full text search is very different, it works better now if you don't overload your index with keywords and use multiple ISABOUTs or complex ANDs and ORs. Using normal JOINs where you can will improve the overall performance. I have lots of information on this if anyone requires it."}, {"author_name": "Mel", "gravatar_hash": "ed434c60b7654c83902c1b1fafefb3ec", "author_url": null, "date": "Feb 04, 2010", "message": "Barry, please post the info on the fix.  Is this something downloadable from MS site?  What's the KB article/patch number?"}]}