{"response": [{"author_name": "jjnguy", "gravatar_hash": "ddf71a8fc52a01e1ad726ee70b6e2a03", "author_url": null, "date": "Oct 15, 2008", "message": "I like the old couple dynamic that you guys have...In case you guys were wondering."}, {"author_name": "Chris Leary", "gravatar_hash": "8a402d20d15c0443ea4fe3207bf308a9", "author_url": "http://blog.cdleary.com", "date": "Oct 16, 2008", "message": "Thanks for answering my question guys! Good feedback from a now scale-tested karma approach. ;)"}, {"author_name": "Simon", "gravatar_hash": "7651e89032272b5cafa2f5fe21470ef0", "author_url": null, "date": "Oct 16, 2008", "message": "Is there an obvious connection between Joel's last blog entry about people gaming the system and stackoverflow or is it just me? So what happened to just forbidding doing something that is not wanted, like people downvoting somebody else?"}, {"author_name": "Frode Hernes", "gravatar_hash": "cc9cbbe786243f02b139d454a92a74f4", "author_url": null, "date": "Oct 16, 2008", "message": "But why is Stackoverflow the only podcast I have found that does not work on the Apple TV?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 16, 2008", "message": "> why is Stackoverflow the only podcast I have found that does not work on the Apple TV?\n\nWow, sorry -- don't know!\n\n> Is there an obvious connection between Joel’s last blog entry about people gaming the system and stackoverflow or is it just me?\n\nYou mean his column in Inc about the shoe stores? I don't think so. I think that's about the Fog Creek salespeople working on commission."}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://robspages.net", "date": "Oct 16, 2008", "message": "Swag suggestions: \n\nEarning a Gold level badge nets you a t-shirt with the Stack Overflow logo and the badge. \n\nEarning an \"Expert:%%\" badge gets some small SO trinket like a mug or something."}, {"author_name": "Lance Roberts", "gravatar_hash": "576cdd58ab7df19c6715121c7806bbf6", "author_url": null, "date": "Oct 16, 2008", "message": "There is some kind of bug in the Tag Search.  If you click on Tags, then type 'd' in the box, the 'd' tag doesn't appear, but it exists."}, {"author_name": "dwj", "gravatar_hash": "1cf91fad2e22363378b849e5796f6ed7", "author_url": null, "date": "Oct 16, 2008", "message": "Maybe I was a little more tired than usual while listening to this podcast than other times but I felt that both Joel and Jeff were much more distracted and meandering throughout the conversation.  In the middle of answering a question, Joel went off on that whole \"Queen Mother\" thing.  Oh, and what was up with the candy/medicine wrappers?\n\nOverall the podcasts are great but this one felt lacking."}, {"author_name": "Jeff Metzner", "gravatar_hash": "1e6a18bf5285757ea74ecd447fcad1e7", "author_url": null, "date": "Oct 16, 2008", "message": "Thanks for taking my question, Jeff. I appreciate your and Joel's thoughtful answers, though I have to admit it was a little surreal to be sitting in the car listening to Joel address me directly from the radio!"}, {"author_name": "Sergey Stadnik", "gravatar_hash": "eccdcfacff0a3aa150b47431fedb2006", "author_url": "http://sergeys-tech.blogspot.com/", "date": "Oct 16, 2008", "message": "Hi Jeff, hi Joel. Great podcast, as always!\n\nI like the idea of asking for a \"verified\" real address. User also has to sign a disclaimer, something like: \"Remember: we have long hands and know where you live. So if you do something nasty, we'll come and get ya!\"\n\nAnd you should ask for a bank account. So if a user makes a bad comment, he has $1000 deducted from his account straight away.\n\nAs for the karma system, it's too simple. You should have something like RGP style: different ratings for Strength, Dexterity, Stamina, etc. And also mini-quests. There has to be mini-quests, like \"Go there and answer that questions\", and as a reward you'll get an artefact, like Golden Keyboard of Wisdom or something, that blows your karma through the roof for a limited time."}, {"author_name": "Eli Courtwright", "gravatar_hash": "bd42b746d79be5dd325a8e94bc00ac58", "author_url": "http://courtwright.org/", "date": "Oct 17, 2008", "message": "In this podcast you discussed some kind of a reputation cap.  The main reason why I wouldn't want to see this happen is the \"bounty\" system that's been discussed on uservoice and will eventually be implemented.\n\nI can't count the number of times in the past I've had a really obscure problem involving some combination of libraries, and I'm looking forward to being able to go onto Stack Overflow and post a detailed description and say \"200 reputation to whoever can solve this incredibly weird threading issue involving these 4 functions\" or some such.\n\nOnce this exists, being able to build up more and more reputation is not just fun, it's actually acquiring a valuable resource that I can use in my professional life to help me solve my problems.\n\nStack Overflow is great, but really complex questions that require the reader to look through a lot of code and be familiar with a weird combination of libraries are tough to get answers for.  This is why I'm looking forward to the bounty system so much.  And I hope that I won't find myself unable to get more valuable-for-paying-bounties reputation only to find that I've hit an arbitrary wall."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 17, 2008", "message": "bounty would be immune to any reputation cap rules, of course."}, {"author_name": "Alfred Yakki", "gravatar_hash": "16e6ffe9cadedb75290ef79e5f966cbc", "author_url": null, "date": "Oct 17, 2008", "message": "There was a question about allowing IT questions or creating a sister site. \nYou've said that in creating a sister site you would need someone to take your roles (Jeff/Joel).  I was thinking a good suggestion would be Leo Laporte of Call for Help/Twit.tv,  I don't imagine he could have an as \"hands on\" commitment to it as Jeff has with SOF, but he could be part of it, lend weight to the venture the way Joel has.\nI think Joel had mentioned in one of the earlier podcasts something about him, I think getting advice about podcasting.\nAnyways just a thought...\n\nAlso you guys should have Yegge back, that was great podcast."}, {"author_name": "Brian Smith", "gravatar_hash": "48a3b7b439b402a0176946349c46911d", "author_url": null, "date": "Oct 18, 2008", "message": "You need more cowbell!\n\nhttp://en.wikipedia.org/wiki/More_cowbell\n\nThe skit is #5 on Saturday Night Live: 101 Most Unforgettable Moments."}, {"author_name": "JasonMichael", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": "http://www.jmrtechnet.com", "date": "Oct 23, 2008", "message": "Where's podcast #27?"}, {"author_name": "Anton Stoyanov", "gravatar_hash": "be4a9ddac15caea8d3bbbb7f19d6e4bd", "author_url": "http://www.stoysolutions.com", "date": "Oct 26, 2008", "message": "Great podcast guys!"}, {"author_name": "Grant Hutchins", "gravatar_hash": "ce8fada5574820598c45c059cf9ca7cc", "author_url": "http://community.spiceworks.com", "date": "Oct 26, 2008", "message": "The <a href=\"http://community.spiceworks.com\" rel=\"nofollow\">Spiceworks Community</a> is a similar venue for IT-related questions that doesn't suffer from the problems of something like an Experts-Exchange such as costing money and hiding answers from unregistered viewers.\n\nAnyway, we certainly don't have exactly the same features as StackOverflow but we have been working on it for much longer than StackOverflow has existed and also offer a free integrated tool for monitoring your own network. At this point we have 500,000 IT users, with a particular focus on small-and-medium businesses.\n\nSo I'd encourage anyone interested to check us out.\n\n(I'm just an employee, I don't officially speak for Spiceworks, and hey, I'm also a <a href=\"http://stackoverflow.com/users/6304/nertzy\" rel=\"nofollow\">StackOverflow</a> user too!)"}, {"author_name": "Corey", "gravatar_hash": "8c0cb4875ae96d848d05d69963697966", "author_url": null, "date": "Oct 27, 2008", "message": "Hello, I have a question. What would be the best place for a 12 year old who has an interest in programming to start learning? Thank you. :)"}, {"author_name": "Omar Kooheji", "gravatar_hash": "40bd6fa511aed8cab1e12bb104b88b4e", "author_url": "http://www.bangequals.net", "date": "Oct 31, 2008", "message": "I suggest that rather than spending your own karma on bouties that everyone has a set ammount of bounty a day/month... that way new users can take advantage of the bounty system.\n\nAlso I'd suggest that other users could add to the bounty from thier bounty pool, say if they are experiencing the same issue."}, {"author_name": "Wilfred Knievel", "gravatar_hash": "fea4f844fb882fe6bd01fb77c28bdc70", "author_url": null, "date": "Feb 16, 2009", "message": "Strange thing is it does work on the apple tv if you choose to download it then play it from my podcasts!  Don't quite understand that."}]}