{"response": [{"author_name": "Omer van Kloeten", "gravatar_hash": "201ced59b784a86689712c84c0667c44", "author_url": "http://weblogs.asp.net/OKloeten/", "date": "Oct 25, 2008", "message": "You're right. Everyone should play fairly. I have to admit I'm one of the persons scraping the site (although I limit the scrapes to once an hour) and did not know it posed such a strain on the server.\n\nHowever, there's the other side of the coin, where the request for RSS feeds or email notifications has been around since people first started going into the closed beta and people are impatient.\n\nSo tell me what I do wrong and I'll fix it:\n1. At what intervals should I scrape? Once every hour? Two hours? Daily?\n2. Is there a smaller version of the page I can scrape instead?\n3. Anything else I can do that I haven't thought of?"}, {"author_name": "James McKay", "gravatar_hash": "c17cb25cd9793d3d972c5cc3b1ae6eee", "author_url": "http://jamesmckay.net/", "date": "Oct 25, 2008", "message": "There's one major problem with permanently banning an IP address: you're likely to end up with a lot of collateral damage, as many IP addresses are shared. Wikipedia hit the headlines with this a couple of years ago when one over-zealous administrator blocked the whole nation of Qatar. (http://www.techcrunch.com/2007/01/01/wikipedia-bans-qatar/)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 25, 2008", "message": "> although I limit the scrapes to once an hour\n\nNot the same thing; you are retrieving the page once per hour which is probably fine*. These scripts were hitting the user page MULTIPLE TIMES PER SECOND. I mean almost as fast as the client could make the requests.\n\nOmer, I don't think this applies to you. \n\nOn top of the rudeness, it's just plain bad coding! Really annoying.\n\nIn general specify what RSS feeds you need and we will try to build them.\n\n* (although I would ask that you retrieve with the gzip http header specified to reduce network bandwidth, etc)\n"}, {"author_name": "Omer van Kloeten", "gravatar_hash": "201ced59b784a86689712c84c0667c44", "author_url": "http://weblogs.asp.net/OKloeten/", "date": "Oct 25, 2008", "message": "I'd love to see feeds for:\n1. new answers to any of my questions.\n2. edits on my questions or questions I edited.\n3. changed vote-counts for any of my answers.\n\nI currently use the user-page scrape to answer #1 and #3, but #2 is too resource-consuming if I implement it on my own.\n\nOut of pure interest - what do you use for caching (user pages, et al)?"}, {"author_name": "wds", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Oct 25, 2008", "message": "1. You shouldn't be banning IP addresses on the modern internet. One IP address is typically used by more than one person, so you're going to end up with a lot of collateral damage. (do you really want to reduce your audience by that much?) A temporary ban would be much more acceptable.\n2. If your server can't handle the strain, you should be rate limiting incoming connections.\n3. The problem is most likely a software bug, not a human bug."}, {"author_name": "lImbus", "gravatar_hash": "fb3c6b657c33aba6791a9389b9c65170", "author_url": null, "date": "Oct 25, 2008", "message": "I am pretty confident that Jeff is aware of the fact that IP-addresses are shared..."}, {"author_name": "chakrit", "gravatar_hash": "104c34a4803355ade79413372205138a", "author_url": null, "date": "Oct 25, 2008", "message": "It might just be those pesky QA sites trying to scrape your site for information and game google."}, {"author_name": "Eric", "gravatar_hash": "2835e4d16269e541d2bef10b4b496528", "author_url": null, "date": "Oct 25, 2008", "message": "I can hardly imagine the collateral damage being all that great.  If my roommate's actions get me banned then I should scold them.  If my co-worker's actions get us all banned then I should probably get new ones. \n\nAnd if banning a couple IP's even temporarily keeps the site up, I'd call it worthwhile."}, {"author_name": "Matt B", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Oct 25, 2008", "message": "Can you elaborate on _why_ users are doing this?"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Oct 25, 2008", "message": "Heh... How about just adding feeds for the various \"pages\" on the user pages? I have no idea where the current feed is pulling data from, but it does not appear to match *any* of the pages... \n\nRecent, Reputation, and Responses feeds would be a good start. Maybe Favorites as well. I suppose i could ask on UserVoice, but... meh."}, {"author_name": "not required", "gravatar_hash": "da70b5e5a387d3e12f8ce507aae9baaf", "author_url": null, "date": "Oct 25, 2008", "message": "\"If you persist, your account will be permanently deleted.\" Does that mean that if I start downloading somebody's profile several times a second you'll ban them"}, {"author_name": "John", "gravatar_hash": "0fc637a07270d4dfbf6958a281a5305e", "author_url": null, "date": "Oct 25, 2008", "message": "If you're looking to get your rep really high then scraping and refreshing at a ridiculous rate is one way to trick / scam the system.  You can then jump on those questions that you can answer easily.\n\nHas it really come to this?  Are some users actually addicted to an ever increasing rep value?"}, {"author_name": "John", "gravatar_hash": "df48015afb7e76f7c6db7af768ad60fb", "author_url": null, "date": "Oct 25, 2008", "message": "Easy tiger. No need to get all high and mighty because of a few users. You seem to have got quite agitated. Just take a breath and impose some sort of wait cycle. No need to get pissy about banning users permanently. \n\nI'm not one of the users scraping, I just hate seeing unnecessarily aggressive language. Please treat your users with a modicum respect."}, {"author_name": "Mark Biek", "gravatar_hash": "040ffc7f3327b05f01c54a8bef3ba60a", "author_url": null, "date": "Oct 25, 2008", "message": "The only script I run (and I only run it manually a few times a day) is this one:\n\nhttp://modos.org/sof/?u=\n\nI'd love for the site to have this sort of functionality built-in.  The reputation graph, while very handy, doesn't quite cut it."}, {"author_name": "Dror Helper", "gravatar_hash": "db8b562e21f8f67bd924c3d6bcc60f4c", "author_url": "http://blogs.microsoft.co.il/blogs/dhelper/", "date": "Oct 26, 2008", "message": "I've written a simple windows taskbar application that tells the user when his/her reputation has changed (http://blogs.microsoft.co.il/blogs/dhelper/archive/2008/10/22/stackoverflow-notifier.aspx).\n\nCan you please tell me what can I change so that it won't cause people using it to be banned from StackOverflow (I can limit the polling interval to once per hour if that's ok).\n\nI would like to add that the only reason users use this kind of application id because they are deeply involved in the StackOverflow community and shouldn't be punished for it."}, {"author_name": "Josh Parris", "gravatar_hash": "92f446269f65ef4213e94bd99aa3e475", "author_url": "http://parris.josh.com.au/", "date": "Oct 26, 2008", "message": "This rapid scraping is clearing a desire to be notified the moment a user's Reputation alters, or a comment is made against something they've posted, etc.\n\nI seem to recall uservoice requests for features like this."}, {"author_name": "lucasbfr", "gravatar_hash": "400e387db6de9e9870789adc387d6c21", "author_url": null, "date": "Oct 26, 2008", "message": "I start to wonder if that reputation thing was such a good idea... I see more and more people getting crazy because they lost 2 points... Seriously guys grow up..."}, {"author_name": "Dror Helper", "gravatar_hash": "db8b562e21f8f67bd924c3d6bcc60f4c", "author_url": "http://blogs.microsoft.co.il/blogs/dhelper/", "date": "Oct 26, 2008", "message": "It's not just needing to know when reputation has changed. I was planing on adding functionality so that the user may know when a his question was answered or if someone commented on his answer - both cannot be done by using RSS right now."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 26, 2008", "message": "> Can you please tell me what can I change so that it won’t cause people using it to be banned from StackOverflow (I can limit the polling interval to once per hour if that’s ok).\n\nGreat! I think there's a bug, because it is currently polling *multiple times per second*. Can you please look into that? Once an hour should be plenty.\n\n> I seem to recall uservoice requests for features like this.\n\nYep, email notifications are getting moved up in the queue for a variety of reasons. This is another.."}, {"author_name": "Dror Helper", "gravatar_hash": "db8b562e21f8f67bd924c3d6bcc60f4c", "author_url": "http://blogs.microsoft.co.il/blogs/dhelper/", "date": "Oct 26, 2008", "message": "The polling interval was once in every 30 sec (sorry about that) now it's about once each hour - if you remove the block from my proxy I might actually be able to test it.\n\nAlso you can have a look and let me know if I'm missing somthing"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 26, 2008", "message": "> once in every 30 sec (sorry about that) \n\nNot sure what is going on, but we were seeing the user page pulled down multiple times per second from 5-6 different users. It wasn't subtle!\n\nCan you post an update on your blog so any users find out about it?"}, {"author_name": "Dror Helper", "gravatar_hash": "db8b562e21f8f67bd924c3d6bcc60f4c", "author_url": "http://blogs.microsoft.co.il/blogs/dhelper/", "date": "Oct 26, 2008", "message": "You're right! I've found the bug that caused the problem - I've updated the release with 1 hour polling interval and posted an update on codeplex as well as in my blog.\n\nIs there a way I can Id the application calls so we can make sure it doesn't misbehaves.\n\nBTW\nI still getting the 401 response from your site. Can you please remove the ban from any users that accidentally caused the massive polling?"}, {"author_name": "Anthony Potts", "gravatar_hash": "7113a12a173ad79a93249ad3156eea0e", "author_url": null, "date": "Oct 26, 2008", "message": "Is there anyway to submit an IP address to be unbanned? I was using some software that was polling regularly, which I did not write."}, {"author_name": "Nick", "gravatar_hash": "f3664da2ca305284ab442e34daccc608", "author_url": "http://www.thecodingmonkey.net", "date": "Oct 27, 2008", "message": "I certainly don't scrape... but I would love to see the RSS feeds for accounts return comments to our answers.  Right now the only way to see those is via the user webpage."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Oct 27, 2008", "message": "Why not have a rep penalty for such behaviour and put one of those orange notices at the top of the user's page explaining why. When people see their rep start to plummet they'll stop doing it."}, {"author_name": "Boobface", "gravatar_hash": "24a7a759a644ff5b50248b2b4b6afac2", "author_url": null, "date": "Oct 28, 2008", "message": "You can't have a rep penalty because the people are scraping as anonymous, and if you assume they are the user for whom the user page is being pulled people could set up bots to scrape other user's pages just to mess with their rep."}, {"author_name": "John Rudy", "gravatar_hash": "32dcb4e95fd5eb20c0f61d1ba3468242", "author_url": "http://www.codeheaven.info", "date": "Oct 28, 2008", "message": "Regarding bannings: It's unfortunate, but occasionally necessary. I agree there should be a mechanism to request getting unbanned, but malicious software -- even when it is unintentionally malicious -- needs to be kept in check. Jeff's doing the right thing.\n\nThe software writers need to understand that screen scraping sites is generally bad form -- not only is your app inherently fragile (although less so with SO's very clean design), but you can cause serious downstream effects if your app becomes extremely popular, and even worse if your app contains a bug that causes overpolling.\n\nI would love to have some extra \"cool tools\" for SO that aren't available yet. (My own personal itch is a nice Vista sidebar gadget that shows rep, rep changes, my active Qs and maybe even the top X questions regarding my preference tags ... ) But I'm not willing to kill my new favorite site to get them. :) \n\nIt's easy to armchair quarterback, but I don't think RSS feeds are the only answer. They're a good answer for many purposes, but perhaps some web service API -- one which places a much lighter load on the server -- might be the way to go? Perhaps requiring apps which use it to authenticate somehow so you know which apps are misbehaving and you can kill switch them?\n\nOf course, based on Uservoice, you probably have enough on your plate already without needing to add that huge effort on top of it!"}, {"author_name": "macbirdie", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Oct 28, 2008", "message": "If there were APIs to use, there could be some throttling in place, just like e.g. Delicious. It lets you do requests at most every couple of seconds, otherwise your ip gets banned for some time or permanently.\nAnd like flickr, delicious APIs, there could be API keys given away so the client app is always identified and its author can act accordingly, in case his app is doing something bad to the site."}, {"author_name": "JasonMichael", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": "http://www.jmrtechnet.com", "date": "Oct 30, 2008", "message": "The lesson here:  \n\nSo if you're going to scrape or hack or whatever to a site, do it right.  Don't get caught!  Use some logic in that code :)"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Nov 06, 2008", "message": "I wonder, did a feed eventually get created for Dror Helper's program? There's a program I may be writing that would like to get a user's reputation score (and possibly other reputation metrics, such as seen in the reputation tab), and it would be nice to have a way to grab that in a lightweight fashion."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Nov 11, 2008", "message": "Jeff (and anyone else interested in this),\n\nIf you could have a look at http://stackoverflow.com/questions/282179 I'd be really grateful :)\n\nJon"}, {"author_name": "Doc", "gravatar_hash": "a1623a930487de428da5d65baf7c1107", "author_url": null, "date": "Aug 08, 2011", "message": "In my experience, stackchange will also ban IPs of users placed in penalty boxes - who then make themselves other accounts. \n\nI did exactly that after reasonably fending off some sub-creative trolling on an answer of mine. Some 'moderator' put my account in a penalty box for it, so I just made a new account. Guess this moderator thought I'd somehow circumvented the penalty box system, which I didn't, and managed to some how merge my new account's activities with the suspended account. My guess as to how he must have thought I got around the suspension has to do with how I use OpenID or something.. But really, I just made a plain new account (with a slightly mocking username of \"Not [the original username]\"). \n\nAfter some genuine hilarity &amp; teenage drama about creating new accounts and having this emo/moderator merge &amp; delete them... It seems my IP has been in-explicitly banned. Obviously, getting new IPs takes \"much\" effort. Oh right, no it doesn't.. \n\nI emailed stackexchange to at least confirm my IP's been banned and have had no response. The whole thing seems blown so far out of proportion. Anyway.. WHATEVER... I guess if I get bored enough I could keep the comedy going, it's not like banning an IP slows one down much. Best part is that if you read my questions and answers they're pretty damned civil. I think this is a case of \"enjoy this tea-bagging or GTFO\".. Oh Interwebs, how cute thou art.\n\n&lt;3"}, {"author_name": "Doc", "gravatar_hash": "a1623a930487de428da5d65baf7c1107", "author_url": null, "date": "Aug 08, 2011", "message": "I would like to retract the previous post, the wounds have healed. My banning seems to have been lifted. Water under the bridge!"}]}