{"response": [{"author_name": "jim", "gravatar_hash": "bc35273bc96f6aec9158de2be83f0234", "author_url": null, "date": "Oct 06, 2008", "message": "\"Oh no! How horrible! Lots of answers to our questions, and nearly immediately! Anything but that! It’s terrible, just awful!\"\n\nNow where did I put my straw man image macro?\n\nPlease get any sarcastic venting out of your system before writing the public-facing blog post that's trying to address user concerns.\n\n\"Seriously, isn’t getting rapid answers the entire goal of a question and answer site in the first place?\"\n\nNo.  If that were the entire goal, off-the-shelf forum software would've been sufficient.  The goal is *also* to get *good* answers.  The goal is also -- you've even said this yourself -- to provide a long term repository of answers that people can refer to.\n\nAlso, while the feature you describe is nice to have, it doesn't address this particular concern at all.  In fact, it makes things worse: rather than posting a well-thought-out answer and being discouraged at all the hasty answers someone posted before, people will be discouraged beforehand and not even bother to finish the well-thought-out answer."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 06, 2008", "message": "> If [rapid answers] were the entire goal, off-the-shelf forum software would’ve been sufficient. \n\nAll off-the-shelf forum software has massive signup barriers, so they're a spectacular failure at any \"answer immediately\" metric. On Stack Overflow, how long does it take for a random internet user to post an answer? Just start typing and press \"Post\" -- that's how long. Literally.\n\n> people will be discouraged beforehand and not even bother to finish the well-thought-out answer\n\nThis is an awfully glass-is-half-empty perspective.\n\nAlternately, the well thought out poster could *combine* the 3 or 4 hasty answers AJAX'ed into the page while they were writing into a bigger, superior answer."}, {"author_name": "James McKay", "gravatar_hash": "c17cb25cd9793d3d972c5cc3b1ae6eee", "author_url": "http://jamesmckay.net/", "date": "Oct 06, 2008", "message": "&gt; Alternately, the well thought out poster could *combine* the 3 or 4 hasty answers AJAX’ed into the page while they were writing into a bigger, superior answer.\n\nThe problem is not with fast answers themselves, the problem is with fast answers that either (a) are wrong, (b) don't understand the question, or (c) haven't even read the question properly, but get up-voted anyway so when someone posts a correct answer, it gets buried below all the wrong ones.\n\nTake this question for instance: http://stackoverflow.com/questions/140236/what-is-a-good-issue-tracker-for-both-project-managers-and-developers -- this was repeatedly misconstrued by the trigger-happy answerers as being a generic \"What is your favourite issue tracker\" question and even labelled as subjective by some busybody or other. However, if these people had actually bothered to take the time to read the question at all before answering, they would have realised that it was more detailed and specific, and treating it as a generic subjective question was simply not what I was after.\n\nIn fact, the most up-voted answer pointed to another question that asks precisely that, and while that other question did include a (partial) answer to my own question, it was buried deep in the middle of about 200 other answers and had received zero up votes.\n\nGranted, there are some answers in there that are at least partially helpful, but I still got the impression that far too much of it was simply an attempt to game the system."}, {"author_name": "Andrew Ingram", "gravatar_hash": "11aecf204a89d45e43b940208243a11f", "author_url": "http://andrewingram.net", "date": "Oct 06, 2008", "message": "Is the goal of stackoverflow to provide quick answers or to provide a useful long-term resource?\n\nI was under the impression that given the nature of the sites it aims to replace the key value is in being a long-term reference for programming problems. In which case the more thorough answer is going to be more valuable.\n\nObviously quick answers are needed, but maybe the person asking the question shouldn't get the say over what is the ideal answer, since they usually aren't the best person to judge the validity of it. They may pick the answer that solves their single instance of a wider problem rather than the answer which is the real and informative solution."}, {"author_name": "Dan", "gravatar_hash": "7cbb3381b28da6bdfe8a0e0dd9803b53", "author_url": null, "date": "Oct 06, 2008", "message": "How about if you could post incomplete answers?  Something like, \"post intermediate updates\", so that as you're writing \"No, but ...\", the asker sees \"No,\", and as time passes, more and more of your \"but\".\n\nThat'd be a nice to way to encourage people to start answering quickly, but also give them an incentive to draw out their answer.\n\nAnd allows people to see more of your \"but\".\n\n-Dan"}, {"author_name": "Keng", "gravatar_hash": "15769bbea999aee421458f52e7c9d011", "author_url": "http://www.TheMacroHook.blogspot.com", "date": "Oct 06, 2008", "message": "Hey, I like the idea...and the site.\n\nTHANKS!\n\nBTW: I take 2 sugars and creame...and a splash of vanilla....thanks."}, {"author_name": "Larry Lard", "gravatar_hash": "282e3233f5186272eeb3ea6b4dd376bb", "author_url": null, "date": "Oct 06, 2008", "message": "&gt;&gt; If [rapid answers] were the entire goal, off-the-shelf forum software would’ve been sufficient.\n\n&gt;All off-the-shelf forum software has massive signup barriers, so they’re a spectacular failure at any “answer immediately” metric\n\nNice sidestep. How about this: if rapid answers were the ENTIRE goal (your word), a nice speedy form that returned '2' when you clicked the submit button (no matter what the entered question) would have been sufficient.\n\nWhat, '2' isn't the answer to every question? Hmm. Maybe rapidity of answering shouldn't be the ENTIRE goal after all..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 06, 2008", "message": "> Take this question for instance: http://stackoverflow.com/questions/140236/what-is-a-good-issue-tracker-for-both-project-managers-and-developers — this was repeatedly misconstrued by the trigger-happy answerers as being a generic “What is your favourite issue tracker” question and even labelled as subjective by some busybody or other.\n\nI would argue this is not a failure of the system, but a shortcoming of the question in not properly communicating its intent. If people fail to understand the question, it's not a good question. Edit it and make it better.\n\n> Is the goal of stackoverflow to provide quick answers or to provide a useful long-term resource?\n\nDepends on the question. Both. I'm sure you can imagine certain types of programming questions that are valid for years, as well as those that are almost immediately out of date days after being asked.\n\nThe bulk of questions should be very small, extremely narrow and tightly focused. These kinds of questions are well served by rapid answers. If you're asking giant subjective thought questions more suitable for discussion forums, well.. garbage in, garbage out.\n\nOf course, I can't stop people from posting \"what's your favorite programming food?\" and \"what's your favorite programming cartoon?\" and so forth.\n\n> the problem is with fast answers that either (a) are wrong, (b) don’t understand the question, or (c) haven’t even read the question properly\n\nMake sure you've asked a good, focused, clear question. Poorly asked questions elicit poor answers in my experience. Beyond that, vote down bad answers.\n\n> a nice speedy form that returned ‘2′ when you clicked the submit button (no matter what the entered question) would have been sufficient.\n\nAnd they'd all be voted down.."}, {"author_name": "Nick", "gravatar_hash": "f3664da2ca305284ab442e34daccc608", "author_url": "http://www.thecodingmonkey.net", "date": "Oct 06, 2008", "message": "I really think there are two primary frustrations behind the \"Fastest Gun in the West\" problem.  First is ego of the answerer.  He wanted to get the most reputation for answering the question, where you are looking at this from the standpoint of the question writer.  For the ego driven answerer... your solution is clear.  Learn to type faster.\n\nThe other frustration is from people like me.  I spent time writing an answer, probably didn't type it as fast as I could have, and was just a little lazy.  I probably alt-tabbed to another app for a minute to read an email that came in while answering your question, etc.  Then I finally hit Submit, and I realize my answer was repeated by someone ahead of me.  I'm not so much disappointed ego wise, but I do feel like I wasted my time.\n\nI appreciate knowing that I can quit typing an answer before hitting submit, and move my time to another question where maybe people has less knowledge on the topic."}, {"author_name": "Brian Boatright", "gravatar_hash": "3e1f0ea43c0a4cb33eb65ec349901feb", "author_url": "http://www.developerbuzz.com", "date": "Oct 06, 2008", "message": "I think the ability to mark an answer as wrong with a comment should also be part of the solution.\n\nIt shouldn't remove the answer just be a visual cue to people that someone else with at least x points considers the answer wrong. Ideally even requiring a short comment on why it is wrong to back it up.\n\nIf possible reopen for consideration this user voice suggestion:\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/19051"}, {"author_name": "DiegoAndresJAY", "gravatar_hash": "de52a42028adb4ccfa22ed360134cc36", "author_url": null, "date": "Oct 06, 2008", "message": "Why not timestamp the post at the time the user clicked the button to post the answer.  This way the amount of time spent typing is irrelevant.\n\nYou could inform the person answering how many other people are currently typing an answer.  You could also incorporate the timer solution so that as users complete their answer the person could read the response and only post if his/her answer continues the discussion in some manner."}, {"author_name": "DiegoAndresJAY", "gravatar_hash": "de52a42028adb4ccfa22ed360134cc36", "author_url": null, "date": "Oct 06, 2008", "message": "So I haven't commented on here before and thought there was a different screen for commenting.  Would it work if you use an onFocus AJAX event on the comment box so that the user clicking to type in the box acts the same as clicking a button to make a response?"}, {"author_name": "Jarno", "gravatar_hash": "96a7c73bc7adc8d52269abce6355860e", "author_url": null, "date": "Oct 06, 2008", "message": "The wiki-like aspects of stackoverflow should somehow make creating thorough answers worthwhile.\n\nActually I don't know how well wiki-like features currently work or how many of these features are there. For example are duplicate pages getting merged?\nA blog post about this would be interesting, because everyone can see the major features and how they work, voting and tags are very visible. But how about features beyond that."}, {"author_name": "Gregg", "gravatar_hash": "3840921efab68a0792b395ab22257f3b", "author_url": "http://www.equivalence.co.uk", "date": "Oct 06, 2008", "message": "I've not interacted much with the site so maybe this idea is not possible (or is already in place): how about showing a count (on the actual question page) of how may people are currently answering the question, the original user who posted the question then has the opportunity to wait and evaluate a set of possible answers.  Obviously this requires users to have a little patience and it also may not be feasible to wait until everyone has completed their answer."}, {"author_name": "Nik", "gravatar_hash": "9c7f81c93fd2a1477cd2218a921e6f94", "author_url": null, "date": "Oct 06, 2008", "message": "The GMail-style update system is a good idea, but it obviously doesn't address the issue that answerers are penalised for taking their time to write a good answer.\n\nHow about just reversing the display order of equal-score posts?  It shouldn't hurt: If you do bash out a quick answer, then it'll still work its way to the top if it's a *good* answer.  If you take your time (or you wait for other people to post and then take other suggestions into account in your post), then you get rewarded for that too."}, {"author_name": "Andy Waschick", "gravatar_hash": "7405e5b7025e5737390996eae2e2e914", "author_url": "http://andy.waschick.org", "date": "Oct 06, 2008", "message": "Okay, so what happens when I, as a fairly busy person, see something on SO that I feel I can make a contribution to, and bookmark it so that I can come back later and contribute a thoughtful and complete response.  I do this on Wikipedia (and my own documentation wiki) all the time.  I have to agree with the camp that says recognition for these sorts of responses are left out in the cold.\n\nWhen I get around to making a contribution on SO, it seems that I can spend all the time I want to after the fact and get no recognition for my effort, meanwhile the people who are practicing poor time management (and apparently still collecting a paycheck) have been awarded all of the karmic glory for responses which, while possibly sufficient, probably were not done with the same level of care that a contributor taking their time might lavish on the content.\n\nIn my opinion, there is far too much emphasis placed on immediacy in this early implementation, and far too much lip service being paid to the idea of SO as a long-term reference.  I don't want to feel <i>anxiety</i> when I see something I can add to; like it's some kind of popularity contest.  And, while the site's current form does give the audience a clear impression of the ongoing zeitgeist of the programming world, there needs to be more motivation for the contributors who are not 22 years old and have Crack Overflow updates buzzing through to their mobile 24/7.  What if I come across something I can improve 6 months after it's been posted?  What's my motivation?"}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Oct 06, 2008", "message": "The trigger-happy answers is a byproduct of the reputation system implemented here. Initially, I was happy to find quick responses to my questions but over time the quality of answers was degrading.\n\nIn one question, one person replied with 3 (or was it 2) quick responses in sequence. The replies weren't even helpful. The person didn't read my question carefully and I purposely ask clear questions and state what I want because I already have done my own research and didn't want replies with stuff I already know and I do mention what I already know.\n\nThese kinds of replies started to tick me off and from now I vote down these replies to \"punish\" these people for not thinking before replying.\n\nAnd I am starting to blame the reputation system and \"curse\" it. \n\nI wonder if people who use SO for asking questions only care about the reputation system and if their own reputation means anything to them."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Oct 06, 2008", "message": "Initially I thought this was a notification method for the questions the user asked, which I thought was reasonable and useful. But I'm not sure of the value of this particular mechanism. It seems too ADD to be of much value."}, {"author_name": "Drew Gibson", "gravatar_hash": "dc5e4e4387374e20efffa31eb7608ef9", "author_url": null, "date": "Oct 06, 2008", "message": "I don't see an issue here at all.  If a user wants to provide a fully comprehensive answer, that, by definition, will take some time to compile (pun intended), he or she can make the quick, initial post at the time, to reap any initial rep.  He/she can then edit the answer with the full version when time allows.  Maybe write \"I'll provide a thorough answer in this post later, when I have more time\".  It may then be that the 'later' answer becomes the canonical answer, and that's fine.  The only issue I see here is that the question asker may accept another, less comprehensive answer in the meantime, so maybe implement a minimum length of time that must elapse before the question asker can accept an answer."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Oct 06, 2008", "message": "P.S. Personally I don't see the \"fastest gun in the west\" \"problem\" as a legitimate problem. Ironically, people are complaining about the fact that answers which took longer to post are not being voted up instantly. See an impedance mismatch in there somewhere?\n\nInterestingly, in the q&amp;a \"thread\" for this issue on Stack Overflow itself someone posted a link to a question which exhibited the \"problem\" in question. Ironically, the example sorted itself out in a time frame faster than the discussion of the \"problem\" did. Better answers were posted, good answers were voted up, bad answers were voted down, the question was made clearer through editing. It was an example of the system working the way it was intended, it was merely that some people were too impatient for the system to produce results.\n\nIf you think about it, this problem is self-correcting with the way Stack Overflow works. Questions that are unpopular and receive few visits may receive quick and dirty answers and nothing more. That's ok, those questions may be relevant only to a tiny number of folks, so the potential low quality of the answers has low impact. Questions that are important will receive a lot of viewers. Which means both that the answers will have a high impact and, here's where the magic of the system comes in, that answers will be scrutinized by a much larger pool of people on an ongoing basis. Meaning that bad answers will be voted down, good answers (even in-depth ones) will be voted up, new answers will be posted if no existing answers are good enough, answers and questions will be edited to make them clearer and to remove mistakes. It's a virtuous feedback cycle, and it works."}, {"author_name": "csmba", "gravatar_hash": "e8ec9371b0173179ee41dd68e0e80ddd", "author_url": null, "date": "Oct 06, 2008", "message": "Isn't this just addressing the symptom instead of the real cause for the disease? \n\nThe problem (I think) all comes form SO being very weak on the \"staying power\" aspect of questions. Right now, you ask a question and your answers are based on the \"luck\" factor, of who is currently looking at the SO front page. \n\nIncreased staying power will be archived by letting users see the world via \"customized\" glasses (i.e. selection of tags they configure in their profile).\nthis will make sure that the \"experts\" are more likely to see your question (and not *just* the random sample of SO users)\n\nThis means that you will expect to come back in 24 hours or more and only then see the really good, long, researched answers that take more then 30 seconds to write. This is how getting answers from MS MVP works. And SO is cool in the \"rapid fire\" aspect, but you need to foster the \"slow and wise\" aspect which is negated currently. This \"feature\" proves that the system is pushing out the slow and wise and favors quick and dirty, but this feature is not addressing the core problem."}, {"author_name": "Jason Bunting", "gravatar_hash": "3d6bd00a348b2caab6108406d7dcee1c", "author_url": "http://www.jasonbunting.com", "date": "Oct 06, 2008", "message": "I'm too lazy to use user voice for this at the moment, but FYI: There is a bug in the implementation of this feature. The answers loaded dynamically are broken in the sense that you cannot vote on them and the \"Comments\" button doesn't do anything (and I imagine the \"offensive\" link may be suspect as well, but I wasn't going to test it on a post that wasn't offensive\")"}, {"author_name": "Bobby Jack", "gravatar_hash": "9b5c260dc8b7374186b3bebc28b08ce7", "author_url": "http://www.premierpundits.com", "date": "Oct 07, 2008", "message": "@James McKay: although I agree with your general point (i.e. 'fastest gun in the west' IS a problem) I think you're being overly defensive with respect to your question being tagged 'subjective'. There is no doubt that \"What is a good ...?\" IS subjective, and the 'busybody' who correctly classified your question should not be attacked for trying to improve the site. The 'subjective' tag should not be seen as a negative, other than the fact that such questions were not the original intent of SO, as described by Jeff and Joel."}, {"author_name": "Jon L", "gravatar_hash": "d74a375f62f1d4b928cd0fe7655bf98a", "author_url": null, "date": "Oct 07, 2008", "message": "Quit your bitching. ;)\n\nThe only way this is a problem is if you're overly-competitive and going for the gold (rep).\n\nI would know -- I AM overly-competitive and going for the rep. I'm still trying to help and hopefully find good help, but the rep is nice. ;)\n\nI also know that SO is community-regulated enough that it doesn't matter. If you shotgun an answer, your rep will probably get shotgunned as well. On the other hand, if you take your time, you'll more often have a better, more complete answer that gets community support.\n\nIt also depends on the question. Some don't need any more than a line of summary and a line of code. While others deserve a few paragraphs."}, {"author_name": "BigBrain", "gravatar_hash": "07dd7756a0ece93b1b9b101ef1855d8d", "author_url": null, "date": "Oct 07, 2008", "message": "I am currently applying my big brain to solving this problem. Stand by"}, {"author_name": "Andrew", "gravatar_hash": "4e28027a2833fb1eff07ad7d70df46d8", "author_url": null, "date": "Oct 07, 2008", "message": "Jeff, I know this may be a bit unrelated, but I was hoping that you'd take a bit of time and pay attention to CodingHorror. Cheers."}, {"author_name": "James McKay", "gravatar_hash": "c17cb25cd9793d3d972c5cc3b1ae6eee", "author_url": "http://jamesmckay.net/", "date": "Oct 08, 2008", "message": "@Bobby Jack: I see your point about the title of my question, and maybe I should have worded it a bit differently, but if you read the body of the question, you'll see that what I was asking was not subjective at all, but very specific, clear and unambiguous -- there is a feature X that I would like to see in bug trackers that I think would make it easy to integrate the workflow for both developers and project managers, does anyone know of one that has this feature?\n\nIt seems to me that the problem is that people only read the headline, they don't read the full question. I can understand why this would be for the trigger-happy give-me-the-reputation types, but it's a bit perplexing when it comes from someone doing some re-tagging, which AFAIK doesn't carry the same weight as answering quickly. And having a non-subjective question tagged as \"subjective\" *is* annoying -- as you say, it does have connotations of \"This is what Stack Overflow is not\" in a similar kind of vein as http://en.wikipedia.org/wiki/WP:NOT over on Wikipedia."}, {"author_name": "Bobby Jack", "gravatar_hash": "9b5c260dc8b7374186b3bebc28b08ce7", "author_url": "http://www.premierpundits.com", "date": "Oct 08, 2008", "message": "@James: Fair enough, \"Which bug tracking systems support sub-tickets\" would have been a far better title - maybe you can now edit it to improve the site. I think the headlines do carry such a lot of weight since that's what most of the audience base their decision to read, and hence answer, a question on."}, {"author_name": "dlamblin", "gravatar_hash": "60fec2454b16f5fd5ec243fa98d71351", "author_url": null, "date": "Oct 08, 2008", "message": "Whining aside I have a simpler solution:\nUntil there are <i>n</i> answers AND <i>m</i> minutes have passed since the first answer was posted voting should be closed. Bonus fancy pants implementation: pick <i>n</i> and <i>m</i> based on historical statistics for this hour of the week. Otherwise fix <i>n</i> to 3 and <i>m</i> to 60.\n\nOther suggestions are:\n- Get a separate voting feed/view. This should show questions where there are new answers and link to the sub-page (if any) where the new answer is.\n\n- Store a pseudo-random number generator salt per session. Use that generator to sort answers first by vote count then by the generator. This will be different per user and allow voting, once open, to happen not exactly based on time of answer. This doesn't avoid the problem of a snowballing smart alec answer, like my own of \"Learn English\" for a complex question regarding emigration to England.\n\n- People who answer well want points. People who vote want to rank. The two don't exactly mesh. One person can vote up each answer, but can't vote up one answer to be twice as good as another. At the least the question writer should receive Post-Factorial votes for the question; they are the person who knows what they asked, who won't be titillated by a pun or cultural reference, and who'll have tried every reasonable suggestion until they found a solution.\n\n- A person should be able to post an answer to their own question and mark it as the right damn answer because they confirmed it to be true. Right now they can't mark it or vote it to the top. Let them. Just don't give them points for having the right answer.\n\n- Since voting is about ranking and not points, new answers should get randomly inserted in the middle portion with <i>v</i> votes if there are more than <i>n</i> questions, not as a 0 vote answer way at the bottom. The question should then be put up for re-ranking, and people can move everything around then. That question getting down-voted to 0 won't the poster points until it goes negative.\n\nMy personal whine is about how once my question is a month old or so, no one will add an answer even though I found none of the posts actually answered my question. What happens when someone wants to ask the same question, but then doesn't because it's been asked, [s]he's similarly stuck without new answers."}, {"author_name": "dlamblin", "gravatar_hash": "60fec2454b16f5fd5ec243fa98d71351", "author_url": null, "date": "Oct 09, 2008", "message": "When I said \"Post-Factorial\", I actually meant the Triangular number of the count of the answers to the question.\n\nOne last suggestion:\nThe maximum number of votes any answer should be able to get is the number of answers minus one.\n<a href=\"http://stackoverflow.com/questions/184071\" rel=\"nofollow\">http://stackoverflow.com/questions/184071</a> It seems crazy to me that the top answer is voted as better than the sum of the votes of every other answer."}, {"author_name": "Bobby Jack", "gravatar_hash": "9b5c260dc8b7374186b3bebc28b08ce7", "author_url": "http://www.premierpundits.com", "date": "Oct 10, 2008", "message": "@dlamblin: \"The maximum number of votes any answer should be able to get is the number of answers minus one\" - won't that lead to deadlock?"}, {"author_name": "dlamblin", "gravatar_hash": "60fec2454b16f5fd5ec243fa98d71351", "author_url": null, "date": "Oct 10, 2008", "message": "@Bobby_Jack: \"won't that lead to deadlock?\"\nI wasn't clear enough that I meant that voting should be all about ranking, and that no two answers should be ranked as equal once voting is complete. Therefore you'd  actually be moving an answer down under the one you're trying to up-vote. A 6 answer question would at max have standing values of 0,1,2,3,4,5; though it would start at 0,0,0,0,0,0. I understand that this wouldn't work well with multiple simultaneous users, which is why the questioner should probably get a final say."}, {"author_name": "Esko Luontola", "gravatar_hash": "520c9c078b8d25980de17b8d4fe0ceba", "author_url": "http://www.orfjackal.net", "date": "Feb 07, 2009", "message": "The problem is that when the question has been around for some days, weeks or months, the motivation for a new visitor to write a comprehensive answer which answers the question better than any of the existing answers, is very low, because when the answer is not visible on the first page of answers, very few will actually read the new answer, because of sorting the answers by votes.\n\nA better system would take into consideration the time that the question has been around. Maybe also its length in words. When a new question has been posted, it should be visible near the top of the first page, so that visitors will see the new post and decide whether they vote it or not.\n\nThe sorting order could be a function of how many unique people have read the answer and how many of them have voted it. For example a question has an old answer which 1000 people have seen and 10 people have voted. It has a vote ratio of 10 / 1000 = 0.01. Now a new answer comes. After 10 people have seen it, 2 of them vote for it. It has a vote ratio of 2 / 10 = 0.2, which means that this answer is probably better than the old answer with more votes.\n\nAnother way would be to calculate the weight of a vote as a function of when the vote was done, and then sort the messages by the sum of the weights of all votes. The weight of a vote could be for example 1 / AGE, where AGE is some value which grows (linearly or logarithmically) when the vote gets older."}, {"author_name": "andrew", "gravatar_hash": "fe56269a388c1b60bf89cd94329c1177", "author_url": null, "date": "May 21, 2010", "message": "wat is to be done about guns"}, {"author_name": "Ramy Al Zuhouri", "gravatar_hash": "f464f2449f9d975560e5ed1bbafe7a4a", "author_url": null, "date": "Feb 08, 2013", "message": "Who visits a page is often searching for a fast answer, and may be too lazy to choose over many answers. So he will probably choose the accepted one, which often is the one with more up votes. \n\nThis creates a virtuous circle for who answers correctly and fast, even without quality. Once up voted it will be at the top of the page, and some users will see and up vote only this one. Also the reverse, that is a vicious circle may happen: I have observed that some goats may even keep down voting a correct answer is it has a negative score.\n\nSo you can understand well why answerers prefer speed over quality. A virtuous circle is hard to break, and this will be the ultimate goal of who answers. Stack Overflow reputation system is too simplistic : it considers an answers read 100 times and up voted 5 times better than an answer read 10 times and up voted 4 times.  \n\nTo fix this behavior they should fix the reputation system, there isn't another valid alternative. SO is more similar to social networks where reputation is strictly related to popularity, but the goal shouldn't be popularity, rather having technically and well written answers."}]}