{"response": [{"author_name": "Jin", "gravatar_hash": "70ad2c2830eb9a7753bd6312f3811e3e", "author_url": "http://www.8164.org", "date": "Oct 17, 2008", "message": "You're too hard on yourself Jeff. I'm pretty sure it's 53% less crappy now.\n\nGood job."}, {"author_name": "Graham Reeds", "gravatar_hash": "becdc810f976b0b4fb2ecd4a4c9f8bd6", "author_url": "http://www.digital-utopia.com/blogs/graham.reeds/", "date": "Oct 17, 2008", "message": "Shouldn't that be 'very'?"}, {"author_name": "jjnguy", "gravatar_hash": "ddf71a8fc52a01e1ad726ee70b6e2a03", "author_url": null, "date": "Oct 17, 2008", "message": "New stuff is always fun.  Thanks for the update!"}, {"author_name": "Sean Patterson", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Oct 17, 2008", "message": "Just stumbled into this before getting the blog post in my RSS reader.\n\nEXCELLENT!!! It is helping out my searches already!"}, {"author_name": "Chris Leary", "gravatar_hash": "8a402d20d15c0443ea4fe3207bf308a9", "author_url": "http://blog.cdleary.com", "date": "Oct 17, 2008", "message": "How's this for a crazy idea?\n\nGive each tag its own subdomain, wherein you display everything as you do on the primary domain, but filtered by things associated with that tag.\n\npython.stackoverflow.com would only show Python questions and users who have somehow affected the Python tag. This allows you to do good Google searches with the \"site\" syntax: widgets site:python.stackoverflow.com. You could make all the actual question URIs HTTP301 Permanent Redirects to the real questions if Google will still index them -- I'm not sure how strong your redirect can be before Google will just index the URI of the page being redirected to. Additionally, you can have some kind of session data to keep track of what subdomain the user is browsing on at any given time.\n\nThere are some obvious issues with this proposal, like URI character validity (because you use custom slugs for tags) and namespace collisions with any other content you want to host on a stackoverflow.com subdomain, but these seem like solvable problems :)\n\nIn essence, it might be cool to allow sub-communities to form around these subdomains, but still allow \"jack-of-all-trade\" users to span sub-communities via the overarching stackoverflow.com view. It also might be against the philosophy of the site to allow such separation... just food for thought."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Oct 17, 2008", "message": "Using a phrase doesn't improve search in terms of getting more search results, you get less.\n\nI suggested this in uservoice: Put an option to not include answers to questions in search results. It clutters the screen. Let me make a choice where I can look at answers myself when I want to. Coloring the answers different than the questions as a way ti differentiate the two types is a step forward but I am still getting the same number of results. I do not want to see answers at all."}, {"author_name": "Esteban", "gravatar_hash": "1a94125025af7fa5ab127175c2e6733d", "author_url": "http://adotnetdude.blogspot.com", "date": "Oct 17, 2008", "message": "I'm glad you no longer show the same question multiple times and show the answer text. As you've mentioned it was extremely annoying. So annoying in fact that I completely gave up on search after 2 or 3 attempts.\n\nThanks for the improvement!"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "Oct 18, 2008", "message": "&gt;some other things I want to add are search for all posts by a particular user\n\nDon't hurry with that. If you know the users name you can easily find their profile page from the users search and then it's just a matter of searching their profile page for the question/answer title you're interested in."}, {"author_name": "Adam", "gravatar_hash": "6ff0afb80131a40156bd1b1d82b60bdf", "author_url": "http://www.adambox.org", "date": "Oct 18, 2008", "message": "suggestion: when you resolve a question as duplicate: add its title to the other question's in super-secret metadata, so that when someone searches for dupe's title, they'll get the real question."}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": null, "date": "Oct 20, 2008", "message": "Thanks for the improvement.  I'm sure it will continue to get better, but I was indeed one of the people that asked a question because my search didn't turn up any of the existing answers( At least two other topics had the same question).  Keep it up!"}, {"author_name": "JasonMichael", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": "http://www.jmrtechnet.com", "date": "Oct 23, 2008", "message": "I think with every question, you should have a relevant book advertised from Safari or Amazon.  Also, you should see if American Express will advertise with a nice little ad that takes up the whole screen, with a little \"skip ad\" link in the upper right - that type of advertising is always nice."}, {"author_name": "JasonMichael", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": "http://www.jmrtechnet.com", "date": "Oct 23, 2008", "message": "Relative to Mr Leary's ideas above with a python community, I think you could also try molding SO to look like Amazon, and have Python as one of the tabs (as opposed to \"Electronics\", or \"Books\").  Then, when you want to move into selling merchandise, you'll be all set - you can sell merchandise (i.e. Rock Band 2 accessories) alongside the questions.  I think the SO users will love it."}]}