{"response": [{"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": "http://softhardsoft.com", "date": "Oct 23, 2008", "message": "I love OpenID and use it for my own sites also. The big problem in my opinion is that the popular providers are all doing it 1/2 way, thus negating the purpose. You can use your Blogger or Yahoo OpenID anywhere that supports OpenID, but you can't use your Blogger OpenID at Yahoo or vice-versa. This really dilutes the point. Until the big guys get on board in earnest, I see no way that OpenID can make serious progress. It's effectively just \"Passport\" all over again."}, {"author_name": "Andrew", "gravatar_hash": "ea442197bd2ee7338492a786b0d64455", "author_url": null, "date": "Oct 23, 2008", "message": "The thing that got me with the login process at StackOverflow was that when you choose the OpenID provider, the text box is editable and there's a list of examples just below, so I chose flikr as my provider and then thought I had to edit the field so it matched the examples, e.g. http://www.flickr.com/photos/*myname* which seemed to work but then I got the \n\nUnable to log in with your OpenID provider:\n\nfailed to authenticate, returning Failed. Please ensure your identifier is correct and try again. \n\nmessage, so I thought Yahoo/flickr was messing things up. Eventually I worked it out and just left the provider field unedited (just http://www.flickr.com) and it works. If someone chooses the flikr provider, the field should probably be made non-editable."}, {"author_name": "nobody", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Oct 23, 2008", "message": "I suspect that a not-insignificant subset of registered users use OpenID on StackOverflow because there's nothing else to use. This \"case study\" appears to not take frustration with OpenID into account, and I would encourage anyone thinking of using OpenID on their own site to use it in conjunction with a traditional login system instead of in place of one."}, {"author_name": "Damien", "gravatar_hash": "16ceb28d7e6867f78e92c3b82ac01b48", "author_url": null, "date": "Oct 23, 2008", "message": "@nobody: Giving a choice is confusing especially with openid. If you tell your users they can use their aol or yahoo account and if a username and password field is somewhere on the page, they will put their aol or yahoo user name and password and leave the openid identifier field empty.\n\nYou should either don't use openid, hide it or don't offer other options."}, {"author_name": "Pat", "gravatar_hash": "1c2ad49dbe18d9314d5447f2c0f0d21b", "author_url": null, "date": "Oct 23, 2008", "message": "Meh.  People always complain about change (except in political elections).  Congratulations on being part of the solution and not the problem.  I used MyOpenID -- it was really easy.  The only snag I have is that I was unable to create an Single Site Browser app (like with Fluid, http://fluidapp.com/ )."}, {"author_name": "Luke B", "gravatar_hash": "1b0884daefe88e0518f36f37ecf614ac", "author_url": null, "date": "Oct 23, 2008", "message": "I think OpenID is part of the way to go, but somewhat in the wrong direction.\n\nSpecifically, I think instead of using a new id everywhere, people should use their existing ids in a lot more places (ie: being able to use a Facebook account in a bunch of places, etc.)  I could be wrong, though.\n\n*shrug*"}, {"author_name": "Miles", "gravatar_hash": "74704b6d9d6f3b252637e7e2c4b4d438", "author_url": null, "date": "Oct 23, 2008", "message": "The only reason I haven't started using this site is the requirement for OpenID.\n\nRather than having to spend a small amount of time learning about something that does not immediately suggest itself as re-usable, I just want to set up a logon here."}, {"author_name": "Miles", "gravatar_hash": "ed6c2205de03ca95dd9f08dc40b65fbe", "author_url": null, "date": "Oct 23, 2008", "message": "PS. I did start to sign up for the site when it launched, but stopped when there was a message that OpenID was required."}, {"author_name": "1800 INFORMATION", "gravatar_hash": "acc637690f49e2b5a2146deb17874d6f", "author_url": "http://stackoverflow.com/users/3146/1800-information", "date": "Oct 23, 2008", "message": "Miles,\n\nsetting up an openid account is no more difficult than setting up a regular login at any other site - except you only have to do it once. Also, since lots of the big sites (yahoo, livejournal) are providers, you might already have an openid. Besides, if this is how you feel when confronted with something as simple as openid, how are you like if you need to learn something new that is programming related?"}, {"author_name": "David Arno", "gravatar_hash": "31fdbe39c7657652fb5f34cdef2c78c9", "author_url": "http://davidarno.org", "date": "Oct 23, 2008", "message": "Anyone who only sets up one OpenID and uses it everywhere is a fool. OpenID is inherently insecure and is a phisher's dream. I can't think of any other login system that is so easy to hack. If one must use OpenID, then use a different OpenID for every site you use it with (which of course defeats the point of OpenID, but it keeps the user safe).\n\nSure OpenID has advantages, but OpenID advocates seem to have a near-religious zeal about them in the way they refuse to accept its non-trivial flaws."}, {"author_name": "Miles", "gravatar_hash": "ed6c2205de03ca95dd9f08dc40b65fbe", "author_url": null, "date": "Oct 23, 2008", "message": "1800 INFORMATION:\nThe difference with an OpenID is needing to research which provider to use -- not a big deal, but still more effort than a direct sign-up.\nI'm happy to learn something new to use in development; learning something new (however trivial) about yet another online identity system is a barrier, when all I want to do is use this specific site."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 23, 2008", "message": "> being able to use a Facebook account in a bunch of places,\n\nHow is that any different than Microsoft's Passport? You want *Facebook* instead of *Microsoft* to control every aspect of your online identity?\n\nTo me, one of the biggest reasons to use OpenID is that it's, y'know -- Open!\n\n> I can’t think of any other login system that is so easy to hack\n\nI think this demonstrates a stunning lack of imagination on your part, because I know about a zillion developers who can implement something far, far worse in a few hours."}, {"author_name": "Michael Pryor", "gravatar_hash": "83678606ffe33ee7c1fb50b97338daed", "author_url": null, "date": "Oct 24, 2008", "message": "Hooray!  I'm so excited!!!\n\nAlso, what Andrew said at the top:\n\"If someone chooses the flikr provider, the field should probably be made non-editable.\"\n\nWhen I first signed up, I was an OpenID newbie so I didn't get it either and tried to enter\n\nhttp://yahoo.com/michaelpryor\n\nas the url instead of just http://yahoo.com"}, {"author_name": "David Arno", "gravatar_hash": "31fdbe39c7657652fb5f34cdef2c78c9", "author_url": "http://davidarno.org", "date": "Oct 26, 2008", "message": "@Jeff,\n\nFor you to hack the accounts of hundreds of OpenID accounts, you'd simply need to use some screen-scraping code that you could knock up in less than an hour. I look forward to you listing the efforts of these zillion developers that you could hack faster than this.\n\nOr to put it another way, you are talking crap sir."}, {"author_name": "Partyzant", "gravatar_hash": "00aa5bdbfcda2b20d8810c8572fd080d", "author_url": null, "date": "Oct 28, 2008", "message": "I cannot understand how it is possible that you think HTML cleanup is a critical part of your business, as you write in http://www.codinghorror.com/blog/archives/001172.html, but you can trust an unknown third party with authenticating your users. This is not critical? \n\nYou write \"The concept of identity and logins is an essential part of how our site works.\" and yet you're outsourcing the authentication to an unknown, perhaps technically incompetent or even malicious third party."}, {"author_name": "iAn", "gravatar_hash": "982870346a7bc7ec114eddb50c441bd3", "author_url": "http://www.geekcubed.org", "date": "Oct 28, 2008", "message": "And now Microsoft have jumped on to the bandwagon - http://dev.live.com/blogs/devlive/archive/2008/10/27/421.aspx\n\nAt least they mentioned StackOverflow ..."}, {"author_name": "Max Howell", "gravatar_hash": "e4c52368bee95d8ce856fd5fd5cda881", "author_url": "http://methylblue.com", "date": "Oct 31, 2008", "message": "Hi David Arno. Your argument implies most people have different usernames and password on all sites they visit and thus OpenID is dangerous. But this is false. The vast majority of people use the same login credentials on all the different sites they visit.Thus, for them, OpenID is as secure and a lot more convenient.\n\nAnd I am not alone in believing that a new technology that improves a situation for most people is a successful one.\n\nIn my opinion OpenID will make the web more secure for the common Joe. For one they can quickly and easily change their password for the whole Internet. Which also makes it easier to use a stronger password. And I can trust a single party (eg. MyOpenID) to make their login methods secure, rather than trusting a hundred different sites, most of whom are startups who have more pressing things to develop than a secure credentials repository.\n\nI agree it is not as clear cut as this. But my stance is that overall, OpenID is good, and I won't go into the whole debate on someone else's blog."}, {"author_name": "Jasper Bekkers", "gravatar_hash": "d2b23571aacbfc9147e634ee7154a502", "author_url": null, "date": "Oct 31, 2008", "message": "The thing that attracts me most to OpenID as an end-user is the fact that I can always choose to set up my own Open ID provider so that I don't have to rely on * any * third party to store my credentials."}, {"author_name": "Charles Duffy", "gravatar_hash": "5e2861b08f37fa306fbf5384994af688", "author_url": null, "date": "Nov 29, 2008", "message": "David Arno,\n\nI use an OpenID provider who provides a browser plugin which protects against phishing attacks (VeriSign's SeatBelt) and a physical one-time-password generation token.\n\nMy account on any web site which does not support OpenID  is thus more vulnerable to phishing than my (OpenID-authenticated) account on any web site which does -- and this is true for any other user who is cautious regarding their security."}, {"author_name": "James Here", "gravatar_hash": "6eea7021f35ebf35898cedae646b546a", "author_url": null, "date": "Jan 09, 2009", "message": "Uuuggh. I'm still using a anonymous account for every question I ask (I clear my cookies). I'd love to have an account with StackOverflow but the OpenID thing is so a big huge wall.\n\nWhy on earth would someone want the same account (ie username/password) on all websites? It's a massive privacy hole, and a massive security hole.\n\nIt's a bit weird because Stacko is so user-focussed, but the determination to use OpenID is so user-hostile."}]}