{"response": [{"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Oct 18, 2008", "message": "Wow, being on Hanselminutes really proves that SO made some impact in the developer scene already.\n\nGood Job!"}, {"author_name": "Brian Boatright", "gravatar_hash": "3e1f0ea43c0a4cb33eb65ec349901feb", "author_url": "http://www.developerbuzz.com", "date": "Oct 19, 2008", "message": "I really enjoyed this episode.\n\nSo when will you guys be on DotNetRocks?"}, {"author_name": "Rory Becker", "gravatar_hash": "9067207fa8d7277b738696bf506744cf", "author_url": "http://Rorybecker.blogspot.com", "date": "Oct 20, 2008", "message": "Trick missed not using \"That's SO HanselMinutes\" as show title :P"}, {"author_name": "Sean Patterson", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://www.dillieodigital.net", "date": "Oct 20, 2008", "message": "I'm listening to it now and I enjoyed how Scott really drilled down on you about some of your decisions. Not just the general poll of why you did x,y,z, but really made you explain why and if it was the best choice."}, {"author_name": "John Nolan", "gravatar_hash": "d71e6f29b4a15b0a2038f28ee913a293", "author_url": null, "date": "Oct 22, 2008", "message": "Wow you guys were really in the dock on this Podcast. Did you get the job? Or was it the unrecorded FizzBuzz problem that stumped you."}, {"author_name": "Simon Earnshaw", "gravatar_hash": "959e169893c5d1a7b562c9dbdf750708", "author_url": null, "date": "Oct 23, 2008", "message": "Yeh, Scott's style was more of an interrogation- than typical interview! I felt for Jeff at times...(not meaning to be patronising or anything - but I would hate to be put on the spot like that)."}, {"author_name": "Tony Drake", "gravatar_hash": "7c8dd3eae840fabe178ce0e868ca8ba1", "author_url": null, "date": "Nov 06, 2008", "message": "I've listened to 1000s of tech podcasts (the usual 5-7 .net, a java and mac one) - and the two Hanelminutes shows where the BEST two shows I've every heard- I rarely listen to shows twice (time poor), but I have to say Podcasts are generally pretty much people on their best behaviour, and also very much 'I know it all' from guests - DNR is typically too much of this..  most shows make me feel I'm sow low on the food chain, with much to learn....  (the new LINQ provider to your car's engine management system for instance)\n \nYour shows tell me that we're all very much fighting the same battles, with the same outcomes- the whole 'perfect way' in .net drives me bats, and your can-do and truth in what you've done on SO has make be feel like I'm (and my team) not far off the mark.\n\nMind you at TechAus I asked Scott about perhaps using java script rather then Silverlight, as Jscript maybe here longer then SL - he ripped my head off - but then MS anounced something with JScript (mmm) - perhaps you should have challenged him on his deployment of babysmash ;-)\n\nYour SO experience and also socialmedian interview on net@night have inspired me to 'get on with it' on a number of projects both at work at personal. \nGreat questions by Scott - better answers - perfect podcast!!"}]}