{"response": [{"author_name": "Michael A. Puls II", "gravatar_hash": "304d6e1b17c5bdd141f9dc5aef93587b", "author_url": null, "date": "Oct 04, 2008", "message": "Love being able to favorite a question now. It allows me to distinguish between a good question and just a question (even a bad one) that's interesting enough for me to save/monitor.\n\nHowever, FWIW, I had already gotten used to the idea of just voting up a question (even bad ones) that I thought were interesting enough to save/monitor."}, {"author_name": "Graphain", "gravatar_hash": "ebbed120580f668d0d76b1805ca14c28", "author_url": null, "date": "Oct 05, 2008", "message": "I thought the intention of “Favorites” wasn't yet another counter but just a way of tracking threads. \n\nSometimes you'll throw votes an up vote and not want to check out the thread again, other times you'll want to see how something goes without voting.\n\nI'm not complaining about how it is implemented but I guess that's what I assumed the difference was."}, {"author_name": "jjnguy", "gravatar_hash": "ddf71a8fc52a01e1ad726ee70b6e2a03", "author_url": null, "date": "Oct 05, 2008", "message": "Now I just can't wait to see what the preferences tab will become."}, {"author_name": "kaybenleroll", "gravatar_hash": "bb3f1a4ef1cf01ec9cc00ce927e52935", "author_url": null, "date": "Oct 06, 2008", "message": "I was using the upvotes as a way of tracking 'favourites' but found it to be problematic, as you can only see recent upvotes from your profile page.\n\nIs there a way to see all your up and down votes on SO?\n\nAlso, where is the most appropriate place to ask questions like this? You don't want them on SO, but Uservoice doesn't seem entirely appropriate either.\n\nKeep up the fantastic work!"}, {"author_name": "Andy Brice", "gravatar_hash": "c03f8fe411c21588a1bd1e37db4e2174", "author_url": "http://www.successfulsoftware.net", "date": "Oct 07, 2008", "message": "Favourites is very useful on Joel's BOS forum. I am sure it will be useful on SO.\n\nThanks!"}, {"author_name": "Jim Anderson", "gravatar_hash": "1bd6173e0acb78f9769dfff32bbecd5a", "author_url": null, "date": "Dec 11, 2008", "message": "Is there a way to sort by favorite; to see the entries most marked as favorite by all users?"}]}