{"response": [{"author_name": "Jivlain", "gravatar_hash": "cc4b382c9cf5750773e569859a0c205b", "author_url": "http://jivlain.wordpress.com", "date": "Jun 13, 2008", "message": "Well, I drop www when typing in the URL. Unfortunately many sites (particularly Australian government websites) don't support that. Other than that, I do sometimes include www in Google queries to indicate that I don't want any results from a subdomain."}, {"author_name": "Mike", "gravatar_hash": "304d6e1b17c5bdd141f9dc5aef93587b", "author_url": null, "date": "Jun 13, 2008", "message": "Drop the www."}, {"author_name": "Andre", "gravatar_hash": "95fd55a5e382faea51e1643a4426058b", "author_url": "http://andrebluehs.net", "date": "Jun 13, 2008", "message": "When using Apache, it is usually easier to set up the httpd.conf to handle it. \n\nTo handle www, but not use it as a prefix, just use the ServerAlias option.\n\nAnd actually, in a .htacces, wouldn't it be easier to use a 301 Redirect to the www or non-www page? its only 1 line, and alot easier to read."}, {"author_name": "Nick", "gravatar_hash": "b7925f7e50bee39554315103a24892a9", "author_url": "http://nickohrn.com", "date": "Jun 13, 2008", "message": "I think that dropping the www is the right way to go.  I haven't typed www in a web address in about 4 years, except when required (like by my university.. why can't they just rewrite it?!)"}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jun 13, 2008", "message": "Since there is a downside, I'm curious as to why you chose to go with it anyway. You didn't specify any benefits to dropping the www.\n\nIt just seems a little arbitrary, is all..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 14, 2008", "message": "More food for thought, no pun intended.\n\nhttp://developer.yahoo.com/performance/rules.html#cookie_free"}, {"author_name": "Duggy", "gravatar_hash": "1db145c1ed0a3cf5711cff93b84fb0dd", "author_url": null, "date": "Jun 14, 2008", "message": "Indeed I agree, especially since you'll rely on peoples cookies to allow you anon access. www. makes more sense."}, {"author_name": "James Ford", "gravatar_hash": "5c91f3854a7cf0d89f148f364cf6a47e", "author_url": "http://www.oq0.net", "date": "Jun 14, 2008", "message": "Hi Jeff,\n\nIf you like the Apache syntax you may want to try this product by ManagedFusion.\n\nhttp://www.managedfusion.com/products/url-rewriter/\n\nIt is very fast and allows the use of Apache syntax.  Even as a reverse proxy built in.  Oh and did I mention it is also FREE!\n\nJames"}, {"author_name": "Nicolás Miyasato", "gravatar_hash": "313a517a47d3bcf4091e397204facec9", "author_url": "http://nmiyasato.blogspot.com", "date": "Jun 14, 2008", "message": "As long as people can access the site in both ways, I really don't think this is important."}, {"author_name": "BlaM", "gravatar_hash": "b58a8f1dafcfb2594b00b71ff7594bf4", "author_url": "http://blogs.interdose.com/dominik/", "date": "Jun 14, 2008", "message": "For my projects I usually go \"with-www\" for my websites. The \"non-www\" domain goes to a redirect service (not even on the same server, but that's a technical detail) that makes sure, that all people go to the \"with-www\" url.\n\nA simple solution for the static files on a non-cookied domain would be to have a domain \"stackoverflow-images.com\" or \"stackoverflow-static.com\". Actually it could be \"gnpfrgldfaa.com\", but I'd choose a more readable one."}, {"author_name": "required", "gravatar_hash": "53f7a524cbd754b799a271637e84e5ea", "author_url": null, "date": "Jun 14, 2008", "message": "Support both like everybody else. Oh, and actually I am not sure that you should have the '.com' prefix and not '.org' ;P"}, {"author_name": "Bob", "gravatar_hash": "84ea925f6472174984dd0819c893c10c", "author_url": null, "date": "Jun 14, 2008", "message": "I think you should stick with www, it lets the user enter the web site (eg. stackoverflow) in the address bar and hit ctrl+enter for some magical auto-completion."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 14, 2008", "message": "Bob, it works either way through the URL rewriting described above. Try it yourself by going to\n\nhttp://www.stackoverflow.com/\n\nand see what happens.."}, {"author_name": "Isaac Lin", "gravatar_hash": "408975adb6e2f531f290e7fe0209a3a9", "author_url": null, "date": "Jun 14, 2008", "message": "Following up on Andre's comments, a Redirect (as is being done with the IIS configuration) is preferable to the URL rewrite that you show in your Apache configuration example, as this will keep your search engine rankings from getting split across your www and non-www addresses."}, {"author_name": "Isaac Lin", "gravatar_hash": "408975adb6e2f531f290e7fe0209a3a9", "author_url": null, "date": "Jun 14, 2008", "message": "And expanding on Jivlain's comments, note that by using the non-www address as your canonical URL, it becomes harder to use search engines such as Google to return results on only your main site (you have to also know what are the other sites in your domain, such as the blog site, and explicitly ask Google to exclude them). This may not be an issue for many sites, though it may be one for Stack Overflow, since those searching for community-derived information on the main site will probably not want to search the other sites in the stackoverflow.com domain."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 14, 2008", "message": "Isaac, in the .htaccess example [RP] means permanent redirect. See:\n\nhttp://httpd.apache.org/docs/1.3/mod/mod_rewrite.html#RewriteRule"}, {"author_name": "Oliver Jeeves", "gravatar_hash": "9a09b0df40ac0eb9bdebb8702e21eb7e", "author_url": null, "date": "Jun 14, 2008", "message": "I think whether you use http://www.stackoverflow.com or just stackoverflow.com is largely an unimportant decision.\n\nWhat is important, is how you handle the address you’ve decided not to use.\n\nIf you just get a 404 or whatever at the other site, this is obviously annoying for all those that typed it incorrectly.\n\nIf you display the same site for both http://www.stackoverflow.com and stackoverflow.com, it’s annoying as your browser sees it as two seperate sites and things like cookies and even just visited links and history don’t work correctly.\n\nSo as long as you are redirecting from one to the other, all is ok.\n\nPersonally, I prefer the www subdomain, because it logically seperates web content from, say, ftp or mail. But as I say, so long as it’s handled right, I don’t see anyone having a problem with this."}, {"author_name": "bp", "gravatar_hash": "cdfd5cadef76ea361532bfb20499a5ba", "author_url": null, "date": "Jun 14, 2008", "message": "Oliver: Your point about logically separating web content from ftp or mail makes no sense. Unless you're encapsulating all your FTP traffic in HTTP or something odd.\n\nSo, when's stackoverflow.com going to open? :)"}, {"author_name": "Isaac Lin", "gravatar_hash": "408975adb6e2f531f290e7fe0209a3a9", "author_url": null, "date": "Jun 15, 2008", "message": "Thanks, I missed the flags; however, perhaps that should be [R=permanent] ? I don't believe RP is a valid flag based on the documentation."}, {"author_name": "Ian Anderson", "gravatar_hash": "60b1c7dc18e08e1a16f313354814744f", "author_url": "http://thefirstpost.co.uk", "date": "Jun 15, 2008", "message": "I absolutely agree about the importance of enforcing a single canonical domain, but I would prefer to promote, and let people type,  \"stackoverflow.com\" and redirect everything to \"www.stackoverflow.com\" as the single canonical domain."}, {"author_name": "Michael Reit", "gravatar_hash": "b136a1382023f435b2f5f2c0ac28a3ee", "author_url": null, "date": "Jun 16, 2008", "message": "You have inadvertently closed the 'rule' tag on the first line."}, {"author_name": "Dave Jacoby", "gravatar_hash": "db1c27523043366c2ba1c9be1fa3fa23", "author_url": "http://varlogrant.blogspot.com/", "date": "Jun 16, 2008", "message": "I don't see the point for the wibble. Not anymore."}, {"author_name": "Vijay Santhanam", "gravatar_hash": "640b48a0bf5e3cc984bcef7b8db9a0dd", "author_url": "http://vijay.screamingpens.com", "date": "Jun 16, 2008", "message": "XML is the benevolent mark up that loves each and every one of us!"}, {"author_name": "Ryan Williams", "gravatar_hash": "f81281c11185cb99e7b782c17677373c", "author_url": "http://www.webthingsconsidered.com", "date": "Jun 16, 2008", "message": "For the stackoverflow audience, seems like non-www is fine.  For general consumer audiences, I'm still a believe in the www style, because I see so many people still wanting to type it in every time you tell them a URL, even if you want to discuss a subdomain.\n\nFunny, I started to read the IIS config snippet, and was thinking, wow, with Jeff's XML post, he's really gotta love that MS used XML for this.  I agree with the question, why not just use the .htaccess format.  Ridiculous.  I've been using ISAPI Rewrite for a couple years and just noticed their latest version was .htaccess compatible, smart for them."}, {"author_name": "Terrapin", "gravatar_hash": "6b89ab6fe40aeae63df5509238078bcb", "author_url": "http://terrapinstation.wordpress.com", "date": "Jun 16, 2008", "message": "I tend to think that setting cookies across the whole domain is a good thing.\n\nI say that because of my own experiences with having to change the subdomain of a well-established site (due to an unfortunate decision by Marketing). It was a small nightmare to change all of our cookie code to  central cookie-setter and cookie-getter routines (something I highly recommend starting out with, even if you're planning on few cookies), and getting it to work correctly. But the nice thing now is that our cookies are the same for dev.site.com, staging.site.com, admin.site.com, and www.site.com.\n\nThe point is, you don't know if in the future you're going to want to share cookies across two subdomains. If you need subdomain-specific cookies, just set it in the cookie name, i.e. \"admin-UserID\""}, {"author_name": "Terrapin", "gravatar_hash": "6b89ab6fe40aeae63df5509238078bcb", "author_url": "http://terrapinstation.wordpress.com", "date": "Jun 16, 2008", "message": "An amusing side note - my post above includes a link to a sample site (the editor added the http:// in front of the www. and turned it into a link). That particular site doesn't rewrite from www. to no-subdomain. You get a server not found error."}, {"author_name": "MattM", "gravatar_hash": "0d25a28499c75bb7868897add92c5b1c", "author_url": null, "date": "Jun 16, 2008", "message": "Tangentially on topic...\n\nI read somewhere recently (I'll try to find the link) that marketers are no long advertising URLs. Here it is: http://www.cabel.name/2008/03/japan-urls-are-totally-out.html\n\nAs more and more \"good\" domain names get used up, less memorable names are being used for web sites (not to mention domain squatters phishing for traffic). I frequently find myself guessing at a URL, and getting it (at times embarrassingly) wrong, so I am starting to just use Google to look up the URL.\n\nSo the point is that whether you use www or not (yes, you would still need to handle both) is less important than it used to be. If your site is popular, according to Google, then your URL will be at the top of the search results for the relevant search terms."}, {"author_name": "Edward", "gravatar_hash": "2c6276462696b307d9767a19aeec0dfa", "author_url": null, "date": "Jun 17, 2008", "message": "I think www is an artifact and should be removed. Imagine the opposite, Tim Berners-Lee didn't put the \"www\" there and you asked if you should add it? In the beginning people was new to all of this but today the web and URLs are common knowledge so why keep the www. Think the reason for it in the first place was so Tim could tell the IT admins to set up his special \"webserver\". Nowdays the domain is the webserver...and in the end it's a matter of taste. Like the 80x15 buttons one can see pretty often? How many knows where they come from? Plug about memes http://www.ted.com/index.php/talks/view/id/269"}, {"author_name": "AdmiralNelson", "gravatar_hash": "9772d20304797e7233e9fb65c36bbfac", "author_url": null, "date": "Jun 17, 2008", "message": "MattM: I think that is exclusive to Japan, and to many places where the english alphabet is radically foreign. Granted, people in Japan do study english in schools; but, flip it around. If all the URLs where in katakana; do you think people in America would advertise their URLs or ask you to search for it a la AOL keyword style.\nThis matter is rather unique to Japan, especially."}, {"author_name": "web design company", "gravatar_hash": "c648cb14010a2ea7ea2fb1796ea3b5af", "author_url": "http://ooyes.net", "date": "Jun 17, 2008", "message": "Not programming or interesting."}, {"author_name": "Ben Combee", "gravatar_hash": "d58ac41c5962f5caca60793591a589d2", "author_url": null, "date": "Jul 05, 2008", "message": "Jeff, in the rewrite rules, what about HTTPS URLs?  If you did https://www.stackoverflow.com, would you get redirected to the insecure site?  The rule puts http://domain.com/ at the start, which would break any secure URLs."}, {"author_name": "Jennifer", "gravatar_hash": "77c1a00814b9771386ff6332d94fe520", "author_url": null, "date": "Jul 28, 2008", "message": "Jeff and Isaac,\nI cannot find any valid reference for [RP] either. All I find is [R=permanent]. Does anyone know which is correct  for the httpd.conf?\nThanks."}, {"author_name": "David Buckle", "gravatar_hash": "2794c03b781fb325ebb80677eb514db0", "author_url": "http://www.directcontracts.net", "date": "Oct 27, 2009", "message": "I've been trying to form a generic rewrite rule but putting {HTTP_HOST} in the  doesn't seem to work. i.e:\n\nI want http://foo.com/ to redirect to http://www.foo.com/\n\nso I have this but it just redirects to http://foo.com/ again - any ideas?\n\n\n \n \n  \n \n \n"}, {"author_name": "David Buckle", "gravatar_hash": "2794c03b781fb325ebb80677eb514db0", "author_url": "http://www.directcontracts.net", "date": "Oct 27, 2009", "message": "sorry the last comment stripped my XML:\n\n\n\naction type=\"Redirect\" url=\"http://www.{HTTP_HOST}/{R:1}\""}, {"author_name": "Wayne Bloss", "gravatar_hash": "770a1f4797cc0879dd9e4954104767b1", "author_url": null, "date": "Jan 12, 2011", "message": "The one nice thing about the XML compared to the .htaccess format is that just by looking at your XML snippet, I actually know a lot more about what is going on because each parameter name is shown.\n\nThat said, I'd much prefer something like JSON for configs."}, {"author_name": "Mikin", "gravatar_hash": "e098ca3f1ad6f4194e326c51daba279b", "author_url": null, "date": "Jan 19, 2011", "message": "Hi guys, I am trying to use solution for drop off the www prefix, but its still not working. IIS module is already succesfully installed. Any Ideas ?\n\n\n\t\t      \n\t\t\t      \n          \n          \n            \n          \n          \n        \n\t\t      \n\t    \t"}, {"author_name": "Mikin", "gravatar_hash": "e098ca3f1ad6f4194e326c51daba279b", "author_url": null, "date": "Jan 19, 2011", "message": "hmm, my xml example was not posted, but im actually using the same example like here..."}, {"author_name": "Email.biz", "gravatar_hash": "9ad6caa2455d65ad452914b25cfc020c", "author_url": "https://www.email.biz/", "date": "Nov 08, 2012", "message": "Great, this works really good."}, {"author_name": "movie-square", "gravatar_hash": "3f4d9ec380b2b2a7dff11d4bb46c680e", "author_url": "http://www.movie-square.com/", "date": "Nov 08, 2012", "message": "Good article, thanks for sharing such a good stuff."}]}