{"response": [{"author_name": "Adam Haile", "gravatar_hash": "3a29aba7f7e68203d4265d5fcca46f53", "author_url": "http://adamhaile.com", "date": "Jun 09, 2008", "message": "If we were talking about muffinrecipes.com or something then definitely no.  But for a developer oriented site, I think it's mostly safe to assume that JavaScript is an acceptable requirement.  Granted, this may prevent people from participating via some mobile devices, but I really doubt people would want to be writing out code from the phone."}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jun 09, 2008", "message": "I can't say I'm a big fan of client-side scripting. Apparently my opinion is quiet rare, as Javascript is showing up everywhere- even in PDFs! (http://www.adobe.com/devnet/acrobat/javascript.html)\n\nAs long as I can scroll down the page without any noticeable lag, I guess it's fine with me. If I can't scroll properly, I'm not likely to stay long."}, {"author_name": "Zarate", "gravatar_hash": "9ffffa3c750ef8fb1f7514f7d0d98dfd", "author_url": "http://zarate.tv", "date": "Jun 09, 2008", "message": "Well, i agree with comments above. Provided your user target (developers) and that it's required only for participate, i'd say yes, it's ok.\n\nCheers!"}, {"author_name": "Lars Mæhlum", "gravatar_hash": "1d8ca7f9b479faa20672e5152144d951", "author_url": null, "date": "Jun 09, 2008", "message": "I'll tag along with the opinions of the above.\nBrowsing a page should be possible without any extras. As long as you browser is somewhat HTML-compliant, this should work.\nBut if you want to join in on the fun, it's OK to have some dependenies.\nRich text wysiwyg editing without javascript or flash is near impossible anyways."}, {"author_name": "Brian Sullivan", "gravatar_hash": "a21cd584ff01df83adbf6b3d03d6ecdb", "author_url": "http://www.sullivansoftdev.com/blog", "date": "Jun 09, 2008", "message": "I would have to say yes.  At this point, I don't think it's reasonable for anyone (outside of mobile device usage) to *not* have JavaScript enabled on their browser.  \n\nRyan:  I'm not sure I even understand your stance.  Not a fan of client-side scripting?  It's practically impossible to do anything of any complexity on the web without javascript.  What is the alternative?  I don't think doing everything on the server is a good answer..."}, {"author_name": "Justin Yost", "gravatar_hash": "83149adc0e0366baebe19fcaed5f7996", "author_url": "http://www.yostivanich.com/", "date": "Jun 09, 2008", "message": "JavaScript is okay in my opinion it adds so much to the website experience for the user and a website without JavaScript now feels old and slow in my opinion."}, {"author_name": "Hüseyin Tüfekçilerli", "gravatar_hash": "ea7063d6a51a923ca945008d137aaaa0", "author_url": "http://huseyint.com/", "date": "Jun 09, 2008", "message": "As long as \"Unobtrusive JavaScript\" (http://en.wikipedia.org/wiki/Unobtrusive_JavaScript) and \"Graceful degradation\" techniques are used, it will be ok IMO. Those will require a little more work though, which may slow down the development."}, {"author_name": "Keng", "gravatar_hash": "15769bbea999aee421458f52e7c9d011", "author_url": "http://www.TheMacroHook.blogspot.com", "date": "Jun 09, 2008", "message": "sounds good; just don't make it too heavy and keep it all on sight.  i hate seeing a dozen differ sights showing up in my 'No Script' firefox extension and not knowing which one to allow to let me see the content.\n\nthanks....love the show."}, {"author_name": "Doekman", "gravatar_hash": "b83de2466ffbd28e6493ee2fcd796978", "author_url": "http://zanstra.com/base/blog", "date": "Jun 09, 2008", "message": "Javascript is OK what I'm concerned. But it should be noticable javascript is necessary. \n\nFor example, if a button needs javascript, have a disabled button, and enable it with javascript. At the same time, provide a nice message stating javascript is necessary to do more advanced stuff..."}, {"author_name": "Dan Thompson", "gravatar_hash": "08bc3fc74454a8f22ac8e52d686dd058", "author_url": "http://danthompson.jottit.com", "date": "Jun 09, 2008", "message": "I doubt anyone turns off javascript on the desktop/laptop anymore. However, the site's target audience is likely to be more into mobile browsing than most, so it would be nice if it kinda worked. \n\nCould you render a plain text input when scripts were turned off? Don't worry about it for version 1 though."}, {"author_name": "Daniel Yokomizo", "gravatar_hash": "ca33cf3a10766186f28474e097ad0890", "author_url": null, "date": "Jun 09, 2008", "message": "If you force your audience to use JavaScript you also force them to accept all the possible security bugs that your site didn't properly prevented. Are you sure that you're free of XSS and CSRF attacks? JavaScript isn't a big problem if your content isn't user generated, but when it is and you're popular, you'll be a open target to crackers. If you do progressive enhancement, it's OK to have a worse user experience without JavaScript (e.g. forcing entire page reloads instead of just snippets), but there's no reason to leave features out, after all under the hood everything goes over HTTP anyway, if you're tying the features to JavaScript I would say there's something wrong with your design..."}, {"author_name": "Dan", "gravatar_hash": "52fed1789c96d298ae5e64fed77d63ed", "author_url": "http://danscode.com", "date": "Jun 09, 2008", "message": "Generally, my philosophy is to make the page degrade as gracefully as possible. Make it usable to users without javascipt but offer enhanced use for those with Javascript.\n\nThe way I prefer to do it is by making the site work (at a basic level) without javascript, then use Javascript to manipulate the DOM to make the page have the enhanced functionality you want.\n\nAt least that's the way I do it. If spam is a problem, the I don't know of any good way, other than perhaps a required captcha for posting stuff. An good free captcha is reCaptcha if you don't want to develop your own."}, {"author_name": "McDowell", "gravatar_hash": "cf02ac6dae1a5494913e0c0c9d9956d7", "author_url": "http://illegalargumentexception.blogspot.com/", "date": "Jun 09, 2008", "message": "I use the Firefox NoScript add-on as a matter of course, but generally don't view whitelisting useful websites as a problem. I would ask that you test all the features with JavaScript disabled to make sure that you don't get undefined behaviour. Things like hyperlink tags that direct to odd locations when no onclick event is caught or button elements that inexplicably fail to submit forms. Another consequence of using NoScript is that if the site relies on elements from another domain, these might not be obvious if they appear in odd places (like during those mysterious forwards that many e-commerce sites like to rely on)."}, {"author_name": "Tom", "gravatar_hash": "1f0b00b8853cf0311888bb3ed2a77ebc", "author_url": "http://www.tommcfarlin.com", "date": "Jun 09, 2008", "message": "I agree with the others...\nFor a site targeting at programmers and developers, it's safe to assume that the visitors will have JavaScript enabled or will know how to turn it on.\n\nFor sites that I've built that require JavaScript, I've always put a disclaimer visible only to those that don't have JavaScript. If you're going to require it, at least let users without it know they are missing out on functionality."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 09, 2008", "message": "Sorry if you tried to leave a comment earlier and got a 500 error.\n\nI tried WP-SpamFree (this blog gets several hundred spam comments per day now) but apparently it doesn't like running under Windows 2008."}, {"author_name": "Peter Burns", "gravatar_hash": "cfd2734f1de31db479ec2a8a4ecbd649", "author_url": "http://blog.rictic.com/", "date": "Jun 09, 2008", "message": "With jQuery, it's pretty easy to make your javascript very unintrusive.  Certainly reading the site shouldn't require javascript.  Otherwise I wouldn't spend too much effort making the site 100% feature complete without js.\n\nYou should definitely take a look at syntaxhighlighter: http://code.google.com/p/syntaxhighlighter/\n\nIn-browser syntax highlighting for a variety of languages for free.  I haven't used it yet, but if it's as good as it appears, it's a very good fit for stackoverflow."}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": "http://blog.zygonia.net", "date": "Jun 09, 2008", "message": "I used to be vehemently against Javascript on the client side mostly because of broken browser specific code.\n\nWith the advent of scripting libraries such as prototype, jQuery, scriptalicous, ASP.NET AJAX, et al which abstract away browser specific gnarlies I see no reason not to use Javascript where appropriate and useful.\n\nMy main caveat is that the use of Javascript shouldn't break stuff like being able to bookmark or the use back button.\n\nNow if you'd asked about Flash or Silverlight then I'd come round your house and set fire to it... :-).\n\nKev"}, {"author_name": "Michiel", "gravatar_hash": "03dc1d993fa7d5de422c1f35d53f80e6", "author_url": null, "date": "Jun 09, 2008", "message": "I think it is perfectly fine to require javascript if it really adds something. Don't use it because it is funny or pretty, but because it gives a better user experience."}, {"author_name": "Adam Haile", "gravatar_hash": "3a29aba7f7e68203d4265d5fcca46f53", "author_url": "http://adamhaile.com", "date": "Jun 09, 2008", "message": "@Kev\n\"Now if you’d asked about Flash or Silverlight then I’d come round your house and set fire to it… :-).\"\n\nWow...I mean, we all know the evils of Flash and Silverlight...but I think someone needs to lay of the Jolt Cola!"}, {"author_name": "Kevin Fairchild", "gravatar_hash": "2fd7f55aa7bfe99fe23e1f85a2babc96", "author_url": "http://www.developmentgeek.com/", "date": "Jun 09, 2008", "message": "Seems fine to me.  If it's what you need to provide the right tools for the site, go for it."}, {"author_name": "Ant", "gravatar_hash": "446d362592d5eca5518c06c309dfecdb", "author_url": null, "date": "Jun 09, 2008", "message": "Contrary to Adam Haile, I'd suggest that muffinrecipes.com would be more successful as a JS-dependent site.  Javascript is switched on by default, so only power users are likely to switch it off.  Developers, being frequently anal and backwards, are more likely to say, \"Javascript?  Pfft,\" leave the site, and never come back.\n\nSeriously, take a look at some of the comments on Slashdot when someone posts a Javascript-heavy site.  When your target audience still thinks that vi, emacs and the command line are cutting edge tools, you're really going to struggle to convince them that Javascript is a good idea.\n\nThe really annoying part is that the vi/emacs/command line crowd is comprised of exactly the kind of programming gurus that the site needs to attract.\n\n(Personally, I'm all for Javascript goodness if it makes the site easier to use, faster and more attractive.)"}, {"author_name": "Daniel Gomes Silveira", "gravatar_hash": "134545a5736a5e267e90f4e6bc8ca304", "author_url": null, "date": "Jun 09, 2008", "message": "I think is OKAY to require JavaScript. \nWe are already in Web 2.0.\n\nWhat are you concerned with? <a href=\"http://en.wikipedia.org/wiki/Links_(web_browser)\" rel=\"nofollow\">Links</a> users?? \n\nIf you give a good passive experience for non-javascript users, you have already dome a fantastic thing! Cheers!\n\n--\nBy the away... did you consider using <a href=\"http://developer.yahoo.com/yui/\" rel=\"nofollow\">YUI!</a> instead of jQuery? It is much much much MUCH better! (IMHO, of course)\n\nI use YUI! extensively in a Web 2,0 medical project with great success. I highly recommend it."}, {"author_name": "John", "gravatar_hash": "d0b76ae7bf261316683cad31ba0bad91", "author_url": null, "date": "Jun 09, 2008", "message": "I think it is fine to force users to use java script these days especially since it is a tech site."}, {"author_name": "Bryan", "gravatar_hash": "48f50f7d3617aa50f19993dec175a007", "author_url": null, "date": "Jun 09, 2008", "message": "100% absolutely it's OK to require it for the more advanced features. As echoed in other post, You should aim for basic functionality to work without JavaScript. Do you not kill yourself by any means to make something 100% “Gracefully degradable”\n\nThat being said I believe you should notify the users who do not have it enabled on exactly what they are missing."}, {"author_name": "Daniel Gomes Silveira", "gravatar_hash": "134545a5736a5e267e90f4e6bc8ca304", "author_url": null, "date": "Jun 09, 2008", "message": "ahaa.... I missed something... <a href=\"http://en.wikipedia.org/wiki/Links_(web_browser)\" rel=\"nofollow\">Links<a> already supports JavaScript... hehehe\n\nJeff.... don't think twice... don't limit your app... give us the best experience JavaScript can give.\n\nMaybe you do ti in a stackoverflow 2.0\n\nI think \n<a href=\"http://en.wikipedia.org/wiki/Accessibility\" rel=\"nofollow\">Accessibility</a> is much more important issue than non-JavaScript."}, {"author_name": "Andrew", "gravatar_hash": "97aeef6aa086aada9b5ce118d3f8e008", "author_url": null, "date": "Jun 09, 2008", "message": "Yes, I think it's ok to require Javascript, especially if it contributes to a better UI experience."}, {"author_name": "Mark", "gravatar_hash": "03cbe95f212d155de7934d44d25510a8", "author_url": null, "date": "Jun 09, 2008", "message": "Personally, I'm fed up of sites which are maintaining non-Javascript interactivity at the expense of a fast, well-designed UX. Degrading gracefully is a lovely idea to aspire to, but it means writing the same application twice; in some cases that's OK, but when it's just to appease Slashdotters in tinfoil hats... THWT. Most of us haven't got the time, and I'd certainly Jeff and Joel spent theirs producing content."}, {"author_name": "D'gou", "gravatar_hash": "d791a9150a39d0ee1a0d1eb10e9eba08", "author_url": null, "date": "Jun 09, 2008", "message": "I agree with Daniel Yokomizo, JavaScript has well known security holes. Many of my colleagues run multiple browsers and only fire up the one with JavaScript enabled for sites that are really important. YMMV."}, {"author_name": "Pat H", "gravatar_hash": "df0eee24254231e5393a7c5cfc4c3a0e", "author_url": "http://patpack.blogspot.com/", "date": "Jun 09, 2008", "message": "I think with web development these days as well as the target audience you are aiming for, requiring javascript is perfectly feasible."}, {"author_name": "Rob", "gravatar_hash": "c290d3851c7837081d05b3491cbc331b", "author_url": "http://cantgrokwontgrok.blogspot.com", "date": "Jun 09, 2008", "message": "I say go for it, I agree with many of the comments here, so long as the site degrades well without JS, I don't think its unreasonable to expect a [primarily] developer  community to have post-arcane browsers :)\n\nProvided it works well of course, nothing like a fancy interface that fancily fails :D"}, {"author_name": "James McKay", "gravatar_hash": "c17cb25cd9793d3d972c5cc3b1ae6eee", "author_url": "http://jamesmckay.net/", "date": "Jun 09, 2008", "message": "One thing you need to watch out for: accessibility. If you want the site to be accessible you need to make sure it downgrades gracefully. IANAL but without JavaScript support, you may be falling foul of anti-discrimination laws (here in the UK it's the Disability Discrimination Act 1998 and a smorgasbord of EU directives, I think the US equivalent is called the Americans with Disabilities Act or something). Then again I gather that modern screen readers etc can handle JavaScript quite well.\n\nWhile on the subject of accessibility, please be kind to those of your readers who hate using a mouse! Since this is a tech site, you'll have a lot of power users like myself who prefer keyboard shortcuts to mice (some of us have even experimented with alternative keyboard layouts to try and make things even easier) and to force us to flip between the keyboard and mouse and increase the prospects of RSI is just downright infuriating."}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Jun 09, 2008", "message": "Hi Jeff,\n\nPersonally my philosophy is that Javascript isn't required to view.  But any action beyond that it is required.  This allows casual mobile phone browsers, security freaks, and Google bots to view my content.  \n\nI use this philosophy on http://www.ideapipe.com, seems to have worked pretty well so far.\n\nNick"}, {"author_name": "Minnow", "gravatar_hash": "848f3559b4a0a8cb25808c3512442aa9", "author_url": null, "date": "Jun 09, 2008", "message": "Of course js is ok! Why would you even question it? I'd think you'd be looking at this project from an AJAX point of view anyway. The browser is moving closer and closer to becoming the dominant platform, and as developers, we're going to need to start pissing some people off in order to keep things moving for the better. Stackoverflow should be symbol - showcasing what you can do with a browser, not choking itself on politics to appease the backward and fragile few.\n\nAt least, that's my opinion."}, {"author_name": "Nicolas Miyasato", "gravatar_hash": "313a517a47d3bcf4091e397204facec9", "author_url": "http://nmiyasato.blogspot.com", "date": "Jun 09, 2008", "message": "Requiring Javascript is not at all that crazy. However, I think you should give an alternative for those that do not want any JS."}, {"author_name": "SpoonMeiser", "gravatar_hash": "9a09b0df40ac0eb9bdebb8702e21eb7e", "author_url": null, "date": "Jun 09, 2008", "message": "I don't think it's OK to require JavaScript.\n\nI don't mind not getting all the features without JavaScript, but is a text box and a submit button too much to ask?\n\nI don't see why the target audience being developers has any bearing on this issue. Yes, it's a tech site, but that doesn't mean that techies necessarily like or use every technology available."}, {"author_name": "Brendan", "gravatar_hash": "36c9d60c1653c9e295189ffd803a7fb6", "author_url": "http://www.devspade.com", "date": "Jun 09, 2008", "message": "An interesting question - I'd guess that if you put JS in and never asked this question most of those who are voting against it would just use it.  I think it's one of those - better to ask forgiveness then permission issues."}, {"author_name": "Terrapin", "gravatar_hash": "6b89ab6fe40aeae63df5509238078bcb", "author_url": null, "date": "Jun 09, 2008", "message": "I agree that 'passive' participation should require no JavaScript at all. This is important for SEO reasons.\n\nDevelopers in this day and age will most certainly have JavaScript-enabled browsers, so my opinion is generally 'YES', JavaScript is OK, but users should have the ability to post answers and questions without JavaScript, using a good old-fashioned form post.\n\nMy only bones to pick with JavaScript are that its performance is less than stellar (especially in Firefox, hopefully to improve with FF3), and of course implementation variations between browsers."}, {"author_name": "ejel", "gravatar_hash": "de0cc2dc844a9c0286f1db1d3833344f", "author_url": null, "date": "Jun 09, 2008", "message": "A web app requiring javascript is the default for me anyway. So I don't have any problem with that at all."}, {"author_name": "Jivlain", "gravatar_hash": "cc4b382c9cf5750773e569859a0c205b", "author_url": "http://jivlain.wordpress.com", "date": "Jun 09, 2008", "message": "I definitely agree that Javascript should be optional for viewing questions and answers. If I was just finding the site randomly that would probably sending me looking for a different regular source.\n\nAs for active participating - if Javascript is optional to some extent I would consider that an advantage. For example, it's probably logical enough to require Javascript for modding things: you could do it like bash.org but that, frankly, is a bit more annoying than say Reddit.\n\nNonetheless, if you can, say, ask your question or post an answer without requiring Javascript that's a plus. A textarea is not that hard (and personally I'm not a fan of WYSIWYG text editors in a browser). Maybe it's just me, but there are few things I hate more than trumped-up textareas.\n\nIn summary, as a tin-foil-hat-wearing Noscript-using paranoid conspiracy theorist, I'm nonetheless comfortable enough with, say, Reddit which requires Javascript for active participation but not passive reading."}, {"author_name": "Zeppelin", "gravatar_hash": "160a71f3fb3e0d8a2c4313e2ab0cc7bb", "author_url": null, "date": "Jun 09, 2008", "message": "It depends. If your 99% of your visitors are using a desktop browser, it's quite safe to say that any amount of JS is acceptable (taking performance into account, of course). Otherwise I would be more cautious..."}, {"author_name": "Srikanth S", "gravatar_hash": "a748709ce7bc86b645670ceaf9272acb", "author_url": "http://blog.srikanths.net", "date": "Jun 09, 2008", "message": "Yes!\n\nEnough said :)"}, {"author_name": "Will Sullivan", "gravatar_hash": "b32a129ace0693b2455d0ffc43e4235d", "author_url": "http://statestreetgang.net", "date": "Jun 09, 2008", "message": "If you choose to turn off javascript in your browser, don't you already know you will be universally hated and ostracized by the web development community?\n\nI see turning off javascript akin to what Bruce Willis did in Die Hard with a Vengence, right about when he meets Sam Jackson for the first time in the movie.  Sure, you're free to do it, but you cannot possibly expect to go about unscathed for it."}, {"author_name": "Joseph", "gravatar_hash": "0b1cc59c87d56c90e526ebd510f8c8bb", "author_url": null, "date": "Jun 09, 2008", "message": "So long as none of the menu or commonly used links are implemented with onclick handlers it's ok. The problem with this is that it doesn't work well with the \"Open in New Tab\" in either Firefox or IE.\n\nSo if I'm looking at a topic and I like the answer so I want to see all the answers provided by that user. I want to be able to open that user's profile in a new tab rather than replacing the content that I still want to see/reference later."}, {"author_name": "Rudd Zw", "gravatar_hash": "dca8abee1255f6425a4cebf403263c24", "author_url": null, "date": "Jun 09, 2008", "message": "As you've already said, it would be horrendous if javascript were required to view questions and answers.  But then obviously, it would be equally terrible to require javascript to ask a basic question.  While javascript would be great to enhance the participatory environment, and should be there, some people genuinely do need just to get a single question answered, and may not have access to a javascript-enabled browser (perhaps it's a restricted public computer or something).\n\nAs for the question answering/editing, I'd say that's fine to require javascript.  However, you're not really serving up a first-class experience for unregistered and restricted users if you're requiring javascript just to get a question answered.\n\nThat said, I always have javascript enabled, and have never used a computer that had javascript disabled.  It is a tiny portion of the users that have javascript permanently disabled.  Thusly, it should not be a priority to work without javascript.  It should be a goal for the future, but requiring javascript is fine for now."}, {"author_name": "chakrit", "gravatar_hash": "793bfa873cfc2e5b540f496f44702deb", "author_url": null, "date": "Jun 09, 2008", "message": "Yes, as long as it _Degrades gracefully_ and does not provide yet another security hole."}, {"author_name": "Dan Seagrave", "gravatar_hash": "5842cff261b00fd6885869fb7ff88874", "author_url": "http://danseagrave.net", "date": "Jun 09, 2008", "message": "Personally I'm of the opinion that the main functionality of the site (in this case reading, posting a question and answering a question) should be possible without any client side scripting available (just as it should work with images turned off). I'm with James McKay above, that you should do this for accesibilities sake, with the fringe benefit that mobile users will thank you.\n\nFor me the JS fancyness should be added unobtrusively. If that means that the non-JS user just gets a textarea, a submit button and a message about how much improved their life would be with JS on then so be it. But at least the non-JS user can participate at the lowest level.\n\n\nBy the way, have you looked at WAI-ARIA: http://www.w3.org/WAI/intro/aria\nA few extra attributes in your html and compatible Assistive Technologies will be kept informed about dynamic changes in your page (so screen readers won't miss AJAX/JS updates)."}, {"author_name": "David Hayes", "gravatar_hash": "57ecacb1c00a55c3d935e4076af923b1", "author_url": "http://www.spindriftpages.net/blog/dave", "date": "Jun 09, 2008", "message": "I think it's fine, I'd rather it was used for function over form though."}, {"author_name": "BlaM", "gravatar_hash": "b58a8f1dafcfb2594b00b71ff7594bf4", "author_url": "http://blogs.interdose.com/dominik/", "date": "Jun 09, 2008", "message": "Maybe you should better ask, how many people actually turn off JavaScript - and then decide if that quantity would hurt you if you'd loose those people using the (probably few) functions that *require* JavaScript.\n\nI think in today's world your internet experience is really limited if you turn off JavaScript in your browser, so I'd expect a max of 5% of users having JavaScript actually turned off."}, {"author_name": "Saniul Ahmed", "gravatar_hash": "d070df533299d18926a873a7621d331a", "author_url": null, "date": "Jun 09, 2008", "message": "Yes."}, {"author_name": "Kevin Dente", "gravatar_hash": "23c1e2063688620b75b248e08c0d5c24", "author_url": "http://weblogs.asp.net/kdente", "date": "Jun 09, 2008", "message": "Yes. That is all."}, {"author_name": "Brian Brewder", "gravatar_hash": "a00ef268d501a11f698c8cc97156e489", "author_url": "http://www.redwerb.com", "date": "Jun 09, 2008", "message": "I'm leaving my vote for Javascript. I hope you don't waste any time trying to create a non-javascript version of the site (though I agree that reading content shouldn't require Javascript).\n\n@BlaM makes a good point about asking how many actually turn it off. If Coding Horror is any indication of the type of people who will visit Slashdot (which I think it is), perhaps you should check the site stats. \n\n97% of the hits on my website have Javascript enabled. I wonder if that 3% would be content contributers anyway?"}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Jun 09, 2008", "message": "If you could put up some examples of functionality you think is unfeasible without JavaScript, I’d like to have a look. Difficult to make the judgment without seeing the benefit."}, {"author_name": "Dave Jacoby", "gravatar_hash": "db1c27523043366c2ba1c9be1fa3fa23", "author_url": "http://varlogrant.blogspot.com/", "date": "Jun 09, 2008", "message": "<i>I think in today’s world your internet experience is really limited if you turn off JavaScript in your browser, so I’d expect a max of 5% of users having JavaScript actually turned off.</i>\n\nYeah, but where are you most likely to see Javascript turned off? I think that programmers are most likely, as it was those types back in the day who would run with images off to speed up their browsing, or ran lynx. Those are the ones who know the security issues and load NoScript. And that would be the core of the audience.\n\nIf possible, make it doable without JS but more feature-full with."}, {"author_name": "Bruce Atkinson", "gravatar_hash": "0c241cebbad2e93625acc181329223cc", "author_url": null, "date": "Jun 09, 2008", "message": "To me it's a given that you will use JavaScript.  Why even bother trying to not use it?  Don't waste a lot of time trying to appease a tiny percentage of users, especially if you are only using it to be interactive with the site."}, {"author_name": "Colen", "gravatar_hash": "d265f32452ad84f5333d32e138733b50", "author_url": null, "date": "Jun 09, 2008", "message": "I wouldn't use it for the sake of using it. But if you have stuff you need to do with it, why not? This is a website for developers, not people stuck in the 90s using Internet Explorer 4."}, {"author_name": "Joseph Pecoraro", "gravatar_hash": "b8745f0c7e7d1e31c3009bbf88159c58", "author_url": "http://blog.bogojoker.com", "date": "Jun 09, 2008", "message": "Yes.  But it really is a shame that you even have to ask =("}, {"author_name": "Chris", "gravatar_hash": "1ce04312daddc2060e9f6d87805cad2a", "author_url": "http://www.developingchris.com", "date": "Jun 09, 2008", "message": "@joseph I agree, absolutely. Participation implies action, and the first action you must take, enable JavaScript. Its a barrier of entry that most sited now a days require. Degrading features is a waste of time, since it doesn't help anyone get the final product faster. Get to market, no JS is a detail left for the post production editing."}, {"author_name": "Jamie", "gravatar_hash": "86352f2c7989bb45c951d56dd6711383", "author_url": "http://www.idevs.co.uk", "date": "Jun 09, 2008", "message": "Seruously?? Some of the comments here heart my very inner core. No it is not OK to intentionally design a site where the key features require javascript. \n\nSomeone above posted a comment stating that that application would need to be written twice....huh? what? Any decent developer would design a static version of the site then add features to the top to create a dynamic layer. All the main code running the backend should be there and be accessible....if you have built the application correctly that is.\n\nGraceful Degradation is a very important concept in UI design and is important to at least attempt to maintain it. And here I thought developers would have developed some sense by now."}, {"author_name": "tndal", "gravatar_hash": "7051125727b4df3e6b3c21f0b2d76749", "author_url": null, "date": "Jun 09, 2008", "message": "JavaScript should never be required.\n\nEvery once in awhile a JavaScript bug appears that's large enough to drive a container cargo train through. For several days (or weeks in some instances), as hackers worldwide exploit the bug and developers and sysadmins try to close the gap, users are instructed to disable JavaScript to avoid security problems. Once they do so, much to their surprise a great deal of the WWW doesn't work anymore. Frustrated users then re-enable JavaScript and their systems are penetrated despite warnings. Once the problem is fixed everyone forgets about their bad experiences and blithely go on their way again.\n\nIf only for this one reason your apps should run in their entirety with JavaScript disabled."}, {"author_name": "david", "gravatar_hash": "ef079515af1c9963c7cd33e0b4f00e88", "author_url": "http://dlinsin.blogspot.com", "date": "Jun 09, 2008", "message": "yes, it is most definitely okay."}, {"author_name": "Tony Wong", "gravatar_hash": "c5bf252e576e488fdfe61b0438ff6c51", "author_url": null, "date": "Jun 09, 2008", "message": "Javascript support on text-based browsers have historically been spotty. I think it is important to make sure stackoverflow will support those browsers because individuals with disabilities sometimes have no choice to use anything else. Building an accessible site will encourage more participation from users from a wider background. Imagine that one of the future stackoverflow topics is how to build an accessible website/application?"}, {"author_name": "Lance Fisher", "gravatar_hash": "c1f0bb6c6d36ab5aba3fdacd1db03bf1", "author_url": "http://lancefisher.net/blog", "date": "Jun 09, 2008", "message": "Definitely don't require JavaScript to view.  I'm pretty sure Google doesn't run js, but you already knew that.  \n\nAs for participating, you should really aim for graceful degradation.  i.e. Don't require js.  You might find that it's not that hard once you discover some tricks.  For example, lightbox turns links into those cool popups that show images in an overlay.  If you don't have js running, you can click the links to get to the full-size pictures.  No extra work really, just a bit of clever application."}, {"author_name": "Ben", "gravatar_hash": "8fb95bde97cca5563771aafb7eeeab01", "author_url": null, "date": "Jun 09, 2008", "message": "Yes.  \n\nPossibly have a \"no javascript required\" version for viewing."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jun 09, 2008", "message": "I think it's OK to require JavaScript for participating, just one word about reading: Reading should not only be possible without JavaScript, it should also LOOK Properly without JavaScript. I've seen sites that use JS to dynamically create content and manipulate the DOM, and when you visit such a site without JS, it looks horrible. Kinda like when you delete the CSS, except it's a different kind of horrible.\n\nMore than often, i had to use a TextMode browser like Lynx when working on a *NIX Server. Lynx is fine for looking up some stuff on Google, but on some pages, it's just painful."}, {"author_name": "Phil Harris", "gravatar_hash": "de498363c8d6f4f45f538d9239c17a15", "author_url": null, "date": "Jun 09, 2008", "message": "I don't have an objection to JavaScript being required for participating."}, {"author_name": "Denis", "gravatar_hash": "29a14edb8f1a94ea6851a9510ad56fa0", "author_url": "http://katinas.org", "date": "Jun 09, 2008", "message": "I would say that on the outpost of web coding one should give the best example for the world, which is Progressive Enhancement.\nIf a situation rises, where making it work without JavaScript is a PITA, probably you are using JS wrong.\nNoScript is important.\nI would love to be able to get at least base functionality with JS turned off. Of course, fancy sortings, effects and stuff is ok to go, but let me do my important things, like read and write without JS.\nThank you."}, {"author_name": "wds", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Jun 09, 2008", "message": "I do not see why you would make the basic features (such as posting) javascript only. There are few popular sites on the web that I can think of that do this. Think gmail for example, even though it's ajax-based it still degrades to html nicely.\n\nThere are plenty of reasons I can think of to try to post something without javascript enabled. Mobile devices is one thing, logging in from some wifi hotspot with low bandwidth is another. (packet loss can be a real issue for your ajax connections) Maybe you're trying to save cpu cycles (can be important on an ultralight) or you're in the middle of nowhere and have a really crappy connection.\n\nSo maybe you'll be excluding 3%-5% of your users, but you're also limiting the ways in which your site can be used. From where and with what devices, which is the reason graceful degradation is so popular on major sites, because they don't want to do exactly that."}, {"author_name": "Ed", "gravatar_hash": "d387f428c19c3b6774bb9496bef9ac21", "author_url": null, "date": "Jun 09, 2008", "message": "JavaScript is so pervasive on the net these days that I do not see a problem with requiring it so that you can provide a better set of features on your site.  I guess it depends on how useful the features that require this will be to the majority of your users."}, {"author_name": "Scott", "gravatar_hash": "5f80731ab5c58bfea71307e09c023786", "author_url": null, "date": "Jun 09, 2008", "message": "Will it work on the common mobile devices that might be used by developers on the road?  (Blackberry, SmartPhone, iPhone, etc).)\n\nOne of my major pet peeves about sites that have a lot of javascript for their core functionality is that they don't really work very well on the mobile browsers.  Please don't leave those of us who surf the web remotely behind!"}, {"author_name": "V1", "gravatar_hash": "21f4971707a00270b92e2ae791d5633d", "author_url": null, "date": "Jun 09, 2008", "message": "People with Javascript disabled should burn in hell anyways, its save to say that most of the last build websites all require some sort of javascript.\n\nIts a question u want to ask.. Stay in past or take steps forward in the future."}, {"author_name": "Amr", "gravatar_hash": "bd05987c96cc061f538ee47374f2d705", "author_url": "http://www.amreldib.com", "date": "Jun 09, 2008", "message": "Yes, it is.."}, {"author_name": "Sean", "gravatar_hash": "caaaf05cd3770dd82548cf3ada462bf9", "author_url": null, "date": "Jun 09, 2008", "message": "It's \"OK\", but not preferred. I would try very hard to follow the mantra of progressive enhancement."}, {"author_name": "John Fraser", "gravatar_hash": "a6bfbfb00a776dcfb59ab291cc79173c", "author_url": "http://wmd-editor.com/", "date": "Jun 09, 2008", "message": "I'm a little late to the party, but I wanted to point out that WMD itself degrades pretty gracefully without JavaScript: your textarea shows up without the toolbar, and users can enter text in Markdown (or in HTML if you've decided not to do your Markdown processing on the server side)."}, {"author_name": "Jared Barboza", "gravatar_hash": "2b40ce75995f692062755d4c83dac55d", "author_url": "http://www.pistalwhipped.com", "date": "Jun 09, 2008", "message": "I don't see a problem with requiring javascript as long as it goes towards enhancing the UX or increases the performance of the site."}, {"author_name": "dude", "gravatar_hash": "81e649868a7d1914a3c92b2af2d50993", "author_url": null, "date": "Jun 09, 2008", "message": "I can't think of a single reason why someone wouldn't have JavaScript enabled. Are we stuck using Pentium 3's or something here? If a site uses too much annoying JavaScript, just leave the site.\n\nJust about every high profile site requires JavaScript. Apple.com and facebook.com are two very high profile examples."}, {"author_name": "OJ", "gravatar_hash": "f854d71fab62ee5b3893e3bebb88f592", "author_url": "http://rant.blackapache.net/", "date": "Jun 09, 2008", "message": "I can't see why anyone would have a problem with this at all. I doubt that the viewers of stackoverflow.com are that anal that the don't have a browser installed that supports javascript.\n\nI say: knock yourselves out! :)"}, {"author_name": "Glen Lipka", "gravatar_hash": "6a3cc75cd769754a59abda9c112eff5e", "author_url": "http://www.commadot.com", "date": "Jun 09, 2008", "message": "Yes it's ok to require JS.\nGood choice with jQuery. :)"}, {"author_name": "Mike", "gravatar_hash": "27b9aaca2520d605651e0314c557f662", "author_url": null, "date": "Jun 09, 2008", "message": "It's june 2008, do you still expect any new insights into this matter? You can do this yourself, google the pros and cons and make a decision. If you want out input, make it a poll, otherwise it's pretty useless asking."}, {"author_name": "Braden", "gravatar_hash": "95a54632f5fb11795c3f384d7acea62b", "author_url": "http://bluej100.blogspot.com", "date": "Jun 09, 2008", "message": "I am marginally more likely to participate on a site I don't have to add to NoScript. I suppose one could argue in favor of a small barrier to participation, but you may be excluding insight from some paranoid developers.\n\nI favor simplicity by default on a developer's site; I'd rather have it fast on my iPhone than flashy."}, {"author_name": "David Nelson", "gravatar_hash": "67361465cdc7e679bf25ecf3176f06a1", "author_url": "http://www.commongenius.com", "date": "Jun 09, 2008", "message": "I love all of the people commenting that users who turn JS off are \"anal\" or \"stuck in the past\". I guess no one cares about security or performance anymore?\n\nJS should absolutely NOT be required for any of the core functions (reading and posting at minimum), nor should there be any reason for it to be required. It MAY be used to enhance those functions where appropriate."}, {"author_name": "xml7", "gravatar_hash": "03b7ee3ff1fc168e1ed8def6ed1569d4", "author_url": null, "date": "Jun 09, 2008", "message": "The visitor with JavaScript enabled will know no different.  The visitor with JavaScript disabled will. If you provide the ability to interact with your website without having to turn it on, you'll have pleased visitors that are more likely to return."}, {"author_name": "Jonas Follesø", "gravatar_hash": "f4f0c1d237a24c6395b23680acbca1ee", "author_url": "http://jonas.follesoe.no", "date": "Jun 09, 2008", "message": "JavaScript is no problem. Even the phones are getting decent JavaScript runtimes."}, {"author_name": "Erik", "gravatar_hash": "e6ae20e8305cf9d8b58d45d78130db1e", "author_url": null, "date": "Jun 09, 2008", "message": "I find it amusing - after reading dozens of posts explaining multiple reasons to have some subset of function without JavaScript, there are still people responding that they can't imagine any reason why JavaScript shouldn't be required. :-) \n\nI agree that having read functionality without JS is a must, and a minimal post functionality without would be nice.  Anything more is quite reasonable to require JS for.  \n\nAnd let me also add myself as a NoScript user and ask that all the scripts come from the primary domain, so I can limit what to trust."}, {"author_name": "Ashwin Nanjappa", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": null, "date": "Jun 09, 2008", "message": "Yes, without a doubt."}, {"author_name": "Ben Curtis", "gravatar_hash": "31760d70505caf9b8e9182960ece00ea", "author_url": "http://bivia.com", "date": "Jun 09, 2008", "message": "One vote for \"do NOT require JavaScript to participate.\"\n\nMany people have mentioned \"JavaScript off\" as the reason to provide a viable, non-scripted experience. Although \"JS-Off\" is a nice shorthand for the situation, it implies a preference setting when this is rarely the case. \"JS-Off\" really should be though of as \"JS active,\" and there are many cases where JS may be available or on, but your code will not run. Causes I'm familiar with:\n\n1- Tech-heads turn it off because they want something more \"pure.\" (This is what most people think of when they think \"JS-Off\")\n2- Corporate, government, and military firewalls run by said tech-heads filter out external JS files. They do this not maliciously or out of their own purist attitude, but because the management paid for a million dollar intranet app essential to business, and it only runs on IE6 -- and the app breaks if IE6 is modified, patched, or uninstalled, so it must be shielded vigilantly. (Estimate likelihood by asking yourself what forces would cause 40% of your traffic to still run IE6 in this day and age -- it's not lethargy, when the easiest thing to do was to let the auto-upgrade take place last year.)\n3- A JS error, perhaps delivered via ad code and out of your control, causes the JS engine to shut down on your page (and most people will not see an error message). If the JS shutdown happens without their knowledge, and they happily spent 30 minutes composing some \"participation,\" only to have it disappear when they submit it, you've been an ungrateful host.\n4- A JS error, perhaps caused by your code interacting with some crazy Unicode character or XSS technique you never tested against, causes the JS engine to shut down temporarily. See #3.\n5- The future is unknown. In 1998 I was monintoring how much of my company's traffic was JS-Off, when a security hole in IE4 caused Microsoft to recommend turning off JS. Within two months we went from 5% JS-Off, to over 40% of our visitors with JS-Off. Our JS-On competitor folded shop, and we increased our traffic -- maybe from our competitor's audience.\n6- In 1998, JS-On was risky; after a period of low risk (2000-2005, after which JS-Off cell phones started to take off), it is becoming risky again -- and this is due to positive pressure. It's a Good Thing, and unlikely to go away. Cell phone and other non-PC browsers are becoming JS-compatible at the same time we're seeing explosive growth in non-browser uses of the web. Apple's Dictionary is not JS-capable, but pulls from Wikipedia; Safari and IE8 allow \"web clips\", where users can crop out a portion of your page and view it outside of the regular browser environment (in these cases, still rendered by the browser engines, but not necessarily the JS-engine); RSS and other news readers specifically do not run JS, but they are now incorporating other data scraped from well-formed markup on web pages. In a forward-thinking architecture, you can't be certain what environment your markup arrives in.\n\nOnly one of these six cases represents an audience that actively chose to turn off JS, and can turn it back on. The other five audiences with JS-Off do not even know it -- they just know your site doesn't work. The result of all of this is that you may assume that JS is active, and in turn you will find that you are right -- because your site will act as a passive filter reducing the participation of those who do not conform.\n\nYou are a pro, and you know a lot about this field, but no matter how much you know now it is safe to say that you will learn more about this particular project in the future than you have in the past. By assuming JS-On, you are stating that what you already know is more important than what you don't yet know. Progressive enhancement, by assuming JS-Off (among other things), means that you will always be able to build up (or down) to whatever the future has in store.\n\niPhone multi-touch events, anyone?"}, {"author_name": "Trance Diviner", "gravatar_hash": "1654cc357241e9135c6baac21b1b465c", "author_url": null, "date": "Jun 09, 2008", "message": "The web is no longer HTML.   It is HTML and JavaScript.  This is a no–brainer. \n\nThe more exciting question would be:  should I require Flash?"}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jun 09, 2008", "message": "Very well put, Ben Curtis!\n\nAlso, Jeff and Joel, you'd better talk about what your decision is in the next (or next next) podcast! :P"}, {"author_name": "Chris", "gravatar_hash": "298e0497aa6b76a573f17e6a2bb22dec", "author_url": null, "date": "Jun 09, 2008", "message": "I think it would be fine to require JavaScript. For all purposes. Even passive viewing. \n\nWho the heck is seriously going to browse this site from their cell phone? I have an iPhone, and I would still probably never browse it from that. What's the point? You're programming. Which means you're on a computer. Which means you have a browser. Use it.\n\nPlus, how would you even comfortably read code from a tiny phone screen? It wouldn't even be useful."}, {"author_name": "Mike Schall", "gravatar_hash": "364a82690a18c39bf042f46655a11243", "author_url": null, "date": "Jun 09, 2008", "message": "I would say yes.  I guess I'm a sucker for eye-candy.  \n\nI'm sure it is too late to suggest another javascript library, but I use dojo (http://www.dojotoolkit.org/) and love it.  The widgets (http://dojotoolkit.org/projects/dijit) are awesome.  \"Degradable by design.\" and  \"Accessibility out of the box.\"  Plus they have a source highlighter (http://archive.dojotoolkit.org/nightly/dojotoolkit/dojox/highlight/tests/test_pygments.html)"}, {"author_name": "kevin", "gravatar_hash": "ad6a3db918199fd3f5664951a69e98de", "author_url": null, "date": "Jun 09, 2008", "message": "Javascript should be mandatory.\n\nMost websites develop a second version for mobile devices."}, {"author_name": "Simon Willison", "gravatar_hash": "ac7005eff7720218df4cf0c72ddf6a3d", "author_url": "http://simonwillison.net/", "date": "Jun 09, 2008", "message": "I have trouble imagining features on a community / Q&amp;A site that are really going to require JavaScript. It sounds like a perfect opportunity to deploy unobtrusive scripting techniques - build the site as a regular web application, then have the JavaScript upgrade various elements of the site to add Ajax form submissions, fancy effects and whatever else you think will improve the site's user experience.\n\nThis stuff really isn't hard if you design it in from the start. You might find my tutorial from this year's XTech conference useful: http://simonwillison.net/static/2008/xtech/"}, {"author_name": "Tom Armitage", "gravatar_hash": "f6f41097bd9390607fe4f1e7288c72e3", "author_url": "http://infovore.org", "date": "Jun 09, 2008", "message": "No.\n\nWhat Simon said; I mean, I'm sure you've got some lovely interactions that would be much improved with some DHTML or Ajax polish, but frankly, they shouldn't be <i>impossible</i> without Javascript. Progressive enhancement, people. It's <i>really</i> not that hard.\n\nWith reference to the frequent \"lots of other sites do this\" argument - yes, and lots of other sites are <i>also</i> in the wrong. That's not excuse.\n\nI tend to see this argument coming from people who aren't web developers first and foremost, incidentally."}, {"author_name": "Stephen", "gravatar_hash": "e9511207b9f5609946236b08f09988d0", "author_url": null, "date": "Jun 09, 2008", "message": "I can't believe the attitude of the majority of the respondents.  Browsing with javascript turned off is the *sensible* thing to do.\n\nWhy would you make your users do something like turn on javascript on a site with user comments?\n\nI would have thought the people developing stackoverflow would be capable enough developers to be able to build those interactions in REST and then add the interface/js sugar on top."}, {"author_name": "Devon Young", "gravatar_hash": "ad0af0a6bee8912b80e3cf699081ee76", "author_url": "http://devonyoung.com/", "date": "Jun 10, 2008", "message": "Assuming we're not talking about a site on a hosted server that gives one no power for server-side scripting...Why would a website need to require Javascript?"}, {"author_name": "Ian Anderson", "gravatar_hash": "60b1c7dc18e08e1a16f313354814744f", "author_url": "http://thefirstpost.co.uk", "date": "Jun 10, 2008", "message": "I'm amazed at the range of views here. To me it's obvious what you should do, because it's part of best practice web development.\n\n1. Use Javascript as much as you need to to make the user experience slicker, more enjoyable or more productive; WYSIWYG editing, syntax highlighting or side by side preview when editing a post are all good examples of things that will make life better for the users of stackoverflow. \n\n2. Do it using best-practice techniques ie unobtrusive. Make sure the basic form or page will work without JS on, and then run scripts on window.onload to enhance the user experience. This is easy and should not make things take longer. You need to do all validation again on the server anyway for security.\n\nThere should be no need to tell the user JS is off if it's off; most things can just work the normal way.\n\n3. Ensure good basic accessibility: use HTML as intended, paying good attention to structure of headings, lists and paragraph tags; ensure the source order is sensible whether tables or CSS is used for layout; ensure alt text is correct on all images; and use form labels properly. Using JavaScript correctly does not make the site inaccessible to people with disabilities at all; omitting the above things does. \n\nIt's ridiculous to conflate JavaScript and accessibility legislation; JS is a core browser technology and using it does not discriminate against someone on grounds of their disability. Requiring sight or use of a mouse does, by contrast.\n\nI will certainly be using stackoverflow from mobile clients; I work on a laptop on the train two hours a day; because of patchy coverage, a tethered mobile modem doesn't work well and BlackBerry or iPhone give much better access to web resources in that situation.\n\nI can't help feeling that some of the views above are from the last century. JavaScript is a core web technology and worrying about whether or not to use it on a web site is like worrying about whether we should try to avoid breathing nitrogen.\n\nIt's like the couple of comments against Flash - what is better than Flash for serving high-quality video to the largest possible audience? All technologies have their place; it's using them correctly that matters."}, {"author_name": "Benoît", "gravatar_hash": "5e4ca209746d24f245580d5dad625b47", "author_url": null, "date": "Jun 10, 2008", "message": "This is one of the major accessibility concern, to have a website as functionnal if javascript is unabled.\n\n    Many browsers doesn’t support javascript, or have a different support of javascript as you may think :\n    - screen readers (JAWS, Home page reader, Windows-eyes, emacspeak, SpeakThis, HAL, …);\n    - Lynx, a free text-only web browser for blind users with refreshable Braille displays;\n    - Links, a free text-only web browser for visual users with low bandwidth (still alive !).\n\n    Most of these browsers are keybord-way browsed, then javascript action handle can’t be the same, when javascript is supported.\n\nFor information, in my previous company, there were some blind developpers."}, {"author_name": "timvw", "gravatar_hash": "75a7c0b1544fbfcec2b9d310b004e724", "author_url": "http://www.timvw.be", "date": "Jun 10, 2008", "message": "In my experience Javascript is synonym for security threats... Thus no, it is NOT ok that people should turn it on in order to use a website."}, {"author_name": "Rory Fitzpatrick", "gravatar_hash": "4bfd33bbfd773495400c419fd56d42f5", "author_url": "http://www.roryf.co.uk", "date": "Jun 10, 2008", "message": "Absolutely not!\n\nI'll say that again, no!\n\nTo think that everyone who wishes to participate in stackoverflow will have Javascript is insanely naive, I'm surprised you're even asking the question!\n\nThat said, I'm referring to the basics of participation, I might bend the rules a bit for 'advanced' features, as long as users without them aren't missing out on anything really good, maybe just some handy hints. Of course thats as long as you really do make use of progressive enhancement and populate the DOM after the page load, not fill it with Javascript-only HTML!\n\nI can however completely understand why you ask this question, doing Javascript right is incredibly difficult. However consider the aspect that stackoverflow could be seen as a source of ultimate wisdom, and hey, if they require Javascript why shouldn't I!?! Do it right and you can point people to it and say \"thats how it should be done!\"."}, {"author_name": "Thejesh GN", "gravatar_hash": "4545b2a84b0ae407abc97ad8f23cc28b", "author_url": "http://thejeshgn.com", "date": "Jun 10, 2008", "message": "Absolutely OK"}, {"author_name": "Olly", "gravatar_hash": "4c8b846c258abe7fb7b673f2cae2ac75", "author_url": "http://thinkdrastic.net/", "date": "Jun 10, 2008", "message": "I'd say no. It's OK to require javascript for the advanced stuff (e.g. WYSIWYGs etc), but simple plaintext answer/edit functionality should be available to all, regardless of javascript."}, {"author_name": "Huppie", "gravatar_hash": "34d96bbc3fd8768f39b414f28d52ce87", "author_url": null, "date": "Jun 10, 2008", "message": "JS should be used to improve the usability as much as possible, but is should be possible to allow basic functionality without it, that is reading and replying or maybe even asking questions.\n\nFor me, personally most of my spare time is in the train, the place where I take out my phone and start browsing.\n\nAs for all the pros and cons I found I think Ian and Ben are spot-on. JS should be used, even extensively but it *should* be very possible to do without it (my favorite example: GMail)."}, {"author_name": "dimitris mistriotis", "gravatar_hash": "c037272be54de6d9d2ed46bf3be9f7be", "author_url": "http://mistriotis.gr", "date": "Jun 10, 2008", "message": "Javascript should be used, since even people with javascript disabled should be able to trust you (eg. NoScript). Having many features available without it is a very clever idea..."}, {"author_name": "Dominic", "gravatar_hash": "ad1b808fb2b2a784b9e93eb24c3060b0", "author_url": null, "date": "Jun 10, 2008", "message": "The question should probably be, \"Who has javascript disabled?\""}, {"author_name": "Arkh", "gravatar_hash": "77d3121cac03bbeb781ac77edcf29d58", "author_url": "http://www.i-tac.fr", "date": "Jun 10, 2008", "message": "No. JS should be required only for fancy effects, all the interaction you want should be accessible without javascript.\nJust use javascript as an experience enhancer."}, {"author_name": "Jon Cage", "gravatar_hash": "418a18dde0d9cb4cc434bd38a329190c", "author_url": "http://www.hyperlight.co.uk", "date": "Jun 10, 2008", "message": "I agree 100% with Huppie, Arkh etc. etc.\n\nYou should never require anything more than the most basic browser to interact with a site. It doesn't have to be pretty, but it should at least be possible. Think about mobile phones etc. which often  _don't_ have javascript.."}, {"author_name": "Matt Newman", "gravatar_hash": "af47099362d9d8f0a78fb8b49e8fcdfc", "author_url": "http://www.bestsnowman.net", "date": "Jun 10, 2008", "message": "I'd say yes, some of the stuff I have to work on targets as low as Netscape 4!\n\nI think it is safe to assume that your target audience is going to be using a modern browser and capable (IE7+, FF2+, or Opera) though I think there should be a mobile version too so I can interact from the road with my smartphone."}, {"author_name": "[ICR]", "gravatar_hash": "48a02e16370caadaedff78e2a94656ce", "author_url": "http://www.morethannothing.co.uk", "date": "Jun 10, 2008", "message": "I would echo the above posts saying that it should all be perfectly functional without javascript, but utilising javascript to to enhance functionality where possible. I won't repeat the justification, people have already said it better than I can.\n\nAnother point I would raise though is that this should be an example of the right way to do things. I find it shocking the number of similar sites that are full of bad practices that, should these sorts of questions be asked on them, the correct response would be \"Don't do it like this site does!\". Do as I say not as I do."}, {"author_name": "Erlend", "gravatar_hash": "eb8586a3baf3710dc1f38c8d21f0367d", "author_url": null, "date": "Jun 10, 2008", "message": "I think it really should be possible to “edit, answer or ask a question” without resorting to javascript.\n\nThat being said, I'm all for _enhancing_ the functionality of these fundamental operations using scripting. \n\nBut if you think you need js for these basic things, you're probably wrong and overdoing it."}, {"author_name": "Jim", "gravatar_hash": "a7eb6d9e84ea1a901f245f568c4e62c2", "author_url": null, "date": "Jun 10, 2008", "message": "I just got my first phone with a web browser.  It works great, but it does not support javascript.  Many sites use javascript for navigation, which just doesn't work.  That being said, in my regular web browser I like the additional functionality that javascript can provide.\n\nWould it be possible to just be able to configure themes?  E.g. a mobile theme that is enhanced for small screens without javascript, a \"basic\" theme that is light weight and without javascript, and a \"full\" theme that has all of the bells and whistles?"}, {"author_name": "Chris", "gravatar_hash": "c125f576c3a08c0c1d4330bc565ae28c", "author_url": null, "date": "Jun 10, 2008", "message": "In 1999, I would have said no. But now I'd have to say yes in any case, for developer or joe-computer-user. With Ajax and other common place Javascript uses that hugely improve site usability, there are few good reasons why someone would disable Javascript. The only remotely plausible reason I could think of are users with special needs, that use special software like a screen reader. But even then, you might still be able to use JS."}, {"author_name": "Matthew Morgan", "gravatar_hash": "fbd3e5cc0b7dd5648f43d49719d2f4a8", "author_url": null, "date": "Jun 10, 2008", "message": "I don't think it the least bit unreasonable to require JavaScript to be able to post on the site.  As many have said, I expect developers to be able to conform to such a small requirement.  Any developer who uses NoScript or some other quick JavaScript disabling tool would definitely be used to toggling for sites like this.\n\nI think it's sort of like browser compatibility.  This is 2008; am I going to go out of my way to make my site compatible with IE 5?  No.  I think JavaScript is the same way.  Anyone who just turns it off in their browser permanently is probably used to not being able to do anything on the web."}, {"author_name": "Josh", "gravatar_hash": "4a3644f49db41a7d7f42b4c679e7864c", "author_url": "http://insidethemachine.wordpress.com/", "date": "Jun 10, 2008", "message": "I wanted to say it's ok to require JavaScript, but after reading some of the comments, I'd say it's important to provide some sort of alternative for users who don't want to have JS enabled."}, {"author_name": "Roland Tepp", "gravatar_hash": "0f83be58c6c968f558b2cfda93183f28", "author_url": null, "date": "Jun 10, 2008", "message": "I'd say (and this has probably been pointed out somewhere within those 120 comments above) that just as long as you are enabling those js-only goodies with javascript and design the rest of the experience in such a way that lacking js support everything still functions (sans bells'n'whistles), it should not be any problem.\n\nWhat I'd hate (and I guess, most of the dev community) would be that if some functionality of the site.\n\nAn example: When using the WMD editor - lacking js support, just have plain old textarea with \"preview\" button instead of that fancy side-by-side online preview and simple formatting syntax help on the side...\n\nSo when someone comes with their js tuned off, you are not banning them from participating...\n\nIf there are features that are so dynamic that they don't degrade well, do not make them a requirement for active participation"}, {"author_name": "Andy", "gravatar_hash": "78a1712271a5c6a88fb849ce25ac039b", "author_url": null, "date": "Jun 10, 2008", "message": "The site should definately gracefully degrade to a usable state for all the functionalities of the site, even for people with JavaScript disabled. It's of my personal experience that powerusers (as programmers certainly are) are more security-aware and has a higher tendancy to disable JavaScript on their browser(s)."}, {"author_name": "JRWoodward", "gravatar_hash": "aeafc9bfc53d8022061cb85374ff9783", "author_url": null, "date": "Jun 10, 2008", "message": "Go with JavaScript. Follow good coding practices, stay away from  the annoying stuff and avoid any of the security holes that are starting to show up. This is a developer's site; you don't have to treat the users as children. Handholding and babysitting not required."}, {"author_name": "shawn", "gravatar_hash": "f878a55e08bacee0af48852c29a02dc7", "author_url": null, "date": "Jun 10, 2008", "message": "If I HAD to use Javas (although I doubt it's necessary for a simple FORM post), I would also provide a mailing address / p.o. box where people can send their code submissions, answers, etc."}, {"author_name": "ramon", "gravatar_hash": "4105406c953d71d4b9556cbca89a4bf7", "author_url": "http://www.emotionalmarkup.com", "date": "Jun 10, 2008", "message": "i'm tending to be more radical these days and, for personal projects, refuse to code for ie6 anymore so hell yeah, it's 2008 and in some instances javascript should be declared a required technology. try using google maps without js!\n\nhowever, many people have said it before, and it is true: go with what your audience needs or expects. if you have important content or functionality that can only be accessed through js, at least explain why and what people should do to jump on the jboat."}, {"author_name": "mario64", "gravatar_hash": "48d473c292421ad0d93ac7a2712a5fda", "author_url": "http://del.icio.us/mario64", "date": "Jun 10, 2008", "message": "almost every site these days require javascript to be enabled, i dont think it will be a problem. So yeah."}, {"author_name": "Telcontar", "gravatar_hash": "2e4370b1aedee8c3fbaacfcb7519f16e", "author_url": null, "date": "Jun 10, 2008", "message": "Yes, it's fine to require Javascript in a developer oriented web site"}, {"author_name": "Tim LS", "gravatar_hash": "59527fa76c2b1cd0fc3ac48ff2e781fb", "author_url": null, "date": "Jun 10, 2008", "message": "I used to disable javascript. Then I used noscript. Now I just wave my hands in despair.\n\nI would LIKE to not need javascript to view a website (especially one I haven't been to before). And to participate. But I'll probably enable javascript for your site one way or another."}, {"author_name": "HokeyWhiteBoy", "gravatar_hash": "13658c0469cb17226e09904a4a419bfc", "author_url": null, "date": "Jun 10, 2008", "message": "Anyone that turns off ECMAScript (yes, that is JavaScript's real name peeps) is just being obtuse.\n\nGo for it!"}, {"author_name": "Juan Manuel Formoso", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Jun 10, 2008", "message": "&gt; What say you? Is it OK for a website in 2008 to require JavaScript for active (not passive) participation?\n\nYes"}, {"author_name": "Joshua Tallent", "gravatar_hash": "c95fa2dc6c5bc4b492163a4915fe1d0b", "author_url": "http://fourquestions.us/blog", "date": "Jun 10, 2008", "message": "Yes, I think it is acceptable."}, {"author_name": "Andy", "gravatar_hash": "bf213f4a03ba609494840fad2b91ff75", "author_url": null, "date": "Jun 10, 2008", "message": "For any site that requires active participation from a large number of users I believe it is only fair to have the users browser do some of the work.  This benefits everyone.  So yes it is acceptable.\n\nAnd since this is a developer oriented site I would imagine most developers have JavaScript enabled and a modern browser.  So yes it is acceptable."}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jun 10, 2008", "message": "What does being a developer have to do with having Javascript enabled?\n\nAs a C++ developer, I don't find that Javascript has anything to do with my work."}, {"author_name": "Ahmad Alfy", "gravatar_hash": "981b46396a22bf5a8190506fe892b3b5", "author_url": "http://www.alfystudio.com", "date": "Jun 10, 2008", "message": "Well, Thats a tricky question ...\n\nIt depends on what you are going to present with Javascript... \n\nIf you wanna ignore the screen readers, the disabled users or the stuff like the pocket pcs ... etc its ok but you can't forget about SEO!\n\nYou can't depend on Javascript 100% for contents.\nYou can't depend on Javascript 100% for navigation.\n\nhowever you can depend on it when it comes to photo galleries, to applications' functions , to shopping carts.\n\nBy 100% I mean you don't provide an alternative!!"}, {"author_name": "James Coulter", "gravatar_hash": "cbcd4473447deeb8e31284cc2fd6df26", "author_url": null, "date": "Jun 10, 2008", "message": "I also say yes. If the user is interested enough to want to ask a question or reply to a question, I think the requirement to have JavaScript enabled will be of no consequence whatsoever."}, {"author_name": "bandi", "gravatar_hash": "c24cac5a996f6b1b3222ff46b7415609", "author_url": null, "date": "Jun 10, 2008", "message": "I tried to read all of the comments, and I was shocked. Developers have javascript enabled? This is far from being true. I'm using noscript as well and do prefer not enabling it for every site. It's more secure and less obtrusive.\n\nAnd graceful degradation is obsolote, folks. Progressive enhancement is the way to go, Jeff. Apart from this, I agree with Jamie. You build the application with all the functionality, without javascript. Then you add the nifty effects, animation, AJAX, etc. With a well written application there should be no problem going from no javascript to ajax.\n\nAnd also read Ben Curtis' points, because you just can't dismiss them.\n\nTo sum it up, I do not agree with javascript-only core features."}, {"author_name": "Jon Davis", "gravatar_hash": "cf6deba897062e74251c43a6b6a1903f", "author_url": "http://www.jondavis.net/", "date": "Jun 10, 2008", "message": "I think this discussion is rediculous. The web by nature is NOT HTML. It is a mix of HTML, graphics, Javascript, and then some. If you're being hard-nosed about supporting browsers that don't have script enabled, you might as well support no graphics, and for that matter your primary QA browser should be Lynx.\n\nIt's 2008 for goodness sake, not 1998."}, {"author_name": "Steven Roussey", "gravatar_hash": "0d2c43d3421437dc710e39729c58fa3e", "author_url": null, "date": "Jun 10, 2008", "message": "I think participation type sites ought to require JS for participation or other user actions. But not JS should be required to read a site. The next question then is: if you require JS for participation, do you require JS for logging in? As this could affect the reading role as well..."}, {"author_name": "Steven Clark", "gravatar_hash": "b6bd7aab1af810bfe5716c03258093da", "author_url": "http://stevenclark.com.au", "date": "Jun 10, 2008", "message": "I don't see why so many people have such a problem with the best practice of progressive enhancement and graceful degradation? With building quality software.\n\nThe right tool for the right job, as they say.\n\nYou can jump in with as much JS rubbish as you feel inclined but when it comes to ROI and making money I think casting a wider net, making a more accessible, usable and robust interface that works on as many browsers and platforms as possible makes a little more business sense than locking someone out ( a potential client / sale) simply because you feel a certain technology is \"swish\". We are in the business of making money at this right? More audience = more customers in door = potential conversion. Thus locking out as many as 10% of users = how many potential less people in the door? Do the math.\n\nThere are exceptions, of course. And that is if you're going to make an application that is so way and beyond what could be built at this time correctly that you just have to do it the \"bad way\" or not at all. In that case I'd say go for it. But your's doesn't sound that ground breaking.\n\nFrom a business perspective - code it all up to work fine in PHP outputting high quality HTML and CSS and then get in and enhance things with JS. Minding, of course, basic usability and accessibility issues along the way. Because in the end its not about \"swish\" its about \"cash\". Its about bums on seats and eyeballs and market share and making money.\n\nIf you don't ever get usability and accessibility for legal or ethical reasons - get it for the cash reason. Progressive enhancement is a small methodology mind shift to improve your likelihood of getting ROI on the project. Just my 2 cents.\n\nIn short, the right tool for the right job and use it wisely."}, {"author_name": "SCdF", "gravatar_hash": "d23c43fed180ee2eebef1c3efd75965d", "author_url": null, "date": "Jun 10, 2008", "message": "I agree with Ant (the guy commenting up the page, not the build script utility); the only people who care about if Javascript is required are just the people you wish to attract.\n\nAnd the paranoid of course. But they only do it because they're out to get you."}, {"author_name": "Mike", "gravatar_hash": "bb1282f46edbe30969777d0163598b24", "author_url": null, "date": "Jun 10, 2008", "message": "Are you sure Javascript is needed?\n\nRequiring Javascript to participate is O.K. as long as it doesn't affect keyboard users and tabbed browsing and is accessible.\n\nIf I can't select a link with the keyboard and open it in a new background tab or if I can't use a menu with the keyboard, I will not be happy.\n\nI also expect the Javascript to have perfect or near perfect cross-browser support.\n\nAlso, if you only support current versions of browser x and deny older versions, make sure that the script always assumes that newer versions of the browser (alpha, beta, trunk, RCs etc.) are supported. I hate it when scripts support the current stable version of a browser, but block development versions etc.\n\nI use Opera 9.5 and sometimes FF3 and Safari Win32 with the latest webkit. I expect any script to work in those."}, {"author_name": "Jamie", "gravatar_hash": "238f20fd3cc931f829dc82297a37fa2c", "author_url": null, "date": "Jun 10, 2008", "message": "I'm all for it for active participation."}, {"author_name": "n3rd", "gravatar_hash": "6101c2d2651d1cd9e8d65d065b1db9c1", "author_url": null, "date": "Jun 11, 2008", "message": "JavaScript is just fine, as long as all basic features work without it (such as navigation, you can do amazing stuff with CSS only). Just make sure you tell people who visit the side with JS deactivated what they are missing out on. There's nothing more annoying than visiting a website where nothing works whatsoever until you figure out that it's not on your NoScript whitelist..."}, {"author_name": "Asbjørn Ulsberg", "gravatar_hash": "086e5b232508e13d262ed6c98b949402", "author_url": "http://asbjor.nu/", "date": "Jun 11, 2008", "message": "Considering how easy it is to not require JavaScript with unobtrusive techniques enabled with libraries as jQuery, I really can't understand why JavaScript should be required. You have to write the server-side functionality anyhoo, so why don't you just expose it through plain old HTML as well as fancy (but less accessible) JSON or XML interfaces?"}, {"author_name": "Chris Rueber", "gravatar_hash": "c7dc0fea61a9a88d7ebf75a42cc2d62e", "author_url": null, "date": "Jun 11, 2008", "message": "It's 2008. The audience is developers. If it were ten years ago, no, certainly not. But pretty much all the major websites out there these days require JavaScript for some of their more advanced functions to work. There's no reason you shouldn't require it to access an \"all functionality\" version of the site. \n\nThat said,, I think it's also important to offer a more \"plain text, accessible\" version of the site as well. They don't necessarily need to be connected. Consider gmail's primary layout, and then their HTML based layout. They're basically separate sites, but they both work \"about\" the same, with a few features removed for the strictly HTML version."}, {"author_name": "Brendon", "gravatar_hash": "225be77d47a9725676d15af430e60f7e", "author_url": null, "date": "Jun 11, 2008", "message": "As long as it doesn't grind my computer to a halt, as so many other javascript sites do, I'm OK with it."}, {"author_name": "Brendon", "gravatar_hash": "225be77d47a9725676d15af430e60f7e", "author_url": null, "date": "Jun 11, 2008", "message": "I just read that someone said they'd firebomb your house if you used Flash or Silverlight - make that two."}, {"author_name": "Justin", "gravatar_hash": "10802a47ef74d23f7ce58cf4754fe994", "author_url": null, "date": "Jun 11, 2008", "message": "For a minute I thought you mean that readers would have to know JavaScript to be able to post.  That would be seriously whack.\n\nOf course, reading comprehension helps."}, {"author_name": "Pablo Cabrera", "gravatar_hash": "fddca7bd0ffafc07cf8dc2e533749335", "author_url": null, "date": "Jun 11, 2008", "message": "I think its Ok...\nWho doesn't have a JS enabled browser on a desktop computer?"}, {"author_name": "[ICR]", "gravatar_hash": "48a02e16370caadaedff78e2a94656ce", "author_url": "http://www.morethannothing.co.uk", "date": "Jun 12, 2008", "message": "To those asking who has javascript turned off - about 5% of the general web in the past 2 years and a much higher percentage amongst developers.\n\nI would be interested in the number of readers both Jeff and Joel have that have javascript disabled. You could add some basic logging by using javascript to insert an image into the page and comparing the number of hits for the pages against the number of hits for the image (though there's probably a better way)."}, {"author_name": "Stephen", "gravatar_hash": "3454ee98fcec27e45888f291d90539da", "author_url": null, "date": "Jun 12, 2008", "message": "I guess in the real world, you should get some statistics in possible, to see what your general audience is for the client..\n\nBut I know in the past, we're made some administration consoles that required javascript for field validation, the server side backed it up of course, but for lack of better though and timelines, we didn't implement friendly notices on the server, just exceptions..\n\nSo in the event a client without js, or a js error occurred for various reasons that it can.. the validation would fall over, and the user would get nice big 'ysods'..\n\nThey called us up asking and we essentially had to find a nice way of saying we designed this for more modern systems, as it turns out- they were using some very old Macs.. they actually took it quite well.. but well in that parental \"we're not angry, just disappointed\" way.. and from then on we we're really scared of doing anything that was reliant on JS..\n\nIt actually had a big stigma for us, because we didn't even take up doing unobtrusive JS patterns.. we just aborted on JS altogether.. it wasn't until the last year or so, that \"web2.0\" was somewhat expected, and we started getting more pressure to introduce JS again.. so we're started to do unobtrusive implementations, or what we call 'experience accelerators', as in- GOT JS? GOOD FOR YOU, ENJOY A BETTER EXPERIENCE YO!\n\nHowever, the more we think through some concepts of ajax, the more we somewhat talk ourselves out of doing it even unobtrusively.. pagination for example, we really believe in urls being exchangable.. that you could pass a URL to someone, and they see what you see.. vs. passing someone a URL, and them having to page through data..\n\nOf course, theres a few hacks using anchors (fragments if you want), to give alternative references to the page number.. but it generally makes things more messy..\n\nWe then start to question the benefits of the pagination, given we usually have caching strategy, and well designed pagination / rendering of html, so that modern browsers page through standard html pages at 'ajax speed'..\n\nTo me, ajax can be severely overused.. its seen as a feature, vs a tool to accomplish something.. \n\n(function() {\n  flameSuit.Activate();\n});"}, {"author_name": "Remy Sharp", "gravatar_hash": "c8b387c489181844b3ffc704fadc0f14", "author_url": "http://remysharp.com", "date": "Jun 12, 2008", "message": "I say no. Your site should not require JavaScript. We've been building web sites that didn't require JavaScript for years, so we know how to do it.  \n\nWe should be enhancing the experience with JS, not replacing it.\n\njQuery is a great library for progressive enhancement, but equally this can be achieved with any other library, or even...without a library!\n\nIMHO I'm actually attracted to the extra challenge that progressive enhancement forces on me: 'How do I make this work by default, then how do I make this ooze cool'"}, {"author_name": "Pete", "gravatar_hash": "d5a15a6528130cd78f35d71c34a9c6e0", "author_url": null, "date": "Jun 12, 2008", "message": "In case someone hasn't said this re JavaScript off I am generally in favour but one issue is mobile phones, screen readers, and other types of devices and browsers.  I think you should have JS on but the ultimate is providing a cut down which works with both.\n\nPete"}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": "http://www.titlech.net", "date": "Jun 12, 2008", "message": "Yes"}, {"author_name": "Andy", "gravatar_hash": "3fc1453ca868db872c53a3aa5d5657a1", "author_url": null, "date": "Jun 12, 2008", "message": "Javascript should NOT be required.\n\nAnd in my opinion, the reason for this, is people who do NOT know how to develop correctly, and cause laggy websites, or wrong behavior on websites, make people turn javascript off on their browsers.\n\nI see everywhere, websites from mayor companies, that just crawl because javascript was implemented wrongly."}, {"author_name": "Jacob", "gravatar_hash": "6c2a0925102c3f86f45832a76beea5ad", "author_url": "http://blog.fragdev.com", "date": "Jun 14, 2008", "message": "No no no - if only for security reasons!\n\nI'm suprised by how many developers seem to think that this is okay; this might be an area where our community needs some education.\n\nBrowsing with Javascript disabled is one of the few surefire ways to ensure you have a pretty safe browsing experience. After all, cross-site scripting (used to steal passwords, install malware, and most other bad things visiting web sites can cause) are only possible if you have javascript support.\n\nI'm afraid that if Javascript is required for StackOverflow, then you'll lose a lot of security-oriented users (myself included). It would be a shame: I enjoy the podcasts so much, and I'm really looking forward to the service itself."}, {"author_name": "Craig", "gravatar_hash": "0f646e0ae274f9795ce8e95c120bddf8", "author_url": null, "date": "Jun 17, 2008", "message": "Anyone seriously browses with javascript disabled is either browsing pretty shady sites to being with and/or is a consipiracy theorist who wears an aluminum foil hats, thinks we didn't really land on the moon, and unplugs their cable modem at night."}, {"author_name": "Peter Bartholdsson", "gravatar_hash": "b1b5f1963a5f85c1a2b9395a01580d76", "author_url": null, "date": "Jun 18, 2008", "message": "I'd really prefer if JavaScript was not required. I used to think it was unreasonable to disable JavaScript but as I'm a mmorpg player I've almost been hacked several times already the last half year and I now do all my browsing with JavaScript and Flash off. What used to be paranoia has turned into something quite reasonable.\n\nI've always stayed up to date with updates but several 0-day exploits have been used against sites I visit on a regular basis, which are in no way shady, just regular communities just like stackoverflow will be.\nFor example this last month alone I've seen attacks through a website using mediawiki, one using phpbb3, one using flash ads from a major ad company scanning all ads for virii, plus some iframe stuff and sql injection on smaller sites.\n\nWhile I do enable one or both on a site by site basis it's still a step to do it. I simply don't trust most websites anymore."}, {"author_name": "Jake McGraw", "gravatar_hash": "769b1f309a41e2893654c81496b9f8b4", "author_url": "http://jakemcgraw.com", "date": "Jun 18, 2008", "message": "I've always found it to be dead simple to develop a site which makes use JavaScript without requiring it, simply do the following:\n\n1. Build your app without JavaScript.\n2. Add JavaScript as needed to provide useful, but optional, features.\n\nI think this actually follows the whole development methodology that you and others have been preaching for so long: Create a thorough solution in each domain of a web application before moving onto the next.\n\nI prefer the following order when developing an app:\n\n1. Database design, implementation\n2. Business logic stubs\n3. HTML Template for rudimentary UI.\n4. Implement business logic\n5. CSS for advanced UI\n6. JavaScript where appropriate\n\nThis methodology gets a bit mixed up when developing AJAX applications, but then I don't see a reason for stackoverflow to use AJAX."}, {"author_name": "Serkan Karaarslan", "gravatar_hash": "8c3cd4457925445fb38fd3c041af1fa9", "author_url": "http://skaraarslan.blogspot.com", "date": "Jun 19, 2008", "message": "At the client side, there are three layers, HTML, CSS and JavaScript. You can build a website without CSS and JavaScript. But Css is required to good looking web site. And also javaScript is required for interaction between user and web site. Apart from interaction, for example, the datagrid has 50 rows on each page. When user can delete or update one row, it's better to use javascript to invoke asyncrone call, instead of rendering all page. It's for performance and save timing. \n\nAs a result, i support to use JavaScript. And also JQuery is the best choice among other famous javascript library."}, {"author_name": "Brooks Moses", "gravatar_hash": "361baa67583dc1033f2f3b3c97761c2c", "author_url": "http://notes.dpdx.net", "date": "Jun 23, 2008", "message": "Here's a (potential) problem with using Javascript for commenting that you might not have thought of.\n\nI use LiveJournal a lot.  It's got two types of setups for commenting on a person's journal, depending on the person's journal style and some other things.  One of them uses Javascript to open up a comment box in the page in exactly the right place; the other is Javascript-free and has a fixed comment box.\n\nOccasionally, when submitting a comment, there's a server-side error and it doesn't go through, and so I have to hit the \"back\" button and try again.  On the Javascript-free version of the comment page, the text box is a static element on the page, and my browser remembers its contents and restores them -- so I haven't lost my comment.  On the version with Javascript, the existence of the text box is part of the page's Javascript state, and so it doesn't get restored -- which can be a real annoyance when I've spent quite a while writing the comment!\n\n(It's possible that I'm misdiagnosing the source of the problem, and that the code that executes when the \"submit\" button is clicked does something to wipe the comment from view as part of its execution.  Absolutely, positively, _don't do that_!  Please!)"}, {"author_name": "Babak", "gravatar_hash": "364a1a43be2bf8a69324c66becad17f7", "author_url": "http://www.scilife.net", "date": "Jun 25, 2008", "message": "When we started developing http://www.scilife.net we had the same question in mind: to what degree do we require our visitors to have JS on. After long debates we decided to opt for progressive enhancement: using jQuery, basic HTML structures like drop down boxes are replaced e.g. with typeahed boxes. Form are send by Ajax instead of a page reload, and so on.\n\nWe think if you set up your website like this, you will \na) have a website that works for those people that have no JS capabilities\nb) wont spend more time than starting out with pure JS solution\n\nthere is however a catch here: if things become more complicated, like if you have two selection boxes where the content of the second one depends on the selection of the first, you will have to spend more money/time in developing a good and solid non-JS variant, not only on the client side, but also on the server. Thus, you have to choose between making the non-JS version user-friendly or live with the fact, that it will work w/o JS, but maybe not as nice as it could be.\n\nThus, for more complex situations you will have to spend more money and time to create comfortable non-JS solutions. But I really see no reason why you would want to require JS for such a simple case like submitting a form, to which it boils down if you talk about “edit, answer or ask a question”.\n\nTo summarize: Progressive Enhancement is cheap and easy for 95% cases when talking about webpages (not web-applications). Those who tell you to require JS simply don't know how simple it is to enhance webpages progessively. We didn't ;-)"}, {"author_name": "Eric Ferraiuolo", "gravatar_hash": "cf33841918d90fe941f522dde5ee4ff0", "author_url": "http://eric.ferraiuolo.name", "date": "Jun 30, 2008", "message": "I would say the answer to this question is YES and NO.\n\n* A Web SITE - NO, should work without JavaScript all interactions.\n\n* A Web APP - YES, it's safe to assume JavaScript and require it."}, {"author_name": "analytik", "gravatar_hash": "3298a30d5c328221b7a98ce711f984b1", "author_url": "http://blog.nopdesign.sk/en", "date": "Aug 15, 2008", "message": "People need to get over no-JS mentality. People should stop using old browsers. People need to learn they can't expect their 5-year-old computer to handle everything, just because their fridge still works after that period. We need to push them gently forward.\n\nWeb is not about [plain] HTML anymore. Applications require functionality, and HTML4 isn't meant or able to provide it by itself.\n\nI don't say we need to use JS everywhere without consideration.\n\nProgressive Enhancement &gt; Graceful Degradation."}, {"author_name": "Vadim", "gravatar_hash": "db0ffcda818361fc9ca083193cd2157c", "author_url": null, "date": "Aug 15, 2008", "message": "Do we still ask such question in 2008? \n\nHow about \"Should we have backward support for users of Mosaic browser?\"\n\nOr maybe question should be \"Is it ok to require HTML?\" (There may still be Gopher users out there.)\n\nPush ahead. Innovate. Create good experience for users.\n\nIf users of Lynx browser complain, then tough luck."}, {"author_name": "Isaque Alves", "gravatar_hash": "02421d1103c3f1f42ab62b4fa40dec81", "author_url": null, "date": "Nov 28, 2008", "message": "That's the question, and it stays the same along these moment since the post has been published.\n\nI think, particularly, JS features are only 'optional enhancements' for a well-designed website. The secret is to maintain some of the 'state-of-art' possibilities off, in onrder to satisfy all the users of the system. Other option is to offer different versions of the same content, with JS active, and all the power of AJAX, and other without the last javascript resources...\nRequire javascript means, sometimes, exclude a great number of users, mainly that don't know or don't want to learn how to control their browsers, change configuration options, etc. and the people that suffer with some disability, needing more atemption of us...\nWebdevelopers should mainly think in create, develop, accessible applications."}, {"author_name": "nirenjan", "gravatar_hash": "1fd6ac38648ba020f573a35e02cba33f", "author_url": "http://www.itemplatez.com", "date": "Jul 16, 2009", "message": "Thanks for the sharing this website. it is very useful professional knowledge. Great idea you know about company background.\n<a href=\"http://www.itemplatez.com\" rel=\"nofollow\">web application development</a>"}, {"author_name": "jay", "gravatar_hash": "91c20e440e66d113b06549efb679afea", "author_url": "http://www.basicwebdesign.co.cc", "date": "Apr 27, 2010", "message": "Hello, do you mind if I use some of your content on http://www.basicwebdesign.co.cc ? The credit stays with you along with a link back to your site! Thanks"}, {"author_name": "Mike", "gravatar_hash": "902814b9036bb1ea3e9574fe1f9619c2", "author_url": "http://www.siforia.com", "date": "Nov 07, 2011", "message": "I only use JavaScript to enhance the web experience. Any functionality on a page should still be possible with JavaScript disabled. For example, the comment system on my sites - http://www.siforia.com - was recently enhanced to take advantage of JavaScript, but I made sure that posting comments will still work even if JavaScript is disabled."}, {"author_name": "free logo design", "gravatar_hash": "fa93fd95ccef03afc4ab065b737c86a6", "author_url": "http://logo32.com", "date": "Jun 01, 2012", "message": "I think JavaScript should be active as long as web experience is concerned. It is substantially required for participation."}]}