{"response": [{"author_name": "Bob", "gravatar_hash": "27fba155783c49daee591d39ebcc4f31", "author_url": null, "date": "Jun 30, 2008", "message": "iTunes allows faster playback as well, as do most iPods."}, {"author_name": "steve", "gravatar_hash": "3bb156e0e0a6e8d488551c2b2c819edc", "author_url": null, "date": "Jun 30, 2008", "message": "-bob:\n\nIt does? Maybe I'm just a dummy, but I've been able to find the \"fast playback\" option for audiobooks only. If there is a setting for fast podcast playback in the ipod or itunes, it's impossible to find.\n\nAs for windows media player, Ctrl-Shift-G is my favorite feature. (:\n\n-steve"}, {"author_name": "Andrew", "gravatar_hash": "3e2561bc9352ec0d070426a00229e2ef", "author_url": null, "date": "Jun 30, 2008", "message": "Sorry that this doesn't exactly contribute positively, but try listening to the podcast using SLOW playback for a good laugh.\n\nJoel's gonna have a helluva hangover, and Jeff's gonna have some fierce munchies.\n\n:)"}, {"author_name": "Hans", "gravatar_hash": "84bd29ff48f48793a99cd0c4069d44c9", "author_url": null, "date": "Jun 30, 2008", "message": "With mplayer (linux etc.) you can use \"-speed 1.5 -af scaletempo=speed=tempo\" (substitute 1.5 with the speedup-rate you prefer)"}, {"author_name": "Ryan Mulligan", "gravatar_hash": "ab7c8cd9bfc94ab2eae4a39e229a712e", "author_url": "http://www.ryantm.com", "date": "Jun 30, 2008", "message": "The only Linux player I've found to support fast playback is alsaplayer. It doesn't do a great job of de-chipmunking though."}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "Jun 30, 2008", "message": "i'm just gonna throw this out there, but how can i get it to play you like chipmunks? i think this will help with joke delivery as well."}, {"author_name": "Fábio Gomes", "gravatar_hash": "5c951404673ae426a82c0b0e1f385d34", "author_url": "http://yacoding.blogspot.com", "date": "Jun 30, 2008", "message": "I wish my cell phone had this feature :(.\n\nI don't know how you guys can listen to podcasts on the computer, there are too many distractions for me, I can't pay attention."}, {"author_name": "Mariano M. Chouza", "gravatar_hash": "5277207dadc9ce68a228f38bf8d5f6a7", "author_url": "http://spin-foam.blogspot.com", "date": "Jun 30, 2008", "message": "&gt; I’m not sure exactly how it works, but this speeds up &gt; the playback without turning us into chipmunks.\n\nThe process of time stretching an audio clip without \"chipmunking\" is fairly interesting. Some variants are described at\n\nhttp://en.wikipedia.org/wiki/Audio_timescale-pitch_modification"}, {"author_name": "Rob Burke", "gravatar_hash": "429329df3c7c21e2a9f156a808c1fab0", "author_url": null, "date": "Jun 30, 2008", "message": "I don't know about you guys but the hour-long show suits my crosstrainer session in the gym absolutely perfectly - keep it up! Now if only you could produce 4 shows a week so I had one for every session?\n\nStarting to get pretty excited about the private beta guys!"}, {"author_name": "Doeke Zanstra", "gravatar_hash": "b83de2466ffbd28e6493ee2fcd796978", "author_url": "http://zanstra.com/base/blog", "date": "Jun 30, 2008", "message": "I have used a program called \"the amazing slowdowner\"   (it's still around) to learn new songs. But I realize iTunes needs this functionality too. It's not available now (maybe for audio books).\n\nIt also would come in handy for the transcribing the podcast. Those two guys make it a though job transcribing the postcast ;-)\n\n(And iTunes too; with a one hour podcast, the smallest rewind one can do is something like 20 seconds)\n\n[disclaimer: I'm a Mac fan, but also a Windows user. I'm just being critical]"}, {"author_name": "david", "gravatar_hash": "ef079515af1c9963c7cd33e0b4f00e88", "author_url": "http://dlinsin.blogspot.com", "date": "Jun 30, 2008", "message": "Anybody know how to speed up the stackoverflow podcast on an ipod nano? Or how about encoding it 25% faster and provide 2 downloads?"}, {"author_name": "Guy Ellis", "gravatar_hash": "d9f2c02c23a3013166710a1d24bca056", "author_url": "http://guyellisrocks.com", "date": "Jun 30, 2008", "message": "Some mp3 players don't have that feature. How about providing 2 downloads for us? i.e. one fast and one normal..."}, {"author_name": "Brad Barker", "gravatar_hash": "f1bf5b6fbe43b29d5646f90b9eb06a0f", "author_url": null, "date": "Jun 30, 2008", "message": "Jeff you already talk like you've had too much coffee. I don't want to hear it faster!!!"}, {"author_name": "Pete Muller", "gravatar_hash": "bf71e50850ad70806975bdd381fb3f6c", "author_url": "http://oc-gamer.moobaa.com/blog/", "date": "Jun 30, 2008", "message": "I use Rockbox on my iPod 5G, and it's got wonderful pitch control that allows faster or slower playback, as appropriate. Some podcasts I can listen to at 160%, others only 125%. The native iPod's \"Faster\" option is restrictively coarse, by comparison."}, {"author_name": "Jeff Borisch", "gravatar_hash": "a9f8dda093c269db1a7b3326e4e7c8c1", "author_url": null, "date": "Jun 30, 2008", "message": "@Pete hmmm rockbox sounds neat.  \n\nI have an AppleScript that I can run on several files at a time in iTunes. It reencodes the podcasts at almost double speed. Then it adds the new track to a playlist that gets synced to my devices.\n\nIt has a sox command at its core. Something of the sort...\n\n/usr/local/bin/sox /Users/Shared/Music/iTunes/iTunes Music/Jeff Atwood and Joel Spolsky/The StackOverflow Podcast/ITC.SO-Episode011-2008.06.24 1.mp3 -t .wav - tempo 1.8 30\n\npiped to \n\n/opt/local/bin/lame -V 7 --tt ITC.SO-Episode011-2008.06.24 --ta Jeff Atwood and Joel Spolsky --tl The StackOverflow Podcast - /Users/jeff/Music/Fastened/ITC.SO-Episode011-2008.06.24 1.mp3\n\nYou have to have lame installed to enable reencoding,\n\nIt's kinda hackish and requires you to compile sox and lame on your own, but I'll share if anyone is interested. \n\njeff.borisch@gmail.com"}, {"author_name": "dubayou", "gravatar_hash": "aa2bff29aff392df8beb76856bfd1702", "author_url": "http://dubayou.com/", "date": "Jun 30, 2008", "message": "Thanks,  This is great. that first ~30 seconds has been pissing me off.\n\n-w"}, {"author_name": "Brian Henderson", "gravatar_hash": "ba8d54a767cf6162ec28127a5ad81f39", "author_url": null, "date": "Jun 30, 2008", "message": "Thanks for pointing out the View &gt; Enhancements &gt;  PlaySettings... There was a button on Media v10, but disappeared in v11. (minimize icon still gone) BTW: Great feature for watching webcasts... faster for PPT, slower for demos.  \nNote: Play Speed Settings other than 1.0 don't work for streamed media; only direct access content.  \nShort-cut keys are also available via Play &gt; Play Speed."}, {"author_name": "mario64", "gravatar_hash": "48d473c292421ad0d93ac7a2712a5fda", "author_url": "http://del.icio.us/mario64", "date": "Jul 01, 2008", "message": "sorry but i couldn't help it: Posted by Jeff Atwood on June 30th, 2008? I don't think so."}, {"author_name": "Guy Incognito", "gravatar_hash": "d4f48fe2e72b0964a54309d676295fe3", "author_url": null, "date": "Jul 01, 2008", "message": "Try the Pacemaker plugin for Winamp.\n\nYou can adjust tempo, pitch and speed (ie both combined) independently. It's also great for learning songs if you're a musician."}, {"author_name": "peSHIr", "gravatar_hash": "82c2c6bb9fca3b09116cebb87c82afb6", "author_url": "http://friendfeed.com/peshir", "date": "Jul 01, 2008", "message": "This is still a workaround for the \"lazy blogging\" that are podcasts/vidcasts/whatevercasts/'casts. (I'll just call them \"casts\" from now on.)\n\nIf you want me to consume your content in any way, (also) make it available at least as some kind of textual content description or even full transcript, or actually write it to begin with.\n\nI cannot browse casts for potentially interesting information, skimming over them like and letting the pattern recognizer in my skull find the parts that are interesting like I can with text. And I cannot multitask casts either, in the sense of simply opening/downloading more than one at the same time and quickly switch browsing at leasure through any/all of them at will.\n\nAlso, the information is not available for search engines (right now), even though that probably can't take that very long to change in practice.\n\nBottom line: right now I just don't have the time (or \"choose to spend that time in that way\"... whatever...) to spend on casts, with or without speeding up playback as a stop-gap solution.\n\nJust give me text, please..."}, {"author_name": "Jeffrey Davidson", "gravatar_hash": "bc49feef07133ab11b996f4ed8505b9d", "author_url": null, "date": "Jul 01, 2008", "message": "@peSHIr\n\nThere is a transcript wiki link underneath every podcast page.  Here is the link for the most recent transcript:\n\nhttps://stackoverflow.fogbugz.com/default.asp?W12621\n\nAs far as \"lazy blogging\", I very much disagree.  Joel and Jeff have each written hundreds of blog posts (not so much for Joel anymore, though) - I don't think either of them fear the work of writing a post.\n\nThis is merely another format and way of communication.  Personality comes out in this format, and I for one find both blogs and casts to have value independent from each other."}, {"author_name": "Keef", "gravatar_hash": "0d723bdfc0fc6282fda8e0a87365a283", "author_url": "http://www.weareecs.com", "date": "Jul 01, 2008", "message": "I didn't even realize that speeding up and slowing down audio was a desired feature for playback on devices or through standard media players.  I understand for production software but for playback itself...\n\nI guess you learn something new every day!"}, {"author_name": "Rob Smith", "gravatar_hash": "f0913b647b6ea48cb2f11429ece3ec43", "author_url": null, "date": "Jul 01, 2008", "message": "&gt;&gt;With mplayer (linux etc.) you can use “-speed 1.5 -af scaletempo=speed=tempo” (substitute 1.5 with the speedup-rate you prefer)\n\nYou can also just use the [] keys to slowdown/speed up playback (at least, with the standard GUI you can).  SMPlayer also supports this."}, {"author_name": "Jon Galloway", "gravatar_hash": "63c32b4489d13b17d23fd9db1505bdf9", "author_url": "http://weblogs.asp.net/jgalloway", "date": "Jul 02, 2008", "message": "+1 for the Winamp / Pacemaker combo. It's surprising that VLC doesn't have options with useful granularity; it's only got x2, x4 type settings."}, {"author_name": "Tony", "gravatar_hash": "4f62aa18f10e160302e7f8be6f49219d", "author_url": "http://www.58bits.com", "date": "Jul 02, 2008", "message": "I've had this feature for ages. When I'm nervous I talk at 1.5x and when I'm really nervous 2.0x. \n\nSeriously though - will be interesting to try a fast playback and see if it really does save time, or if I miss stuff and have to rewind."}, {"author_name": "Brandon", "gravatar_hash": "4a252253694802c7c04951d4817ae906", "author_url": null, "date": "Jul 02, 2008", "message": "Another +1 For Winamp/Pacemaker.\n\nI like its option to reset the tempo/pitch when the track changes, since I usually enqueue podcasts at the current spot in my playlist when I want to listen to them, and let winamp follow that up with the next music track when the podcast is done."}, {"author_name": "Michael Mahemoff", "gravatar_hash": "cabf735ce7b8b4471ef46ea54f71832d", "author_url": "http://softwareas.com", "date": "Jul 05, 2008", "message": "You could outsource the job pretty easily on elance, mechanical turk, etc"}, {"author_name": "peSHIr", "gravatar_hash": "82c2c6bb9fca3b09116cebb87c82afb6", "author_url": "http://friendfeed.com/peshir", "date": "Jul 14, 2008", "message": "@ Jeffrey Davidson:\n\nDidn't notice the transcripts available here before. Thanks for that.\n\nAnd my negative utterings about casts in general in no way reflect negatively on other work by cast authors (both on this website or elsewhere). I read blog posts by Joel and Jeff and generally like them very much. My negative comment is not of them personally, the content they publish in various ways or even their specific casts, but more of casts in general. I still see that as just \"lazy blogging\".\n\nYou're absolutely right that both blogs and casts are independent from each other; I just don't really see the value of casts with all the downsides this method of communicating has for me personally.\n\nAnd that might change when sound indexing and transcribing software gets better. (Yes Google, I'm talking to you here! ;-))"}, {"author_name": "Shyam", "gravatar_hash": "bd8496d4252d8aaf6e2f24ff20893ef2", "author_url": null, "date": "Jul 27, 2008", "message": "Are you planning to allow embedding audio files (into personal blogs)?"}, {"author_name": "nickf", "gravatar_hash": "0a6d284d4e2ce68e1c60871858da800b", "author_url": "http://www.spadgos.com", "date": "Aug 04, 2008", "message": "Winamp has this ability too with the packaged Nullsoft Signal Processing plugin (Preferences -&gt; Plugins -&gt; DSP/Effect -&gt; Configure). One of the presets lets you speed-up/slow-down a track without chipmunking it."}, {"author_name": "Tom Müller", "gravatar_hash": "9f1ad5bcc4724ab2a14d184165b2be6e", "author_url": null, "date": "Aug 13, 2008", "message": "Hello i am Speedhearing since nearly 2years now and think i can give you some advice. First i read this article and then the Comments.\n\nTo make some things clear:\n\n- Winamp + Pacemaker Sound terrible compared to a properly \"upspeeded\" file.\n\n- WindowsMediaPlayer does a good job but can't speed up to 200%\n\n- GOM Player also has Problems. It Sound like under water when speeding up.\n\nReference for me is the Speed up with Adobe Audition 2.0. I its really smooth. i then tried audacity and was wondering why i sounded so bad. i used the \"tempo\" and speeded up to 200%.\n\naudacity was clearly better. i then tweaked araound and find out that audacity can do it very good, but you need to do it anaother way.\n\nif you like to know how, mail me: twomaze@googlemail.com  \n\n\nmy conclusion is (for the moment), that there is no really good speed up in realtime (didn't try the ipod or rockbox). for really good results you need to do it with an professional audioeditor.\n\naudacity with its batch modus is the software to go. but not with the tempo change."}, {"author_name": "Tom Müller", "gravatar_hash": "9f1ad5bcc4724ab2a14d184165b2be6e", "author_url": null, "date": "Aug 13, 2008", "message": "\"audacity was clearly better.\" sorry i meant audition was better"}, {"author_name": "Tom Müller", "gravatar_hash": "9f1ad5bcc4724ab2a14d184165b2be6e", "author_url": null, "date": "Aug 13, 2008", "message": "With the professional method you won't have problem hearing it doublefast. as long as you are a native speaker."}, {"author_name": "Tom Müller", "gravatar_hash": "9f1ad5bcc4724ab2a14d184165b2be6e", "author_url": null, "date": "Jan 29, 2009", "message": "an detailed explanation on how to use audacity to speed up your mp3s can be found on\n\nhttps://twitter.com/TimeSaviour"}, {"author_name": "payday loans locations", "gravatar_hash": "4b0ae0642736b71007f628c7873eb70e", "author_url": "http://www.paydaytown.com", "date": "Jun 26, 2009", "message": "I found blog.stackoverflow.com very informative. The article is professionally written and I feel like the author knows the subject very well. blog.stackoverflow.com keep it that way."}, {"author_name": "increase your vertical", "gravatar_hash": "1e8a12f7a9ac71d8ce4278a3d4c03833", "author_url": "http://www.increaseyourverticalhq.com", "date": "Feb 20, 2010", "message": "Thanks for the great article, I always find this stuff so useful. I've bookmarked the site :)\n\nI always listen to podcasts on the train, bus, etc - I often wish I could get more information in at once, you know? Its feels like I cant listen fast enough.\n\nI guess this will help :P"}, {"author_name": "Janne Vaittinen", "gravatar_hash": "5b544d838e8173141b6c99832e0416f9", "author_url": null, "date": "Mar 04, 2010", "message": "Nowadays VLC supports x1,5 also.\n\nThanks for the great show!"}]}