{"response": [{"author_name": "Jim McKeeth", "gravatar_hash": "e5ca3abec062f8174570a4b1d1c840d8", "author_url": "http://www.davinciunltd.com/", "date": "Jun 11, 2008", "message": "Interesting that there are some audio quality issues now that you have moved to IT Conversations.  Is it being encoded differently or something?"}, {"author_name": "Adam Haile", "gravatar_hash": "3a29aba7f7e68203d4265d5fcca46f53", "author_url": "http://adamhaile.com", "date": "Jun 11, 2008", "message": "Not a complaint, but I was getting curious for awhile there if you were no longer going post these on the blog, as this has been up on IT Conversations since this morning."}, {"author_name": "Joel Spolsky", "gravatar_hash": "d77663c217e9d27b725338c06674c94b", "author_url": "http://www.joelonsoftware.com", "date": "Jun 11, 2008", "message": "Jim: what kind of audio quality issues are you having? the Conversations Network actually uses higher quality settings than we were using when we hosted it ourselves (64 bits instead of 48 if I remember correctly)"}, {"author_name": "Mark", "gravatar_hash": "30d5b50f03f22890820d8c9c995cfa7d", "author_url": null, "date": "Jun 11, 2008", "message": "The static download link is resolving a 404. The player still works fine.\n\nRegards,"}, {"author_name": "Bremen", "gravatar_hash": "9a45de8df0c5c3f6e137c785e71557b8", "author_url": null, "date": "Jun 11, 2008", "message": "Can you make ITC switch to a less-crappy filename for the .mp3? The old mp3 filename format was excellent, and now it not only changed, but it won't be easily sortable.\n\nThanks."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 11, 2008", "message": "The old filename:\nstackoverflow-podcast-008.mp3\n\nThe new filename:\nITC.SO-EpisodeNine-2008.06.10.mp3\n\nI guess the \"episodenine\" part is a problem because it's spelled out and not numeric. I'll talk to the ITC folks."}, {"author_name": "John", "gravatar_hash": "5cbdaa7981f5f52de8fb3caa49dce5ee", "author_url": null, "date": "Jun 11, 2008", "message": "Are there other ways to download the podcast? I can't donwload it using firefox and opera."}, {"author_name": "Adam Wendt", "gravatar_hash": "278ac619b6e01e2d0bbd34c80b06f46f", "author_url": "http://blog.thelsdj.org/", "date": "Jun 11, 2008", "message": "A couple comments:\n\n1) I really miss the pure \"cold start\" having the ITC intro kinda sucks.\n2) Visual Studio vs IIS testing. I highly recommend running a copy of IIS on your development box and configure VS.net to debug by launching IE against the local IIS config. My guess is that would greatly reduce problems where you think it works, but then deploying to IIS breaks things."}, {"author_name": "Federico", "gravatar_hash": "35bdded0ed436595945447a2484a77b0", "author_url": null, "date": "Jun 11, 2008", "message": "I also agree with the sound quality issues, it's like a bit of background noise (static?) paired with a lower voice quality."}, {"author_name": "Jim Robert", "gravatar_hash": "aa2c9c45372ed95ebd86c21d86766183", "author_url": "http://www.roboRobert.com", "date": "Jun 11, 2008", "message": "your link to about:blank turned into a link to http://about/ which resolves to about.com in firefox (I don't know about other browsers) just thought you might be interested"}, {"author_name": "Stephen Hill", "gravatar_hash": "05e9ba4193d823a238da43fb1b5f18e0", "author_url": "http://stephenandlouise.co.uk", "date": "Jun 12, 2008", "message": "Admin: \"I really miss the pure 'cold start' having the ITC intro kinda sucks.\"\n\nI Couldn't agree more. I haven't even listened to the podcast yet because I needed to come on here to say how poor and cheesy the intro is.\n\nBack to basics I think!!!"}, {"author_name": "Stephen Hill", "gravatar_hash": "05e9ba4193d823a238da43fb1b5f18e0", "author_url": "http://stephenandlouise.co.uk", "date": "Jun 12, 2008", "message": "WTF\n\nAnd now adverts...."}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Jun 12, 2008", "message": "MVC already has a go live I thought.  I think it was part of PR2.  Or the mid term release after that.  Either way it is released in an open source fasion with a pretty permisive licence.  So I don't se why it is an issue, but I am not a lawyer."}, {"author_name": "John Nolan", "gravatar_hash": "d71e6f29b4a15b0a2038f28ee913a293", "author_url": null, "date": "Jun 12, 2008", "message": "Wow! Stackoverflow has really jumped the shark by moving to IT conversations. Only joking. I too miss the impromptu start of the old StackOverflow podcasts I loved the feeling that we were being invited into a conversation with you both. It just felt more personal, whereas this one felt we were being presented too. My preference is to keep it raw.  Otherwise good content as normal."}, {"author_name": "Martin", "gravatar_hash": "65603c689ef5ce4ea416da9def26a117", "author_url": null, "date": "Jun 12, 2008", "message": "Did the Ads overlay the actual warm start? \n\nThis time, it started out much more sudden while depressive and confusing (who's who?) than usual."}, {"author_name": "Nick", "gravatar_hash": "fc8d4185fa3b625094482ef462159f57", "author_url": null, "date": "Jun 12, 2008", "message": "Oh dear. Things have taken a backward step or two.\n\n- The sound quality is much worse. There's a lot of background hiss.\n- The file name and mp3 properties have all changed, so I've ended up editing them so that things remain consistent on my various players.\n- The ITC intro/adverts are awful.\n\nIs there any way of going back to how things were?\n\nSorry to be so negative. It's just that stackoverflow was supposed to be something different but now the podcast has been lumped into the ITC monolith and I think it spoils the good work that Jeff and Joel are doing."}, {"author_name": "Matan", "gravatar_hash": "0bb7bf3089b704277bac6d9acc7bb22b", "author_url": null, "date": "Jun 12, 2008", "message": "I second the comments about the advertising.  I loved how stackoverflow felt up until now.  It felt personal, and the content felt of high quality.  This intro at the beginning is a couple of steps back.  I don't know who ITC are, but this intro doesn't shed a positive light at them at all, and it kind of put me in an angry mood, even if contentiously, right at the beginning of the podcast.\n\nSorry if this sounds negative.  I really love stackoverflow, and I'm worried it's going to turn into just another one of those advertising-exhausted tech podcasts no one listens to.\n\nOther than that, the content after those ads at the beginning is top-notch as usual, nothing to change here.  Keep it as is.  ;)  Awesome work guys."}, {"author_name": "Keithius", "gravatar_hash": "51c993a6256194924615053475a14238", "author_url": "http://www.starkeith.net/coredump/", "date": "Jun 12, 2008", "message": "Well, at least it downloads MUCH faster now!"}, {"author_name": "Dave", "gravatar_hash": "755e1277329df9e6b7e6685b21108ee6", "author_url": "http://encosia.com", "date": "Jun 12, 2008", "message": "One big affiliate area that you guys didn't talk about is web hosting.  One of my current hosts actually pays out a larger affiliate fee than a year's hosting costs, yet have been happily doing it for years (and growing)."}, {"author_name": "Eirik", "gravatar_hash": "9da7b3594009ed1c7bb7d1f3ea499d83", "author_url": null, "date": "Jun 12, 2008", "message": "I second the comments about the advertising/intro. Don't change something that works."}, {"author_name": "Martin Wallace", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Jun 12, 2008", "message": "I agree with some of the sentiments about the new intro - but I can live with it.\n\nFor those that can't - surely some kind individual can edit it out and re-host it.  That's allowable under the Creative Commons license I believe (to make derivative works)?"}, {"author_name": "Nathan Fellman", "gravatar_hash": "898c2217a5457bdef0a0ed58283010dc", "author_url": null, "date": "Jun 12, 2008", "message": "To be fair to ITC, they say in the intro that you can get a paid subscription and avoid the intro.  While it's a bit annoying, I have no intention of getting such a paid subscription.  It's simply not _that_ bad.\n\nRegarding the sound quality, the only complaint I have is that it's got a lower volume.  I tried listening to it on a speaker while driving, and I really had to strain to hear.  This didn't happen with the previous version."}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Jun 12, 2008", "message": "http://forums.asp.net/p/1193955/2058063.aspx\n\nUse in Live Operating Environment.  Because the software is a pre-release version, and may not work correctly, provided that you take adequate precautionary measures to back up and protect any data that may be affected by use of the software, you may, at your sole discretion and risk, use the software in a live operating environment. You may not use the software alone or with programs that are intended for"}, {"author_name": "David", "gravatar_hash": "85c7304fa55147d89583c0d1c38e6328", "author_url": "http://cradle.brokenglass.com/", "date": "Jun 12, 2008", "message": "Perhaps I'm imagining things, but Jeff sounds sooo laid-back this time around.  Jeff, were you drunk?  Or high?  Just curious."}, {"author_name": "Jack B. Nimble", "gravatar_hash": "646f9bc3ae8effa7fa1a1a1c528ff522", "author_url": null, "date": "Jun 12, 2008", "message": "I noticed several times some hissing and crackling sounds. I was surprised by the intro but it isn't enough to turn me away."}, {"author_name": "Scott Muc", "gravatar_hash": "a67d1b0481cb73482061576ebb54f285", "author_url": "http://scottmuc.com/", "date": "Jun 12, 2008", "message": "Ugh, hate the intro! I loved how the previous episodes just got right into the candid conversations you guys had. The cheesy intro music must stop! I don't mind quick ads, but drop the fluff."}, {"author_name": "Matthew S", "gravatar_hash": "a2342ef5b27305d9b08d44e0e11c14b1", "author_url": null, "date": "Jun 12, 2008", "message": "I think some of the criticisms about the new podcast format are a bit unjust.  I also prefer the old, straight-in method, but the old podcast was broken; the bandwidth was evaporating.  I applaud their choice of a non-profit host with a mission of spreading more of the free information we all crave. I don't mind expending a few seconds of my time in return for the full hour-long podcast, after all the content is all still there.  Just my thoughts, hope they find you all well. Thanks!"}, {"author_name": "Ian Anderson", "gravatar_hash": "60b1c7dc18e08e1a16f313354814744f", "author_url": "http://thefirstpost.co.uk", "date": "Jun 13, 2008", "message": "How much can you complain about something you are getting for free, and which costs other people substantial bucks for the bandwidth to provide it to you? According to their ad, ITC host with Limelight Networks, the  #2 global content delivery network. Providing these downloads costs actual, serious money and ITC are putting considerable effort into ensuring you can get them reliably.\n\nThe intro is cheesy - so what? you scroll 40 seconds into the file and you're fine. How hard is that?\n\nI thought this one of the best podcasts - really good this week. Didn't have any issues with sound quality, but then I was listening on a train so had some background noise anyway.\n\nThe only thing I would suggest is that now they have the third party introduction, the warm start is no longer effective. It would be much better for Joel or Jeff to start with a proper \"Hi! Welcome to stackoverflow podcast number...\"\n\nOr farmyard animal noises or something distinctive that is easy to find when you're scrolling through the mp3.\n\nThat was a good balance between questions and general stuff this week."}, {"author_name": "pacifika", "gravatar_hash": "42786a4364f7fe5b27371e84f2bee8fa", "author_url": "http://amasan.co.uk", "date": "Jun 13, 2008", "message": "There's only static when I listen via the flashbutton (latest beta flash player installed via filehippo), when I use iTunes with the podcast subscription there is no crackling. hope that helps."}, {"author_name": "watt", "gravatar_hash": "42ad44db8efe1a2b5e5e9214b444c971", "author_url": null, "date": "Jun 13, 2008", "message": "oh god, that ITC intro really is the suck - as Joel previously said about other podcasts: it is imperative to fast forward the first N seconds. no wonder people will pay to avoid that."}, {"author_name": "[ICR]", "gravatar_hash": "48a02e16370caadaedff78e2a94656ce", "author_url": "http://www.morethannothing.co.uk", "date": "Jun 13, 2008", "message": "The intro is bareable, but now that you have such an introduction it makes attempting a \"warm start\" even more confusing imho.\n\nI think if anything summed up this episode it would be \"out of band\". How many times did that get said?\n\nGood to hear some more details about StackOverflow whilst still having the other off-topic but interesting discussions."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 13, 2008", "message": "> oh god, that ITC intro really is the suck \n\nTo be clear, IT Conversations is a non-profit organization, much like NPR. I agree it's not ideal, but it's among the least of possible evils, sort of like NPR fund drives.."}, {"author_name": "Nicolás Miyasato", "gravatar_hash": "313a517a47d3bcf4091e397204facec9", "author_url": "http://nmiyasato.blogspot.com", "date": "Jun 13, 2008", "message": "Specialist vs generalist.\n\nSo, if I had to choose a developer, I certainly would not choose a specialist. \nI mean, if I was hiring a developer that would use the   programming language and during the interview the guy says... \"I know absolutely everything about , but have  no idea regarding those other stuff...Stored Procedures? Sysadmin? Databases? ..etc.... nooo idea. But , I'm the best at it. I own like 30 certifications on \". I pretty confident that I would never ever hire that guy...\n\n--\nNicolás Miyasato (miya)"}, {"author_name": "Scott Jackson", "gravatar_hash": "166a5da3b599acc6542929aefc3c6254", "author_url": "http://scottjacksonx.wordpress.com", "date": "Jun 14, 2008", "message": "I haven't been able to comment for a while (I kept getting a 500 error...?), so this is quite delayed:\n\nI might be wrong, but a \"cold opening\" is exactly that - opening cold. Examples of this are the opening sketch of SNL, Scrubs, and Star Trek: The Next Generation). A \"warm opening\" on the other hand is usually just music to start with, a la Late Night With Conan O'Brien or Futurama.\n\nI guess the stackoverflow podcast has more of a \"warm opening\" now that it's hosted by itconversations.\n\nAgain, I might be wrong. If so, shoot me dooooooown!"}, {"author_name": "Kurt from Florida", "gravatar_hash": "218dd8026929110aa3369d645b447884", "author_url": "http://www.leucht.com", "date": "Jun 14, 2008", "message": "I think a lot of people are coming down too hard on the new podcast \"wrapper\" just because it's different.  It's not a very long intro in the grand scheme of things.  I thought it sounded very professional.  And I don't mind listening to one short ad in order to hear a great free show.  \n\nI also appreciate how fast it downloads now since I'm copying the MP3 file to my smartphone by hand instead of \"subscribing\" and getting it automatically onto my device during a sync.  (Guess I need to look into that technology, though, since I'm a committed listener to this particular show.)\n\nI do think you Jeff &amp; Joel need to spend about 5 seconds introducing themselves now, though.  After the professional sounding introduction, the \"tripped up\" start, as I'll call it, doesn't sound too good anymore.  It sounds like we're coming in on the middle of a sentence.  At least say \"Hi and welcome to the stackoverflow podcast.\"\n\nI did not have any problems with the sound volume nor the sound quality ... other than a couple of words got garbled every time Jeff and Joel tried to speak at the same time, which happens quite often, but that has nothing to do with the new podcast \"wrapper\".  That's probably a Skype issue, and it's been happening for a long time.\n\nGreat episode guys!  Keep up the great work!\n\nKurt from Florida"}, {"author_name": "Dustcollector", "gravatar_hash": "f084828ad838601166755b836344f86a", "author_url": null, "date": "Jun 14, 2008", "message": "I am puzzled that Atwood said Spolsky and Shipley are similar. Yes, both are outspoken, and their last names start with \"S\", but simply reading their respective blogs shows the similarities end there. \n\nSpolsky is a thoughtful and careful writer, often entertaining and provocative whereas Shipley is a careless writer, often crude, and sometimes can use better fact checking.\n\nI've only listened to Pocasts 8 and 9... not bad, but the jury is still out as whether I'll continue."}, {"author_name": "Amr", "gravatar_hash": "bd05987c96cc061f538ee47374f2d705", "author_url": "http://www.amreldib.com", "date": "Jun 14, 2008", "message": "Guys, as much as I like your podcast and how natural the conversation is, I think maybe you should consider having a topic for each podcast. It doesn't have to be just one topic, it can be many but at least we're (you through the podcast and us through e-mails and audio questions) discussing a topic that is worth our attention (or not).\nMany people listen to podcasts while they do other stuff, it's like listening to the radio. And as the topic becomes not interesting to the listener, s/he loses focus. But unlike the radio, the podcast ends at some point.\nAlso, I find it hard to suggest your podcast to friends because I can't really tell what it's about.\n\nJust something to think about.."}, {"author_name": "John", "gravatar_hash": "d0b76ae7bf261316683cad31ba0bad91", "author_url": null, "date": "Jun 15, 2008", "message": "Hi just listened to the podcast. Great yet again.\n\nInteresting you talked about wikipedia maybe one day having an article on everything. Previously you have also mentioned wilikipedia becoming the top link in google for everything. This leads me on to noticing you have managed already with even having a content filled site to beat wikipedia on goggle for the search term  stackoverflow. Interestingly even microsofts falls after wikipedia article closely followed but the java article."}, {"author_name": "John", "gravatar_hash": "d0b76ae7bf261316683cad31ba0bad91", "author_url": null, "date": "Jun 15, 2008", "message": "(That's a well done not a criticism)"}, {"author_name": "Josh Parris", "gravatar_hash": "92f446269f65ef4213e94bd99aa3e475", "author_url": "http://parris.josh.com.au/", "date": "Jun 15, 2008", "message": "The nannyware here is blocking access to cdn.conversationsnetwork.org - is there an alternate location I can use?  Yes there is!  Yay for still serving from your server but not telling anyone.  Keep doing that."}, {"author_name": "Josh Parris", "gravatar_hash": "92f446269f65ef4213e94bd99aa3e475", "author_url": "http://parris.josh.com.au/", "date": "Jun 15, 2008", "message": "Aw crap.  I was wrong.  Serve from your server, guys!  Otherwise I can't download nuthin!"}, {"author_name": "Mladen", "gravatar_hash": "c4255dda1dea961a5cdfd2cd3388144c", "author_url": "http://weblogs.sqlteam.com/mladenp", "date": "Jun 16, 2008", "message": "nice podcast.\nI'd just like to know from where do you know Dornbracht, Joel?\nyou have a RainSky at home or something? :)"}, {"author_name": "Craig", "gravatar_hash": "a409abbd3879e0e2380a9128b6985a3f", "author_url": null, "date": "Jun 17, 2008", "message": "Another password management option when you are using firefox is a project called Firefox Weave.\n\nIt can save bookmarks, passwords, etc between instances of firefox on different machines.\n\nhttp://labs.mozilla.com/2008/06/weave-status-update/\n\nIt is still heavily in development from the looks of it.\nhttp://labs.mozilla.com/2007/12/introducing-weave/"}, {"author_name": "Tom Wozniak", "gravatar_hash": "d206e24f6867f2cfce4de6fb0cdbc22b", "author_url": "http://tomwozcoredump.blogspot.com", "date": "Jun 17, 2008", "message": "I believe I'm a card-holding member of the “specialize in being a generalist” club.\n\nThis topic was my first (and currently only) blog post a couple of months back.\n\nQuickly picking up new languages and techniques to bring some projects back from the \"point of no return\" is surely a challenge.\n\nI'll tell ya, generalizing is hard work and could definitely be considered a specialty. :)\n\nCheers."}, {"author_name": "Craig", "gravatar_hash": "0f646e0ae274f9795ce8e95c120bddf8", "author_url": null, "date": "Jun 17, 2008", "message": "What's up with the all name inconsistencies? What's the official name:\n\nstackoverflow\nstackOverflow\nStackOverflow\n\n???"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 17, 2008", "message": "I was thinking StackOVERfloW, myself.\n\nIt's still evolving. My current thoughts are...\n\nWhen referring to the website:\n\nstackoverflow.com\n\nWhen referring to the general concept itself:\n\nStack Overflow"}, {"author_name": "Gishu", "gravatar_hash": "69772f0246d5013d72703967b8761e89", "author_url": "http://madcoderspeak.blogspot.com", "date": "Jun 18, 2008", "message": "The passwordmaker.org tip was awesome. Thanks for including that in the podcast.."}, {"author_name": "Bryan", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": "http://quux.tumblr.com", "date": "Jun 19, 2008", "message": "I just wanted to comment on the password problem. Now, I'm just one guy with an opinion, so this isn't a flame, but ...\n\nThe thing about passwordmaker.org is, if you use their online widgit to reconstruct a password for, say ... yourbank.com, you're doing the same thing you'd be doing at passwordsafe.com (which passwordmaker sort of sneers at in their intro, and rightfully so). You're giving your password and the yourbank.com pieces of information to some stranger on the internet. Now, both passwordsafe and passwordmaker will say they're secure, and that their operators have no personal access to your passwords - but how can you be sure? Has either of them passed independent audit by anyone you really trust? Will either site assume any liability if they do manage to leak your passwords?\n\nDon't get me wrong here. I'm fairly sure that both passwordsafe and passwordmaker originate from the purveyors' sincere desire to provide safe and secure ways of keeping our password messes in order. But never underestimate the possibility for good intentions to generate bad results sooner or later.\n\nFor me, either option is too scary. I use eWallet, ( http://www.iliumsoft.com/site/ew/ewallet.php ), which I can sync to my PC and my smartphone. I suppose it's still possible that eWallet could somehow send my passwords back to their maker, but at least now I could check and/or stop this, by having a client-side firewall which prohibits the program from ever phoning home.\n\nI'm going to carry my phone anyway, so now I have a password repository that's backed up, and goes with me wherever I go. It's handy. Not ideal (I agree about OpenID, Jeff) ... but handy given the current state of the game.\n\nAnyway. Just my 2 cents. Love the podcasts!"}, {"author_name": "Matt", "gravatar_hash": "cc942d2d8a74652acd9fe06fe9cc55fe", "author_url": null, "date": "Jun 19, 2008", "message": "re: audio quality\n\nI too thought the audio had some issues.  It was most noticeable when Joel was speaking: it seemed like the beginnings and ends of his words were being chopped off or dropping out.  It almost sounded like someone using a voice-activated microphone (i.e. first sound not transmitted).  Or maybe like it had been put through one of those post-production filters that automatically edit out pauses and silences and can end up making normal speech sound subtly stilted.  Maybe some sort of clipping?  I obviously don't have the terminology to describe it, but it was weird."}, {"author_name": "Alek Davis", "gravatar_hash": "bca30c953bb511410eab038890454e49", "author_url": "http://alekdavis.blogspot.com", "date": "Jul 12, 2008", "message": "Regarding PasswordMaker and Joel's password storage problem (with which I struggle as well, and I assume many others, too): I wonder how PasswordMaker deals with  changing site names. Say, I created an account at cingular.com, and now it's wireless.att.com (okay, this is a pretty obvious name change, but sometimes, you may not remember the name of the old site). Also, since all sites seem to have different password rules (some allow one set of characters, others allow another set of characters), how should I keep track of which site uses which character set? And how do you keep track of other rules (password length, etc)? I don't use PasswordMaker, but if others do, I wonder how they handle these issues. It just seems no less hassle to me than the original problem. Personally, I can't wait when Clipperz implements tagging and grouping, and I can outsource my password storage to it. At this point, the best option is to use a password manager program (I prefer KeePass) and either sync files (e.g. via FolderShare if you can access it from behind the corporate firewall), or store the encrypted passwords file online at location which can be mapped as a drive (share), such as GSpace or who.hasfiles.com (the latter allows you to map a drive to a personal online storage area; connection is done over HTTP, but for a small fee you can get HTTPS support if you really care). If someone has a better approach, I would also really like to know. Thanks for raising this issue.\n\nP.S. Nice podcast. I did not care much for the first couple of podcasts, but they seem to get better and better lately. Please keep it up."}, {"author_name": "Nicholas Bieber", "gravatar_hash": "cb9e249283eea099f5cc5a3e48fe04f4", "author_url": null, "date": "Jul 21, 2008", "message": "&gt;Young system consultants trying to do everything\n\n... oh my god!  that's me!  FAIL!"}]}