{"response": [{"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 19, 2008", "message": "The Bristol Technologies Joel mentioned is covered in Wikipedia (of course!) here:\n\nhttp://en.wikipedia.org/wiki/Bristol_Technology_Inc."}, {"author_name": "Rob Burke", "gravatar_hash": "429329df3c7c21e2a9f156a808c1fab0", "author_url": null, "date": "Jun 19, 2008", "message": "I knew I should've tried some URL permutations to \"guess\" the beta site! This podcast appeard on ITConv. earlier than Stack Overflow as well."}, {"author_name": "Rob Burke", "gravatar_hash": "429329df3c7c21e2a9f156a808c1fab0", "author_url": null, "date": "Jun 19, 2008", "message": "Oh, that's a broken Wikipedia link... the final period needs to be included in the <a> tag.\n\n[url=http://en.wikipedia.org/wiki/Bristol_Technology_Inc.]Bristol Technology Inc.[/url]"}, {"author_name": "Rob Burke", "gravatar_hash": "429329df3c7c21e2a9f156a808c1fab0", "author_url": null, "date": "Jun 19, 2008", "message": "Oh, also, that Wikipedia link is broken Jeff. The final period (after Inc) needs to be included in the link. Don't know if that is a user or software error though.\n\nhttp://en.wikipedia.org/wiki/Bristol_Technology_Inc."}, {"author_name": "Eric Holscher", "gravatar_hash": "a985c35d6be3c88a87d92b92b0d3756f", "author_url": "http://www.ericholscher.com", "date": "Jun 19, 2008", "message": "Good show. Don't forget about Bazaar, a DVCS that joined the GNU project (built by the Ubuntu folk)"}, {"author_name": "Ryan Fox", "gravatar_hash": "fcc79759f6398caee5df36cde61b36b7", "author_url": null, "date": "Jun 19, 2008", "message": "Perforce forces you to open a file for edit, but this doesn't prevent others from also opening it. You can lock files as well, but there's usually no need to do this."}, {"author_name": "Dumbfounded", "gravatar_hash": "c1fb4ba7d47006641a03aa6eb53cc218", "author_url": null, "date": "Jun 19, 2008", "message": "Is it me, or does Joel interrupt (talk over) Jeff about once per minute in every podcast?  I find that a bit annoying and distracting."}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "Jun 19, 2008", "message": "I see that you aren't following Yahoo's recommendations to put your scripts at the bottom of the page.  Is this intentional?"}, {"author_name": "Terry", "gravatar_hash": "f07c308f3ad0b247a2c73999987646d1", "author_url": null, "date": "Jun 19, 2008", "message": "Jeff, \n\nHa ha, yeah, you're absolutely right that there were times when you weren't listening to Joel. He would go on about something for minutes and I felt like you blew him off some occasions :)  \n\nI don't know how much you guys knew each other before, but I get the feeling that you feel more comfortable with each other.... More jokes and laughs...\n\nYour show is awesome, You guys are so insightful."}, {"author_name": "maeghith", "gravatar_hash": "88b9eb83c552686a5b21f09bc61197e8", "author_url": null, "date": "Jun 19, 2008", "message": "I haven't heard yet the podcast, but reading the bullet point about edits reminded me of meneame.net, a digg clone where they have implemented something like that (only users that have high levels of participation can do moderation tasks).\n\nI don't know if it will be of any use to you to look at the code but as it's an open source project the option is always there. That project is written in PHP, and even if most of the string is in spanish, the comments, var names and so are all in english (I think)."}, {"author_name": "Colin Nicholls", "gravatar_hash": "a222a039d50d4d5c4197271f515cc5d2", "author_url": null, "date": "Jun 19, 2008", "message": "Another great podcast, guys. Thanks.\n\nMinor nit: You need to stop interrupting each other. Joel, I'm looking at you. It would be ok except usually Jeff is saying something really interesting, and you're not.\n\nBut apart from that, it was great."}, {"author_name": "Alasdair", "gravatar_hash": "9286ce2d2199426ac66007862bccd37f", "author_url": null, "date": "Jun 19, 2008", "message": "Aww... what do you guys have against emacs keybindings? I use a lisp window manager that has emacs keybindings, plus I use emacs keybindings in firefox and my shell. I guess I'm just beyond all hope of UI design salvation. :) But my user interface is pretty consistent as a whole, since everything I use regularly behaves in the same way. Just like I have a crazy emacs-style setup companies making phones for android will be able to choose a consistent set of applications for their devices. I really doubt we will see the horrific inconsistency joel describes."}, {"author_name": "obvioustroll", "gravatar_hash": "36708277156e774ea22a0f759168182b", "author_url": null, "date": "Jun 19, 2008", "message": "You guys really have to get the main site up soon - I have any number of questions I'd like to post as discussions to be had among codemonkeys.\n\nOne thing that's been preying on my mind lately is this: \"What's your philosophy of coding?\" I don't mean \"what's the cool methodology\" or \"hey here's this great book I just read\" but, on a day-to-day basis, how do you approach the problem of translating ideas into executable binary?\n\nJoel (I think it was Joel) touched on that briefly when he mentioned the pattern of \"code to get it working and then fix it - except there's never interest in fixing it\"."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jun 19, 2008", "message": "\"Mike Lowrey: [to store clerk, who is pointing a gun at Mike] I'm gonna reach for my badge, ok?\nStore Clerk: Badges? Do you want badges motherb***h? I give you badges! 99 cents each.\n[throws some badges at Mike]\nStore Clerk: I sell you some.\"\n-- Bad Boys, 1995\n\nOr did you mean \"Badgers\"? In that case, can I have a Mushroom as my Badger?\nhttp://www.youtube.com/watch?v=GOxR7rTYuSI"}, {"author_name": "b", "gravatar_hash": "692ac027f4ce24548a9853eb17024bf6", "author_url": null, "date": "Jun 19, 2008", "message": "love the podcast, but joel keeps talking over portions of the audio questions making it really hard to hear what either is saying."}, {"author_name": "Robin Goodfellow", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Jun 19, 2008", "message": "I'd like to give a shout out to the Team Foundation source control system. It has its own quirks but one of the best features it has is support for \"shelvesets\", which allow you to pack up all of your pending local changes and store them on the server. This means that your changes are still safe even if your desktop burns to the ground, but it also means you can easily share your changes with other devs."}, {"author_name": "Hans", "gravatar_hash": "84bd29ff48f48793a99cd0c4069d44c9", "author_url": null, "date": "Jun 19, 2008", "message": "I have now listened to the beginning of the podcast and i think it sounds strange like it is playing a little too fast. Is this just me or has somebody else the same perception?"}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jun 19, 2008", "message": "If it's playing too fast, your Flash version is out of date. And as old Flash Versions have security holes in the size of a small galaxy, you should update as soon as possible:\nhttp://www.adobe.com/go/EN_US-H-GET-FLASH"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 19, 2008", "message": "> i think it sounds strange like it is playing a little too fast.\n\nAre you using the Flash player embedded in the webpage? Make sure you update your Flash player..\n\nhttp://blog.stackoverflow.com/2008/05/update-your-flash-player/\n\nYou darn hackers keep discovering our site!! :) (shakes fist)"}, {"author_name": "john", "gravatar_hash": "95d7a0d7cb8dad2c950112f4dcd673dc", "author_url": null, "date": "Jun 19, 2008", "message": "Hi Jeff. Since you started to host the podcasts in ITC i can't download it anymore. Do you have to sign to ITC in order to download? I'm thinking that since i'm here in the Philippines maybe we're banned to download? :("}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": null, "date": "Jun 19, 2008", "message": "I was just talking to my wife about how you must have advertised this \"secret beta\" site just to encourage people to find it...after all, if it weren't intended to be discovered, why mention it at all? :-P\n\nBut, I see it's been 403'd. Hmm...."}, {"author_name": "Gareth", "gravatar_hash": "97814c12d93a5ff39baafacfb5dcaf1f", "author_url": null, "date": "Jun 19, 2008", "message": "Google does actually submit some web forms: http://googlewebmastercentral.blogspot.com/2008/04/crawling-through-html-forms.html"}, {"author_name": "Rob G", "gravatar_hash": "b81a582c5a38155bb3711449d19bdee6", "author_url": "http://www.eisolutions.co.uk", "date": "Jun 20, 2008", "message": "For the love of all that is holy - Jol, could you PLEASE stop talking over and interrupting Jeff?! Every time I'm trying to follow the thread of what Jeff is saying, you jump in over the top and break the pattern of thought! I understand you have strong opinions - and I want to hear those - but please understand that Jeff's opinions matter to some of us too.\n\nSorry about the whine, but I'm just tired after listenning to 10 podcasts of you continuously interrupting just when Jeff is saying something I want to hear about! Have a listen - you'll see what I mean and it's very distracting.\n\n/rant\n\nKeep up the good work guys,\nRob"}, {"author_name": "watt", "gravatar_hash": "42ad44db8efe1a2b5e5e9214b444c971", "author_url": null, "date": "Jun 20, 2008", "message": "Not really, I feel Jeff's voice is getting stronger and he is now better at resisting being interrupted. That of course is function of not seeing each other face to face.\n\nWhile the trouble is when they both are talking, you can't actually hear anything (I guess higher bandwidth overwhelms skype's codec, or they cancel each other out... hmmm)."}, {"author_name": "Dumbfounded", "gravatar_hash": "c1fb4ba7d47006641a03aa6eb53cc218", "author_url": null, "date": "Jun 20, 2008", "message": "@watt, Joel most likely has a D-type personality type -- as most CEO's do.  Developers tend to have C-type personalities.\n\nhttp://www.wittcom.com/DISC_C_personality.htm\nhttp://www.wittcom.com/DISC_D_personality.htm\n\nRegardless, interuppting people is just plain rude."}, {"author_name": "nickL", "gravatar_hash": "744a84fb3ee798b707090ed4184ddfb4", "author_url": null, "date": "Jun 20, 2008", "message": "I hear a lot of little skipping, Joel sounds a bit skippy (and not like peanut butter)... me or is it just bad audio this time?\n\n\nFor exammple. the start of, \"Jeff: I would point to the eepc\" there is a weird wavy sound."}, {"author_name": "nickL", "gravatar_hash": "744a84fb3ee798b707090ed4184ddfb4", "author_url": null, "date": "Jun 20, 2008", "message": "oh, and bind those sounds (rimshot and wahwah/sadtrombone) to a keyboard!"}, {"author_name": "Paul D", "gravatar_hash": "9b670c98dc3eb51f9246ccaf3869208e", "author_url": null, "date": "Jun 20, 2008", "message": "I'm not sure what can be done about the hosts talking over each other. It's bound to happen in any natural free-flowing conversation. As long as they realise it is happening and make sure all the points are eventually addressed, it's all good. But can we please stop talking all over the audio questions? That's just annoying."}, {"author_name": "Jay", "gravatar_hash": "4ddde85028b02e7f07b2322f4b6215d1", "author_url": null, "date": "Jun 21, 2008", "message": "I like Joel, I've come across coding horror and they are periodically interesting blogs. Not really a regular read for me, but interesting. I decided to listen to your podcasts to find out what's up. \n\nI can't believe you don't have an open beta up yet. I now really think that you're successfully attracting attention to something that is not even there. \n\nYou've got an obvious source of search engine traffic, because everybody searches Google for programming questions. ExpertSexchange seems to have started doing what you are doing, and was useful, then put it behind a paywall. Now their high PageRank is basically a useless LIE to people like me who are searching for answers.\n\nSo put up a wiki. This is hard? I don't understand why your are promoting a site I can't even kick the tires at. I'm sticking you in the the irrelevant bucket right now until you start coming up on Google searches. I can't even file you as as 'future interest' because you give no clue when you'll go public, and so far it seems like you are just (sorry) masturbating about the technology and process that you're using. Honestly, I don't care. Get the content (answers).\n\n\nI know this sounds like whining, but really I'm just telling you that I learned of your site, got interested, listened to the podcast, and decided to leave a note before letting the door hit me on the way out. I hope you make something useful."}, {"author_name": "required", "gravatar_hash": "53f7a524cbd754b799a271637e84e5ea", "author_url": null, "date": "Jun 21, 2008", "message": "I don't get why people use Subversion. SVN doesn't even have proper merge tracking, meaning that merging and branching is seriously impeded. Why not go with CVSNT or Perforce where merge support is proper and things are moving much faster so the bugs are actually getting fixed?"}, {"author_name": "Theo G", "gravatar_hash": "630d9639b29b62bdabc155dc912d1b38", "author_url": null, "date": "Jun 21, 2008", "message": "It's (still) maddening to listen to the podcasts as Joel interrupts Jeff very frequently.  This episode was particularly bad in this respect--I almost couldn't listen to the whole thing.  It's a simple rule--only one person can talk at a time.  Joel, we want to hear what you have to say, but we'd like it more if you waited until Jeff finished his thought before you say it.  Thanks..."}, {"author_name": "Jon Galloway", "gravatar_hash": "63c32b4489d13b17d23fd9db1505bdf9", "author_url": "http://weblogs.asp.net/jgalloway", "date": "Jun 21, 2008", "message": "Jeff linked to the wikipedia article at the top, but I thought it was worth noting that it was Bristol who sued Microsoft, and not the other way around. They \"won\", but were awarded $1. http://www.techlawjournal.com/courts/bristol/Default.htm"}, {"author_name": "koreflaps", "gravatar_hash": "174278bbc5cb75e3738a2e3e31f4b0d5", "author_url": null, "date": "Jun 22, 2008", "message": "Jeff, I haven't listened to the end of the podcast yet, but I had to react to one thing right away: *W*ine *I*s __*N*OT__ a god damn *E*mulator. :)\nSee http://www.winehq.org/site/myths"}, {"author_name": "Isaac Lin", "gravatar_hash": "408975adb6e2f531f290e7fe0209a3a9", "author_url": null, "date": "Jun 22, 2008", "message": "Will author contributions become owned by Stack Overflow and so the licensing terms be based on Stack Overflow being the owner of the content? If not, the Creative Commons Attribution-Share Alike license may be difficult to use for a publicly-edited work: If someone writes an initial paragraph, and a number of people subsequently edit it in various ways, at what point is the text considered to no longer be a variant on the original work? Or does ownership essentially attach forever, even if all of the phrases have been replaced?"}, {"author_name": "Daniel", "gravatar_hash": "867d273117f85687ebe25eb04779aafd", "author_url": "http://www.crystalgears.com", "date": "Jun 22, 2008", "message": "Jeff,\n\nAbout Source Control being a tough concept: I completely agree with you. In fact, I was completely lost when I had to start using it, until I found this:\nhttp://www.ericsink.com/scm/source_control.html\n\nI found it to be extremely good, extremely clear, and quite thorough. Most important of all, it's the ONLY document i've found that explains these concepts.\nIt also does a good job of selling his product, which is kind of a downside, but the article is good, and works for any source control tool.\n\nJust my 2 cents"}, {"author_name": "Loren Norman", "gravatar_hash": "3a496e19db2f2fbf545406b05ff56b5f", "author_url": "http://lorennorman.com", "date": "Jun 22, 2008", "message": "Thanks for playing my question this week, guys!  Good discussion around Ruby (et al) in the enterprise, and I admit the question was indeed backwards!  I'm just generally really interested in how languages evolve, and part of that evolution is encroachment into more and more applications that actually make money.\n\nThe real answer seems to be the stuff you said about the Y-Combinator types:  If the language is useful, then the newcomers (organizations with no baggage) are going to use it, and eventually there are going to start being economically viable applications of it, which leads to a new round of millionaires and acquisitions, and suddenly Ruby/Python/etc are just \"in the enterprise\".  It just forms up around them by nature!\n\nI left the enterprise awhile back, and I'll probably never go back (web entrepreneurship is too rewarding!)  Ruby has certainly allowed my small company to rapidly prototype, launch, and iterate products and service offerings of various types, not to mention to fail fast enough that we're able to stay alive in the face of trouble even with no real budget to speak of!\n\nI posted this question to my own blog when I originally sent it in, and there has been some discussion on the notion over there, if anyone is interested:\nhttp://lorennorman.com/development/ruby-in-the-enterprise/\n\nGreat podcast guys. Cheers!"}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Jun 22, 2008", "message": "[ I am going to put everything I wanted to say here]\n\njeff &amp; joel.. what do you have against Experts Exchange? I hope you have noting against a business model for offering valuable information without spam, using one of the best search engines, convenience &amp; speed. If you can offer the same or more for free, that's great.\n\nI can post a question at EE and get a reply within minutes.. every time. Yes the point system works.  I know of no other site on the web which offers this can kind of speed. I find it a very helpful resource. \n\nJoel.. Check out dbPowerAmp converter. A free tool which can practically convert from any audio format to any audio format. Make sure you add the codec needed. They are all available on the site as separate downloads.\n\nOne point: asking listeners to supply answers in audio format because you don't read is a stretch. How is listening to audio faster than reading text. Me think you want to save time by listening to them in the subway in NY city?\n\nControlling passwords: try Roboform.\n\nJeff.. make sure stackoverflow uses a covinient and powerful search capabilities. Yes EE has a cool one besides Google on their site. You can search by title, body, code in body, anywhere in messages. You control # of results and which area on your site. A nice practical search. Better than the Google option they offer also.\n\nAny example of search function that sucks is CommunityServer. Big fonts, can't define number of search results and the fact that listing every relevant reply from the same post as a separate result item and without grouping them, clutters the screen and adds noise."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Jun 22, 2008", "message": "I mentioned the audio converter and then thought.. why bother? MP3 is the de facto standard and is playable on every OS and device and it's more than good enough for non music audio. There's no need to mess with Ogg Vorbis or any other format. Keep it simple."}, {"author_name": "[ICR]", "gravatar_hash": "48a02e16370caadaedff78e2a94656ce", "author_url": "http://www.morethannothing.co.uk", "date": "Jun 23, 2008", "message": "I'd second the recommendation for dbPowerAmp."}, {"author_name": "Sean T. McBeth", "gravatar_hash": "2d598f70b2bd1d828a195ced8abd7e9e", "author_url": "http://www.seanmcbeth.com", "date": "Jun 23, 2008", "message": "What are you talking about? Windows Mobile is a great platform. It becomes a shitty platform just like every other Windows OS when hardware vendors load it down with pre-installed crapware \"because it's the only way we can keep our costs down (*snicker snicker* can you believe people actually fall for that?)\". WinMobile + .NET CF is just about the best thing since Boxed Awesome for Breakfast, which is pretty damn hard to do."}, {"author_name": "Sean T. McBeth", "gravatar_hash": "2d598f70b2bd1d828a195ced8abd7e9e", "author_url": "http://www.seanmcbeth.com", "date": "Jun 23, 2008", "message": "== *W*ine *I*s __*N*OT__ a god damn *E*mulator. :) -koreflaps\n\nYeah, we knowa, we've heard plenty of times. And frankly, Scarlet, we don't give a damn."}, {"author_name": "macbirdie", "gravatar_hash": "c2ad4d98fcc9c454d09cbb16c6395a83", "author_url": "http://macbirdie.net", "date": "Jun 23, 2008", "message": "Instant rimshot - check.\nSad trombone - check.\nBubble wrap - check!\nhttp://www.virtual-bubblewrap.com/bubble-wrap.swf"}, {"author_name": "svrist", "gravatar_hash": "02855178b4bb98cb91f1a3b2b5c04e7a", "author_url": "http://seet.dk", "date": "Jun 24, 2008", "message": "Hi.\n\nRegarding expertsexchange I find that when i google for something and ExpertsExchange is on the list, I just use the google cache to see the content. That never failed for me"}, {"author_name": "Hemal", "gravatar_hash": "1a857cc33f44985222d2e698efd650b3", "author_url": null, "date": "Jun 24, 2008", "message": "I think it was Joel who mentioned, in the context of version control, that your own machine is your padded wall. You checkout, change as you like and if you don't like the result then undo checkout. So you don't need a branch.\n\nUnfortunately, it takes time to decide whether you like the end result or not. And without branch, all your changes are just one humongous bit, which is either on or off. It either all goes into the codeline or none does. \n\nThat is why you need a branch. So you can have interim private checkins. \n\nTalking about checkins, do you think there should be a policy to allow only compilable code to be checked in?"}, {"author_name": "Hemal", "gravatar_hash": "1a857cc33f44985222d2e698efd650b3", "author_url": null, "date": "Jun 24, 2008", "message": "Besides branch/merge another topic I find very appropriate for a beginner in CS is the concept of Regular Expressions. I think it has everything a young programmer needs to understand and aught to be CS 101, Chapter 1."}, {"author_name": "Roland Tepp", "gravatar_hash": "0f83be58c6c968f558b2cfda93183f28", "author_url": null, "date": "Jun 27, 2008", "message": "Hi Jeff &amp; Joel\n--------------\n\nI am just going to comment here on some points (i know You'd prefer audio feedback, but for various reasons it is not possible atm).\n\nOn the topic of source controls:\n  I have not really used that as heavily, but from what I witnessed, I was also rather impressed by AccuRev source control system. It is a commercial source control system that is heavily optimized for massive branching and merging just as modern distributed scm's but it is still a \"traditional\" client-server type system, so the mental leap from using CVS is not all that huge.\n\nAbout using links for actions:\n  I would recommend investing some time in learning the RESTful architectural model (specially useful in the web development context) and understanding the main premise that everything on your site is a \"resource\" uniquely identified by it's URL. You use this URL to access that resource and you use various HTTP methods (GET, POST, PUT and DELETE) for acting upon these resources:\n    GET: Reads the resource and is guaranteed to be nondestructive\n    PUT: Updates the resource\n    POST: Creates new resource\n    DELETE: Deletes the resource\n  \n  This way you can easily avoid the issue of \"destuctive urls\" being accidentally triggered by web crawlers, etc. without needing to resort to some artificial means of protection (e.g. robots.txt or some form of agent string parsing)\n\nAs a response to Abdu on searchability:\n  Make sure that your site is thoroughly searchable on the google first and if you must provide your own powerful customizable search, learn from Google - just give me the search box and if you offer some advanced stuff, allow me to specify all that on this search box in a text form instead of taking me to that unwieldy starship style searching control panel thingie...\n  \n  Also - if you have your own site wide search facility, make sure you expose it as an OpenSearch feed, so that not only big search engines can tap into that but also my firefox and/or IE could install your site as a search plug-in.\n  \n  Another good idea (while we're at it) would be to allow me (as a registered user) to save my searches for later reuse and even provide an RSS feed to the search results. So if I am interested in certain topics, I could just set up a search, subscribe to the results of that search  and get notified as soon as someone post a question or an answer that pops up on that search.\n\nThanks for the podcasts and the blog and kep up the good work and I hope the stack overflow is everything You and I hope it will be :)"}, {"author_name": "Ouch", "gravatar_hash": "4c361faa028a2f381e530c28ff58bff2", "author_url": null, "date": "Jul 03, 2008", "message": "Good podcast... but I have to agree that there needs to be a lot less interruption going on.  If need be, you may even have to go to the extent where if one person has their mic on, the other persons' gets cut off... because at many points, it does become almost incoherent due to the interrupting."}, {"author_name": "dave", "gravatar_hash": "633369ab802af30e8d226d61664969f2", "author_url": "http://typemock.com", "date": "Jun 27, 2010", "message": "well,thanks a lot! \nits a nice pocast though"}]}