{"response": [{"author_name": "Vincent", "gravatar_hash": "f1a9eb72d4b80a6cbd58611438d2fbdf", "author_url": "http://genezys.net", "date": "Jun 24, 2008", "message": "&gt; some_file_name is interpreted as some<em>file</em>name. It even works across word boundaries: file_one and file_two becomes file<em>one and file</em> two.\n\nRuby developers will be very frustated at that one... Even if code is not parsed, you often refer to a variable name or a method name inside your text.\n\nLike \"Why some_method is not called on my_var?\"\n\nI know that you are providing a fallback but that means that Ruby users won't have a first-class experience on Stack Overflow."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 25, 2008", "message": "Hi Vincent,\n\nJohn put a workaround in the WMD control:\n\n> but in WMD I do a little preprocessing to hack the idiocy away: basically I just backslash-escape any underscores or asterisks that might trigger it"}, {"author_name": "John Fraser", "gravatar_hash": "a6bfbfb00a776dcfb59ab291cc79173c", "author_url": "http://wmd-editor.com/", "date": "Jun 25, 2008", "message": "I went back and looked for that \"edge case\" I mentioned, and it turns out my pre-pass hack is completely broken: intra-word underscores don't work at all in code blocks or spans.  Yikes!  Good thing most of my users right now are knitters.  I'll get this fixed before StackOverflow goes live.\n\nAlso, Jeff bowdlerized my expletive infixation.  Unfrickingbelievable."}, {"author_name": "Graham Stewart", "gravatar_hash": "f61876d1f1d2de794259119cdd596316", "author_url": null, "date": "Jun 25, 2008", "message": "Hi Jeff, \nOf course you'd get none of these problems if you ditched Markdown and went for a simple WYSIWYG interface which would require minimum thought for your users and wouldn't produce results that were \"surprising to humans\".\nJust a thought.\nGraham"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 25, 2008", "message": "Graham -- these are the edge cases.\n\nHave you tried the editor? It's really quite nice. Try pasting in the sample in the post and playing with it.\n\nhttp://wmd-editor.com/examples/splitscreen"}, {"author_name": "Konrad", "gravatar_hash": "f9401202ab73e624cc82800b0fff1489", "author_url": "http://madrat.net/", "date": "Jun 25, 2008", "message": "Hi Jeff,\n\nI really like the WMD editor; however, can you please, *please* implement something like [SmartyPants][1] on top of it? ASCII typography is simply horrible and a Markdown processor should be able to transform punctuation on the fly.\n\nAlso, and more importantly, it's the [6th commandment][2].\n\n[1]: http://daringfireball.net/projects/smartypants/\n[2]: http://www.businessweek.com/innovate/content/jun2008/id20080623_750025_page_2.htm"}, {"author_name": "Martin Wallace", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Jun 25, 2008", "message": "Why re-invent the wheel though?  WMD sounds like a great idea to me, rather than yet another WYSIWYG interface, with its own foibles and bugs."}, {"author_name": "Graham Stewart", "gravatar_hash": "f61876d1f1d2de794259119cdd596316", "author_url": null, "date": "Jun 25, 2008", "message": "Yeah I had a play with it and it works well enough. But on top of the issues you describe here, I still have reservations about it (which I raised in the original thread but bear repeating here):\n\n- it is non-intuitive. e.g. an image is ![alt text][3] \n(Yes you can use the toolbar instead of writing Markdown directly, but then how is that any better than a proper WISYWYG toolbar). Adding your own hacks to it only makes it worse because now it isn't even the same Markdown that people may have used on other sites.\n\n- it doesn't give adequate support for code blocks as it doesn't have a way to specify the language used in the block. Which means if you want to apply syntax-colouring then you'll have to use something like highlight.js to heuristically guess what language it is which frequently gets it wrong on shorter code fragments and doesn't support C or C#.\n\nIn other words Markdown fails in two key aspects: it doesn't provide all the required functionality and it fails the \"Don't Make Me Think\" test.\n\nI don't mean to rag on you Jeff. I'm keen that stackoverflow is a success and I hope this qualifies as \"constructive\" criticism.\n\nGraham"}, {"author_name": "McDowell", "gravatar_hash": "cf02ac6dae1a5494913e0c0c9d9956d7", "author_url": null, "date": "Jun 25, 2008", "message": "@Konrad\nMy least favourite word processor feature must be automatic character replacement. It is generally the first thing that has me reaching for the options menu. I think it would be an especially bad idea in a programmer's forum where precision is vital.\n\"String\" != “String”\n\n\n\nI had wondered if splitting posts into different edit blocks would be a good approach (you separate different content types - text, C#, C++ - into distinct units - a bit like multipart MIME). This appeals to my sense of neatness, but I expect it would needlessly complicate the user interface.\n\nIt is inevitable that the chosen markup will throw up problems like the ones described in the main post. There is also a risk that there are unforeseen issues that will only become apparent in time. This includes usability problems, users unaccountably just hating it and someone coming up with a brilliantly different approach that solves all the known problems. Stackoverflow probably needs a strategy for changing markups should it become necessary.\n\nI would suggest transforming the input data to a form that is neutral to the presentation layer (maybe XML!) and use markups and other tools as view-level editors for manipulating it, but there are probably too many practical problems with this approach."}, {"author_name": "McDowell", "gravatar_hash": "cf02ac6dae1a5494913e0c0c9d9956d7", "author_url": null, "date": "Jun 25, 2008", "message": "Gah! Software automagicked my quote marks. I should have written:\n\\U+0022String\\U+0022 != \\U+201CString\\U+201D"}, {"author_name": "Syd", "gravatar_hash": "014c459819f16343df5da52a26fcabb6", "author_url": "http://www.fairgroundtown.co.uk/", "date": "Jun 25, 2008", "message": "Graham Stewart is right - I was listening to a podcast today, and the guy (who I totally respect, by the way) was saying that sometimes a better User Interface can help to abstract-away certain kinds of awkward control mechanisms. He was referring explicitly to source code control systems, but it applies equally to this case I think. Now, if only I could remember what the podcast was, I'd point you in the right direction.\n\n;)"}, {"author_name": "dubayou", "gravatar_hash": "aa2bff29aff392df8beb76856bfd1702", "author_url": "http://dubayou.com/", "date": "Jun 25, 2008", "message": "I knew you would regret using markdown, ... re-inventing the wheel.\n\nI hate In mark down you specify the links at the bottom, i wanna just flow.\n\nI will only say, i think the **best** web textarea form is Wikipedia's format.  I think it produces the most structured and beautiful layout.\n\n-W\n\nPS. Can i get a beta badge or whatever."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Jun 25, 2008", "message": "If you run a Developer site (like Stackoverflow.com), exchanging such an important character as \" with those \"cute\" curly double quotes is a great idea - if you want constant bashing from your users :-)\n\nAs for the other options: Jeff ran an opinion \"survey\" through his blog a while ago, with the result that Markdown is the best compromise.\n\nWikipedias Markup is nice, but not without flaws, as some stuff requires \"thinking outside of the box\", so to speak. Sure, stackoverflow should have more tech-savvy users than other pages, but getting people used to the Mediawiki Syntax is still a bit of work, and WMD is simply MUCH more accessible.\nActually, i think Mediawiki has one of the worst syntaxes, as you have to mix HTML and Wiki-Markup. It's powerful, but can get really messy."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": null, "date": "Jun 25, 2008", "message": "Jeff,\n\nIs StackOverflow going to have the real-time, split-screen preview feature as is shown in the WMD Advanced Demo?\n\nhttp://wmd-editor.com/examples/splitscreen\n\nI think it would be a great help."}, {"author_name": "Naim Gozere", "gravatar_hash": "4acd21acc7b1f605466f2f48189a7177", "author_url": null, "date": "Jun 25, 2008", "message": "This is why I recommended the use of reStructeredText[1] in your initial post about choosing a markup language for Stackoverflow. Although Markdown is simple, it's really not designed for the kind of complex formatting that's required for discussing programming.\n\n[1] http://docutils.sourceforge.net/rst.html"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 25, 2008", "message": "> I hate In mark down you specify the links at the bottom, i wanna just flow.\n\nYou can specify inline links in Markdown:\n\nhttp://daringfireball.net/projects/markdown/syntax#link\n\nThis is [an example](http://example.com/ \"Title\") inline link.\n\nSee my [About](/about/) page for details."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 25, 2008", "message": "> Although Markdown is simple, it’s really not designed for the kind of complex formatting that’s required for discussing programming.\n\nWhy doesn't &lt;pre&gt; or the 4-space indent and full escaping of a code block work? The WMD editor has a key (ctrl+k) and corresponding toolbar button to automatically indent/unindent codeblocks as well."}, {"author_name": "Naim Gozere", "gravatar_hash": "4acd21acc7b1f605466f2f48189a7177", "author_url": null, "date": "Jun 25, 2008", "message": "&gt; Why doesn’t  or the 4-space indent and full escaping of a code block work? The WMD editor has a key (ctrl+k) and corresponding toolbar button to automatically indent/unindent codeblocks as well.\n\nI do not mean the process of embedding code, but of *describing* code. From Fraser's e-mail:\n\n&gt; I think this is a symptom of Markdown’s being designed for blog posts. You can paste in big chunks of foreign HTML verbatim without having to double-check them, but it’s pretty much impossible to write whole pages in Markdown.\n\nIf I've understood correctly what you want Stackoverflow to become, it's not so much a forum of transient posts, but a wiki-like archive of solutions. This seems to indicate that it will be almost entirely \"whole pages in Markdown\".\n\nThe normal solution for Markdown would be to embed this complex markup as HTML, but this is a bad idea for user-submitted markup and your sanitizer rightfully strips it out. A short list of features Markup lacks:\n\n* Tables. Useful for anything from truth tables to descriptions of allowed parameters. Without these built-in, the likely workaround is fragile ASCII-art in &lt;pre&gt; tags.\n\n* Definition lists. Often used for describing new programming terms, or for documenting function parameters. Can probably be simulated using an unordered list, but that is annoying to type and style.\n\n* Citations. If I want to link to a journal to back up a point, it's nice to have built-in support without having to jerry-rig them using inline links and anchor IDs.\n\n* Section links. If a page has multiple sections, I don't see any way to link from one to another using Markdown."}, {"author_name": "Sergio del Amo", "gravatar_hash": "30995fcc876f40073628b63ea5cfab59", "author_url": "http://moonsunweb.com", "date": "Jun 26, 2008", "message": "Hello Jeff, \nI assume that you store HTML (sanitized WMD output) in your database. Next time someone edits a post the WMD editor will be populated with HTML instead of markdown. My opinion is that Html is not really human readable (at least for not technical audiences) as Markdown is and users will be confused to have their post transformed in a different markup language. I guess you will agree with me in that point.\n\nAre you using any kind of filter to transform the database HTML in markdown again? Does WMD editor implements any related functionality?"}, {"author_name": "Mike Tomasello", "gravatar_hash": "295bccb34897e178de5c5c90442baaeb", "author_url": null, "date": "Jun 26, 2008", "message": "On typographical tools like double/triple-hyphen to dash conversion and so-called 'smart quotes', I don't see that as a huge problem because something like SmartyPants doesn't fiddle with quotes or other symbols inside code blocks or in-line code.\n\nAlso, from the post:\n\n&gt; I think this is a symptom of Markdown’s being designed for blog posts. You can paste in big chunks of foreign HTML verbatim without having to double-check them, but it’s pretty much impossible to write whole pages in Markdown. Again Gruber’s not interested; dunno about Fortin.\n\nFortin's Markdown Extra supports this to an extent, with . Not the cleanest solution, but better than nothing.\n\n@dubayou: I couldn't disagree more. Mediawiki syntax is not powerful (at least, not without Wikipedia-level specific configuration), is confusing, and is certainly not immediately readable.\n\n@Naim: Not sure if Showdown supports Markdown Extra's syntax, but if it does (and most Markdown tools seem to) then support for tables and definition lists is there. Not sure about the others (not even sure what you are describing with sections - links can be made to page 'fragments' [page.html#section] in any of these languages, even BBCode)."}, {"author_name": "Mike Tomasello", "gravatar_hash": "295bccb34897e178de5c5c90442baaeb", "author_url": null, "date": "Jun 26, 2008", "message": "Ugh, with above fourth paragraph should be \"Fortin's Markdown Extra supports this to an extent, with &lt;div markdown=\"1\"&gt;...\""}, {"author_name": "Konrad", "gravatar_hash": "f9401202ab73e624cc82800b0fff1489", "author_url": "http://madrat.net/", "date": "Jun 27, 2008", "message": "@McDowell, Mark,\n\nyou've got a point there. However, I still believe that this only applies to certain areas of a text – the code. The continuous text still benefits from such a face lifting. Furthemore, I believe it's pretty straightforward to single out code parts and apply Smartypants to the rest. Actually, isn't that exactly what the original Smartypants implementation does? (Just looked it up: yes, it is.)\n\nDo you believe this distinction could pose a problem for a tech-savvy user base? I believe that it shouldn't."}, {"author_name": "commenter", "gravatar_hash": "c5fc228ecccf01c54c379c3b68f30eaf", "author_url": null, "date": "Jul 11, 2008", "message": "So, will there be a wysiwyg editor, or will it just be a textbox containing raw markdown?"}, {"author_name": "Billifer", "gravatar_hash": "a36a541c4ab842f6e094faaeee422490", "author_url": "http://paxoo.com", "date": "Jul 25, 2008", "message": "&gt; I think this is a symptom of Markdown’s being designed for blog posts. You can paste in big chunks of foreign HTML verbatim without having to double-check them, but it’s pretty much impossible to write whole pages in Markdown. Again Gruber’s not interested; dunno about Fortin.\n\nDidn't read through all the comments, so I don't know whether anyone else commented on this, but Fortin's [Markdown Extra](http://michelf.com/projects/php-markdown/extra/) **does** allow Markdown inside block elements:\n\n&gt; PHP Markdown Extra gives you a way to put Markdown-formatted text inside any block-level tag. You do this by adding a `markdown` attribute to the tag with the value `1` — which gives `markdown=\"1\"` — like this:  \n`\n\nThis is *true* markdown text.\n`\n\nMarkdown Extra also addresses some of the other topics you discussed above."}]}