{"response": [{"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.billthelizard.com", "date": "Mar 25, 2015", "message": "Just don't show that a question is closed if users aren't logged in. Users coming from Google who find an answer shouldn't care if a question is closed or not anyway. The answer is still there."}, {"author_name": "Bill The Blizard", "gravatar_hash": "8a8c63430e7de6f0352b58bc9c62e8ee", "author_url": null, "date": "Mar 26, 2015", "message": "Users who come from Google might want to answer the question, or share some more info on it. What if the question doesn't show closed, but they still go through the trouble of making an account?"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.billthelizard.com", "date": "Mar 26, 2015", "message": "Then once they make an account and log in, they'll see that the question is closed and why."}, {"author_name": "roger", "gravatar_hash": "9887130ab70f6e66b50f2c5e19272c67", "author_url": "http://betterlogic.com/roger", "date": "Mar 26, 2015", "message": "WRT to that blog post, I wish SO would just post \"no soup for you\" type questions (or controversial, etc.) to some other site, like \"flames.stackexchange.com\" then let the answering people debate it out, best answer will go to the top [like quora].  Why \"only\" allow for one type of answer [subjective] when there's a huge community that could help you determine, for instance, \"what is better, ruby or python\"..."}, {"author_name": "J.B.", "gravatar_hash": "45a4b90e97e99fd50f2d20a5845fec94", "author_url": "http://blog.jbchurchill.com", "date": "Mar 26, 2015", "message": "I agree with the Blizard and disagree with the Lizard. Even though I already have an account, I'd prefer to know if the question is closed before I even consider logging in. I'll thank you not to waste my time. \"If\" a user doesn't care, they can ignore it but they may care very much, so your initial statement \"[they] shouldn't care\" is untrue."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": "http://stackoverflow.com/users/811", "date": "Mar 26, 2015", "message": "On that note, it's worth considering how we display the status of <i>protected</i> questions (which cannot be answered by new users, but are still fair game once you have a token amount of participation on the site): if you can't answer, the banner sits at the <b>bottom</b> of the page, where the answer form would ordinarily be displayed.\n\nThe end result is that most readers don't need to be aware of the status because it doesn't affect them and they can't change it anyway. We could probably do something similar for closed questions: if you can't vote to reopen, indicate the status in place of the answer form rather than between the question and the answers.\n\nThis would be double-good if we also adopted the practice of displaying duplicate links *as* answers: something like 40% of <i>visible</i> closed questions are duplicates, so the chances of someone seeing a closed question are much higher for these than for other forms of closure."}, {"author_name": "Andrei", "gravatar_hash": "740ce3447388b58526056aa6a6f026b2", "author_url": null, "date": "Mar 27, 2015", "message": "What music is playing at the end?"}, {"author_name": "Meftun MEDE", "gravatar_hash": "18105970020eeeeaf494350e1c4076bf", "author_url": "http://www.meftunmede.com", "date": "Apr 02, 2015", "message": "Great work. I wish you continued your success."}, {"author_name": "Kinnaristeel", "gravatar_hash": "72f3d377c70bab888fc6dab541ed9e07", "author_url": "http://www.kinnaristeel.com/special-metals/monel-products/monel-pipes/", "date": "Apr 02, 2015", "message": "very nice"}, {"author_name": "Sweta", "gravatar_hash": "dc57aa73baada992e6c2b443a963af8a", "author_url": "http://eyeshiv.com/", "date": "Apr 07, 2015", "message": "Great, Congratulation..."}]}