{"response": [{"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Dec 15, 2009", "message": "...obligatory comment about tumbleweed, disciplined, taxonomist, and peer pressure badges..."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Dec 15, 2009", "message": "Will people think less of me if I make my own sash and badges?"}, {"author_name": "Entity", "gravatar_hash": "e326f7efc603a1881cd645d22a663de2", "author_url": null, "date": "Dec 15, 2009", "message": "No probably more of you Bill, can I earn your badges?"}, {"author_name": "Johannes Rössel", "gravatar_hash": "d54ed51c0f03cb461741c3ec77a837b2", "author_url": "http://hypftier.de", "date": "Dec 15, 2009", "message": "Interestingly, the percentage of unanswered questions actually *is* some kind of that \"troll\" cap. For a different purpose but still, it's something that's prominently displayed under the user name for each question they ask. And you have to admit that the red is easier to spot than the gray or green for the actually *positive* behavior.\n\nStill, I agree that the badges should stick to their original purpose. But getting banned for some time with rep reduced to 1 seems to be an accomplishment for some people too. We see a few of those."}, {"author_name": "Boofus McGoofus", "gravatar_hash": "4e9780a76d37ea5676f3f22eac74c81f", "author_url": null, "date": "Dec 16, 2009", "message": "It's worth noting that the fourth comment on the SvN post about the troll cap is:\n\n   You all suck!\n   That cap looks cool, I want one :-)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 16, 2009", "message": "> obligatory comment about tumbleweed, disciplined, taxonomist, and peer pressure badges…\n\nWell, let's see:\n\nPeer Pressure -- encourages users to delete posts that others believe contain bad information (that is, they have been downvoted to a total score of -3)\n\nDisciplined -- encourages users to remove duplicate / obsolete posts, even if they've been upvoted 3 times\n\nTumbleweed -- a consolation prize for asking a question that gets almost no attention (no answers, no comments, low pageviews for a week). It says \"sorry, we failed you -- but keep trying\"\n\nTaxonomist -- rewards creating useful tags that get used in 50 questions"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Dec 16, 2009", "message": "I know those badges have all been discussed on meta, and i'm not expecting you to change your mind soon. the comment was mostly in jest (since i know you have deemed taxonomist-gaming a suplexable topic). but to quickly play devil's advocate-\n\npeer pressure- may encourage a user to write a bad post just so they can delete it after it hits -3. (i know i did.) but the user only gets the badge once so i guess it's not that big a deal.\n\ndisciplined- may encourage a user to delete a good post just to get the badge. (though, again, they only get it once).\n\ntumbleweed- honestly i don't know how i would even write a post so that it would intentionally get no attention. i guess if enough people tried to get this it would flood the site with boring questions maybe.\n\ntaxonomist- rewards early users for what is natural at the beginning of the site (kind of a second beta badge), frustrates late-comers, and in very rare cases tempts people into gaming it. (hey it totally happened that one time!)\n\nthat is all. :)"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Dec 16, 2009", "message": "I don't think the percentage of unanswered questions is really a troll badge. Although, it would be nice to turn it off; it looks odd to me. Nevertheless, I've seen users that have low accept percentages and after looking at their questions, there really were no good answers. So, I take that stat with a grain of salt. Personally, I'll answer questions for someone even with 0%; that's not a big thing to me. The only time I'll just turn down answering a question is if it's worded so poorly that I suspect it'll be deleted anyway."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 16, 2009", "message": "Well, Kip, the point is that an *enlightened* user will see a Badge like:\n\n[Disciplined] -- Deleted own post with score of 3 or higher \n\nand think to themselves: \"Hmmmmmmm. Why might I want to delete my own posts, even if they have 3 votes? And why would Stack Overflow encourage / teach me to do this?\"\n\nAnd from there good things happen due to the educational nature of the badge.\n\nHowever, if we're starting with non-enlightened or evil users, then they're just a dead loss from the get-go. Anything can be abused by the bad apples, so that's kind of a universal constant in the galaxy.\n\nBad seeds go to high school and college too, doesn't mean they ever learn anything. Should we cancel high school and college as a result? :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 16, 2009", "message": "> So, I take that stat with a grain of salt\n\nwhich is exactly the intention: see the stat and apply your own judgment.\n\nThe *system* does not provide a judgment, just the raw data. What you do with it, is up to you."}]}