{"response": [{"author_name": "Cathy", "gravatar_hash": "87777b725b2d0f493f6ddda81122eea0", "author_url": null, "date": "Dec 02, 2009", "message": "I would like to be able to see some info on the employers. Right now I have no way to know if any of them are located in my area, what industries are represented, how many positions they are hiring for, how big they are, etc. I did sign-up and pay the introductory price a couple of months ago, but I feel like it's completely blind, because for all I know, every employer you have is hiring in the Northeast while I am in the Southwest and not willing to relocate. I'm trying it out as an experiment, but I would definitely not pay to renew without having a lot more info about the employers who are using the service."}, {"author_name": "Cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Dec 02, 2009", "message": "Wasn't the plan for it to be free to employers? I remember reading that it had a cost to job seekers to avoid the \"free CV ghetto\" syndromee.\n\nI also know that employers pay significant commissions to recruitment agents that can easily dwarf $5,000 for a year (often 10-15% of someone's annual salary as a commission, at least in the UK and Australia) but still $5,000 is a lot to pay to use a basically unproven Website for a year. I can't help but think that'll hurt uptake.\n\nAny sort of website like this lives or dies on achieving critical mass. It'll be interesting to see if it actually pans out.\n\nAlso, Joel once stated that for his job board there was no anonymity for employers. It seems that careers does have that (as I've seen no list or no plan to introduce one).\n\nAll in all, the whole thing is a little strange..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 02, 2009", "message": "> Wasn’t the plan for it to be free to employers\n\nNo, never. Quite the opposite, in fact.\n\n> there was no anonymity for employers\n\nOnce they contact you, there is no anonymity -- full info about the company is revealed in their request to you.\n\n> feel like it’s completely blind, because for all I know, every employer you have is hiring in the Northeast while I am in the Southwest and not willing to relocate\n\nWhat kind of stats are you seeing on your stats page? This tells you how many search result pages (SERPs) you've appeared in, for example.. along with how many messages you've sent and received. If there are more stats you'd like to see, ask on meta under the [careers] tag.\n\nThat said, it's still quite early in the big scheme of things. As I mentioned in the post body, November and December are not exactly big hiring months at any company I know of ... but come Jan/Feb/Mar, there should be more purposeful activity."}, {"author_name": "Donal", "gravatar_hash": "8b2d39a59a961ef26440e9c1453d1939", "author_url": null, "date": "Dec 02, 2009", "message": "@Jeff - it seems fairly clear from his comment that what Cletus (and I) would like to see is *identifying* statistics about the registered employers. All the stats page currently shows is a bunch of numbers, which tells me nothing about *which* employers are using the site.\n\nIt seems very unfair that the employers can see your entire CV, and (optionally) all the info in your SO account, whereas the employees can't even see the employer's company name."}, {"author_name": "Cathy", "gravatar_hash": "3ce6361b4d1956c94b2d72a1dc788c15", "author_url": null, "date": "Dec 03, 2009", "message": "Man, as someone who's trying to hire quite a few engineers over the next 2 months, I was really excited about this launching. It's already my standard process to ask for a candidates Stack Overflow profile in interviews. But we're a seed funded startup and there's no way we can afford to pay these prices, particularly given that (a) we have no idea of the quality of results we'll get, and (b) we *definitely* can't afford to bulk pay for better value for money across the year. \n\nAny chance of a special introductory rate for newcomers to get a sense of the system?"}, {"author_name": "Cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": "http://www.cforcoding.com", "date": "Dec 03, 2009", "message": "@Cathy: you've summed up the thrust of my point.\n\nSee http://meta.stackoverflow.com/questions/31635/offer-a-special-discounted-startup-rate-on-stack-overflow-careers/31637#31637\n\nBasically the biggest problem is the system is *unproven* and it's charging like it has a proven track record.\n\nNow Joel has said if people don't get the results they're expecting they can ask for their money back. Joel (through FogBugz) *has* always been good this way. Thing is to a manager who may need to approve such payments and is unaware of Joel there is a *big* difference money you don't have to pay, money you only have to pay for results and money you have to pay upfront that you *might* get back if it doesn't work out.\n\nCAPTCHA: pinking abated"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Dec 03, 2009", "message": "I know it's early but it would be nice to have some more info than just \"999 employers, 3 search hits\".\n\nWhere are the employers - are they all NY banks?\n\nWhat were those search hits - were they for 'software' or for 'OpenGL games developer'"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 03, 2009", "message": "If you're concerned about the \"I <i>absolutely must</i> know who the employers are!\" angle, please read Joel's response on the topic:\n\nhttp://meta.stackoverflow.com/questions/31285/can-we-see-the-count-of-relevant-employers-on-our-careers-page/31673#31673"}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Dec 03, 2009", "message": "Jeff,  That's interesting but there is no reason given WHY you both think that Joel's method #1 and method #2 are mutually exclusive.  They are not.  Why hide the employer names?  It is especially frustrating to people when they have PAID money to be part of the process, but the MAJOR piece of information they/we really want is artificially hidden."}, {"author_name": "Liam", "gravatar_hash": "5f4211c9cd3f1fa9b823dd1b89c2090e", "author_url": "http://instantdevelopment.blogspot.com", "date": "Dec 06, 2009", "message": "Tim\nI think that if you ponder a bit harder you'll see why a compromise between #1 and #2 is not desirable.\n\nIf candidates know the name of the employer that is interested in their CV they are going to immediately contact the employer and seek to gain a job. This takes the power away from the employer, who is paying the larger sum of money to (presumably) anonymously filter a database of CVs without having all the noise of a rush of unsolicited CVs. This would harm employer uptake of the service.\n\nAs mgb points out there may be a compromise of information where the candidate could receive a general statistic of which geographical area or business domain their CV is generating interest in. Maybe that would satisfy the concern that there is no value in the candidate paying money?"}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Dec 08, 2009", "message": "@Liam\n\nI've already pondered it quite a bit.  If the employers don't wish to be contacted outside of the channel then they can say that.  \n\nDon't you see that this is contradictory to Joel's rant about headhunters who don't divulge company names - now HE is doing THE SAME THING."}]}