{"response": [{"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Dec 19, 2009", "message": "Nice idea!"}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Dec 19, 2009", "message": "Thank you sir, on behalf of the media browser project!"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Dec 19, 2009", "message": "speaking of advertising, last week i went through the top 10 or 15 answers on the \"what non-programming books should all programmers read\" and added links amazon (they mostly pointed to wikipedia before that). i expect a 10% commission. :)"}, {"author_name": "Daniel Sobral", "gravatar_hash": "6d43da5df0e52fc31c55e6a227bb23f4", "author_url": "http://dcsobral.blogspot.com", "date": "Dec 19, 2009", "message": "The following wasn't made clear enough in this blog post. Considering the ads up there already, I think it must be made more clear:\n\n\"It must be an advertisement soliciting the participation and contribution of programmers writing actual source code.\"\n\nI have sent information about this opportunity to three projects I have a fondness for, and reading again the first two I sent, I didn't make it clear either."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": "http://softhardsoft.com", "date": "Dec 19, 2009", "message": "This has got to be one of the greatest ideas I've ever heard. It is so completely in line with SO's mission of giving back to the dev community. I love it!"}, {"author_name": "secretGeek", "gravatar_hash": "36f79355a0f99b6b033e479fcfffa51f", "author_url": "http://secretgeek.net", "date": "Dec 20, 2009", "message": "This is brilliant. Very nice."}, {"author_name": "Stephen Harrison", "gravatar_hash": "921d2427eb85ade7a28015b92ebf388e", "author_url": "http://www.AnalysisUK.com", "date": "Dec 20, 2009", "message": "What a fantastic idea! A great way to back and promote open source projects."}, {"author_name": "dbkk101", "gravatar_hash": "8c4f16584d8680c3b31d1c4255ea7a6e", "author_url": null, "date": "Dec 20, 2009", "message": "Great idea.\n\nIt would be useful to have some visual way of differentiating open source ads from commercial ones (e.g. standard small icon). Otherwise, many people would ignore them, having learned to be blind to ads."}, {"author_name": "victor", "gravatar_hash": "d340af7f7a66c61a3c9149e7fc008aa8", "author_url": "http://carotena.net", "date": "Dec 21, 2009", "message": "Someone get the word to the VLC guys. They are in need of mac developers"}, {"author_name": "Nathan", "gravatar_hash": "ec2b04ac1bad14fea8244a78ef0f2133", "author_url": null, "date": "Dec 21, 2009", "message": "@dbkk101,\n\nWhat you're proposing is a visual cue for user's to ignore the ad's of paying clients and take note of non-paid ad's.\n\nThis doesn't sound like a good business idea."}, {"author_name": "John Fiala", "gravatar_hash": "0ea7bb11e90d00eee00f6c8863f9f654", "author_url": "http://www.jcfiala.net/", "date": "Dec 21, 2009", "message": "It's a neat idea... but I can't take part.  I don't have any reputation on meta, even though I've got a pile on stackoverflow, so I can't up-vote things that seem interesting...\n\nAnd, y'know, this is about the only thing I want to do on meta.stackoverflow.com, so I'm not really interested in digging around to find something to answer."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 21, 2009", "message": "John, associate your accounts to get +100 rep. This requires +200 rep on at least one trilogy site.\n\nThis can be done via the \"accounts\" tab on your user profile.\n\n(The site tells you to do this, when you create a new account there. Also, you can un-associate and re-associate if you didn't have +200 at the time you associated, or if your association is very old.)"}, {"author_name": "brandon", "gravatar_hash": "6a5827be324a1cd2a69118abdedf7eff", "author_url": "http://decise.ca/", "date": "Dec 21, 2009", "message": "This is an excellent idea.\n\nThe SO advertising strategy doesn't often get mention, but the fact that you have taken a hard line against in-your-face, Flash-based ads and popovers really is one reason why I find StackOverflow so great to use. As someone who is on SO with some regularity, I notice and will click on the odd ad that I see, simply because the ads here are nicely context driven, they interest me, and are always placed in the most reasonable position possible. I can't describe the level of irritation I experience from animated ads, or worse, the huge overlays with the barely legible \\close\\ text in whatever is supposed to be the upper-right corner of the ad.\n\nKeep up the good work..!"}, {"author_name": "james", "gravatar_hash": "be98784e840878bb32cc1ecd1e9a64c6", "author_url": null, "date": "Aug 19, 2012", "message": "Greetings To You..\nI am Mr James burg of the EASY FINANCIAL ON-LINE COMPANY in conjuction with FIRST BANK as part of their\nwelfare packages, they offering a floating loan scheme at 3% interest rate\nwithout any collateral security. This is to help individuals reach\ntheir financial objectives.Our commitment to client service and our\ninnovative approach to problem solving has been our ultimate goal.\nWe Are Certified To Offer The Following Kinds Of Loan\n* Personal Loan (Unsecured)\n* Business Loan (Unsecured)\n* Debt Consolidation Loan\n* Improve your home\n \nAll replies should be forwarded to the Company's\neasyfinancialonline@gmail.com As soon as we receive the Application, Then we will process your Loan\nApplication For Approval."}]}