{"response": [{"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Dec 25, 2009", "message": "The comment Joel made about telling the VCs who call him about \" not taking deals over the transom\" was hilarious.  Nice!  I wsa laughing my a$#% off over that for a while."}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Dec 26, 2009", "message": "400 VMs!!!"}, {"author_name": "Kevin Stewart", "gravatar_hash": "2d24ac395a9afa64daa8a7fd79cc13e1", "author_url": "http://working-code.com", "date": "Dec 27, 2009", "message": "In the podcast, David said \"You can't write a (search) spider in Ruby.\" Joel immediately predicted that he would start getting emails from all the Ruby fanboys. While I don't think I fall in that category, I did recall reading this post:\n\nhttp://blog.saush.com/2009/03/17/write-an-internet-search-engine-with-200-lines-of-ruby-code/\n\nSo, I don't think the issue is that you CAN'T write a spider in Ruby. It's more like some people will and some people won't. Depends on your situation (just like everything else, I suppose.)"}, {"author_name": "Brandon", "gravatar_hash": "628e4da24367a0e53891218aeef58a14", "author_url": null, "date": "Dec 27, 2009", "message": "Tim, that made me laugh out loud, too."}, {"author_name": "Jörg W Mittag", "gravatar_hash": "0bfe384bf9dce3cc1fda1bb0ff5f4e0e", "author_url": null, "date": "Dec 28, 2009", "message": "Re: Backup vs. Restore and the little things that you forget.\n\nThe weirdest thing I heard about was a company that had done literally everything to make sure that they were safe: they had nightly, weekly, monthly and quarterly rotating backups with triple redundancy. They had an autonomous tape robot. In case that the machine wouldn't boot, there was a boot block and a little operating system written to the beginning of the first tape, so that you could just plop the tape into a completely blank machine and it would boot and restore all by itself with no human intervention at all. Of course, they made sure that the SCSI HBAs they used had a BIOS so that you could boot from them. And they also made sure that the PC's BIOS supported booting from SCSI.\n\n... Except from a tape drive."}, {"author_name": "David Rabinowitz", "gravatar_hash": "dfeaafde0814f99633b2618a3ff36327", "author_url": "http://www.davidrabinowitz.com/", "date": "Dec 29, 2009", "message": "Jeff was taking about wordpress backup - I've set the WP S3 backup plugin (http://wordpress.org/extend/plugins/wp-s3-backups/, or from the admin console) it backs up all what I considered needed:\n* Config file\n* Database dump\n* Themes folder\n* Plugins folder\n* Uploaded content \n\nAll is zipped and uploaded to Amazon S3.\n\nI must admit I haven't tried to restore yet..."}, {"author_name": "Scott W.", "gravatar_hash": "7a03f436e9458527368e5eaa45f85d40", "author_url": "http://moms4mom.com/", "date": "Jan 01, 2010", "message": "Interesting discussion of promoting a StackExchange site, and Joel's numbers of 1 in 60 lines up very closely with our own experience on moms4mom, that in the early stages, almost exactly 1.5% of the visitors to moms4mom actually ask or answer one question.  It's important to note, however, that of those 1.5%, a much smaller number actually become your core members who come back day after day.  In our experience, you need to think in the 60,000 range, not 6000.  This is easier to do once you have some pagerank."}, {"author_name": "Micah", "gravatar_hash": "d00446f06dc472fe0f88af617dba71a5", "author_url": null, "date": "Jan 04, 2010", "message": "\nI enjoyed the podcast, and like the doctype site, but it drives me crazy that they say that it's for designers. FRONT-END DEVELOPMENT IS NOT DESIGN. HTML and CSS are not DESIGN languages, which is the subject of almost all of the questions. Design is about composition, form, color, line, texture, flow, interaction, timing, feedback, etc. Not how those things are implemented in a browser.\n\nObviously, a lot of Web designers know something about how to implement their visual and UI ideas using HTML, CSS and Javascript -- heck, some designers know a helluvalot about implementation, but I wouldn't say it's an automatic requirement implied by the title \"Web Designer\". \n\nJust had to get that off my chest. Guess I should start a blog. :)\n"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Jan 05, 2010", "message": "I tend to use Google instead of calc for simple arithmetic too - and did before I joined Google, I hasten to add.\n\nI don't remember ever being CAPTCHA'd for that though, despite often doing quite a number of requests in one session."}, {"author_name": "Peter Eisentraut", "gravatar_hash": "91c59ba5a0ecc3520e135ce55b18d580", "author_url": "http://petereisentraut.blogspot.com/", "date": "Jan 07, 2010", "message": "At some point in this podcast it was apparently implied that RAID 1 is preferable over RAID 5 because the former is just mirroring the bits and that works the same with every controller.  While I don't know many controllers, I do know that some controllers (probably most?) add some metadata of their own to the bits, so if you controller dies you can't just take the disk and hook it up to the mainboard directly to recover the data. And if you can't get a new controller that is compatible with the bits on your disks and the rest of your environment (or you could, but not fast enough), then you're quite hosed."}]}