{"response": [{"author_name": "Tom", "gravatar_hash": "31e32ecb7309ad47e1ecdd34f4c26529", "author_url": "http://ritter.vg", "date": "Dec 03, 2009", "message": "\"Fog Creek does a lot of hiring every year.\"\n\nNo, I don't think they do.  Google and Microsoft does a lot of hiring every year, FogCreek does a lot of *interviewing* every year."}, {"author_name": "Steve", "gravatar_hash": "d607f119e8d6ce52f35aa24424a9c5a9", "author_url": null, "date": "Dec 03, 2009", "message": "Yes come to Hong Kong and Japan as well please and make it a Pacific Rim tour!"}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 03, 2009", "message": "Speaking of t-shirts, what happened to the planned Stack Overflow schwag?\n\nhttp://meta.stackoverflow.com/questions/tagged/merchandise"}, {"author_name": "Mike Sickler", "gravatar_hash": "69739fc4bc58863ff835f4e929694342", "author_url": null, "date": "Dec 03, 2009", "message": "Great podcast. \"Everyone thinks they're Sid Meier\"- I love it!\n\nI second the Japan request- sometime in March, please."}, {"author_name": "Timo Saikkonen", "gravatar_hash": "44337fde7be0227142984fed078fa567", "author_url": "http://theiterator.com", "date": "Dec 03, 2009", "message": "How about Singapore as well?"}, {"author_name": "Daniel Sobral", "gravatar_hash": "6d43da5df0e52fc31c55e6a227bb23f4", "author_url": "http://dcsobral.blogspot.com", "date": "Dec 04, 2009", "message": "I'm with people who have reached the conclusion that programming is a craft. As a craft, its results can be art -- take, for instance, the obfuscated code contests. Just yesterday, however, I found out that programming *practice* (the so-called programming katas) can be *performed* as art, as shown by Uncle Bob Martin:\n\nhttp://katas.softwarecraftsmanship.org/?p=71"}, {"author_name": "tim", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": "http://www.stackoverthrow.com", "date": "Dec 04, 2009", "message": "@Tom - That's funny (re: Fog Creek hiring)\n\nI also love the where'd you get that scar site.  Nice.  The internets thanks you."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Dec 04, 2009", "message": "Facebook is just a stupid site for people to post links and status updates, yet Twitter is worthy of SuperUser questions? Hint: http://developers.facebook.com/"}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Dec 04, 2009", "message": "Thank you Joel for the kind words about PHP/Perl development -- indeed I use a relatively small subset of the standard library to develop my own environment with my own aesthetics. For example, most of the old PHP libraries use plain functions which makes them easy to wrap in my own classes, standardize the naming style etc.\n\nC# is a relatively new language, so it's no wonder it's much cleaner at this point in time. But assuming it won't just die or gets abandoned by Microsoft (very unlikely) it has only two options: either things get changed and/or replaced breaking backward-compatibility, or things get added on top of what is already there. The  former would be very bad for developers and out-of-character for Microsoft, and the latter introduces mess and disorder into your clean language.\n\nSo in the future C# will either die, break compatibility, or become messy. Do you have an exit strategy? :)"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "Dec 04, 2009", "message": "Pies: there are already hundreds of Facebook programming questions on StackOverflow.  Questions about how to use Facebook are an entirely different kettle of fish."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Dec 04, 2009", "message": "@Chris I'm was just arguing the point about Facebook being somehow less complicated than Twitter. I would say that Twitter is the exact opposite of Facebook, but both have a learning curve and their respective power users."}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Dec 04, 2009", "message": "The whole debate could have been summed up by \"Jeff doesn't like Facebook\". \n\nDid you know someone made a Stack Overflow group on Facebook? Made me laugh anyway."}, {"author_name": "Roboprog", "gravatar_hash": "1bc2471f5a97b66082c3522697078ef7", "author_url": "http://roboprogs.com", "date": "Dec 05, 2009", "message": "What's Jeff got against Perl?  Well, beside the twisted class definition syntax...\n\nSeriously, though, I *really* like Perl for little short search tasks that are just a little too much for \"grep\".  \"perl -n -e\" is your friend.  I'd rather write a setup script for an in-house program in perl than in bourne shell, or (the horror!) a .bat file (command.com / cmd.exe) any day.  I suppose \"Power Shell\" is tolerable, but I largely escaped the MicroSoft prison years ago."}, {"author_name": "Don McArthur", "gravatar_hash": "1fdbf7576dcb8ab1bb447cda35d61636", "author_url": "http://donmcarthur.com", "date": "Dec 05, 2009", "message": "Stopped this after 10 minutes. What insufferable snobs you two have become. You clearly lack the character to manage business success."}, {"author_name": "Mike Sickler", "gravatar_hash": "69739fc4bc58863ff835f4e929694342", "author_url": null, "date": "Dec 05, 2009", "message": "I think you have to allow the Facebook questions on Superuser. Facebook is an application. People are bound to have questions about it, and if you don't have clear criteria to explain your decisions to reject these questions, then you're asking for more trouble then it's worth. \n\nSaying that it's not a complicated enough application is not a good reason to disallow it; it's too subjective and will appear arbitrary to the community. Besides, how many questions could there be? If it is as simple an app as Jeff claims, then we can expect there to be very few questions about how to use it, right? \n\nFacebook is really, really popular. I would expect that some canonical answers to common Facebook questions would generate a lot of traffic for you, and we all know how much Facebook users like to click on ads! :)"}, {"author_name": "Catsler", "gravatar_hash": "aa7118982abc341f1eee794d74950582", "author_url": null, "date": "Dec 05, 2009", "message": "Any guesses as to which avatar Joel had pegged as 'funny'? \n\nCletus? http://stackoverflow.com/users/18393\ngbn? http://stackoverflow.com/users/27535\nTheTXI? http://stackoverflow.com/users/22164"}, {"author_name": "Scott W.", "gravatar_hash": "7a03f436e9458527368e5eaa45f85d40", "author_url": "http://moms4mom.com/", "date": "Dec 06, 2009", "message": "Joel is absolutely correct about the difficulty in StackExchange is getting a community to *ask* questions, not answer questions.  With moms4mom, we are lucky that people throughout the process of being parents will always have questions, but what we realized was that people have have by far the most questions during the 12 months after conception.  These were, by far, the most important people to reach at the beginning because they have many, many more questions to ask."}, {"author_name": "Nicholas", "gravatar_hash": "70aa50b24678a7da56a32827044796c6", "author_url": null, "date": "Dec 07, 2009", "message": "Did the same as Don. Not due to snobbery but just sheer boredom. I'm not sure who Joel is arguing against but I couldn't bear to listen to the whole CV sorting thing again.\n\nPerhaps there should be a biweekly podcast with the repetition removed."}, {"author_name": "George", "gravatar_hash": "34584713a33396da751385b051bd8442", "author_url": null, "date": "Dec 07, 2009", "message": "I personally like to think of myself as a commando. There was an app that was taking too long and I did a rewrite in just days in another language. It is much easier to use. \nThing with commandos is resumed in what you say: \"People think they are too smart\". When you have someone playing commando in the night reading books they do not understand enough, it is a problem. Because they become sneaky and what was working will not be.\n\nIf one is proven good, they make good scouts, re-engineers or firemen. Firemen being their job is not to police, it is to solve problems when the police made a mess of things."}, {"author_name": "Daniel Pratt", "gravatar_hash": "c933fbb8685a083234fe385df8e9025f", "author_url": "http://www.danielgpratt.com", "date": "Dec 07, 2009", "message": "For some time now I've felt that whatever programming is, it isn't art. Then Jeff mentioned that he liked to draw once upon a time and I was reminded that until I learned to program (at age 19), I was an aspiring car designer.\n\nI'm pretty passionate about software development, so I've always thought it interesting that what I thought I wanted to do (as a career) is quite different from what I'm actually doing (and thoroughly enjoying).\n\nJoel's \"patience\" angle hadn't occurred to me before. I'll have to think about whether that could be the connection."}, {"author_name": "Josh Perry", "gravatar_hash": "d7c26b1a7279e3ae1b4fed1ff4e13f70", "author_url": "http://blogs.6bit.com/josh", "date": "Dec 08, 2009", "message": "Jeff, Don't let Joel change you:\n\nhttp://blogs.6bit.com/josh/2009/12/jeff-atwood-of-borg-stackoverflow-careers-assimilation/"}, {"author_name": "jd long", "gravatar_hash": "d2e5bf1cdb782a02ef30e41563702541", "author_url": "http://cerebralmastication.com", "date": "Dec 28, 2009", "message": "thanks for linking to my blog post about StackOverflow careers being disruptive. I am still rooting for you guys! \n\n-JD Long\n@cmastication"}]}