{"response": [{"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 16, 2009", "message": "This podcast was published a little late, so note that <b>all the backup talk in this podcast was recorded December 8th</b> ... prior to \"the event\" :)\n\nProphetic!"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Dec 16, 2009", "message": "I don't think programmers should be tied to particular programming languages. However, I think it is hard to be a very proficient programmer without being proficient in C. Now, the same could probably be said for being proficient in functional language like LISP or Haskell. A proficient programmer shouldn't have a language crutch. However, I pick C specifically because it is such a fundamental language. You probably don't use any operating system that wasn't written in C or a C-like language (ok, the last bit is a jab at Windows/Microsoft).\n\nWithout understanding programming at the level of C, you may not really understand how the machine works. To be sure, you should have knowledge of assembly language programming but C provides a pretty good level of abstraction. To be honest, if a programmer has trouble understanding pointers then his problem is probably more to do with understanding *indirection*, which is fundamental. If the problem is with understanding how memory addresses work, then that programmer's knowledge is even more lacking.\n\nSure, understanding the fundamentals of database development is important and many people do not understand relational modeling enough. However, this is really high level stuff. Also, it may come as a suprise but there are many, many programmers that never deal with relational databases at all. It seems like database knowledge is more secondary to the fundamentals. Nevertheless, the two aren't mutually exclusive. In fact, most relational database management systems people **actually use** are written in C or perhaps C++, but not Java, C#, Python, Ruby, etc."}, {"author_name": "Jesse Hartwick", "gravatar_hash": "cfd1684ea3df74d506f58377b6da5a72", "author_url": "http://www,appscanadian.ca", "date": "Dec 16, 2009", "message": "\"all the backup talk in this podcast was recorded December 8th\"\n\nSo does this mean there's another podcast coming soon for this week, or are you going to be publishing on a one week lag from now on?\n\nI've got a non-shirt-worthy question that I'm thinking about recording, but I keep stopping myself (due to shyness and hatred of my own voice) so who knows.\n\nI love this podcast, keep up the great work!"}, {"author_name": "Richard Gadsden", "gravatar_hash": "3c291e7858e6b79e06889fa7dbf16d31", "author_url": "http://backtype.com/po8crg", "date": "Dec 17, 2009", "message": "\"What would the world we be like if employees who are 10 times more productive than their coworkers were paid 10 times as much?\"\n\nIt would be like sports, or other \"lottery\" professions (acting, writing, music, etc).  To pick a New York example that Joel should get, Alex Rodriguez made $33 million this year; Eric Hinske made $1.5 million this year, so that's a factor of 22.  I've excluded players who are cost-controlled because they're in their first six years.\n\nI'm sure you'd see a similar story if look at pay on movies, or look at how much a singer makes compared to her backing singers.\n\nI suspect that if you were working with Guido van Rossum or Richard Stallman, or Sid Meier, or Alan Cox, or Alan Kay, or Vint Cerf, or Donald Knuth, you wouldn't mind them making ten times what you made.\n\nPS Badge suggestion: \"Verified\", like the verified badge on Twitter, to prove you really are the famous person you claim to be.  I also suggest a thousand points for a Turing Award."}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Dec 17, 2009", "message": "There's another reason why you can't pay the programmers what they're worth (other than social unrest) and I'm surprised Joel didn't mention it because I'm pretty sure he's talked about it before: There's no reliable metric for a programmer's productivity. Anything you try to measure, if known about, will be gamed, usually in a way that reduces real productivity. \n\nOn a similar note, there is a job where one employee can earn ten times as much as another doing the same job at the same company: Salesman. And the reson is because there's a very simple and almost foolproof metric for a salesman's productivity: How much did you sell?"}, {"author_name": "mmyers", "gravatar_hash": "49f3a2065659f5b4efa05ae29bd0856a", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "Dec 17, 2009", "message": "&gt; It would be like sports, or other “lottery” professions (acting, writing, music, etc). To pick a New York example that Joel should get, Alex Rodriguez made $33 million this year; Eric Hinske made $1.5 million this year, so that’s a factor of 22. I’ve excluded players who are cost-controlled because they’re in their first six years.\n\nThe disparity in sports is caused by the \"gladiator effect\": small differences in skill become very important. See http://www.advancednflstats.com/2009/04/draft-picks-bricklayers-or-gladiators.html for a more in-depth discussion.\n\nI tend to think that programming is closer to the bricklaying end of things, but you could probably argue it either way."}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Dec 17, 2009", "message": "<blockquote>So does this mean there’s another podcast coming soon for this week, or are you going to be publishing on a one week lag from now on?</blockquote>\n\nThey'll probably just skip a week again..."}, {"author_name": "theman_on_vista", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "Dec 17, 2009", "message": "@Richard Gadsen\nStallman is pretty poor given how famous he is in the programming world (What did you think that first \"F\" in FSF stood for?).\n\nAlso, glad to hear Spolsky, yet again, put down anyone who didnt go to Ivy League schools.  Why did he decide to work with Atwood again?\n\n...He only went to UVA...\n\nAnother great podcast, just dont make me wait 2 weeks again!!"}, {"author_name": "Mark", "gravatar_hash": "cc6d1fd046834db7202f1d76a92c2f74", "author_url": null, "date": "Dec 17, 2009", "message": "What is Jeff saying near 3:30? \"The hyphen site?\" What is that?"}, {"author_name": "Alan G. Labouseur", "gravatar_hash": "128e1b22c79ca9e0905f66d24c898211", "author_url": "http://www.3NFconsulting.com", "date": "Dec 17, 2009", "message": "Regarding the question about developers creating databases, I offer the following:  \n     As a database guy (my company is named “3NF Consulting” after all) and a software developer, I can say with certainty that an accurate, complete, consistent, and expandable database which is free of anomalies is a lot more than “just a bunch of tables”. Principles of functional dependance and normalization are critical, as is the ability to actually communicate with people in the enterprise you are trying to serve. But those analysis and communication skills are integral to being a good software developer. Therefore software developers should be able to design (and certainly implement) a non-trivial database in a least third normal form (3NF) or perhaps even BCNF. \n     Performance and tuning is another story. I see a natural division of labor there. I don’t expect software developers to be experts in that. Sure, they ought to know how to get and read an execution plan and know the difference between a table scan and a hash-join, but for the nitty-gritty details I’d turn to performance and tuning experts."}, {"author_name": "Jörg W Mittag", "gravatar_hash": "0bfe384bf9dce3cc1fda1bb0ff5f4e0e", "author_url": null, "date": "Dec 17, 2009", "message": "@Mark:\n\nThere are three primary anti-inspirations for StackOverflow, in the sense that Jeff and Joel were using these three regularly and got so fed up with them that they wanted to build something that was the exact opposite of those three things:\n\n1. phpBB\n2. Yahoo! Answers\n3. Expert Sex Change\n\nI'll leave it to you to figure out which one of those is the hpyhen-site and why Jeff likes to call it that."}, {"author_name": "Jay Bazuzi", "gravatar_hash": "59ca40f0fafad6de52790016d2195abc", "author_url": "http://jbazuzi.blogspot.com", "date": "Dec 17, 2009", "message": "&gt; Does a free service even have “customers”?\n\nOf course it does. Just follow the money.\n\nYou're a business, which means you make money by providing a good or service.  The money comes from your customers.\n\nStackOverflow is paid for by advertisers. So, the customer is the advertiser.\n\nWhat product is the advertiser buying from StackOverflow? An audience. \n\nA successful \"free\" (aka \"advertising supported\") business model is one that grooms a valuable audience for advertisers. One that has money and is willing to spend it on advertisers products.\n\nThis is also true for most television, newspaper, etc."}, {"author_name": "Richard Gadsden", "gravatar_hash": "3c291e7858e6b79e06889fa7dbf16d31", "author_url": "http://backtype.com/po8crg/", "date": "Dec 17, 2009", "message": "<blockquote>Stallman is pretty poor given how famous he is in the programming world</blockquote>\n\nSure, but only by choice.  There are other people who have made the same choice.\n\n@u62: sports stars can also be measured on performance just as effectively as salesmen, which is part of why they get big pay variations (also because they're in a job where relative productivity matters rather than absolute productivity).\n\nThere is another situation where performance is notoriously difficult to measure, but where it doesn't matter, because there's a proxy that people will accept - any situation where you can use fame as a proxy.  Acting and pop music pay on fame not on actual performance ability (that's why Britney's rich).  If you're working with a famous programmer - someone with a Turing, or someone that books have been written about, or a notable language or framework designer - then you wouldn't object to them being paid a lot more than you because, well, they're famous and you aren't.  How much of the pay is for their programming ability and how much for the advertising advantages that employing a superstar gains them would be an interesting question - except I think it's more useful as a rationalisation for being paid less.\n\nIf you don't think that employing a famous programmer is an advertising advantage, then remember how much mindshare Transmeta got from employing Linus Torvalds, or how much of the early credibility / mindshare for C# came from having Anders Hejlsberg working on it.\n\nFame is measurable - not perfectly, but it is one of the few things that is measurable sufficiently objectively to base pay on it."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Dec 18, 2009", "message": "I think that Joel's comments about Twitter always being down were a little harsh because it's considerably more reliable than it used to be and is hardly ever down now. It'll probably go down when they run out of money though."}, {"author_name": "Fredrik", "gravatar_hash": "826f4d6edd2e93e07aacd04bf07da069", "author_url": null, "date": "Dec 18, 2009", "message": "as much as I agree with Jeff (was it?) that opendns breaks the internet, the vpn issue discussed is actually something you can configure when you're logged in. In a not very obvious corner of the preferences I haved told them that requests from my current ip at home for addresses in our internal network at the office should not get their special handling."}, {"author_name": "darlinton carvalho", "gravatar_hash": "539c382b1a521decb9f4194ef6606190", "author_url": null, "date": "Dec 18, 2009", "message": "the point about why myspace fails is very interesting. danah boyd, microsoft research, has a point about the kind of people (classes) that uses the systems: Viewing American class divisions through Facebook and MySpace - http://www.danah.org/papers/essays/ClassDivisions.html\n\nstackoverflow has a pretty well defined audience to keep a good environment, so keep the good work up."}, {"author_name": "Andy McKenna", "gravatar_hash": "811103db4bcf408dba46a72f95628429", "author_url": null, "date": "Dec 18, 2009", "message": "John Topley:  How timely is it that Twitter got hacked and was down mere hours after you posted that comment?  :)"}, {"author_name": "Eric", "gravatar_hash": "ac7985c231415c199e832c7e42fbb707", "author_url": null, "date": "Dec 20, 2009", "message": "You comments on .NET Remoting [59:50] #77 are completely inaccurate. First .NET Remoting supports XML and Binary communications. There is nothing wrong with it, it works well. There are many large companies and government agencies that use it with no problems. I have used it for years. In some cases XML web service are too slow, so you use .NET Remoting and binary serialization. Also the ability to serialize business objects across the wire is a lot easier in .NET Remoting, when trying to serialize object in a web service is always a pain. Now that we have WCF there is no need for Remoting but it’s still supported. I don’t know what problems you were having but it's probably because you didn’t know what you were doing…"}, {"author_name": "Chris", "gravatar_hash": "f19c326a8b101e06835cbb6e61391b30", "author_url": null, "date": "Dec 21, 2009", "message": "When I mistype a domain name I get a search results page with the branding of my local ISP.\n\nI wonder what I would get if Google ran my DNS?\n\nChris"}, {"author_name": "Shaun Martin", "gravatar_hash": "bb7894531494fb7f62b4dd18e303f7b5", "author_url": "http://www.shaunmartin.com", "date": "Dec 21, 2009", "message": "I agree with Eric - I'm not sure how Jeff formed his opinion on .NET Remoting.  I work on a large app that uses remoting heavily and it's great: fast, easy to use, and works like a dream."}, {"author_name": "David G.", "gravatar_hash": "26913a608bc12c040aa05b61124b6a91", "author_url": null, "date": "Dec 22, 2009", "message": "Jeff's comment that it's more important to know the fundamentals of databases than C is probably true for most application developers but ignores the large world of system programming. The Microsoft developers that work on .NET, for example, are much more likely to need to know C than databases (except for database specific parts of .NET). You can spend a career working on compilers, language runtimes, operating systems, etc. and never need to know anything about databases. Not to mention people that work on real-time software. It's a big world of developers out there."}, {"author_name": "Bremen", "gravatar_hash": "9a45de8df0c5c3f6e137c785e71557b8", "author_url": null, "date": "Dec 22, 2009", "message": "Just to clear up a few things I heard on the podcast:\n- OpenDNS's default behavior is to show an ad page for typos, but if you actually set up an account, you can disable that (along with getting the ability to filter by category and other bonuses that make OpenDNS appealing to parents and/or companies).\n\n- Jeff's attempts at defending his outsourcing-DNS decision came across as flailing around at not understanding how DNS works, probably because he hasn't actually set up a DNS conf file (\"don't they have to expire or something?\"). Disregarding that, you missed the key hole in your argument -- distributed DNS's usefulness is Inversely proportional to your popularity. The more popular you are, the more likely you're going to be cached in the billion other places that can (and do) cache your domain name. So as SO's popularity has skyrocketed, the value you're getting from outsourced DNS is probably plummeting.\n\nI'd also like to \"upvote\" u62's comment; the reason you can't pay more-productive programmers more is because you can't objectively measure productivity in a meaningful way. Everyone can (maybe) agree that Bob is more productive than Alice, but you can't quantify it without people gaming the system."}, {"author_name": "yetapb", "gravatar_hash": "3d9115b68543fd0d8ae43bfd4787107f", "author_url": null, "date": "Dec 23, 2009", "message": "\"Joel says all developers should know C. I’ll counter by saying it’s far more important that all developers know the fundamentals of databases than how to write a working pointer based string copy algorithm.\"\n\nYou are both incorrect or partially so...\n My current position as a Firmware Engineer uses 0 database code and none of that knowledge matters a single iota.  C and C++ skills and pointer manipulation however are super important.   My  previous job was as a web software engineer and as you say, database knowledge was key, yet pointer manipulation was nowhere to be seen...So as always, in all things computer related, the answer is \"It depends.\""}, {"author_name": "TonyB", "gravatar_hash": "77c818e58f130d102268d6e690d85422", "author_url": null, "date": "Dec 28, 2009", "message": "You guys should look into Database mirroring.  http://technet.microsoft.com/en-us/library/cc917680.aspx \n\nSQL can auto failover between two instances.  The hardware doesn't need to be the same.  It works very well and is very cost effective.  You don't even need a SQL license for the standby server.\n\nAnother item to think about is using the extra capacity of the standby server.  The standby database server could serve as a great MemCache server when it isn't doing SQL queries."}, {"author_name": "Jason", "gravatar_hash": "44d59b3bea2f0cbe0c787533faf5ecfc", "author_url": null, "date": "Jan 06, 2010", "message": "While I agree that a developer should (and most do) have enough knowledge to design a non-trivial database schema, specialists are required because they understand the peculiarities of the particular DBMS which is being developed for.\n\nThe specifics of data-types, partitioning and indexing schemes, non-standard features (e.g. features for caching, pre-calculation of data etc.) and especially the myriad alternative ways of working with data in stored procedures are not taught in a CS or SE course. It is this DBMS-specific knowledge which can lead to order of magnitude differences in database performance.\n\nAs a programmer who once took an internship as a DBA/database developer, I have come to appreciate how often a developer can cripple a database due entirely to their naivety with respect to a particular DBMS."}, {"author_name": "Steve Wortham", "gravatar_hash": "7c4d1e4f8701946b8391d009d8d85221", "author_url": "http://regexhero.net/", "date": "Jan 12, 2010", "message": "I've always done the database design for the websites I've built until recently.  Now I'm actually building dozens of ASP.NET user controls which tie into some business objects which in turn interact with SQL.  \n\nThe business object/SQL side of things is the responsibility of another developer here.  So for the first time in a long time, my hands are completely off of the SQL side of things.  And I must say that it's been working very well.  \n\nSo although I've had a history with SQL, I do disagree about one point.  As a developer, it's not absolutely critical that you have experience with database development.  Naturally it'll help your career and it'll be easier to find jobs.  But it's very possible to be a productive member of a team as long as you're creating apps with a separation of layers (presentation, logic, data) and you're good with at least one of those layers."}, {"author_name": "Norm", "gravatar_hash": "c5f0c8efdeb3204bdeb53af2cef09c6c", "author_url": null, "date": "Jan 12, 2010", "message": "This is kind of late (I just started catching up from the holiday break today), I know. Regarding Joel's theory about Google providing DNS so that Chrome can do DNS pre-fetching for Google search results, Chrome already does DNS pre-fetching for every link on pages you visit: http://blog.chromium.org/2008/09/dns-prefetching-or-pre-resolving.html"}, {"author_name": "milkfilk", "gravatar_hash": "bc9b5cb83cd53b5324eb2a32ea3a6b34", "author_url": "http://squarism.com", "date": "Feb 02, 2010", "message": "I agree completely with what Bremen said.  The DNS conversation was a little thin and just really wanted to chime in and explain DNS a bit.  Joel had some good guesses.  I think it was just a bit of edge knowledge outside of normal dev work.  I'm a long time listener, I just think DNS is usually a sysadmin thing (although by no means a guarantee that they know what they're doing).  There's always a bigger fish, I'm not a DNS expert running the root servers with infinite knowledge.\n\nLinux doesn't have a DNS cache unless you have nscd running and configured.  So I usually think of OS caches as Windows specific because Windows so widely used and the default operation."}, {"author_name": "Sam Greene", "gravatar_hash": "23ee900303a74832ec9e7d09a34cf3f9", "author_url": "http://sqlparty.blogspot.com", "date": "Feb 16, 2010", "message": "A few comments on your podcast.\n\nDNS:\nDNS uses TTL to determine cache refreshes.  Shorter times will tax your dns server due to more requests.\n\nSQL/Windows Clustering:\nSome hardware is compatible and you can upgrade nodes piecemeal.  \n\nYou could also mirror a database from a cluster to another standalone instance or cluster.  Then failover to that cluster, using a keyvalue pair in your .net connection string. Then ditch your old hardware/OS.\n\nexample Failover Partner=myMirrorServerAddress;"}, {"author_name": "Kelly French", "gravatar_hash": "e0a54afe8f88ce1b2a045f2217e573b3", "author_url": "http://codewright.blogspot.com", "date": "Apr 25, 2010", "message": "The question asked on the Stackoverflow podcast was turned into a <a href=\"http://stackoverflow.com/questions/1767957/paying-great-programmers-more-than-average-programmers\" rel=\"nofollow\">Stackoverflow question</a>. That question inspired a <a href=\"http://codewright.blogspot.com/2009/12/of-rockstars-and-bricklayers.html\" rel=\"nofollow\">blog post of mine</a> to go into more detail on the subject. Thanks to the <a href=\"http://www.codeanthem.com/blog/2010/04/lets-be-independent-together/\" rel=\"nofollow\">CodeAnthem site</a> and <a href=\"http://www.johndcook.com/blog/2009/12/23/why-programmers-are-not-paid-in-proportion-to-their-productivity/\" rel=\"nofollow\">John Cook</a> for bringing the subject up again."}]}