{"response": [{"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": "http://blog.tapuchim.com", "date": "Dec 18, 2009", "message": "It's about time you shortened those cables! That rack looks like a mess...\n\nYou could have just used a cable shortener though to tidy up ( http://www.amazon.co.uk/Clippasafe-Ltd-CL860-Electrical-Shortener/dp/B000L0WBPQ ). This is quite a useful device although it can get quite annoying"}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Dec 18, 2009", "message": "What? No mention of Google's Android/Stack Overflow announcement? http://android-developers.blogspot.com/2009/12/hello-stack-overflow.html"}, {"author_name": "Matt", "gravatar_hash": "03cd042b82ac85b2c5fe0757a94e0413", "author_url": null, "date": "Dec 18, 2009", "message": "Jim, sorry to tell you, but it is just that kind of thinking that made Grace Hopper such a genius.  http://en.wikipedia.org/wiki/Grace_hopper#Anecdotes \n\nHowever, Jeff, I can't believe that you keep...tweaking...especially in such needless ways.  Why would you change out a power cord that is working (I'm assuming) perfectly fine, out for one that, while more tidy I guess, may fail.  It's not like it will improve performance even .000001% or anything...so, if it isn't broken, why try to fix it?\n\nPS -- yes, I realize my comment to Jim seems to contradict my comment to Jeff...but in my mind there's a distinction, so shut up.  ;)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 18, 2009", "message": "Matt -- we like to keep things tidy. Server rack hygiene is like code hygiene. These little details matter to us, and we want to be proud of it when we show it to everyone."}, {"author_name": "Peter Stegnar", "gravatar_hash": "6310e30d9a42af8321feda96250d40da", "author_url": "http://blog.stegnar.com", "date": "Dec 18, 2009", "message": "Just an idea. If you would like to avoid a temporarily trilogy site shutdown, you could at shutdown time reroute traffic to backup server which would be in read-only state (with a proper notification on top), since trilogy sites have a vast majority of traffic a \"GET\" type."}, {"author_name": "J. Passing", "gravatar_hash": "70d618cc95177b9cba1c17206d1986d4", "author_url": "http://jpassing.com/", "date": "Dec 19, 2009", "message": "4 hours of downtime for... changing power cords? Do not you have any other problems, Jeff? ;)\n\nBut seriously, I think 4 hours of planned downtime for a site like stackoverflow is way too much for almost any kind of maintenance work. For changing power cords and upgrading a support system, I'd give you maybe 5 minutes of effective downtime... but these are just my 2 cents."}, {"author_name": "Murali Suriar", "gravatar_hash": "085bfa9c259fb798a61d72c5e5a9989a", "author_url": "http://www.amateurgeek.co.uk/", "date": "Dec 19, 2009", "message": "Matt, J. Passing: These are all issues that absolutely should be fixed. I'm assuming that taking the VM workhouse box down for an OS upgrade will necessitate downtime regardless (I believe it's doing load-balancing, among other things?), and the team are therefore using the opportunity to do some housekeeping work in addition.\n\nJeff: Regarding other people's points about minimising downtime, something you may want to consider for the future is going to N+1 redundancy on networking and power. Team/bond your servers' Ethernet connections (ideally to separate switches, eventually) and move to dual PSUs on all of your components. Doing so would allow you to perform this kind of work in-service, rather than requiring downtime. \n\nI see there are two power strips a the bottom of the cab; have you verified:\n\n1) That both power strips go to separate PDUs?\n2) That all of your single-power devices (web tier servers, switches, from memory?) are salt-and-peppered across different power strips?\n\nAre you confident enough in your redundancy to have Geoff pull the plug on one of the PDUs? :)"}, {"author_name": "Ben Poole", "gravatar_hash": "c1e7dcad3f222283217c419859f681f7", "author_url": "http://benpoole.com", "date": "Dec 19, 2009", "message": "Good grief, everyone's an expert... do what you need to do, and huzzah for rack hygiene :-)"}, {"author_name": "Stefan Scholl", "gravatar_hash": "2d867f8cad7dc44d68fe84459dad3418", "author_url": "http://www.no-spoon.de/", "date": "Dec 19, 2009", "message": "How about writing the time in UTC, so that every visitor knows what you are meaning?"}, {"author_name": "Torben", "gravatar_hash": "5fa8a2ac688a0d4bcdf3d8ffb923d35b", "author_url": null, "date": "Dec 19, 2009", "message": "&gt; 4 PM - 8 PM PST\n\nIt's disappointing to see only DST time in a website as fine as SO. Do I *really* have to calculate to GMT myself in order to get my own time zone? (Who uses PST anyway? ;)\n\nPlease add GMT/UTC to such important statements. Thanks!"}, {"author_name": "Heston", "gravatar_hash": "0cfa329d53871ce5070aaac7578acf94", "author_url": null, "date": "Dec 19, 2009", "message": "I don't understand why you have so much capacity, yet still is shutting it down entirely for maintenance - and during the day.\n\nThe scope and timing for this task may indicate it's the worst upgrade ever: Up to four hours complete down-time for changing cables and upgrading software on a single server, and not even in the nights?"}, {"author_name": "dlamblin", "gravatar_hash": "60fec2454b16f5fd5ec243fa98d71351", "author_url": null, "date": "Dec 19, 2009", "message": "Isn't the first rule of planned downtime to plan for what needs to be done such that future planned downtime can be shorter? IE by adding redundant fail over machines?"}, {"author_name": "medopal", "gravatar_hash": "a4a8419ca359082e0f7029dc237458ce", "author_url": null, "date": "Dec 19, 2009", "message": "FYI, PST is GMT-8, so 4PM - 8PM PST is 12 Midnight - 4AM"}, {"author_name": "Global", "gravatar_hash": "53f7a524cbd754b799a271637e84e5ea", "author_url": null, "date": "Dec 19, 2009", "message": "What is PST? Use some universal time reference, like say UTC?"}, {"author_name": "Chris Shaffer", "gravatar_hash": "09c94bf7c78d185ffe21d3a968371812", "author_url": null, "date": "Dec 19, 2009", "message": "Why not use \"sites will be down in 2 hours\" instead, forget about timezones and such (like much of the site does already for recent past time info)."}, {"author_name": "Farseeker", "gravatar_hash": "3fe1ab2f3897d8e3931c5b297c29e994", "author_url": null, "date": "Dec 19, 2009", "message": "I'm with Chris. It's Sunday morning here and I saw a message saying it's going to be offline today from 4pm. I've no idea how many hours PST is away from my timezone (+11), and when I click the link I saw it was going to be offline on Saturday... both of which have passed for me..."}, {"author_name": "warrenk", "gravatar_hash": "94a23b1e38277646b255832e0a93fc7a", "author_url": null, "date": "Dec 19, 2009", "message": "seems like a good enough reason for downtime to me. take as long as you want, after all i don't have to pay to use stackoverflow. I'm guessing that downtime will make the site better or have more potential to be better."}, {"author_name": "Sam Yong", "gravatar_hash": "69a10b408f98558625a36c6e4ca99738", "author_url": "http://thephpdeveloper.blogspot.com", "date": "Dec 19, 2009", "message": "Yeah routing it to a backup readonly server would be good idea. Just like what deviantART has always been doing, users are still able to view website's content in readonly mode even if a maintenance is ongoing."}, {"author_name": "Andrew Grimm", "gravatar_hash": "01bbb59a1c3ef9960f25a97afe7e920f", "author_url": "http://andrewjgrimm.wordpress.com/", "date": "Dec 19, 2009", "message": "Are there any sites that do a decent cache (ie better than google's text-only one) of the site, and don't have any spyware?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 19, 2009", "message": "All done! Next time, we'll be sure to put the outage times in the official Stack Overflow timezone: JST. Jon Skeet Time."}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Dec 19, 2009", "message": "Nice, looks much tidier. By the way, where are the new USB drives? I still only see the one USB cable hooked to the database server."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 19, 2009", "message": "The picture was taken before they were put in. The USB drives were the last thing to go in. They're sitting on top of the 2U database server and are connected via rear USB ports. This is better for powering USB drives, as sometimes front USB ports have too much power loss from cable length run to power some 2.5\" HDDs.\n\nTrust me, though, they're in there. I am backing up to both of them now for testing. Nice to have 1.2 TB of backup capacity -- or should I say 600gb mirrored. :)"}, {"author_name": "alexanderpas", "gravatar_hash": "ca5fd69395f0422a8c9ef11db8bb29ca", "author_url": "http://dropdev.org", "date": "Dec 20, 2009", "message": "you should say 600MB mirrored ;)\n\n(I know you meant 1.2TB)"}, {"author_name": "ThomasK", "gravatar_hash": "bf33a5f1370b5a2fa1e5a91a671b219b", "author_url": null, "date": "Dec 21, 2009", "message": "So, what's with the dual ethernet interfaces with matching cables, when you only have a single switch?"}, {"author_name": "hmallett", "gravatar_hash": "eb65d9143622f4d4f8f2111e96acc13d", "author_url": "http://www.hmallett.co.uk", "date": "Dec 21, 2009", "message": "ThomasK, if you look at the Server Rack Glamour Shots post, in the comment Jeff says that the two old switches served two network segments - a public network and a private network.\nNow that there's only one switch I assume that there are 2 VLANs to segregate the public and private networks."}, {"author_name": "Dlux", "gravatar_hash": "bf96be7112ca1d4fd622a6fe9e46d298", "author_url": null, "date": "Dec 21, 2009", "message": "Just a note on the switch placement - Next time mount the switch in the front and install a cable pass through to bring the cables from rear to front.  That way you can get a complete status of the items in the rack from the front."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 21, 2009", "message": "Dlux, the rear mounting means it takes up no space in the rack, which is why we do it that way. Our rack is about to be full with actual servers, so we don't want to allocate 1U to a switch."}]}