{"response": [{"author_name": "mindcorrosive", "gravatar_hash": "be3b138352dc100c9459e612b275b413", "author_url": null, "date": "Oct 01, 2010", "message": "Indeed, the biggest mistake of SO guys was allowing these to proceed for so long, implicitly meaning that you consider those proposals worthy of further development. I am willing to cut you some slack, guys, but honestly, you could have handled this in a better way. \n\nAt any rate, there were lessons learned for both sides, so I think we can go on without hard feelings to build other communities that are currently underserved by the existings sites.\n\nKeep up the good work."}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Oct 01, 2010", "message": "What about Scrum, Healthcare IT, Drupal, White Hat SEO?\n\nBetter tear that band-aid off quickly, or the pain will never stop.\n\nI'm sure you'll get grief about this, but I think it's the right choice."}, {"author_name": "Barry Kelly", "gravatar_hash": "4a7b08fcb7e3d9a52ae473613b71bc3d", "author_url": "http://blog.barrkel.com/", "date": "Oct 01, 2010", "message": "Disappointed that the compiler design proposal was marked duplicate, especially as it's not clear to me which stack exchange site it's a duplicate of. Questions on language design would completely fail on Stack Overflow, for example, owing to uninformed bike-shedding. I saw the proposal as a more practice-oriented version of Lambda the Ultimate's forum."}, {"author_name": "Fredrik", "gravatar_hash": "967f766091a70af1b9207c71654a9f19", "author_url": null, "date": "Oct 01, 2010", "message": "I just had a look at the 'vim' linked in the post, and while I don't oppose marking stuff as duplicates, just exactly WHAT is it a duplicate of? :)\n\nAll it says is closed as duplicate (and \"This proposal would tend to drain audience from another Stack Exchange site.\"), it would be nice to know which one, cause as it is now I have nowhere to look further."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Oct 01, 2010", "message": "Ok, this is just starting to get funny... \nAnother week, another change in direction on Area51. ;)\n\nWell, I think you're moving in the right direction.\nThere's still one thing I think is missing from the process though:\n\nRather than simply merge/don't merge a new site into an older one, doesn't it sometimes make sense to broaden the scope of an existing site? If a narrow site is proposed first (say, Ubuntu), and then, a month later, someone proposes a Gentoo site. Or a Debian site, or a Red Hat site. With the current tools, your only option is to allow all these similar sites because none of them are a subset of the others, so merging one into the other makes no sense. But the ideal solution had been for a single \"Linux Distros\" site to be created, into which they could *all* be merged.\n\nSuppose instead of StackOverflow, you'd initially created a .NET-Overflow. Then the logical way to go would be to expand that site, add Java, then C++, then Python, and so on, until it eventually becomes \"everything programming\". But the tools for this are missing. A51 is still \"first come first serve\". So creating a narrow site today might actually prevent or hinder the creation of a broader site that could include it tomorrow.\n\nOf course, I'm not sure how this should be pulled off without stepping on anyone's toes. But I think the scenario is important. We're already seeing proposed sites that aren't a strict subset of an existing site, so the current one-way merging process doesn't work, but they have enough overlap that it'd make sense to combine them with another site, creating a new one with a broader scope than either of the two \"source\" sites."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Oct 01, 2010", "message": "@Barry Kelly: then split it up.\n\nThe language design part doesn't make much sense on SO, no. But the software engineering aspects of actually building a compiler would work fine there.\n\nSo perhaps instead of a compiler design SE site, you should propose a language design one? One that focuses specifically on the theoretical aspect, which isn't well supported by SO. And then leave the practical implementation parts to SO?\n\nAs for Vim, I'm not sure, but it might be considered a subset of Superuser? It does seem like creating a Vim site opens the door for a million tool-specific sites: one for Emacs, one for Visual Studio, one for Notepad, and so on. Do they all go on SuperUser? Should a Developer Tools site be created that can contain them all? I'm not sure, just thinking out loud. :)\n\n\"What about Scrum, Healthcare IT, Drupal, White Hat SEO?\"\nWouldn't it make sense to merge Scrum into a general \"Software Development Methodologies\" site (which would require such a site to be created first, of course? And the SEO one seems like it could be merged into one of the web-oriented sites, but again, one of them might need to expand its scope to accommodate it.\n\nHealthcare IT is an odd beast, and I'm really not sure how it should be tackled. I've seen some fairly sensible arguments in comments here justifying its existence, but it still seems like there's got to be *something* more general it can be folded into.\n\nPerhaps before entering the commitment phase, every site proposal should be considered for generalization: whenever a very specific proposal is about to enter commitment, someone needs to ask \"could this be broadened to catch upcoming sister sites as well?\" I'm not sure if this should be done by official staff, the A51 community or the specific proposal's community (although I'm currently thinking the A51 community as a whole might make sense). But *someone* (someone who is familiar with the SE platform) should be required to sign off on a proposal before it leaves Definition, basically saying \"I/we believe the scope of this site to be broad enough to prevent near-identical site sprawl\" in the future. That might counter the tendency of domain experts to define \"their\" site as narrowly as possible. All the people normally participating in the Definition phase are those who are interested in this very specific subject, so their natural tendency is to narrow the site down to focus on that, and nothing else. So maybe every site needs some external input as well: \"couldn't this Ubuntu site be broadened to cover the same thing for every Linux distro?\" \"Couldn't this Web Dev site be broadened to include SEO aspects as well?\" and so on.\n\nRunning a check like that might have avoided a lot of the merging pain that people are going to have to deal with now.\n\nAgain, just thinking out loud here.\n\nAnyway, looks like the A51 process is becoming a lot saner, so good job on that. ;)"}, {"author_name": "Robert", "gravatar_hash": "8412e434f40996cca46ca6c260aa9dd0", "author_url": "http://creatingcode.com", "date": "Oct 01, 2010", "message": "Classy apology.  You can't expect to push the future of QA sites and not make a few mistakes along the way.\n\nIt's always tough when you have to make the decision to close someone's proposal because it is too closely related to an existing site.  I think you hit the nail on the head on making changes to recognize these sites early on and closing them before they gain too much traction.  These decisions may be painful, but they are necessary for the success of StackExchange.\n\nThe last thing we need is for StackExchange sites to start fragmenting.  If that happens, everyone loses.\n\nStackExchange sites are fantastic and I'm a much better programmer, writer, and Starcraft II player because of them.\n\nKeep up the good work."}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": null, "date": "Oct 01, 2010", "message": "I supported the Compilers suggestion, because there is no place to ask those questions. They would be denied in SO, CST and PR.\n\nWhile your apology is well stated, I can't agree with what you're doing. I will not support any more Area 51 sites. I have removed my contributions in personal protest.\n\nIn the words of the great Eric Cartman, \"Screw you guys. I'm going home.\""}, {"author_name": "Shane", "gravatar_hash": "0cee97ffd90277bf4ac753331d50af60", "author_url": null, "date": "Oct 01, 2010", "message": "Great, now let's push some of the non-duplicate sites forward (e.g. Physics, Graphic Design, Quantitative Finance).  \n\nI also have to ask: why isn't the Libraries proposal moving along faster that this point?  It clearly has a huge community."}, {"author_name": "David Hollman", "gravatar_hash": "4b0bc5fee5f02e4d117db039b47528dc", "author_url": null, "date": "Oct 01, 2010", "message": "I really like this direction.  Merging overlapping sites means that when I want to know something, I only have to search two places instead of one.  Much attention has been paid to the answerers of questions and the active communities for these types of sites, but we can't forget that a very large number of the users of these sites will be the average Googling public who will come for one answer and leave.  If there's too much separation of sites, people won't have a source that they can come back to and quickly search for answers.  Right now, if I want to find out if something has been asked about Applescript, I have to search SO, SU and Apple.SE.  This is skattering information rather than efficiently collecting it.  Kudos to the Stack Overflow Inc. team, and even from someone who was a \"committed\" member of the Vim proposal, I say apology not necessary (but it was a nice gesture anyway)."}, {"author_name": "Joe Phiillwhat?", "gravatar_hash": "35b5e9e9ccf3bfe5ff8d22b64a5234d3", "author_url": null, "date": "Oct 01, 2010", "message": "Mr Atwood\n\nDo whatcha gotta do.\n\nSincerely,\nMe\n\ncaptcha: low-titer modwalbe &lt;-- wtf are these words?"}, {"author_name": "Cyclops", "gravatar_hash": "1e19ec9504874df60f417008dcbf324a", "author_url": null, "date": "Oct 01, 2010", "message": "@Configurator, look at the flip side of it - the owners of SO have just publically declared that any and all compiler questions *are* on-topic for SO. Try it out - post some obscure theoretical compiler design on SO, with a link to this post saying, \"and it *is* on-topic - so there!\" :)"}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Oct 01, 2010", "message": "I'm very disappointed to see the compiler design proposal closed. (And not just because I proposed it.) This community had a large following and was just preparing to go into private beta. Contrary to what some are saying, some of the questions that would have been asked there DO NOT BELONG on StackOverflow. Now there's NO good place to ask them.\n\nNow I am left with the task of deciding how to write my compiler completely on my own, instead of having a community to assist in this process."}, {"author_name": "Eric Weilnau", "gravatar_hash": "45c914d730cef4110c3d790f03c31cfc", "author_url": null, "date": "Oct 01, 2010", "message": "I think the recent drama over the Area 51 proposals highlights how difficult categorization truly is. The fact that the note on the Vim proposal indicates that it is a duplicate of not 1 but 3 existing sites emphasizes this even further."}, {"author_name": "Kiru", "gravatar_hash": "596e7cfcc68c6711dced05001e3bf746", "author_url": null, "date": "Oct 01, 2010", "message": "Honestly \"duplicate\" is the wrong word to describe the vim proposal. The vim site was proposed exactly BECAUSE vim questions were scattered across SO/SU/SF, and now ubuntu and unix too; having a named SX site for vim was supposed to make a centralized site.\n\nThe vim proposal (and a few like it) grew basically out of the inability to do cross-site tagging. I understand that this can be tricky, \"rpg\" on gaming and SO can mean two very different things."}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": null, "date": "Oct 01, 2010", "message": "@Cyclops: Saying that it's on topic because of this silly blog post won't make it on topic. The questions, like George Edison says, do not belong there.\n\nI'd like to emphasize my point. I'm all for trimming duplicates. I don't know if vim was a duplicate, but I think a home for compiler design would do us all (compiler designers) good. And it definitely had a big enough community to support it. And now we're lost, floating around the ether, until some StackExchange competitor finally opens a Q&amp;A site for compiler designers, and even then we won't have the momentum we could have had here.\n\nI am a full supporter of stack exchange and stack overflow. But I think Area 51 is a complete and utter failure."}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": null, "date": "Oct 01, 2010", "message": "One more point.\n\n\"1. Almost all [Compiler] questions are on-topic for site [StackOverflow]\"\nNo, they aren't.\n\n\"2. [StackOverflow] already exists, it already has a tag for [Compiler], and nobody is complaining\"\nTrue. But at least on the first three pages of http://stackoverflow.com/questions/tagged/compiler , none are about compilers. They are questions about compilation issues.\n\n\"3. There’s a high probability that users of site [StackOverflow] would enjoy seeing the occasional question about [Compiler]\"\nOnce again, no, I think there really isn't."}, {"author_name": "Robert Cartaino", "gravatar_hash": "9dfd656461a1d0a2db33f3ed4183f4c0", "author_url": "http://stackoverflow.com/users/98786/robert-cartaino", "date": "Oct 01, 2010", "message": "@configurator: \n> “1. Almost all [Compiler] questions are on-topic for site [StackOverflow]” No, they aren’t.\n\nWell then, THOSE SITE NEED TO BE FIXED.\n\nIf Compiler Design is not welcome or effective on one of the many programming site we've already built, here's what needs to happen...\n\n(1) Fix the site so it *IS* welcoming to your PERFECTLY LEGITIMATE TOPIC, and\n \n(2) start adding functionality to these mega sites so people are able to form user groups/sub-communities they can hang out with and commune in their own, dedicated areas. The tag wikis and tag grouping is just the very beginning of tapping that functionality. Chat is another resource. THAT'S the area that needs to be fixed; but not by creating an endless stream of small communities for every specialize branch in *every* subject.\n\nIf we rush into creating these smaller, niche programming sites, it will REALLY, REALLY HURT your (and our) ability capitalize on the much bigger benefits of carving out your own little slice of a much larger site. That's what we should be working towards. THAT'S the best of both worlds.\n\n"}, {"author_name": "Barry Kelly", "gravatar_hash": "4a7b08fcb7e3d9a52ae473613b71bc3d", "author_url": "http://blog.barrkel.com/", "date": "Oct 01, 2010", "message": "Language design is, in practical matters, strongly related to the implementation techniques of a compiler. But it's really not worth my time arguing the point here; like configurator, I'm taking my ball and going home. Already at this point, the most I contribute to SO is questions related to the compiler my company produces (Delphi)."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Oct 01, 2010", "message": "I'm surprised the Google proposal on Area51 didn't get yanked: http://area51.stackexchange.com/proposals/1318/google\n\nIt's essentially WebApps, but specific to Google."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Oct 01, 2010", "message": "As others already said, classy apology and very nicely put (Although I can't comment on the facts because I wasn't involved.) However, this issue had been discussed on Meta a lot. There were at least five or six huge discussions about how those new proposals threaten to cannibalize S[OFU] proper. The fact that those discussions went un-commented on by the powers that be really created the impression that those proposals were okay with the management as long as they got enough traction."}, {"author_name": "moberley", "gravatar_hash": "297c8649d7bf3722b331469315dcc665", "author_url": null, "date": "Oct 01, 2010", "message": "@Shane The Libraries proposal has not advanced very far because most of the people committing to it are new to the Stack Exchange network.\n\nAccording to information posted on Meta Stack Overflow the Area 51 commit percentage is heavily weighted towards existing users with reputation. \n\nhttp://meta.stackoverflow.com/questions/53650/area-51-commit-percent\n\nAt the moment, almost 93% of commitments on Libraries are unique to that proposal. And, there are only a few commitments with high reputation."}, {"author_name": "Huperniketes", "gravatar_hash": "5dcf9c84cdc5d8e39116b880187afbbd", "author_url": "http://apokalypsesoftware.com", "date": "Oct 01, 2010", "message": "I take it then, that the proposals Software Engineering, Design Patterns and Development Methodologies will also be closed because they duplicate StackOverflow, and the proposal Project Management will not because it's the reboot of AskAboutProjects?\n\nAlso, I think a very large part of the problem is that these super-sized QA sites just don't feel tailored for specific subject matter. Perhaps the addition of topical façades for tags in StackExchange will help give those focusing on Compiler Design, VIM, UBUNTU et al the homey, intimate sense which is vital to foster community growth without fragmenting the whole community by making shared knowledge more difficult to access."}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Oct 01, 2010", "message": "@configurator: I honestly feel for you - after all, the site was *this* close to being launched after a 3 month wait. I totally agree with you - StackOverflow is not the place for these questions.\n\nI think our only hope is for StackOverflow to get a decent makeover and maybe divide the site up into 'sections' kind-of like a library.\n\nHow this would work or what it would look like - I really have no clue."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Oct 01, 2010", "message": "I agree. I don't see why anyone familiar with StackOverflow would want to create a separate compiler design Q&amp;A site. The idea that compiler or language design questions are not appropriate on a programming Q&amp;A site seems a bit silly. As some others have suggested, if that is the case, which I doubt, then modify SO such that such questions are appropriate."}, {"author_name": "Arjan", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "Oct 02, 2010", "message": "If I understand correctly, then these sites were not in beta yet? Could a beta site be closed as a duplicate as well? \n\nAnd if so: if for example apple.stackexchange.com would be discontinued (which I wouldn't mind, as I think it's really Super User questions), is there any chance the posts could be merged to Super User then?"}, {"author_name": "Arjan", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "Oct 02, 2010", "message": "Ah, to answer my own comment about migrating, after closing \"Gadgets\": http://area51.stackexchange.com/proposals/614/electronic-gadgets\n\n&gt; Tagged questions have been migrated to the Apple and Android sites.\n\nI doubt apple.stackexchange.com would be closed for too few visitors, but I still feel it's Super User questions -- at least the questions that are claimed on-topic in its http://apple.stackexchange.com/faq"}, {"author_name": "Aarobot", "gravatar_hash": "687f8a43b58fe35c8b2933f1f16b13cb", "author_url": null, "date": "Oct 02, 2010", "message": "You guys have referenced Ries and Trout before.  Did you all forget about the Law of Division?\n\nhttp://www.forbes.com/2007/01/04/jack-trout-on-marketing-oped-cx_jt_0105brands.html\n\nYou're trying to stop a naturally-occurring process from naturally occurring because you worry it'll erode support for your flagship product.  Except *you would still own the new categories!*\n\nYou're not only missing, but spitting in the face of a wonderful opportunity: To capitalize on this law in real-time, to own every new product immediately as soon as there's sufficient support to make it marketable.\n\nInstead, you've assured that you *won't* be the proud owners of any subcategory brands.  Whoever else gets to the market first, probably will.\n\nYou guys are dreaming if you think that this move is going to get anybody asking serious compiler design questions on Stack Overflow.  To use yesterday's analogy, Stack Overflow is (or has largely become) \"Programming for Dummies.\"  It's not your fault, it's what happens to *any* community that reaches such a size.  Compiler Design would have been, well, \"Compilers.\"\n\nOh well.  I know I'm talking to a wall anyway, but thought I should say something in light of all of the other things happening at the same time (i.e. revocation of domain names)."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 02, 2010", "message": "> I doubt apple.stackexchange.com would be closed for too few visitors, but I still feel it’s Super User questions — at least the questions that are claimed on-topic in its http://apple.stackexchange.com/faq\n\nApple is a classic example of a community defined by the things they all love (all iDevices and MacThings) and hate (everything not created by Apple is inherently inferior).\n\nIn other words, the Apple community needs its own reality distortion field."}, {"author_name": "kiamlaluno", "gravatar_hash": "f5ef1b81e1aeb3b921a3034d460ce6af", "author_url": null, "date": "Oct 02, 2010", "message": "Will be Drupal Answers closed too? Questions on Drupal are already asked on stackoverflow.com, and having a separate Stack Exchange site doesn't give to the questions more visibility."}, {"author_name": "Larry Smithmier", "gravatar_hash": "320610faffaa9fa6268f3d260b7e584f", "author_url": "http://microsoft.productiveedge.com", "date": "Oct 02, 2010", "message": "As someone who was looking forward to the Developer Testing site launch, but also as someone who is but a casual user of the SO/SE sites, I am not fully comfortable commenting on the closing of the proposed sites.  But, I do agree with Aarobot, and there isn't a 'like' or +1 for comments here (how we miss the things we are accustomed to.)  There was a committed group of users willing to work within the problem space that have just been alienated or devalued.\n\nGiven the reasoning for closing, the Apple, Ubuntu, Unix and Linux, Game Programming, etc. sites must eventually be consumed back into the fold (SO, SU, SF) as well, and yet there isn't a mechanism to effectively view a shard (group of tags) of SO, SU, or SF that can support these individual communities.  \n\nI personally have found it much more interesting to work within the new sites than dealing with the noise (especially on SO).  If you can provide us with a way to create true communities within SO et.al. _and_ switch between them, then great!  The current interesting and ignored tags falls well short of providing that level of separation."}, {"author_name": "Dan Larsen", "gravatar_hash": "3ae26e19fc6cd6f767a489a8b3237bd1", "author_url": null, "date": "Oct 02, 2010", "message": "I was closely following the Compiler Design project -- indeed the link to that proposal was the thing that drew me into the Stack Overflow community to begin with.  I'm really disappointed to see it go -- the community that was building around that site was very good, and looked ready to become a very useful resource to a very small but passionate community.\n\nNot since the heyday of comp.compilers have compiler and language nerds had a gathering place, and even the topics addressed on that newsgroup were relatively constrained.  I can understand not wanting to compete with yourself as a business, but the idea that a group of people who want to use your awesome system for a niche site (a subset of the SO user base if you will) can't is kind of disheartening.\n\nI was and am only a rank newbie on this site, but the death of the Compiler Design section will probably be the end of my posting on SO.  As such my opinion probably isn't worth much, but there it is."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Oct 03, 2010", "message": "I'm all for preventing fragmentation...But closing the Compiler Design Site?  Really?\n\nThe Compiler Design site was the one site that I saw on Area51 that could possibly compete on an equal footing with MathOverflow.  Why?  Because it involves an esoteric, highly specialized area of computing that arguably few mainstream programmers care about, but those few care deeply about it.  \n\nAnd because they care deeply about it, they were willing to go to the trouble to develop a community around this highly specialized topic and attract those highly qualified people who could speak intelligently about it.\n\nIf you are going to make a subcommunity on SO for the compiler designers, you're going to have to find a way to make compiler design a \"first-class citizen\" on SO, and not just a tag."}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": null, "date": "Oct 03, 2010", "message": "Robert Harvey's words articulate my thoughts exactly. Good comment, Robert - I wholeheartedly agree.\n\nRobert Cartaino: The fact isn't that the site isn't welcoming to those kind of questions. They just don't belong there because they don't have that community. If you think you can fix the StackOverflow framework in some magical way to enable communities to evolve there, by all means do and I would fully support that. But you simply cannot make the claim that the current StackOverflow, while a wonder site, supports that in any way. Seriously? The tag wikis generate a community? Can you honestly say that? They don't tap that functionality at all. Neither does chat. These tools don't allow sub-communities, they are tools for the bigger community. To allow for sub-communities to evolve, you're going to need much, much more than that, and currently, that is not possible.\n\nMy point is that with the current StackOverflow framework, which is an excellent framework no doubt, for the 'Compilers' community to exist it *has* to be a separate website. And you're claiming that the current websites are good enough, and that's why we don't need a compilers stack exchange. Well then, I'm here to say no. The current sites aren't good enough. And I don't think you can easily create sub-communities without destroying the main site's topic. I'd hate to see StackOverflow ruined because of something like that, and it's likely to happen if you make drastic changes to introduce said sub-communities and aren't careful enough. And if you don't make those drastic changes, sub-communities won't be able to exist.\n\nIn short, either introduce sub-communities but very, very carefully, or bring back the Compilers proposal."}, {"author_name": "Russell Leggett", "gravatar_hash": "cecf60ed29390dd113ed66dda9063d2a", "author_url": null, "date": "Oct 03, 2010", "message": "I was extremely excited about the compiler design stack exchange site, so like everyone else, I'm disappointed about it getting dropped. I wonder, though, if it had been framed differently, if it would have been dropped at all.\n\nFrom the beginning, I wondered why the compiler site was phrased as compiler specific. Investigating, it was clear that it was intended to be both language design and implementation, but all the questions were really implementation specific. Here, I think, is the crux of the problem. The argument could easily be made that specifically compiler implementation questions could fit well enough on SO, but language design really does not. That said, I think even the strictly compiler questions are less than appropriate (at least the interesting ones, anyway). According to the SO FAQ, \"Avoid asking questions that are subjective, argumentative, or require extended discussion. This is not a discussion board, this is a place for questions that can be answered!\"  Language design questions quite clearly fall into the subjective realm, but even many compiler implementation questions are difficult to fit into that category - but are still very much acceptable for a programming language group.\n\nPerhaps the current proposal is too close to being a duplicate, but maybe instead of simply closing it, something could be done to shape the portion that should broken apart from SO so that it would be acceptable. I ask you, Jeff, if I (or George) started a language design SE proposal would that be closed too? Would there be any programming related questions acceptable or would it have to be strictly theoretical?"}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Oct 04, 2010", "message": "@configurator et al:\nwhich compiler questions aren't on-topic for StackOverflow? Which compiler question would get closed there?\n\nAs for StackOverflow's compiler tag, I agree with you, it's not used for compiler design, but for compilation issues. So use a [compiler-design] tag instead?\n\n\"“3. There’s a high probability that users of site [StackOverflow] would enjoy seeing the occasional question about [Compiler]”\nOnce again, no, I think there really isn’t.\"\nI think there is. :)\nSO is big. There are a lot of newbie programmers who just want to know how to implement a binary tree, but there are *also* a lot of people interested in language theory, compiler design, semantics and everything else under the sun. There are a lot of people who are interested in practically *everything*.\nAnd there are already so many different subjects covered on So, *and no one objects*. No one have complained about all those dirty Python questions all over the place when they're trying to share information on SQL. No one objects to the homework questions being on the same website as questions about algorithmic time complexity. So why would anyone object to questions about compiler design?\n\nDo you actually use SO much? It seems that non-users have a hard time accepting that they don't get a nice comfy bubble to isolate them from \"all the others\", but my experience is that it's rarely necessary. If a SO user doesn't want to read compiler questions, he'll typically only read questions within his 2-3 preferred tags. If there actually was a problem with people not wanting to see \"foreign\" questions on their site, it would have surfaced long ago. It hasn't.\n\nThere are a lot of people on SO who'd be interested in compiler design questions. And these people would be able to discover them *if they're asked on SO*. Being on SO gives your subject/community a lot of free publicity.\n\nI'm not really sure what the big deal with communities is. SO works because communities *appear* there. They aren't \"created\" by SO, they don't \"evolve\" there specifically. But people with a common interest eventually find their way there, and that's really all the community you need. The C++ experts community on C++ isn't there because anyone said \"let's evolve a community\". But a handful of very knowledgeable C++ users ended up using the site. And they don't need special community features to stay in touch. You just look in the [C++] tag, and the people providing good answers are the ones you need.\n\nWhy wouldn't the same work for compiler questions?\n\nIn short, I think the compiler people need to worry less about communities, and more about asking and answering questions. If you do that, then a quasi-community *appears*. But I think what makes the SE sites work is that they're not focused on the community. They're focused on the questions and answers, and the community appears around that as a side effect. I think that's a good thing, even for compilers.\n\nWhy do you feel that compiler design specifically needs a separate website/frontend?"}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Oct 04, 2010", "message": "@Jalf:\n\nIf you're not a coffee drinker, the following analogy may escape you, but...\n\nThink of the Compiler Design site (or the MathOverflow site) as a Starbucks coffee house.\n\nNow you may agree or disagree about whether or not Starbucks makes good coffee, but what you can agree to is that fans of Starbucks are devoted.  They will go out of their way to find a Starbucks to get their morning cup of coffee.  And I'm not talking about the grande-lattee-frappe foo-foo drinks either; I'm talking about their core product: a tall house-blend for a buck and a half.\n\nHere's two things I know about Starbucks:\n\n1.  They didn't become Starbucks by putting their coffee on the shelf in the supermarket next to the Yuban and the Folgers.  They have their own store fronts.\n\n2.  Everyone who is a fan knows about the Starbucks they went to where the teenagers working there got it wrong.  They measured the coffee wrong, or they didn't clean the urns; they did something to screw up their perfect cup of coffee.  In short, they are amateurs.\n\nThe Compiler Design site differs from MathOverflow in one important respect: Programmers who are not specifically compiler designers can learn a whole lot from compiler design principles.  Like the barista who needs a mentor, the average programmer needs the compiler designers to show them the inner sanctum.\n\nBut you still have to attract the real experts, and I am not convinced that StackOverflow (in its present state) is an effective storefront.  MathOverflow was able to do this by promising the mathematicians they recruited that amateur questions would never be allowed on the website."}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Oct 04, 2010", "message": "...Continued from the previous message.\n\nLest you think I am one of the elitists who turns up their noses at anyone who doesn't understand an expression tree  (or how to make a good cup of coffee)...\n\nI am one of the amateurs looking for a mentor.\n\nThe real challenge is attracting the experts to the site.  Area51 has mechanisms to help with this; StackOverflow does not.  \n\nThe experts need to be convinced that StackOverflow is a viable home for them, and that's hard to do when every third question you see on the front page of StackOverflow is a question about how to fix my null pointer error."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": null, "date": "Oct 04, 2010", "message": "Apparently then one of the other platforms for Q&amp;A would be appropriate.  \n\nGiven the size of SO and the special-ness of compiler design it makes sense that there is a dedicated site for it.  \n\nJoel and the SE team were specific about other expert sites - that sites had to be very specific and high-level to attract the experts.  The content and level of folks at SO is, unfortunately, not going to bring the compiler experts out.  (assuming that there is a desire to have a specific community)\n\nWhile Mr. Cartaino's idea sounds nice - it is counter to what Jeff seems to have laid out in the plans for SO/SE - that it is NOT a social/community site.  So changing SO to have subcommunities seems a lot riskier than just making a new site.\n\nThis was a mistake I think, though one can see the reasoning behind it.  I don't see it happening the way the SE team hopes/expects.\n\nCertainly it would fragment the content, but at least we would benefit from the content rather than have nothing at all."}, {"author_name": "Paul Nathan", "gravatar_hash": "fc3225dc3119500fcbf7af646a83c914", "author_url": null, "date": "Oct 04, 2010", "message": "Well, that is completely irritating.\n\nThe reasons for keeping Compiler Design around have been well-articulated already by better articulators than I.\n\nFrankly, having communities begin building and then yanking their platform isn't a very nice way of doing business (SE 1.0, SE 2.0, Area 51 New Policies).\n\nI believe at this point there is more future for new communities on software such as the OSQA platform than on the SE platform.\n\nSo long and thanks for all the fish."}, {"author_name": "Mouli Arun Prabhu", "gravatar_hash": "cb3286de56590722c86123e898219a4d", "author_url": null, "date": "Oct 04, 2010", "message": "Like Aarobot said, even if new sites may cannibalize SO, it is you are having control over it.\n\nThe result, more organised SO and sub.stackexchange.com What is really the problem\n\nNew subsites will allow the formation of communities with unique characteristics. If Compiler Design stays with SO, it is not big enough to bloom to its maximum potential.\n\nSo, please let us have a compiler design/language development. Even an emacs and vim sub exchanges, these are big enough topics, trust me.\n\n:)"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": null, "date": "Oct 04, 2010", "message": "Perhaps it is better to figure out how to handle this issue by sharing content across sites that overlap.  It is better to handle this with technology than to (keep) pulling the rug from under your user base.  \n\nIt almost seems like the SE/SO team is expecting users to take on the bookkeeping chores that software and databases can do well.  \n\nI hope you guys figure it out. (whatever it is you are trying to accomplish)"}, {"author_name": "Jakob", "gravatar_hash": "50033d609f9a8a0d175159038a191c43", "author_url": "http://jakoblog.de/", "date": "Oct 05, 2010", "message": "Damn, I was looking forward to the Q&amp;A dedicated to testing. Now you just pointed to the \"testing\" tags at SO and Programmers - but there is not even a <a href=\"http://stackoverflow.com/tags/testing/info\" rel=\"nofollow\">tag description</a>. Instead some testing-related tags (it is not clear which) are marked with an advertisement icon. Ok, I understand that you do not want separate communities, but just pointing to one paid tag as the relevant subset of SO looks bad."}, {"author_name": "Arjan", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "Oct 06, 2010", "message": "&gt; Apple is a classic example of a community defined by the things they\n&gt; all love (all iDevices and MacThings) and hate (everything not created\n&gt; by Apple is inherently inferior).\n\nI am a Mac (but not an iPhone), and I disagree. The decision to set up a community on its own is fine with me, but I just won't bother to get 2k/3k rep to contribute there. I hope others feel differently though!"}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": "http://www.compiler-design.com", "date": "Oct 10, 2010", "message": "To everyone that was disappointed by having the rug pulled out from under compilers.stackexchange.com, I’ve got some good news. A small group of us has banded together to create the website instead, and we’ve started a private beta. By private, of course, I mean only people who have heard of it will be able to access it. The website is currently at the heavily-hyphenated subdomain http://super-secret-private-beta.compiler-design.com/ - and all who committed or were interested in the original proposal are welcome to join. For more details see http://www.compiler-design.com/why ."}, {"author_name": "Andy", "gravatar_hash": "53a0bda7baced4e0489e553ff534f228", "author_url": null, "date": "Oct 13, 2010", "message": "I don't have much to add to the people who've already commented, but please consider bringing back the compilers stack overflow. One of the primary reasons to split up compilers/languages from the rest of SO is to encourage a different sort of culture—ideally something like the thoughtfulness and intelligence of lambda-the-ultimate without the barrier to entry."}, {"author_name": "John", "gravatar_hash": "135df5e131c40248e4caf6a72561c26e", "author_url": null, "date": "Oct 14, 2010", "message": "Assuming Jeff is still listening to the community, I'd like to add a small point:\n\nLook at the list of users committed to Compiler Design. Almost have of them have less than 100 rep, and almost half committed to *only* that one proposal. These are people that *don't* hang out on Stack Exchange, and now they never will. You had a chance to expand your user base, attracting those \"experts\" you wanted, and then you drove them away with an opaque [closed] in Impact font.\n\nIf that were my first impression of SE, I'd feel slighted... I have a feeling those guys are never coming back.\n\nYou corrected yourself once with an apology, why not do it again? As you said, this is a learning process. Please do the right thing."}, {"author_name": "Nick", "gravatar_hash": "927c0d2243e62d0359701aa62d3a95e0", "author_url": null, "date": "Oct 17, 2010", "message": "Thanks for wasting my time, fuckwits."}, {"author_name": "Sharpie", "gravatar_hash": "69713886aac8c55b618621a1505dd727", "author_url": null, "date": "Oct 29, 2010", "message": "Just dropped by Area 51 today to check on the status of the Compiler Design proposal and saw that it was closed as a duplicate of the [compilers] tag on Stack Overflow.\n\nI would agree that compiler design may be a subset of the [compilers] tag but not a duplicate.  The problem is that [compilers] contains a lot of questions that are just noise to someone interested in compiler design.  In fact, when browsing this tag for interesting questions related to compiler design there were so many \"Help! My code doesn't compile with compiler X\" questions tagged [compiler]  that the signal to noise ratio was so low, I eventually gave up.\n\nSo where is the supposedly duplicated section of Stack Overflow that will let me view questions related to compiler design and nothing else?"}]}