{"response": [{"author_name": "Nick Johnson", "gravatar_hash": "dc69af7dd7151a00843602888638fabb", "author_url": "http://blog.notdot.net/", "date": "Oct 04, 2010", "message": "Good changes - I look forward to wading through fewer poorly thought out questions.\n\nWhile we're on the topic, though, is there any chance of giving those of us with &gt;10k reputation, or a gold badge in a relevant tag, more power over questions? If I'm the expert on a subject that's relatively quiet, it's a bit absurd to have to wait for 5 other people - who may never come along - to mark a question as a duplicate when it clearly is. As a result, there are a lot of questions that are duplicates, but don't have enough close-votes."}, {"author_name": "Aditya Menon", "gravatar_hash": "55d7fb2e6e2c49f5bfa2bf873eb06d09", "author_url": "http://www.paddyvisions.com/insta-website.html", "date": "Oct 04, 2010", "message": "Yay! Goodbye to free-lunch-please questions. Good going Atwood.\n\nAnd yeah, Nice problem to have :)"}, {"author_name": "J. Pablo Fernández", "gravatar_hash": "931970b8dc51b72e05e3a12b88612d61", "author_url": "http://pupeno.com", "date": "Oct 04, 2010", "message": "If I were you I would have an intermediate page, after typing the question, where you show again the search results that only pop ups to users with low reputation."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 04, 2010", "message": "@Pablo\n\nThe problem there is the sunk cost fallacy; once the user has gone to the effort of composing an entire question, are they REALLY going to decide to throw it away?\n\nJust seems extra-extra-unlikely to me..."}, {"author_name": "icelava", "gravatar_hash": "211e4c1e328a4bdc705c72828fe3e4b3", "author_url": "http://icelava.net", "date": "Oct 04, 2010", "message": "Is it me, or do I pay more attention to the advice page if the header text were of much larger size?\n\nUsually a graphically rendered instruction step guide catches my eyes, hough i wouldn't recommend it outright for Stackoverflow; just that it could do with some additional formatting to make me want to read it instead of looking for the button/link that will bring me to the \"next\" page.\n\nhttp://www.puresilva.com/images/3easysteps.jpg"}, {"author_name": "BoltClock", "gravatar_hash": "a2d818d801ce38a33807f68fdd92043a", "author_url": "http://NOVALISTIC.com", "date": "Oct 04, 2010", "message": "<blockquote>\n\nBeyond this, we’re also starting to <strong>actively block questions from IPs and accounts that have historically produced a lot of low-quality questions.</strong>\n\n</blockquote>\n\nAh, I remember that one time when <a href=\"http://meta.stackoverflow.com/questions/53806/a-number-of-duplicates-posted-in-the-last-hour-by-different-users\" rel=\"nofollow\">students from an Indian university at large were introduced to Stack Overflow</a>.\n\nI like where this is going. I certainly support the How to Ask page!\n\nLooks like I'm going to have to spend more rep downvoting stuff though — I'm not into casting downvotes unless they're on posts that are actively harmful or just technically incorrect."}, {"author_name": "Roger Pate", "gravatar_hash": "04f4ec07b64277359378543ba9a6b1b8", "author_url": null, "date": "Oct 04, 2010", "message": "Nick: If you really need it closed, you can flag for moderator attention.  However, leaving a comment (which is automatically done when you vote to close as a duplicate) is already a *much* better state than otherwise: no indication it might be a duplicate at all.\n\nIt rarely seems like a good idea to only need one vote to do anything (I realize you didn't request this exactly)—even flagging for moderator attention gets agreement from two people (you + moderator), one of which is heavily involved in managing the site.  (In fact, SO originally only required one vote from anyone to close.)  However, you can make an improvement to the question (even just tags) or an answer to bump it to the front page.  More users will see it, and they may also vote to close as a duplicate."}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Oct 04, 2010", "message": "A good problem to tackle, but sounds like the worst possible approach.  Like Joel wrote: \"In fact, users can't read anything, and if they could, they wouldn't want to.\"  The only thing a wall of text does is annoy users.  I certainly don't read these screens, I just scroll down and click OK if I have to, but usually I check back my Google results for a better site.\n\nThe 3 input field question form was one of the things that made Stackoverflow great.\n\nThe good thing would be to bring back the good questions.  Some random ideas: increase rep reward for good questions, introduce rep inflation (show rep over last year by default), and make it EASIER instead of harder for people with good questions"}, {"author_name": "Diego Mijelshon", "gravatar_hash": "f00318698e65fce00b7cbd612a466571", "author_url": "http://sessionfactory.blogspot.com", "date": "Oct 04, 2010", "message": "To add to what Nick Johnson said: it's currently \"difficult\" to moderate, both because of the number of votes required to close a question, and because downvoting affects negatively the voter's reputation, as if it were bad behavior.\nWhen Stackoverflow began, the high percentage of alpha geeks it had made it more important to encourage upvoting and discouraging downvoting (for the same reason Facebook doesn't have a Dislike button, and because us geeks usually have strong personalities).\nBut now, the numbers have changed. Maybe it would be better to limit downvoting (say, to 2 or 5 votes per day, change that for 10k, etc) but regard it as a necessary action."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Oct 04, 2010", "message": "I think the how-to page is a good idea. Just one thing: does \"make it relevant to others\" really belong on that list, and in that location on the list?\n\nWhen I think about the questions I've asked on SO, I've never tried to make a question more relevant to a larger group of people, just so I'd get more participation. I need an answer to _my_ question, not a more generalized version of it. The goal should be getting answers, not generating interesting questions. \n\nSo maybe I'm not getting this guideline, but I really don't see how I can take a burning question that I need answered in order to get a job done and somehow modify it so that more people will find it interesting. Some subjects are just narrow and very particular...\n\nAlso, no word on how to post code? Better to remind people that posting their problematic code (when relevant) will help them get good answers. Much more than generalizing the question, in my opinion."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Oct 04, 2010", "message": "\"it’s 5 simple rules that fit on a single page with no scrolling.\"\n\nWell, that depends on your monitor. I measure the page at 1110 pixels tall in Firefox (including browser title, menu, address, and tab toolbars, and status bar at bottom), or 935 pixels to the \"proceed\" link. Not sure what percentage of SO users have a vertical resolution of at least 935, but I'm in the group with less. I imagine many laptop users have less."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "Oct 04, 2010", "message": "StackOverflow has certainly progressed through the life cycle of an online community quickly.\n\nIn just over 2 years, we're now at the point where we require new users to click through (I'm doubtful most will read) a lengthy set of guidelines.\n\nThe fun part is a dot in the rearview mirror."}, {"author_name": "Kevin Trout", "gravatar_hash": "7a0762465103aec8849fbff171f78acd", "author_url": null, "date": "Oct 04, 2010", "message": "Supported!  I worry when I see questions that represent no effort on the poster at all to find the answer before posting.  It's like that person in the office who always asks someone else (you!) before even attempting to figure it out themselves (annoying! and disrespectful).  I don't think SO members mind simple (easy) questions.  I think they do resent 'homework' and 'provide me a complete solution' problems.  IE:  how do I make a user authorization system for [insert language here]?"}, {"author_name": "Kev", "gravatar_hash": "a9840656ceee0faa528806c4c04a9399", "author_url": "https://twitter.com/teh_klev", "date": "Oct 04, 2010", "message": "Great idea, it was getting a bit depressing to hit the StackOverflow frontpage and see it turning into the programming equivalent of yahoo answers.\n\nAlso, and selfishly, the thought of having my own reasonably well thought out questions (and those by other users) drowned by these numpties is somewhat annoying."}, {"author_name": "Rob", "gravatar_hash": "063cfecea601ed055650bc8e0c941c00", "author_url": "http://chomp.com/robw", "date": "Oct 04, 2010", "message": "I'd like to suggest that a \"new user\" question should require a constructive criticism comment in order to downvote it."}, {"author_name": "Skilldrick", "gravatar_hash": "2b0a93dc132be4bf3b15b50c8a7e8089", "author_url": "http://skilldrick.co.uk", "date": "Oct 04, 2010", "message": "I generally support this - the more you can make people think about the questions they ask the better, and punishing those who consistently ask bad questions is a great idea.\n\nI really think that if you want the higher-rep users to start downvoting bad questions more you'll need to remove the downvote penalty - like Diego said, we shouldn't be punished for highlighting bad questions.\n\nMaybe there should be a rep limit where downvoting no longer results in -1 rep? Surely users with &gt; 5k (or 10k even) can be trusted to not be jackasses."}, {"author_name": "Barry", "gravatar_hash": "def841fd255b10c88778743b88fbb29b", "author_url": "http://stackoverflow.com/users/300863/barry", "date": "Oct 04, 2010", "message": "I think this is good idea, although as others have stated, I'm not sure many Users will actually read it.\n\nWill the \"How to Ask\" page display before the user has started typing their question?  I would guess that it does.\n\nAnd also, will it be implemented across all current and future Stack Exchange sites?"}, {"author_name": "Mouli Arun Prabhu", "gravatar_hash": "cb3286de56590722c86123e898219a4d", "author_url": null, "date": "Oct 04, 2010", "message": "\\once the user has gone to the effort of composing an entire question, are they REALLY going to decide to throw it away?\\\n\nThen, let the user enter the title first ask to press [Next-&gt;] do a site search if a similar question exists.\n\nThis is a slow process for the user, so like Pablo suggested, limit it to new users or users on an asking spree"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": null, "date": "Oct 04, 2010", "message": "SO has gotten to the point where it is overwhelmingly large and can be simpler to ask new questions than to search through old one.  There are a lot of new folks who want to earn hitpoints by answering questions.  They are not served by pointing others to the older/duplicates.  \n\nNot sure how you solve the problem, but you have reached one of those \"it will be a nice problem to have when we get there\" kind of things.  \n\nIs the &lt;= 10 number actually useful?  I assume you checked to see that the majority of bad questions came from &lt;= 10."}, {"author_name": "warren", "gravatar_hash": "6dd14cc7bdd50eea6aa6dc46d8a548cc", "author_url": "http://antipaucity.com", "date": "Oct 04, 2010", "message": "Personally, I find that 7 times out of 10, the question I'm trying to ask has already been asked, and the act of typing my title will lead me to relevant information.\n\nHowever, on those other 3-in-10 times I need to ask, I always try to follow the theory of giving the information I would want to see if someone were to ask me the same thing (if, of course, I can think of it)."}, {"author_name": "Aiden Bell", "gravatar_hash": "60f28d36c1439f965e2fb55419621968", "author_url": "http://stackoverflow.com/users/104040/aiden-bell", "date": "Oct 04, 2010", "message": "I agree 100% with the sentiment. I have a quick 2-mins here or 2 mins there to find some good questions. The influx of poor questions, or good questions answered with a 2 second Google search are very off-putting."}, {"author_name": "hop", "gravatar_hash": "0c6524ce20ccace7c2f65e31e7f52ba7", "author_url": null, "date": "Oct 05, 2010", "message": "remove the cost of downvotes, already"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 06, 2010", "message": "The \"cost\" of a downvote is one rep. ONE REP!\n\nIt's there for a reason, though one rep is nothing in the big scheme of things. If you cast a downvote, you must mean it, because it costs you a teeny-tiny bit of rep.\n\nI am continually astounded that the ONE REP cost of a downvote is such a \"serious\" disincentive, even for users with tens of thousands of reputation.."}, {"author_name": "Duncan", "gravatar_hash": "37758cbf7e480d283959f1e6ba7e3c34", "author_url": null, "date": "Oct 06, 2010", "message": "If someone has 10,000 rep and if 10% of questions deserve a down vote then the cost to them is (2,000 / 10) 200 rep per day.\n\nI am not affected either way but you have to see that asking people to actively daily down vote at above the rate they can gain daily up votes is asking a lot. It is fine to ask but you may be somewhat disappointed in the level of compliance.\n\nI am not saying what the answer is but claiming that it is meaningless because it is just one rep (in caps no less) is probably not the most responsive approach to the most committed members of SO.\n\nAnyway, as I say, I am not affected either way so who cares what I think."}, {"author_name": "Joren", "gravatar_hash": "ef4c1a32c167f4f0250d356e6d063b6f", "author_url": null, "date": "Oct 09, 2010", "message": "Duncan, you read 2000 questions a day?!\n\nI think it's more like 1% of questions is bad enough for downvoting to be productive, and I can't imagine reading more than 100-200 questions every day.\n\nThere are probably a handful of people who do read that much, but I don't think we should introduce rules that only matter to the Jon Skeet user type ;)"}, {"author_name": "0xA3", "gravatar_hash": "513af11d53b156abf7351dcfcda72ffd", "author_url": null, "date": "Oct 11, 2010", "message": "The \"How-to-ask\" page is great! However, in my opinion it is missing some important pieces of information that people new to SO frequently get wrong as SO works different than the usual forum/Q&amp;A site. \n\nI think the introductory page would benefit from adding the following information:\n\n- Questions can and should be *edited* and additional information should not be posted as an *answer*. \n\n- SO is fast so people asking questions should stay tuned and respond to comments.\n\n- A short introduction that voting and accepting answers is key."}, {"author_name": "theChrisKent", "gravatar_hash": "6237407d8faf301522a90d88f0a796cf", "author_url": "http://WireBear.com/blog", "date": "Jan 08, 2011", "message": "I agree with a lot of what @OxA3 said. I like the new measures. I'd love to see the following added as well:\n- a large and obvious reminder to new users to mark the correct answer\n- the ability for new users to upvote answers to their own questions regardless of rep\n- some form of penalty for users with very low accept rates. I often refuse to answer questions for people with less than 40% (I leave a comment too). This isn't me being petty and demanding my 15 points. I'm trying to protect the community and possibly educate ungrateful users.\n- a reminder to users with very low vote to answer ratios. There seem to be a lot of users who are quickly scanning for a question they can answer and aren't taking the time to support fellow user efforts. I'm always sad when I see questions with good answers/questions with 30+ views and only 1-2 upvotes.\n\nI love these sites and am amazed by the ways you guys have adjusted and matured to such a large site with a strong user community. I am confident that these growing pains will be beneficial in the long run. Thanks!"}, {"author_name": "Sam Bowyer", "gravatar_hash": "12f15d8541d0829261853cdaa82f0143", "author_url": "http://N/A", "date": "Nov 01, 2012", "message": "I like this system. I'm new to php and got directed here by someone who recommended it to get help from 'those willing to give it' - he described it as a bit of a self-help site; something like yahoo answers where you ask other people to help solve your problems, rather then strike strong conversation.\n\nOn signing up for StackOverflow; I really didn't see anything that contaried this; even the first few questions I jogged through were specific code that from my eyes at the time would have been useful only to the initiator.\n\nFollowing on, I started asking questions that got me down-voted. I think letting users know SO is NOT a self-help site but more a discussion system in Q/A format for those advanced and experienced with core programming languages and software on signup could significantly reduce people like me joining - and I will admit, a move that has only negatively affected SO users."}, {"author_name": "Keoma", "gravatar_hash": "b3f9acbb671c870d76ae882f2f7f8999", "author_url": "http://solorpggamer@hotmail.com", "date": "Nov 10, 2012", "message": "Late to this discussion, but why not have a question go through review by a number of people with at least X amount of reputation for approval?  You need Y number of votes, and if the question gets a majority of the vote, it gets posted. \n\nI know you already have a process like that to close questions, but it might work better at this point to be pre-emptive, given that you have a different problem now."}]}