{"response": [{"author_name": "UncleZeiv", "gravatar_hash": "bd24dab59beada36b501670cd01b8e2c", "author_url": "http://unclezeiv.kerid.org", "date": "Oct 27, 2010", "message": "I have to confess, I miss the podcast. I know you are very busy but... couldn't we have, like, a monthly show?\n\nAnyway, I'll watch the interview in the meanwhile :)"}, {"author_name": "Alexandre Jasmin", "gravatar_hash": "ebb42d2495567b4d80d528b06d5f3097", "author_url": "https://twitter.com/ajasmin", "date": "Oct 27, 2010", "message": "You should just scroll pass all these videos and click on the link at the bottom for the HD version."}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": "http://itcookbook.net", "date": "Oct 27, 2010", "message": "Jeff, can you speak conclusively about the podcast? The final podcast(s) suggested that there would be a revamping of the format, but that new podcasts would return after a hiatus. Now you say you don't have a podcast anymore.\n\nSo, er ... is that it? I really did enjoy the podcasts, including Joel's ruminations on why the world is banana-shaped. I for one, keep hoping they will return in some way. But just knowing definitively whether they're gone for good or what would be a nice thing.\n\nThanks!"}, {"author_name": "wug", "gravatar_hash": "dca8abee1255f6425a4cebf403263c24", "author_url": null, "date": "Oct 28, 2010", "message": "I must concur, the podcast is highly missed. I'm in the middle of re-listening to all the podcasts, and that stuff was really great. I would love to see the podcast re-incarnated in some fashion. Or, at the very least, can we have a final word on the fate of the podcast?"}, {"author_name": "Jonathan Conway", "gravatar_hash": "30b5f67cfae1269e00a66300d98c025d", "author_url": "http://www.jonathanconway.net", "date": "Nov 06, 2010", "message": "Another vote for bringing back the podcast! LOL\n\nJeff you must be getting tired of people asking, but what can I say? You &amp; Joel always seem to always be on point and have good topics to talk about."}, {"author_name": "David Seruyange", "gravatar_hash": "880fe2226a83569aa89f46da05268fc8", "author_url": "http://metadeveloper.blogspot.com", "date": "Nov 07, 2010", "message": "+1 for the expressed sentiments that you continue the podcast."}]}