{"response": [{"author_name": "Alnitak", "gravatar_hash": "6655fd302d011e3c3355a4809bc8f610", "author_url": null, "date": "Oct 30, 2010", "message": "I wonder just how many other Dell servers are out there running undetected at low speed...   Very poor show from them."}, {"author_name": "knweiss", "gravatar_hash": "bece04f51d792fd981d6cba5fa8aca44", "author_url": null, "date": "Oct 30, 2010", "message": "Jeff, I think you've mixed up the CPU names. Your new database CPUs are Westmeres (Xeon 56xx) not Nehalems (Xeon 55xx). Nehalems are quad-cores just as your old Harpertowns (Xeon 54xx)."}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Oct 30, 2010", "message": "@knweiss ... \"gulftown\" are indeed Nehalem architecture based cpus, http://en.wikipedia.org/wiki/Xeon#Nehalem_based_Xeon\n\nhttp://en.wikipedia.org/wiki/Nehalem_(microarchitecture)"}, {"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Oct 30, 2010", "message": "... erm.. but the reason for a lots of memory is so that you never have to hit IO, because the database puts as much as you need into ram as possible. It's doing tons of caching."}, {"author_name": "Mircea Chirea", "gravatar_hash": "ab09b3a751c4ea46cbc048be252bd399", "author_url": null, "date": "Oct 30, 2010", "message": "You should leave HyperThreading enabled. All Windows operating systems since XP are aware of it and will spread threads evenly on all cores before starting to make use of HyperThreading (running a second thread / core).\n\nThis provides 50%-75% more processing power with no significant disadvantages (since there's no risk of the OS loading a core with two threads while others sit idle)."}, {"author_name": "Aarobot", "gravatar_hash": "687f8a43b58fe35c8b2933f1f16b13cb", "author_url": null, "date": "Oct 30, 2010", "message": "Congratulations Jeff!  That's an awesome improvement.\n\nJust for the record, good luck fitting your entire data set in memory when your data set is in the terabytes, and most of it gets used every day.  User scaling and data scaling are two very different animals!"}, {"author_name": "Joe", "gravatar_hash": "9f292b4d2ebd0b6ca38936fb5933d401", "author_url": null, "date": "Oct 30, 2010", "message": "@knweiss or, tl;dr:  Westmere IS Nehalem, but smaller, and with a possibility of having more cores."}, {"author_name": "HardwareGuy", "gravatar_hash": "fcfc36d64bd909df102dc91c961554af", "author_url": "http://www.google.com/", "date": "Oct 30, 2010", "message": "Now that you have your clock speed issue fixed, time to really give it the spurs and turn hyperthreading back on!"}, {"author_name": "Frankie", "gravatar_hash": "5a46c45ae5e044a4e63c9ed91b7b7c0a", "author_url": "http://pulsarcap.com/", "date": "Oct 30, 2010", "message": "Right and upfront. Thank you very much for sharing. There is nothing better than learning with actual \"big-site-problems\" to sketch up an upgrading plan that covers some of these little-to-unknown oddities.\n\nThank you!"}, {"author_name": "Brent Ozar", "gravatar_hash": "77f776c2eaf0cc691e8a0880bb8a191f", "author_url": "http://www.brentozar.com", "date": "Oct 30, 2010", "message": "@HardwareGuy and Mircea - the problem with hyperthreading on database servers is that SQL Server is memory-intensive.  When you enable hyperthreading, you're effectively slicing the CPU L3 cache in half - twice as many threads are now competing for the same L3 cache space.  This isn't an issue for processor-intensive apps that aren't as reliant on data, but it's a huge issue for SQL Server.\n\n@Aarobot - I'd argue that if you're trying to scale a database to the terabytes on a single box and all of it is used every day, you're doing it wrong.  You need to scale out."}, {"author_name": "Richb", "gravatar_hash": "f60eb5acbc8796c962c131b86aa652c9", "author_url": null, "date": "Oct 30, 2010", "message": "Stack exchange would appear to be read mostly. You still need the io performance if you are write mostly or more evenly read/write. \n\nSurprised you don't cache your data in a better data structure in the app tier if it all fits in ram and is predominantly read only."}, {"author_name": "Ryan", "gravatar_hash": "6c08091427764bcb7e0623c69603c27c", "author_url": "http://ryantate.com", "date": "Oct 30, 2010", "message": "Can anyone speak to why the #$%@! Dell would ship servers in anything _but_ \\hyperspeed mode?\\ Why does that mode even exist? Who wouldn't want to go \\hyperspeed?\\\n\n It reminds me of the old \\turbo\\ button on PC cases, except those had a reason to exist at one point (something to do with games on slow early gen PC microprocessors)."}, {"author_name": "Quentin", "gravatar_hash": "0ed9d2b8c1a3c48e8d7d366a39adb850", "author_url": null, "date": "Oct 30, 2010", "message": "It's good for big site issues to be publicly detailed.  Experiences like this are valuable to us all to see.  And entertaining!  Congrats on the new metal."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Oct 30, 2010", "message": "@Ryan - i'm guessing Dell want to get into the profitable enterprise consulting market, where you pay an HP/IBM specialist to tune your system.\n\nWith IBM you end up paying an IBM consultant to tell you what IBM hardware you need to buy in the first place"}, {"author_name": "Iyan", "gravatar_hash": "fa67d0dda39b26188318a412b4023126", "author_url": "http://www.sentramodem.com", "date": "Oct 30, 2010", "message": "@Mircea Chirea \nYou sure with those percentage?"}, {"author_name": "Alexandre Jasmin", "gravatar_hash": "ebb42d2495567b4d80d528b06d5f3097", "author_url": "https://twitter.com/ajasmin", "date": "Oct 31, 2010", "message": "I have no experience building high end database boxes but my impression is that RAM speed (freq/latency/channels) may have a greater performance impact than CPU speed. Aren't the indexes so large that you spend all your accessing RAM?"}, {"author_name": "Stephen", "gravatar_hash": "cbc8e2240caacb5300ad2869487be5e0", "author_url": null, "date": "Oct 31, 2010", "message": "Hyperthreading isn't going to give you anywhere near that performance improvement..\n\nI'd expect 5% or so."}, {"author_name": "JasonMichael", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": null, "date": "Oct 31, 2010", "message": "Maybe you should get rid of MicroSoft SQL and servers...  Couldn't a Linux solution get more more for the amount of money you've spent?  Oh, never mind, then you'd have to get rid of all your code...  .NET based eh?\n\nMaybe Mono's the answer, and moving things to another platform.  Otherwise, you might need need a couple MicroSoft server farms (I know, they don't still call them that... there's some other fancy name.... ) to get the improvements you want."}, {"author_name": "Oscar Zamora", "gravatar_hash": "d9ddc1b28c9f2a50fb544fd571a741aa", "author_url": "http://ozamora.com", "date": "Oct 31, 2010", "message": "With @Richb on this one."}, {"author_name": "Aaron", "gravatar_hash": "03ee62de2bfb158a606a3e1892b432ad", "author_url": null, "date": "Oct 31, 2010", "message": "What were the bios settings you changed ?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 01, 2010", "message": "@aaron that is documented on Server Fault of course\n\nhttp://serverfault.com/questions/196301/disable-cpu-scaling-in-windows-server-2008-r2"}, {"author_name": "helvick", "gravatar_hash": "76362501ded35fad298a3beae5eecb11", "author_url": null, "date": "Nov 03, 2010", "message": "The RAM config that you give for your new servers is a bit odd for Westmere\\Nehalem Servers if performance is your main objective. It might be fine but you don't provide enough detail to be certain and I've seen many examples where a RAM size like this indicates that not enough attention has been paid to ensuring the memory config is optimal. \n\nTo ensure maximum main memory bandwidth and lowest latency on Xeon 55xx\\56xx platforms you should be populating the DIMMs so that all 6 channels (three per CPU, assuming a dual cpu server) have the same number (and capacity) of DIMMs present. You can't have everything completely balanced with a 64GB config. At worst you have 8x8GB DIMMs populating only 4 channels; possibly you have 2 channels with 2 8GB DIMMs per channel and 4 with 1x8GB each which might not be so bad; and there are other 8GB\\4GB combinations none of which are ideal.  \n\nDell's standard options for the R610\\710 servers list a 64GB config with 8x8GB DIMMs that is set to \"Advanced ECC mode\" by default - that sacrifices bandwidth (one channel goes completely unused) for increased error correcting capability. That's a good option to have but it may not be what you want. It should be possible to have 64GB running at 1333Mhz on the X5680 -  if the DIMMs are not quad ranked, and you have them populated with 2 DIMMs in channel 1 and 1 DIMM each in the other 4. However you still end up with an unbalanced setup - you have two controllers managing 50% of your main memory and 4 managing the remaining 50% which isn't ideal.\n\nIf high bandwidth and low latency (rather than absolute capacity, or fault tolerance) are your priorities there are a couple of rules you should follow.\n\nAvoid using 16GB DIMMs for now because you can't get 1333Mhz modules in that capacity (as far as I'm aware), \n\nUse no more than 2 DIMMs in each channel because if you have 3 DIMMs in any channel then all channels will run at 800Mhz. The Westmere (Xeon X5600) handle this better than the original Nehalems (Xeon X5500) which was limited to 1 DIMM per channel at most for DDR1333.\n\nYou have to use RDIMMs not UDIMMS (almost certainly not an issue for you given the capacity you have).\n\nAvoid quad-ranked DIMMS - at best you will be able to run at 1066Mhz if you use QR DIMMs.\n\nIf you get it right you will have 6 channels each managing the same proportion of your total memory with all DIMMs running at 1333Mhz. \n\nThis Dell document goes into much more detail - http://www.dell.com/downloads/global/products/pedge/en/server-poweredge-11g-white-paper.pdf. It is slightly out of date in that it refers to the Xeon 5500 rather than the newer Xeon 5600 series but the only significant difference is that the 5600's that you have can now run DIMMs at 1333Mhz even if there are 2 DIMMs per channel."}, {"author_name": "Mircea Chirea", "gravatar_hash": "ab09b3a751c4ea46cbc048be252bd399", "author_url": null, "date": "Nov 11, 2010", "message": "@Iyan @Stephen\nYes I am sure with those. Unless you do the same thing on the threads running on the same core, which won't run as fast as it could, but if one thread does integer math and another float, then yes.\n\n5% for running a thread nearly in parallel is a massively pessimistic improvement.\n\n@Brent Ozar\nIn that case you should set SQL server to use only X threads, where X is your number of cores. That way the OS and whatever else is running can run in parallel without the OS switching between them. Hopefully SQL Server has such a setting.\n\n@helvick\nI think the R710 only has 4 DIMM slots / CPU, that means three DIMMs, one per channel, and another odd DIMM. Using memory in that DIMM will cut your bandwith to single-channel, unless Dell's BIOS sucks and it falls back to dual-channel or single-channel if that slot is populated."}]}