{"response": [{"author_name": "Pieter van Niekerk", "gravatar_hash": "d5fef99ee1ae2aebe06d91ed48899dd9", "author_url": null, "date": "Oct 05, 2010", "message": "Brilliant article.\n\nI totally agree that coming up with a good name is the easy part, the trick is getting the domain name. \n\nI wont even mind sites keeping the beta names, e.g Gaming, Web Apps etc.\n\nBut yes, the *actual* question really is..\n\nWhat is your community about?"}, {"author_name": "badp", "gravatar_hash": "c81f585328c241594864f888f1154025", "author_url": null, "date": "Oct 05, 2010", "message": "Robert, can you please post a link to this blog post as an answer to http://meta.stackoverflow.com/q/66443/13992 so I can mark it as accepted and have it stand out?"}, {"author_name": "Graham", "gravatar_hash": "4039a2862643bd30e8d31568e3ff3e87", "author_url": null, "date": "Oct 05, 2010", "message": "The biggest problem is that \"Nothing To Install\" is a horrible, awkward name that manages to be overly descriptive and (out of context) completely meaningless at the same time.\n\nNow, you might be able to overcome that if you put the same amount of effort into promoting the \"Nothing To Install\" brand as you did with the earlier sites, but I haven't noticed any willingness of you to do that, which leaves \"Stack Exchange\" as the far stronger brand."}, {"author_name": "mafutrct", "gravatar_hash": "a7c22254d91baa9ca18786a9d46549f0", "author_url": "http://mafutrct.wordpress.com/", "date": "Oct 05, 2010", "message": "I'd really prefer descriptive names like \"web apps\", \"gaming\" or \"cooking\" to things like \"nothing to install\". It worked for SO, but SO has a far bigger growth potential for multiple reasons. Just my 2 ct."}, {"author_name": "John the Seagull", "gravatar_hash": "27a12fdc32baf8748018d373a973d22f", "author_url": null, "date": "Oct 05, 2010", "message": "My opinion (as stated in http://meta.stackoverflow.com/questions/66617/will-so-inc-ever-commit-to-announce-any-controversial-changes-before-actually-mak) is that making changes without announcing them a priori shows that you don't actually care to listen. \n\nI'm well aware that these things are hard to do, and that it's a lot easier to make the changes and then withstand the storm of negative opinions than to perform the change after the storm. \n\nBut explaining rationales a priori ultimately shows respect for the committed members of the community, it shows that you care about what they have to say. \n\nThis of course doesn't mean you have to change your mind based on the vocal minority input, not at all, it just means that if you explain yourself in advance nobody will be able to (rationally) criticize you for not being open and the \"we listen to you\" part will get a lot more credibility.\n\nFinally, I'm aware that SO Inc is not forced to do any of this, but given that time and again it is said \"community is important, we listen\", they should put their money where their mouth is (not literally, of course.)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 05, 2010", "message": "> is that making changes without announcing them a priori shows that you don’t actually care to listen\n\nCan you give more examples of where you feel we \"make changes without announcing them a priori\"? It's a very broad, sweeping generalization you are making here -- many changes we make are, in fact, discussed in advance and regardless, community input is always considered in every aspect of what we do.\n\nWe felt <b>very strongly</b> about this particular change, and the reasons why we felt it needed to be done quickly (for better or worse) are explained in the blog post directly above your comment.\n\nAre you asking for us to behave perfectly every time? To have an inviolable contract with the community, and to never make mistakes?\n\nI wish I could make that promise to you, but it's impossible."}, {"author_name": "John the Seagull", "gravatar_hash": "27a12fdc32baf8748018d373a973d22f", "author_url": null, "date": "Oct 05, 2010", "message": "Let me clarify.\n\nI'm not asking you to behave perfectly always, I'm asking you to at least have a statement of what SO Inc's relationship with the community aims to be, even if that vision is not always realized due to whatever reasons. For example, do you aim to discuss big changes and this was an oversight, or do you not aim to do this as much as possible? Document that! \n\nAnd I'm not saying you always make changes a priori, but in this case you certainly did. This wasn't a small change but a rather significant one (and here I must say I agree with the stated reasons for the change.) A change which was only briefly discussed in meta.webapps, even though it affected lots of sites."}, {"author_name": "Ralph Rickenbach", "gravatar_hash": "09eb3720b1c9d33bedd35a3bd47ec1c9", "author_url": "http://www.rickenba.ch", "date": "Oct 05, 2010", "message": "I perfectly agree with the decision that nothingtoinstall is not a great name and should be roled back. I'm not going to talk about the way you did it, but I think that fast was important - the longer you waited, the more confusion.\n\nWhat I want to talk about is the awfulness of the name stackexchange. It has no meaning outside of the SOFU family. Stackoverflow was a great name, stackexchange does only indicate a relationship with the site with a dash, which, if one did not follow the discussions from the beginning, could misinterpret easily.\n\nHow will you explain a name like hermeneutics.stackexchange.com to a bible scholar or pastor? They will most likely not know or even care about any other site in the SE network and be puzzled by the name."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 05, 2010", "message": "> at least have a statement of what SO Inc’s relationship with the community aims to be\n\nOK, here is that statement:\n\n\"we want our relationship with the community to be awesome.\"\n\n(kidding aside, like all real world relationships, I believe this is too complex to be codified into a weird sort of contract..)\n\nI think our history of engaging with the community speaks for itself.\n\nThe observed history of \"what actions we took\" is certainly a far more useful and RELIABLE predictor of any future behaviors than any mere words I can put on the page."}, {"author_name": "mbq", "gravatar_hash": "4e58c567f39fb31b8e7d6794bd1f9e9a", "author_url": null, "date": "Oct 05, 2010", "message": "I agree with most of your claims, but I don't think you should generalize it to all other sites.\nFor instance, stats.stackexchange.com is terrible name -- it covers only the small fraction of topics described there. And you won't found anything better than statsmachlearnvisdminingprob.stackexchange.com in this flavor. \nWe have done a huge amount of discussions to justify the wider scope and then pick and stick to CrossValidated.com not only as a great name but also as a seal on this fact. Rollback to stats can easily ruin this."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 05, 2010", "message": "@mbq the domain name is the wrong way to focus on this. Take the advice \"Tell us what your community is about in one brief sentence!\" instead. What is the one sentence description of your site, that you would use to explain to a stranger in a 15-30 second elevator ride?"}, {"author_name": "mbq", "gravatar_hash": "4e58c567f39fb31b8e7d6794bd1f9e9a", "author_url": null, "date": "Oct 05, 2010", "message": "@Jeff elevator ride is enough to quote the FAQ \"Statistical Analysis - Stack Exchange is for statistical analysis, data mining, machine learning, data visualization, probability theory and statistical computing.\", but this just can not be directly expressed by a single name. That's why we need some kind of abstract symbol (mark?) to unite it."}, {"author_name": "John the Seagull", "gravatar_hash": "27a12fdc32baf8748018d373a973d22f", "author_url": null, "date": "Oct 05, 2010", "message": "&gt; I think our history of engaging with the community speaks for itself.\n\nAnd that's exactly the problem :-). Some (many?) people dislike abrupt changes without notice (yes, this might be (not completely sure about that) the first one, but it's already history.) \n\nAbrupt changes without notice damage the community, which could be avoided."}, {"author_name": "Peter Smit", "gravatar_hash": "56586328ab69d46520cf729d2c46c58b", "author_url": null, "date": "Oct 05, 2010", "message": "As mbq said, stats.se has found a good name and our current short (stats) really isn't capturing it all.\n\nCrossValidated really captures almost all fields of our site, so I think we would like our own domain name. Can you not let communities choose what they think is best (off course friendly guiding them if the name they propose is not good enough)?"}, {"author_name": "tucson", "gravatar_hash": "790665a96c2f576755c01ffe278c5dc8", "author_url": "http://AskAboutProjects.com", "date": "Oct 05, 2010", "message": "The question of the domain name is very important for SEO (Search Engine Optimization) and therefore traffic.\n\nI came to this conclusion after launching AskAboutProjects.com (SE on project management)... 12 months later, I think we have a great StackExchange site, but very little traffic from Google searches.\n\nSure it would be ideal to get a viral type of expansion, but realistically without thousands of readers/followers, there is little chance to get much traction.\n\nOn the other hand, choosing the right domain name does make a huge difference in the long run (by which I mean after few months already).\n\nThere is quite a lot of evidence that using an exact match of searched keyword in the domain name gives a huge SEO boost.\n\nEvidence #1:\nebook.com\nSee this article:\nhttp://www.thedomains.com/2010/09/23/ebook-com-hits-the-auction-block-with-4-5-million-unique-visitors-a-year/\n\nEvidence #2:\na google search on \"web applications\" gives as SERP 1 wikipedia, and SERP 2 a site using 'webapplications' inside its domain name. \n\nIn conclusion my recommendation would be:\nif you want to make your life easier for traffic, grab the domain webapplications.net which is selling on Sedo.com for 1,088 USD (or the .info which is selling for half of that). It is a small investment which can greatly change the outcome down the line.\n\nYou might think this is expensive. It's not... if you plan to use it for something good like a StackExchange site.\n\nnote that I do not own these domain names, and have no interest other than to share my little SEO experience.\n\nBest of luck."}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Oct 05, 2010", "message": "I think that a single, more appropriate top-level domain (such as askhere.com, which seems to be purchasable, at least) would make it much easier to name each site.  Webapps.askhere.com, cooking.askhere.com, ...  Not cute, not profound, but simple, direct, and memorable.  Putting everything under a single top-level domain also has the advantage that you can transfer trust from one site to another.  If I participate successfully in a gadgets.askhere.com site and google for widgets and find a widgets.askhere.com result, I'm much more likely to trust and use that result.  The whole need for pushing (and explaining) cross-branding goes away."}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Oct 05, 2010", "message": "I kinda like that we are dropping the domain name discussion; it was getting very frustrating and also I like \"Gaming\" as a name, it says exactly what the site is about. Furthermore, our motto can be \"Love Gaming\" -- see here: http://meta.gaming.stackexchange.com/q/1161/14\n\nGood job on acting so fast when something *not quite right* is detected."}, {"author_name": "Peter", "gravatar_hash": "65491c59960b1a8be58b54889adf28a0", "author_url": null, "date": "Oct 05, 2010", "message": "This may be a stupid question, but where is the community supposed to provide you with the answer to your question?\n\"Tell us what your community is about in one brief sentence!\"\n\nI would expect to find it on the homepage of the site in question (webapps.stackexchange.com) or the meta site. Yet I see no notion of it anywhere."}, {"author_name": "SJML", "gravatar_hash": "a831f03a29043c6eeb05ec94ac1bf5b0", "author_url": null, "date": "Oct 05, 2010", "message": "This post doesn't do a very good job of explaining *what* the perceived problems were -- it's talking about fallout to a problem that anybody not intimately familiar with the issue probably doesn't understand. Could we get some more background on what lead up to the change and change back?"}, {"author_name": "Scott Fletcher", "gravatar_hash": "4d5ec5a8c19eacd3d06d203607e346e8", "author_url": "http://www.unthinkability.com", "date": "Oct 05, 2010", "message": "Sub-domains are a brilliant way to go.  Also, if wikipedia.org changed their name to fartilicious.com, no one would care for more than a week.  Priorities, people."}, {"author_name": "Aarobot", "gravatar_hash": "b724ebca1ce4dc031f4db1215b70825e", "author_url": null, "date": "Oct 05, 2010", "message": "Thanks for taking the time to write this, Robert. (That second paragraph looks oddly familiar... hmm.)\n\nOne thing I'm a little confused about is the part about mottoes.  Isn't that part of the Area 51 process already?  Or is the message here that we should be revisiting these things near the end of the beta period?\n\nSomebody also has to point out that you did kind of ignore the meat of Brian's suggestion.  He didn't say \"pick a general name and forget about the domain name.\"  He said \"forget about what's available in .com and just try to pick a really awesome name; then, we'll see what domains are actually practical to get.\"\n\nThat doesn't *sound* like what's happening.  The last step was really the most important one.  And indeed, it makes a lot of sense when you think about it.  If we're ready to reject Joel's broader assertion that all sites need unique domains, we could consider instead only rejecting the narrower assertion that all sites need to be .coms.  After all, Wikipedia is a .org.  Craigslist is a .org.  Imageshack is a .us.  If you look at the top 500 sites you'll see quite a number - albeit a minority - that are not .com.  Part of the team's argument is that search engines don't care about your domain name, so why does it need to be .com?\n\nUltimately I know this isn't going to change anyone's mind, but just for the hell of it I'm going to repeat my compromise proposed yesterday on *cough*Seasoned Advice*cough*, which is:\n\nGive us awesomename.stackexchange.com (instead of generictopicname.stackexchange.com) with a redirect from awesomename.com or awesomename.org or whatever.  That way we can still brand the site and try to recruit new members without feeling shame or causing confusion, you can still get every last drop of search engine juice, and the migration path is totally clear so there won't be mass confusion or arguments when we finally do reach \"privileged\" traffic levels and the team finally decides to give us an actual domain.\n\nThis assumes that a decent name has been chosen, but I think without the .com restrictions, that's much easier to do."}, {"author_name": "BDP", "gravatar_hash": "297c8649d7bf3722b331469315dcc665", "author_url": null, "date": "Oct 05, 2010", "message": "This is a pretty good article. Thanks for posting it.\n\nI empathize with the desire to have policy changes stated up front, but I also appreciate the futility of promising to do that. The Stack Overflow Internet Services team is building new stuff live on the Internet and some of that hasn't worked out so well.\n\nHowever, it's valuable to note that this whole enterprise of developing multiple Stack Overflow style sites at once with community input is only a few months old. And, it was clearly more popular than originally anticipated.\n\nFrom my perspective, the recent bumps are problems of speed and scale and indicators that some new things are being attempted. It looks like the company got a bit overwhelmed by the number of proposals and new sites. Given the probability that the Valued Associates have better things to do than be caught up in Internet firestorms, I find this the most likely explanation.\n\nThe only things left to say are that I hope that the company is looking for ways to get ahead of the curve (there are still some apparent duplicates on Area 51). And, more importantly, thank you to Stack Overflow Internet Services for building something interesting and useful for the Internet. Maybe one of these days there will be a Stack Exchange I can actually answer more than a few questions on."}, {"author_name": "Jeff Yates", "gravatar_hash": "3b0d930715cf8f5729e177981f69f44e", "author_url": null, "date": "Oct 05, 2010", "message": "I agree that when it comes to having a unique domain for each site, it's a secondary concern to having the right content and community. If we look at the sites we have:\n\nSuperUser\nStackOverflow\nServerFault\nmeta\nArea51\n\nThe thing to note is that only 3 of those have their own completely unique top-level domain. In fact, meta has become a concept for each SE site and would actually not even benefit from its own domain.\n\nArea51 stands apart in that it is unlike any other site in the group and yet it does not have, nor need a name to distinguish it beyond what it already has. I think that even if we go with naming things like Nothing To Install or Pause For Help (I suggested that and I don't like it much either), they should be part of the StackExchange.com domain like Area51.\n\nnothingtoinstall.stackexchange.com\nstackoverflow.stackexchange.com\nsuperuser.stackexchange.com\narea51.stackexchange.com\n\nDoesn't seem so bad to me.  And if the SOIS people find a different top-level domain than StackExchange.com, everyone can benefit.\n\nnothingtoinstall.stackassistant.com\n\nNot only that, but we can then name the sites whatever the hell we want - the only taken names will be the ones we used not the ones squatted by some ad-peddler on the Internets."}, {"author_name": "Brian R. Bondy", "gravatar_hash": "47d8644c0ad8d89635fca422dd6d3ab5", "author_url": "http://www.brianbondy.com", "date": "Oct 05, 2010", "message": "@Aarobot \"Brian’s suggestion didn’t say...\" - that is correct and spot on.\n\nJeff had actually mentioned in a comment one of the problems with custom naming was that new members did not know what the site was about.\nHe had referenced this twitter comment: https://twitter.com/davidsavagejr/status/26016270755#\n\nTo that I replied:\n\n\"@Jeff: About the twitter comment, I think regardless of the site name there are independent things you can do to improve that situation. For example a slogan or first time user popup. Not sure what is best here but the point is that can be improved. A simple line of text under the logo \"A place to ask questions relating to web applications\" would improve it. – Brian R. Bondy\"\n\nThe above comment I wrote I think is where the tagline came from not the post about the naming I wrote.  \nThe post I wrote about the naming was to point out that naming is not hard, .com naming is hard.\n\nAnd as you said  awesomename.stackexchange.com instead generictopicname.stackexchange.com is more towards what I'd like if we have to go the subdomain model."}, {"author_name": "WillBill", "gravatar_hash": "e6f407d5c456c07416f427a66776de5b", "author_url": null, "date": "Oct 05, 2010", "message": "I'm pleased \\Nothing To Install\\ just didn't work for me"}, {"author_name": "James", "gravatar_hash": "faca5fb53b005fe7a4adb40f931f2905", "author_url": null, "date": "Oct 05, 2010", "message": "Great decision. The CrossValidated.com name idea for stats is terrible. Most people would assume it meant the site was about one technique: cross validation https://secure.wikimedia.org/wikipedia/en/wiki/Cross-validation_(statistics)"}, {"author_name": "mbq", "gravatar_hash": "4e58c567f39fb31b8e7d6794bd1f9e9a", "author_url": null, "date": "Oct 05, 2010", "message": "@James Does StackOverflow is just about avoiding stack overflows?"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Oct 05, 2010", "message": "Webapps.SE confuses me because it makes me think its Yet Another Overlap with StackOverflow. Nothingtoinstall.SE confuses me because it doesn't really convey much to me and its kind of wordy in some sense. Also, I agree that *.stackexchange.com is going to be fairly foreign to anyone unaware of StackOverflow or the whole StackExchange thing already. But, this is very subjective."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Oct 06, 2010", "message": "@ralph - of course it's going to be worse once there are sites about financial markets (exchange.stackexchange) and ion-resin water filters (exchangestack.stackexchange)"}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Oct 06, 2010", "message": "[quote]Can you give more examples of where you feel we “make changes without announcing them a priori”? It’s a very broad, sweeping generalization you are making here[/quote]\n\nIsn't it true for most of the A51 process?\n\nThe site was launched with (as far as I'm aware) no advance \"warning\" to the community of how it would work (and thus, no discussion of whether it would work as intended), and as a result, community members have pointed out some pretty fundamental flaws in the A51 pipeline pretty much from day one.\n\nAnd then, in the last month or so, we've seen a constant stream of major disruptive changes, all positive (I think), and  all as a result of community feedback (which is also good), but again with little advance warning of what changes you were considering, and so no way for the community to pull the emergency brake and shout out if they disagreed with the changes (with the exception of the Ubuntu/Unix thing, which went to the other extreme, and pretty much drowned in community involvement, with discussions, proposed changes and polls)\n\nI won't say you've done everything wrong or treated your community badly or anything like that. I don't think that's the case. You set an extremely tough task for yourselves, handled it as best you could, and, it turns out, underestimated it somewhat. Tough luck, but it happens. And it looks like you're on the right track with fixing the problems that exist. So this isn't really intended as direct criticism, but just an answer to the question \"what did we do without a priori announcements/warnings?\" \n\nAs for CrossValidation, it sounds to me like the site's elevator pitch is simply \"Statistical Analysis\". Of course it's hard to describe *every* aspect of the site in a single sentence, but that's the case for other SE sites too. Just try to descbe every aspect of StackOverflow in a sentence.  \"Statistical analysis\" doesn't explicitly cover *everything* about the site, but isn't it good enough as a tagline or elevator pitch to tell potential users that it's something they might be interested in?"}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Oct 06, 2010", "message": "by the way, would it be possible to add a bit of info here next to the input textbox on what kind of markup is accepted? Are we supposed to format comments with markdown, phpbb-ish syntax or a html subset?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 06, 2010", "message": "> And then, in the last month or so, we’ve seen a constant stream of major disruptive changes, all positive (I think), and all as a result of community feedback (which is also good), but again with little advance warning of what changes you were considering, and so no way for the community to pull the emergency brake and shout out if they disagreed with the changes\n\nIt's almost like we need a podcast. \n\nSomeone should tell @spolsky that."}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Oct 06, 2010", "message": "Don't tempt us like that Jeff :)"}, {"author_name": "Jon", "gravatar_hash": "1dd287e1721847d59bcb9b51bfaa0811", "author_url": null, "date": "Oct 06, 2010", "message": "@Jeff, I was actually going to comment saying almost exactly that, but then I got distracted and forgot..."}, {"author_name": "Rowan", "gravatar_hash": "2490332d09971d82ec593ac4780c5a48", "author_url": "http://www.debenu.com/", "date": "Oct 07, 2010", "message": "@Jeff Atwood, you actually do need to bring back the podcast -- but re-invent it as the Stack Exchange Podcast. Internally you are no doubt having mind-numbing never-ending discussions on this topic and talking yourselves around in circles. Fun times. Wanna know the best part? You're not going to come up with a satisfying solution, no matter how long you talk about it.\n\nIf you and Joel had some of these mind-numbing discussions on a podcast for all of the key community members to hear (plus everyone else), then they would better understand both sides of the argument and would be less critical of the decisions that get made because they would know exactly how hard it was to make any decision at all -- never mind the \"right\" one.\n\nIn addition to that, the original Stack Overflow Podcast was interesting because it was a behind the scenes look at the building of a new startup and listeners were exposed to many discussions that enlightened them on why certain difficult decisions were made. You guys argued about decisions in public and no doubt the listeners agreed and disagreed at times, but either way, they were aware of the pros/cons for each decision were.\n\nNow the SO podcast had a programming bent, but the SE podcast can have a building-communities bent -- and even if it's only listened to by a few thousand hardcore members -- those few thousand members will be more supportive of you because they'll have some inside knowledge on how the decisions were made.\n\nThose few thousand listeners will be the engine that powers your communities and backs you up when mistakes are made."}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Oct 07, 2010", "message": "Can I upvote Rowan?\n\nIf Joel won't do it, maybe a Robert and Jeff podcast would work, since he spends his day thinking about community issues . . . so long as he can forcefully disagree with his boss in public."}, {"author_name": "Eric Wilson", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Oct 07, 2010", "message": "How about a Jeff and Robert podcast?"}, {"author_name": "Alexander Pas", "gravatar_hash": "ca5fd69395f0422a8c9ef11db8bb29ca", "author_url": "http://dropdev.org", "date": "Oct 07, 2010", "message": "we need the ability to upvote comments in this blag!"}, {"author_name": "Mike Schinkel", "gravatar_hash": "81df87e0d3e269d6fa6a17c6914fd656", "author_url": "http://mikeschinkel.com", "date": "Oct 09, 2010", "message": "In general I think you've taken the right approach. However let me mention two things to consider addressing as you move forward.\n\n1.) The long domain names are a lot to type. \n\nFor the site I moderate WordPress Answers the http://wordpress.stackexchange.com requires typing on the browser line all of \"wordpress\" and then the . and then at least \"s\" to get my browser cache to match. It may seem trivial but when I type if probably 20 times a day it gets tedious (yes, I could use a shortcut etc. but I also type it in emails and so on.)  Coming up with shorter names, maybe as shortcuts would be helpful.  \n\nFor example, if you were to add http://wp.stackexchange.com (for our site) it would be a lot easier.  Also, maybe the owner of http://www.se.com will sell and you could then offer shortcuts like http://wp.se.com. :-)\n\nI've research URL design so I know that whatever you do has downsides, I'm just giving you some thoughts I hope you'll consider on the subject.\n\n2.) It's awkward to reference the generic site name when writing answers because the generic site name often conflicts when the subject of what you are writing.  For example \"If you have questions about WordPress and can't find the answers anywhere else be sure to go to WordPress Answers and ask your questions there\" and \"If this answer solves your problem sure to come back to WordPress Answers to mark it as the correct answer.\"  \n\nCompare those to following using the name \"query_posts\" that we voted up: \"If you have questions about WordPress and can't find the answers anywhere else be sure to go to query_posts and ask your questions there\" and \"If this answer solves your problem be sure to come back to query_posts to mark it as the correct answer.\"  These latter ones make it easier to write clearly.\n\nProbably the most workable solution is to elevate the StackExchange brand such we can write the following: \"If you have questions about WordPress and can't find the answers anywhere else be sure to go to StackExchange and ask your questions there\" and \"If this answer solves your problem be sure to come back to StackExchange to mark it as the correct answer.\"  These latter ones make it easier to write clearly.  It just needs to be clear when the come to StackExchange where they should go from there.\n\nAnyway, hope this helps.\n\n-Mike"}, {"author_name": "BradC", "gravatar_hash": "c5c2165949f71bcd1fafbd8e694ab5f2", "author_url": null, "date": "Oct 10, 2010", "message": "So, how does askubuntu.com rate an exception to this new policy?"}, {"author_name": "Andy", "gravatar_hash": "e5906408c4fc2a0489827ce6ed2bc091", "author_url": null, "date": "Oct 18, 2010", "message": "&gt; is that making changes without announcing them a priori shows that...\n\nYou keep using that word. I do not think it means what you think it means.\n\nYou could have just said \"beforehand\"."}, {"author_name": "Domain Names", "gravatar_hash": "9bd0bca4a0df04cd5691159bb1a6794f", "author_url": "http://www.domainwright.com", "date": "Oct 28, 2012", "message": "With the hundreds of new extensions coming to the market soon, there'll be plenty of opportunities to get appropriate domain names.\nThe availability of domain names with a .com extension has all but dried up unles  you are willing to pay an inflated price for a relevant but taken name.\nIt's going to be very interesting to see which extensions make it, given there are already 300 or so in existence."}]}