{"response": [{"author_name": "Barthelemy", "gravatar_hash": "1dc7387cedba30b9a3d12792084b4b4a", "author_url": "http://infobart.com", "date": "Oct 14, 2010", "message": "Quick question, how will this work with askubuntu? I can imagine people asking ubuntu questions on serverfault and superuser (and maybe unix if it ever goes public). Should these questions be migrated to askubuntu?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 14, 2010", "message": "As with all things unix, that to me is a bit of a special case.\n\nI view it thusly:\n\nSuper User is for computer enthusiasts, who love OS X, Windows and Linux -- and for that matter, all software and hardware -- equally.\n\nUnix/Linux is for people who love unixes of all flavors and types.. but probably hate Windows and only begrudgingly use Macs now that they are unix-y.\n\nUbuntu is for people who love just one type of unix: Ubuntu. They are on a holy mission to create the \"unix for the rest of us\".\n\nThese audiences are really quite different in their approach, goals, and what they love and hate. I'm disinclined to allow a lot of arbitrary migration between them.\n\nBut in GENERAL, yes, we don't want that kind of serious topic overlap between sites. Unix is just .. special.. in this regard. See Joel's post: http://blog.stackoverflow.com/2010/09/fork-it/"}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Oct 14, 2010", "message": "Ah, great stuff, I was thinking just the other day that we needed this."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Oct 14, 2010", "message": "@Jeff that's not what Barthelemy means: I think he is asking about adding askubuntu to the migration targets."}, {"author_name": "Barthelemy", "gravatar_hash": "1dc7387cedba30b9a3d12792084b4b4a", "author_url": "http://infobart.com", "date": "Oct 14, 2010", "message": "@Jeff and @Pekka,\n\nActually, I was really just wondering what the plan was because as Jeff said, it's quite a special case! \n\nI think \"I’m disinclined to allow a lot of arbitrary migration between them.\" seems reasonable. I don't know how this will get implemented though (require more votes because of the overlap, prevent any migration as the screenshot suggests, etc.)"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Oct 14, 2010", "message": "&gt; there must be consensus for a migration to occur ... This is new, and should help with some of the inappropriate accidental migrations we’ve seen in the past. \n\nDo you mean that all 5 voters must vote to migrate to the same other site? If even one of the closers goes with a simple \"off-topic\" but no migration path, the question won't be migrated?  Can you elaborate on this a bit? It seems to me like 3/5 agreeing on the same migration path should be sufficient."}, {"author_name": "Antony", "gravatar_hash": "7494aa9b82eac6ad03f92ec679db801b", "author_url": "http://www.sixgun.co.uk", "date": "Oct 14, 2010", "message": "I asked a question on stackoverflow recently (http://stackoverflow.com/questions/3654932/ideal-desk-for-software-development-closed), which clearly belongs on http://programmers.stackexchange.com/"}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Oct 14, 2010", "message": "Stackoverflow needs path to math and programmers (and perhaps gaming).\nGaming needs a path to gamedev (and perhaps stackoverflow).\nGamedev needs paths to stackoverflow and math."}, {"author_name": "BradC", "gravatar_hash": "c5c2165949f71bcd1fafbd8e694ab5f2", "author_url": null, "date": "Oct 14, 2010", "message": "Regarding programmers.se and gamedev.se, I assume those migration paths will be considered when (if) the sites make it out of beta."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 14, 2010", "message": "> Do you mean that all 5 voters must vote to migrate to the same other site? If even one of the closers goes with a simple “off-topic” but no migration path, the question won’t be migrated?\n\nI guess the difference is mainly in the UI -- we force close voters to explicitly choose off-topic first, then choose between taking the default of \"just plain off topic\" *OR* selecting \"off-topic and belongs on..\".\n\nWhereas off-topic and migration votes were totally separate choices before."}, {"author_name": "Pauska", "gravatar_hash": "736558f18dfae17d79cf0479cac2838f", "author_url": null, "date": "Oct 14, 2010", "message": "We are literally drowning in webmaster questions (especially mod_rewrite) at SF. A migrate to webmasters would be wondeeful."}, {"author_name": "Jan Fabry", "gravatar_hash": "91354ef2eccac3d92ab21b03dd0eab80", "author_url": "http://www.monkeyman.be", "date": "Oct 19, 2010", "message": "Would it be possible to add migration paths based on the question tags? If a question is tagged [wordpress] or [ubuntu] there is a high probability that it should be migrated, but these paths probably don't need to be on every question on the whole site. I created a proposal on MSO: [ http://meta.stackoverflow.com/questions/68022/migrate-shortlist-based-on-tags ]"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 24, 2010", "message": "@jan -- probably better to flag it for moderator attention in that case."}, {"author_name": "fdsvensson", "gravatar_hash": "b1101e42f0b2f9c1c3f2c3330c9b0844", "author_url": "http://ubuntu.se", "date": "Nov 21, 2010", "message": "Sorry Jeff, I didn’t now. I'm joust answer one question before I’d read this, it was a simply question and people ask if we should wote. What?! I think. Then I just get him a answer, but do You rely mean that? We shall not answer the easy one, just send them away?"}, {"author_name": "Greg", "gravatar_hash": "b0d98734d95fa6d3fed729b2a919855d", "author_url": null, "date": "Nov 29, 2010", "message": "For the Ask Ubuntu site see http://meta.askubuntu.com/questions/724/migration-paths"}, {"author_name": "anon", "gravatar_hash": "4c8a9bec5a27b66b28d3c5cddeb70e93", "author_url": null, "date": "Feb 07, 2011", "message": "You can't migrate a question from SO to UI?"}]}