{"response": [{"author_name": "Steve", "gravatar_hash": "5f474a6ab6bc19c8a02b88375aa8a3c6", "author_url": null, "date": "Oct 15, 2010", "message": "You sure the Jerry Maguire who's coming with me speach wouldn't have been more appropriate?"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Oct 15, 2010", "message": "So what's fourth place?\nIs Joel+Jeff going to open a coffee shop that we can all visit?\n\nActually that could work - like Ben+Jerry's, you could have software themed names for all the drinks."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": null, "date": "Oct 16, 2010", "message": "\"...I can tell you that we use our own chat for the distributed development work of building Stack Overflow and Stack Exchange itself.\"  \n\nDon't take this the wrong way Jeff, but why would you write your own chat when there are plenty of others out there?  \n\nThis sounds suspiciously like the \"Joel jumped the shark\" deal when someone railed on him for inventing his own language..."}, {"author_name": "Aiden Bell", "gravatar_hash": "60f28d36c1439f965e2fb55419621968", "author_url": "http://stackoverflow.com/users/104040/aiden-bell", "date": "Oct 16, 2010", "message": "Nice one Jeff! Now I will never have any \"spare\" time to finish that compiler and blog engine and social media site .....\n\nJust kidding. Thanks for the work to all of the team."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 17, 2010", "message": "> Don’t take this the wrong way Jeff, but why would you write your own chat when there are plenty of others out there?\n\nCovered in http://chat.stackoverflow.com/faq\n\nAlso, we believe our web-based chat is bar none the best on the internet. It's not even close, frankly.\n\nTry it yourself and see."}, {"author_name": "Jakub Narębski", "gravatar_hash": "672aa8b373071ef9f06db563d1c08d77", "author_url": null, "date": "Oct 21, 2010", "message": "One annoying issue is that you don't have any indicator on main chat page (http://chat.stackoverflow.com) that you are logged in.  When you enter a room/channel, you see that you are logged in because entry box at the bottom of the page is personalized using, among others, your icon.\n\nP.S. Nice to see that my question about IRC client / interacting with IRC (e.g. #perl channel on FreeNode for 'perl' channel/room on SO chat) is answered in FAQ."}, {"author_name": "balpha", "gravatar_hash": "b13dce689732844e6590da37048f0eaf", "author_url": null, "date": "Oct 21, 2010", "message": "Jakub, when you're logged in, there's a link to your profile on top of the page. When you aren't, it's instead a login link. You also have more room filtering tabs when you're logged in."}, {"author_name": "Nick Ali", "gravatar_hash": "29c6fe4e29b10c63ce9f1bdbb6cf3418", "author_url": "http://iamtherealnick.com/", "date": "Jan 04, 2011", "message": "Is there any chance you guys will open source the code behind chat? Its beautiful and there are lots of open source communities that could benefit from it."}, {"author_name": "Chris Jacob", "gravatar_hash": "bd9a86ce16b44e31611305306d144c68", "author_url": null, "date": "Jan 06, 2011", "message": "I seconds Nick's question re: open source. \n\nOn top of that, if you guys were to host a 'whitelabel' version as paid service there are many communities that could benefit from the awesomeness that is SO Chat."}]}