{"response": [{"author_name": "Casper Thygesen", "gravatar_hash": "558ac4fdcafae1b05b51c1f8c94af643", "author_url": null, "date": "Oct 13, 2010", "message": "Sooooo, what is the conclusion??"}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Oct 13, 2010", "message": "So leave everything as something.stackexchange.com.  Or give them all similar names:  gamingoverflow, cookingoverflow, etc. (or gamingexchange, cookingexchange, etc.)\n\nAny decision would of course make superuser and serverfault the unfortunate exceptions, since I'm sure none of their users would be okay with a name change."}, {"author_name": "Joe?", "gravatar_hash": "35b5e9e9ccf3bfe5ff8d22b64a5234d3", "author_url": null, "date": "Oct 13, 2010", "message": "I've seen some piss-poor answers on the webapps site -- some stuff that would rival Yahoo Answers. To me it seems that you're looking for an elegant solution to a problem that doesn't even exist yet. There are cons both ways. If you build the sites solely based on the idea that they should be optimized for search engine traffic then you might find that the sense of community no longer exists and it becomes another Yahoo Answers."}, {"author_name": "Andrea", "gravatar_hash": "638e6a9e175da1803ec2c9e59ab6e5be", "author_url": null, "date": "Oct 13, 2010", "message": "&gt; And since 90% or more of our audience interacts \n&gt; comes to us from search engines, that’s broken.\n\nSo what?"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Oct 13, 2010", "message": "@BlueRaja: Actually, more people were (initially at least) in favour of Server Fault being named Rack Overflow.\n\nAs for Super User, I hold that name with about the same level of...\"esteem\" as Nothing to Install, so, well, Nothing of Value is Lost if it has a name change. :-P"}, {"author_name": "Michel Billard", "gravatar_hash": "7a72ffed0a1cd0141f4da8587624092c", "author_url": "http://www.crossbrowser.net", "date": "Oct 13, 2010", "message": "If you launch a hundred stack exchange sites and 80 of them turn out crappy over time, won't it make the other 20 look bad too?\n\nIt seems the issue with Web Apps is that it didn't have a really astounding name, it was just the winner by default. However, if 404notfound.com (for example) had been available, would we be having this discussion right now?\n\nAlso, there's the issue of the distinct feel of the different sites, nobody puts much effort in the designs (as opposed to the previous stackexchange 1.0 sites) so the first decent design gets accepted and that's it. No one seems to want to give too much work for free (even though we get an awesome Q&amp;A site in the end, but we'll get that even with an ok looking website).\n\nMy suggestion is to find a way to get more professional work on the designs/logo/etc. of each site and stick with domain names when a good one is available. I don't mind web apps staying web apps for now, but in the long run, each site would benefit from having its own identity... if it can find one."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": null, "date": "Oct 13, 2010", "message": "In other words: I live in Housing Block 2938TC  :)\n\nbtw - my captcha was in Greek before I refreshed it. Very odd"}, {"author_name": "Nick", "gravatar_hash": "f3664da2ca305284ab442e34daccc608", "author_url": "http://www.thecodingmonkey.net", "date": "Oct 13, 2010", "message": "So then... here's a question for you. If all these new Stack Exchange sites, like cooking, photos, etc. are going to become sub-domains of stackexchange.com... and had you known that when you first bought the stackexchange.com domain, would you have named it differently?"}, {"author_name": "tvanfosson", "gravatar_hash": "00aa1356e6f90fca08b36fb3c8d230c5", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Oct 13, 2010", "message": "I can understand why you may be partial to \"Stack\" -- but before you go much further you should really look for a better top-level domain name that has better recognition among the general internet population.  StackOverflow was reasonable when targeting programmers, but *.stack*.com sucks for a family of Q&amp;A sites for the masses."}, {"author_name": "Zac Thompson", "gravatar_hash": "40ea08872a7ff7470a4bbe4925b0f648", "author_url": "http://zac.ca", "date": "Oct 13, 2010", "message": "So, in brief: \n\nnothingtoinstall.com = In our wisdom, we have declared this name to be inadequate, despite having been selected by the community.  We are completely confident that it will be impossible to overcome the problems of such a bad name -- you will fail unless you keep the stackexchange.com subdomain.  We're pretty sure Google ranks things lower if they have a bad name.  We demand that the site must get more traffic and come up with a better name before we give it its own domain.  We will retroactively create a new policy which may or may not be a bunch of excuses for why we don't want to be associated with that particular name.\n\naskubuntu.com = good enough!  Off you go.\n\nDid I miss anything?"}, {"author_name": "Zac Thompson", "gravatar_hash": "40ea08872a7ff7470a4bbe4925b0f648", "author_url": "http://zac.ca", "date": "Oct 13, 2010", "message": "Okay, my previous post was rude and argumentative.  Please ignore it or delete it.  And I'm sure I did miss something, although I really think the communication is falling down on this issue."}, {"author_name": "Michel Billard", "gravatar_hash": "7a72ffed0a1cd0141f4da8587624092c", "author_url": "http://www.crossbrowser.net", "date": "Oct 13, 2010", "message": "That's because, like everyone else, <a href=\"http://jangosteve.com/post/380926251/no-one-knows-what-theyre-doing\" rel=\"nofollow\">\"No one knows what the f*** they're doing\"</a>."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 13, 2010", "message": "> In other words: I live in Housing Block 2938TC :)\n\nI like to think that Housing Block 2938TC is better known as \"where Dinah lives\".\n\nThe name of the building is nowhere near as important as the people who populate it."}, {"author_name": "Benjol", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Oct 13, 2010", "message": "The problem remains: if I mention 'cooking.stackexchange.com' to my great aunt, there is about 20 times LESS chance of her remembering it when she gets home than 'seasonedadvice.com'. \n\nIf you think Google will be writing more questions and answers on the site than my great aunt, that's fine, I guess."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 14, 2010", "message": "> If you think Google will be writing more questions and answers on the site than my great aunt, that’s fine, I guess.\n\na) you will still be able to type \"seasonedadvice\" [enter] into the browser and have it end up on http://cooking.stackexchange.com\n\nb) statistically, yes, more people will end up on the site via Google than via any other means.. and a certain percent of them will like the site, stick around, and contribute"}, {"author_name": "Nick Johnson", "gravatar_hash": "dc69af7dd7151a00843602888638fabb", "author_url": "http://blog.notdot.net/", "date": "Oct 14, 2010", "message": "For the motto: \"Your questions, answered.\" or for more emphasis \"Your questions. Answered.\". Simple, memorable, and to the point, if perhaps a little dull. ;)"}, {"author_name": "Chris", "gravatar_hash": "f90960f7668c6575ca35b9f57db997e1", "author_url": "http://unsliced.myopenid.com", "date": "Oct 14, 2010", "message": "+1 for the goatse graphic"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Oct 14, 2010", "message": "@Chris: I never thought of it _quite_ that way till you mentioned it. Wow. :-P"}, {"author_name": "Daniel", "gravatar_hash": "adb7dc8e895d08cf7263a6ab57b341a1", "author_url": null, "date": "Oct 14, 2010", "message": "Ele voltou ;)"}, {"author_name": "Wall Street Programmer", "gravatar_hash": "ebcfe131ad9150e7990cf189b005b927", "author_url": null, "date": "Oct 19, 2010", "message": "\"Think of it this way. I’ve met a lot of programmers who tell me that when they have a problem, after searching on Google, they scan the results for stackoverflow.com and click on those links first.\"\n\nThat's because stackoverflow.com has built a name for itself amongst programmers as a good source of information - not _because_ it's named stackoverflow.\n\nThe vast majority of internet users, those interested in cooking, or photography for example, won't have heard of stackoverflow, stackexchange or - and I know this might come as a shock - Joel Spolsky.\n\nSites will become popular if, and only if, users find them useful, interesting or entertaining, and that has little to nothing to do with being associated with the stackexchange brand.\n\nIt is often said that word of mouth is the best form of advertising. That's why sites with catchy, simple names have become popular.  \n\nImagine a conversation between two ladies in a baking club. One recommends this great website she found for cooking tips, but by the time her friend gets home she can't remember the name of it at all. Stack what?"}]}