{"response": [{"author_name": "goyuix", "gravatar_hash": "846aeb3494a51fdd2af2bb0b99dc364c", "author_url": null, "date": "Oct 14, 2010", "message": "Have you considered using the #job or #jobs (or others even?) hash tags in the twitter feed to help spread the word?"}, {"author_name": "Barry Kelly", "gravatar_hash": "4a7b08fcb7e3d9a52ae473613b71bc3d", "author_url": "http://blog.barrkel.com/", "date": "Oct 14, 2010", "message": "\"we want candidates that are responsive when they receive a relevant query rather than ignoring the message because they’re not currently looking\"\n\n- This, to me, aims at a faulty assumption at the heart of Careers.\n\nI get the occasional email from it; but links are blocked in the emails, and I have to express interest in the message before I can follow the links and evaluate whether or not I'm interested.\n\nThe thing is, I'm \"looking\" if the opportunity is interesting enough. If it's not interesting, I'm not looking. It's not binary; the opportunity is compared to my current position, and if it's sufficiently better, then I'll consider it.\n\nIf you want to filter for people who are \"currently looking\", no matter the quality of the messages sent to them, you're going to filter for poor quality candidates. Good quality candidates aren't going to be \"looking\" for long. They're certainly not going to be unemployed, for example."}, {"author_name": "Barry Kelly", "gravatar_hash": "4a7b08fcb7e3d9a52ae473613b71bc3d", "author_url": "http://blog.barrkel.com/", "date": "Oct 14, 2010", "message": "Another thing: people willing to put a lot of effort into Careers etc., such that you want to reward that effort, are, frankly, probably desperate. They're probably the worst people you'd want to push to the top.\n\nThis is my perspective. YMMV."}, {"author_name": "Joe?", "gravatar_hash": "35b5e9e9ccf3bfe5ff8d22b64a5234d3", "author_url": null, "date": "Oct 14, 2010", "message": "I'm just wondering what kinds of issues you could run into when you're having candidates pay money to appear on the site and then you reduce their visibility for some reason. Surely there must be some repercussion for that."}, {"author_name": "eglasius", "gravatar_hash": "9711911847e71c94733250dfa63f9427", "author_url": "http://eglasius.blogspot.com", "date": "Oct 14, 2010", "message": "+1 to Barry Kelly's comments, specially the first one."}, {"author_name": "Korneel Bouman", "gravatar_hash": "2c3f79bed945b193634cf6794df49661", "author_url": "http://careers.stackoverflow.com", "date": "Oct 14, 2010", "message": "@goyuix: Um, no, we hadn't - duh. Great suggestion, we'll give that a try.\n\n@Barry: Many thanks for your thoughts. I agree that the whole messaging system needs work and that it should be easier to assess if the presented opportunity is of interest. But even if not, unless it's outright spam, I'd hope someone would send a \"thanks but no thanks\" back (we'll put a big button in place for that at some point). What I was talking about is people that simply do not respond at all to a message, one way or another, not whether the candidate is actively looking.\n\nI'm not entirely sure that only poor quality candidates and the desperate would pimp up their profile, but assuming this to be true, the employer has a very powerful opposing indicator: the stack overflow rep and the questions and answers provided by that candidate.\n\nThere's no clear cut answer yet, but the more we'll talk about this the clearer the desired outcome and mechanisms to get there will become. And then when we'll put them in place we'll probably find that they were not quite right (thanks to our very involved user community :)) and will adjust accordingly. \n\n@Joe? Possibly... But, every one that participates in careers benefits from elevating the level of quality, so it's in everyone's best interest to have mechanisms in place that help with that. From the individual's point of view, as long as it's clear what is required to stay visible (and it's not yet decided that we want to go down that route - a rep based scheme would be more transparent) it's up to them to keep up. That said... we have been debating the whole \"to charge or not to charge\" question as well. No resolution as of yet, but, stay tuned..."}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": "http://www.compiler-design.com", "date": "Oct 14, 2010", "message": "When you get an email for a job advertisement, can you reply to that email or do you need to click a link to submit a response? If you need to click a link, you're doing something wrong here, by making users who aren't interested do more than the expected minimum amount of work to say that."}, {"author_name": "Pavel Shved", "gravatar_hash": "87396c433aab1086df12f80070c3b627", "author_url": "http://coldattic.info", "date": "Oct 17, 2010", "message": "@Barry, so you say that everyone, who's lost the job and then tried to make a good resume, is a sucker?"}]}