{"response": [{"author_name": "crb", "gravatar_hash": "d79c5589eb78967ff7b5f3001c5fe934", "author_url": "http://craig.dubculture.co.nz/blog", "date": "Oct 11, 2010", "message": "Why isn't this at ubuntu.stackexchange.com?  Does it have ServerFault-level traffic already?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 11, 2010", "message": "@crb \n\n1. this partnership predates that decision\n\n2. I'd argue that the possibility of a redirect from ask.ubuntu.com (tbd, but under discussion) invokes the \"act of God\" provision in our naming rules. That'd be like apple.com endorsing our apple site."}, {"author_name": "Luke", "gravatar_hash": "4d69df831be32d2e5eddbd7afe1d671c", "author_url": null, "date": "Oct 11, 2010", "message": "Congrats on the new site. I love Ubuntu and I'm sure this is going to be a great replacement for the dying Ubuntu forums (ubuntuforums.org). I also love the design of this site. I think its the best looking one in the whole series so far (even though it's heavily based on the official Ubuntu look)."}, {"author_name": "Ostad", "gravatar_hash": "3b09a1e5715b1ccb8a7f294b06fa41f9", "author_url": null, "date": "Oct 11, 2010", "message": "I don't really like the design..."}, {"author_name": "Rob V.", "gravatar_hash": "478e998264ce53671f054b5a742bd692", "author_url": null, "date": "Oct 11, 2010", "message": "I certainly hope this replaces ubuntuforums.org over time.  There's certainly a lot of helpful people there and good answers but the painfulness of finding the good answers in 37 pages of 'Me too!!'s was just begging for a stackoverflow like solution."}, {"author_name": "Robert Cartaino", "gravatar_hash": "9dfd656461a1d0a2db33f3ed4183f4c0", "author_url": "http://stackoverflow.com/users/98786/robert-cartaino", "date": "Oct 11, 2010", "message": "@Ostad: Askubuntu.com was designed by Mat Tomaszewski (MT) who is one of Canonical's User and Experience design folks. That doesn't mean you have to like the design, but they designed Askubuntu.com to specifically followed Canonical's own brand guidelines so it would have a consistent look as their own Ubuntu forums."}, {"author_name": "Robert Cartaino", "gravatar_hash": "9dfd656461a1d0a2db33f3ed4183f4c0", "author_url": "http://stackoverflow.com/users/98786/robert-cartaino", "date": "Oct 11, 2010", "message": "@Rob V.: Askubuntu.com isn't really <em>designed</em> to replace the Ubuntu forums. Ask Ubuntu will be invaluable in building a collection of quality answers for specific questions that are typically lost in a traditional forum. But the forums are useful for interactive trouble-shooting and anything that requires protracted discussions. Together, they are a good match."}, {"author_name": "Name", "gravatar_hash": "7905d373cfab2e0fda04b9e7acc8c879", "author_url": null, "date": "Oct 11, 2010", "message": "At least someone in the SO team realizes that forums are for more than question-&gt;answer...\nThey still suck, but SE is not a dropin replacement."}, {"author_name": "Jorge Castro", "gravatar_hash": "d4f7d15de2abdec49cacaac7d14f00fc", "author_url": null, "date": "Oct 11, 2010", "message": "As a double bonus both the Ubuntu Forums and askubuntu content is licensed under CC-wiki, allowing the free flow of information between both sites."}, {"author_name": "Suresh", "gravatar_hash": "6537c0a681d22d4a3f7bf4ce7d209a0f", "author_url": null, "date": "Oct 11, 2010", "message": "Is there a mechanism for partnering with other sites. For example, if we were able to persuade the ACM theory group to support the theoretical computer science SE site, would we be able to create such a presence ?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 12, 2010", "message": "> At least someone in the SO team realizes that forums are for more than question->answe\n\nOf course, forums are much better for arbitrary discussion. We'll be the first to tell you that Q&A isn't a one size fits all solution.\n\n@suresh yes, we are open to this. The more \"public good\" the relationship -- the more likely it is to work out. As I said in the post, philosophically we feel Canonical's goals are similar to ours, and that's a big part of why the partnership is possible."}, {"author_name": "Aiden Bell", "gravatar_hash": "60f28d36c1439f965e2fb55419621968", "author_url": "http://stackoverflow.com/users/104040/aiden-bell", "date": "Oct 12, 2010", "message": "If Canonical's support for askubuntu was for a general asklinux then I would feel more positive about it. I understand the commercial and other motivations, and the justifications ... The fact remains that the overlap between Linux Q&amp;A and Ubuntu Q&amp;A is so vast that the only motivation behind this decision must be market/positioning/commercially oriented rather than community oriented.\n\nI stand to be corrected however."}, {"author_name": "Suresh", "gravatar_hash": "6537c0a681d22d4a3f7bf4ce7d209a0f", "author_url": null, "date": "Oct 12, 2010", "message": "@Jeff, thanks ! that's good to know."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Oct 12, 2010", "message": "\"Of course, forums are much better for arbitrary discussion. We’ll be the first to tell you that Q&amp;A isn’t a one size fits all solution.\"\n\nReally?  Your previous rants about phpBB seem to imply otherwise."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Oct 12, 2010", "message": "I have to say giving it a dedicated domain name so soon after announcing the \"no domain names for now\" policy is hilarious. But it makes sense in this case, I believe, so no argument from me.\n\nI also think that this is the justification the Ubuntu site needed. Allowing it to exist otherwise seemed an oddity that'd create a dangerous precedent. But when it's endorsed by Canonical, it suddenly makes a lot of sense.\n\nSo yeah, seems like a good move. And to be honest, the world would be a better place if other tech/software companies did the same thing. \n\nNow, if anyone could convince Microsoft to dump their *horrible* forums and do something similar, we'd really be getting somewhere. :)"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Oct 12, 2010", "message": "I love way the site's design matches ubuntu's corporate design. Nice job! Just the top-most SE bar is extremely difficult to tell apart from the background, harder than on any other SOFUE site. If you ask me, it needs to be a dark tone, like the dark red of the highlighted menu."}, {"author_name": "Required Name", "gravatar_hash": "f0ab55a990d66c31fe1069f0a31c18c4", "author_url": null, "date": "Oct 19, 2010", "message": "-1 for \"exception that proves the rule\"."}, {"author_name": "Luis de Temuco", "gravatar_hash": "bb2653ad9eb3e14ad2c2912d7e5affb1", "author_url": null, "date": "Oct 21, 2010", "message": "Any particular reason why an Ubuntu SE site and no Fedora, Sabayon, or just generic Linux SE? I understand Ubuntu has a \"certain\" reputation, both good and bad, but unless the official Ubuntu Forums have publicly admitted that they are not... \"competent\", I don't really see a reason to target only the publicest (and noobiest, let's admit it) of Linux distros."}, {"author_name": "Joni", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Oct 21, 2010", "message": "Luis,\nThere is <i>also</i> a generic Unix/Linux Stack Exchange: http://unix.stackexchange.com/\n\nMerging the sites was suggested, but rejected by the community. Earlier posts in this blog discuss all this at great length."}]}