{"response": [{"author_name": "IT Professional", "gravatar_hash": "c5fc228ecccf01c54c379c3b68f30eaf", "author_url": null, "date": "Oct 19, 2010", "message": "Virtual badges are all very well, but I am a sucker for a good marble or ballbearing, (or, at a pinch, a scrap of silvery foil off which the light sparkles alluringly as I turn it hither and thither while gazing at it in awe)."}, {"author_name": "Kevin W", "gravatar_hash": "22e72640fa9919671fc775e2621b3604", "author_url": null, "date": "Oct 19, 2010", "message": "Why is everything early and often with you?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Oct 19, 2010", "message": "@IT Professional\n\nGood point. Will you accept a t-shirt or perchance a sticker? :)"}, {"author_name": "IT Professional", "gravatar_hash": "c5fc228ecccf01c54c379c3b68f30eaf", "author_url": null, "date": "Oct 19, 2010", "message": "I will always accept a free T-shirt, because that means my dad's Christmas present is dealt with for the year."}, {"author_name": "Philippe", "gravatar_hash": "7b53e5bef3baf37b5c2cb29933501416", "author_url": "http://www.pvle.be", "date": "Oct 19, 2010", "message": "I love the Sportsmanship one, that's a very good idea! I'm not sure it will be enough of an incensitive tough, but the idea is there :)"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Oct 19, 2010", "message": "I'm amazed that Sportsmanship has only been awarded to 265 people on SO. I always upvote competing answers if they make a good point. Well, I'll admit that I won't upvote a competing answer if its score is &gt;= my answer, until OP accepts an answer. After an answer is accepted (whether mine or someone else's), I'll freely upvote any good answers. Of course, I'll probably never get the Electorate badge doing this..."}, {"author_name": "Justin Nelson", "gravatar_hash": "d787caaf04b85641692a24099fcee990", "author_url": null, "date": "Oct 19, 2010", "message": "I'd be interested to see who has the electorate badge and the Sportsmanship badge."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Oct 19, 2010", "message": "Great, now is there anything except the Electorate badge to encourage users to vote on questions rather than just answers?\n\nPersonally, I'll never get the electorate badge because it means I'd have to cast something like 550 votes on questions without voting on any answers."}, {"author_name": "gnovice", "gravatar_hash": "f10d46954aba4a7207ea3ba66d4e6f86", "author_url": null, "date": "Oct 19, 2010", "message": "@Justin Nelson: I've got them both. I've downvoted quite a few questions and upvoted quite a few competing answers."}, {"author_name": "Keng", "gravatar_hash": "15769bbea999aee421458f52e7c9d011", "author_url": "http://stackoverflow.com/users/730/keng", "date": "Oct 19, 2010", "message": "Wait, now people don't HAVE enough reputation?!!?\n\nHAR!\n\nYou could always give it back.\n\nBTW: I don't have a greek keyboard to do the captcha...sorry."}, {"author_name": "Hans Passant", "gravatar_hash": "4235db1aa1b11bcddb720dbc70b34a0f", "author_url": null, "date": "Oct 19, 2010", "message": "Strange, I upvote answers when they are good, I don't need to post an answer.  I post an answer when I deem existing answers not good enough.  I rarely get back to a thread to check on added answers, there's no notification for it.  \n\nI don't think I'll ever get that badge."}, {"author_name": "Jeremiah Genest", "gravatar_hash": "8f335886d7fe358a7e03b9693ab6b962", "author_url": null, "date": "Oct 21, 2010", "message": "I think that the 30 cap may be a little to easy to reach daily. Especially if a site is seeing a lot of activity. With these new badges and policy will the cap be considered at some point?"}]}