{"response": [{"author_name": "mbq", "gravatar_hash": "4e58c567f39fb31b8e7d6794bd1f9e9a", "author_url": null, "date": "Oct 21, 2010", "message": "Agree, but you should consider the fact that it is harder to evangelize something without a brand."}, {"author_name": "Joe?", "gravatar_hash": "35b5e9e9ccf3bfe5ff8d22b64a5234d3", "author_url": null, "date": "Oct 21, 2010", "message": "Yesterday I was evangelizing the bicycles site and I had to go double check that it was actually in public beta. I've accidentally evangelized a site in private beta before without realizing it right away. Could we possibly get an icon right on the page that says which beta it's in so we don't have to jump to the 'about' page?"}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Oct 21, 2010", "message": "Perhaps you should change those 'percent answered,' 'answer-ratio,' and 'visits-per-day' to all be within the last 90 days only, so if a site starts to dwindle down, the statistics will reflect that."}, {"author_name": "Bill Huber", "gravatar_hash": "66c15ca582c60477dc4b535d8b39558b", "author_url": null, "date": "Oct 22, 2010", "message": "To incentivize voting, why not award a point for every upvote a user makes?  (You already deduct a point for downvotes.)  One possible objection is that voting, which can be done rather mindlessly, should not affect reputation.  But the very act of voting requires actually looking at a question or answer.  By the time someone makes a few hundred votes they surely will have learned something about the community and its culture: isn't that worth some positive reputation?"}, {"author_name": "Scott", "gravatar_hash": "6285ff8f79ce11a5c9161011137258bc", "author_url": null, "date": "Oct 22, 2010", "message": "Myself (Disgruntled Goat) and Virtuosi have passed the 3,000 mark now on Webmasters so we can \"close by community\" now. Although we don't have any non-admin users in the 2,000-3,000 range yet :(\n\nWe do seem to be getting regular traffic from SO migrations though, which is good news for the site as a whole."}]}