{"response": [{"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Aug 20, 2009", "message": "It would be interesting to correlate the screen res data with valve's screen res data\n\nhttp://store.steampowered.com/hwsurvey"}, {"author_name": "usagigoya", "gravatar_hash": "9248e30dc518561049e9434a7983d868", "author_url": null, "date": "Aug 20, 2009", "message": "A break down of IE6 users by referring domain and/or (user, guest) would be interesting. It would be very surprising if more than a tiny majority are Stack Overflow regulars."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Aug 20, 2009", "message": "Valves hardware survey data. First number is your ranking and value and parenthesis number is valves ranking and value\n\n1.(1) 1280 x 1024 - 24.03% (21.70%)\n2.(2) 1680 x 1050 - 14.52% (18.27%)\n3.(5) 1280 x 800 - 14.32% (8.13%)\n4.(3) 1024 x 768 - 12.32% (17.82%)\n5.(4) 1440 x 900 - 11.57% (11.59%)\n6.(6) 1920 x 1200 - 8.40% (5.41%)\n7.(9) 1600 x 1200 - 3.24% (1.17%)\n8.(7) 1152 x 864 - 1.68% (3.20%)\n9.(8) 1920 x 1080 - 1.32% (3.16%)\n10.(10) 1400×1050 - 1.28% (No Data)"}, {"author_name": "adrian", "gravatar_hash": "7d9cf5e24f93d259305e550b84835e3e", "author_url": "http://navitronic.co.uk", "date": "Aug 20, 2009", "message": "I imagine the large percentage of IE 6 visitors are probably hobbyist developers at work looking for a harmless distraction from whatever.\n\npotentially..."}, {"author_name": "Stefan Kendall", "gravatar_hash": "2b1692c24260b6e7e706967064c30dd8", "author_url": "http://progamonth.com", "date": "Aug 20, 2009", "message": "Opera support is weak, but the numbers say that it should be. Sigh. Additionally, the lack of podcast makes me a sad panda."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Aug 20, 2009", "message": "Most of the IE6 are probably corporates where it is the standard because there is some creaky internal web app that requires it. \nFunny how this new web technology that was going to make software updates trivial and reduce the role of the OS to a 'buggy graphics driver' has resulted in more lock-in than any version of Windows."}, {"author_name": "Chris", "gravatar_hash": "e400600450847a664b70eabedb920d2e", "author_url": null, "date": "Aug 20, 2009", "message": "Simple, don't serve anything meaningful to IE6, alienate them, show them only a link to FireFox and Opera (And possibly IE8?)."}, {"author_name": "mark4o", "gravatar_hash": "4b40b03302aa44551b014be98b5482cb", "author_url": null, "date": "Aug 20, 2009", "message": "Wouldn't the size of the browser window be more relevant than screen size?  Especially for software developers, where multiple monitors with many windows open on each is common."}, {"author_name": "Matt", "gravatar_hash": "03cd042b82ac85b2c5fe0757a94e0413", "author_url": null, "date": "Aug 20, 2009", "message": "I use IE6.  And FF3, but IE6 mainly.  Only because I'm a web dev, and I can't ignore IE6, and the sad part is that if it works in IE6 then it will probably work everywhere, but if it works anywhere else, it very well may not work in IE6.\n\nI've spent hours tweaking an interface, getting proud of it, then forgetting I was working in FF...load it up in IE6, and back to the drawing board..."}, {"author_name": "Kevin Connolly", "gravatar_hash": "30d5456d1b71664feb5cda0233bf0d0d", "author_url": "http://www.kconnolly.net", "date": "Aug 21, 2009", "message": "Problem is that browsers don't report the total desktop size in their user-agent string, only the resolution of the monitor they're running on. I'm running 5040x2100, but my user-agent will report 1680x1050."}, {"author_name": "John", "gravatar_hash": "a22cd5aa8ee2982b6d52678a84634eba", "author_url": null, "date": "Aug 21, 2009", "message": "People hang on to IE6 and just wont let it go. But it would be interesting to see how many are stuck on old operating systems (another hate). It seems that most forget if companies don't upgrade from windows 2000, windows 95 or NT4 (yes there are still users our there) that MS will not let you get out of IE6. So may be it's part of a bigger issue."}, {"author_name": "Maayan Keshet", "gravatar_hash": "ba266b8b44a8e09255c0ee25bfcae157", "author_url": null, "date": "Aug 21, 2009", "message": "An OS breakdown would be interesting"}, {"author_name": "Mike Woodhouse", "gravatar_hash": "5978e2ed3a31f1bd2361dbb919d92012", "author_url": "http://grumpyop/wordpress.com", "date": "Aug 21, 2009", "message": "I think @mgb's probably right (and I'd be interested in the stat that @usagigoya suggests). Unless you have local admin here where I work (and even some classes of developer are not, apparently) you're stuck with IE6 until a gazillion internal crappy apps are finally uplifted and the rollout of the new sexy IE7 can begin. Turns out this project is always first in line when the budgets get squeezed.\n\nThis corporate inertia can have occasional benefits though: it looks like next year we'll be leapfrogging Vista."}, {"author_name": "scunliffe", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Aug 21, 2009", "message": "Mmmm stats! can't get enough of them.\n\nAs a web developer I too have used IE6 for testing and wanted to see just how bad SO is using IE6. So I apologize up front for skewing the stats a bit. ;-)\n\nI would be curious about these stats being expanded to include the OS... so that you could see if say 75% of the IE6 users were also on Windows2000 or something.\n\nThe other interesting stat would be to tie the browser stats to users to see patterns there.\n\ne.g. I would highly expect that a lot of the IE(6 or 7) users might also be Firefox users (or Chrome or ?...) just based on time of day. Typically being stuck with IE at work and being able to choose what browser they want to use at home.\n\nOf course people like me would likely confuse the results... as I've use Firefox, IE 6;7;8, Safari, Chrome, Opera and Arora on SO."}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Aug 21, 2009", "message": "<blockquote>Simple, don’t serve anything meaningful to IE6, alienate them, show them only a link to FireFox and Opera (And possibly IE8?).</blockquote>\n\nSo for those of us who are being held technologically hostage by that one vendor that won't \"certify\" their software for IE7 or IE8 - and thus withhold support if we upgrade on our own - are we supposed to just get F'd?\n\nI was one of the few who was able to upgrade because I don't use that particular app, and its my job to run one of the internal web sites (so I need to test IE8, which I do like :D), but that's one of a small percentage.\n\nWe'd love to upgrade. But we have one vendor that's holding us back, and we don't have the money to tell them what they can do."}, {"author_name": "mykhailo", "gravatar_hash": "357a20e8c56e69d6f9734d23ef9517e8", "author_url": null, "date": "Aug 21, 2009", "message": "<i>I’m running 5040×2100</i>\n\nYou have 6 monitors? O_O \n\nThat's kinda nuts."}, {"author_name": "Brad Barker", "gravatar_hash": "f1bf5b6fbe43b29d5646f90b9eb06a0f", "author_url": null, "date": "Aug 21, 2009", "message": "We need a mobile site so I don't bog my blackberry down every time I visit the site."}, {"author_name": "no one", "gravatar_hash": "5798bce88fb4f6ca62f075deb7ad1c9e", "author_url": null, "date": "Aug 21, 2009", "message": "Jeff just can't seem to let go of the IE6 and XP goblins.  It is bordering on obsessive."}, {"author_name": "Mark", "gravatar_hash": "03cbe95f212d155de7934d44d25510a8", "author_url": null, "date": "Aug 21, 2009", "message": "http://www.ie6nomore.com/code-samples.html\n\n(I really love that their banner doesn't include a link to Opera)"}, {"author_name": "Damien B", "gravatar_hash": "9860d661759d63dfcc8123de372e81ac", "author_url": "http://www.cynicalturtle.net/kame/", "date": "Aug 21, 2009", "message": "\"those that report this data back to Analytics, anyway.\"\n\nIs that for screen size only, or you have no statistics at all for the browsers of the people blocking Google Analytics?"}, {"author_name": "Jason B", "gravatar_hash": "996ec0215c6e5a1796e8bb33104d5b65", "author_url": null, "date": "Aug 21, 2009", "message": "Well, if you break it for IE6, then you will break it for those of us who work for the DoD and are forced to use NMCI machines that come with only DoD approved browsers (IE6 and *gasp* Netscape Communicator 4.76).  \n\nThe gov't is already rife with ignorant programs/programmers, please don't cut off one of my sources of sanity...\n\nI sure do miss tabs..."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Aug 21, 2009", "message": "24% of 29% is 7%, so IE6 is not far from being obsoleted. What I find interesting is that it's very close to what I'm seeing on our site with a much more generic, non-techie audience (8.1%)."}, {"author_name": "Bobby Jack", "gravatar_hash": "9b5c260dc8b7374186b3bebc28b08ce7", "author_url": null, "date": "Aug 21, 2009", "message": "@AnonJr:\n\n\"We’d love to upgrade. But we have one vendor that’s holding us back, and we don’t have the money to tell them what they can do.\"\n\nWho is that vendor?"}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Aug 21, 2009", "message": "@Bobby Jack: I like my job so I won't name names. ;)"}, {"author_name": "Edd", "gravatar_hash": "8328fd788e45abbde53191c2c6630a3c", "author_url": null, "date": "Aug 21, 2009", "message": "I regularly have to use IE6 to access SO from work. It's very depressing/"}, {"author_name": "chakrit", "gravatar_hash": "104c34a4803355ade79413372205138a", "author_url": null, "date": "Aug 21, 2009", "message": "@Brad Barker +1 for mobile site"}, {"author_name": "Paul", "gravatar_hash": "9e6f91454940c4c46262fd34dbf38fd1", "author_url": "http://blogs.msdn.com/paulwhit", "date": "Aug 22, 2009", "message": "I second the gov't approved browser note. There are security restrictions on anything else at one of my customer's sites. Don't you dare screw up my IE6 browsing! :)"}, {"author_name": "marco.ragogna", "gravatar_hash": "b152453e24627505b5889e888585e55f", "author_url": null, "date": "Aug 24, 2009", "message": "1920×1200 \t8.40%\n\nbelonging to these group, I would be very happy to have the possibility to use more spaces of my monitor to display SO sites :D fluid layout or anything else would be really appreciated"}, {"author_name": "jkery07", "gravatar_hash": "636451b16438f0968ceb7bdafd9d53b3", "author_url": "http://www.mybrewerytap.com/", "date": "Aug 28, 2009", "message": "Frustrated by the lack of interesting beer available in the supermarket?\nhttp://www.mybrewerytap.com/"}, {"author_name": "razzie", "gravatar_hash": "31b89c12bc0ab3a23c32bf4e8e86764c", "author_url": null, "date": "Sep 14, 2009", "message": "The most interesting statistic, of course, would be to combine what question people ask and the browser they are using. I bet we'd see a lot of people asking questions like 'why can't I position this div' are running on IE6..."}, {"author_name": "Mike", "gravatar_hash": "060195d1b57e16fde134d18d4dce5c5b", "author_url": null, "date": "Jan 03, 2011", "message": "\"We design for a fixed minimum width of 1024 px\"\n\nYeah, this is annoying, and it's unfortunate to see that it's probably going to get worse.\n\nEven though I've got 1900+ pixels across my screen (or 1200+ on my laptop), I want to do more than one thing with them.  Like having 2 windows open at the same time!  Instead of letting me keep it in a window off to the side (like my API docs, for example), SO really needs me to run it in a much larger window (or full-screen on my laptop), which means I have to mess around with window management whenever I need to look something up and it turns out to be answered on SO.\n\nStackoverflow is the widest site I use, by a fair margin.  It manages to make Facebook look compact!  (I guess FB is actually about the same size, but I always make it 1/3 narrower because the right-hand column serves no purpose.)\n\nI wish there was a \"narrow\" version of SO.  Or if there was a \"mobile\" version, I could use that on my desktop.  :-)"}, {"author_name": "bmike", "gravatar_hash": "7f5e391c3f1a1cb35bf8b91c491a0fbc", "author_url": null, "date": "Jan 03, 2013", "message": "Is there any chance this could be revisited looking back at 2012? A retina iPad has higher resolution than each of the screen resolutions listed and you might have some interesting data on mobile browsers versus non-mobile browsers. A breakdown of the SO versus the rest of the sites might be interesting - even if it's an observation that the numbers are similar or different in some respect."}]}