{"response": [{"author_name": "Juha S.", "gravatar_hash": "5b122ecf0b95d761ff81742406d5c360", "author_url": "http://stackoverflow.com/users/1431/juha-s", "date": "Aug 23, 2009", "message": "Nice work!\n\nAbout the accept rate: could you change \"Questions must have at least 1 answer.\" to \"Questions must have at least 1 *upvoted* answer\"? \n\nCurrently, if you get only crap answers, it will decrease your accept rate."}, {"author_name": "Oliver Giesen", "gravatar_hash": "13c44ef2d9d79dcca761a584be868def", "author_url": "http://ogware.wordpress.com", "date": "Aug 23, 2009", "message": "First, I agree with Juha's comment above.\nNext, could it be that the value is not updated in realtime? I just went in and accepted a bunch of answers to my questions (shame on me for not doing it earlier but in some cases I was still waiting for the \"perfect\" answer which is probably not always realistic) but the percentage value did not change.\nAlso, how does accepting your own answer count in this context?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 23, 2009", "message": "- I don't agree with Juha's idea, see my answer here ( http://meta.stackoverflow.com/questions/16634/count-only-answers-with-upvoted-answers-towards-the-accept-rate-percentage )\n\n- the value is cached heavily so expect any change to take hours to appear (depends on traffic)\n\n- accepting your own answer is valid, as long as you can deal with the limitations on self-accepts\n\nhttp://blog.stackoverflow.com/2009/01/accept-your-own-answers/"}, {"author_name": "nickd", "gravatar_hash": "19f198a57b9c650667f7af4f2eeac544", "author_url": null, "date": "Aug 23, 2009", "message": "I noticed the highlighting of the OP comments straight away and it felt right for exactly the reasons you specify: matching the highlighting colours and being able to pick out responses from the OP.\n\nNice feature."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Aug 23, 2009", "message": "I really don't see a point to show the accept rate. It's just a visual distraction that doesn't mean anything. Maybe, just maybe, there would be a point in marking people with a low accept average (to discourage answering their questions.)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 23, 2009", "message": "> Maybe, just maybe, there would be a point in marking people with a low accept average\n\nGee, I wonder if that was one of the reasons we did this? If only there were some way to know for sure.. :)"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Aug 23, 2009", "message": "&gt; Maybe, just maybe, there would be a point in marking people with a low accept average\n\nThe problem with this is that every other incentive on Stack Overflow has is in the form of rewards for positive behavior (much more rep gain from upvotes than rep loss from downvotes, badges for positive behavior, new privileges unlocked at certain rep levels).  If you only show the accept average that are low, this is in a sense labeling those users \"bad\" in some way.  In order to stay consistent, you have to balance that by also labeling users with a high accept rate as \"good\".\n\nJeff, I like the new change a lot.  It encourages people to accept answers on all non-CW questions, but it also has the nice side benefit of encouraging us to make questions CW if they won't have one clear-cut objective answer."}, {"author_name": "donnacha", "gravatar_hash": "9f6cdebb40c95b2770ba5bf788720aaa", "author_url": "http://donnacha.com", "date": "Aug 23, 2009", "message": "Will these sort of improvements make their way into StackExchange?\n\nDoes the guy working on it confer closely with your team or is he simply working from a snap-shot of how Stack Overflow happened to be when he started a few months ago?"}, {"author_name": "Bill P. Godfrey", "gravatar_hash": "760bfd359153d0682dbe113dc02f81ba", "author_url": "http://youtube.com/billpg", "date": "Aug 23, 2009", "message": "Some of the questions I asked have only came back with the rough equivalent of \"Have you tried turning it off and on again?\"\n\nTo me fair, my questions were a bit obscure and would require specialist knowledge. Should I not be asking that sort of question?\n\nIn one case, the only answer I would have considered worthy of acceptance \"Sorry to disappoint you buddy, but no-one does what you want.\" (Absent someone coming up with the answer I need.) Should I give that as my own answer and accept that?"}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Aug 23, 2009", "message": "I noticed the highlighting yesterday, and I love it. It does make it easier to gather all data for answering questions.\n\nI'm not sure how I feel about the percent acceptance rate. I think that like the bounty, its a nice idea on paper, but its not likely to play out in a way that's a as useful as we'd like."}, {"author_name": "d03boy", "gravatar_hash": "f22989906d98bcccf76f16fcf33d7c08", "author_url": "http://codertips.com", "date": "Aug 23, 2009", "message": "Excellent! Great feature."}, {"author_name": "asf", "gravatar_hash": "94693d00c0cd4fc6f8c514121f7b3da9", "author_url": null, "date": "Aug 23, 2009", "message": "This is soooo stupid. I tend to ask hard questions, if they were easy I could just google. Some of these questions might never get a correct answer, so my % is going to be really low. And this will discourage people from even trying to answer my questions"}, {"author_name": "JW", "gravatar_hash": "bd53c3454ee1d51a49d0983415ea44c4", "author_url": null, "date": "Aug 23, 2009", "message": "Is the point to see whether a user is active and engaged with his questions, before you answer one? Or is it just to see how likely it is that you'll get the \"accepted\" points when you answer his question?\n\nIf it's the former, why not make a measure that includes things like whether you've added comments, edited answers, etc.? Accepting an answer isn't the only way to show that you care about a question.\n\nIf it's the latter, I'm not crazy about this idea. You may personally think that 70% means good, but to most people 70% means a C grade, barely acceptable. So this is going to encourage everyone to accept answers for all of their questions.\n\nBut there are times when that's not desirable. I may have a difficult, open-ended question that still hasn't received a great answer. If I accept a mediocre answer, nobody is going to bother to try for a better one. (And not all such questions should be community wiki.)\n\nHow about just having a badge for this? That way you're rewarding people who do it, but not penalizing people who don't."}, {"author_name": "Jonik", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "Aug 23, 2009", "message": "@Bill P. Godfrey \nThat's a really good point, and something I've encountered too. When asking about something that requires a little more specialised knowledge, there's a big chance of not getting any even half-adequate answers.\n\nIn the case you mention, perhaps you could indeed accept that “Sorry to disappoint\" answer. The good thing is you can always change it later if a better answer comes along (when no bounties are involed). Then again, accepting an answer might (perhaps considerably?) lessen the chance of the question attracting any new answers, which certainly would be undesirable in such cases."}, {"author_name": "Anton", "gravatar_hash": "578d78d400866ad250123dbaac3a4d7b", "author_url": null, "date": "Aug 23, 2009", "message": "JW &gt; You may personally think that 70% means good, but to most people 70% means a C grade, barely acceptable.\n\nMaybe you're right that some people will initially be antsy about having a low acceptance percentage, but high-rep users probably understand the point of accepting answers, so they won't worry about it. It won't take long for the rest of the community to get a feel for what is a reasonable acceptance rate. Then you'll have something other than grade-school memories to compare to."}, {"author_name": "Bill P. Godfrey", "gravatar_hash": "760bfd359153d0682dbe113dc02f81ba", "author_url": "http://youtube.com/billpg", "date": "Aug 23, 2009", "message": "I was thinking about going through my questions where I've not selected an answer so I don't get the low rating, but that seemed dishonest. I don't want to do that."}, {"author_name": "tasc", "gravatar_hash": "4750823ebcbef9e0e3b26b790cc0874a", "author_url": null, "date": "Aug 23, 2009", "message": "to be honest, Jeff, I think it's an absolutely useless feature. What are you trying to do? Discourage us from answering? Most of the crap or question w/o accepted answer come unregistered users, people who will never get back to the site. Further, I don't see why anybody would want this information. Especially since a quick glance at the user's profile page provides it in a much more useful maner (visualised and with a number of answers and votes)."}, {"author_name": "tasc", "gravatar_hash": "4750823ebcbef9e0e3b26b790cc0874a", "author_url": null, "date": "Aug 23, 2009", "message": "oh, and I wonder, where did you get this idea from? Has it been asked on meta? Could we have a link to a feature request?"}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "Aug 23, 2009", "message": "I saw some discussion on meta that relates to this: http://meta.stackoverflow.com/questions/2238/would-it-be-useful-so-show-peoples-hit-rate-i-e-percentage-of-answers-accep\n\nI agree that this measure seems pretty useless. I've answered a lot of questions, and I wouldn't think of choosing whether I should answer based on the past history of the questioner accepting any answer. What's the motivation? To discourage people from answering questions asked by people who rarely accept answers?\n\nAnyway, most points for answers come from upvotes, not from acceptance."}, {"author_name": "Bremen", "gravatar_hash": "9a45de8df0c5c3f6e137c785e71557b8", "author_url": null, "date": "Aug 23, 2009", "message": "I agree with others that your game theory is going to backfire into discouraging users from answering questions from people with low accept rates, and additionally make people with validly-low accept rates feel bad, which is a terrible way to keep people engaged with the system. If I come to SO only to ask difficult questions, get an automatic negative connotation on my questions, and people are (however \"wrongly\") discouraged from answering, that sounds like a completely negative cycle."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 23, 2009", "message": "Greg (et al), allow me to introduce you to the following users.\n\nhttp://stackoverflow.com/users/93796/unknown-google\nhttp://stackoverflow.com/users/108751/rahul\nhttp://stackoverflow.com/users/108308/shamim\nhttp://stackoverflow.com/users/139994/sachin\n\nI can keep going (and going, and going..) but hopefully that's enough to get the point.\n\nIf seeing the accept rate (and the implied history, at the cost of clicking through to the underlying data) does not affect your judgment when answering questions for those types of users ... well, you are a far better man than I.\n\nAs for the other criticisms, remember, anything between 50% and 100% is plenty fine. If I can ask questions on SO, SF, and SU and maintain a 50% accept rate without trying very hard, surely you can as well."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 23, 2009", "message": "> If I come to SO only to ask difficult questions\n\nI object to this \"I ask programming questions so hard nobody can answer them!\" mentality.\n\nNow if you're asking extremely *obscure* questions, I have some sympathy, but at that point accept rate metrics are the least of your problems."}, {"author_name": "George S", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Aug 24, 2009", "message": "So what's the distribution of users with regards to acceptance rate? Is it a bell curve?"}, {"author_name": "Anton", "gravatar_hash": "578d78d400866ad250123dbaac3a4d7b", "author_url": null, "date": "Aug 24, 2009", "message": "George S &gt; So what’s the distribution of users with regards to acceptance rate? Is it a bell curve?\n\n+1. Somebody who can work a database can probably easily produce this from the most recent SO data dump. If anybody finds this (it might show up on meta), please post a link."}, {"author_name": "Gary", "gravatar_hash": "e5366535abefde2075fbd5db8afc7fcc", "author_url": null, "date": "Aug 24, 2009", "message": "Are these features being rolled out to SuperUser as well? (For the record, I like the changes)"}, {"author_name": "JW", "gravatar_hash": "bd53c3454ee1d51a49d0983415ea44c4", "author_url": null, "date": "Aug 24, 2009", "message": "Jeff -- those are extreme examples. Look at me -- my accept rate is in the low 30s. Looks pretty bad. But I'm very active with my questions -- I vote on people's answers, I comment on them, I edit my question for clarity. I just have a lot of questions that, in my opinion, haven't been completely answered yet. Of course, maybe I'm being unrealistic in my expectations for answers. But I'm not sure I should be penalized for that."}, {"author_name": "Martin", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "Aug 24, 2009", "message": "Isn't this a bit self defeating?\n\nWhy are we discouraging people from answering questions?  Surely the aim of the site is not to have your ego stroked (gaining rep from having your answer accepted) but to provide a respository of knowledge.\n\nWho cares if some posters don't accept answers?  It doesn't mean a useful answer hasn't been posted.  All the new scoring means is that someone may be discouraged from posted a superb answer simply because they may feel it won't be recognised as such."}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "Aug 24, 2009", "message": "&gt; What’s the motivation? To discourage people from answering questions asked by people who rarely accept answers?\n\nI agree... SO has historically been a site for questions and answers.  The expert economy concept helps to drive that, but is truly secondary to being a resource for questions and answers.\n\nDiscouraging answers to any legitimate question for any reason strikes me as strange.\n\nLook at how much rep people got from one of Jeff's examples of \"bad\"/\"uninvolved\" users:\nhttp://stackoverflow.com/questions/858572/how-to-make-a-new-list-in-java\n\nIt is reasonable to expose this information, but it shouldn't be soo front-and-center in the UI.  It should be on the user's profile page, or possibly available by hovering over the user.  \n\nMaking the prominent too high will very likely drive other forms of bad behaviour."}, {"author_name": "ShuggyCoUk", "gravatar_hash": "33ac6a3ce34a41c661fdea54feab66b4", "author_url": null, "date": "Aug 24, 2009", "message": "Well I just got a serious points boost (4 accepted answers, three of them fairly old)\n\nI would say that the next data dump is going to show a sizable 'step' in the points totals, especially as they are uncapped :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 24, 2009", "message": "> Who cares if some posters don’t accept answers?\n\nThe number is presented; the system does not make any moral decisions about whether it is good or bad. (Unless you consider highlighting very low and very high values a moral decision). And certainly there is no difference in functionality either way.\n\nwhat you choose to do with that information is completely up to you."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 24, 2009", "message": "> Are these features being rolled out to SuperUser as well? \n\nAll features go to all sites; there are a handful of unique meta features (required tags) but that's about the only exception."}, {"author_name": "Beel", "gravatar_hash": "2090a849272873bc5b317c53d81f64f9", "author_url": null, "date": "Aug 25, 2009", "message": "I agree with the comments that \"70%\" is viewed as not good.  Also, the difference between 70% and 71% is not interesting and not important. So it is just a distraction to see \"exact\" numbers.\n\nHow about this as a thought:\n1. give a rating like: high, above average, average, below average, very low.\n2. base these on statistical measures: average is within one std deviation; above average is more than one std deviation; high is above that; and so on.\n\nThis removes the subjective nature of \"70%\" versus \"60%\", gives real statistical info to users, and makes the info quite clear, whereas the significance of \"79%\" or even \"30%\" is not clear because there is no context, no relation to the rest of the users."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "Aug 25, 2009", "message": "&gt; what you choose to do with that information is completely up to you.\n\nYou say that, but then you say:\n\n&gt;    * If you see a high percentage, it’s an engaged user, someone who frequently goes back and interacts with their questions after asking.\n&gt;    * If you see a middle of the road percentage, it’s an experienced user who understands what accepted answers are for. \n\n&gt;It is considered good manners to accept answers on your questions, eventually, but accepting answers is not required. I personally consider anything at 70% or over quite good, meaning you accept answers on 7 out of 10 questions that you ask.\n\nYou have already ascribed value meanings to various percentages. I agree with Martin and Jess, either get rid of it or move it to the user's profile. You are encouraging a caste system based on arbitrary rules. If SO is going to be a community site, you are going to have to let the community use the site as they wish to some degree."}, {"author_name": "Dave", "gravatar_hash": "1c290dcb35805ebbee2ffb22a70ca9f5", "author_url": null, "date": "Aug 25, 2009", "message": "I think this is back-firing. I am already seeing a trend where not-so-great answers are being accepted just because the poster wants to keep a high accept rate."}, {"author_name": "cloudhead", "gravatar_hash": "753dac14ed2ef39547d230407bf8d3fe", "author_url": "https://twitter.com/cloudhead", "date": "Aug 26, 2009", "message": "completely absurd. congrats.\n\nnow I'm going through old questions which didn't yield any real answer, and accepting one at random."}, {"author_name": "Bremen", "gravatar_hash": "9a45de8df0c5c3f6e137c785e71557b8", "author_url": null, "date": "Aug 27, 2009", "message": "&gt;what you choose to do with that information is completely up to you.\n\nThe problem is that it's not an individual decision, it's a community response. If the community at large has decided to be at least as strict in their interpretation as you have, Jeff (low accept rate == bad), it will discourage valid answers. We've already shown that SO creates excellent answers to bad questions, and now you've chosen to discourage excellent answers to good-but-abandoned questions? Just because the user that asked the question never comes back, doesn't mean nobody else will ever have the same problem. We should be encouraging answers to all questions, not just those that are more equal than others."}, {"author_name": "Bremen", "gravatar_hash": "9a45de8df0c5c3f6e137c785e71557b8", "author_url": null, "date": "Aug 27, 2009", "message": "If not having an \"accepted\" answer bothers you that much, why not involve the community? Let people vote to flag an answer as an accepted answer, assuming the question owner hasn't flagged an accepted answer (and if they choose to flag one, it overrides the community-flagged...oh wait, we have this feature, it's called voting, what was the problem again?)\n\nSO is a repository of information; not everyone will use it the way you intended, but drive-by questions still produce content (mostly answers) that help the community-at-large. If you can come to accept that bad questions generate useful answers, why can't you accept drive-by questions as well? Limit/punish their rep gain if you want for not being \"engaged enough\", but this extra noise on every question and the associated \"stigma\" (which you helped create) is counterproductive to the community's goal of answering questions."}, {"author_name": "gamecat", "gravatar_hash": "0b4b433679e1fb52f7e2ef4ea492496d", "author_url": null, "date": "Aug 31, 2009", "message": "This feature is a nice companion to the bounty systems. If you want an answer to an older question, put a bounty on it. \n\nUnfortunately, some questions do not get a great answer. But with the bounty system, if there is at least a single answer there will be an accepted answer in a week.\n\nIt's maybe an idea to add the number of bounty spend to the accept rate."}, {"author_name": "srid", "gravatar_hash": "4053d6caab18829c4e8d393b6afa8ad8", "author_url": null, "date": "Aug 31, 2009", "message": "There are scenarios where all the answers collectively serve as the best answer. Eg: http://stackoverflow.com/questions/1344222/wix-installer-environment-variables-do-not-expand-appdata"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Sep 04, 2009", "message": "I think I've seen some discussions on here and perhaps heard some on the podcast that indicate the SO team might be against configurable options.\n\nBut.\n\nCould we have a \"preference\" page in which we can turn this option off? I really don't care what someone's question accepting percentage is and it is visually distracting not to mention kind of ugly. It might be a good feature for those that care though. I think a simple on/off switch for this would be nice."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Sep 05, 2009", "message": "> You have already ascribed value meanings to various percentages.\n\nNo, I have given you my *interpretation* of those percentages. You guys and gals are the ones out there doing the real work on the site -- which means YOU have the power to decide what it means and how it will affect your actions.. or not."}, {"author_name": "Timothy (TRiG)", "gravatar_hash": "f44b47d4d5e48ed503d3f7f53194b1ed", "author_url": "http://timothy.green.name", "date": "Mar 13, 2011", "message": "Did you really mean <i>disinterested</i>? I'd suggest a change to <i>uninterested</i>.\n\nTRiG."}]}