{"response": [{"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Aug 05, 2009", "message": "From the show notes, it looks like you didn't answer Jon Skeet's question he sent in:\n\nhttp://meta.stackoverflow.com/questions/11030/podcast-64-discussion-ideas-unofficial/11040#11040\n\nInstead we get Fog Creek, standards committees, and book writing? Are you sure this is still the \"Stack Overflow\" podcast? :-P"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 05, 2009", "message": "Well, Joel is in charge of choosing which questions to play..."}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Aug 05, 2009", "message": "@Jeff\n\nNow that we have Meta, why not let the people decide which questions they would like to see answered on the podcast? Several users have taken to creating \"unofficial\" topics on Meta with suggestions for topics and questions they'd like to see answered - why not make it at least semi-official and allow people to vote on what they want to hear?\n\nI realize that there are many, many listeners that don't use Meta (or even Stack Overflow itself) and many find themselves at a disadvantage in the question pool, but I'd personally rather have that than *no* transparency in the process at all."}, {"author_name": "pestaa", "gravatar_hash": "e640110a73d8faf7afe06ad347ee7e40", "author_url": "http://ego.pestaa,hu", "date": "Aug 06, 2009", "message": "I think you meant Google Adsense instead of Google Adwords.\n\nAdwords is used to have your own ads on Google search pages."}, {"author_name": "Mike", "gravatar_hash": "c98e188ba63a7875d61a77d7aaa3f5c7", "author_url": null, "date": "Aug 06, 2009", "message": "My theory is that AdSense gets the majority of its power from the little guys, those that will never earn over $100 on their ads. There are literally millions of them around and if one of their ads gets clicked then Google have had a million clicks and enough money to make it worthwhile.\n\nJoel's view is very narrow-minded. The big reason why ads won't work on a site like Stack Overflow is the same as why they won't work on a site like Hacker News or Reddit; these users are aware of ads and they'll actively ignore them. The big-guns of AdSense utilise their layouts in order to get lots of clicks and more often than not the big players in the AdSense game are Bloggers in non-tech circles."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Aug 06, 2009", "message": "While I don't run any AdBlockers and will likely never do so, I have developed some sort of \"AdSense Blocker\" automatically in my mind. Whenever I see that AdSense Area  (they all have a characteristic look, be it size, border or background color), my brain automatically ignores it.\n\nI don't know if I am alone with at, but the amount of f**kups that AdSense caused (displaying totally inappropriate adverts which are not simply \"not subject related\" but actually downright offensive) has permanently damaged it's reputation in my book.\n\nHonestly, I think I wouldn't even click on an AdSense link if it were perfectly appropriate and fitting and if the survival of StackOverflow and your family depended on it. Heck, I think I wouldn't even click on them if my own survival would depend on it.\n\nTeaming up with Alex P was the perfect choice. Anyone who hasn't read the posting on TDWTF about when they changed their advertising scheme should read it: http://thedailywtf.com/Articles/Alex-Sells-Out!.aspx\n\nThese Ads are perfect (well, except if you are that Scientology guy from Omaha), they are tasteful, relevant and they are \"different\" which keeps them mostly fresh.\n\nAlso, compare how TDWTF plugs in the advertising in the RSS Feed: Every once in a while, Alex puts up a real blog posting with the sponsors and some extra content. And guess what - I read the sponsor part every time, because even though I know it's advertising, it's written in an editorial style.\nI've seen other sites who literally just push an advert as a new RSS Entry. Needless to say, I never read those.\n\nSo yes, great to see that you found a way to make money with advertising in a legal way, and also proving that you can make money on the internet legally if you are just willing to work for it."}, {"author_name": "matthais wandel", "gravatar_hash": "2c7ff1fb65bd39d445807d16fcd56021", "author_url": "http://woodgears.ca", "date": "Aug 06, 2009", "message": "There are legitimate uses of adwords that work.  Look at plentyoffish.com - the guy makes millions a year on adsense.\n\nI use it myself as well, and I do fairly well.  For legitimate specific content pages (nothing about weird diseases), $5 CPM is achievable.  For something like plentyoffish, 50 cents CPM is more the norm."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Aug 06, 2009", "message": "PS: I think you should add some Evony ads."}, {"author_name": "Evan", "gravatar_hash": "fc01af3a5e729ba784b02b516bfb042e", "author_url": null, "date": "Aug 06, 2009", "message": "I don't know if you have looked at it or not, but an attractive alternative to Adsense (at least in the webcomics community) is Project Wonderful (http://www.projectwonderful.com/) created by quantz (Dinosaur Comics) creator Ryan North.\n\nCheers!"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Aug 06, 2009", "message": "http://www.sixtoeightweeks.com/\n\nJust because I was bored."}, {"author_name": "George S", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Aug 06, 2009", "message": "Wow; I didn't think my question would actually get on the program."}, {"author_name": "Rob Allen", "gravatar_hash": "1b4baeca54cbf0b193744120c6989002", "author_url": "http://pro.robspages.net", "date": "Aug 06, 2009", "message": "This is Aaron: http://stackoverflow.com/users/2603/aaron-maenpaa"}, {"author_name": "Chris Bartow", "gravatar_hash": "5b9185cd1cfdeccdcbdce06ab374d4a8", "author_url": "http://www.chrisbartow.com/", "date": "Aug 06, 2009", "message": "Is it possible to get an updated flash player for the podcast that contains a volume control?"}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Aug 06, 2009", "message": "How about hand-picking books from Amazon/ThinkGeek and putting them on the site with a referral links?"}, {"author_name": "Steve Schnepp", "gravatar_hash": "693f9a2f0eea07660d81e9690b6afd96", "author_url": "http://blog.pwkf.org/", "date": "Aug 06, 2009", "message": "Is there a rss feed for the transcriptions ?\nhttp://meta.stackoverflow.com/questions/12835"}, {"author_name": "Kevin Stewart", "gravatar_hash": "c59d7ffe69ee97ee371090e3c5a3de0f", "author_url": null, "date": "Aug 06, 2009", "message": "@George S I didn't think mine would make it on either. Thanks Joel and Jeff!\n\nThanks for saying that \"You are right, you are victorious!\" While definitely a boost to the ol' ego, I actually just wanted to hear your thoughts. I've learned long ago to let the work speak for itself and our decision to use RDF for THIS project has proven to be the correct one (validated by Google Rich Snippets and Yahoo SearchMonkey, as we are playing in the same space)"}, {"author_name": "moo", "gravatar_hash": "a00b0941a45a1cc9f3cef3f17cc177f7", "author_url": null, "date": "Aug 06, 2009", "message": "So, I have an idea for a stackexchange site: Questions and answers about diseases featured in class action lawsuits.\n\nWe can compare Adsense revenue!"}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack", "date": "Aug 06, 2009", "message": "Ólafur Waage, ha ha ha!  Glorious!  \"Reticulating splines\" = nice"}, {"author_name": "Nick", "gravatar_hash": "d5cc02410ed0de24f96d7370552be6e9", "author_url": null, "date": "Aug 06, 2009", "message": "Joel, it is pretty unfortunate that you would let a poor choice in venue ruin an otherwise wonderful city.  I bet I'm not the only one out of 9 million people that would have jumped at the chance to pay to attend a Chicago DevDays; being the 3rd largest city in the US and all, I'm sure we could have dug up a suitably classy venue somewhere..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 06, 2009", "message": "http://www.sixtoeightweeks.com/\n\nfantastique!"}, {"author_name": "Jim B.", "gravatar_hash": "ba4b8d93ccf2fa7834bb6ba94b7088f3", "author_url": null, "date": "Aug 06, 2009", "message": "I'm really disappointed we're not getting an event in Chicago because of Joel's poor experience at the Congress Hotel.  That place has a reputation here of being a total dump and I recall groaning when I heard Joel decided to host there the first time.  There are actually tons of great venues in and around the Chicago CBD but The Congress is literally the worst the city has to offer. \n\nI've heard some rumored backstory on why its so crappy: the owners want the building condemned so they can get some sort of mortgage/tax benefit (I don't know the details) and flip the property.  Hurray for loopholes!"}, {"author_name": "Joel Spolsky", "gravatar_hash": "d77663c217e9d27b725338c06674c94b", "author_url": "http://www.joelonsoftware.com/", "date": "Aug 06, 2009", "message": "Dear Chicagoans:\n\nThe Congress Hotel isn't really why we're not going back to Chicago... it's just a matter of numbers. There aren't that many software developers in Chicago, and the cost of putting on events there is extremely high, so, like my hometown New York, I'm afraid that it can't be done cost-effectively.\n\nMy theory of the crappy Congress Hotel is that it's in an excellent location, and the owner bought it to invest in the land. Eventually they'll demolish it and build a skyscraper that'll be worth a fortune, but they never found the right time. In the meantime they are running it as the cheapest possible hotel, doing absolutely no repairs or maintenance, just to pay the property taxes and earn a little bit of money while they wait to flip the land. Repairing the building would be very costly and wouldn't increase the revenue they get from the hotel enough to justify doing, especially if they want to flip the land in the future.\n\nThat's just a theory, mind you."}, {"author_name": "Nathan Bowers", "gravatar_hash": "8ef1faca1032b44b8ca486a4e52501ed", "author_url": "http://uxhero.com", "date": "Aug 06, 2009", "message": "Loving the SO podcast lately. \n\nRequest: please put something about the episode topic in the \"name\" field. On my iPhone the episodes look like this: http://twitpic.com/d03ha"}, {"author_name": "Craig", "gravatar_hash": "a57213474d99e1a4f59d73ec074c3f88", "author_url": null, "date": "Aug 06, 2009", "message": "I think the most likely problem you have with Adsense it developers not actively clicking on your ads. Based on what I make on Adsense, which is around $1000-$1500 per month, with your traffic you should be able make $50k per month if you can get the same click through rate. So Adsense does work in the right niches."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Aug 07, 2009", "message": "I'd like to comment a little bit about Joel's bit about book sales. I agree on the general theme, but not on the details. I guess it partly depends on what you call a \"best-selling\" book: I think of C# in Depth sales as \"okay but not stellar\" and that's sold over 5000 copies (going back to about March, which is the last date I have numbers for). Likewise I get more than a dollar a book (about $2 I think, but it depends on the exact nature of the sale) and there are additional income streams like translation rights.\n\nOn the work side, it took almost exactly a year from the first words being typed to it going to the printer. However, that wasn't a year of full time work - it was a year of full spare time work, if you see what I mean. I would *guess* at 330 days of 3 hours a day, so about 1000 hours. That may well be an overestimate though - 3 hours is a pretty hefty evening's work.\n\nAll that being said, you don't get into writing tech books to make money. (Children's books? Heck yes - I reckon my wife has a higher hourly income than I do.) They've got to be labours of love. While I suspect I've been \"earning\" slightly more than minimum wage, I'm sure I could have found other ways of earning more in my spare time... but I wouldn't have had *nearly* so much fun."}, {"author_name": "Referer Historian", "gravatar_hash": "c8a716269419f6c889b38be471eb6bd8", "author_url": null, "date": "Aug 07, 2009", "message": "\"referer\" is Rob McCool's fault.  Fuckin' Rob McCool."}, {"author_name": "Matt Hamilton", "gravatar_hash": "2bd5f782c135ff7ed12a95bf209eb973", "author_url": "http://www.madprops.org", "date": "Aug 07, 2009", "message": "I remember reading a \"silly things found on young children's school assignments\" list once that included this item:\n\n\"The vowels are A, E, I, O, U and sometimes W and Y.\"\n\nAlways made me chuckle that a child could treat \"W\" as a vowel.\n\nHaving said that: Did Joel really describe Iowa as \"a State whose name is made up entirely of vowels\"?"}, {"author_name": "Johannes Rössel", "gravatar_hash": "456cfd5b6826c873f1eef83cb30217e3", "author_url": "http://hypftier.de", "date": "Aug 07, 2009", "message": "\"It’s perplexing why Microsoft doesn’t officially support RC to RTM without a little hack.\"\n\nIt's not really that perplexing, actually\n\nIt's officially unsupported because\n (a) the RC is an RC and therefore unsupported as well\n (b) the number of people upgrading from Vista to Win 7 is expected to be far greater for the lifetime of the product than the number of people upgrading from RC to RTM. Though to be fair, the number of people who'd upgrade from XP would be even greater, I think. But as I see it an upgrade path from XP to 7 would be a real pain and most likely not work very well."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Aug 07, 2009", "message": "RE: Chicago - That's also the place where Emperor Daley illegally bulldozed an airport in the middle of the night like a fascist, jack-booted thug.  (while at the same time asking the FAA and congress for more money for other airport spending)\n\nNo business should be brought to Chicago with the likes of that criminal running the show."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Aug 07, 2009", "message": "The ads on SO are simply too specific. I don't know if this is a failing on the part of SO's marketing dept or the advertisers. But there must be a market opportunity for an ad-broker here.\n\nSO runs ads for small scale dev tools, because there is nowhere else for these people to advertise. Similarly dpreview.com (a digital camera forum site) only runs ads for digital cameras.\nOf the visitors to SO I'm betting that 0.001% are thinking of buying a UML tool in the next year, but &gt;10% are going to buy a digital camera.\n\nIf you pick up a copy of 'what powerboat' in the dentist - it isn't full of ads for outboards and bilge pumps, it has Mercedes and Rolex ads.\nIsn't there somebody who sells advertising in small specialist websites for 'lifestyle' products."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Aug 07, 2009", "message": "@Matt\n“The vowels are A, E, I, O, U and sometimes W and Y.” - they are in welsh!"}, {"author_name": "David Carlson", "gravatar_hash": "c1077de5439c4089a73dfe43fcce9ce7", "author_url": null, "date": "Aug 07, 2009", "message": "One correction. Hadoop is a Map-Reduce library. The system you were referring to (like the MSFT Velocity) is called Terracotta (http://www.terracotta.org/).\n\nAnother thought: sticky sessions can use cookies. Don't sweat the IP address -- this should act as a fallback for users with cookies disabled. If you have cookies turned off AND are switching networks (IP addresses), then you get what you get."}, {"author_name": "David Carlson", "gravatar_hash": "c1077de5439c4089a73dfe43fcce9ce7", "author_url": null, "date": "Aug 07, 2009", "message": "Hmmm... Above was off by a week. Sorry."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "Aug 07, 2009", "message": "@David Time to fire up the time machine then.\n\nCaptcha: what console"}, {"author_name": "Brian Duffy", "gravatar_hash": "974938b8250a08cf9e22714aff1f9fcc", "author_url": null, "date": "Aug 07, 2009", "message": "I'm not a webmaster by any means, but I always wondered why websites never use a model similar to print media -- where ads are often informative.\n\nThe web needs the equivalent of the \"Eat at Joe's\" or \"If you live here, you'd be home now\" ad on the web."}, {"author_name": "Kevin Stewart", "gravatar_hash": "c59d7ffe69ee97ee371090e3c5a3de0f", "author_url": null, "date": "Aug 09, 2009", "message": "@David Actually, I think what Jeff and Joel were struggling to recall was memcahed (http://code.google.com/p/memcached/). Next to Apache, it is probably the most ubiquitous piece of Web infrastructure around these days (it may even replace MySQL as the M in LAMP!)"}, {"author_name": "Roboprog", "gravatar_hash": "1bc2471f5a97b66082c3522697078ef7", "author_url": "http://roboprogs.com", "date": "Aug 11, 2009", "message": "Regarding Adsense:  you might try to add a meta[name='description'] tag to your page head blocks.  Use the values of the S/O \"tags\" (topic labels) to emphasize what each question's page is supposed to be about.  This *should* help the Google engine target the ads placed on the page a little better."}, {"author_name": "Alex Papadimoulis", "gravatar_hash": "cc3cb0c1eb439aafa1c0fab7423a5965", "author_url": "http://thedailywtf.com/", "date": "Aug 11, 2009", "message": "@Michael Stum - I much appreciate the comments, and am glad to hear positive feedback for what we've done at TDWTF and, now recently, Stack Overflow. It's quite a lot of work (no kidding: 4 full-timers on the ad sales staff and growing), but it does pay off, both financially and in terms of not having embarrassing ads.\n\n@Craig - You wrote, \"I think the most likely problem you have with Adsense is developers not actively clicking on your ads\". Careful now. Too many clicks from your users (regardless of whether they're good natured or \"thank you\" clicks) will get you booted from AdSense in a flash. \n\n@mgb - Do you really want to see Mercedes, Rolex, and MasterCard advertisements on Stack Overflow? You haven't gotten enough of their ads in everything else you read? Our goal is to bring highly relevant ads for products and services that will actually make you be a better developer (and therefore improve the software industry as a whole); to us, that’s more important than you buying Coke instead of Pepsi.\n\n@Brian Duffy - interestingly enough, web-based ads don't have the time to be informative like print ads; no one sits there and reads a banner ad, they just scroll away. As an advertiser, you've got a fraction of a section to catch someone's attention and a second or two to entice them to click. Now the landing page... that's where all the information comes in."}, {"author_name": "Craig", "gravatar_hash": "a57213474d99e1a4f59d73ec074c3f88", "author_url": null, "date": "Aug 11, 2009", "message": "Alex, when I say they are not actively clicking on adsense ads, what I mean is that they are actively not clicking on them, not that they should be clicking on them deliberately just to make SO money. I think developers have a lower click through rate than other web users and hence the problem."}, {"author_name": "Lincoln", "gravatar_hash": "776b621bdcd3709d8a74000c651fb2be", "author_url": null, "date": "Aug 13, 2009", "message": "Apparently I'm missing something related to this ad issue. SO has a target audience of people who are most likely to have an ad blocker installed (Jeff himself mentioned having one). \n\nOnce the site went from Google to 'in house' advertising, the ad blocker isn't blocking the domain that the ads are being served from. Therefore, the number of eyes goes up and then the clicks come.\n\nYou can't even really go on clicks-per-impressions, as don't some of the ad blockers still request the ads, just not display them?\n\nIf ads.stackoverflow.com started being blocked by the ad blockers, I bet the rate would drop to a fairly equivalent rate as before.\n\nWhat am I missing here?"}, {"author_name": "Craig", "gravatar_hash": "a57213474d99e1a4f59d73ec074c3f88", "author_url": "http://www.baseestate.com", "date": "Aug 16, 2009", "message": "Lincoln, I think the only other aspect is that developers and other techie people are less likely to click on ads than other users whether they see them or not."}, {"author_name": "Arnshea", "gravatar_hash": "7893e1ad19dc68bf38a05e38dfc6434b", "author_url": "http://arnshea.blogspot.com/", "date": "Aug 17, 2009", "message": "I've been thinking about the whole \"good tester\" vs \"good developer\" thing from a different angle but you guys captured it so concisely I had to send a shout-out.\n\nThe \"too detail oriented to get anything done\" shows up in other ways too.  Once you've worked out a basic design some people are able to run with it.  Others not only get bogged down in trying to solve too many details up front but, and here's the kicker, they seem to enjoy getting bogged down.  \n\nIt's like the discovery (or fabrication from my perspective) of a conundrum is more satisfying than creating whatever it is they were supposed to create.\n\nI've been blogging about this from a slightly different angle at http://arnshea.blogspot.com/2009/08/hackers-sculptors-instincts-and-design.html.  I think you guys have characterized it much more succinctly though.  Kudos, excellent episode!"}, {"author_name": "Chris", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.shrinkrays.net", "date": "Sep 10, 2009", "message": "I've only just listened to the podcast so I'm posting a bit late. \n\nFrom Adwords, I've made $26 in around a year. From Lake Quincye (a Microsoft developer targeted advertising network) this is about $10 a month. That's from 1/1000th of the hits Stackoverflow gets. So from the amount of C# content on SO, it's probably worth getting in touch if you haven't already."}]}