{"response": [{"author_name": "Branden Stone", "gravatar_hash": "976c4240097e4be5c668984f2b3965f4", "author_url": null, "date": "Aug 12, 2009", "message": "What a red herring it was for them to actually link back to not one, but all of S[OFU]."}, {"author_name": "David Smalley", "gravatar_hash": "7750878f37a0217d92c9a9f794d8d83a", "author_url": "http://davidsmalley.com", "date": "Aug 12, 2009", "message": "Thanks Jeff! We're stoked to be part of the league :)"}, {"author_name": "Scott Hanselman", "gravatar_hash": "719c91f5c3013e43ee46ed2bdc67f883", "author_url": "http://www.hanselman.com", "date": "Aug 12, 2009", "message": "Congrats!"}, {"author_name": "Bleadof", "gravatar_hash": "f1fbb0d1ebc43244a90fcac1448f43e0", "author_url": null, "date": "Aug 12, 2009", "message": "I think you really ought to do a logo for your league of justice because that's how you get recognized and you should also think about the technical implementation of the light in the sky to call you folks... ;)"}, {"author_name": "Shaymaa", "gravatar_hash": "a0c8f1b0f472b088ca0f3336849192e5", "author_url": "http://ahamshay.com", "date": "Aug 12, 2009", "message": "Yay! This is really exciting."}, {"author_name": "donnacha", "gravatar_hash": "9f6cdebb40c95b2770ba5bf788720aaa", "author_url": "http://donnacha.com", "date": "Aug 12, 2009", "message": "Wow.\n\nKind of screws anyone who was waiting to launch a StackExchange site on the same topics.\n\nHow many more outside sites will you be bringing on board before the StackExchange beta starts on September 1st?\n\nI'd like to know sooner rather than later if my chosen topic is going to be pre-empted by a partnership with an existing site, because I'm investing a lot of time into it."}, {"author_name": "Skizz", "gravatar_hash": "e222c924e06cc579a6866f6d7588ca66", "author_url": null, "date": "Aug 12, 2009", "message": "Will there be a sticker? But more importantly, which site do each of the characters represent? Is SO Superman? Or do the characters represent people on the dev teams? \n\nSkizz"}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Aug 12, 2009", "message": "@donnacha: There's nothing stopping you from competing and creating a <i>better</i> format/implementation/community than the members of the LoJ. That kind of competition helps all of us."}, {"author_name": "John Nolan", "gravatar_hash": "d71e6f29b4a15b0a2038f28ee913a293", "author_url": null, "date": "Aug 12, 2009", "message": "I'm worried that there are too many silos now. Edit wars will force questions to be closed."}, {"author_name": "Issa Qandil", "gravatar_hash": "9575dc66ec01307fa7d868dd694a3864", "author_url": "https://twitter.com/Qandil", "date": "Aug 12, 2009", "message": "Congratulations!"}, {"author_name": "slink", "gravatar_hash": "a73599568e9ab3c8db26a80b810f6af3", "author_url": "http://20y.hu/", "date": "Aug 12, 2009", "message": "If it *really* was inspired by Stack Overflow, then where is the OpenID login possibility?"}, {"author_name": "David Smalley", "gravatar_hash": "7750878f37a0217d92c9a9f794d8d83a", "author_url": "http://davidsmalley.com", "date": "Aug 12, 2009", "message": "@slink - it's on it's way."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Aug 12, 2009", "message": "I think it's time you standardize the LoJ links on the sites -- I really don't think it makes sense for DocType to link to meta.stackoverflow.com."}, {"author_name": "Matthew Brindley", "gravatar_hash": "b77f418ddd9efdb90fceee20afd29f4c", "author_url": "http://doctype.com/", "date": "Aug 12, 2009", "message": "@Pies - We use meta.stackoverflow.com for feedback, like the other LoJ members. I think, in this case, the link makes sense in our footer."}, {"author_name": "cannontrodder", "gravatar_hash": "10701e62fff85c082ba4cb2a08258479", "author_url": null, "date": "Aug 12, 2009", "message": "If someone tells me to post a question on DocType after posting it on here, I might just explode!"}, {"author_name": "Garrett", "gravatar_hash": "edb14a62e8ed327c37cf4b43eecd8f33", "author_url": null, "date": "Aug 12, 2009", "message": "Please hammer home the League of Justice metaphor a little more - I think there's a guy in Angola who hasn't quite got it yet."}, {"author_name": "Paolo Bergantino", "gravatar_hash": "80ae8ec34e9e3e66c5be50733afaa44e", "author_url": null, "date": "Aug 12, 2009", "message": "I'm kind of bummed out about this. No offense to the fine folks at Doctype but I really enjoy the Stack Overflow engine and I am fairly active answering html/css questions there - I don't really want to take my answers to a whole other site for no apparent reason when they were just fine on SO.\n\nThat being said, I am a programmer that happens to know html and css and most decidedly not a designer, so maybe my answers are not wanted on Doctype :)"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "Aug 12, 2009", "message": "Well hopefully this will prevent the continuous swarm of people asking on Meta for a StackOverflow for designers. Even if it is not built on the actual StackExchange engine.\n\nI must also admit that I find the scattered heartache of users upset that it is not a direct StackOverflow descendant or that they would potentially not be able to open their own site up on the same topic using StackExchange very amusing. But hey, I'm on a sadist kick right now."}, {"author_name": "Eduardo", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": "http://divisionsoftware.com", "date": "Aug 12, 2009", "message": "Please give them an StackExchange account before they have to reproduce all SO good stuff:\n* OpenID support\n* Good rep algorithms (people with below zero rep, my god!)\n* Comments\n* Edits\n* etc, etc, etc"}, {"author_name": "matthews", "gravatar_hash": "45b51a3ab7fa9ab1b640fc7fe6b290a4", "author_url": null, "date": "Aug 12, 2009", "message": "Sure would be nice to have question moving support and user integration with Doctype, but maybe I'm just daydreaming."}, {"author_name": "Patrick", "gravatar_hash": "c0a33aa9d97926947861c0699eb37f82", "author_url": "http://scrap.ath.cx:99/", "date": "Aug 12, 2009", "message": "Having all of these different domain names is stupid. Having a completely different piece of software we have to get used to is even more stupid. This is stupid.\n\nThere should just be a single aggregate site with questions categorized as one of the 5 topics the SO league offers, with the ability to choose which topics you want displayed and not.\n\n(I'm sure the people at Doctype are enjoying their free high-quality traffic; many wouldn't ever have known the existence of the site otherwise)"}, {"author_name": "Anon", "gravatar_hash": "28bdd5298558caad2744c8b32ad913c9", "author_url": null, "date": "Aug 12, 2009", "message": "The League of Justice is about to crash into the Tower of Babylon."}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://www.ComicsInventory.com", "date": "Aug 12, 2009", "message": "I would have to say this is kind of dumb. This isn't 1998 where we have HTML programmers, Client programmers, Server programmers, SQL programmers, etc... Now a days most developers, engineers, craftsmen or what ever you want to call us, have to be renaissance programmers. We need to know a little about all these jobs and more. Thats what I thought StackOverflow was for and why you have the labeling system. Your basically diluting your following and making people learn a whole new system just for a certain type of question. That doesn't make sense to me."}, {"author_name": "Jakemcgraw", "gravatar_hash": "769b1f309a41e2893654c81496b9f8b4", "author_url": null, "date": "Aug 12, 2009", "message": "Looks like Jeff and co are bringing back \"web rings\", hopefully there won't be to much fan fiction involving SO dev team."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Aug 12, 2009", "message": "@Jakemcgraw - I almost spit out my OJ re: \"web rings\" - that is hilarious.  \n\nI am also thinking that continued repeated use of what I think is trademarked and copyrighted material is going to get Jeff some \"fan mail\" from a bunch of corporate attorneys."}, {"author_name": "matt b", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Aug 12, 2009", "message": "Surprised to see this - when I originally saw Doctype last night, I have to admit I got a very strong feeling of \"this is a ripoff of Stack Overflow\" from it. \n\nBut I guess if you guys want to embrace it, then that's your prerogative, and it negates the \"ripoff\" claim..."}, {"author_name": "matt b", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "Aug 12, 2009", "message": "I'm curious though if there is any type of financial arrangement to this situation though? \n\nIs doctype effectively a SO affliate (or vice versa) and sending back any sort of ad revenue they generate from visitors sent to doctype from SO?"}, {"author_name": "Practicality", "gravatar_hash": "6d81d6dc131240aff73b92c2777f1737", "author_url": null, "date": "Aug 12, 2009", "message": "Pretty. But difficult to use. However, maybe that does not matter to designers."}, {"author_name": "Duncan", "gravatar_hash": "def28e010831bea8a662833382eed5ff", "author_url": null, "date": "Aug 12, 2009", "message": "Doesn't duplicating so much of StackOverflow for a custom built website feel completely yucky and wrong for all involved?"}, {"author_name": "Duncan", "gravatar_hash": "def28e010831bea8a662833382eed5ff", "author_url": null, "date": "Aug 12, 2009", "message": "^^ I should have written StackExchange. I mean the technology."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Aug 12, 2009", "message": "Huh. I actually think this is a good idea...\n\nDon't get me wrong - i like CSS and HTML questions, and still think they're often perfectly appropriate for SO. \n\n...But design and cross-browser rendering issues... are troublesome at best. Even the most concrete, programming-related ones. They're just a bad fit - ideally, you'd get a solid description of the problem, or at least a screenshot, plus the actual code... in practice, you get a link to some guy's website and *maybe* a context-free code snippet. Not only does this add extra work (visit the site in multiple browsers, suss out the problem, diagnose it, view source), it makes the question less useful for future readers; since the site will presumably be fixed by then, they'll have to rely on the description of the problem in the question and answers to determine if it matches their own.\n\nDT lets you upload code. DT generates screenshots. It's a custom solution to a specific problem, using the bits of SO that fit but not slavishly copying the portions that didn't. Then adding in their own twist...\n\n...in short, they did to the SO design what SO did to the forum/wiki/newssite design. Good for them..."}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Aug 12, 2009", "message": "Props to the DocType team for creating the site and joining the League of Justice! However, I strongly recommend working with Jeff and Joel to convert DocType to a Stack Exchange site - not only will you gain a lot of new features (editing posts, comments, etc) but it will be much easier to support the site on Meta Stack Overflow. \n\nThis is Meta's mission statement, according to the FAQ (http://meta.stackoverflow.com/about):\n\n&gt; This site is for meta-discussion of a family of Q&amp;A websites, all based on the Stack Overflow engine.\n\nSince DocType is *not* based on the Stack Overflow engine, not tied into the user accounts on the other sites, and since nobody in the community has *any* experience using it, I think it's unfair and unwise to use Meta as its support forum. Hopefully this will be a temporary thing."}, {"author_name": "EBGreen", "gravatar_hash": "c5f10d1a484dac4a364246bf9f410e9b", "author_url": null, "date": "Aug 12, 2009", "message": "\"and since nobody in the community has *any* experience using it\"\n\nActually the creator of DT *is* in the Meta community."}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Aug 12, 2009", "message": "@EBGreen: He joined today, and has answered all of... two questions (by contrast, there are now 15 that are tagged 'doctype').\n\nHowever, if there's one thing that Meta *is* good for, it's discussing itself. If you (or anyone) wants to continue the discussion about whether or not DocType support should happen on Meta, I encourage you to visit this topic:\n\nhttp://meta.stackoverflow.com/questions/13929/should-meta-be-doctypes-support-forum"}, {"author_name": "EBGreen", "gravatar_hash": "c5f10d1a484dac4a364246bf9f410e9b", "author_url": null, "date": "Aug 12, 2009", "message": "Of course the fact that Meta would be supporting DT was only announced today too. So he has been there since the beginning in that regard."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Aug 12, 2009", "message": "What happened to concept of \"Attribution\" - http://blog.stackoverflow.com/2009/06/attribution-required/.  \n\nIt seems to me that these images of comics (and lots of other content on blog.SO and coding horror) are not properly attributed..."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Aug 12, 2009", "message": "OMG! I want to know who owns the copyright on these fascinating cartoon characters, but there's NO ATTRIBUTION so i cannot! \n\nI'll bet it's Jim Davis. The one on the left looks a bit like Odie..."}, {"author_name": "Rakshit Pai", "gravatar_hash": "7dea5c6a70c4ff8cec433cb065fdd8b9", "author_url": null, "date": "Aug 12, 2009", "message": "Is doctype.com cc-wiki'ing their content?\n\nI do not see any license information on the site. Does not having a license make it public domain?\n\nNo response on meta so far - http://bit.ly/haUEk"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Aug 12, 2009", "message": "@Shog9 mock me all you want, but from what I understand using copyrighted/trademarked images can get you shut down, sued, etc.  \n\nIt doesn't matter to me in the least - if Jeff wants to open himself up to lawsuits and cease-and-desists, fine with me, I just find it ironic and inconsistent with his plea/admonishment to attribute..."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "Aug 12, 2009", "message": "@tim: actually, i agree that it should be attributed. However, i doubt it matters that much; they're showing up in blog posts, as part of a reference to the story they represent, not in branding for the sites themselves. If he gets a cease-and-desist, i'm sure they'll disappear quickly..."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Aug 12, 2009", "message": "[Insert more obligatory whining and crying here]"}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Aug 12, 2009", "message": "I don't think I like this. Now one more site to worry about and to search across. More fracture. What if a question is a mix of javascript/JQuery programming and CSS/HTML? So was doing just fine with its CSS/HTML experts. I think I will stick with SO and hope others do as well. I would rather search one mega QA site than many little sibling ones."}, {"author_name": "TheTXI", "gravatar_hash": "4f7c0c43b0fb87f905d369d42d2667ac", "author_url": null, "date": "Aug 12, 2009", "message": "Abdu:\n\nI'd rather not have to sort through one giant site, so our opinions have now been canceled out."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "Aug 12, 2009", "message": "Thinking about this further, I think one should just use Google to search everything even if your target site (like SO) has its own search facility. SO's search always brings back more than what I want because it doesn't have any kind of filtering. So yeah let all these sites come to life."}, {"author_name": "Dr Sauvage", "gravatar_hash": "976c4240097e4be5c668984f2b3965f4", "author_url": null, "date": "Aug 12, 2009", "message": "Who is that image by by the way? Ty Templeton?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 13, 2009", "message": "> Please hammer home the League of Justice metaphor a little more – I think there’s a guy in Angola who hasn’t quite got it yet.\n\nThat's precisely the problem, those Angolan web designers are <i>so</i> hard to reach!"}, {"author_name": "David", "gravatar_hash": "2ed51c9c5347c4573faf7e8d2adc0e2d", "author_url": null, "date": "Aug 15, 2009", "message": "Apropos doctype... http://validator.w3.org/check?uri=http%3A%2F%2Fblog.stackoverflow.com%2F&amp;charset=%28detect+automatically%29&amp;doctype=Inline&amp;group=0 -&gt; Validation Output:  46 Errors \nSomething you're planning to fix in the near future?"}, {"author_name": "Ibrahim", "gravatar_hash": "d56821c584a0b14dc65556faa02ab39f", "author_url": null, "date": "Oct 13, 2009", "message": "Doctype is crappy and highly unusable, wish SO creates an exchange for design."}]}