{"response": [{"author_name": "Michel", "gravatar_hash": "7a72ffed0a1cd0141f4da8587624092c", "author_url": "http://crossbrowser.net", "date": "Aug 21, 2009", "message": "Congratulations on the popularity. I'm interested to see what will be ExpertsExchange move (if any) to stay competitive."}, {"author_name": "Michael E Driscoll", "gravatar_hash": "faef2c296b5989d5df52e251bf3105fb", "author_url": "http://www.dataspora.com/blog", "date": "Aug 21, 2009", "message": "As someone relatively new to SO, I am routing for this overthrow.\n\nLast month a few of us R users organized a little 'Flash Mob' to populate SO with R content.  And I know I am preaching to the choir, but I think\n\n http://stackoverflow.com/questions/1313954/plotting-two-vectors-of-data-on-a-ggplot2-scatter-plot-using-r\n\nis a fantastic example of what Stack Overflow can do that Expert Exchange -- and list-servs -- cannot.   The question and answer was an iterative, collaborative process between questioner and respondees that combine text, code, and images."}, {"author_name": "Mehrdad", "gravatar_hash": "df0bd8a818111607704dab056fcfc091", "author_url": "http://stackoverflow.com/users/33708/mehrdad", "date": "Aug 21, 2009", "message": "\"... we have a healthy respect for other websites **similar** to ours ...\"\n\nI can't see how Stack Overflow and gender reassignment experts are similar. They are not similar at all. SO is pretty useful while hyphen is a useless crap. At least, it's been in my experience."}, {"author_name": "Jim McKeeth", "gravatar_hash": "e5ca3abec062f8174570a4b1d1c840d8", "author_url": "http://www.Delphi.org/", "date": "Aug 21, 2009", "message": "While at one level there is a lot of similarity between the two sites you compared in your graphs, I think they have completely different audiences.  Of course as SO's popularity increases it may capture some audience from other sites, but I imagine there will continue to be people who choose one over the other for reasons that escape the people who made the other choice.\n\nAs you said \"the internet is quite big enough to support lots of different websites doing things as they see fit\"\n\nStill very impressive growth."}, {"author_name": "Drew Stephens", "gravatar_hash": "d1ed8a9e71adc2b356cfc4e020e0dd0f", "author_url": "http://dinomite.net", "date": "Aug 21, 2009", "message": "I look forward to Stack Overflow surpassing Hyphen's popularity."}, {"author_name": "Dennis", "gravatar_hash": "a85af5779b78386bc17a9532a5126ecb", "author_url": "http://blog.denniswilliamson.us", "date": "Aug 21, 2009", "message": "So where does the data in the Google graph for 2008Q2, for example, for SO come from? And what explains the variability of zero during the early years?"}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Aug 21, 2009", "message": "Jeff are you still wondering why AdSense show you more stackoverflow ads than others? See in the \"Top searches\" from the google link you provided.\n\nSO became the SITE for Stackoverflow issues. Perhaps I you have named the site: \"Programmers willing to spend their money\" better ads would have shown.\n\nGoogle page rank strategy ( well know by everyone ) is to give a webpage/site the status of \"official result for __fill in the blank__\"  to the page that has more relevance for a given term. \n\n\nRigth now, google returns 7 links to our favorite site or ralated links for the serch term stackoverflow. \n\n7 out of 9!!!! \n\n\nhttp://www.google.com/search?q=stackoverflow\n\n\nIs not unreasonable that AdSense showed you those ads after all!!!..\n\n\nBTW: I'm replacing Google with Stackoverflow for my programming doubts.  It's a lot more effective and much faster: \n\nhttp://meta.stackoverflow.com/questions/16353/stackoverflow-for-the-lazy-newbie-developer"}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Aug 21, 2009", "message": "Ehm.. Can I have my last post deleted? :\") \n\nI have double checked the link: http://bit.ly/1sWAa8 And I think I've incurred in a minor mistake.\n\nAnyway, StackOverflow.com ( DOT COM!!! ) rocks!!!! :)"}, {"author_name": "donnacha", "gravatar_hash": "9f6cdebb40c95b2770ba5bf788720aaa", "author_url": "http://donnacha.com", "date": "Aug 21, 2009", "message": "So ... that would be respectful sniggering we hear on the podcast when Joel and yourself mention Experts Exchange during the podcast?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 21, 2009", "message": "Well, the name is still funny. I'm not going to apologize for that, considering it's on many all-time-worst domain name lists.\n\nhttp://www.google.com/search?q=penisland+expertsexchange"}, {"author_name": "chakrit", "gravatar_hash": "104c34a4803355ade79413372205138a", "author_url": "http://chakrit.net", "date": "Aug 21, 2009", "message": "There are around 2x global visitors versus US visitors!\n\nEvidence to be nice to those where English isn't their main language!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 21, 2009", "message": "Well, except if you look at where those \"global\" visitors are coming from.\n\nhttp://blog.stackoverflow.com/2009/01/where-in-the-world-do-stack-overflow-users-come-from\n\n#2 UK, #3 India, #4 Canada, #5 Australia. Very ... english-y."}, {"author_name": "Jan", "gravatar_hash": "c95d0b560cd92bcfe0a8a5a6d8bcaf51", "author_url": null, "date": "Aug 22, 2009", "message": "So, what's that peak of traffic you had in fall 2004 according to google?\n\nBtw #5 in the map you linked is Germany, Australia being #6.  And a part of Canada is francophone.  But I already know your attitude towards non-native english speakers.  Too sad.\n\nBut congratulations with the success of Stackoverflow.  I hope that the sister sites ( Serverfault and Superuser ) will also achieve such success!  Good job!"}, {"author_name": "Workshop Alex", "gravatar_hash": "ef98abf337028364146aa99b39c25a8a", "author_url": null, "date": "Aug 22, 2009", "message": "About the monitor resolution... Which resolution does it pick up for people with a dual-monitor setup? Just the monitor that displays the browser? Or just the main monitor? Or both?\n\n(I happen to have one at 1920x1200 and another at 1600x1200 and I think there are more people here with dual-monitor setups.)\n\nJust asking out of curiosity. Curiosity killed the cat, I know. But cats have nine lives so I can waste one... :-)\n\nAnd wow, you're almost killing Experts Exchange here! WOW!"}, {"author_name": "Daniel", "gravatar_hash": "adb7dc8e895d08cf7263a6ab57b341a1", "author_url": null, "date": "Aug 22, 2009", "message": "Competition with Experts Exchange doesn't have to be friendly. \n\nThey're so over"}, {"author_name": "Michael Pryor", "gravatar_hash": "83678606ffe33ee7c1fb50b97338daed", "author_url": null, "date": "Aug 22, 2009", "message": "Since the vast majority of our traffic (80-90%) is from Google, the real winner in charts like these will be whatever site trounces the Google search results.  And as Oscar Reyes points out in the comments on the blog, this is still EE by a far margin.\n\nUnfortunately users like Jon Skeet account for only a small fraction of the traffic in that graph, so all of the awesome features and benefits (and users) that SO has over EE only indirectly contribute to its success -- in those graphs. (People like that stuff, so they blog about SO and make links from twitter, etc which helps the Google ranking).\n\nIn the end, all of this *taunting of EE* is likely to make them change their site to implement some of the better features of SO.  At the very least, it raises their profile somewhat and probably pisses them off. The type of person that would use their sneaky tricks, is also the type of person who would retaliate with frivolous lawsuits.  From Stackoverflow.com LLC's perspective, not discussing them would be a more prudent move."}, {"author_name": "requiredname", "gravatar_hash": "1b7c142ce8efee0fae7226519823e89e", "author_url": "http://notrequired.com", "date": "Aug 22, 2009", "message": "What I find interesting is that while StackOverflow is overtaking Experts Exchange, it seems that the uptake of StackOverflow is not related to the slowing of Experts Exchange. EE actually saw it's first significant rise after a long downhill at the same time as SO took off. It'd be interesting to look again in another year to see what happens though. As of now I'd say your userbase doesn't overlap much, and you may want to look into \"why?\" with a look into EE.\n\nAs an aside, the google graph is a little biased, as stackoverflow != stackoverflow.com. It had a significant presence as a search term before you even decided to name your web site after it. In other words, you're not quite there yet."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 22, 2009", "message": "> And as Oscar Reyes points out in the comments on the blog,\n\nWhat? His link showed stackoverflow in 7 out of the 10 first page results.\n\n> From Stackoverflow.com LLC’s perspective, not discussing them would be a more prudent move.\n\nNobody could reasonably be upset about posting some graphs. It's just data. And besides..\n\nhttp://explore.twitter.com/codinghorror/status/1110429100"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Aug 22, 2009", "message": "I'd like to see the serverfault, superuser, and meta traffic lumped in there on the stackoverflow side.  That'd be a much better \"apples to apples\" comparison, since EE has discussions areas for all those topics as well."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Aug 22, 2009", "message": "Rule of thumb:\n\n- SF traffic is 1/10th SO\n- MSO traffic is 1/10th SF\n\nSU is too new to count yet but should get to SF traffic levels at the very least given the broader subject matter."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Aug 22, 2009", "message": "@Dennis, @Jan the first graph isn't showing stack overflow traffic, but number of google searches for \"stackoverflow\" versus searches for \"experts exchange\".  so obviously there would be some before the site was even dreamed up, since stackoverflow was an existing term."}, {"author_name": "Michael Pryor", "gravatar_hash": "83678606ffe33ee7c1fb50b97338daed", "author_url": null, "date": "Aug 23, 2009", "message": "&gt; What? His link showed stackoverflow in 7 out of the 10 first page results.\n\nOops. You're right. I'm so very wrong.\n\n&gt; You know what's better than being safe? Being AWESOME.\n\nYou're probably right about that too..."}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "Aug 24, 2009", "message": "@Michael Pryor: Hey Don't do that again! For a minute ( well 6 minutes to be correct ) \"I\" thought that \"I\" was WRONG!!!  ( I read and re-read my own post several times to try to figure out when and how I said what you said I said ... wait a minute did you.. or .... omg... ) \n\nFor a minute ( or six ) I thought I have wasted all those years of english courses at the most prestigious english schools at Cambridge to which I did not attended :P .... \n\nFortunately the balance have returned to the force."}, {"author_name": "gamecat", "gravatar_hash": "0b4b433679e1fb52f7e2ef4ea492496d", "author_url": null, "date": "Aug 28, 2009", "message": "I was never a big fan of E-E. Each time the to google search pointed to this site, I clicked the next in row.\n\nSO was refreshing and a bit of competitive, but the community is great and it is about to become the source of ultimate wisdom (for programmers that is).\n\nThere is a huge similarity between SO and some computer games. In the beginning it looks big and you are afraid to get lost. But as time goes by, you start to level up and see something of the world. And then you reach the point that you have seen most of it. Luckily new parts of the world are build."}, {"author_name": "Ugg Bags", "gravatar_hash": "bb0a2256990b2341b282a95273f4780d", "author_url": "http://www.emu-boots.net/UGG_Bags.html", "date": "Dec 09, 2009", "message": "“… we have a healthy respect for other websites **similar** to ours …”\n\nI can’t see how Stack Overflow and gender reassignment experts are similar. They are not similar at all. SO is pretty useful while hyphen is a useless crap. At least, it’s been in my experience."}, {"author_name": "invest tipoff", "gravatar_hash": "545522bd593f412e9dfafac0901bf2d5", "author_url": "http://investtipoff.com", "date": "Jan 14, 2010", "message": "i think that hyphen does not make a difference, it is all about the content and of course the SEO of the website that drives the alexa rating"}, {"author_name": "gas boiler installation", "gravatar_hash": "2e7fd118a1732733f638ba5550b37a67", "author_url": "http://www.macrorplumbing.com/", "date": "Feb 19, 2010", "message": "my opinion is the content is always the keing of any website, thanks"}, {"author_name": "NCR Pads", "gravatar_hash": "c8040e7d571e8272f58e8bb3f0a66d12", "author_url": "http://www.acornprinters.co.uk/", "date": "Jun 19, 2010", "message": "comparing with experts exchange website is not fair, from the above graphs I think you need more backlinks and some social bookmarking submissions, Good Luck, thanks"}, {"author_name": "Fit Findaly", "gravatar_hash": "4f1e0f43befd8d843bc3661e10b83334", "author_url": "http://www.discovery.uk.com", "date": "Jun 25, 2011", "message": "Congratulations but I think there's room for all. People will go to whichever site for advice they feel most comfortable with and I think both sites above should just go with the flow in that repsect."}, {"author_name": "Mechanical snail", "gravatar_hash": "067995986dfbb191d5e914ed15e7b2bb", "author_url": "http://stackoverflow.com/users/319931/mechanical-snail", "date": "Jul 07, 2012", "message": "@Jim McKeeth: \"I think they have completely different audiences.\"\n\nYeah. One is aimed at programmers, the other at search engines."}]}