{"response": [{"author_name": "Bruno Brant", "gravatar_hash": "b1ae2268c7a69c4bb180a2665736a804", "author_url": "http://www.brunobrant.net", "date": "Oct 28, 2013", "message": "First poster? I'm Brazilian and, while the effort is appreciated... Really? Most of computer resources are in English, all languages that I know of are in English, there are thousands of books that were never published in Portuguese...\n\nI really, again, commend the time and action to do that, but the best thing for a Brazilian programmer is to actually learn English."}, {"author_name": "Ahmad Yassin", "gravatar_hash": "ed5048882e35c5d30c8cacc9f9cdf283", "author_url": "http://amyassin.wordpress.com", "date": "Oct 28, 2013", "message": "National Security Administration or Agency? However, they may fix that themselves :D"}, {"author_name": "Rodolfo Buaiz", "gravatar_hash": "c04243faa017bacc715ff4d22fad280c", "author_url": null, "date": "Oct 28, 2013", "message": "Parabéns, Gabe, sucesso!\n\nBruno Brant, someone went into Area51 and felt \"disturbed\" seeing so many language proposals fo Stack Overflow. For one, no one goes into that area and doesn't feel a  disturbance in the force. But, mainly, it's a business of Q&amp;A sites, if doing localized SO's will bring some K thousands of Portuguese, Turkish and Spanish speaking users to the network, what's the harm?\n\nThe disturbance and the communitty instance: http://meta.stackoverflow.com/q/194959/185667"}, {"author_name": "jcmeloni", "gravatar_hash": "d84b2d1591f69c9a57818676d7485a9f", "author_url": "http://www.thickbook.com/", "date": "Oct 28, 2013", "message": "Thanks for the Workplace shout-out! We're trying very hard not to make it a \"self-help group for commiserating\", believe you me."}, {"author_name": "Ashish", "gravatar_hash": "8fe2ef149d1cd77abc10b0742da963f4", "author_url": null, "date": "Oct 29, 2013", "message": "I have worked in Brazil, everything was in Portuguese :( It was soo difficult to even communicate with other programmers... must learn English."}, {"author_name": "Rodolfo Buaiz", "gravatar_hash": "c04243faa017bacc715ff4d22fad280c", "author_url": null, "date": "Oct 29, 2013", "message": "Sorry, I forgot to mention Russian (the 4th with full commitment in A51) in my previous post. And would add that with this NSA shit, Internet tends to balkanization. Maybe in the end, we will only be able to use our localized Stack Overflow versions :P\n\nFrom a geopolitical perspective, SO will cover almost the <a href=\"http://en.wikipedia.org/wiki/BRICS\" rel=\"nofollow\">BRICS</a> in the near future."}, {"author_name": "Phyll", "gravatar_hash": "d10ca8d11301c2f4993ac2279ce4b930", "author_url": null, "date": "Oct 29, 2013", "message": "In my opinion, the stackoverflow should be just in english (most universal language). In this way, the knowledgement will be more spreaded."}, {"author_name": "Camilo Martin", "gravatar_hash": "14570e9514625800a440f40fec36ed6e", "author_url": null, "date": "Oct 29, 2013", "message": "As a Brazilian, please don't. Novices should just man up and learn English. It's my third language but since I've learnt it, I use it almost exclusively because it's just what it is: our lingua franca."}, {"author_name": "Anthony Accioly", "gravatar_hash": "2e1542fe164f8abf326960e219127ac9", "author_url": "http://a.accioly.7rtc.com", "date": "Oct 29, 2013", "message": "I respectfully disagree with my Brazilian fellows that don't think that a Portuguese version of Stack Overflow should be launched. It should! No only it will certainly be a most welcome addition to the Brazilian community, as an active Stack Overflow user I personally commit to contribute on both the English and Portuguese versions!\nGiven the success of Brazilian programming related message boards, there is a huge demand for information, plus a lot of very talented programmers that either can't or won't write in English for several reasons (some of them are even capable of communicating but will shy away if asked to post in English).\nI struggle to make good content written in Portuguese and I certainly think that the community driven / community moderated aspect of Stack Overflow will help leverage the quality of Portuguese Q&amp;A sites and improve the lifes of Portuguese speaking programmers that will be able to find high quality answers in their native language when googling something."}, {"author_name": "Steve", "gravatar_hash": "6cd6b2686d883b2aed849a83c4356d81", "author_url": null, "date": "Oct 30, 2013", "message": "Seems that the advocates of localization are missing a big point. The existence of a Q/A site is to give the best answers to everyone's questions. A fragmented scenario, where every national ghetto keeps the questions and the answers locked in its own language, will destroy the usefullness of the site. You don't like english? You could propose an alternative accepted by everyone but the language should be only one."}, {"author_name": "John", "gravatar_hash": "0fc637a07270d4dfbf6958a281a5305e", "author_url": null, "date": "Oct 30, 2013", "message": "I worked on a test system for use in Portugal.  The messages were translated from English to Portuguese by a guy from Brazil.  He knew Portuguese right?  When the system was delivered to Portugal the users ask who did the translations?  They were just weird.\n\nKeep in mind that Brazil Portuguese / Portugal Portuguese is like American English / British English.  The same but different.  The same most likely applies to the other Portuguese countries.\n\nJohn"}, {"author_name": "40-Love", "gravatar_hash": "c81d733ee879bec02053a5be28a4b427", "author_url": null, "date": "Oct 30, 2013", "message": "As a Brazilian, I think a localized version of the site for each  language is a bad idea. It keeps it more complicated for the majority of users. There are plenty of translator software online, if you don't know English, it's easy to find a good English translator. We also have a great community to help edit and make corrections to your text. Brazilian programmers should learn English. It's the world's language right now, and if you refuse to learn it, sorry, you will be left out in the cold."}, {"author_name": "Dom", "gravatar_hash": "df53ac470d709dc9c71ff00cab1334d6", "author_url": null, "date": "Oct 30, 2013", "message": "Why don't they just use Chrome to translate the page, and help Google improve the translations in the process? Or - a lot more time consuming - translate the existing questions. There are many options that won't cause duplicate questions on separate sites in different languages. \n\nI'd also bet that you'll get some trolls that just repost all the best questions from the English site to artificially inflate their reputation."}, {"author_name": "Altaf Hussain", "gravatar_hash": "875a5315833e61dd70957d27ed2d14cc", "author_url": "http://altafphp.blogspot.in/", "date": "Oct 31, 2013", "message": "Again, A new milestone has been acheived by stackoverflow."}, {"author_name": "aristos", "gravatar_hash": "34206e4ebc7412e67a70f6cfd94cde49", "author_url": null, "date": "Oct 31, 2013", "message": "I think its a very bad idea to localize the site.\nEnglish is the global language, and english is the Computer Science language! It makes no sense to have the same question in greek, portugese and russian!!!"}, {"author_name": "JoshDM", "gravatar_hash": "82762ea3991b3411abab1054dea063a4", "author_url": "http://www.joshdm.com", "date": "Oct 31, 2013", "message": "I got name-dropped.  Yowza.  I was wondering where those seemingly random 3 up-votes on an answer I had posted 2 weeks earlier came from."}, {"author_name": "Farhad khan", "gravatar_hash": "3ce3c13aa5d2b11deafd12b7435baa4f", "author_url": null, "date": "Nov 03, 2013", "message": "As English is an international language, so it is totally out of question for localize version of the site . Brazilian Programmer should learn English."}, {"author_name": "Arbaz Khan", "gravatar_hash": "3b601b05be057e510d44a22ef04e0c5e", "author_url": "http://www.androidappsonpc.net/", "date": "Nov 07, 2013", "message": "A new milestone has been achieved by StackOverflow but in my opinion, the main language should be English as it is the international language."}, {"author_name": "James Parker", "gravatar_hash": "de499935c1940ed140d2a48e7b6da628", "author_url": "http://www.technologyvenue.com/", "date": "Nov 07, 2013", "message": "Awesome man. But I would suggest you to stick to the international language and that is English. Most of the countries speak the language so going with it would be the best thing for us and hopefully for other readers as well.\nCheers :)"}, {"author_name": "Maira Carvalho", "gravatar_hash": "eef19dd3ea3da41d6d9fee7084979ff8", "author_url": null, "date": "Nov 08, 2013", "message": "Yay for the Portuguese version of Stack Overflow! All the Brazilian programmers who don't speak English (and thus cannot come here to this blog post to expose their point of view) will be very happy and honored to have such a wonderful source of information in our language.\n\nCheers! :)"}, {"author_name": "archaznable", "gravatar_hash": "7fedabc77b639259c6a5b015f609d3e0", "author_url": "http://www.ipodder.org/", "date": "Nov 10, 2013", "message": "Good job with the podcast Area 51? would love to go there and see some aliens lol"}]}