{"response": [{"author_name": "Yannis Rizos", "gravatar_hash": "a610732cb6ac525c26ff5bcfa9433f41", "author_url": "http://programmers.stackexchange.com/users/25936/yannis-rizos", "date": "Jun 04, 2012", "message": "Hm... I don't think there's a problem here, other than trying to make up questions. That's a recipe for failure, Stack Exchange is supposed to be about \"practical, answerable questions based on actual problems that you face\" and not questions based on what happens to be hot this week. If your practical and actual problem happens to also be related to a \"hot\" topic, lucky you, but anything else is a bit fishy.\n\nAlso, never make your case in the comments, that's terrible advice. If you have a case make it on Meta or in chat, never in comments."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jun 04, 2012", "message": "I disagree that every disputed closed question needs a meta post, @Yannis. Duplicates especially usually just need clarification (in the case where the \"original\" doesn't provide a useful answer to the asker of the duplicate - a comment (remember, moderators can be @-notified when they close questions) and perhaps an edit are all that's really needed.\n\nYes, protracted arguments and extended discussions should go on Meta. And chat's always great when you find yourself \"talking past\" other parties. But they're overkill for most simple things."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://hermeneutics.stackexchange.com/users/68/jon-ericson", "date": "Jun 04, 2012", "message": "@Yannis: Comments are an excellent place to argue your case.  But I would say, editing the question to respond to comments works even better.  The advantage of comments is that when and if the question is reopened, they can be cleared away.  Also, it follows the principle of keeping like content together.  Chat and meta are sometimes too far away from the text of the question.\n\nOne of the beauties of the Stack Exchange platform is that a community can rally around a question and turn it from a bad (or boring) question into a first-class question.  The key is that anyone can edit (or suggest edits).\n\n(I can't see how to beat the Skeptics question into shape, however.)"}, {"author_name": "Yannis Rizos", "gravatar_hash": "a610732cb6ac525c26ff5bcfa9433f41", "author_url": "http://programmers.stackexchange.com/users/25936/yannis-rizos", "date": "Jun 04, 2012", "message": "Well, that's the least interesting part of my comment, @Shog9 ;)\n\nI've never seen a comment discussion about a closure resolve itself swiftly, however I must admit that my opinion is probably biased from spending too much time on ProgSE, where we love protracted arguments and extended discussions with a passion."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jun 04, 2012", "message": "We have a rule internally, @Yannis: \"Don't use behavior on Progse as a reference for anything\". ;-)"}, {"author_name": "Manishearth", "gravatar_hash": "0a3069491bfded90cdf623341cadc1d1", "author_url": "http://chemistry.stackexchange.com/users/22/manishearth", "date": "Jun 04, 2012", "message": "I agree with @Yannis' point about construing questions. Trying to make up questions is a bad idea unless you know the site well. Usually checking out other questions on the site is a good way to get a quick intro to the site--but you ought to participate in the normal way before trying to construe questions.\n\nAlso note that \"hot topics\" are usually those that _experts_ shy away from. F or example, popsci stuff like \"mentos in coke bottle\" would probably be downvoted/closed on Chemistry.SE. And that's a rather popular search. So no,  forcibly trying to \"capitalize on trends\" isn't a good idea, IMO."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jun 04, 2012", "message": "FWIW, I think these results are pretty good evidence that these communities are <i>avoiding</i> the sort of dodgy, keyword-focused \"content farm\" behavior that is the hallmark of so many other Q&A sites. \n\nGiving sub-par questions a pass just because they happen to touch on a popular topic is a recipe for mediocrity. See also: <a href=\"http://blog.stackoverflow.com/2012/01/the-trouble-with-popularity/\" rel=\"nofollow\">The Trouble With Popularity</a>."}, {"author_name": "phwd", "gravatar_hash": "16c99e5eefab93030d7c3c56b7c5aad9", "author_url": null, "date": "Jun 04, 2012", "message": "This was definitely not the way to do it. I agree with Shog9 on this. Your questions, at least on Web Applications (if they were part of your experiment as well) were pushing to the style of Quora begging more of a discussion rather than a specific answer.\n\nI think it would be good if you asked current moderators what they do to get questions in the popular zone rather trying to pull something from a popular trend. As others have said, that is a path destined for failure.\n\n&gt; Lest you think all my hot topic assaults were for naught, think again\n\nYou honestly just played the numbers game. Ask enough questions and some are bound to make it pass the gate"}, {"author_name": "Sam Brand", "gravatar_hash": "b2ae4c5562814cb2178451ed40b05367", "author_url": null, "date": "Jun 04, 2012", "message": "@manishearth @phwd @yannis - To clarify, I'm not condoning fabricating or seeding questions inspired by what's hot. Just curious whether our platform can today or one day be seen as a place where smart, hot-topic questions can be asked."}, {"author_name": "Matthew Read", "gravatar_hash": "9f45abdea17c709041812609c7fdfb69", "author_url": null, "date": "Jun 04, 2012", "message": "I have no idea what the Venn-esque diagram is intended to mean, I just get a vague sense that it's offensive.  I'm not offended myself but I can't see how it adds anything to the post, it's random at best."}, {"author_name": "Sklivvz", "gravatar_hash": "3fd9e5b2c59170ec3d74dde30d233fa4", "author_url": "http://skeptics.stackexchange.com/users/96/sklivvz", "date": "Jun 04, 2012", "message": "Frankly, on Skeptics we've been accepting questions on \"hot\" topics all along. For example, Fukushima (http://skeptics.stackexchange.com/search?q=fukushima) but also the Queen (http://skeptics.stackexchange.com/questions/5576/is-the-british-monarchy-economically-beneficial) and I am sure we will be doing so in the future.\n\nYour question was simply closed because it was a question on beliefs. What facts would you expect us to dig up on that? :-)"}, {"author_name": "Yannis Rizos", "gravatar_hash": "a610732cb6ac525c26ff5bcfa9433f41", "author_url": "http://programmers.stackexchange.com/users/25936/yannis-rizos", "date": "Jun 04, 2012", "message": "@sam\n\nSmart hot topic questions get asked all the time, it's only natural that people will want to know what the buzz is about. Anyways, your experiment did work, 4 of your questions were welcomed, and you have a good case for the Facebook IPO one, a case you could have made in comments or on Meta and get your question re-opened.\n\nBut: We don't like artificial questions. We are all volunteering our time here, and we only do it to help others. We love solving problems, and when we detect that a question is about anything else than an actual problem (i.e. reputation, views, whatever), we will re-act. Harshly."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Jun 04, 2012", "message": "What can we do? Vote to reopen..\nYes, because that's not at all combative and discouraging... just what every user looks for on a Q&amp;A site - to have to fight for questions not to be closed. Fix. The. System. New users (and plenty of veterans [ahem]) have zero patience for fighting moderations wars. They'll just ask at Quora."}, {"author_name": "Majid", "gravatar_hash": "65874db459f8b395ccd37fd71a4d920c", "author_url": "http://stackoverflow.com/users/66580/majid-fouladpour", "date": "Jun 05, 2012", "message": "I think it's a matter of attitude. It's not just that googlers are not signalled to come in; we bang the door on the faces of some of those who do come.\n\nThis attitude could be seen naked here:\nhttp://meta.stackoverflow.com/questions/61288/allow-for-pre-emptive-tagging-of-possible-duplicate-questions-as-possibly-a-dupl"}, {"author_name": "Steve", "gravatar_hash": "58fb59aad866d55d2d3042d69c41d517", "author_url": "http://poppyhead.com", "date": "Jun 05, 2012", "message": "Wow neat! You've created ehow!  /barf"}, {"author_name": "Sklivvz", "gravatar_hash": "3fd9e5b2c59170ec3d74dde30d233fa4", "author_url": "http://skeptics.stackexchange.com/users/96/sklivvz", "date": "Jun 05, 2012", "message": "@Yannis +1 at \"We don't like artificial questions\". That's pretty much clear in our FAQ."}, {"author_name": "phwd", "gravatar_hash": "16c99e5eefab93030d7c3c56b7c5aad9", "author_url": null, "date": "Jun 05, 2012", "message": "@Sam with Yannis on this one as well. We already serve hot questions thus http://stackexchange.com/questions. The way you are doing it in reverse, moderators as well as power users are able to quickly tell that it's not a real problem to solve."}, {"author_name": "Rachel", "gravatar_hash": "01b235a8024b2dd10f427c301c876a0b", "author_url": null, "date": "Jun 06, 2012", "message": "I think its great you did an experiment like this.\n\nThis is probably very similar to how new users would use the sites if they come across them while searching hot topics, and its nice to see how new-user-friendly the individual SE sites are.\n\nAnd personally, I see nothing wrong with asking questions out of curiosity instead of waiting until you have a problem to ask questions, although I suppose that might be different depending on the SE site :)"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jun 24, 2012", "message": "I, too, think it's great that you publish experiments like these. Please continue doing so. It's totally in the original spirit of Stack Overflow to talk about the business's workflow, research, and findings as much as possible. Like the technical blog entries that I think are invaluable for anyone trying to run a high-traffic site, this is immensely valuable knowledge. Please don't be  discouraged by the \"oh, so this is what people at SE do all day\" style comments - a business that depends on traffic obviously needs to do research like this."}]}