{"response": [{"author_name": "Oak", "gravatar_hash": "f7d4d2fea0deac168bc7e00e6d8f1db5", "author_url": null, "date": "Jun 08, 2012", "message": "I like the first badge, but not very fond of the second. I have a feeling it will encourage badge-hunters that care nothing about the elections to just vote randomly for the badge."}, {"author_name": "badp", "gravatar_hash": "c81f585328c241594864f888f1154025", "author_url": null, "date": "Jun 08, 2012", "message": "And suddenly, 40 notifications."}, {"author_name": "Opusadicafix", "gravatar_hash": "07ac1af36c95150f42053541bc71576c", "author_url": null, "date": "Jun 08, 2012", "message": "It's scary that the USA allows companies to store personalized page visit data for more than 7 days."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jun 08, 2012", "message": "@Opusadicafix as opposed to.... which country? And why is this scary? I mean, I'm all for privacy, but that sounds pretty silly."}, {"author_name": "ThiefMaster", "gravatar_hash": "bc66db28aa7c3fa8e4ce4238b696dee9", "author_url": null, "date": "Jun 08, 2012", "message": "@Opusadicafix: While I'm all for *sensible* privacy some things are just exaggerated. Especially with a high-ranked StackExchange member stating (I think it was on of the founders) that he's  \"Anti-Log except for moderator actions\" some time ago I highly doubt that the data you mentioned is actually logged.\nAnd even if it is - how could it ever be abused? I don't see how it would be valuable when sold to other companies etc.\n\nChances are good that a criterion to get a Caucus for a past election is having participated in it, e.g. by commenting, up/downvoting during primaries or casting a final vote - all of them are actions that will be in the databases forever."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jun 08, 2012", "message": "@Opusadicafix: just to be clear here... There are a few specific things logged on your account primarily for stuff like this: we keep track of whether or not you visited the site each day (for the enthusiast / fanatic badges) visited each section of the FAQ (for the analytical badge) and visted the election page (until today, that was used purely to track unique, voter-eligible visitors). \n\nIf this bothers you, you'll be happy to know that deleting your account destroys all of it."}, {"author_name": "Sklivvz", "gravatar_hash": "3fd9e5b2c59170ec3d74dde30d233fa4", "author_url": "http://skeptics.stackexchange.com/users/96/sklivvz", "date": "Jun 08, 2012", "message": "Thanks to the badge I now know exactly who voted for the Skeptics elections. Is this as intended?"}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": "http://stackoverflow.com/users/419/kev", "date": "Jun 08, 2012", "message": "@Sklivvz - would it matter? Not sure about the US/Rest-of-World, in the UK \"who voted\" is publicly available data. When you present your voting card at a polling station, your record in the printed electoral register is scored out. It's then possible to obtain marked up electoral registers after an election and find out who (at the very least) turned up on polling day and got as far as accepting a ballot paper."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jun 08, 2012", "message": "Sklivvz: yes, it's intended. Voting is <a href=\"http://blog.stackoverflow.com/2009/12/badges-positive-only/\" rel=\"nofollow\">a positive action</a>.  \n\nNow, a [voted-for-sklivvz] badge..."}, {"author_name": "Thomas Scholz", "gravatar_hash": "e2fe56c959752e5a5b6e2635fa9fb0d1", "author_url": "http://stackexchange.com/users/113787/toscho", "date": "Jun 08, 2012", "message": "Shog9: Now we can make list of users who were able to vote, but didn’t do that. Is this intended?"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jun 08, 2012", "message": "@Thomas: No. Strictly-speaking, you can turn any badge into a negative thing by listing out all the people who <i>don't</i> have it, but AFAIK the only time we do this is... Well, on the election page, if you decide to nominate yourself."}, {"author_name": "Nanne", "gravatar_hash": "91a78cf1465182161a79685058d8b39b", "author_url": "http://androblip.huiges.nl", "date": "Jun 09, 2012", "message": "I think I agree with @Oak, who has\n\n\" ... a feeling [the second badge] will encourage badge-hunters that care nothing about the elections to just vote randomly for the badge.\"\n\nThe comparison with a real election might go awry a bit, as you get a badge that is 'the same' as other badges: I don't believe one would go and vote just to get a sticker, but compare it to a baseball-card (or whatever the equivalent of that is currently) that you would only get when voting, and voting was as easy as one click...\n\nOn the other hand, if you care enough about the site to want badges, and known enough that you get one for the election, it might be just a  small step to check out the candidates? Though the nominations do have some reading in them...\n\nWas there any reasoning dealing with this?"}, {"author_name": "tissit", "gravatar_hash": "e693d4dae2be8775ecdd2a16664175ec", "author_url": null, "date": "Jun 10, 2012", "message": "I'm all prolog. Especially schelog."}, {"author_name": "Stuart Pegg", "gravatar_hash": "6d11f2969573e2a07ff99f6c4b0237f1", "author_url": "http://tsstsst.com", "date": "Jun 11, 2012", "message": "I approve of this change. Mostly because I like badges, but also because it follows the trend of encouraging everyone (including badgers like me) to do the right things.\n\nHow about gold a badge for failed moderator candidates that went through to the Primaries, but were then abandoned by the masses in favour of the status quo.\n\nYou could call it \"Not bitter at all\". :)\n\nBadges badges badges (mushroom mushroom)... *cough* Sorry. Badger pun."}, {"author_name": "Josh Gitlin", "gravatar_hash": "e22fcc2b5b7fbc19e1f9e9f9d8ddf0fc", "author_url": "http://josh.gitlin.name", "date": "Jun 11, 2012", "message": "How lame you use the \"I Voted\" image I linked to, yet you named the badge \"Constituent\" instead..."}, {"author_name": "Neil", "gravatar_hash": "84502cb3302558cf60f0ba7a7ce87e5a", "author_url": null, "date": "Jun 11, 2012", "message": "If the badge hunters are voting randomly it shouldn't effect an outcome.\n\nHowever if they all vote for Allowishus A. Abercrombie then there's going to be a problem."}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": null, "date": "Jun 11, 2012", "message": "I still think the act of advancing from nomination to primary and ultimately to the election phase is badge worthy. As you said, candidates _are_ put through the proverbial wringer. Perhaps a silver 'frontrunner' badge for those that make it through the primary?"}, {"author_name": "AviD", "gravatar_hash": "a88248f632c039340efa02505be355e5", "author_url": null, "date": "Jun 11, 2012", "message": "Very nice. \n\nAlso agree with the previous commenters that mentioned badges for running in the election. \nI would take this a step further, award a bronze for nominating yourself at all (even considering the risks involved... perhaps require a minimum of votes), and a silver badge for passing the primary.   \nI think it's also worth considering granting an additional badge (probably gold) to ex-moderators. Some small recognition of their time and efforts, even after they've resigned (or were voted out a year later)."}, {"author_name": "Nicholas Paldino [.NET/C# MVP]", "gravatar_hash": "1b2b5d5007262ea3f9e21ab5b15f8b75", "author_url": "http://www.caspershouse.com", "date": "Jun 16, 2012", "message": "Can the gold versions of these badges be for *winning* the election?"}, {"author_name": "Emil Vikström", "gravatar_hash": "a633afaf19e6d4bb53ee50b62e3b5397", "author_url": "http://erefredag.se/", "date": "Jun 25, 2012", "message": "Nicholas, that would possibly award people writing a very good description but not intending to live up to those standards."}]}