{"response": [{"author_name": "Anon", "gravatar_hash": "701c89627647c89b6e39452774dd98d6", "author_url": null, "date": "Jun 26, 2012", "message": "&gt; It’s no coincidence that our three largest sites happen to have their own brands.\n\nWhile this statement is true it's not the reason Stack Overflow, Server Fault and Super User have their own brands. These three sites have their own brands because they were created by Jeff &amp; co. before the Area 51 process was formed. They were created fully branded with their own domain names and identities.\n\nThey are the largest sites because they are the oldest sites.\n\nGaming (sorry Arqade) was promised a name when it was created but this was withdrawn when the site launched. The promise was changed to \"when you get Server Fault levels of traffic\".\n\nIt's nice to see that Stack Exchange are fulfilling that promise, but please don't rewrite history in this way."}, {"author_name": "Yannis Rizos", "gravatar_hash": "a610732cb6ac525c26ff5bcfa9433f41", "author_url": "http://programmers.stackexchange.com/users/25936/yannis-rizos", "date": "Jun 26, 2012", "message": "damn, readthefaq.com is not available... It'd be perfect for Programmers."}, {"author_name": "phwd", "gravatar_hash": "16c99e5eefab93030d7c3c56b7c5aad9", "author_url": null, "date": "Jun 26, 2012", "message": "@Anon is right. I'm happy for Gaming they did amazingly good in traffic, but this was a promise from a long time ago, not an experiment. It would look silly if SE Inc., didn't match on their end and that's all there is to it. For the rest of the SE Network, this is highly unlikely to happen. \n\nIt would cool if SE Inc, stop bringing up the naming game."}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jun 26, 2012", "message": "@Anon, @phwd: you're leaving out a <i>huge</i> part of the history of this yourself - the bit where SE realized that trying to establish individual branding for every site as it launched was a HUGE distraction and abandoned that promise... Nearly two years ago:\n\n<ul>\n<li><a href=\"http://meta.webapps.stackexchange.com/questions/624/webapps-stackexchange-com-versus-nothingtoinstall-com\" rel=\"nofollow\">Web Apps discussion</a></li>\n<li><a href=\"http://meta.cooking.stackexchange.com/questions/824/is-this-site-going-to-become-seasoned-advice-if-so-when\" rel=\"nofollow\">Seasoned Advice discussion</a></li>\n</ul>\n\nLemme just repeat part of this very post:\n\n<blockquote>And there are <a href=\"http://blog.stackoverflow.com/2010/10/stack-exchange-naming-for-dummies/\" rel=\"nofollow\">other areas where the effort can be better spent</a>: finding ways to convey the unique value of your community to newcomers in as few words as possible is enough of a challenge without trying to force it into a one- or two-word name + domain.</blockquote>\n\nRead the post linked there, from October of 2010. Then follow the discussion on Gaming's name - this took <i>months</i> of effort to put into effect, and there's no evidence yet that it'll make ANY difference: there's a huge opportunity to waste time and effort for no real gain here."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jun 26, 2012", "message": "I ♥ this. However, it would be way cooler if the domain used actually were arqade.com instead of gaming.stackexchange.com. Is there no way to do that without taking a SEO arrow in the kneecap?"}, {"author_name": "none", "gravatar_hash": "10301b6809a16bed37d69a1e52cb57bc", "author_url": null, "date": "Jun 26, 2012", "message": "\"the spaceship\"\n\nI didn't see that at all. To me it looks like an Indian palace."}, {"author_name": "phwd", "gravatar_hash": "16c99e5eefab93030d7c3c56b7c5aad9", "author_url": null, "date": "Jun 26, 2012", "message": "@Shog9 The process of site naming/ identity is a huge distraction when you blow it up to be a huge distraction. And now, this should be *past* tense for gaming. They have individual branding now so the distraction for getting one can no longer be there right? \n\nThe only ones saying it was a huge distraction are those from SE Inc. but right before webapps and cooking went for the name change and launch everyone thought it was the right idea.\n\nCalling it a conspiracy/paranoid if you wish but I was there on that timeline\n\n* Webapps and cooking goes on naming process and branding (What should our .com domain name be? [deleted by SE staff]) as recommended by SE Inc.  \n* Webapps chooses name from none other than Joel Spolsky himself as the best name for the site  \n* Site gets posted to HackerNews, the king of couch-critics   (http://news.ycombinator.com/item?id=1744583) and gets tons of negative criticism\n* Name gets removed immediately after, I think (80% sure) it may have been the same day.\n\nSure, there could have been other factors that affected it, though I'm not convinced.\n\nWithin the same quote you took you are referring to the elevator pitch, tag-lines and mottos (again, recommended by SE Inc.) for an SE site right?\n\nShow me at least 10 SE sites that have a good one and I'm sold.\n\nThe name isn't about significant differences, it's about identity something that the trilogy and now gaming.stackexchange.com can hold on to and feel as a community on their own. It's the reason why apple.stackexchange call themselves \"Ask Different\" no?\n\nThe real gain is a sub SE site can hold on to identity rather than just be another face in SE crowd. If that's not true then maybe Stack Overflow should regress to coding.stackexchange.com and be part of the family?\n\nStack Exchange overall is a great Q&amp;A but it is the individual sites that attract users. We are way too segregated as a community to think of all of us an one.\n\nIn my opinion the real waste was when everyone got hyped to be a brand, made logos, names and everything, felt all special then got slapped in the face. That was indeed a waste of time and effort.\n\nIt's clear, to me, that SE Inc. aim here is marketing the overall brand of the Stack Exchange Network so I just wish this silly identity topic stops coming up, if that's how it is going to be."}, {"author_name": "Julian", "gravatar_hash": "4208f6b083ebfd8f604e50860ad3c1be", "author_url": null, "date": "Jun 26, 2012", "message": "What have you done against domain squatters during the domain brainstorming?"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jun 26, 2012", "message": "@phwd: I was there too - there's a reason I linked to both the Cooking and Web Apps meta discussions... See my last comment on the Seasoned Advice thread:\n\n<blockquote>SOIC is young enough to be stuck in the \"soap company making margarine\" role, but this too shall pass: if/when you succeed, you'll eventually find brands that don't expose the quirky name you picked for your back-end software...</blockquote>\n\nMost SE sites - even graduated sites - are still in the situation where the name \"Stack Exchange\" stands a better chance of being widely known than anything else. All the drama wrought by these naming discussions is for naught when the only meaningful part of the brand is \"SE\". I'm not at all sure where the line is where having distinct branding starts to help more than it hurts, but I don't doubt for a minute that it <i>exists</i> - and that's why we have folks like Lauren working on this stuff. \n\nI <i>do</i> know that, outside of a tiny handful of exceptional \"<a href=\"http://meta.stackoverflow.com/questions/103470/a-plea-for-actual-domain-identities/103686#103686\" rel=\"nofollow\">Act of God</a>\" situations, it isn't worth spending the time and effort - much less encouraging the heated, often bitter schisms over naming that arise within a community - to try and hash this stuff out early. Stack Overflow didn't work out because it had a great <i>name</i>, it works because it has great <b>people</b>: Jeff & Joel could've named it \"Programmers\" and it would've still worked. \n\n\"A rose by any other name\" ...right?"}, {"author_name": "Lauren Gundrum", "gravatar_hash": "5114f4806122259270d5da20a3039960", "author_url": null, "date": "Jun 26, 2012", "message": "@Julian the chat room for suggesting names was only announced on the Arqade meta, so there was very little danger that anyone outside the community would see it. We figured that anyone who cared enough to read the meta post wouldn't squat on our suggestions :-)"}, {"author_name": "Emerson Hsieh", "gravatar_hash": "09b54a96c8bb506d56476dddd3473db2", "author_url": "http://aboutme.geogamez.com", "date": "Jun 26, 2012", "message": "I thought Arqade and Gaming.SE were Different Sites before!"}, {"author_name": "Graham Borland", "gravatar_hash": "a6f82bd8116b0260515a2b67bb560937", "author_url": null, "date": "Jun 27, 2012", "message": "The logo is unreadable. It looks like ROAD - the A and E are hidden because they are too small and fade into the blue background."}, {"author_name": "Pierre-Alain Vigeant", "gravatar_hash": "3c4e7c07a17da199c1ebcec55d3dcc35", "author_url": null, "date": "Jun 27, 2012", "message": "I find the name ok, but not the logo. Like @None said, it look like some indian palace. Plus, the change in direction of the text make it hard to read."}, {"author_name": "SoboLAN", "gravatar_hash": "8feac14b86e6408e19694122993e7935", "author_url": null, "date": "Jun 27, 2012", "message": "Any prize for the guy who came up with the name ?"}, {"author_name": "Nicholas Paldino [.NET/C# MVP]", "gravatar_hash": "1b2b5d5007262ea3f9e21ab5b15f8b75", "author_url": "http://www.caspershouse.com", "date": "Jun 27, 2012", "message": "Has anyone considered that this is a potential copyright infringement on Namco's Galaga?  The similarity is overwhelming."}, {"author_name": "Ben Voigt", "gravatar_hash": "dde3a5048e456c451b7c518857e1818c", "author_url": null, "date": "Jun 27, 2012", "message": "Nicholas, be more worried about trademark law (which covers similar logos) than copyright infringement (which this definitely is not)."}, {"author_name": "MIKE", "gravatar_hash": "4006d89f4992c1a08583b3829545f91a", "author_url": null, "date": "Jun 27, 2012", "message": "Simple:  DiscussGaming.com"}, {"author_name": "LR", "gravatar_hash": "e9739ec5574d9977b522d1c80fb8de84", "author_url": null, "date": "Jun 28, 2012", "message": "just be prepared to answer questions about possible affiliations to Al-Qaida, lol, JK, congrats to Gaming.SE."}, {"author_name": "Jeremy", "gravatar_hash": "e0f502a6b3a7c216b85ed88d3d0b2799", "author_url": "http://AppointmentsBook.com", "date": "Jun 28, 2012", "message": "Its good, we all agree. Ben Voigt, its a good comment regarding Intellectual Property, but this logo will get around all other registered designs. Its been picked by democracy."}, {"author_name": "Jeremy", "gravatar_hash": "e0f502a6b3a7c216b85ed88d3d0b2799", "author_url": "http://AppointmentsBook.com", "date": "Jun 28, 2012", "message": "essentially &gt; 10% change in design allowed. That Namco’s Galaga ship is not nearly close the arqade design. It's so generic that it brings back a bit of [Nostalgia](http://en.wikipedia.org/wiki/Nostalgia) - even as a kid Atari games resembled this, but not in a QA form."}, {"author_name": "Otiel", "gravatar_hash": "b02ae8665350ed1173bd882d06c1dd4e", "author_url": null, "date": "Jun 28, 2012", "message": "Nice one NiQAlas T! I find the \"arqade\" name perfect."}, {"author_name": "CodesInChaos", "gravatar_hash": "de77f20e754d01f28466b3bfe992da40", "author_url": null, "date": "Jun 28, 2012", "message": "What use is the rebranding if you don't use the new brand as the domain? It's still using `gaming.stackexchange.com`."}, {"author_name": "RIck", "gravatar_hash": "5b8a386f9e9884aa4ccb3560cd5259ef", "author_url": null, "date": "Jun 28, 2012", "message": "@none\n\nLol how do you see an indian palace? It's definitely an oldskool galaga style space ship..."}, {"author_name": "Tim", "gravatar_hash": "736dd04fad2e768c1670e11a9621bcd8", "author_url": null, "date": "Jun 29, 2012", "message": "@none @RIck\n\nI saw the same funnily enough, few tweaks needed before it's an obvious spaceship imo.\n\nShould've been Pacman eating the lettering of  (&lt;   a r q a d e   ! ;D"}, {"author_name": "Guy Manningham", "gravatar_hash": "da4a23d92967bb8b3a531dbc32877421", "author_url": "http://guymanningham.com", "date": "Jul 02, 2012", "message": "Digging the Arqade logo and brand identity package. The spaceship design and font reminds me of the old Atari games I kicked my brother's butt in as a kid."}, {"author_name": "p-kay", "gravatar_hash": "ae1ba0c91743075fb9692e692fd0a043", "author_url": null, "date": "Jul 15, 2012", "message": "The arqade name is brilliant. And the logo is on the right track. But it needs some work. Like some above I think the A and E need to pop out more. At a glance the logo looks too much like ROAD or RDAD."}, {"author_name": "Andy K", "gravatar_hash": "bccd497273c9ec6a15528e2cce293f18", "author_url": null, "date": "Jul 17, 2012", "message": "I love the logo - not only does it resemble a spaceship - but it also is reminiscent of an old school fun house.\n\nhttp://www.riverviewparkchicago.com/generic7.html"}, {"author_name": "jogar gratis", "gravatar_hash": "c879597c478d905b8f1f2255605a18fb", "author_url": "http://www.minijogo.net", "date": "Sep 28, 2012", "message": "yes a better .com will be easier to remember"}]}