{"response": [{"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://about.me/cky", "date": "Mar 31, 2011", "message": "Very important (for security geeks like me anyway): Organisers of large meetups should ask interested parties to bring passports, drivers' licences, and key fingerprints.\n\nThat's right. Key signing party!"}, {"author_name": "Shy", "gravatar_hash": "749b73007119baf94fc077c50bcc58e8", "author_url": null, "date": "Apr 01, 2011", "message": "Here's another tip - Before you ask us to spread the word, make sure you did your part.\nPut a link to this meetup thing in the main stackoverflow site. \nThe number of people who read this blog is a small fraction of the number that visits the main site.\nWith just 4 people in my local meetup, I'm probably not going to come."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 01, 2011", "message": "Shy, we run house ads for the meetups -- both leaderboard and sidebar banners.\n\nHere's a screenshot I just took of the Stack Overflow homepage in my browser.\n\nhttp://img22.imageshack.us/img22/5531/meetuphouseads.png"}, {"author_name": "Piskvor", "gravatar_hash": "3fc34e753d1f98a60b12db03bceaf7fe", "author_url": null, "date": "Apr 01, 2011", "message": "That count looks rather inflated IMNSHO: when I input my location, I get several \"meetups\" that \"will happen in a week\"; all of them have 0 users and the usual \"you can organize a meetup here\". I'm not sure if those are autogenerated or what, but if they're counted in the total, then it's waaaay off.\n\n(as for the banner, never noticed it - but it is indeed there, now that I went looking for it. Ah well, banner blindness strikes again.)"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Apr 01, 2011", "message": "Said this before no one pays attention to the banners, its like an advertisement that goes unnoticed.  Don't bother me with that!  Use your jquery skills and throw up the drop down reminder you do when the site auto logs me in...time it to expire after april 6th.  Should of done that a month ago...Only 4 people in all of michigan with no location decided, whose gonna go to that?"}, {"author_name": "James Mortensen", "gravatar_hash": "d4518e6223a1a82f53dc4919d0165151", "author_url": "http://blog.opensourceopportunities.com", "date": "Apr 01, 2011", "message": "Portland is suffering from the same challenges.  5 people listed, and only two have commented.  Chennai, on the other hand, has about 24 people.  \n\nIf only distance wasn't a factor and we could bend space and all meetup in the same location."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 04, 2011", "message": "We took your advice, and did decide to run a site banner from 9 am to 5 pm Pacific for one day -- today, Monday April 4 2011:\n\nhttp://img715.imageshack.us/img715/5198/sitebanner.png\n\nIt points directly to http://meetup.com/stackoverflow\n\nHope that helps!"}, {"author_name": "John Fiala", "gravatar_hash": "0ea7bb11e90d00eee00f6c8863f9f654", "author_url": "http://www.jcfiala.net/", "date": "Apr 05, 2011", "message": "Just wanted to slide in and note that the Denver folks are informally moving their meetup to the 7th, because most of us can't make a meetup on the 6th.  Same place and time, just one day later."}, {"author_name": "Gratis internet", "gravatar_hash": "fbbaefb643694a33aeb31e9a5e5f7ad4", "author_url": "http://www.gratisinternet.org", "date": "Apr 11, 2012", "message": "Keep up the great work... <a href=\"http://www.gratisinternet.org\" rel=\"nofollow\">gratisinternet</a>"}]}