{"response": [{"author_name": "Jonathan Sampson", "gravatar_hash": "a84a8714fd33f6676743f9734a824feb", "author_url": null, "date": "Mar 01, 2011", "message": "Noticed this today and loved it immediately. A whole new set of users get to share in the glorious light of the front page now, and I am sure every new member slaving over their keyboards to answer questions will greatly appreciate that. As always team, nice job!"}, {"author_name": "Ned Batchelder", "gravatar_hash": "75e9a11371cbe1566607180863efdf4c", "author_url": "http://nedbatchelder.com", "date": "Mar 01, 2011", "message": "I like the new page, much more interesting.\n\nIf I could make a small suggestion?  Having the location and the tags in the same type style runs them together visually.  At first I thought it was all tags, broken awkwardly over two lines.  Do something to make them visually distinct, either make the location black vs. the tags' gray, or perhaps better, style the tags here as you do everywhere else on the site.  I understand that might be too cluttered for such a small dense display of tags.  Maybe a button-like tag, but toned down compared to the main tag displays?"}, {"author_name": "Oscar Mederos", "gravatar_hash": "30f7d0e60442d70d7e22667520442395", "author_url": null, "date": "Mar 01, 2011", "message": "I agree with @Ned. The same happened to me."}, {"author_name": "Kabindra Bakey", "gravatar_hash": "13e3d4bfeb85f623f33b30392bfd7337", "author_url": "http://www.outsourcingnepal.com", "date": "Mar 01, 2011", "message": "hm... just noticed today..."}, {"author_name": "Dan", "gravatar_hash": "dead5c6457591268b4bd4c6199fa16b6", "author_url": "http://rdocumentaries.com", "date": "Mar 02, 2011", "message": "1. I find the Users page too crowded, I think you should drop showing the location and just leave the tags. Especially on sites like Math.SE, having both location and tags makes things look pretty messy.  http://math.stackexchange.com/users\n\n2. This also might be a personal preference, but the Week default view is way too dynamic for me, so I'll probably not check it that often. Having the Year or Month view by default would make more sense IMO."}, {"author_name": "David Heffernan", "gravatar_hash": "3c0aac2191718ef0309dbc034d9b9961", "author_url": null, "date": "Mar 02, 2011", "message": "This is great, it's just a week late!"}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": null, "date": "Mar 02, 2011", "message": "You should enable searching top users by tag.\nSearching [c#] should return the top users in c# tag for this period."}, {"author_name": "tim", "gravatar_hash": "94a0e83767dbc71db135454693540015", "author_url": null, "date": "Mar 02, 2011", "message": "The redesigned page is awful.  Please change it back.  I can't see the badges for other users.  \n\nDid you guys even test this before rolling it out?\n\nIf perhaps you needed it for SO then fine, but for all the other SE sites?  There was no need for the weekly/monthly/yearly stats to be THE user page - those could always be accessed.  I think it is a mistake.  Please put back the old one.\n\nI guess you want to allow \"new\" users the ability to shine and show off how many hitpoints they got recently - but what happened to the badges?"}, {"author_name": "Humpton", "gravatar_hash": "1a756b1b9d7ba58b42172fb54abc6496", "author_url": null, "date": "Mar 02, 2011", "message": "Kinda funny, right now (Wed March 2) people have more rep in a week than in a month..."}, {"author_name": "Ward", "gravatar_hash": "f347c53c9cb1ddcb816daeb22aaf89c8", "author_url": null, "date": "Mar 02, 2011", "message": "I don't see any advantage to the new layout, and a few disadvantages:\n\n- you have to scroll to see all the people on a page\n- badges aren't shown\n- ranked by rep is a better default view\n\nI guess I don't understand why a list of users should be \"fun.\"  I use it to see who's near me in rep and sometimes to look up someone by their username.  I don't care what tags they're interested in."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Mar 02, 2011", "message": "I don't think there is any chance to go back to the prior version but I also don't see the \"fun\" in a users page.  There's a scroll bar I now need to deal with.  Badges aren't displayed.  I think the issue is people are starting to get more interested in the points / rewards that come with badges rather then the content of their post.\nWe need one link at the top of Stackoverflow called \"The Store\".  At \"The Store\" you could exchange your reputation points for gifts like T-Shirts, Lava Lamps, and if you had a high rep for laptops."}, {"author_name": "Ken", "gravatar_hash": "dcd1fedb721be7dbfc73847c483dc1c7", "author_url": "https://twitter.com/qntmfred", "date": "Mar 02, 2011", "message": "I don't understand the complaints about scrolling. You have to scroll on every other SO page."}, {"author_name": "Martha F.", "gravatar_hash": "8d872a4f767bf4d2bd883b443d193979", "author_url": null, "date": "Mar 02, 2011", "message": "I figured it out from context, but it would be nice if the month and year buttons identified that they were by the calendar, rather than a rolling 30/365 day period. Otherwise, it's definitely a nice change"}, {"author_name": "Orbit", "gravatar_hash": "353a645692c3e88ebab8f47703808c90", "author_url": null, "date": "Mar 02, 2011", "message": "I love it... for the first and probably only time in my life I am in a top 10 with Jon Skeet *swoon* and other heroes of SO. Today is only the second of the month. ;)"}, {"author_name": "wheaties", "gravatar_hash": "e61aa9f3d632781569b0115b9f3154fd", "author_url": "http://staticallytyped.wordpress.com", "date": "Mar 03, 2011", "message": "At first I liked the new users page but then I remembered reading all the top answers from some of the top people.  I learned more than you can remember just from skimming the top answers of the top guys.  That was beneficial to me and I'm sure others have done the same.\n\nI don't care to see the change rolled back but I do wish we could chose a sorting scheme instead of this \"dynamic\" approach.  You could make it the default.  I guess what I'm saying is give us the most flexibility to search for answers from people in a manner of our choosing."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 06, 2011", "message": "@wheaties per the text in the post\n\n\"All Time is the same as the old default users page view.\""}]}