{"response": [{"author_name": "Gideon", "gravatar_hash": "5aefd3e85213e1c22ee31e4ce6123d40", "author_url": null, "date": "Mar 23, 2011", "message": "Hey, \n\nInterestingly I suggested a tag wiki for WCF-Data-Services with an excerpt copied from MSDN and some useful links in the body.\n\nAlso, suggested wikies for ado.net-data-services and astoria (with details about the MS names changes)\n\nI got a +2 that says tag-wiki, but the stuff I wrote isn't in the tag (any of them?)\n\nI have 2.1K rep on SO btw."}, {"author_name": "Martin Tapankov", "gravatar_hash": "be3b138352dc100c9459e612b275b413", "author_url": null, "date": "Mar 23, 2011", "message": "At TeX-SE we also found useful to provide guidance what the tag is **not** about, and suggestions which related tags might be a better choice instead. This is primarily because the terminology is not clear cut (a billion dollar test question: What is the difference between [graphics], [figures], [images] and [floats]?). We found this improved proper tagging rates, even for seasoned users.\n\nThis is probably unnecessary for some sites (SO, for example), where concepts have universally agreed upon terms."}, {"author_name": "Gideon", "gravatar_hash": "5aefd3e85213e1c22ee31e4ce6123d40", "author_url": null, "date": "Mar 24, 2011", "message": "Sorry if I shoulda posted that on meta. Wasn't too big a deal and just popped into my mind when I read this."}, {"author_name": "James Gifford", "gravatar_hash": "de85c185f39ef9feef79d9933409d400", "author_url": "http://jamesrgifford.com", "date": "Mar 24, 2011", "message": "Funny you just posted this... I've been going on a Tag Wiki editing spree over on AskUbuntu SE. The advice on tag wiki excerpts is going to help people a lot, myself included."}, {"author_name": "Joshua Carmody", "gravatar_hash": "2a132ec297346e7faf45127323ec63a7", "author_url": "http://www.joshuacarmody.com", "date": "Mar 24, 2011", "message": "Just a suggestion - when writing articles discussing a redesign of a certain page, could you please include a link to the page you're discussing? I'm sure I could go to stackoverflow.com and click around until I find it, but it would seem natural to have a link in your article that goes right to it."}, {"author_name": "asf", "gravatar_hash": "94693d00c0cd4fc6f8c514121f7b3da9", "author_url": null, "date": "Mar 24, 2011", "message": "Would it be possible to add a setting to disable tag popups (Or increase the delay in the tag cloud on)? They really get in the way when I want to middle click several tags in my tag cloud"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Mar 24, 2011", "message": "> Just a suggestion – when writing articles discussing a redesign of a certain page, could you please include a link to the page you’re discussing?\n\nThe trick here is that I actually want people to visit the /tags page on their specific site. Linking directly to Stack Overflow is no good because a) SO, by dint of its size, has extraordinarily good tag excerpt wikis and b) I want to focus on SE 2.0 sites, not SO."}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Mar 24, 2011", "message": "Great improvement over the old `/tags` pages.  This change should inspire even better excerpts and wikis.\n  \nI notice on other sites, like programmers.stackexchange.com that there are tags which would be difficult to write an excerpt and wiki for such as: job, design, career-development, work-environment.  \nYet they are still useful tags.   \n\nIs the plan to never fill in these tags? Or would it be better to fill with text which isn't very valuable?"}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Mar 24, 2011", "message": "I guess it would probably fall into category #2 above for my example tags for programmers.stackexchange.com"}, {"author_name": "Matthew Miller", "gravatar_hash": "117c0d7cacdbd76827401b822b3037cb", "author_url": "http://mattdm.org/", "date": "Mar 25, 2011", "message": "I'm having trouble with the logic that cuts off the beginning of the exerpt through the first \"is\" or \"are\". Often I want to right something like \"Otherthing is key to thistag, so...\", and that just comes out \"key to thistag, so...\" — forcing an arbitrary rewording. How about cutting only if the beginning is _actually_ the tag name duplicated? Otherwise, trust the tag writers and editors to make it concise."}, {"author_name": "Samuel Bronson", "gravatar_hash": "165e55c78689e561c554c3dec671fb50", "author_url": null, "date": "Jan 31, 2012", "message": "&gt; The trick here is that I actually want people to visit the /tags page on their specific site. \n\nIn that case, it would have been handy to include that URL fragment, preferably in a monospaced or bold font, near the first reference to the page. Something like this:\n\n&gt; the tags page (<code>/tags</code> on any of the SE sites)"}]}