{"response": [{"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "May 13, 2008", "message": "Hi Jeff,\n\nAny chance you could modify the feed so that it supports the Zune and the Zune software for podcasts. Scotts feed seems to support the Zune as a reference: http://feeds.feedburner.com/HanselminutesCompleteMP3?format=xml\n\nI think it has to do with the fact that Scott is using the [media:content] tag instead of [embed] tag to set the destination of the MP3. I think [media:content] is more widely recognized, or it could just be the case of Microsoft half programming their Podcast downloader either way both iTunes and Zune support it. I would love it if you also supported it so I can take you guys on the go.\n\nThanks,\nNick"}, {"author_name": "DanaL", "gravatar_hash": "e901a2d717ddedce52fd6a1e010f2c86", "author_url": null, "date": "May 13, 2008", "message": "Will you be having some type of beta sign-up or will it be invites to a select number of people you \"know\"?\n\n(I'm hoping the former is the case)\n\nI thought the PennyArcade comic was good, my friend has an iPhone and he admits to browsing digg on the john.\n\n-Dana"}, {"author_name": "Jeff Atwood", "gravatar_hash": "e9da1ed3cdab00371ed1c2ff4520907c", "author_url": "http://www.stackoverflow.com/", "date": "May 13, 2008", "message": "Hi Nick,\n\nI'm not sure -- I use the PodPress add-in for WordPress. It looks like both feeds use the [enclosure] tag to mark the MP3; I'm not sure why the Zune software can't deal with it. Unfortunately I don't have an iPod or a Zune to test this with."}, {"author_name": "Jeff Atwood", "gravatar_hash": "e9da1ed3cdab00371ed1c2ff4520907c", "author_url": "http://www.stackoverflow.com/", "date": "May 13, 2008", "message": "Oh, and I forgot to link the SICP in Mr. Dorfman's comment:\n\nhttp://mitpress.mit.edu/sicp/"}, {"author_name": "puri", "gravatar_hash": "63b69d1a8bc373113e53f2f51e924cfe", "author_url": null, "date": "May 14, 2008", "message": "In case that you want to make sure how prof Knuth's name is pronounced, read his own FAQ:\nhttp://www-cs-faculty.stanford.edu/~knuth/faq.html"}, {"author_name": "Jeff Atwood", "gravatar_hash": "e9da1ed3cdab00371ed1c2ff4520907c", "author_url": "http://www.stackoverflow.com/", "date": "May 14, 2008", "message": "Nick -- I checked on Twitter (see, Twitter *is* useful!) and several folks are subscribing to the stackoverflow podcast RSS feed just fine from their Zune software. Make sure you're running the latest version, and so forth."}, {"author_name": "Jeff Atwood", "gravatar_hash": "e9da1ed3cdab00371ed1c2ff4520907c", "author_url": "http://www.stackoverflow.com/", "date": "May 14, 2008", "message": "Joel's reference to dropping computers to reseat the chips is from the Apple III:\n\nhttp://www.vectronicsappleworld.com/appleii/appleiii.html\n\n\"Apple's solution was to recommend lifting the front of the computer six inches off the desktop, then letting it drop with the hope that the chips would reseat themselves. The problems with loose chips were exacerbated by short cables between internal components, non-gold connectors, and the circuit board manufacturer's change in the flux washing process that lead to latent corrosion\""}, {"author_name": "TN", "gravatar_hash": "200d035ac17bdf04856b7dde5a1d1fbb", "author_url": "http://www.nybergh.net", "date": "May 14, 2008", "message": "Downloading the podcast is a bit slow, I don't get speeds above 45k (I'm in Helsinki on a DSL line with 4 megs download speed)."}, {"author_name": "CIC", "gravatar_hash": "79407e9a86d7450c4fcb16046df23f6f", "author_url": null, "date": "May 14, 2008", "message": "So which shark do I need to jump to participate in the beta? \n\nLoyal listener, that's THREE podcast listeners :)"}, {"author_name": "Daniel", "gravatar_hash": "1dae27f311fdbbb084d4b94fc45ce110", "author_url": null, "date": "May 14, 2008", "message": "@TN:\n\nI believe Jeff has mentioned before that the podcast starts out at a burst of ~400kB/s, but then throttles down to ~50kB/s so his server isn't pasted by the bandwidth outlay."}, {"author_name": "Stephen Hill", "gravatar_hash": "05e9ba4193d823a238da43fb1b5f18e0", "author_url": "http://stephenandlouise.co.uk", "date": "May 14, 2008", "message": "Another very good podcast guys and it must be said that the format and structure has improved and makes following the podcast much easier :)\n\nI have a few questions which if you really really really want me to, I can record and send them in to you, if no one else does. Email me if you want me to record the following questions:\n\n1) I was wondering how you are handling version control, if at all. Source Safe 2005? SVN?\n\n2) What was the background to the Jewish joke?\n\n3) I know you were struggling to come up with services on the web which are a luxury but I would like to name what I would consider a luxury: Flickr Pro Account, Deviantart Account, Forum/Club Memberships. None of which I need but all of which I want.\n\n4) I'm glad to see developers working in a Microsoft environment using Firefox. How much testing do you do in what Yahoo call A-Grade browsers.\n\nAfter listening to the podcast and rambling on in this comment box, I think I'll try this weekend to send you guys a podcast question of the above, and maybe more.\n\nStay Tuned!"}, {"author_name": "Darrel", "gravatar_hash": "322188b508f34b38ffede8856721295d", "author_url": null, "date": "May 14, 2008", "message": "How's this for a luxury site.\nSmugMug for photo sharing rather than flickr or picassa.\n\nBut even those two sites have what might be considered \"luxury\" or pro options for an additional fee.\n\nBtw, I would be happy to help test your site when it's ready."}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "May 14, 2008", "message": "Jeff,\n\nI just upgraded to Zune 2.5 and it seems to have fixed the issue.  I guess it is a non-issue as long as people upgrade to the latest version.\n\nThanks for the great pod casts.\nNick"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": null, "date": "May 14, 2008", "message": "Concerning Adblock:  You might want to try the FlashBlock add-on for Firefox too.  It's great for hiding annoying animations unless you actually want to see them.  It just creates a blank div with a flash icon in it.  If you want to see the flash you click on the icon.  And if a site is all Flash, you can right-click on the blank div and whitelist that site.\n\nhttps://addons.mozilla.org/en-US/firefox/addon/433"}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "May 14, 2008", "message": "To answer Joel, Microsoft does have a web.config editor.  It is called IIS 7.0.  :)"}, {"author_name": "Ben", "gravatar_hash": "8fb95bde97cca5563771aafb7eeeab01", "author_url": null, "date": "May 14, 2008", "message": "Love the podcast and I listen joyfully every week!  I think it is fascinating just hearing two software developers chat about \"whatever\".  Keep it up!!\n\nCan't wait to see stackoverflow come to light!  \n\n-Loyal listener #4"}, {"author_name": "Michael", "gravatar_hash": "a83ecb74b1e755f9d34cd6599a8e6e18", "author_url": "http://www.Stum.de", "date": "May 14, 2008", "message": "If you need a Sharepoint 2007 Developer in the Beta as well, I happily volunteer :-)"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": null, "date": "May 14, 2008", "message": "I noticed the links to comments on this site are broken, i.e. http://blog.stackoverflow.com/index.php/2008/05/podcast-5/#comment-331\n\nLooks like the anchor is not actually created in the HTML."}, {"author_name": "clz", "gravatar_hash": "79c4f17069bc1ee75623a6c0216e5cec", "author_url": "http://www.lengelzigich.com", "date": "May 14, 2008", "message": "Downloading now... would love to see this on iTunes so I won't have to remember to check back all the time."}, {"author_name": "anon", "gravatar_hash": "fc978acbd9c41f824121c25c38ec425f", "author_url": null, "date": "May 14, 2008", "message": "You can block the Google text ads with Customize Google: http://www.customizegoogle.com/"}, {"author_name": "Jeff Atwood", "gravatar_hash": "e9da1ed3cdab00371ed1c2ff4520907c", "author_url": "http://www.stackoverflow.com/", "date": "May 14, 2008", "message": "clz, the podcast is listed in iTunes for sure -- try searching for \"stackoverflow\"."}, {"author_name": "iwillregretmycomment", "gravatar_hash": "2d0e9a7c2b89538321346603ede9f1b3", "author_url": null, "date": "May 14, 2008", "message": "You want to create a place where programmers could ask questions and provide answers. Google've created a place where you could provide answers http://code.google.com/doctype/ (though topics are restricted to web stuff)\n\nWiden the topics, add ability to ask questions and you'll get stackoverflow.com\n\nReputation (ranking) system is an open issue."}, {"author_name": "mike", "gravatar_hash": "d53534df62555444fbae96b767b41b91", "author_url": "http://pixor.net/", "date": "May 14, 2008", "message": "Another luxury product: Surfline premium account.  Unlimited access to the live video feeds and better forecast information."}, {"author_name": "Kyle", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "May 14, 2008", "message": "The company that keeps track of your program usage is RescueTime:\n\nhttp://www.rescuetime.com/\n\nThe article with the aggregate data is found at TechCrunch:\n\nhttp://www.techcrunch.com/2008/05/08/early-adopters-still-spend-more-time-with-microsoft-than-with-google-facebook-or-skype-but-for-how-long/"}, {"author_name": "KJ", "gravatar_hash": "29d3a8f1d272bb788883c2c2c9c60b78", "author_url": null, "date": "May 15, 2008", "message": "Another company that keeps track of program usage is the Dutch! company Wakoopa.\n\nhttp://wakoopa.com\n\nWakoopa reports that Firefox is the most used software. Outlook is currently in 10th position.\n\nhttp://wakoopa.com/software"}, {"author_name": "Dominik", "gravatar_hash": "cdb0d9080ea5654378484948d717c7c1", "author_url": "http://blogs.interdose.com/dominik/", "date": "May 15, 2008", "message": "Ummm, okay, might not be so relevant, but I just stumbled over a video related to sharks and stuff: http://www.youtube.com/watch?v=VJnxYsZNzwM\n\nEnjoy :)"}, {"author_name": "shawn", "gravatar_hash": "f878a55e08bacee0af48852c29a02dc7", "author_url": null, "date": "May 15, 2008", "message": "so we all now know that joel visits jewish singles dating websites"}, {"author_name": "Sam", "gravatar_hash": "8e75d14147f110a9881ec15997ae2f04", "author_url": null, "date": "May 15, 2008", "message": "Great stuff guys.  However it leaves me wondering if the idea is just too close to Experts Exchange, which although you can buy subscriptions/etc, still fundamentally works on a 'points trading' system; post a question with some of your points, decide on the best answers and distribute points to their contributors.  How is stack overflow going to be different to EE?  (I'm not endorsing them as I haven't use it in ages and may be a little out of date with their model).  Cheers and good luck, I watch (listen) with anticipation."}, {"author_name": "Ashwin", "gravatar_hash": "e656e8a79ae5a416f0c3d4de38d302b1", "author_url": null, "date": "May 15, 2008", "message": "Thanks for pointing to the David talk video. That is the sanest piece of startup advice I've heard in a while!"}, {"author_name": "Greg", "gravatar_hash": "6ffe033e9c6b63e357c80c3133c847fc", "author_url": null, "date": "May 15, 2008", "message": "I'm hoping that it is not like Experts Exchange. It frustrates the hell out of me that I get a \"if you want to see the answer, subscribe now\", when I am just browsing for answers. I have no idea - until I pay money - how relevent the answer is going to be. SO I move on, thinking that the answer is bound to be somewhere else that doesn't want my credit card.\n\nLove the podcasts - listen to them on the drive to/from work. But Joel - let Jeff talk some more! :)  I think you're great, and certainly very personable when I met you in Cambridge last year, but sometimes I would like to hear more of Jeff."}, {"author_name": "Ed", "gravatar_hash": "01e9568182da0c71804cf1aa521e358b", "author_url": null, "date": "May 15, 2008", "message": "I was one of the listeners you lost after the first couple of podcasts.  The RSS feed I subscribed to just never got updated.  It was only because I came back to the website and re-subscribed that I found podcasts #3-5."}, {"author_name": "clz", "gravatar_hash": "79c4f17069bc1ee75623a6c0216e5cec", "author_url": "http://www.lengelzigich.com", "date": "May 15, 2008", "message": "Jeff: Thanks! To be honest I didn't even look, I figured I'd see something about iTunes or an feed link somewhere here."}, {"author_name": "Michael", "gravatar_hash": "a83ecb74b1e755f9d34cd6599a8e6e18", "author_url": "http://www.Stum.de", "date": "May 15, 2008", "message": "Jeff has pointed out the difference between SO and EE/Similar Sites. SO essentially is some sort of \"Wiki\", i.e. it allows to edit the content later.\n\nIf you look at EE, you often find the answer to a solution, except that the thing is from 2005 and explains how it is done in ASP.net 1.1. Nothing wrong with that, except that you get a lot of \"deprecated\" warnings and that it's often 50+% more code than ASP.net 2.0.\n\nSo with SO, you could edit the Thread to make it relevant in the year 2008 again.\nAs you might guess, there are a lot of open questions that this approach leaves (Jeff is working on them and regularly explaining them in the Podcast), but for a high high level overview, this is essentially what SO is."}, {"author_name": "Nick", "gravatar_hash": "63e9c00d834cf45871a1326daaeecccd", "author_url": "http://pc1oad1etter.blogspot.com", "date": "May 15, 2008", "message": "Let me push back a little on the idea that all of the answers should avoid stale information -- I'm still using .net framework 1.1, and it's very frustrating when I only find answers to questions about newer frameworks.\n\nThat's all - don't replace all old answers with new answers."}, {"author_name": "Michael", "gravatar_hash": "f4f4b5a6f27f72b32d42463b1a25e0df", "author_url": "http://www.wassupy.com", "date": "May 16, 2008", "message": "Make sure your laptop if OFF before you drop it. You don't want that hard drive's platters banging around while spinning or any other electrical connections working intermittently with live current."}, {"author_name": "Greg", "gravatar_hash": "6ffe033e9c6b63e357c80c3133c847fc", "author_url": null, "date": "May 16, 2008", "message": "I liked the laptop story. But what about the chips mounted on the underside of the PCB? :)"}, {"author_name": "Luke", "gravatar_hash": "d3b16c0d3aeedfa07263452f25c4e650", "author_url": null, "date": "May 16, 2008", "message": "For some reason the embedded flash player in Google Reader plays all your podcasts at chipmunk speed.  Seems to work fine on other podcasts I subscribe to so it may be an encoding issue."}, {"author_name": "Mark", "gravatar_hash": "d56e6cdd462fdfa60fe522f1a55475dc", "author_url": null, "date": "May 16, 2008", "message": "Jeff,\n\nI just had to respond to your comment on \"everything being XML\" with a horror story from my work.  Let me say that the only thing worse than something being XML when it doesn't need to be, is something that CLAIMS to be XML but really isn't.\n\nThe products that I work on often have to import/export data to other company's systems.  Often times they are old systems and thus we have to deal with fixed-width text files, annoying but doable.\n\nHowever, we've now encountered two cases of \"fake\" (or if we're really upset we call it \"bastardized\") XML.  One was in a new file spec we received from one of these external companies where it was clear that someone there had HEARD of XML but had no idea what it REALLY was, because the file spec we received was basically a variable-width text file with   around everything.  No hierarchy, no header, nothing.\n\nAnother time, we were told that their system imported an XML file and we were happy.  We created XSD for our objects and serialized to an XML text file, but we got a call that their system couldn't read the file.  \"Why?\" we ask. \n\"Because of these extra lines at the top.\"\n\"That's the XML Schema definition, you can't read that?\"\nWell, further interrogation turned up that their system, although CLAIMING to read XML, actually just \"faked\" it and read the file like some sort of convoluted text file (go down 3 lines, and search for this element name string).\n\nSo, whenever you encounter XML that isn't necessary, be thankful (at least) that it is REAL XML."}, {"author_name": "Ray", "gravatar_hash": "7a8bb521b094e586f8cca22de1a618d0", "author_url": "http://torch.cs.dal.ca/~edwards", "date": "May 16, 2008", "message": "Luke, I think the problem may be the ultra low sample rate.\n\nFor my Sony MP3 player, I use an open source program to transfer songs (SonicStage can go to hell).  It just puts songs on the player willy-nilly, so I get no warnings if it's something the player won't handle properly.  Anyway, MP3s will play perfectly for me at a 44.1KHz sample rate.  If the sample rate is higher (say, a 48KHz MP3, which I downloaded recently), the audio plays like a slowed tape.  And when I put these podcasts on my player, Joel and Jeff are chipmunks, because the sample rate is like 2KHz.\n\nSo, now that I've given my life story, I say don't use the Google thing until they properly play non-CD sample rates.\n\nAlso, since I'm here, Jeff or Joel, how about recording the podcast at the same bitrate you use now, but at a 44.1KHz sample rate.  It only adds about 2MBs to the size, and it would save me the work before I listen. :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "e9da1ed3cdab00371ed1c2ff4520907c", "author_url": "http://www.stackoverflow.com/", "date": "May 17, 2008", "message": "> For some reason the embedded flash player in Google Reader plays all your podcasts at chipmunk speed. \n\nUpdate your Flash, and this problem will be solved:\n\nhttp://www.adobe.com/shockwave/download/download.cgi?P1_Prod_Version=ShockwaveFlash\n\nHere's how you can determine what version of Flash you have:\n\nhttp://www.macromedia.com/software/flash/about/"}, {"author_name": "Sean", "gravatar_hash": "52feaf8c1b6403c6b15142cf1c30ffd2", "author_url": null, "date": "May 18, 2008", "message": "The website http://www.compete.com does not have the problem that Alexa does."}, {"author_name": "Bob", "gravatar_hash": "0b99033319a7f46661aaf0324c47f335", "author_url": null, "date": "May 18, 2008", "message": "Re. Notepad and character encoding you might take at look at http://unicode.org/faq/utf_bom.html#22 since Notepad typically creates/respects those BOMs it supports.  Chinese characters?  I think somebody was trying to read the BOM as text."}, {"author_name": "Adam Lerman", "gravatar_hash": "bc684f759c8823c66db152d9a00c087f", "author_url": "http://adamlerman.blogspot.com", "date": "May 20, 2008", "message": "Jeff --\n\nany chance of getting into the private Beta?\n\nIt sounds like Stackoverflow could be real nice. Cant wait to see how you guys do!\n\nAdam"}, {"author_name": "Javier", "gravatar_hash": "21200aef2bc4284e63434abea7aed4fd", "author_url": null, "date": "May 23, 2008", "message": "Thanks guys for writing the complete trasncript! it's really helpful if English isn't your main language"}, {"author_name": "Peter", "gravatar_hash": "405e66ccc14d11a38444265f1c756fd3", "author_url": null, "date": "May 26, 2008", "message": "I only just got around to listening to this podcast. I see that there have been a couple of comments about application trackers. THe one that I immediately thought of is \"TimeSnapper\" (http://timesnapper.com/) which takes regular screenshots while running in the background. These can be played back to see what you were actually doing (rather than just what apps were running). Also good for things like going back to see exactly what was on the screen two hours ago."}, {"author_name": "nickL", "gravatar_hash": "744a84fb3ee798b707090ed4184ddfb4", "author_url": null, "date": "May 27, 2008", "message": "About washing electronics, Joel mentions doing this to anything as long as there is no power source. It's probably good to note that the capacitors probably need to be drained as well before washing.\n\nYou can discharge them by creating a connection between the two capacitor terminals to get a short circuit. Though, presumably water would do the same job. I imagine issues would come up if the water DIDN'T do what you'd expect, didn't short out the capacitor and then you have other components with possible charge. \n\nright? (not an EE, but this does make sense?)"}, {"author_name": "Frank", "gravatar_hash": "937d97bef5f39c3350d4d1c489b7a8c0", "author_url": null, "date": "May 27, 2008", "message": "fyi...email organizer is xobni, which is just inbox backwards."}, {"author_name": "Dennis", "gravatar_hash": "27e3a5b3568453883adb244aa071e5a1", "author_url": null, "date": "May 30, 2008", "message": "Re: XML for everything\n\nI recently wrote a utility for handling files on our windows network and one that handy about XML is that XML libraries (Perl in this case) handle all of the directory spaces, backslashes, and other \"fun\" characters people usually use on shared windows folders  (e.g., \\\\network\\this is my tree\\this is my folder).  You still need to escape '&amp;' but that's not so bad."}]}