{"response": [{"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "May 28, 2008", "message": "I was waiting for this all day.  It usually provides a good distraction in the morning when going through e-mails and browsing the news of the day.  I guess I will have to wait till tomorrow.  :)"}, {"author_name": "Kyle", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "May 28, 2008", "message": "I guess it's better late than never ;)"}, {"author_name": "OJ", "gravatar_hash": "f854d71fab62ee5b3893e3bebb88f592", "author_url": "http://rant.blackapache.net/", "date": "May 28, 2008", "message": "Hi guys, just letting you know the link to Winsplit is invalid. It looks like the new URL is http://www.winsplit-revolution.com/ in case you feel like updating the post.\n\nCheers."}, {"author_name": "Bryce", "gravatar_hash": "7b34613454725e366208ab4e44f82c07", "author_url": null, "date": "May 28, 2008", "message": "Regarding password management - I'd say clipperz.com - all the way. Before you freak out about \"how can I trust some random web host with all my data?\", here me (and them) out.\n\nTheir whole philosophy of \"zero-knowledge applications\" seems pretty solid to me. And it's downloadable as a single html file with all the js you need to use it offline as well."}, {"author_name": "Dustin", "gravatar_hash": "2da2ed2e96f10fcf1a1a12fe438a7b0c", "author_url": null, "date": "May 28, 2008", "message": "I use a laptop as my dev box at work using the dell docking station and a \"crappy\" usb video card to power 3 19\" LCDs. The USB video card works 75% of the time without freezing or locking up, but it works."}, {"author_name": "Dustin", "gravatar_hash": "2da2ed2e96f10fcf1a1a12fe438a7b0c", "author_url": null, "date": "May 28, 2008", "message": "Also for the login issues, i usually do the following:\n\nI have 2/3 same login names and emails with 2/3 passwords of different strengths.\n\nI have one set for high level security sites like Banking, bills, etc...\n\nI have another my regular sites like Facebook, Myspace, etc..\n\nI have a last one for sites I wanna try or just have to register to view something.\n\nI have 3 sets that I always know depending on the site i'm visiting."}, {"author_name": "Geoff Dalgas", "gravatar_hash": "b437f461b3fd27387c5d8ab47a293d35", "author_url": null, "date": "May 28, 2008", "message": "http://www.youtube.com/watch?v=P0c3BkhprZ0\n\nStill one of the best movies I've seen!"}, {"author_name": "Arend", "gravatar_hash": "9d730dbe2e46eb4913c4e5228a8053e6", "author_url": null, "date": "May 28, 2008", "message": "Passpack is great for passwords:\nhttp://www.passpack.com/\n\nAlso, use the same password and username for all sites."}, {"author_name": "Jim McKeeth", "gravatar_hash": "e5ca3abec062f8174570a4b1d1c840d8", "author_url": "http://www.davinciunltd.com/", "date": "May 28, 2008", "message": "Problem: You need a different password for every website and you don't want to have to remember it or record it so you always have access to it.\n\nSolution: Use a hash to generate a new password based on the URL of the site, and your one master password.\n\nPretty good implementation of the solution: http://passwordmaker.org/\n\nRuns on multiple platforms, so you can have it on every computer.  You just remember one password."}, {"author_name": "Jon Limjap", "gravatar_hash": "838a7420042d596328236931da81b494", "author_url": "http://dotnet.kapenilattex.com", "date": "May 28, 2008", "message": "Jeff,\n\nFor some weird reason I only get the first 4 minutes of your podcast whether I use the player on this page or download the mp3. Maybe it's an ISP problem, I'll check it when I get to my office (who uses a different ISP)."}, {"author_name": "Stephen", "gravatar_hash": "6831fcbb3ef14017940a373c691577c0", "author_url": "http://www.officesnapshots.com", "date": "May 28, 2008", "message": "Hey guys, thanks for talking about office snapshots a little bit!  We're always glad when people know and talk about us :) We'd love to get our hands on some Fog Creek office pictures.  Shoot over an email to discuss?\n\nThanks,\nStephen"}, {"author_name": "Brown", "gravatar_hash": "691654db31d8c937b9095de7914bcf72", "author_url": null, "date": "May 28, 2008", "message": "I use KeePass to manage my passwords and serial numbers.\nhttp://keepass.info/"}, {"author_name": "bp", "gravatar_hash": "cdfd5cadef76ea361532bfb20499a5ba", "author_url": null, "date": "May 28, 2008", "message": "Hahah, I really enjoyed the mobile computing link. Cheers."}, {"author_name": "Chris", "gravatar_hash": "eb758cdc175fc1e3a77e4bccf284027a", "author_url": null, "date": "May 28, 2008", "message": "My system of password management is very much like Dustin's: a really strong one for financial sites, a medium one for other sites I regularly visit, and a simple one for misc stuff."}, {"author_name": "Mark Tiefenbruck", "gravatar_hash": "5022e8f0a0c5572cc979ccb74bbf753f", "author_url": "http://mark.tiefenbruck.org/", "date": "May 28, 2008", "message": "Regarding window managers, X11 fares much better on this account, since you can choose your window manager. Some tile windows automatically (ion, wmii, xmonad) so they never overlap. Others are more conventional but are much more flexible than Windows or Mac.\n\nI'm a developer for one named fluxbox. Our default placement strategy places windows in open space if they fit and falls back onto a cascade like what Joel mentioned in Windows. Regarding Jeff's numpad example, in fluxbox you can define key bindings to do any moving/resizing you want, and this capability is also available to scripts. We have tabbed windows, too. And workspaces. Frankly, if you care about window management, it's worth getting into Linux/BSD. I for one could never go back.\n\nAnd I saw Office Space in a theater when it came out."}, {"author_name": "Hirvox", "gravatar_hash": "1226fb687397aaa0ab847e7e5414a0e7", "author_url": null, "date": "May 28, 2008", "message": "One authentication technology that I've watched with mild interest is Information Card: http://en.wikipedia.org/wiki/Information_Card\n\nThe basic premise is that your identity is stored on your own computer instead of a third-party site like in OpenID. Whenever you need to log in or register to a site, you are presented with an identity selection screen, which also shows what personally identifying information the site requires or can use. For example, an e-commerce site probably wants to know your address.\n\nOf course, the downside of storying your identity on your computer is that you can't easily take your information card with you whenever you switch computers."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 28, 2008", "message": "> And I saw Office Space in a theater when it came out.\n\nI salute all the visionaries who were able to understand the brilliance of this film years before everyone else. Including Geoff Dalgas! It is truly the Grapes of Wrath of our generation.\n\n> Information Card\n\nHirvox, infocard works with OpenID and specifically http://www.myopenid.com. Seriously -- try it!\n\nhttp://janrain.com/blog/2007/10/17/myopenid-adds-information-card-support/"}, {"author_name": "Mythokia", "gravatar_hash": "bb885d417951dd88f2dfb55f5cad17e1", "author_url": "http://blog.mythokia.net/", "date": "May 28, 2008", "message": "KeePass to manage my passwords. I used to only have a two categories of passwords before I used a password manager: important and trash. Right now I'm adopting a single password per site policy.\n\nI'm not too big of an OpenID fan because I find that it's a security system with a central point of failure. If your provider gets compromised (who knows how secure are their backend systems; do they adopt best practices?), you pretty much have got your online identity stolen."}, {"author_name": "Arron", "gravatar_hash": "198d6d4fed2012d939b47e63e561082f", "author_url": "http://www.unkwndesign.com", "date": "May 28, 2008", "message": "w00t new podcast.  AHHH MP3s TO PUT ON iPOD FOR NO GOOD REASON THEN TO SAY ITS THERE"}, {"author_name": "Stephen Hill", "gravatar_hash": "05e9ba4193d823a238da43fb1b5f18e0", "author_url": "http://stephenandlouise.co.uk", "date": "May 29, 2008", "message": "Hi Jeff and Joel.\n\nBut upset you didn't use my recorded question, hope you use it next week :)\n\nWith regards to <a href=\"http://www.hammocks.com\" rel=\"nofollow\">hammocks.com</a>. I would either create an account with my nickname GateKiller or with the email address Hammocks@GateKiller.co.uk. I then use the same 16 character password for each site.\n\nSo if they ask for an email address, which most do I think, they it's @gatekiller.co.uk and my web hosting company will forward that email to my gmail account.\n\nCheers\nStephen"}, {"author_name": "Stephen Hill", "gravatar_hash": "05e9ba4193d823a238da43fb1b5f18e0", "author_url": "http://stephenandlouise.co.uk", "date": "May 29, 2008", "message": "I loved City of Angels!!!"}, {"author_name": "Damian", "gravatar_hash": "e936bf226b0921257c47cfd7647e4578", "author_url": null, "date": "May 29, 2008", "message": "Keepass for passwords running on windows mobile. AllSnap (http://www.allsnap.org/) for window resizing and snapping ;)"}, {"author_name": "Dominik", "gravatar_hash": "cdb0d9080ea5654378484948d717c7c1", "author_url": "http://blogs.interdose.com/dominik/", "date": "May 29, 2008", "message": "I also use KeePass for my password management - and haven't solved the synchronisation problem to keep the file updated on my desktop PC and laptop. The author seems to have a synchronisation feature in the upcoming version 2.x...\n\nA short story about passwords and having the same password on every site: I once worked for a company that sells virtual goods (prepaid telephone recharge pin codes) over the internet. One major problem with virtual goods is, that as soon as the \"customer\" pays, the item is out on the way to him. On the one side that's good, but the downside is, that fraudsters using stolen creditcards get the stolen good at once without the chance of having human intervention.\n\nWe once had one of those bad customers and we knew that something's terribly wrong about him (a.k.a.: We were absolutely sure with no doubt possible). What did we do? He used an yahoo.com email address and he had changed the password that was assigned to him from our system to something different. So evil us took that information and tried to log on to his yahoo mail account with the same password that he used on our site.\n\nTo sum it up: it worked, we found out who he was stealing the money from (based on the emails in his account) and were able to warn them. They all had done fake ebay transactions. We even got his contact details. Let's just say, he was quite baffled when we called him on his mobile.\n\nAnd what do we learn? Having the same password on various websites is a bad idea."}, {"author_name": "Harry", "gravatar_hash": "a2fa94cc7a365e1fd858cc57ed791235", "author_url": null, "date": "May 29, 2008", "message": "I use the same password everywhere with a mentally calculated hash of the website name at the end."}, {"author_name": "Harry", "gravatar_hash": "a2fa94cc7a365e1fd858cc57ed791235", "author_url": "http://www.adverseconditionals.com", "date": "May 29, 2008", "message": "In fact what would be pretty cool would be this.\n\n1. Click on a password field\n2. Click on a FillOutPassword bookmarklet\n3. The bookmarklet javascript pops up a password textbox into which you type your master password. It then hashes the master password, the website name and a salt value and fills in the password field.\n\nThe bookmarklet could be generated with a salt value of a secret-ish value, or maybe your openid provider name or something :)"}, {"author_name": "Chris Bartow", "gravatar_hash": "97f8dbd7b1804150965ab30ae6fb0f0d", "author_url": "http://www.chrisbartow.com/", "date": "May 29, 2008", "message": "Joel needs a \"cough\" button on his microphone to remove him burping.  Radio 101, be professional! :)"}, {"author_name": "Keithius", "gravatar_hash": "51c993a6256194924615053475a14238", "author_url": "http://www.starkeith.net/coredump/", "date": "May 29, 2008", "message": "Just thought I'd mention, the past few podcasts I've had difficulties downloading them (I subscribe in iTunes). I'm not sure if anyone else has had problems, or if maybe your server is just a little overloaded with everyone downloading 22 MB MP3 files all at once, but I figured I would mention it just the same."}, {"author_name": "MattF", "gravatar_hash": "e7768537d6146d71bf7856361b3d770b", "author_url": null, "date": "May 29, 2008", "message": "From Coding Horror's item on spam at craigslist, linked to stackoverflow.com. First time at stackoverflow.com-- browsed backwards in time from the front page to the starting point at podcast #1-- then, starting from the beginning browsed forwards, back to the front page. Harder to navigate from the beginning because there's no navigation aids at the top of the page.\n\nDidn't even -notice- the stuff in the right-hand column until I thought \"They had a logo contest, so... where's the logo?\""}, {"author_name": "Konrad", "gravatar_hash": "f9401202ab73e624cc82800b0fff1489", "author_url": "http://madrat.net/", "date": "May 29, 2008", "message": "It was interesting to hear Joel talk about his job at Yale Med School. However, I believe that he got it all wrong. I'm studying bioinformatics, and a good part of the studies, and the reason why we do the job better than either a biologist or a programmer or even a team consisting of both, is that we have knowledge in both domains. Other people, whatever their background,now working in this domain envy us for our knowledge (although there's also a good dose of scorn involved, because obviously we poor inbetweeners know only parts of everything and everything of nothing). Actually, the example involving the pH of cells and laser scanning microscopy is a good one. At face value, knowledge of the underlying mechanism might not seem necessary but I can imagine a lot of situations where that might pose a problem. (Have they thought of photobleaching? Is time a factor? Do cell compartments move? How to correctly choose the image plane?) At the very least, the programmer has to rely on someone else telling him everything he has to consider, and even then a communication problem might (will!) ensue.\n\nOn the other hand it's true that most domain-specific software that I know (mostly, that's medical and biological research software) is poorly written and the user interfaces would make even the author of GUI Bloopers cry in despair. Developing good software is just really hard and it doesn't pay to restrict oneself to one domain of knowledge."}, {"author_name": "Etan Reisner", "gravatar_hash": "ffe0f143e9c5654692a9b5be96692588", "author_url": null, "date": "May 29, 2008", "message": "I'm glad someone pointed out the various X11 window managers that handle this stuff better than Windows does. It is unfortunate that the main X11 window managers are attempting to copy much of the stupidity inherent in the Windows model and are thus similarly lacking in useful features but such is the way of things currently. (No, that wasn't a general insult it was a specific comment on some of the stupid window management policy, lack of policy, and lack of built-in tools). I would also like to point out GridMove (http://jgpaiva.donationcoders.com/gridmove.html) which I imagine works rather like winsplit only possibly with slightly more configurability and which is built using autohotkey which is, in general, a tool worth knowing about (despite the language it uses being rather an abomination)."}, {"author_name": "Alex", "gravatar_hash": "dfdf71914df8f6cdac6fdcdb4d981064", "author_url": null, "date": "May 29, 2008", "message": "I use KeePass for my passwords management. I have three computers to sync it, but not doing this yet. Although, I think Live Mesh will be just great for that purpose, as it works for me to sync all other files I'm syncing across my PCs."}, {"author_name": "Oliver Holloway", "gravatar_hash": "171d426d90c53b683de090dda1d76eb9", "author_url": null, "date": "May 29, 2008", "message": "Perhaps you will consider organizing the question/final_answer combos as flashcards.  A given question may generate discussion, but usually there's a final answer (of one or more ways) to resolve the issue; at that point, the resolved point could be set up as a flashcard, suitably categorized and multiply labelled, so that users can use stackoverflow as a learning/retention tool."}, {"author_name": "psamtani", "gravatar_hash": "ea5ada23a8a7bbfd407cf47eae34ce76", "author_url": null, "date": "May 29, 2008", "message": "No amount of office candy can make a boring job interesting. Maybe one of the reasons you are having trouble finding good engineers is that good engineers don't want to work on bug tracking software, which is inherently boring compared to working in the game industry, Google or Apple. I think part of the reason people drool over these companies is not the fancy chairs, but the interesting work they do. That's part of the officesnapshots appeal - it offers people a peek into what they consider a more interesting work life, not just a fancy office."}, {"author_name": "Andrew Wood", "gravatar_hash": "a05ae3c23c293a241a11d68d62d9cee8", "author_url": null, "date": "May 29, 2008", "message": "I run two external monitors from my notebook giving me 3 monitors using a matrox external box which pretends to be a single super wide monitor and then splits it into two outputs\n\nhttp://www.matrox.com/graphics/en/gxm/products/dh2go/digital/home.php\n\nMy notebook is 17\" and the two monitors are matched 19\"."}, {"author_name": "Jamie", "gravatar_hash": "238f20fd3cc931f829dc82297a37fa2c", "author_url": null, "date": "May 29, 2008", "message": "OpenID is not necessarily safe without a good provider, and an awareness of the risks:\n\nhttp://idcorner.org/2007/08/22/the-problems-with-openid/\n\nIf you are to use solely openID, it may be worth considering linking users to the best openID provider available."}, {"author_name": "Emperor XLII", "gravatar_hash": "f991af29458cdb55e238a11dfa82505c", "author_url": "http://www.emperorxlii.com/", "date": "May 29, 2008", "message": "Password Minder (http://www.pluralsight.com/tools.aspx) on a USB key (along with other common tools), copied locally on all my computers for easy access; local svn repository to manage update conflicts (for password file and all the other tools)."}, {"author_name": "BCS", "gravatar_hash": "6757caf55de0413ae0994293e001d465", "author_url": null, "date": "May 29, 2008", "message": "Talking about monitor size: The main thing I want in a monitor is more pixels. I'd actually prefer a smaller monitor with more pixels than the reverse. (within reason)\n\nAs to how to use more monitors: If I had 4, I'd have them set up for different things. 2 for development, one for Firefox, one for email or something like that.\n\nabout devs learning domain vs. people from the domain learning programming: I think the point should be that the dev has a much easier task learning the domain because they only need to understand it, not actually work in it. It's sort of the difference between home work and tests.  with homework, you have the textbook and lots of time, with tests, you only have your memory and very limited time."}, {"author_name": "Justin Yost", "gravatar_hash": "83149adc0e0366baebe19fcaed5f7996", "author_url": "http://www.yostivanich.com/", "date": "May 29, 2008", "message": "Just wanted to comment on the Open ID issue and password management.\n\nI use Open ID and I love it for those sites that have it enabled get ranked so much higher in my opinion.\n\nAlso for password management, I use Password Safe. They have an option to install it on a thumb drive and I use that."}, {"author_name": "G Marshall", "gravatar_hash": "97814c12d93a5ff39baafacfb5dcaf1f", "author_url": null, "date": "May 29, 2008", "message": "I know that CapeSoft, at least in about 2003 or so, had private offices for developers."}, {"author_name": "Jim Robert", "gravatar_hash": "aa2c9c45372ed95ebd86c21d86766183", "author_url": "http://www.roboRobert.com", "date": "May 29, 2008", "message": "why not try something like this:\n\nask if the user has an openID already, if they click no, use ajax to pull up the myOpenId signup inside an iframe (or similar integration of the signup)\n\nyou could then also use a redirect to make the persons stackoverflow profile page an openID provider\n\nanyway, just an idea,\nJim"}, {"author_name": "Richard Szalay", "gravatar_hash": "7eaba3dd7c0fdce655ab50f001f23cc0", "author_url": "http://www.richardszalay.com", "date": "May 30, 2008", "message": "@Hirvox: I absolutely agree that Information Cards should be considered as it removes both the password itself and the reliance on a third party.\n\nBtw, the .NET card selector can backup cards to an encrypted file which you can then put on a USB key/cloud storage.\n\nI personally think its a much better answer to online identity than OpenID - afterall, OpenID has all the flaws of Passport/LiveID except you have to gamble on which provider has the least chance of closing up shop."}, {"author_name": "Richard Szalay", "gravatar_hash": "7eaba3dd7c0fdce655ab50f001f23cc0", "author_url": "http://www.richardszalay.com", "date": "May 30, 2008", "message": "@Jeff Atwood: While its nice that one OID providers support Information Cards... what's the point? The OID provider is now just the middle man and is no longer the main repository of the information."}, {"author_name": "Hass", "gravatar_hash": "8dd91d1af82a6e207d2cb348db78ee01", "author_url": null, "date": "May 30, 2008", "message": "Re:passwords, I do like many others and have a selection of various passwords and users for the various categories of sites. Plus I allow my web browser to save my login details.\n\nI really don't see the problem."}, {"author_name": "John", "gravatar_hash": "285fb572ae700baeed8216ad3e3c0487", "author_url": null, "date": "May 30, 2008", "message": "May I point out that the Complete RSS feed at http://blog.stackoverflow.com/index.php/feed/ is not, shall we say, precisely complete..."}, {"author_name": "John", "gravatar_hash": "285fb572ae700baeed8216ad3e3c0487", "author_url": null, "date": "May 30, 2008", "message": "Ah. There it goes, nevermind. (Bizarre. Until a second ago it only showed me up till #5.)"}, {"author_name": "Barry", "gravatar_hash": "7bcbdddb04000e4e6fbefbc318d85c67", "author_url": null, "date": "May 30, 2008", "message": "As for storing passwords, stick to the one Bruce Schneier wrote. It's definitely secure.\nFor junk passwords you don't care about, just use whatever's built into your browser. \n\nI use KDE on top pf a Linux-based OS, and I put everything into KWallet. Everything is encrypted with Blowfish (or was it Twofish? Can't remember).\n\nAs for window snapping, KDE does it natively. ratpoison (another desktop environment for \n*nixes) does tiling with no wasted space.\n\nIn Windows, your Holy Grail is AllSnap. Go to www.allsnap.org and try it. It's recommended by the folks at Security Now! so it must be good."}, {"author_name": "Robert Taylor", "gravatar_hash": "c8ec79b6a626ce9a847405f2ad1eb60f", "author_url": null, "date": "May 30, 2008", "message": "I want to submit my vote for the use of OpenID and/or InfoCards. \n\nLiveJournal is an OpenID provider, btw.\n\nThis is a great blog about identiy and is an advocate of InfoCards.  There are some articles and videos about integrating OpenID w/ InfoCards.\nhttp://www.identityblog.com/"}, {"author_name": "Joel", "gravatar_hash": "f0ecc70dd87ae9d01f0def006b8a28d3", "author_url": null, "date": "May 30, 2008", "message": "The PasswordSafe forums have a recommendation for synchronizing between USB and HDD's, Microsoft's PowerToy SyncToy.\nhttp://sourceforge.net/forum/message.php?msg_id=4222997\nDownload link\nhttp://www.microsoft.com/downloads/details.aspx?familyid=E0FC1154-C975-4814-9649-CCE41AF06EB7&amp;displaylang=en"}, {"author_name": "[ICR]", "gravatar_hash": "48a02e16370caadaedff78e2a94656ce", "author_url": "http://www.morethannothing.co.uk", "date": "May 30, 2008", "message": "Jeff - you mention how much you like snap-to-edge windows like Skype. I'd have to say I prefer the concept of what I can best describe as \"sticky windows\". If you move a window near an edge it doesn't snap/jump, but once you've got it flush to an edge it \"sticks\" there a little bit until you move far enough. It's hard to describe, but Ubuntu has it (and thus it's probably a GNOME feature I guess).\n\nIt's less annoying than snap-to-edge which pulls the window from your grasp if you happen to move a window near an edge while moving a window, but it makes it very easy to line things up if you want to."}, {"author_name": "Andrew", "gravatar_hash": "eb1e658170ecdcbb831507c8163cbd87", "author_url": "http://www.andrewdothay.net", "date": "May 30, 2008", "message": "Hi Guys,\n\nRegarding password management we use today (until something better gains broad support), I use a similar program as Joel. It’s called Password Minder available here:\n\nhttp://www.pluralsight.com/tools.aspx\n\n• The passwords are encrypted by a simple client application into an XML file, probably similar the app Joel mentioned\n• A master password protects access to the entire password store\n• You can sync the XML file among several computers using any sync program\n• All your computers have the .Net client installed, continually sync’ing the XML file in the background\n• I usually don’t know the GUID-like passwords for my accounts, just copy-and-paste\n\nHere's an example sync program: https://www.foldershare.com/"}, {"author_name": "Bob", "gravatar_hash": "f3b4628b5e2573dbd5884af0295c6c40", "author_url": null, "date": "May 31, 2008", "message": "The window-snapping thing can be hooked into Windows. I don't remember the app (I left Windows some years ago), but Google and you will be enlightened, I'm sure.\n\n\nGNOME does this by default."}, {"author_name": "Craig", "gravatar_hash": "0f646e0ae274f9795ce8e95c120bddf8", "author_url": null, "date": "May 31, 2008", "message": "I use RoboForm (http://www.roboform.com) for managing my website logins. Works in IE and FF. Also has a nice password generator utility built-in.\n\nJeff, out of curiosity, what brand/model are your 24\" widescreens?"}, {"author_name": "Vincent", "gravatar_hash": "e604ed328420a7ec0fdbdf2a1818de1c", "author_url": "http://polymathprogrammer.com", "date": "May 31, 2008", "message": "Hi Jeff, the video you mentioned of the people bringing in computers into Starbucks? It's by Improv Everywhere. Here's the link: http://improveverywhere.com/2008/02/25/mobile-desktop/"}, {"author_name": "Schroedl", "gravatar_hash": "ae600cb41baa60bce17302c2586dabec", "author_url": null, "date": "May 31, 2008", "message": "Keepass++"}, {"author_name": "flipdoubt", "gravatar_hash": "e6937b3a4d15f10e66022c896c458d99", "author_url": "http://flipdoubt.myopenid.com/", "date": "Jun 01, 2008", "message": "For password storage I use 1password on my MacBook Pro and my iPhone. Works great."}, {"author_name": "Paulo", "gravatar_hash": "41cb6187f24e4a958f42692eadc0fce2", "author_url": "http://barracadopaulo.blogspot.com", "date": "Jun 01, 2008", "message": "Hi guys,\nHere are few humble suggestions about the stackoverflow. I hope you find any of them useful.\n\nRegards\nPaulo\n\n- Initially I understood the podcast (and associated site) as a language agnostic place. Sure that specific problems will be approached, and specific problems concern specific technologies. But my understanding was that there was room for every technology (language, operating system, architecture, etc). A place where we all can share experiences and challenges, and where we all can learn with each other. But there were a couple of episodes where I felt that some pejorative comments were made about Java (and implicitly about whoever decides to use it). Maybe I understood it wrongly, but I felt like a second-class citizen because I was using Java. I guess that the authors are closer to the Microsoft technologies, but should not people who think differently be welcome as well (without judgments about who made the better choice)?\n- I listen to many technology podcasts, and this complain goes to every single one of them. I work mostly in the back-end, and a significant part of the developers out there are working in the back-end as well. Nevertheless the front-end gets most of the attention. I keep listening a million stories about how to create a web interface in every possible technology, how to create desktop applications, how to create user interfaces that are portable across different devices, etc etc etc. But matters like data persistence, transaction management, performance tunning, messaging, etc. are very seldom mentioned. I would love to be able to exchange info with other people and to learn a bit more about what is being done in other places in terms of back-end. How are the .Net guys managing transactions across different resources? How can I interact with a messaging system using Phyton? What kind of thread management capabilities are offered by Ruby?\n- Could there be a section for sharing patterns (this applies more to the site than to the podcast)?\nSomething like the guys from TheServerSide (www.theserverside.com/patterns) have. I find it extremely useful, and I learn a lot with it. I feel that the StackOverflow would be a natural place for sharing such kind of information.\n- Besides sharing experiences just about coding, can you discuss a bit about related matters? For example, what database will you use for the StackOverflow? And why? What about version controlling system? What degree of project automation do you have? Do you model it using UML? If yes, what tool do you use? I guess I made my point :-)"}, {"author_name": "lisa", "gravatar_hash": "701e61880fecc74b84f905458de23811", "author_url": null, "date": "Jun 02, 2008", "message": "Hi I've only caught up the podcast #5 and in that you mentioned personal app use tracking software (so you can see how long you spend on Reddit, Outlook, etc, per day). Can you please post a link to it? Frankly I can't be bothered wading through an hour of audio to go find it and you don't seem to have a summary of your podcast #5 :("}, {"author_name": "Matan", "gravatar_hash": "0bb7bf3089b704277bac6d9acc7bb22b", "author_url": null, "date": "Jun 02, 2008", "message": "Passwords:  I use good-old plain-text to store my passwords.  I encrypt the file with gpg ascii-armored.  This way the technique is simple, scriptable and it lives in the command-line;  and that's how I like things.  ;)"}, {"author_name": "Jason Bunting", "gravatar_hash": "3d6bd00a348b2caab6108406d7dcee1c", "author_url": "http://www.jasonbunting.com", "date": "Jun 02, 2008", "message": "RoboForm for password management works well for me - first learned of it 3 years ago, have used it ever since with no problems. Generates passwords, stores all sorts of data under a single passphrase."}, {"author_name": "Birger Halfmeier", "gravatar_hash": "6d1f1752d4424cfb058b436e1b67d7b5", "author_url": null, "date": "Jun 03, 2008", "message": "I'm also having problems downloading this episode. Both from iTunes as well as from Firefox and IE. I didn't have any issues with the previous 6 podcasts (same machine, same connection)..."}, {"author_name": "tonetheman", "gravatar_hash": "f2408c9773577b6de729f59430d4f85f", "author_url": "http://wasalllike.com", "date": "Jun 03, 2008", "message": "I use https://pwdhash.com/\nThere is a firefox plugin that lets you use it without pain in firefox. Basically it takes the domain plus your master password and creates a password per site. The only password you remember is the master. Good stuff."}, {"author_name": "[ICR]", "gravatar_hash": "48a02e16370caadaedff78e2a94656ce", "author_url": "http://www.morethannothing.co.uk", "date": "Jun 03, 2008", "message": "Paulo - You may like http://www.se-radio.net/ They claim to be language agnostic but have a bias towards Java :P But generally it's good, widely applicable content from all over the spectrum."}, {"author_name": "Bruce", "gravatar_hash": "973ccd275c91ccb5fb0ea74716b9cbf7", "author_url": "http://galactic-patrol.spaces.live.com", "date": "Jun 03, 2008", "message": "These stackoverflow podcasts are downloading extremely slowly; at least 10x slower than the other podcasts I subscribe to."}, {"author_name": "Harvey", "gravatar_hash": "18f44bb2c283b0582c098d61b3d93ca8", "author_url": null, "date": "Jun 04, 2008", "message": "Joel, would you please provide a link to the adjustable desks you mentioned in the show? IKEA used to sell one and I've kicked myself ever since for not buying one at the time. Since then, every time Lifehacker runs a feature on a cool desk environment, 9 times out of 10 I see that IKEA desk there looking back at me, taunting me."}, {"author_name": "Saniul Ahmed", "gravatar_hash": "d070df533299d18926a873a7621d331a", "author_url": null, "date": "Jun 04, 2008", "message": "Joel,\nThere's a great and very secure online password manager called PassPack.\n\nhttp://passpack.com/\n\nIt's in Beta 6, and it also allows for offline use using Google Gears.\n\nBecause it's online, you don't have to synchronize it between different computers.\n\nIt also has a one click functionality, you just press a bookmarklet and it automatically logs in to the current website."}, {"author_name": "Ranec", "gravatar_hash": "43df0f75ad061d645d87105bda8a009c", "author_url": null, "date": "Jun 10, 2008", "message": "After listening to 8 minutes or rubbish about how other podcasts fill their first 15 minutes with adverts and music I stopped listening. This was dull. I'm not going to skip over the boring bits, I will stop listening entirely. Sorry."}, {"author_name": "Stephen Rylander", "gravatar_hash": "a4ae47070c4c3695a4aee72a81eb490b", "author_url": "http://ontheheap.com", "date": "Jun 10, 2008", "message": "It's interesting to hear both of you guys present differing opinions. I feel that Jeff was slightly off base by paying almost too much attention to soft skills.  Developers should take charge of their career, and this equates to either being a key member on a huge open source project or improving soft skills and becoming a leader.  I've interviewed developers with amazing soft skills but no real teeth. This is why Joel wins the \"learn C\" debate!  When developers don't understand, or don't have the ability to understand the deep structures of a language or platform their solutions are always cheapened.  Maybe fragile?  \nBasically, what I'm trying to say is, technology has not solved all our problems.  Faster processors have not solved the fact that multi-threaded, parallel code is still difficult and not being done well.  There are big deep pits full of problems that software could help solve...and those will take breakthrough in software, not communication."}, {"author_name": "Bert van Brakel", "gravatar_hash": "9644f231399e3976652cf36e27ac6352", "author_url": null, "date": "Jun 23, 2008", "message": "Mentioned on the podcast about OpenId, that having to us an URL to an openId provider was a bit of a pain vs using a username. Also, if a user is presented with a redirect to an openId provider then they are quite likely to go somewhere else. Its another thing to manage and remember\n\nOn the other hand, if companies like google/yahoo/MS implemented openId systems, then we could just provide an email address as an openid username, from which the openid url could be determined (based on the domain). User would not be confused, not have to worry about which provider to use as they could use someone they already trust (all they know is that their email is required)\n\nFrom a users point of view, they would then provide just an email address, enter their password, and bingo everything would be filled out.\n\nBrowsers could also have inbuilt openId management plugins, which would recognize when a site uses openId, automatically retrieve user details from the users preferred provider (based on users email), then pre populate forms, or in the case of login, give the requesting site a one time url to grab the user login details from the openid provider (so there is some background talking between browser plugin and openId provider on the users behalf). This would solve the problem of storing passwords on USBs, keeping details in sync amongst multiple computers, ensuring all sites have access to your latest correct details, and also ensuring sites don't have access to your password. Plugin could even distribute and sync info amongst a couple of openId providers to ensure that if one goes down, there is not a single point of failure (automatically falling back to another provider if it down when logging user into a site).\n\nThe problems attempting to be solved are:\n\n1. keeping user details up to date amongst multiple sites\n2. keeping track of logins across multiple sites\n3. keeping track of passwords across multiple computers\n4. not having to renter user details for every site user signs up to\n5. ensure user is not tied to a single openId provider if they are down, go out of business\n\nI think a combination of using a browser plugin and multiple openId providers solves all the above issues"}, {"author_name": "CStick", "gravatar_hash": "a9e35a190d6b5395ac07e9b6a085a7ad", "author_url": null, "date": "Jul 10, 2008", "message": "The WinSplit Revolution link doesn't seem to work any longer.  I use GridMove like Etan Reisner suggested and I think it is all I ever need for multiple displays.  I prefer to disable the title bar and grid display options and use the window key + num to arrange my windows.  It is light weight and non-intrusive."}, {"author_name": "Peter J. Hart", "gravatar_hash": "fd3862e726d070e2354c03d1121ba561", "author_url": "http://peterjhart.com", "date": "Aug 18, 2010", "message": "\"I'm Jeff Atwood, and Windows 7 was my idea.\""}]}