{"response": [{"author_name": "Christopher Svec", "gravatar_hash": "cf97d23213178668f54df90129778bef", "author_url": "http://svec.wordpress.com", "date": "May 20, 2008", "message": "The transcript wiki link points to the wrong podcast."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 20, 2008", "message": "Well, I haven't finished editing it yet :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 20, 2008", "message": "Also the \"Paul\" I was talking about in today's Podcast is Paul Buchheit\n\nhttp://paulbuchheit.blogspot.com/\n\nhttp://en.wikipedia.org/wiki/Paul_Buchheit"}, {"author_name": "Ralph Whitbeck", "gravatar_hash": "93533aa927a1c348f12903b5ba65aa80", "author_url": "http://www.damnralph.com", "date": "May 20, 2008", "message": "Is anyone else having problems downloading the podcasts in iTunes?  It'll start downloading get a half mb to 2 mb and then stop and finally error with a Network Connection error.  This is the only podcast I am having problems with.\n\nI've tried both subscribing through the iTunes directory and by providing the RSS feed.\n\nThanks for you help.\nRalph"}, {"author_name": "Christopher Svec", "gravatar_hash": "cf97d23213178668f54df90129778bef", "author_url": "http://svec.wordpress.com", "date": "May 20, 2008", "message": "Jeff, sorry about my wiki-trigger-finger.  :-)"}, {"author_name": "Hirvox", "gravatar_hash": "1226fb687397aaa0ab847e7e5414a0e7", "author_url": null, "date": "May 20, 2008", "message": "iTunes works for me.\n\nA few notes on MS' Frontpage and Expression series. The Expression series is about rich clients with WPF/Silverlight, not about web pages. It's direct competition is the Adobe Flash CS3, not Dreamweaver. Sharepoint Designer is the new product based on Frontpage. Like the name suggests, MS is suggesting that people upgrade from plain IIS installations to Windows Sharepoint Services or even Office Server. However, Sharepoint Designer is still a power user's or UI designer's tool. Building custom functionality or customizations that can be replicated will still be done with Visual Studio."}, {"author_name": "Michael", "gravatar_hash": "a83ecb74b1e755f9d34cd6599a8e6e18", "author_url": "http://www.stum.de", "date": "May 21, 2008", "message": "ELMAH made me think about Elmer Fudd at first :-)\n\n\"Shhhhhhhh, be vewwwy, vewwwy quiet; an ewwow occuwwed on this page\""}, {"author_name": "Fred", "gravatar_hash": "2617f6bed0c026cf1a7415c4e33fd642", "author_url": null, "date": "May 21, 2008", "message": "Hi, \nRegarding spaces, maybe http://virtuawin.sourceforge.net/\nis something to try.\n\nHaving lived with virtual desktops forever under linux\nI have always missed them under windows. \nHave not tried the virtuawin, but used http://virt-dimension.sourceforge.net/ earlier, but that does not seem to be developed anymore. (last release July 9, 2005)\n\nHave not tried spaces, and maybe that has extra features."}, {"author_name": "Michael Stum", "gravatar_hash": "a83ecb74b1e755f9d34cd6599a8e6e18", "author_url": "http://www.stum.de", "date": "May 21, 2008", "message": "By the way: The \"old\" Frontpage is now Sharepoint Designer and it's as... erm... good as it ever was! (AKA: The *only* reason people use it is because it's the only way to edit Sharepoint Sites properly)\n\nExpression is something different now, it's more for their Silverlight / WPF/E stuff. Expression Blend and the Media Encoder are quite decent, but Silverlight in it's current Version is not really notable - not bad, but no competition to Flash.\n\nSilverlight 2.0 looks quite promising, especially because you can now use Visual Studio 2008 to develop Silverlight Apps. Flash is being used despite being one of the worst IDEs to write code in, and SL2.0 could start to get a Market Share, even though it's still a loooong way until Silverlight could really make an impact. I wonder if Microsoft has the endurance to improve Silverlight for years before seing the results pay off, or if they are going to panic in 2 years when they will still be behind Flash and stop really improving Silverlight in favor of useless activism."}, {"author_name": "Thomi", "gravatar_hash": "d07ab78a88fa4626baea08d39e5d5d2c", "author_url": "http://tech-foo.blogspot.com", "date": "May 21, 2008", "message": "Any advice on how I can be paid to quit my job? Sounds like a good idea to me ;)\n\nYet another good podcast.."}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "May 21, 2008", "message": "Jeff you may want to consider only allowing downloads of the MP3 over bit torrent.  That way you just need to seed the network.  Also I remember Scott Hanselman talking about his woes with bandwidth and podcasts.  He implemented a throttling package that is an add on to IIS 7.  If I remember the conversation correctly."}, {"author_name": "Peter Turner", "gravatar_hash": "edfa1f5a3274d9d6faa2035e6cd32077", "author_url": "http://www.american-data.com", "date": "May 21, 2008", "message": "Does anyone know what one's company has to do to get access to the Microsoft error collection database?"}, {"author_name": "Martin Wallace", "gravatar_hash": "96cc9a6a2199a0eff068448c5d16b2a3", "author_url": null, "date": "May 21, 2008", "message": "Another great podcast.  Keep up the good work guys."}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "May 21, 2008", "message": "Jeff,\n\nCan you please explain to Joel and everybody else in the next podcast, that MVC != Web Forms.  In MVC there is no control tree to parse through, and there is not quasi-state delivered through view states and post backs. \n\nYou cannot easily use any of the Web Controls with MVC, especially the ones that rely on the post back.  The login wizard is one of the controls that cannot be used with MVC with out a huge hassle.  And by the time you get through the hassle you could have easily rolled your own login and registration page twice over.\n\nThis is the second podcast in a row where you have dedicated at least 5-10 minutes just on this subject of a login control.  It is apparent the Joel doesn't get it.  And instead of talking about how MVC works or pointing people to http://asp.net/mvc to see the Hanselman demos you talk about why it is important to recreate the wheel.  Which is doing a great dis-service to you and MVC because you are coming off as arrogant to the people not initiated to how the ASP.NET version of MVC is different than the traditional Web Forms.  MVC is a radical departure from everything ASP.NET Web Forms, from the way you create the HTML all the way down to the way you hook up the BCL.  There is no more code-behind, just explicitly typed inputs that your action allows.\n\nAs you can see I am really passionate about this, mostly because none of the myths of MVC are being dispelled in the podcast.  And I thought the goal of Stackoverflow was to dispel rumors and set people straight on technologies.\n\nNick"}, {"author_name": "Duggy", "gravatar_hash": "1db145c1ed0a3cf5711cff93b84fb0dd", "author_url": null, "date": "May 21, 2008", "message": "I think you miss the point of paint and notepad,these are application that 'just work'. paint.net is great for photo editing but if you just paint a silly face its a bit excess and not everyone who uses a computer is a photoshop artist, paint is all they need. The same is true for notepad, it just needs to work. You can get other apps to do text file editing etc. but notepad is your fall back, your safety net. Its runs on every windows computer and is perfectly backwards compatible. Why should it provide extra functionality. Its what you discuss why should windows have notepad fight with word, notepad is only meant as a last resort, Word is what your ment to use to write stuff in. What I like to see from notepad and particular paint is fast load time, those apps load in pico-seconds which is what you want for a rough and ready app. What I wish they'd bring back is Photo Editor!"}, {"author_name": "Stefan Verhoeff", "gravatar_hash": "a94008d85a0ccb881b3f7c21ef903351", "author_url": null, "date": "May 21, 2008", "message": "Just wanted to say I really enjoy your podcasts. The discussion in interesting and I like how you guys are looking at IT with a more top-level view, not focussed on just one technology.\n\nBut Java is the new Cobol? Come on! Sure Java is used for a lot enterprise non-hardcore business apps. But there's a lot of exciting stuff going on as well. And how is it different from .NET / C# anyway? The languages are very very similar. And Java has been around longer, some lessons have been learned there. There are a lot of interesting things going on in the open source community. Just check for example the <a href=\"http://springframework.org/\" rel=\"nofollow\">Spring framework</a>, <a href=\"\" rel=\"nofollow\">Apache Jakarta</a> and <a href=\"http://www.eclipse.org/\" rel=\"nofollow\">Eclipse</a>. Lot's of commercial stuff too like application servers and development tools.\n\nIt doesn't really matter which language or platform you choose. All are just tools that enable us to do our job.\n\nAnyway, keep it up. I'm curious what stackoverflow will become."}, {"author_name": "Naseer", "gravatar_hash": "570dac6ea36805b940464467181cc1fd", "author_url": null, "date": "May 21, 2008", "message": "Broken RSS feed ? The blog.stackoverflow.com doesn't update in google reader."}, {"author_name": "Glenn", "gravatar_hash": "d2d61b7e42209af66d32f099773c195a", "author_url": "http://kentwell.net/glenn/", "date": "May 22, 2008", "message": "We've just started using LibSyn (www.libsyn.com) for podcast hosting.  You only pay for storage space and bandwidth is unlimited.  And it has everything to manage your podcast (episodes with an RSS feed etc) if you want to do that, or you can just store your files there."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 22, 2008", "message": "Naseer -- I've been checking both feeds regularly in Bloglines (another web reader) and it's working fine there."}, {"author_name": "Alex", "gravatar_hash": "dfdf71914df8f6cdac6fdcdb4d981064", "author_url": null, "date": "May 22, 2008", "message": "Where this OneNote acquisition story comes from? I always thought this was homegrew development in MS."}, {"author_name": "Chad", "gravatar_hash": "769d01d1649aeb4bc2f09c37ff4983a2", "author_url": "https://twitter.com/colgur", "date": "May 22, 2008", "message": "Great podcast guys, laughed out loud on the bus a couple of times...\n\nI wanted to thank Jeff for the reference to http://se-radio.net. Got http://drop.io from his Twitter feed too. Both great links.\n\nI thought the OS discussion was interesting. I've always thought of the Operating System as commodity software. To my mind, if a reasonable abstraction of the underlying hardware exists then the OS feature set is complete.\n\nJoel's description of MacOs seemed to lump what I consider to be \"platform\" and full-blown application functionality into OS software. True, such functionality is packaged as an OS, but is that really \"Operating System\" functionality?\n\nI would argue that what truly separates \"Operating System\" packages has almost nothing to do with operating the system and everything to do with classical software feature creep/bundling/stuffing.\n\nWe only look to our OS for such functionality because we've been trained by an industrial legacy of system providers. Vendors feel compelled to lump in more and more \"Operating System\" functionality to justify a sticker price.\n\nJust my $0.02 worth."}, {"author_name": "Ed", "gravatar_hash": "48b09f6a897c6056989415b17cd5d300", "author_url": null, "date": "May 22, 2008", "message": "With respect to Mac OS Spaces and virtual desktops for Windows... \n\nI highly recommend VirtuaWin (http://virtuawin.sourceforge.net/).  I've been using it for a couple years now on first XP, then Vista.  I find the experience much improved by setting specific shortcut keys for each desktop, rather than the forward/backward shortcuts.  E.g., I use Ctrl+Alt+{Q,W,E,R} for my four desktops."}, {"author_name": "Weeble", "gravatar_hash": "3ac5db3768c09788ed9fe03c5f4ff171", "author_url": null, "date": "May 23, 2008", "message": "My MP3 player doesn't have a display. I do appreciate knowing what I'm listening to!\n\nPS - It seems your comment submission system returns a generic \"server error\" if you forget to include your email address. I hope you're logging errors! ;)"}, {"author_name": "Hass", "gravatar_hash": "8dd91d1af82a6e207d2cb348db78ee01", "author_url": null, "date": "May 23, 2008", "message": "In Jeffs post \"Potential Markup and Editing Choices\" he states \"Good programmers never write what they can steal or borrow\".\n\nThis is in strong disagreement with his arguments in this blogg on why he is coding his own login functions for the site. He really didn't seem to have any real explanation as to why (in a commercial venture) he was willing to invest so much time in features that are provided out of the box.\n\nI would have to say that he highlights what I believe is a fundermental difference between what I refer to as \"programmers\" and \"developers\". Developers focus on user functionality and maximising business value. They therefore seek to reuse as much as possible and use their time to add business value rather than to reinvent or overengineer the software. Programmers on the other hand are geeky theorists who care more about the elegance of their code than the functionality they provide for their users or the business value they can create. In my experience of developing software good programmers seldom make good developers.\n\nMost of the time Jeff sounds like a good developer but today he sounded more like a programmer."}, {"author_name": "Naseer", "gravatar_hash": "570dac6ea36805b940464467181cc1fd", "author_url": null, "date": "May 23, 2008", "message": "Thanks Jeff, deleting and readding the feed in Google Reader fixed the issue."}, {"author_name": "David Robbins", "gravatar_hash": "e90d3971be54d06acc1623585de1cda2", "author_url": null, "date": "May 24, 2008", "message": "\"Crappy copy\" \"doublestackoverflow in ESL\" \"Yeah, whatever, it works\" were great comments.  Good spontaneous banter.\n\nBy the way, Google is the Wally world of the world!"}, {"author_name": "Nick Berardi", "gravatar_hash": "906432cc1eb080f5e5343438f654189e", "author_url": "http://www.coderjournal.com", "date": "May 25, 2008", "message": "Hass,\n\nJeff just hasn't done a very good job explaining why he is re-implementing the login.  I can't speak for him, but from my own experience it is impossible to use the ASP.NET Web Forms Login Control with MVC.  \n\nMVC is like old ASP, everything is done through  and nothing is done in the control tree.  So the Login control is totally useless."}, {"author_name": "Peter Baer", "gravatar_hash": "019689a878ef5990fcb7ea3ea9f69b3a", "author_url": null, "date": "May 25, 2008", "message": "OneNote was developed entirely within Microsoft.  Joel was probably thinking of either Groove or Visio, which were acquisions."}, {"author_name": "Ben Richardson", "gravatar_hash": "456c9cc0e9a40518bb0976b1bf161cd4", "author_url": "http://www.freshview.com", "date": "May 26, 2008", "message": "Another spaces (multiple desktops) alternative for Vista - http://www.codeplex.com/vdm"}, {"author_name": "Jo", "gravatar_hash": "9d690d46a1dd4235cec2886d1dce5969", "author_url": null, "date": "May 27, 2008", "message": "Jeff - I'm enjoying the podcasts.\n\nJust one issue - I cannot understand why you criticise Java.\n\nI've used both C# and Java commercially for many years. \n\nIf you were to also criticize .NET then I could understand the consistency.\n\nAt the very least, please outline what's wrong with Java much as you did in your PHP article - which made perfect sense."}, {"author_name": "Merus", "gravatar_hash": "b7e35651f25986c1c6f61ffca814b640", "author_url": null, "date": "May 27, 2008", "message": "Aargh, links to TV Tropes in the transcript. Now I'm not getting anything done."}, {"author_name": "Bryan", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": "http://quux.tumblr.com", "date": "May 28, 2008", "message": "Just wanted to toss in some positive feedback. I'm not really a coder (except occasionally for small personal projects). I'm a sysadmin.\n\nBut still, the podcasts are fun and interesting. In fact this is the first podcast I ever bothered to listen to. \n\nAlthough I will probably not be within the target audience of stackoverflow once it gets off the ground, I will be watching and listening with much interest, because the problems (of knowledge storing and update) you are attacking are common to any field of endeavor.\n\nKeep it up!"}]}