{"response": [{"author_name": "Teifion", "gravatar_hash": "c80131720899ffdffa925c4258633104", "author_url": "http://woarl.com/blog", "date": "May 22, 2008", "message": "I'm firmly in the HTML camp but I do web stuff so it's to be expected. I think that the syntax highlighting is an excellent idea, my suggestion to improve it is to have it so that members can set their own colour scheme."}, {"author_name": "Will", "gravatar_hash": "6181a733c7c10b13387f123d604f31e6", "author_url": "http://www.yhvh.co.uk", "date": "May 22, 2008", "message": "Looks good! I normally despise wiki style markup because I was reared in HTML but I can definitely see the benefits here. You'll probably end up with a more cohesive feel to the site and do away with painful HTML character codes for . \nForget the formatting toolbar, it's a waste of space."}, {"author_name": "Richard", "gravatar_hash": "ce54c930abde8f0b7b0d5c7f2c354c87", "author_url": null, "date": "May 22, 2008", "message": "I'm also in the HTML camp. If the choice is between Markdown and HTML and they both do the same thing, I would rather learn the markup that is transferrable."}, {"author_name": "McDowell", "gravatar_hash": "cf02ac6dae1a5494913e0c0c9d9956d7", "author_url": "http://illegalargumentexception.blogspot.com/", "date": "May 22, 2008", "message": "After two minutes using the Markdown/Showdown demo, it gets my vote. Simple, intuitive and easy to read."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 22, 2008", "message": "@Richard\n\nYou can mix HTML and Markdown, so *theoretically* at least it is possibly the best of both worlds?"}, {"author_name": "Yaakov", "gravatar_hash": "79bab78ef4091e95ae0fb38a5413e66b", "author_url": "http://ellisweb.net", "date": "May 22, 2008", "message": "+1 HTML. (I am definitely not a fan of splitting up the href attribute from the anchor indicator that is present in Markdown/Showdown - too easy to forget to include the link address)\n\nSyntax highlighting is great (as long as it works in a way that makes sense for all languages supported - I have seen these things implemented clumsily before). \n\nOne other thing: especially for posting code, it is important that you override the default browser setting for the Tab key - I want to use Tab to indent, not to move to the next input element on the screen."}, {"author_name": "John", "gravatar_hash": "d0b76ae7bf261316683cad31ba0bad91", "author_url": null, "date": "May 22, 2008", "message": "When I first attempted to edit wikipedia, editing was annoying as I could not see what I am doing unless I click preview constantly. So I like the preview idea especially when having to learn a new markup.\n\nOn a different point at work I use screwturn wiki and at first the wiki mark did seem unusual (being used to HTML) however creating a list using stars is much quicker than the html code required."}, {"author_name": "McDowell", "gravatar_hash": "cf02ac6dae1a5494913e0c0c9d9956d7", "author_url": "http://illegalargumentexception.blogspot.com/", "date": "May 22, 2008", "message": "RE: HTML\n\nIt really depends on the editing experience - I don't want to be editing something like this: http://illegalargumentexception.blogspot.com/2008/05/temporary-post-for-jeff.html\n\nFor a complex code sample, this could get very messy to edit in-situ. For this reason, I think Markdown is a better option."}, {"author_name": "Tom", "gravatar_hash": "1f0b00b8853cf0311888bb3ed2a77ebc", "author_url": "http://www.tommcfarlin.com", "date": "May 22, 2008", "message": "On this topic, I'd usually lean in the direction of HTML. Much like John just mentioned, the problem with lightweight / custom markup is that you can't see what it's going to look like until you post to preview.\n\nSecondly, though these markups are simple, it's one of those things that I have to constantly refer to a legend or a key saying \"is this the right tag?\" Either way, I hate having to refer to a legend, have to post to Preview, and then re-edit several times - I don't use 'em regularly enough to commit them to memory.\n\nLegend + Lightweight Markup + Preview seems gold. I'm sold on it."}, {"author_name": "Huppie", "gravatar_hash": "34d96bbc3fd8768f39b414f28d52ce87", "author_url": null, "date": "May 22, 2008", "message": "First, I think the markdown samples look very easy, I think markdown is definately the better choice for posting questions. Since it is possible to mix HTML and markdown I think it is the better choice for most ofus.\n\nThe preview pane on showdown looks very sweet, I especially like the fact that you get instant feedback when typing in the comment area, that's real WYSIWYG.\n\nSecond, I don't know if you thought about it but one must have will be Tabs. In most browsers they're not handled very well but when posting/editing code this should be possible, have you thought about this?\n(I googled a nice tutorial on ajaxian.com, http://ajaxian.com/archives/handling-tabs-in-textareas )"}, {"author_name": "Daniel Yokomizo", "gravatar_hash": "ca33cf3a10766186f28474e097ad0890", "author_url": null, "date": "May 22, 2008", "message": "<q>Adopting tools like these means we’d be very intimately tied to JavaScript on the client, of course, but it’s hard for me to see how that’s a problem on today’s web.</q>\n\nNot if you use http://en.wikipedia.org/wiki/Progressive_Enhancement. Ensure that it works without Javascript (e.g. I use No Script in Firefox because I don't believe most programmers made their site resistant to XSS and friends) and everything will work out fine. There's no problem if you provide better experience for those using some technologies if it also works (but with worser experience) for those not using it.\n\nOn the issue of HTML vs. Markdown, with HTML you'll have to watch out for XSS, which is very hard (not just <q>a bit of careful coding</q> as you say in your Coding Horror post, because you have to know HTML by heart, including what IE thinks HTML is (there are vulnerabilities affecting only IE that doesn't even make sense in HTML)) and require tools like http://www.owasp.org/index.php/Category:OWASP_AntiSamy_Project. Currently AntiSamy is Java only, so you'll have to find something that works on .Net, but you can be certain that people will try to exploit your HTML for any vulnerabilities."}, {"author_name": "Kevin", "gravatar_hash": "7c049f3c402a7af078702a06079593c2", "author_url": "http://brokencoder.com/", "date": "May 22, 2008", "message": "As long as the editor has tools to do most of the work (highlight chunk of text, click \"Bold\" button) does it really matter?\n\nAs to syntax highlighting... I personally favor things which do not rely on JavaScript. Something similar to WP-Syntax (yes, I realize you probably aren't using WP, not the point) which uses GeSHi (which appears to be down at the moment... annoying).\n\nBasicly the ability to wrap a chunk of code in a PRE tag and give it a language attribute (with optional line numbers)...\n\nKevin"}, {"author_name": "[ICR]", "gravatar_hash": "48a02e16370caadaedff78e2a94656ce", "author_url": "http://www.morethannothing.co.uk", "date": "May 22, 2008", "message": "Showdown looks pretty good.\n\nI would put a vote in for adding the ability to mark parts of the code snippets as classes etc. It bugs me when code becomes hard to read because the highlighter can't tell when something is a class/etc. IDE plugins would then help to alleviate the pain of having to do the markup manually."}, {"author_name": "[mag]", "gravatar_hash": "9d6a414125f7eb1cb44b53ae23a44af9", "author_url": null, "date": "May 22, 2008", "message": "Oooh! Markdown! I am completely in the Markdown-camp. \n\nI'd even go so far as to disallow inline HTML, because you are going to sanitize it anyway, so the preview will potentially not match the final content. (Unless, of course, you implement the sanitizing in Showdown as well)\n\nBut, anyway, I just wanted to say that Markdown would be my number 1 choice by a wide margin. Hooray!"}, {"author_name": "Michael Stum", "gravatar_hash": "a83ecb74b1e755f9d34cd6599a8e6e18", "author_url": "http://www.stum.de", "date": "May 22, 2008", "message": "The Weapon of Mass Destruction Live demo looks good - live preview, a syntax that is basic enough to not get in your way.\n\nThe only thing: When copy/pasting code, there should be a way to paste it indented or mark is as code, to indicate:\nDear Markdown, please do not touch this except for HTML-Encoding it and please do not destroy my layout like those annoying automatic-smiley crap is doing every time my tag ends with an 8 like &amp;gtsometag8&amp;lt which usually gets converted into an evil grin smiley."}, {"author_name": "Stephen", "gravatar_hash": "c8840bff779d9acaa15d1628f7869d12", "author_url": null, "date": "May 22, 2008", "message": "100% markdown for me.  Once you know the syntax is faster to type the stuff in, eg\n\n* bullet \n\nvs\n\n\n   bullet \n\n\nMarkdown is also 100% readable non-marked up by my mother, which is another bonus.\n\nI am not too fond of the toolbars for textareas - many of them are clunky and don't work too well - that said, if you can make a nice one, it helps the non-markup aware and doesn't get in other peoples way.\n\nMake sure you include a link close to the text area that says something like 'you can use markdown here' with a link to the markdown syntax."}, {"author_name": "Otto", "gravatar_hash": "435be4cef46ad735c93a4c6bc162b3c3", "author_url": "http://blog.ottoradke.com", "date": "May 22, 2008", "message": "I really like that you're talking a lot about how you're going to be building stackoverflow.  \n\nNow that you've chosen Markdown, what process and tools are you going to use to guard against XSS?  If you don't mind, I'd love to hear what the minds at stackoverflow think about this subject."}, {"author_name": "Weeble", "gravatar_hash": "3ac5db3768c09788ed9fe03c5f4ff171", "author_url": null, "date": "May 22, 2008", "message": "I'm a bit cautious of Javascript-based dynamic previews - it seems to be another attack vector for malicious scripts that has to be guarded entirely separately. You have to guard both the post-as-rendered-by-the-server and the post-as-rendered-by-the-preview."}, {"author_name": "[mag]", "gravatar_hash": "9d6a414125f7eb1cb44b53ae23a44af9", "author_url": null, "date": "May 22, 2008", "message": "Weeble: No worries :) The post-as-rendered-by-the-preview is all client side anyway. The client can do whatever it wishes anyway, hence is this not a new attack vector."}, {"author_name": "chakrit", "gravatar_hash": "5cd7fb52fee797986f20f500a01a4fb7", "author_url": null, "date": "May 22, 2008", "message": "I like [preview + legend + markdown]"}, {"author_name": "chakrit", "gravatar_hash": "5cd7fb52fee797986f20f500a01a4fb7", "author_url": null, "date": "May 22, 2008", "message": "oh.. and check closely for XSS if you're going to render complex user inputs.. research it well...\n\nreally, do a research on XSS... it'll help reduce some phishings and spammings."}, {"author_name": "Weeble", "gravatar_hash": "3ac5db3768c09788ed9fe03c5f4ff171", "author_url": null, "date": "May 22, 2008", "message": "[mag]: I'm no expert on web development, but I think malicious data can get to the post-as-rendered-by-the-preview in two ways: if it was saved on the server by another user and you try to edit it, or if via social engineering a user is tricked into pasting malicious code into the editor, which most users would not expect to be able to have bad effects. To stop it being saved on the server I think means that you need not just a stock HTML sanitiser, but one that understands the interactions between Markdown and HTML, *and* doesn't mess things up when users try to post source code listings of HTML."}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "May 22, 2008", "message": "So... if you are pasting a large code block, would you have to go and tab everything at least once for it to be formatted as code?\n\nalso, as you know, color highlights when displaying code is worth it's weight in gold. would the site understand the formatting of languages, or should you go w/ an html editor and allow tools like add-ins for visual studio that when you copy generate all the markup needed to display the code formatted and colored nicely? Or is it just going to be monospaced black on gray code?"}, {"author_name": "Thomas David Baker", "gravatar_hash": "6917fe3946e5d358c5b7d80cec7b629e", "author_url": "http://bluebones.net/", "date": "May 22, 2008", "message": "My very favorite site for this sort of thing is jottit.com\n\nThey use markdown with a javascript interpreter that displays as you type rather like your wmd example.\n\nI think there's is better though.  No idea about license.  It's Aaron Swartz (rss, web.py, reddit, openlibrary) and another dude.\n\n\nThe side-by-side is particularly good."}, {"author_name": "BCS", "gravatar_hash": "6757caf55de0413ae0994293e001d465", "author_url": null, "date": "May 22, 2008", "message": "One thing I would really like to see is for whatever is decided on to get tested on a low bandwidth (dial-up), low speed computer (&lt;&lt;1GHz). I don't think that such a system needs to run \"Really well\" but it should at least run tolerably (pages load in under 20 sec, the JavaScript isn't noticeable on every single click and keystroke, etc.). I have seen pages and they are such a pain to use on limited systems that most people just wont even bother."}, {"author_name": "Brian Brewder", "gravatar_hash": "a00ef268d501a11f698c8cc97156e489", "author_url": "http://www.redwerb.com", "date": "May 22, 2008", "message": "If you choose Markdown, how is the text going to be stored (HTML or Markdown)? If it's stored as HTML, then why not let the user choose which one they want to use? You can default to one or the other, but let them change based on their own preference. I see that Markdown also supports HTML, so perhaps the choice is just what the user decides to type.\n\nOne thing I'm concerned about is that if stackoverflow.com allows people to write articles like Code Project, will Markdown support all the formatting required by an article (tables for data, align an image with text wrapping, etc)?\n\nAs a note, I prefer a full featured WYSIWYG editor with the ability to edit the markup directly if needed. It's a bit arrogant and self-defeating to expect people to have to learn either Markdown or HTML in order to post questions and answers (even if your audience is developers). Also, if stackoverflow.com allows articles, I want to be able to write them in my own editor and upload them to stackoverflow.com. I don't want to have to try to write it in a browser window."}, {"author_name": "Brian Brewder", "gravatar_hash": "a00ef268d501a11f698c8cc97156e489", "author_url": "http://www.redwerb.com", "date": "May 22, 2008", "message": "Me again. I wanted to add that I do think that Markdown is cool and I really liked the Showdown example of Markdown. It's always fun to learn something new (I've been trying to figure out how I can use YAML too :))."}, {"author_name": "[mag]", "gravatar_hash": "fdc0a454fb54b88e01d0bb7396a1f14f", "author_url": null, "date": "May 22, 2008", "message": "Weeble: Good points. I was forgetting that the content will be editable by other users, definitely making this a possible attack vector.\n\nMy suggestion for avoiding problems with this is disallowing mixing in HTML in the first place -- why would we need it anyway? (Nobody should have any problems using MD right off the bat -- practically no learning is necessary)\n\nPure Markdown is safe. (If rendered correctly...)"}, {"author_name": "Matthew Morgan", "gravatar_hash": "fbd3e5cc0b7dd5648f43d49719d2f4a8", "author_url": "http://lithagen.dyndns.org", "date": "May 22, 2008", "message": "I loved the Showdown demo.  It's wonderfully intuitive, easy to read...It just feels like it would be so much nicer than HTML or BBCode or the like.\n\nI never thought I'd be saying that either...I, like most of us, have been using HTML for a long time."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 22, 2008", "message": "@Thomas David Baker thank you for the link to jottit ; there are definitely some similarities to what we're trying to do there.\n\nHowever, I am curious -- why do you think their real time MarkDown preview is better than WMD?"}, {"author_name": "Mark Tiefenbruck", "gravatar_hash": "5022e8f0a0c5572cc979ccb74bbf753f", "author_url": "http://mark.tiefenbruck.org/", "date": "May 22, 2008", "message": "If there's no support for inline html, I will cry. And if you're including the little widgets for choosing bold/italic/etc., there had better be a user setting to make them off by default. My biggest complaint about wordpress (using their server) is having to click on the \"code\" tab every time I write or edit a post."}, {"author_name": "Bob", "gravatar_hash": "a455749d0a38ddf84e9c70c10bac0e61", "author_url": null, "date": "May 22, 2008", "message": "I think Markdown makes some terrible design decisions that lead me having to look up the syntax whenever I use it despite regularly commenting on Reddit for years now. I'd go as far as to say I'd actively avoid posting on any site that uses Markdown. I just find it exceptionally difficult to use.\n\nI find BBCode-style markup the most intuitive by far, even though it's neutered domain-specific HTML. Better neutered HTML with easily picked-up widespread idioms than something that requires use to use a non-intuitive non-widespread language that can get in the way."}, {"author_name": "Drejc", "gravatar_hash": "b054efe2994c057c0ca34ad425ad1a2a", "author_url": "http://www.monex-finance.net", "date": "May 22, 2008", "message": "I have tried to simply copy/paste some code into it. The problem is code contained tab characters and they can not be added by hand input to correct the formating. Some sort of transform/format should happen on a paste action as most users will not type the code in by hand but will copy paste it."}, {"author_name": "PJohnmeyer", "gravatar_hash": "d13c16cb15cd0a22161dcdce9f159d10", "author_url": null, "date": "May 22, 2008", "message": "I like what I see with the WMD/Markdown, Showdown demos.  As a non-web developer (the last time I touched HTML was for a static webpage in 1997), I find the simple mark-up languages far more intuitive.  As a programmer in general, I've never seen a reason to not learn \"one more syntax\" -- it's usually fairly trivial and easy to mentally map to something I already know.\n\nPutting on my UI hat:\n\n* I think a toolbar is a good idea, but let users choose to hide it if they find it a waste of space.  Same with the legend.\n\n* The auto-preview is great, but seeing the two demos made me think -- if it's not too difficult to let the user choose a position as opposed to enforcing one (below versus side-by-side), that would be good.  Many developers have one portrait-oriented monitor that would work better top/bottom, but on a laptop or a second monitor that is landscape-oriented, side-by-side might work better."}, {"author_name": "Joshua Anderson", "gravatar_hash": "bff3b3ce02eed0f64b0e29d73e02c141", "author_url": null, "date": "May 22, 2008", "message": "I personally believe that using a lightweight mark-up language (e.g.: Markdown) is the preferred approach for the following reasons:\n\n1.  All user-generated content will have a consistent look &amp; feel.\n2. It allows for HTML and XML code snippets to be submitted without the parser misunderstanding our intent.\n3. It's hard to misuse languages like markdown; you can't forget to close tags or braces for example (which result in undesired behaviour, even when the form sanitizes your input).\n\nI disagree with the previous comments stating that in-line html is necessary; I believe one of the key strengths of Wikipedia (and other wikis) is in their consistent, minimalist presentation.\n\nAt the end of the day, (imho) people will keep coming back to StackOverflow.com for the content, regardless of whether they can throw some html tags around or not."}, {"author_name": "Bryan", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": null, "date": "May 22, 2008", "message": "Be wysiwyg if at all possible; allow people who must use tags to use html and/or whatever wins the vote.\n\nPreview sucks rocks. Seriously. And by this I mean, forcing people to code up their text answers, hitting preview repeatedly to see how their edits *really* look, is a huge timewaster. Huuuuge! Coders are used to this, but wouldn't you give it up if you could?\n\nDon't make me think.\n\nConsider the person who lacks understanding of whatever tag scheme you use. She'll write out her contribution, discover a bug in her use of tags, scrabble around through docs, find something that seems to work, try it, preview, need to make a change, preview, need to make another change, preview ... ad nauseum. Yuck.\n\nConsider the person making an edit to someone else's post, which has an unfamiliar tag in it. Change/preview/change/preview ... ewww.\n\nConsider a longer post with indented bullets, embedded urls, strikethru and underlining ... pretty soon the mass of markup text looks terrible. Switching back and forth between preview and markup text views ... blah. Your flow is horribly broken as you make edits, check to see what they look like, make edits to fix, change/preview/change/preview ... ewww.\n\nPreview sucks rocks. Go wysiwyg. Let people see what they are doing as they do it. I love wikis, but all arguments against wysiwyg boil down to either laziness or snobbery on the part of the coing team, imho.\n\n(I know, this sounds a bit like a soapboxing rant. But honestly, I am perpetually confused and astounded by those who have a choice to use wysiwyg as the primary interface and consciously turn away from doing so. Think about this - what are the really good reasons to throw away wysiwyg as the default choice?)"}, {"author_name": "Justin Yost", "gravatar_hash": "83149adc0e0366baebe19fcaed5f7996", "author_url": "http://www.yostivanich.com/", "date": "May 22, 2008", "message": "Markdown looks, pretty good for me."}, {"author_name": "Mário Marinato", "gravatar_hash": "218c63deafbad65752fb5ee4a3971dea", "author_url": "http://www.vovoviuarede.blogspot.com", "date": "May 22, 2008", "message": "Both approaches seem interesting to me.\n\nWMD is easier because you don't have to memorize any markup language.  It's just a plain type-and-format text editor, which makes it easy to use.\n\nShowdown &amp; Highlight, having a small yet powerful set of formatting tags, gives the user the ability to create well-formatted docs.\n\nIf it would be something just for me to use, I'd choose Showdown &amp; Highlight, but I shall say that WMD is better to stackOverflow because, with it, even those who do not know any markup tags will be able to create nice-looking documents, which will only miss the code highlighting.  Anyway, to tell you the truth, this feature is a minor necessity.\n\nMário Marinato, from Brazil"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 22, 2008", "message": "> Preview sucks rocks. Go wysiwyg. Let people see what they are doing as they do it. I love wikis, but all arguments against wysiwyg boil down to either laziness or snobbery on the part of the coing team, imho.\n\nDid you try the above links? It is a REAL TIME SIDE BY SIDE preview. There is no switching back and forth, no clicking of any buttons. You type and it happens."}, {"author_name": "kevin", "gravatar_hash": "ad6a3db918199fd3f5664951a69e98de", "author_url": null, "date": "May 22, 2008", "message": "It doesn't matter.  I will learn whatever markup gets chosen.  \n\nUsing HTML probably isn't a good idea."}, {"author_name": "Bryan", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": null, "date": "May 23, 2008", "message": "Ah, ya got me. Didn't try the links. \n\nMy apologies then, I should not have jumped to that conclusion.\n\nThough I still prefer to see what I'm typing where I'm typing it, I guess this is a little better. Hmm .. I did a little transcription of podcast in the wiki, and that was wysiwyg without separate preview window. Why is that not usable?"}, {"author_name": "SpoonMeiser", "gravatar_hash": "9a09b0df40ac0eb9bdebb8702e21eb7e", "author_url": null, "date": "May 23, 2008", "message": "\"Adopting tools like these means we’d be very intimately tied to JavaScript on the client\"\n\nI don't see how, or why it should.\n\nThe live preview will require JavaScript, obviously, and the formatting toolbar will most likely use JavaScript to add markup to the text area, but surely the core functionality will still remain without JavaScript?\n\nSo long as I still have a working text-area and submit button for cases in which I cannot use JavaScript (say, I'm not using a GUI and am visiting using lynx or some such), then I'm happy.\n\nIt would also be nice to provide a preview button for your non-JavaScript users, but not a requirement, I guess."}, {"author_name": "John", "gravatar_hash": "d0b76ae7bf261316683cad31ba0bad91", "author_url": null, "date": "May 23, 2008", "message": "Try and put the following into the wmd editor and it works.\n\n&lt;a href=\"javascript:for(var i=0;iTest</a> \n\nNot sure why you would do this but it shows how mixing html and can allow users sometimes to do Malicious things.\n\nThat said I like a mix of html and markdown as an idea"}, {"author_name": "John", "gravatar_hash": "d0b76ae7bf261316683cad31ba0bad91", "author_url": null, "date": "May 23, 2008", "message": "The blog understandably blocked the javascript but in essence it just looped and  showed a message box 10 times."}, {"author_name": "Brock", "gravatar_hash": "c036b6d8eada38fc63a80766e3bc2a4d", "author_url": "http://www.brockli.com", "date": "May 23, 2008", "message": "Sounds great!  I've become a Markdown convert pretty recently, and a real-time preview will be nice to have."}, {"author_name": "Paul", "gravatar_hash": "e689f710ca901a0665a5e0f459d28a42", "author_url": null, "date": "May 23, 2008", "message": "Don't make me learn another markup language! Bad enough I have to devote far too large a portion of my brain to remembering MediaWiki markup. I'm not about to screw up that tenuous understanding by trying to accommodate some almost-sorta-like-MediaWiki-except-not-really syntax at the same time. Requiring Markdown on a site like this is pretty much a deal-breaker for me, unless it's accompanied by a markup toolbar (ideally WYSIWYG, so I don't ever even have to look at the goofy markup syntax).\n\nThe de facto standard that's evolved for marking up text input on the Web--half a dozen or so standard HTML tags; two CRs means a paragraph break; maybe some kind of simplified replacement for the admittedly nonintuitive list tags; preprocess everything so it's not dangerous--has worked just fine for years and there are surely hundreds of standard and open source solutions that have completely solved the problem. Even for people who don't use HTML regularly, I really don't see what's so difficult about remembering that &lt;b&gt; makes something bold, and &lt;/b&gt; makes something stop being bold."}, {"author_name": "Wally", "gravatar_hash": "fd4e003e20544d5700cdfb78c97690b7", "author_url": null, "date": "May 23, 2008", "message": "\"Adopting tools like these means we’d be very intimately tied to JavaScript on the client, of course, but it’s hard for me to see how that’s a problem on today’s web.\"\n\nWow, insightful stuff."}, {"author_name": "Javier", "gravatar_hash": "21200aef2bc4284e63434abea7aed4fd", "author_url": "https://twitter.com/flupkear", "date": "May 24, 2008", "message": "\"it is important that you override the default browser setting for the Tab key - I want to use Tab to indent\"\n\nI definitely agree with this opinion, currently I have to indent each line with four spaces or copy-paste the code from a text editor, if you can make the tab key to work like in a desktop text editor it will be super"}, {"author_name": "Merus", "gravatar_hash": "b7e35651f25986c1c6f61ffca814b640", "author_url": null, "date": "May 26, 2008", "message": "Markdown's a good choice - I'm stunned by how close it is to the old Usenet ways of signifying formatting compared to something like MediaWiki. I like allowing Markdown and whitelisted, sanitised HTML with the WYSIWYG editor - makes the whole thing nice and discoverable, and means that people who can't remember the markup can tool around trying to remember it, give up, and use HTML instead.\n\nI agree that you can probably get away from JavaScript if you wanted to, mostly to satisfy the NoScript types. I do disagree with the commentators that suggest it's more trouble than it's worth to allow HTML, because if you're going to have a HTML whitelist you're more or less doing BBCode with angle brackets, aren't you?"}, {"author_name": "Ian Anderson", "gravatar_hash": "60b1c7dc18e08e1a16f313354814744f", "author_url": "http://thefirstpost.co.uk", "date": "May 26, 2008", "message": "+1 for Markdown over alternative options. \n\nWe use it in our developer documentation because, as it says in its own documentation, it makes it easy to write about HTML"}, {"author_name": "Peter Hilton", "gravatar_hash": "a25bc838c4f925ef3c1cc47d3e96c264", "author_url": "http://www.lunatech-research.com/", "date": "May 26, 2008", "message": "Use Markdown, but make sure you have the option to add customisations in general, and auto-linking in particular, for things like @username or question IDs."}, {"author_name": "Pete", "gravatar_hash": "d5a15a6528130cd78f35d71c34a9c6e0", "author_url": null, "date": "May 27, 2008", "message": "It should be WYSIWYG.  Why show markup (you should have an option to view it if you need to but not have to edit in it)?  Editing should be easy and flexible and I agree that editing source is the most flexible option but with a reasonable WYSIWYG HTML editor you still have this option.  It doesn't matter that most or maybe all people posting to the site understand markup and can edit it.  We could write the binary representation of all individual unicode characters down using a custom XML encoding instead - but it's less efficent.\n\nhttp://www.fckeditor.net looks like a good JavaScript WYSIWYG editors you could integrate in the site.\n\nPete"}, {"author_name": "Konrad", "gravatar_hash": "f9401202ab73e624cc82800b0fff1489", "author_url": "http://madrat.net/", "date": "May 27, 2008", "message": "The examples look good although I don't care for the live preview. Markdown (or similar) is sufficiently simple to make this unnecessary (IMHO).\n\nHowever, I would deliberately prune the number of different usable elements. As far as I see it, a user should never need more than, say, paragraphs, block-quotes, lists, links, code and images (and some inline formattings). Which, of course, makes HTML completely unnecessary or even harmful."}, {"author_name": "Terrapin", "gravatar_hash": "6b89ab6fe40aeae63df5509238078bcb", "author_url": null, "date": "May 27, 2008", "message": "The preview is a must-have, regardless of markup language. The nice thing about Markdown (or other wiki-style markup langs) is the implicit disambiguation of HTML code snippets.\n\nThat said, I still cast my vote for HTML. But is there a reason you can't offer the best of all worlds? Why not offer HTML weenies an HTML editor, Wiki language weenies a wiki-style markup language editor, and everyone else a WYSIWYG?\n\nOh yeah, and how-bout intellisense? :)"}, {"author_name": "Stephen R.", "gravatar_hash": "a4ae47070c4c3695a4aee72a81eb490b", "author_url": null, "date": "May 27, 2008", "message": "I'd prefer to go with Markdown.  Using HTML is similar to the XML vs every-thing-else debate. HTML is fine for fine grained web development, but here, I want to be able to express N lines of code very simply."}, {"author_name": "Steve-O", "gravatar_hash": "20cce6f112c9d22316bf85d28126305b", "author_url": null, "date": "May 28, 2008", "message": "So that you're aware Jeff: the logo (top right) has 1/4 of the w cut off in opera."}, {"author_name": "Chris Miller", "gravatar_hash": "6c1893fde24216f38dc87dd9efb5d905", "author_url": "http://anotherlab.rajapet.net", "date": "May 29, 2008", "message": "I would prefer Markdown as it would require the least amount of thinking to post bits of source code and keep some level of reasonable formatting.  Ultimately HTML would provide the most amount of code, but if Markdown provides good enough results, it would save time."}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "May 31, 2008", "message": "Markdown, hells yeah. I know HTML better than I know Markdown, but it’s so much more typing, so much more potential for mistakes, and I have to escape angle brackets, and whatnot. It’s not like I’ll be in Textmate with its HTML shortcut keys. I’ll be in a web browser text field, typing each fricking angle bracket by hand.\n\nThe real-time, side-by-side preview (as long as the performance doesn’t suck too much) is winning. I reckon it’ll sort out the haters’ objections to Markdown in about 30 seconds."}, {"author_name": "David Nelson", "gravatar_hash": "67361465cdc7e679bf25ecf3176f06a1", "author_url": "http://www.commongenius.com", "date": "Jun 09, 2008", "message": "1) I would probably use HTML if it were available. Don't know Markdown and don't care to.\n\n2) I would prefer a toolbar over text tags, IF it works reliably and similarly to toolbar functions found in popular applications.\n\n3) I couldn't care less about real-time preview."}, {"author_name": "Dan", "gravatar_hash": "4141334a95e4efb5dc30a6910aca692f", "author_url": null, "date": "Jun 10, 2008", "message": "Client side Javascript dependencies are very fragile from platform to platform.\n\nEspecially if you're trying to make your website compatible with mobile browsers and desktops without branching to a mobile-specific website.\n\nClient-side javascript takes a major dive on these platforms."}, {"author_name": "Graham Stewart", "gravatar_hash": "f61876d1f1d2de794259119cdd596316", "author_url": null, "date": "Jun 12, 2008", "message": "My main objection to Markdown is that it doesn't allow me to specify WHICH language I am using in a code block.\nSo that nifty little highlight.js is left to guess the language. I'm sure it does a reasonable job but even with the very best heuristics it is bound to screw up occasionally. (Play with it in the preview and you'll see that the highlighting is very flaky on short code blocks)\nBy contrast, if you allow us to specify the language as part of the markup then the highlighting will always be appropriate for the language and you will be free to switch to a different/better highlighting method in the future.\nAlso according to the linked site, highlight.js doesn't support C or C# - I thought this was going to a programming site?"}, {"author_name": "Grahame", "gravatar_hash": "92b4f617dea2300cc2e3a6cc5740f5a8", "author_url": null, "date": "Jun 22, 2008", "message": "Do I have to learn another markup (or down) language?  I'm happy with HTML.  I use it all the time, I can indent, I can mark code with a \"pre\" tag.  I really don't want to have to learn another way of marking up.\n\nIf this is a site for developers then I would imagine most of us will know HTML and how to format our posts using it.  I don't think we need another method."}, {"author_name": "Lasse V. Karlsen", "gravatar_hash": "1b11262da6d1cd26b1b0bc99a2620cee", "author_url": null, "date": "Jun 25, 2008", "message": "My main gripe about html-compatible forums is that they tend to interpret the angle brackets really on a boolean scale. I've seen plenty of generic code in the C# and .NET forums on the MSDN website that has their descriptions mangled simply because the forum software doesn't see Class any different than <b>Class</b>.\n\nI assume you wouldn't implement something that had those bugs, but if I have to choose between being able to type source code without changes and formatted text without changes, I'd go with the source code favoring approach."}, {"author_name": "Lasse V. Karlsen", "gravatar_hash": "1b11262da6d1cd26b1b0bc99a2620cee", "author_url": null, "date": "Jun 25, 2008", "message": "And yes, being able to specify language for syntax coloring, if you're going to have that, is a must.\n\nAlso, if you guys go with \"show line numbers for source code blocks\" options, please make sure they're in a div of their own or something, it's so tedious having to edit away line number columns from code I copy off of badly made forums."}, {"author_name": "Lasse V. Karlsen", "gravatar_hash": "1b11262da6d1cd26b1b0bc99a2620cee", "author_url": null, "date": "Jun 25, 2008", "message": "Sorry for posting so many individual posts, but things come to my mind as I click submit, short of like others saying they think best when they shower... or something.\n\nAnyway, what having a system like either HTML or MarkDown would give you, compared to using a toolbar and just plain wysiwg style, is that you would basically add some kind of barrier to entry for this forum.\n\nPeople would literally have to learn a new syntax system, just for this forum. I'd easily see some people trying to post, seeing that the preview doesn't match their text at all (a misplaced or missing bracket for instance), and just say \"meh, I'll go post on msdn instead\".\n\nNow, the question is, is that a good thing? I've heard others that favor forums and bulletin boards that have that kind of barrier to entry saying that if you don't care enough about your question to really post *where* it matters, why should we care to answer it or help you with it?\n\nI don't really have the answer to this, just something to think about."}, {"author_name": "Graham Stewart", "gravatar_hash": "f61876d1f1d2de794259119cdd596316", "author_url": null, "date": "Jun 25, 2008", "message": "@Lasse:\n\nIf we're going to have a \"barrier to entry\" then I think it should be something more useful than \"make the interface so annoying that you have to really really WANT to make your post\""}, {"author_name": "Lasse V. Karlsen", "gravatar_hash": "1b11262da6d1cd26b1b0bc99a2620cee", "author_url": null, "date": "Jun 26, 2008", "message": "I agree, but judging from the podcast 11 keyword list it looks like they've decided to use MarkDown as the syntax so I assume they either know how or have taken steps to mitigate this.\n\nA formatting toolbar is of course a nice way to go, and if the syntax is slight enough to not get in your way, I don't think it will be a problem."}, {"author_name": "DS MEDIA", "gravatar_hash": "ad43b9e123ed3b8ff5b5cacd46aaf067", "author_url": "http://www.dsmediavideo.com.au", "date": "Apr 01, 2011", "message": "Thanks!) good site.."}]}