{"response": [{"author_name": "janm", "gravatar_hash": "40853ee016c1f1b05c32c63054c55762", "author_url": null, "date": "May 18, 2008", "message": "9.0.115.0 is also buggy and can allow attackers to take control of your machine:\n\nhttp://www.adobe.com/support/security/bulletins/apsb08-11.html\n\nYou might want to upgrade to 9.0.124.0\n\nFun, fun, fun."}, {"author_name": "Zarate", "gravatar_hash": "9ffffa3c750ef8fb1f7514f7d0d98dfd", "author_url": "http://zarate.tv", "date": "May 18, 2008", "message": "Hi there!\n\nLatest official player is 9.0.124 (player 10 is in alpha atm in Adobe labs) and you can also easily your player version at... http://playerversion.com : )\n\nCheers!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "e9da1ed3cdab00371ed1c2ff4520907c", "author_url": "http://www.stackoverflow.com/", "date": "May 19, 2008", "message": "Thanks -- I could have sworn I just updated Flash a few weeks ago! Now I'm at 9.0.124.0.\n\nZarate, that page says \"The latest Flash Player version is 9,0,115,0\" which I thought was funny. They must really be cranking out the bugfixes.. :)"}, {"author_name": "Andreas Nilsson", "gravatar_hash": "864207693e04f0d07b2ef08185e5f6ae", "author_url": null, "date": "May 19, 2008", "message": "How about practicing platform neutral computing to? Flash isn't really that available :(\n\nPlease send Adobe a message and boycott Flash untill they release for some more platforms..."}, {"author_name": "alto maltés", "gravatar_hash": "49653b4d686c57ff6c68dc19f709356f", "author_url": null, "date": "May 19, 2008", "message": "Don’t ask me why, but I read it somewhere, and it solved the problem for me: sampling the audio at some multiple of 11025Hz usually solves the Flash “chipmunk” problem."}, {"author_name": "Jason Sheneman", "gravatar_hash": "9f8cf7987b196ebb1fc49d3093c40b5c", "author_url": null, "date": "May 19, 2008", "message": "I haven't updated in a while due to several issues.  For me the chipmunk audio in RSS feeds started with 9.0.48 (47 does not exhibit this problem).  Also starting with version 48 all flash video would freeze after 3 seconds in firefox (well documented problem on Mozilla and Adobe's boards).  I will try the latest and see if the bugs are fixed.  If not it's back to oldapps. com and grabbing 47 again."}, {"author_name": "Matthew Morgan", "gravatar_hash": "fbd3e5cc0b7dd5648f43d49719d2f4a8", "author_url": null, "date": "May 19, 2008", "message": "In response to Andreas Nilsson:\n\nSearch google for the Adobe Open Screen Project, or just read this article.\n\nhttp://www.highlander.co.uk/adobe-open-screen-project-open-specifications-and-open-technology-help-expand-flash-player-reach"}, {"author_name": "brian", "gravatar_hash": "7eb788f6132eac5f7b8ca5b43924ad42", "author_url": null, "date": "May 19, 2008", "message": "9 critical security vulnerabilities, isn't that more than Vista had all year in 2007?"}, {"author_name": "mg", "gravatar_hash": "4bfe391beb37f5869b0b409d947c7bd2", "author_url": null, "date": "May 19, 2008", "message": "This is the wrong place to say this, but your blog's layout is broken in Firefox 3.0 beta on OSX 10.5.2.\n\nThe sidebar doesn't have enough room and it's at the bottom of the page."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 20, 2008", "message": "Weird, looks fine in Firefox 3.0 RC1 on Windows, and it looked fine in beta 5 as well."}, {"author_name": "Peter Turner", "gravatar_hash": "edfa1f5a3274d9d6faa2035e6cd32077", "author_url": null, "date": "May 20, 2008", "message": "You can use the detection kit provided by Adobe to make sure a worthy version is installed. \n\nhttp://www.adobe.com/products/flashplayer/download/detection_kit/\n\nIt would be really cool if this website became THE place to go for all those hints I look for on Google when trying to program some DOM COM thing.\n\nI might even click on the ads!"}, {"author_name": "Andy", "gravatar_hash": "0dbdbc5a1431f9f3abad14d37e64580a", "author_url": null, "date": "May 20, 2008", "message": "What alto said is on the right path:  I had the chipmunk problem on our family website and thought I had figured out that people who had the problem needed to update their Flash version but then for one machine the latest Flash ver. didn't fix it either and I found a couple spots online mentioning how you encode/sample could still cause it.  I think the defaults in Audacity gave me the problem.  Don't remember if this is the page that got me fixed but it looks like it has everything:\n\"The problem is that Flash Player only supports two sampling rates: 22,050 samples per second, and 44,100 samples per second. And at low bitrates, Audacity likes to create MP3 files with lots of different sampling rates, such as 16,000 or 32,000 samples per second.\n\nSo, what's the solution? Currently the best fix is to convert your audio files to MP3s manually, using the command line version of the LAME MP3 encoder.\"\n\nhttp://www.boutell.com/newfaq/creating/chipmunk.html"}, {"author_name": "Brad", "gravatar_hash": "a733ce6210c28924181fadd757810335", "author_url": null, "date": "May 20, 2008", "message": "Jeff, take a look at http://blog.deconcept.com/swfobject/ \n\nIt allows you to specify a minimum compatible flash version and handles all of the \"update your flash player\" stuff for you. Plus you won't need to make these kind of posts again :D"}, {"author_name": "Jeffrey", "gravatar_hash": "2886583fab3929c95a68e339e73d61d8", "author_url": null, "date": "May 20, 2008", "message": "I'll second the Flash player issue with odd sampling rates. At work, we regularly deliver audio in Flash and when we switched to a lower bitrate, we had \"chipmunk\" sounds.\n\nIn our case, it turned out that there are a number of common pro audio editors that will default to non-compatible sampling rates when you get into bitrates &lt; 64 Kbps. So the files that we were getting from the sound engineers were playing funny.\n\nRunning them through LAME or Sorenson Squeeze (which is meant for video but will batch encode for MP3, etc.) fixed the problem."}]}