{"response": [{"author_name": "Martin B", "gravatar_hash": "ee6269873148eeaf5a1cfba501d6eae1", "author_url": null, "date": "May 22, 2012", "message": "Just to clarify, should either the question or answer (or both) be marked as community wiki? Or are you leaving that up to the individual poster? (I'm asking because this question has caused some contention in the past...)"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "May 22, 2012", "message": "@Martin:\n\nYou can mark the <i>answer</i> Community Wiki if your intention is to create <a href=\"http://blog.stackoverflow.com/2011/08/the-future-of-community-wiki/\" rel=\"nofollow\">something others contribute</a> to. Whether or not you do is up to you, and what your goals are for the post. As always, if several other people contribute to the answer it will become Community Wiki automatically."}, {"author_name": "Isaac", "gravatar_hash": "2bb572e05887045b95d99d8a5819eb14", "author_url": "http://judaism.stackexchange.com", "date": "May 22, 2012", "message": "http://meta.judaism.stackexchange.com/a/307/2\nhttp://meta.judaism.stackexchange.com/a/140/2\n\nI strongly feel that if we're publishing stuff in Q&amp;A format, it's very important to make sure that both the question and the answer are well-written. That means, IMO, that the question needs to be written from the point-of-view of genuine curiosity, even if that curiosity doesn't actually exist in the author's head [anymore]. Otherwise, you end up with \"questions\" that are really just placeholders to set up the answer, and you've lost the value of the Q&amp;A format, which is that people who have a similar question are more likely to find what they are looking for."}, {"author_name": "Andreas", "gravatar_hash": "70bd6b8a31d09e46e99c7efb5fc814e6", "author_url": null, "date": "May 22, 2012", "message": "you get to keep the reputation you earn, and you’ll get a lot more eyeballs than you can get on your blog..\n\n...\n\n...\n\nand all the advertising goes to stack exchange!"}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "May 22, 2012", "message": "About time. But I suspect the problem of the lacking blog aspect in SE isn't because a checkbox is missing. I hope this helps, but I doubt it will. The problem is with the community. It's just not tolerant enough of anything that strays even a bit from the formula \"I have this specific problem in real life that I cannot solve\" -&gt; \"here's how you do it\". That's why there was so much resistance to meta. And then to discussing programming as a career. And then poll questions, which are immensely popular, yet get closed right and left. And, of course, for blog-post style questions, where someone just want to share a well written piece of knowledge. Too many influential community members works too hard to discourage these activities, calling them rep-whoring or off-topic, regardless of how easy it is to actually ignore the types of posts that you don't care for. I don't see a good reason why this should change any time soon - the site is inherently non-democratic. Meritocracy was baked into the design, but it has evolved into an aristocracy that consistently resists change."}, {"author_name": "keng", "gravatar_hash": "15769bbea999aee421458f52e7c9d011", "author_url": null, "date": "May 22, 2012", "message": "oh....I seem to remember in the past when you asked this very thing...answer your own questions...10 pts a question for an upvote, 10 points per for the answer...I remember that...sort of a \"Hey, help us out by posting questions you already know the answer to and answer them.\"...yeah, i remember that....I also remember when i lost over 500 points because of it too (which dropped me well below 3,000 and made me loose the very privilages i strove to get 3,000 for)....yeah...so, in a year or so, you'll probably re-evaluate and drop the 'questions that were answered by the same user' to 2 rather than 5 points cuz it unbalances the system and makes ranking less meaningful....not sure what to think of this...just sounds....familiar...."}, {"author_name": "Derek", "gravatar_hash": "9227ac7d54e73cbf01f28c4bd95b71dc", "author_url": null, "date": "May 22, 2012", "message": "&gt; it’s also a place where you can publish things that you’ve learned: recipes, FAQs, HOWTOs, walkthroughs, and even bits of product documentation, as long you format it as a question and answer.\n\nAnd then an overzealous mod can come along and close it as \"not a real question\".\n\nSO is falling prey to deletionism, and I think it's bad for the community.  Despite all the talk about how SO should be the repository of high-quality questions and answers, it seems like a lot of very high-quality discussions get closed as \"not a real question\" or \"not constructive\"."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "May 22, 2012", "message": "Derek said,\n\n&gt; ...it seems like a lot of very high-quality discussions get closed as “not a real question” or “not constructive”.\n\nIf it meets all the criteria in the <a href=\"http://stackoverflow.com/faq\" rel=\"nofollow\">FAQ</a>, it should be fine.  Note that the blog post does explicitly say \"as long you format it as a question and answer.\"  If it's a discussion you're looking for, this might just be the wrong place to look."}, {"author_name": "keng", "gravatar_hash": "15769bbea999aee421458f52e7c9d011", "author_url": null, "date": "May 22, 2012", "message": "\"If it’s a discussion you’re looking for, this might just be the wrong place to look.\"\n\nAnd HOW!!!  Unfortunately other venues are less useful/constructive/thoughtful."}, {"author_name": "JOhnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "May 22, 2012", "message": "Any more chores for us when we're done with this?"}, {"author_name": "James Mortensen", "gravatar_hash": "af668818d6cfecc1a1b008cf599562cd", "author_url": "http://www.loopto.do", "date": "May 22, 2012", "message": "\"And HOW!!! Unfortunately other venues are less useful/constructive/thoughtful.\"\n\nThe reason this venue is so constructive is because we try really hard from keeping it from divulging into discussions. With that said, maybe someone can solve the discussion problem in a new creative way,outside of StackExchange, where it wouldn't kill an already-very-successful experiment."}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "May 22, 2012", "message": "Why blog here where I can't control things? Any moderator can delete or rewrite my post.. No thanks. This is just unfeasible."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "May 22, 2012", "message": "This doesn't take the system closer to more canonical questions and answers, though. The UI improvements to the \"vote to close\" dialog were a big step forward, but there still isn't enough incentive to seriously identify dupes, and look for good canonical questions."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "May 22, 2012", "message": "@Andrei well, total power over your own content is what you give up. True. If you're not prepared to accept that, you need to keep publishing things on your own blog, and that's fine.\n\nBut consider what using SO for publishing your knowledge can get you in return - peers who can correct you, loads of viewers, and feedback if things change. I'm pretty sure that's not a bad deal for many."}, {"author_name": "Neil Feinq", "gravatar_hash": "a3988c74befe682a08e8461f005106df", "author_url": "http://magnificentnose.com", "date": "May 22, 2012", "message": "&gt; it seems like a lot of very high-quality discussions get closed as “not a real question” or “not constructive”.\n\nThat's because Stack Exchange isn't for discussions, it's for questions. Any \"question\" looking that's really a forum-style post in disguise looking to start a discussion should be closed, quickly and firmly. Forum instincts do not work here."}, {"author_name": "zanlok", "gravatar_hash": "86ade11f23b27bf3c6d9264f30ed26d2", "author_url": null, "date": "May 22, 2012", "message": "@Assaf spot on my observation. But, I like what SE is doing here. It's good for them, it's good for us users, and it's good for the universe, as it were."}, {"author_name": "Refund", "gravatar_hash": "9ab0d92ab5957bbaaa43aff3c95d95ba", "author_url": null, "date": "May 23, 2012", "message": "The problem is mostly that very good answers, for a question that has been asked again and again, is in no way more visible than the other answers to the question asked again and again.\n\nIf the question gets asked more, the number of answers increases. The one very good answer is then surrounded by more answers -&gt; less visibility."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "May 23, 2012", "message": "Refund,\n\nWe try to make the best answers to those \"again and again\" questions more visible by closing the questions as duplicates that all link back to the canonical answer.  (I say we <i>try</i> because I know we're not there yet.  We still close a lot of questions as duplicates every day.)  You can help by voting to close duplicate questions, or by flagging for a moderator and telling us which question has a great, canonical answer to a question that's often repeated."}, {"author_name": "AlejoBrz", "gravatar_hash": "63ad587e48bcfba61a43950ddbc47d61", "author_url": null, "date": "May 23, 2012", "message": "There's also a problem with poeple who don't like someone responding to his/her own question. I've answered my own questions twice (after more investigation or trial and error) and always got downvoted (perhaps by people who answered my question but just wasn't what I needed, I don't know and I don't care)."}, {"author_name": "Dima", "gravatar_hash": "695f6fccfcfabd7c2d61ad9bbfe8a559", "author_url": "http://SO.com", "date": "May 23, 2012", "message": "I'll second what Derek and others have said. Until SE curbs the moderator abuse where perfectly good questions get summarily closed deleted by a moderator without any regard to the community opinion (sometimes before META discussions, sometimes contrary to META discussions), there's no point. And no, I'm not talking about questions that are clearly \"discussion\" or \"subjective\"."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "May 23, 2012", "message": "To summarize the sentiment, the aggressive moderating strategy has alienated a lot of the users who might otherwise have been inclined to blog on the SE sites.  I think there's two problems:\n\n1. SE has made it clear they are not interested in hosting the type of content we are interested in providing / reading.\n\n2. We are not willing to invest time and effort into crafting a post for an SE site, only to see it quickly closed / deleted / edited beyond recognition, often with a dismissive tag like \"not a real question\" and then referred to in meta discussions and junk that's making the internet worse.\n\nI don't know if this problem is visible, because many of the alienated users likely just quietly stop participating, rather than just ranting on Meta, etc., about the crap content, users who can't be bothered to read the FAQ, bikeshed questions, etc.\n\nBut if you're going to the well of the SO community for blog-like content, you may find it drier than you anticipated."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "May 23, 2012", "message": "Nooo, aggressive meta police alienating SO users? Never, who'd have thought it!\n\nIt's been discussed before. I believe all the Meta users agreed that it wasn't a real problem. ;)"}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "May 23, 2012", "message": "As for why this particularly applies to this request, I think some people frustrated with the SO community may still contribute answers because they do get satisfaction by providing help to someone who needs it, and it doesn't require the initiative of coming up with something to write about.\n\nThis request eliminates both of these (at least immediately).  Nobody has asked for this specific content, and the contributors must write about it from their own initiative.\n\nThis doesn't mean it's doomed.  Wikipedia is still thriving, in spite of similar problems on a larger scale(as Jeff tweeted: http://wikipediocracy.com/2012/05/16/female-editors-growing-scarce-at-wikipedia/).\n\nIt's just that my response to this post is not to head home and dream about what questions I can post and answer, and I suspect I'm not alone."}, {"author_name": "Steve314", "gravatar_hash": "ade0b0ec5fe1605809cac9f495e6d893", "author_url": null, "date": "May 23, 2012", "message": "I'd quite like a formal way to say \"I'm asking this question so I can answer it\" as I post the question. If I do this, I should get time to post an answer before anyone else sees the question. And once my answer is posted, the question should automatically get an unobtrustive link to it.\n\nOne reason - it's pretty discouraging when you've posted that carefully thought out answer to your own question to find thirty short missing-the-point answers already there collecting upvotes.\n\nAnother reason - people spending time working out answers that I don't need is a bit pointless. If they think my answer is wrong, fine, but it makes no sense for people to spend time posting a possibly incomplete version of what I'm already about to post myself.\n\nMain reason - I don't like looking as if I don't know the answer when I do."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": "http://hermeneutics.stackexchange.com/users/68/jon-ericson", "date": "May 23, 2012", "message": "Steve314: I think the feature pretty much does what you want: when you check the box, you get an answer box added to the question.  The question and the answer are posted at (roughly?) the same time.  Here's my test: http://hermeneutics.stackexchange.com/q/1765/68\n\nPersonally, this seems a godsend for many of the same reasons you suggest.  This one change won't singlehandedly change the SO culture, but it's a step in the right direction.\n\n[I'm impatiently waiting for this: http://meta.stackoverflow.com/a/121145/1438 to occur.  I lost the first (and second) draft of this comment to the ether between my computer and the blog.]"}, {"author_name": "Derek", "gravatar_hash": "9227ac7d54e73cbf01f28c4bd95b71dc", "author_url": null, "date": "May 29, 2012", "message": "Bill the Lizard:\n\n&gt; If it meets all the criteria in the FAQ, it should be fine. Note that the blog post does explicitly say “as long you format it as a question and answer.” If it’s a discussion you’re looking for, this might just be the wrong place to look.\n\nI'm going to have to disagree with you.  Non-trivial questions have non-trivial answers, and that means discussion.  If SO's goal is to just be the repository for shallow questions that newcomers ask, then okay, but I've never seen that expressed as the goal.\n\nFor example:  http://stackoverflow.com/questions/383402/is-javascript-s-new-keyword-considered-harmful\n\nThis is a legitimate question that you closed as \"not constructive\".\n\nThe question that covers \"software tools commonly used by programmers\" and \"practical, answerable problems that are unique to the programming profession\".  It's \"reasonably scoped\" (a single keyword in a single language), and the motivation was clearly \"I would like others to explain ______ to me\".\n\nYes, the question invites discussion.  That's what interesting questions do."}, {"author_name": "Rob Johnson", "gravatar_hash": "9126f641dac97b90fefca668c241b6f2", "author_url": null, "date": "May 29, 2012", "message": "To invite discussion, Statements or Questions should both be allowable entry points.\nI don't believe this is a meritocracy issue.  \nYou simply have a mobius-strip rule set with 2 possible outcomes: continue the loop or fall from the edge.\n\nDo coconuts migrate? \n\t(context Monty Python, funny but non-constructive, unless the goal is to be funny)\nDo coconuts migrate? \n\t(context child in school, legitimate ambiguous;\n\tin fact they do, and it is true that they are found in places \n\tfar away from their origin; however, the coconuts don't motivate themselves)\nAn assumptive statement to answer might be “No, they are shipped or carried by the ocean”\nIs my statement correct? Depends.\n\nMost statements contain  implicit questions:\nFact, variable interpretation, or just wrong?\nTrue, false, unknown?\nA statement that is both TRUE and FACT is absolute.\nAn absolute statement still begs the question of “so what?”\n\nAn absolute question defines the context within the question. (X+Y=Z)\nA question without context is ambiguous.  \nTrivial? Depends on the context.\nIt is proper and necessary to label or qualify the nature of the question.\n\n“Constructive discussion” isn't defined by activity or volume; \ndoes the discussion resolve a problem set or simply arrive at an answer to “so what?”\nBoth outcomes should be considered “Constructive”. \n\nSUMMARY:  If your goal is to encourage Constructive Discussion both Statements and Questions as allowable entry points should be considered.  Encourage Assertions and rebuttals.\n\nGeorge Bernard Shaw \"The single biggest problem in communication is the illusion that it has taken place.\""}, {"author_name": "Vinnie", "gravatar_hash": "83c468c64733d94d0e334bb02e95f8bd", "author_url": null, "date": "May 30, 2012", "message": "I agree with what @Derek, @Andrei Rinea, and others have said - why would I take the time to carefully craft a question or answer in this forum, only to have it deleted by overzealous moderation - if not immediately, then maybe in a year or two when the scope of what's deemed an acceptable question or answer for SO content changes.  No thanks.  I'll post these to my own blog.  Google will still find these resources when people have questions in much the same way they would find the StackOverflow content.\n\nTo @Pekka's comment \"total power over your own content is what you give up. True. If you’re not prepared to accept that, you need to keep publishing things on your own blog, and that’s fine.\n\nBut consider what using SO for publishing your knowledge can get you in return – peers who can correct you, loads of viewers, and feedback if things change. I’m pretty sure that’s not a bad deal for many.\"\n\nIt's not total power that we're talking about here - it's the freedom to post on programming topics that we feel might help other programmers.  Blogs still have feedback mechanisms through comments - so that's a non-issue.  I'm guessing I'm not alone, but I don't see the benefit in giving up my freedom to post on the programming topics that I see fit (without the permission of others) - despite the additional eyeballs that SO might bring."}, {"author_name": "Jonathan Leffler", "gravatar_hash": "7d0d66b076e3bc70819e50f8a25af8df", "author_url": "http://what'sawebsite?", "date": "May 30, 2012", "message": "I found today that one of my 'proto-canonical' answers had been deleted; it took me a dickens of a time to find it because it didn't occur to me that my answer might have been deleted because the question wasn't written in a stellar manner (back in 2009).  Actually, it was fortuitous I found it at all; I'd left a link to it in an as-yet-undeleted comment to an as-yet-undeleted answer to an as-yet-undeleted question.  So, I've resuscitated my answer by wholesale copy (with trivial amendments/updates) into a new answer to a new question where it is appropriate content (and the questioner was pleasantly surprised by the amount of answer they got), but the question is not wholly stellar.  So I expect I'll have to repeat the process again in a year or two (or maybe quicker than that).\n\nThe incentive patterns are wrong for encyclopædic answers, I think.  I don't know what would make for encyclopædic answers, but I don't think the 'Self-Learner' badge is sufficient.  (I've never been the slightest bit tempted to submit a question just to write an encylopædic answer to it.)"}, {"author_name": "Shog9", "gravatar_hash": "a0161feded4a20b2636f9a0177738316", "author_url": null, "date": "Jun 01, 2012", "message": "By way of reply to the various folks stressing about their self-answers getting deleted...\n\nWhen you post on SO, you're submitting your words to a large, and rather nebulous editorial board. That's good, in a way - the fact is, honest evaluations on personal blogs are hard to come by. But it does mean that your submission <i>may</i> be rejected.\n\nIt also means it may be critiqued, improved, and linked to far and wide. \n\nWhether or not you want to submit to that is up to you. IMHO, it's never been Stack Overflow's / Stack Exchange's place to tell you what you should post, or where you should post it. The beauty of that CC-SA license is that if you want to take something you've had languishing on your personal blog and open it up to a wider audience, you're free to do so without fear that SE is gonna claim sole ownership of it or come after you for trying to disseminate stuff that <i>you worked hard on</i> - we're a venue, nothing more, and if you want to perform here, you're free to do so as long as the audience is willing to listen. \n\nIt takes some guts to stand up in front of an audience like that on Stack Overflow and present your work. Even metaphorically. Personally, I don't hold it against <i>anyone</i> if that scares them a bit. But speaking personally, the rewards are clear - so if you're up to it, the doors are open."}, {"author_name": "Blazemonger", "gravatar_hash": "1308dab3c55b1cff0fc9ab4840c87649", "author_url": null, "date": "Jun 19, 2012", "message": "We are now developing a pattern of users posting questions that are badly written, posting their own answers immediately, and letting other SO users waste time helping answer questions that don't need them. This needs to stop. It is already discouraging me from helping the community at all, because I no longer know if any particular question actually needs my help. Case in point: http://stackoverflow.com/questions/11103967/jquery-has-check-for-images-then-apply-css"}, {"author_name": "geoffery", "gravatar_hash": "68962809161552b3c62ad329480ffa3b", "author_url": "http://www.golfclubonsale.com/", "date": "Jun 27, 2012", "message": "Case in point；http://www.golfclubonsale.com/taylormade-rocketballz-rbz-fairway-wood-p-66.html"}, {"author_name": "Amila", "gravatar_hash": "94385873abacbe67cc3f34f7f62041eb", "author_url": "http://amilagm.com", "date": "Jun 28, 2012", "message": "Although the idea of encyclopedia SE is sounds great, it's not really intuitive to post a question and answer it for the sake of documenting it in public. \n\nAnd it is NOT nice when someone else changes the answer you posted, for the purpose of finding later. \n\nAs a place to document things for the sake of finding it later, I think http://tipila.com is a better place than SE."}, {"author_name": "Eric", "gravatar_hash": "fd31ec80478a31167be81b9e81add45c", "author_url": null, "date": "Jul 03, 2012", "message": "Encyclopedia SE? I've seen so many questions with useful, informative answers deleted on SO, this idea is laughable. Joel, you are out of touch."}, {"author_name": "Mel", "gravatar_hash": "9fdc77218d2009a399b5adb2c5473e37", "author_url": null, "date": "Jul 04, 2012", "message": "@Eirc +1 !\n\nThis is more like:\nhttp://www.killerstartups.com/rising-startup-stars/tipila-encyclopedia-for-programmers-to-share-code-snippets-and-tips/"}, {"author_name": "Synetech", "gravatar_hash": "d10ca8d11301c2f4993ac2279ce4b930", "author_url": "http://www.org/", "date": "Sep 04, 2012", "message": "I ’ve listed several issues with this:\n\nhttp://meta.superuser.com/questions/5516/rep-mining-using-the-site-as-a-blog"}, {"author_name": "Tonychen", "gravatar_hash": "6fd90f82e406cb22dfccf5a4c58c4e54", "author_url": "http://www.sourcing-cn.com", "date": "Sep 25, 2012", "message": "The people spending time working out answers that I don’t need is a bit pointless. If they think my answer is wrong, fine, but it makes no sense for people to spend time posting a possibly incomplete version of what I’m already about to post myself."}, {"author_name": "​", "gravatar_hash": "d10ca8d11301c2f4993ac2279ce4b930", "author_url": null, "date": "Oct 10, 2012", "message": "SE is now a dumping site for generic computer-related information:\n\nhttp://superuser.com/revisions/466661/1"}]}