{"response": [{"author_name": "Paul", "gravatar_hash": "7094bef129a85ebc3ad19703b584e934", "author_url": null, "date": "Sep 19, 2011", "message": "Android more \"popular\" or more \"difficult\" requiring more aid from other developers? Did iOS 4 solve a ton of the development challenges from previous releases?"}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": null, "date": "Sep 19, 2011", "message": "C# vs Java"}, {"author_name": "Joel", "gravatar_hash": "a8241c4c6ea1b340feb45b143aa269a8", "author_url": null, "date": "Sep 19, 2011", "message": "Hasn't anyone ever told you to label your axises? :P"}, {"author_name": "foobar", "gravatar_hash": "d4ecac7536f7077f664a84735e6f1549", "author_url": null, "date": "Sep 19, 2011", "message": "Meaningless statistics that do nothing but incite flame wars? Am I really reading this on SO? How are these statistics helping to improve the web?\n\nThis is only benchmarking what kind of developers SO is attracting... Or did 10% of SO users really turn into Android developers within the last two years?"}, {"author_name": "tvanfosson", "gravatar_hash": "00aa1356e6f90fca08b36fb3c8d230c5", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Sep 19, 2011", "message": "Another likely explanation is that you're probably more likely to find Android and HTML5 being used in classroom projects, teaching mobile and RIA development, leading to a relatively large number of novice users with plenty of questions to ask.  I'm pretty sure that 25 years ago you'd have seen the same sort of thing with Pascal and C had their been anyway to ask/answer questions online then.  How'd that work out?\n\nIn the interests of full disclosure, my mobile development primarily uses jQuery mobile and is designed for the browser, so I don't care which one \"wins.\"  My apps do target HTML5 now and I don't foresee doing any Flash development."}, {"author_name": "Darryl", "gravatar_hash": "bb4ef0230783e88c7b88d70c605adecc", "author_url": null, "date": "Sep 19, 2011", "message": "Android sees more activity than iOS on StackOverflow because the Android documentation is much worse than than  iOS documentation.  There is also the fact that Google explicitly refers new developers to StackOverflow if they have basic questions about Android development."}, {"author_name": "Topher", "gravatar_hash": "cec71fca5c51c59ee91dee1b7d67f6f6", "author_url": "http://blog.tophernet.com", "date": "Sep 19, 2011", "message": "I like that you're looking to generate statistics from SO. However, trying to make tech popularity declarations based on SO usage doesn't make sense.\n\nAndroid is a featured tag on SO, and therefore users are more likely to ask their Android questions here. That means that although iOS may have more developers, they're asking their questions on other parts of the web.\n\nKeep it up with the statistics, but try to focus on stats that lend themselves better to the data you actually have."}, {"author_name": "Jeff", "gravatar_hash": "5e4982b51bfec65629e8768b954488d6", "author_url": null, "date": "Sep 19, 2011", "message": "I am pretty sure they are talking about site views, more active people view the site using Android than iOS. Since this is a site for developers they conclude that more developers use Android than iOS, don't think this is a reflection on which platform more people develop on"}, {"author_name": "tvanfosson", "gravatar_hash": "00aa1356e6f90fca08b36fb3c8d230c5", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Sep 19, 2011", "message": "*there\n*any way"}, {"author_name": "baldrick", "gravatar_hash": "24a7701fb1487cbb1063b45fd6bb3a81", "author_url": null, "date": "Sep 19, 2011", "message": "Let's see the stats around version control systems (cue fire retardant clothing) ... cvs, svn, git, hg, etc..."}, {"author_name": "Matthew", "gravatar_hash": "03a9c3602edc7cd815de208715e1cc05", "author_url": null, "date": "Sep 19, 2011", "message": "On both questions, why develop for one platform, or even choose Flash over HTML5 when it isn't supported by iOS.\n\nHTML5 really hit the mark this time and offers all the abilities we used to get from plug-ins and such.\n\nWrite a website in HTML5. Use HTML5 canvas and SVG and CSS3. Then, your site works in any browser without plug-ins, AND it runs on any phone platform.\n\nThe promise of HTML5 is the same as it used to be for Java: Write once, run anywhere."}, {"author_name": "Forrest", "gravatar_hash": "5c89933210805ce89e2df1f56ac38e55", "author_url": null, "date": "Sep 19, 2011", "message": "As an iOS developer I have found StackOverflow to be one of my single most important resources. Why? Because every question I have ever had or could ever have has already been asked and already answered. This was not true when I started ~2 years ago, but today it is. The number of times that I have a question that has not already been answered is exceptionally rare."}, {"author_name": "Brad Larson", "gravatar_hash": "52a2ffb44b1c11ab9001cb67e0a0021c", "author_url": "http://www.sunsetlakesoftware.com", "date": "Sep 19, 2011", "message": "I find it amusing that if this was posed as a question on Stack Overflow itself, it would probably be closed as \"Not Constructive\".\n\nAndroid's rapid increase in popularity on Stack Overflow has not been without its problems:\n\nhttp://meta.stackoverflow.com/questions/100529/help-us-clean-up-the-android-tag\n\nalthough the [iphone] and [ios] tags are not the cleanest places on the site, either.\n\nWhile you indicate that active user % tracks with other statistics, like page views, I would still be interested to see total page views for the tags selected overlaid on the above graphs.  So much of SO's traffic comes from unregistered users that I wonder if people simply aren't asking and answering questions in certain areas because they are finding their solutions among what's already been asked."}, {"author_name": "Gibbons", "gravatar_hash": "959db83ec6c28e79afd7afc5d36133e2", "author_url": null, "date": "Sep 19, 2011", "message": "Maybe you want to tell us what you're counting? Page Views? Votes? Questions asked/answered? Browser stats?"}, {"author_name": "PhilH", "gravatar_hash": "377d586b292fe7888aaa82a7bdd74ca8", "author_url": null, "date": "Sep 19, 2011", "message": "I believe there would only be half the comments on this article if the Android/iOS stats had come out the other way. While some of the explanations given might explain a single data point they all fall flat when looking at the trend. The trend pretty much mirrors what has happened in market share. Only one person brought up a good point about iOS 4 potentially solving though I'd doubt it as new features and ideas will always spawn new question. Everything else just sounds like soreness."}, {"author_name": "Jamie Kirkpatrick", "gravatar_hash": "62c795f7890d6c5b889b665f457320ee", "author_url": null, "date": "Sep 19, 2011", "message": "What value does this add to the world exactly?  I thought the mission statement was to make the internet a better place?  Not sure how this post achieves that."}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://www.pauldwaite.co.uk/", "date": "Sep 19, 2011", "message": "Interesting stats. At the risk of sounding like an Apple apologist, I wonder if iOS will see an uptick when iOS 5 is released and no longer under NDA."}, {"author_name": "Seth Rogers", "gravatar_hash": "9f71e62ebbf97a376f207bd22983869c", "author_url": null, "date": "Sep 19, 2011", "message": "Interesting trends, thanks for posting this."}, {"author_name": "Some Guy", "gravatar_hash": "8f8ff21a67437febebc70afd19364e95", "author_url": null, "date": "Sep 19, 2011", "message": "I don't think you've accounted for the fact that most iOS developers go to Apple's mailing lists and developer support forums for help."}, {"author_name": "Stephen", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Sep 19, 2011", "message": "I would request a JavaScript Library face-off, but I know the answer cause I built the query on the Stack Exchange Data Explorer :-P\n\nhttp://data.stackexchange.com/stackoverflow/s/158/javascript-library-analysis\n\nHowever as others have mentioned... one has to keep in mind that the volume of questions might reflect popularity or the volume of frustration ;-)"}, {"author_name": "Piskvor", "gravatar_hash": "96036d8a66279598cc0ae0ea3181edbb", "author_url": null, "date": "Sep 19, 2011", "message": "Wonder what the good people at http://stats.stackexchange.com/ might think of such shenanigans - are you sure that the data has enough significance to declare a clear winner in each category? It seems to be closer to \"Here we have some numbers. I like Android and HTML5.\""}, {"author_name": "Alex", "gravatar_hash": "93efa37f5b47aad32eb35984eb5cfe04", "author_url": null, "date": "Sep 20, 2011", "message": "Google: Want to Develop for Android? Go to this website, and you can get all set up, for free!  Mac? no problem! Linux? No problem! Windows? no problem! Oh, this is open source (for the most part), so the best way to get answers quickly is from the development community!\n\nTotal cost to release a free application on the market: $25.\n\nApple: Want to Develop for iOS? That'll be $100.  A year.  Also, you'll need to buy one of our Mac computers, so that'll be another $1000, minimum. Oh, and here are our rigid guidelines for creating applications, and here is everything you aren't allowed to do.\n\nTotal cost to release a free application on the App Store: $1100 + 100/year\n\nUhh... I can see why people prefer developing for android..."}, {"author_name": "Brann", "gravatar_hash": "9f2510b1626c8b590d04e9c78355a5a7", "author_url": null, "date": "Sep 20, 2011", "message": "As others mentioned, the fact that more people spend time asking and answering questions on A than on B doesn't mean that A is more popular than B. It might be that A is indeed more popular, or maybe A is harder to grasp, or maybe there are other dedicated places to ask questions about B? \n\nIn my opinion, the trends of the number of apps on the appstore and the android market are way better indicators ..., and so are the trends of the websites using flash vs html5. And the good news is those metrics are quite easy to get !"}, {"author_name": "jloveland", "gravatar_hash": "1776261526c233c38969806faa2ec3d2", "author_url": null, "date": "Sep 21, 2011", "message": "Joel said, \"Hasn’t anyone ever told you to label your axises? :P\"\n\nhttp://xkcd.com/833/"}, {"author_name": "Anonymous", "gravatar_hash": "c001a32127c2ea552e4dfd7837999403", "author_url": null, "date": "Sep 22, 2011", "message": "ITT: Butt-hurt fanboys."}, {"author_name": "David Fauber", "gravatar_hash": "d1ddaf9e384dd15d23800fedb0668ae1", "author_url": null, "date": "Sep 22, 2011", "message": "This reminds me of the \"Who will win the Coastal Division of the ACC?\" poll question they showed during the Va Tech game last weekend."}, {"author_name": "Mark", "gravatar_hash": "59cf716341345993823b430f155458ca", "author_url": "http://markljackson.net", "date": "Sep 22, 2011", "message": "Once again Stack Overflow proves how lame are they. Sadly some people looking to push their agenda glom on and start puking out nonsense like this post.\n\nBad numbers, faulty research, little reasoning, and apples compared to oranges equal nothing but bad conclusions.\n\nHTML5 is NOT the same as Flash. Comparing those two is like comparing Petroleum Engineering to Car Design. One is mature and stable, the other ever evolving and covering a larger number of tasks."}, {"author_name": "Rudi", "gravatar_hash": "9d65acdfca1b1dfd33261162ccc11b98", "author_url": "http://mysamsunggalaxys2.blogspot.com", "date": "Sep 23, 2011", "message": "It's about time in my opinion. +1 and +1 for open source!"}, {"author_name": "Sonic The Hedgehog", "gravatar_hash": "27c94dede0a083a9a103f7e7f63e6cd7", "author_url": null, "date": "Sep 23, 2011", "message": "How about the comparison between the Web broswers? To see whih is most used and which are top Favorite."}, {"author_name": "Ian", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Sep 26, 2011", "message": "With both graphs, what is interesting is the relative position of each line, as they can be effected by quality of docs, other sources of support etc, but the fact that the lines have clearly crossed each other and are not keeping moving apart in the new direction. \n\nHowever this could just be a case of people being more interested in what is new and not needing to ask as about “old” stuff they are using on a day to day bases.   (Think WinForms/WPF, I ask a lot more about WPF and read a lot of WPF questions but still spend most of the time working on WinForms)"}, {"author_name": "Shaik", "gravatar_hash": "63f77160c3163c12c82372614dd25901", "author_url": null, "date": "Sep 28, 2011", "message": "How about MS .Net , what is its future holds for developers?"}, {"author_name": "Chris Hubber", "gravatar_hash": "23c52b3c12b0e891e9887d3b8c05f7f6", "author_url": "http://www.toolbar-icons.com/index.htm?ref=ch", "date": "Oct 02, 2011", "message": "I studied programming for 2 years, and now all I want to learn is HTML5. Now I’m sure, they are relying to website development or web browsers of their mobile phones. Can we make toolbar icons through html5?"}, {"author_name": "plaster molds", "gravatar_hash": "95956e9d6c181e2acd48086ea8f8969b", "author_url": "http://www.plastermolds.org/", "date": "Nov 28, 2011", "message": "True that this new mobile smartphones will soon be dependent on using web applications such as HTML5 and etc. And by the way, i also agree with Mark, comparing HTML5 to Flash is more like a comparing a sophisticated thing unto a simple, yet decorative innovation."}, {"author_name": "griffin ipad 2", "gravatar_hash": "8cadc9d3e28cf454175bc1bf0aa850b7", "author_url": "http://www.ifanaticgear.com", "date": "Jan 19, 2012", "message": "These statistics do not prove the point. I was wondering though if you would also like to research on the web browsers. It would be nice to get those statistics too."}]}