{"response": [{"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Sep 23, 2011", "message": "This neatly solves the problem where you need an answer to a question, but it's closed as a duplicate of a question that wasn't satisfactorily answered. Now you can just pop a bounty on the old question with some custom text on exactly what you're looking for."}, {"author_name": "jcolebrand", "gravatar_hash": "c4cca9bfec5d5e77f625d9fbe8e37a41", "author_url": "http://stackoverflow.com/users/109749/jcolebrand", "date": "Sep 23, 2011", "message": "Thank you thank you thank you. This is just brilliant. Thank you!"}, {"author_name": "George Edison", "gravatar_hash": "ddceaa7c14fb7186bc38cb5c83ca8861", "author_url": "http://www.quickmediasolutions.com", "date": "Sep 23, 2011", "message": "This is great! I remember one instance where I offered a bounty and someone added an answer literally 20 minutes before it expired and I didn't have the time to check the answer to see if it solved the problem."}, {"author_name": "Jorge", "gravatar_hash": "d4f7d15de2abdec49cacaac7d14f00fc", "author_url": null, "date": "Sep 23, 2011", "message": "This is /excellent/ for those of us that want to curate certain tags on an SE site and want to offer people rewards for updating things."}, {"author_name": "nick", "gravatar_hash": "3eda6fcd3204ef285fa52176c28c4d3e", "author_url": null, "date": "Sep 26, 2011", "message": "Wouldn't having a bounty reason imply that you could have multiple reasons and bounties per question? Otherwise just modifying the question seems to be the best place for this. Over-engineering at it's best."}, {"author_name": "MatthewRyanRead", "gravatar_hash": "9f45abdea17c709041812609c7fdfb69", "author_url": null, "date": "Sep 26, 2011", "message": "@nick As Kyle noted, bounties don't have to be on your own question; you shouldn't change what someone else is asking for.  As well, bounty reasons are about the answers -- if you need a more detailed answer, or for an answer to be posted in the first place, and so on.  Editing the question also doesn't attract attention the same way a bounty does."}]}