{"response": [{"author_name": "Rob Gomes", "gravatar_hash": "9d99ad1d6d2e7eddb03f90fd05e1fca6", "author_url": null, "date": "Sep 06, 2011", "message": "As a Boston '09 attendee, I'd first like to say that the food was surprisingly good considering the attendance fee (not amazing, but it was a good, balanced lunch) and the speakers were rather solid.\n\nWhat '09 conferences went well, and what ones didn't?  I think for $99 attendees need to have reasonable expectations (I did, and they were exceeded considering how cheap it was), but if you could figure out something that works for $250 or less, you guys are certainly on to something that the community will enjoy and appreciate, even if its a break-even operation at best."}, {"author_name": "Alistair Ward", "gravatar_hash": "6a738be05b02ee29e89ad8b97efb417c", "author_url": null, "date": "Sep 06, 2011", "message": "I'm disappointed that you've cancelled, but understand the reasons. My problem is that it's not just a question of refunding the conference fee - the major part of the cost is (non-refundable) airline and hotel bookings.\n\nI guess I'll be having a few days holiday in Sydney :-)\n\nI suppose it'll be a nice break from aftershocks (Christchurch, NZ)."}, {"author_name": "Patrick", "gravatar_hash": "823bf30ed436754804af7fb9a61a102c", "author_url": null, "date": "Sep 06, 2011", "message": "I personally didn't have a problem with the costs involved, just the lack of information early on. When tickets first became available there wasn't a single presenter announced and information has only slowly trickled down since then. I wouldn't pay that sort of money without knowing what I was getting in to."}, {"author_name": "Jeff Moser", "gravatar_hash": "d32d40635c653a4e5b33a28fc3c5f77c", "author_url": "http://www.moserware.com/", "date": "Sep 06, 2011", "message": "Any chance on getting Jeff to give highlights of what he was going to present at his \"Stop sucking and be more awesome\" talk on an upcoming podcast?"}, {"author_name": "Matthew", "gravatar_hash": "bfbfd4daa28dd01fcd2cb01493b72f8f", "author_url": null, "date": "Sep 06, 2011", "message": "I am very disappointed. Not only was I really looking forward to this, but now I have to deal with the non refundable airline and hotel bookings. These are much more than the cost of the conference itself..."}, {"author_name": "Justin A", "gravatar_hash": "18f957b9fc9dc60927d0a2a2657f264e", "author_url": null, "date": "Sep 06, 2011", "message": "BL Stack Overflow team :( I was really looking forward to this also, until I saw the lineup didn't really apply to me and my team. Price I can understand and I was sorta happy with. I just didn't really like the Aussie line up :~(\n\nWas hoping for some more ASP.NET MVC &amp; Ravendb/Document Db stuff. *shrug*\n\nSincerly hope we'll have some rebooted stuff in Australia, again .. from you gents! *Hi SamSaff .. come down to Melb :) *"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Sep 06, 2011", "message": "Sorry - but there is a lot of difference between paying $99 and a vacation day for a fun day of nerd love - and a multiple day, few $1000 (with airfare and hotel), conference that I need to learn something at.\n\nThere isn't much market for an expensive 'fun' conference."}, {"author_name": "Rod Howarth", "gravatar_hash": "aad3058d94069f9f748f42adae43df38", "author_url": "http://blog.rodhowarth.com", "date": "Sep 06, 2011", "message": "What about an online conference like http://www.mvcconf.com/ - get the speakers to give the topics they were going to present at devdays. Make it free, and perhaps it will serve as good promotion for an a physical event next year?"}, {"author_name": "Chris", "gravatar_hash": "797e138eab0da838ff4911c0027a700c", "author_url": "http://www.whatisthisaddress.net", "date": "Sep 06, 2011", "message": "Better to fail fast right? Can't wait until next year!"}, {"author_name": "Rhys", "gravatar_hash": "d43ddaef169128b586e5ad60837990c1", "author_url": null, "date": "Sep 06, 2011", "message": "Agreed with Patrick above - the agenda for Sydney has only just started to look complete. I was confident I'd be coming but $500 on an empty agenda is a bit tough to justify."}, {"author_name": "Pete Forde", "gravatar_hash": "496ed7f402fc56b1f997855941272ad4", "author_url": "http://unspace.ca/", "date": "Sep 06, 2011", "message": "I feel like someone didn't tell you guys the dirty, painful secret of running premium conferences: 65% of the tickets sell in the last 48 hours.\n\nI hope you didn't pull the plug too soon.\n\nIn the meantime, I hope you take a card from Tony Hsieh's deck and refund anyone that can prove they had airline/hotels booked. They trusted you enough to bet on your event, so now it's time to demonstrate that you take responsibility when things don't go well."}, {"author_name": "Josh Smeaton", "gravatar_hash": "3891f38e5165127cac92a4e9e4aba688", "author_url": null, "date": "Sep 06, 2011", "message": "Luckily I didn't book airline tickets or accommodation just in case something like this happened. I'm disappointed, but understand the reasons why.\n\nI was hesitant to buy conf tickets at first, due to extreme lack of information. Work fronted the cost though, so it was to be a free holiday for me.\n\nPerhaps if there is to be a next time, it should be nearly fully organised before putting tickets on sale. The dribble of information was disheartening, and really did feel like an amateurish 'production'. I think you would have seen a lot more take up if there was a 'wow factor' to begin with. It's all about advertising!"}, {"author_name": "Benjol", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Sep 06, 2011", "message": "*[Expletive deleted]* I *think* I can cancel the hotel, but not too sure about air fares. This is a most profound bummer, especially as I had decided to fund this myself...\n\nWith the changing exchange rate, I may make myself a few pennies on the refund, but I doubt it..."}, {"author_name": "Benjol", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Sep 06, 2011", "message": "What <a href=\"http://blog.stackoverflow.com/2011/09/devdays-2011-is-cancelled/#comment-61053\" rel=\"nofollow\">Pete said</a>. I'm currently organising a (smaller) event which starts this Sunday. 50% of the inscriptions have arrived in the last two weeks.\n\nAs for a next time: <a href=\"http://www.usingenglish.com/reference/idioms/once+bitten,+twice+shy.html\" rel=\"nofollow\">obts</a>."}, {"author_name": "Roalt", "gravatar_hash": "abda1da8b48df932f20129ad1fc49760", "author_url": null, "date": "Sep 06, 2011", "message": "Too bad the conference cancelled. I was lucky to have my company pay for it and the trip from Amsterdam to London and fortunately did not -yet- book my hotel&amp;flight. For your information, the first DevDays in Amsterdam I paid myself indeed.\nIn the Netherlands: free WiFi is not that of an issue, we have good 3G wireless coverage and also anybody has a data-subscription. \n\nMaybe it would be good to work with some local (ICT) companies to host the event. They are always happy to get enthusiastic people in and you can save some costs on conference room and coffee."}, {"author_name": "Andrew", "gravatar_hash": "62ad4118a5c07e7cd3a14aaea737b549", "author_url": null, "date": "Sep 06, 2011", "message": "I don't believe the conference was too expensive for people to attend. I suppose the problem is in the late agenda - it looks like not so many people were going to spend two days in the conference just because Joel is awesome :) Btw, I told to my manager about the conference last week and he considered sponsoring conference for my team."}, {"author_name": "Richard Nienaber", "gravatar_hash": "ce54c930abde8f0b7b0d5c7f2c354c87", "author_url": "http://owlsayswoot.therandomist.com", "date": "Sep 06, 2011", "message": "Together with my employer, we did consider whether it would be a good idea to go to the conference but ended up deciding the money would be better spent somewhere else. I enjoy learning other programming languages but as a Classic ASP/ASP.NET shop, there's little call for Objective-C/Python/etc.\n\nThis is in sharp contrast to London DevDays '09 where I ended up paying for myself and taking a day off to attend."}, {"author_name": "Jesse", "gravatar_hash": "7bb26b2a7848167e64e4da29741470b9", "author_url": null, "date": "Sep 07, 2011", "message": "Well I'm pretty bummed about it all.  I'm flying from Perth, Australia to SF for this and VSLive! in Redmond the following week and was looking forward to this conference way more than VSLive really.\nVSLive! is more than twice the price again ($1200), is only three days and looks boring by comparison.\n\nIs there anything else going on in SF that I could go to for this week?"}, {"author_name": "Tom", "gravatar_hash": "8f5e0c03c94cc6a0c12a2058c0b17a90", "author_url": null, "date": "Sep 07, 2011", "message": "Joel you totally need to freshen up on your Myhical Man Month :)\n\nhttp://en.wikipedia.org/wiki/Second-system_effect"}, {"author_name": "Timothy Byrd", "gravatar_hash": "98a30a53084337dabef533e446762ea9", "author_url": "http://www.roseharp.com", "date": "Sep 07, 2011", "message": "So Joel - now that you have mid-October free, why not pop out to San Francisco and visit with some fellow travelers?\n\nPut me in the \"non-refundable airfare\" camp.\n\nFor Jesse or anyone else stuck going to San Francisco, I'd be happy to meet up for one of the days - we could go to the Exploratorium ( www.exploratorium.edu ). It's insanely geeky fun. And since they will be moving in 2013, this is almost a last chance to visit the original location. It's a great city to be abandoned in.\n\nWho is up for designing the \"In SF without my SO\" shirt?\n\nBack to Joel - the answer about scaling back doesn't work for me. Since you are going to have to cancel the arrangements with the larger venues anyway, there's nothing to stop you from making smaller arrangements. For SF, maybe google would host you. Maybe craigslist would set you up in a public park. Or you could borrow a universalist church for a day. I know that Joel, at least, is an interesting enough speaker that he doesn't require a projector. So I'm sure something could be done. (I'd offer to help look for a low-cost venue, but what's the point?)\n\nOn the bright side, I now know what Apple early-adopters must feel like."}, {"author_name": "Dean", "gravatar_hash": "217e897cc640bdce8da7dbf0b101d564", "author_url": "http://www.atlascode.com", "date": "Sep 07, 2011", "message": "This is a shame, the guys here were looking forward to this.\n\nIf you break the event down into a larger number of smaller events, can you get each event to record all the talks and start a devdays talks site like www.ted.com that way everyone can get to see the best talks from all events. The talks could then be free for everyone to see and the website could have advertising to pay for its self."}, {"author_name": "Tim Büthe", "gravatar_hash": "c5060835472688a132ffeb67a05803c1", "author_url": null, "date": "Sep 07, 2011", "message": "Thanks for that honest posting!"}, {"author_name": "Mike B", "gravatar_hash": "c98e188ba63a7875d61a77d7aaa3f5c7", "author_url": "http://mikebull.info/", "date": "Sep 07, 2011", "message": "As there appears to be a number of developers who are pretty much resigned to travelling on a \"business holiday\" why not organise a few small \"meet-up's\" instead? I've always found these to be far better than conferences as everyone can just kick back with a beer at a small venue and get a couple of brief talks from the community.\n\nI'm in the \"there's no way my employer would pay that\" group, even though a few days ago I was thinking of asking again as from what I've heard the first DevDays in Cambridge (which I sadly had to miss) was fantastic. I registered for the first simply because it was cheap and general."}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": null, "date": "Sep 07, 2011", "message": "I don't think you 'broke' dev days, I think you just demonstrated without a doubt that it's better organized in smaller pockets by the community.\n\nIf 100 people are willing to put out .. let's say 50 bucks for an all day event, you _could_ have all of the perks, coffee, snacks and wifi that people really want with much smaller groups that offer more opportunity to directly interact with the speakers.\n\nStack Overflow could help shuttle a few given speakers to a few well organized events. Introductions from Joel / Jeff could be done via Skype or something similar.\n\nI don't know if it can be salvaged this year, but next year just declare 'dev days' as a season, and see what people are able to do with it."}, {"author_name": "Matthew", "gravatar_hash": "f854601a4bf235e34d34fcd81f4abb61", "author_url": null, "date": "Sep 07, 2011", "message": "Can I recommend you look at Universities for holding them? They have reasonable wifi, and usually have a conference centre, particularly when the students are not there. If you can sign on local organisers, you should be able to make it sensible."}, {"author_name": "Smith", "gravatar_hash": "fdbccc4aeb3d15acde16a9aba3f3c3fa", "author_url": null, "date": "Sep 07, 2011", "message": "I always book towards the end, I really wanted to attend this in Sydney, and thought I'd better secure my spot today only to find it cancelled. The lineup looked impressive especially since we have a lack of good tech conferences here in Australia ( YOW being the exception)."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.systempuntoout.com", "date": "Sep 07, 2011", "message": "Jeez..and now where do I get an excuse to fly to London alone?\n\nI suggest to organize just one big event with HQ live streaming coverage."}, {"author_name": "HC", "gravatar_hash": "175aab866ed0759e90508228394f5097", "author_url": null, "date": "Sep 07, 2011", "message": "What kind of an idiot thinks he can take a product and quintuple its price without utterly destroying its sales, regardless of how much better it is?\n\nProtip:  It doesn't matter if the new iPad is ten times faster, waterproof, scratch-proof, and half as heavy; nobody is going to pay $2,500 for it."}, {"author_name": "Jorn", "gravatar_hash": "5e27ac2d53fae8db13701e0a88026b69", "author_url": null, "date": "Sep 07, 2011", "message": "I was a bit surprised when the site said \"Sold Out\" when I tried to register for London yesterday. Guess this explains it :("}, {"author_name": "rsgoheen", "gravatar_hash": "8ecf9b51f0a218d10156ce884a0d101a", "author_url": null, "date": "Sep 07, 2011", "message": "Man, am I disappointed.  I signed up for the London conference out of my own pocket and was ready to take the time off.  I wanted to go to hear directly from the people I read on StackOverflow (Skeet, Gravell), but also to meet others in the community here.  I moved to London from Seattle a while ago, but I feel like my network here is a fraction of what it was there, so I was really looking forward to a large gathering of other StackOverflow people.\n\nWhat I hope for next is that there could be more smaller conferences in different locations (particularly London).  Let a hundred StackOverflow conferences bloom...."}, {"author_name": "ivantod", "gravatar_hash": "263270eb36dc1f3d462ec30ae732648d", "author_url": null, "date": "Sep 07, 2011", "message": "So I guess the bait(2010)/switch(2011) strategy didn't work out after all, huh?\n\nRegarding the 'inadequacies' of last year I will say that I went to the Amsterdam event (it's simply the closest to where I live) and I didn't really have a problem with facilities or food or anything else. For $99 I felt it was completely adequate and had no complaints.\n\nHowever, this year with the price more than five times increased, it was a different matter (I would have gone to London this year if I had decided to go). So I have decided to go to DevoXX in Antwerpen instead where for not much more money you get five days of presentations (albeit this one is focused only on Java).\n\nP.S. At least hotel reservations you can usually cancel without penalty, but what are you going to do for people who already bought plane tickets? Or are you just going to leave them to figure it out themselves?"}, {"author_name": "Peter Bridger", "gravatar_hash": "3751f2cfdef276c78476b82321d5f5a8", "author_url": "http://www.strifestreams.com", "date": "Sep 07, 2011", "message": "I attended the Cambridge DevDays in 2009, which was a bit if a trek from the South West of England. However I'd not been to Cambridge before and I wanted to support StackOverflow for all the benefit I'd gotten from it.\n\nConferences are always a mixed bag for me - it's more about chatting to interesting people and being exposed to new ideas.\n\nI learnt a few things and snagged a Coding Horror sticker from Jeff, it's was worth the cost.\n\nThis time round and in this economic environment, I knew I wouldn't be able to sell the benefits of the conference for what I'd get out of it.\n\nConferences are big paid for parties for the organizers , where they get to hang out with their speaker friends paid for by the attendees. These attendees get to share in the magic!\n\nFrom a learning point of view, it's far cheaper to buy some books and read from blogs than it is to learn at a conference."}, {"author_name": "Michael Kohne", "gravatar_hash": "267cfaf8c1f76da3d8b3c7576a903613", "author_url": null, "date": "Sep 07, 2011", "message": "I have to say that I was one of those who could not afford the 'new' DevDays (I did the first DC DevDays very much on my own nickle, driving down on the day and paying my own way). I was sad to see DevDays grow up into a conference I couldn't afford, but I'm quite surprised (and sorry) that you couldn't sell it out. \n\nI'll happily support another cheap conference, if you hold one within driving distance of Philly again. \n\nAlso, I have to say, for a $99 conference, the sandwiches at the first one were just fine - nothing fancy, but they did the job. I wasn't there for the food, I was there for the speakers, who were very good."}, {"author_name": "Bartek", "gravatar_hash": "24d176a8da2fe77fcae7833a15e120ed", "author_url": null, "date": "Sep 07, 2011", "message": "Was disappointed when I heard there would be no conf in Toronto this year, after going to the initial one a couple years back. \n\nI found the food, a/v, and venue all fairly reasonable and am sad to hear that it didn't work this year.\n\nHope that you decide to come back to Toronto, or at least Montreal :-)"}, {"author_name": "Stuart Woodward", "gravatar_hash": "7e39c115b53165a33b5af44e7c51e70b", "author_url": null, "date": "Sep 07, 2011", "message": "For meet-ups why not allow the person with the largest rep in a city be able to edit a meet-up contact details page (or assign this honor to another person).  \n\nPretty soon you'll see a whole lot of meet-ups springing up..."}, {"author_name": "Tom Robinson", "gravatar_hash": "4c6128b1c3929d4900352bd3d3a82b35", "author_url": "http://www.tjrobinson.net/", "date": "Sep 07, 2011", "message": "\"a modest increase in list price from $99 to $499\" - hmm, not sure I'd call that a modest increase. I would love to have attended but the content and cost is way more important to me than the venue quality."}, {"author_name": "Chris Melikian", "gravatar_hash": "63a568081bd54188f5939400cbae0d7b", "author_url": null, "date": "Sep 07, 2011", "message": "You supply food/coffee? I don't expect food to be free at work so why at conferences? Why not let a local cafe(s) sell food on the premises? You get a small cut from them and can lower the overall cost of the days."}, {"author_name": "Eduardo", "gravatar_hash": "4af6bb3c0006562285f04d0208d7514f", "author_url": null, "date": "Sep 07, 2011", "message": "* One day all the way. There no need for two days. Made the sessions shorter, there plenty of post-session info on the web if you are interested\n* I don't care about food. Just a quick sandwich and back to business\n* I don't care about Wi-Fi. I can download that movie back at home. Can quick check the emails using 3G\n\nIn the end all that matters is good speakers and don't waste our time"}, {"author_name": "Ian", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Sep 07, 2011", "message": "I am glad I did not book dev days, as I would now have issues with non-refundable advanced train fair (a lot cheaper the longer ahead it is booked) and hotel bookings.   The cost of last minutes travel is often so high, that you must book a long time in advance; however the risk of a conference or user group being cancelled is often to grate to do so (I will also not book until the speakers can been confirmed).    \n\nTherefore if it is not local to me, I am unlikely to go.\n\nWhat about lots of small local small/cheap stack overflow dev days, in different locations at different times?   Rather than trying to set them all up, just plan 2 or 3 within the some region (so the speakers can bet between them), run them, and then repeat every few months with a different region."}, {"author_name": "tim", "gravatar_hash": "94a0e83767dbc71db135454693540015", "author_url": null, "date": "Sep 07, 2011", "message": "I was happy with the food at the 2009 Boston event.  I was also fine with not having wifi.  Most people now have smartphones to check in at the office etc.  I think those issues, while nice to have, are not the important bits.  \n\nKeep trying Joel and Co - I'll be up for the next one.  I was skeptical of the new \"format\" but paid for tickets as I felt it was still worth it.  Disappointing but certainly understandable if you had low turnout."}, {"author_name": "David Berman", "gravatar_hash": "b8365a6ea11074de527979ad17038561", "author_url": "http://www.brucesbakery.com", "date": "Sep 07, 2011", "message": "Hi Joel,\n   Any chance you'll go back to the $99 dev days?  Who cares about the food?  If I can spend $99 and learn a ton of great stuff, just tell us on the ticket \"Bring your own food and drink, here is the location of the nearest Subway / Dunkin / Starbucks to the venue.\".  I can bring my own sammy and coffee.  What we're really hungry for is your knowledge!\n\nDavid in New York"}, {"author_name": "Cade Roux", "gravatar_hash": "d45ef03e9450599588bf733662f792e5", "author_url": null, "date": "Sep 07, 2011", "message": "I'm not sure how many people you were expecting at these large venues - 500, 1000, 2000?\n\nThe SQL Saturdays which have been making the rounds have mostly been free with sponsorship (including lunch).  I've attended Baton Rouge twice and presented at the last one.  There were eight tracks and I thought the quality was very good.  Attendance around 300 people.  Speakers are mainly vendor-related, so I understand that vendors effectively pay for the conference.\n\nNow those same people might pay up to $99 for a day-long conference - but the speakers need to hit the sweet spots for the technologies these people want to learn about and travel costs need to be considered.  Having conferences in just a few big cities will only have insignificant travel costs for natives (even at $99).  So natives would be a huge part of the audience.  And natives will just wait until the last minute unless there is an early-bird incentive."}, {"author_name": "Phil", "gravatar_hash": "8149d92405173dc80a96f5dabe984e3f", "author_url": null, "date": "Sep 07, 2011", "message": "I'd like to say thanks for the candid comments. I bought a ticket for the Seattle '09 event (closest to where I live) but I couldn't make it... then I really wanted to go to '10 but it wasn't in Seattle. I hope you can return to the success of the '09 conference."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Sep 07, 2011", "message": "@Chris Melikian  - you can't supply the coffee, that's what venues really make the money on. Read Joel's blog on the economics of running the first dev days.\nBasically you get the room for maybe $5000, then they nickel and dime you to death, $500 for each coffee station, $500 for a working projector, $500 for a 'nearly working' microphone etc. Don't even ask about wifi!\n\nHolding them at universities doesn't save money, they are in business too and are at least as expensive.\n\nThe problem is that conferences are geared to massive venues, it's easy to holding CES or WHDC. It's much harder work and more expensive to fly to 50 cities hosting a few hundred  people at each."}, {"author_name": "Mauricia", "gravatar_hash": "5b8554c73cb4aac27a10d76b6cdbf286", "author_url": "http://www.mnragland.com", "date": "Sep 07, 2011", "message": "So is all hope lost?\n\nIs there any way we can still find a more inexpensive venue and get some speakers.  \n\nI was really looking forward to these topics in DC.\n\nI'm willing to put the time in, may not be as magnificent as initially planned, but I'm sure something can get put together. We have 3 months!\n\nFor those who have already paid airfare and hotel I'm certain you don't want that to go to waste!"}, {"author_name": "Mike", "gravatar_hash": "ce240bc9dd33de3d53cdf55c287e9e9e", "author_url": null, "date": "Sep 07, 2011", "message": "Thanks for the post-mortem.  I attended LA '09 Dev Days and loved it.  Thank you!"}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Sep 07, 2011", "message": "I'm feeling rather ambivalent. I really wanted to go, but couldn't spring for it myself. It's been a real PITA to go through the corporate paperwork etc. to get the hospital to pay for the conference, and due to my current workload I haven't been able to finish that \"process\". (there's a few blog entries...) \n\nSo while I'm not out anything financially, I'm not likely to be going to any conferences this year."}, {"author_name": "Joshua Carmody", "gravatar_hash": "2a132ec297346e7faf45127323ec63a7", "author_url": "http://www.joshuacarmody.com", "date": "Sep 07, 2011", "message": "What?! Noooooo!\n\nI was REALLY looking forward to Devdays in Washington DC. I'd been registered for a while, I even got my company to pay for the registration. Now I'm going to have to pay the registration fee back to the company. What a pain.\n\nNow I'm never going to get to go to a cool dev conference! *sob*."}, {"author_name": "Danny Whitt", "gravatar_hash": "a4a032fd90f7f7e615371a138035eb22", "author_url": "http://stackoverflow.com/users/375/danny-whitt", "date": "Sep 07, 2011", "message": "Very sad news but at least a little understandable.\n\nI guess I'll cancel my plans to attend in S.F. again like I did in 2009 but you can bet I'll be there as soon as DevDays 2012 (or 2013?) happens!  It'll be worth the wait."}, {"author_name": "Jeff Bobish", "gravatar_hash": "94bdc8add0bf4fa5449bdd88f42d8832", "author_url": null, "date": "Sep 07, 2011", "message": "The slowly developing schedule was holding me back - hard to make a case to the company when you don't even know what topics will be covered. Then the DC schedule was fleshed out, a few days later it listed as sold out, and now it's cancelled altogether.\n\nI think you guys pulled the plug too early on this. I live in D.C. so the only reason I was going to register early was to make sure it didn't sell out on me. I think the attendance would have been better than you expected."}, {"author_name": "Chris Hanson", "gravatar_hash": "821e13cc740d792f9d6367646b698406", "author_url": "http://eschatologist.net/blog/", "date": "Sep 07, 2011", "message": "Here are the comments I posted on Hacker News last night when I first saw the news.  Tl;dr: DevDays and tons of other conferences are quite workable under a different model.\n\nThere's a large number of experienced conference runners and planners who will disagree, and collectively have been running inexpensive but good conferences for DECADES.\n\nThey're called \"SMOFs.\" They run science fiction conventions. (Not \"Star Trek\" conventions but \"science fiction\" conventions - books.) And the conventions are not for profit membership organizations typically with hundreds or thousands of members attending over a weekend at a cost of a few tens of dollars each.\n\nThe SMOFs are generally willing to help others run conferences by giving them advice, doing (paid) consulting work, or even fully (paid) managing conferences. A great example is Expotech, who ran MacHack.\n\n\nOh yeah, and if you're paying speakers, You're Doing It Wrong. The speakers should be drawn from the attendees/members.\n\nIf a speaker is a \"guest of honor\" (say a major keynote) you should comp them their conference membership, and possibly cover their hotel room and travel (which you'd arrange). That's it.\n\nNo paid speakers. No \"sponsors,\" either. Just members. Hundreds of conventions with a great many thousands upon thousands (potentially millions) of members make this work every year in sci-fi and the areas that have branched off from it like anime and comics."}, {"author_name": "Marco Ceppi", "gravatar_hash": "c127c8150f8052e4b89d66f42b99be56", "author_url": "http://marcoceppi.com", "date": "Sep 07, 2011", "message": "The speakers weren't paid."}, {"author_name": "Kyralessa", "gravatar_hash": "750159e9cdab58c4b6547d382311c9af", "author_url": null, "date": "Sep 07, 2011", "message": "Have you considered, instead, sponsoring existing conferences?  Here in St. Louis for three years in August we've had the St. Louis Day of .NET.  (StackExchange employee Rebecca Chernoff was spotted there.)  It's a two-day event, Friday and Saturday.  Sponsors get some leeway in terms of speakers, and anyway they could use more speakers to talk about advanced topics.  I think some talks on the specific scalability methods that have been used on StackOverflow, for example, would be well received."}, {"author_name": "MPelletier", "gravatar_hash": "d66398326ad20e17b924b6efae9a7a33", "author_url": null, "date": "Sep 07, 2011", "message": "I understand the step back. My 2¢: Take a page from the Agile Tour, hit many cities with small events, go to some of them, have local speakers. Divide and conquer!"}, {"author_name": "Mark", "gravatar_hash": "617a3a44e355ca7a357596d21d16a3a5", "author_url": null, "date": "Sep 07, 2011", "message": "I attended the LA DevDays a few years ago.  I thought about attending, but Jeff A. has a rather large inflated ego these days.  I had to stop listending to the podcast (before it went off the air, it is off the air right) as his ego was too large for my ears.  This is the main reason why I don't read/listen/visit stack overflow these days.  I found this via Hacker News"}, {"author_name": "Jon Bright", "gravatar_hash": "c472dda774f350e97bc910edd5dd5b10", "author_url": null, "date": "Sep 07, 2011", "message": "I was really looking forward to attending the London event again, so I'm obviously disappointed, but I don't expect people to provide me with services at a loss, so I understand.\n\nProcrastination has paid off - I kept meaning to get around to booking a flight, but hadn't.  Meanwhile, my company gets the money for the conference back (but eats a 110GBP hotel cancellation fee).\n\nRegarding 2009 in London: quality of food, while obviously not a gourmet restaurant, wasn't a problem.  The fact that it threatened to run out/there weren't enough servers was more of an issue.  Having Wi-Fi was nice, but I don't think anyone would have died without it.  AV was sometimes irritating, but less so than the Nokia guy not understanding his audience.\n\nI'd suggest that you could (next year) do a re-run of the London 2009 format, but make it more explicit that not every session is going to be of interest to everyone and schedule things such that people pick one of two lunch breaks, alleviating the stress on the food serving."}, {"author_name": "Christopher Martin", "gravatar_hash": "5802a8410653f2b282f2234b539b8abc", "author_url": null, "date": "Sep 07, 2011", "message": "I'm confused because I tried to register for San Fran and the site said sold out. That sounds like great attendance."}, {"author_name": "Peter Nieuwenhuizen", "gravatar_hash": "007a68000d5a3966f4aebf398e9469b6", "author_url": null, "date": "Sep 07, 2011", "message": "Bugger! I'm doing the same thing as Jesse. Flying from Sydney, Australia for Dev Days SF and VS Live in Redmond. Are there any other events on in SF that week?"}, {"author_name": "Jesse", "gravatar_hash": "7bb26b2a7848167e64e4da29741470b9", "author_url": null, "date": "Sep 07, 2011", "message": "Peter!  Fellow Aussie!\n\nIf you find anything happening that week in SF please let me know - http://about.me/jesseks - otherwise Tim's suggestion of the Exploratorium sounds good!"}, {"author_name": "Simone Chiaretta", "gravatar_hash": "444625287c652a4e31f4a271905b713a", "author_url": "http://codeclimber.net.nz", "date": "Sep 08, 2011", "message": "The reason why I did not register for the event was exactly the ones you describe in the post:\n99 was ok for an event that brings nothing from the \"company business\" stand point. I work on .NET and while I'm personally interested in knowing about other technologies and languages, my company couldn't care less. And will not pay 499 for 2-3hrs about my official technology.\nFor the 09 ones I paid it myself and took 1 day of holiday, but I'd rather spent 499 for something else.\nToo bad for such a short notice and many people already bought plane tickets and hotel, and there are not refundable."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Sep 08, 2011", "message": "I, too, hope that there will be a decent solution for all those who have non-refundable travel and hotel bookings already paid.\n\nAs for London, if you'll be in town anyway, check out http://meta.stackoverflow.com/questions/105425/devdays-cancelled-should-we-have-a-london-meetup-anyway"}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Sep 08, 2011", "message": "I sometimes wonder what people expect from tech conferences. I go to listen to the speakers and talk to fellow delegates, not to do anything that requires wi-fi. If I need to check my email then I can do it on my phone over 3G.\n\nI went to DevDays 2009 in London and my friend and I popped over the road to buy sandwiches, it was no big deal."}, {"author_name": "tuj", "gravatar_hash": "15ed4ff04c5a8c408f3c4b9663907b9e", "author_url": null, "date": "Sep 08, 2011", "message": "way to go.  was going to attend for the first time, booked my hotel, airfare and everything.  thanks for screwing me over.  think I will ever consider another conference with you guys?  get professional."}, {"author_name": "James", "gravatar_hash": "004aa5fddd0888bc2c2c0ea505f95da2", "author_url": null, "date": "Sep 08, 2011", "message": "Huge bummer.  I totally booked for SF off of the reputation of SO and Joel, even though the schedule hadn't been fleshed out yet.  I agree with the others - how can you expect a great signup rate without a solid schedule?  Still need to see about cancelling airfare but if I can't, I guess I'll be looking to join the meetup crew!"}, {"author_name": "Santiago", "gravatar_hash": "25e78cf3257636360e5e9ae36cd3cb6b", "author_url": null, "date": "Sep 08, 2011", "message": "I'm glad that you are returning to the 1.0 spirit. Amsterdam DevDays 2009 was great!"}, {"author_name": "Jeff Veit", "gravatar_hash": "c4aefeca384a42f19968decc20edbeb8", "author_url": "http://www.tanasity.com", "date": "Sep 08, 2011", "message": "I guess it's too late since you've cancelled, but I'd be prepared to share the research that I did to run DrupalCon in London; a 100GBP/day conference is possible in London with great wifi and good food if you don't aim for a premium venue like Excel and if you aren't aiming to do much more than break even. Feel free to get in touch."}, {"author_name": "Filipe Guerra", "gravatar_hash": "52f8801b033ac2bd758713dc09850e40", "author_url": "http://www.dri.pt", "date": "Sep 08, 2011", "message": "Too bad... I hope you'll manage to make a 2.1 version of it.\nIf you're thinking in having a small event somewhere in Portugal or Spain, please let us know :)\n\nGood luck"}, {"author_name": "John Kellar", "gravatar_hash": "f3ee6e0f985f8e32f92edf100254f86a", "author_url": "http://devlink.net", "date": "Sep 08, 2011", "message": "I have to disagree that you can't put on a great multi-day conference (with fun) for a reasonable price.  There are several very good events out there CodeStock, CodeMash, Heartland Developers Conference.  I personally work on the Devlink Technical Conference which has $100 tickets for a three day event.  If you don't feel that you have to be in the heart of a major city or in a resort hotel, you can definitely make it work. Sorry to hear DevDays are done, had hoped to get the oportunity to attend one day."}, {"author_name": "Timothy Byrd", "gravatar_hash": "98a30a53084337dabef533e446762ea9", "author_url": "http://www.roseharp.com", "date": "Sep 09, 2011", "message": "@Jesse, Peter, James: I still think Joel ought to pop out to SF for a day. :) However, failing that, we should be able to work something out. Maybe a local would be willing to help out here, but if not, I can play host-by-proxy.\n\nObviously I don't know it as well as Los Angeles, but the SF bay area is rich with stuff to do. And Californians are generally friendly - except we get snippy with New Yorkers (especially when they wuss out on conferences).\n\nSo what are y'all into? Theatre? Music? Booze? Food?\n\nHere's my own list of random possibilities:\n- meet up with a friend of a friend who will be visiting from Germany\n- the Exploratorium\n- walk the labyrinth at Grace Cathedral (going to miss out on hearing Evensong on Sunday, darn!)\n- drive up to Napa/Sonoma for a day to visit a couple wine-makers I know\n- take a ferry across the bay for a tour of the St. George distillery\n- do the basic tourist stuff (cable cars, water front, Alcatraz, etc)\n- visit Berkeley (birthplace of BSD and LSD!)\n- visit acquaintances who are into Scottish Deerhounds, English country dance or harp music.\n- go bar hopping\n- visit the Filoli estate and gardens South of the city.\n- see if I'm brave enough to check out a goth club\n\nI'm going to see if I can at least shift my flight and arrive Thursday evening. Depending on when you are heading to Redmond, that would still give Friday and Saturday.\n\nIf you want to email, my address is timothy at roseharp.com."}, {"author_name": "Bhaarat", "gravatar_hash": "e998bb5453878652b34638294b4d6787", "author_url": null, "date": "Sep 09, 2011", "message": "I think Joel you generalized things too much.  Since you've been providing the industry best of everything to fogcreek developers, you wanted to do the same for conference attendees. This of course increases the cost but I think generally people who care about the stackoverflow family supersede people who care about whether they had wi-fi or a filet mignon at the conference.  \n\nI for one would love to be part of Devdays  the next time around."}, {"author_name": "Warner", "gravatar_hash": "9af0a09c93b7570fdbbb730585434a40", "author_url": null, "date": "Sep 09, 2011", "message": "I'm not reading the comments but am a bit disappointed.  I was planning to attend Scalability with a member of my staff -- flying from Ohio.  I hadn't registered yet but I added it to a budget reforecast.\n\nI think you had the right idea but it was a little too short for the distance.\n\nProbably have more comments if you seek them out.  There are plenty of user groups; the one-day thing poorly organized is fun-- but not the same."}, {"author_name": "rwong", "gravatar_hash": "46520d686bf3a8d42e2e43cc5d0f44e1", "author_url": null, "date": "Sep 10, 2011", "message": "To those who claim the need to *make sure they learn something useful for their work* from the conference: \n\nDon't use a conference as an excuse to learn! There's basically nothing that can only be learned by attending a conference. And most of the time a conference will only give you \"business insights\", namely, where the trend and sentiment is going, but not practical technical knowledge.\n\nIf you really need to learn something from a conference, make sure you learn it the days before your attendance, or within one week after it. Without a goal you'd be empty-handed.\n\nEven to those asking for unpaid day-off, attending a multi-day conference still presents a productivity loss to the attendee's employer. Hence comes the need to \"justify\" the purpose. You might just be as productive as taking a single day off and practice on the new technology on your own."}, {"author_name": "Aodh", "gravatar_hash": "60c1a50b0dbed3045b60b70868c74a85", "author_url": null, "date": "Sep 12, 2011", "message": "What a shame! I was really looking forward to Stack 2011! My keepers were even willing to foot the bill 'n all!"}, {"author_name": "Tom Wright", "gravatar_hash": "7f9e3fa089bda19c4ecc8f3cfe60dce4", "author_url": "http://tdwright.co.uk", "date": "Sep 13, 2011", "message": "I was slated to speak at the London event. If anyone plans a meetup or similar I'd be happy to bring my demo along."}, {"author_name": "VonC", "gravatar_hash": "4fc12eea3fb81ede59d064d0fdbb84ab", "author_url": "http://stackoverflow.com/users/6309/vonc", "date": "Sep 13, 2011", "message": "@Tom Wright: yes! a speaker. You can register at http://t.co/nmD9V10: \"DevDays London 2011 plan B\".\n\nI will also give my speech (DVCS in a big corporation, after the SO answer http://stackoverflow.com/questions/5683253/distributed-version-control-systems-and-the-enterprise-a-good-mix/5685757#5685757"}, {"author_name": "JasonStoltz", "gravatar_hash": "2f3802e6f28dae567a87a51fd2c00ad5", "author_url": null, "date": "Sep 14, 2011", "message": "Very sad to hear, but looking forward to see what you do next year. Hopefully something in or around the Washington D.C. area!"}, {"author_name": "Christopher Butler", "gravatar_hash": "833feb8a7798165095431b2f2a4e3186", "author_url": "http://chriscodingfun.blogspot.com/", "date": "Sep 15, 2011", "message": "As an attendee of the 2009 Toronto Conference (A friend and I drove from Ohio), it was a great experience. The venue was great, the food was nice (and unexpected), the presentations were amazing (and yes, a bit short, but hey, it was $99 dollars!). I got a lot out of it, and a nice little vacation in Toronto to boot. \n\nThe $99 dollar price point was great. Heck, for what you guys produced, I felt a bit guilty that it was only $99 bucks. Please bring it back! \n\nIf you are deadset on a 2.0 upgrade, maybe instead of making it longer, how about changing how conferences are done. Maybe the presenters create more offline content to be consumed pre-conference? Like a 30 min podcast intro/outtro for each session(video casts?)? Possibly  pre-conference and/or post-conference?? Also, bring in more funds by upping the cost slightly, to $150? \n\nAnyway, I was extremely happy with the features in 1.0, warts and all."}, {"author_name": "Chris Barry", "gravatar_hash": "fe62dcab3879bc1adf557d4176d4326e", "author_url": "http://makemoredigital.com", "date": "Sep 17, 2011", "message": "I agree with everyone that it is very disappointing that this has gone away. Can anyone suggest alternatives for London around the same time?\n\nAlso agree that there are ways around this beyond just outright cancelling. Am I right in thinking there is not really any other conference that is so technology agnostic? A value I like to uphold."}, {"author_name": "Simone Chiaretta", "gravatar_hash": "444625287c652a4e31f4a271905b713a", "author_url": "http://codeclimber.net.nz", "date": "Sep 21, 2011", "message": "It's not London, but really close, and it's one month earlier, there is Agile.NET 2011 Europe, in Gent, Belgium.\nhttp://www.agileminds.be/event/5\n\nIf you use the discount code \"simonech\" (without \"\") you get 50€ discount on the price (300€ instead of 350€). That's also cheaper than DevDays."}, {"author_name": "Jon Dickinson", "gravatar_hash": "dae4b622c316b4a5c32f66addd66dd26", "author_url": "http://codeken.com", "date": "Sep 27, 2011", "message": "We have been working with Stackoverflow and a number of the original speakers to resurrect the original London DevDays line up. The result is Code Ken 2011.\n\nhttp://london2011.codeken.com\n\nWe are running it on the same dates, 14 - 15 November at a Canary Wharf location, so it is close to the original venue. We have a good number of the original speakers signed up, including John Skeet, Richard Marr and Robert Pickering. See you there."}, {"author_name": "David Harkness", "gravatar_hash": "9462edf139e6a4a74a19dcd536dcb26d", "author_url": null, "date": "Oct 20, 2011", "message": "I would have definitely attended the SF event. I've been visiting SO pretty much daily for the past nine months . . . and just now read about this conference. WTF!"}, {"author_name": "Gratis internet", "gravatar_hash": "fbbaefb643694a33aeb31e9a5e5f7ad4", "author_url": "http://www.gratisinternet.org", "date": "Apr 11, 2012", "message": "Great info.. keep up the good work... <a href=\"http://www.gratisinternet.org\" rel=\"nofollow\">gratisinternet</a>"}, {"author_name": "Angel", "gravatar_hash": "d442277128ec71b5f49c2c5534e52bf5", "author_url": "http://www.ark-sol.com/", "date": "Jun 26, 2012", "message": "Great information here.\nThanks for this!!!!!!!!!!!!"}, {"author_name": "Mick T.", "gravatar_hash": "d9ac41cddd2ce7b632b637f30789f8b1", "author_url": null, "date": "Jan 03, 2013", "message": "Will there be and DevDays in 2013?"}, {"author_name": "Mick T.", "gravatar_hash": "d9ac41cddd2ce7b632b637f30789f8b1", "author_url": null, "date": "Jan 03, 2013", "message": "Will there be any DevDays in 2013?"}, {"author_name": "Adrien G", "gravatar_hash": "2efba8314211fb2a35ee59b1a4a3deaf", "author_url": "http://www.blanqueamientodentalcasero.net", "date": "Jan 18, 2013", "message": "hopefully there will be one this year. i will keep my eyes open."}]}