{"response": [{"author_name": "Bill", "gravatar_hash": "d73fdee763defa016213ff95437c427d", "author_url": null, "date": "Sep 07, 2011", "message": "Jeff, Malta has a (relatively) big tech scene because, due to favourable regulations, it is home to many online gambling companies."}, {"author_name": "daviesgeek", "gravatar_hash": "0b5ae01969bf4657b8fc2651d165c05b", "author_url": "http://thegeektechblog.blogspot.com", "date": "Sep 07, 2011", "message": "Love the beginning!  Great podcast. Thank you so much SE team. Keep it up!"}, {"author_name": "BiggAl", "gravatar_hash": "0c85ef5eb7678857e2a6b793dfe055a3", "author_url": "http://stackoverflow.com/users/655372/biggal", "date": "Sep 08, 2011", "message": "Have you guys considered linking up with professional bodies for these meetups? I am a member of the BCS who have a lot of talks over the autumn/summer/spring period. It may be possible to link up with a group like the Advances Programming SG or even the BCS London Central Branch. They would probaby be happy to provide the venue, and mutually advertise. When I find out how I'll stick something on the Meta."}, {"author_name": "Paul Sheldrake", "gravatar_hash": "e4953fa22d95601bcd1b3b5657d00f76", "author_url": "http://fractured-state.com", "date": "Sep 08, 2011", "message": "Could we get some screenshots of the network dashboard/"}, {"author_name": "mxyzplk", "gravatar_hash": "fde79b61219beecc221ad3e26943a992", "author_url": "http://mxyzplk.wordpress.com/", "date": "Sep 08, 2011", "message": "Your cloud cost calculation doesn't seem to take your ops time into account... All that fiddling around with server room and power stuff is certainly costing you more than $17k a year isn't it?"}, {"author_name": "Zack Peterson", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack-peterson", "date": "Sep 09, 2011", "message": "I live in Des Moines. :("}, {"author_name": "Robert Harvey", "gravatar_hash": "1233ec65168f4aae4d939ae8fe6cde1e", "author_url": null, "date": "Sep 10, 2011", "message": "Floppy disks?  People still use floppy disks?"}, {"author_name": "Steve Wortham", "gravatar_hash": "7c4d1e4f8701946b8391d009d8d85221", "author_url": "http://www.silverlightxap.com/", "date": "Sep 11, 2011", "message": "@mxyzplk - That's the same thing I was thinking.  Something like Amazon EC2 or Windows Azure would surely bring with it some unique challenges (especially this late in the game).  \n\nBut I have to think that the long-term administration demands would be substantially less, which you should factor into the cost.  It could make the difference between being forced to hire more sys admins years from now as your server farm grows, or not.  Then the advantages should come in the form of reliability, scalability, and reduced latency."}, {"author_name": "George Beech", "gravatar_hash": "4879c0373e2bf7313a6c61d69884a44e", "author_url": null, "date": "Sep 12, 2011", "message": "@Steve Actually I talk briefly about the challenges that people using Amazon run into, in theory it should reduce the workload, however in practice at scale you have the same or possibly more due to the unique challenges of running in the cloud. Being in the \"cloud\" doesn't make you more reliable or scale-able by itsself, it just gives you a different set of tools to become reliable and scale-able. As far as latency, it doesn't buy you _that_ much especially if you are using a CDN. \n\n@mxyzplk it intentionally leaves it out even in the cloud you have to maintain about the same staffing whether you are in the cloud or not at scale. Also that's 17k/MONTH not 17k/YEAR"}, {"author_name": "Rohan Cragg", "gravatar_hash": "6004e8992a77c769a60c79f7aa6415aa", "author_url": null, "date": "Oct 14, 2011", "message": "Meetups were also discussed from about an hour in, but are not mentioned in the show notes. Are plans for sponsoring Meetups going to be blogged about in more detail? (or have they been already?). In Scotland there are Tech Meetups already that you could partner with, they just don't use the trademark Meetup system... http://techmeetup.co.uk/"}]}