{"response": [{"author_name": "VonC", "gravatar_hash": "4fc12eea3fb81ede59d064d0fdbb84ab", "author_url": "http://stackoverflow.com/users/6309/vonc", "date": "Sep 14, 2011", "message": "Any Nerd badge for reviving DevDays London 2011?\n\nSee more at http://meta.stackoverflow.com/questions/105425/devdays-cancelled-should-we-have-a-london-meetup-anyway/105522#105522\n\nDiscuss it on the chat: http://chat.meta.stackoverflow.com/rooms/416/pubdays-or-something-meetup-discussion\n\nRegister at http://www.meetup.com/DevDays-London-2011-Plan-B/events/33387912/i3/socialmedia/"}, {"author_name": "mbarbir", "gravatar_hash": "e5d1cc3ce9578d0b67de0a3fe68780f6", "author_url": "http://www.experts-exchange.com", "date": "Sep 15, 2011", "message": "Good seeing you at TechCrunch, Joel.\n\nOne point of clarification - out of EE's 78,687 all time experts, our courteous Indian experts make up 2,986 (roughly 4 percent) or our overall contributors, and less than 2 percent of active experts the past 30 days.\n\nThat said, our Canadians weigh in at 3,529 experts. This data point alone not only proves your point, but will unfortunately force me to reexamine our perverse incentive structure.\n\nAppreciate the insight. Keep up the good work."}, {"author_name": "Isaac", "gravatar_hash": "2bb572e05887045b95d99d8a5819eb14", "author_url": "http://judaism.stackexchange.com", "date": "Sep 16, 2011", "message": "I've often craved the sort of hyperlocal \"what's going on right here, right now\" site that Joel wanted during Irene, for questions like \"Where are the fire trucks that just passed my house heading, and why?\"\n\nIt seems to me that the SE network, which is optimized for creating a permanent, always-correct, repository, isn't suited for this sort of current events stuff. City-oriented reddits are OK for it. Joel should try http://reddit.com/r/newyork\n\nWhat would be awesome would be a variant of reddit/twitter that shows you a list of posts ranked by newness, upvotes, and proximity to you. It could let everyone specify their location either constantly, using a mobile device's GPS or statically, by pointing to it once on a map. It could even let you temporarily and artificially switch locations to participate in conversations somewhere else (e.g. in the Hamptons when you're sitting in Manhattan)."}, {"author_name": "Goyuix", "gravatar_hash": "846aeb3494a51fdd2af2bb0b99dc364c", "author_url": null, "date": "Sep 16, 2011", "message": "Disclaimer: I only heard your mini-rant, didn't read anything where it might be more fully fleshed out. Please forgive me if I am treading on already covered ground or completely missed the point.\n\nPoint of clarification on the \"sea of icons\" paradigm: On my Android phone I almost never pull up the App Drawer and try to sail the scrolling sea of icons. Since Android 1.6 the search widget has automatically searched applications by name, and more recently with the Gesture Search app (https://market.android.com/details?id=com.google.android.apps.gesturesearch) you can have one-stop searching of your contacts, bookmarks, apps, music, etc. by sketching out the letters with your finger and it recognizes the text. It is amazingly cool and productive.\n\nLooking beyond Android, Windows Vista introduced the much improved Start Menu, where hitting the start menu button or the Windows Key and then just typing provided a instantaneous filtering of the Shortcuts in the Start Menu, and it is has seen improvements over the years to include recent files and other things to. Even the much-maligned Unity interface in Ubuntu started providing a similar app search approach which is a huge usability win in my book. \n\nWhile there are better alternatives to seeing the all-inclusive list of icons, and it is somewhat saddening that it often gets front and center attention in poor UX design - but on the flip-side I am grateful it is there because sometimes the icon is more memorable than the name (or other metadata about the app). The default sort order makes reflexive behavior easy - if you know the app starts with a Z it is easy to swipe/Ctrl+End to jump the end of the list as a natural filtering function.\n\nSometimes you need/want the relaxing enjoyment of an Old Town Royalex Canoe, and sometimes you might just want the exhilaration of a Kawasaki Ultra 300LX."}, {"author_name": "Jarrett", "gravatar_hash": "b59c4005ed666248d68934dc43c301fc", "author_url": "http://stackoverflow.com/users/50058/jarrett-widman", "date": "Oct 01, 2011", "message": "If Stack Exchange really wants a custom plush, that is what my wife does, she makes custom plush for people. They are well made, not two pieces of fabric glued together with sawdust in the middle. lanacrooks.com"}]}