{"response": [{"author_name": "Lance Roberts", "gravatar_hash": "576cdd58ab7df19c6715121c7806bbf6", "author_url": null, "date": "Sep 28, 2011", "message": "I agree with Joel about the General Reference questions.  Most documentation is poor, and searching to find just what you want is hard."}, {"author_name": "commenter", "gravatar_hash": "643791363b9abebf0d23d5b4049486fa", "author_url": null, "date": "Sep 28, 2011", "message": "A new counterpart to \"Face for Radio\": \"Voice for Blogging\"."}, {"author_name": "Jason Lewis", "gravatar_hash": "86677a9407afed1c8ba534a716f91c1b", "author_url": "http://duckpunching.github.com", "date": "Sep 28, 2011", "message": "Seriously? The difference between a class and package in Java? \nReally, the SO Reputation whoring is mirrored by karma whoring in the early slashdot days... maybe only the first two downvotes should sacrifice reputation? Or after 5 downvotes ANSWERING loses rep? There has to be a technical solution to this social problem... my life is based on technical solutions to social problems, it seems..."}, {"author_name": "MBraedley", "gravatar_hash": "faee7c8a4f200567714ca387446d8721", "author_url": null, "date": "Sep 29, 2011", "message": "For the code thing, do you consider comments within the code before throwing up the long code warning?"}, {"author_name": "Jon Snyder", "gravatar_hash": "6ba2619907708ab5931b6bc3c07074e7", "author_url": null, "date": "Sep 29, 2011", "message": "I think that many times people don't know the keywords to search for when trying to find an answer to their question.  For example on Tim Post's blog he sites splitting a string as an example.  He says that you should search for \"string methods in c sharp\".  You should make it easy to link to google with good search keywords."}, {"author_name": "Doug T", "gravatar_hash": "680652ec4feb1969c39cfba008214ea9", "author_url": "http://ilearnstuff.blogspot.com", "date": "Sep 29, 2011", "message": "I have to completely agree with Joel. I'd rather find a stackoverflow answer to a really basic question because someone can edit it and update the information or provide a new answer. If its a dupe, then close it."}, {"author_name": "Jack B Nimble", "gravatar_hash": "98f23510240223098120505ddd77b58f", "author_url": "http://atwitsendcomics.com", "date": "Sep 29, 2011", "message": "MAN pages represent the worst documentation examples in the world."}, {"author_name": "AbyCodes", "gravatar_hash": "38c58b0f9ba238e18b8502bcf6337121", "author_url": null, "date": "Sep 30, 2011", "message": "Eric Lippert on memory management which Joel was talking about (giving example of a not-so-good-question getting an incredibly insightful answer in turn benefiting everyone): http://stackoverflow.com/questions/6441218/can-a-local-variables-memory-be-accessed-outside-its-scope/6445794#6445794"}, {"author_name": "duffbeer703", "gravatar_hash": "974938b8250a08cf9e22714aff1f9fcc", "author_url": null, "date": "Oct 01, 2011", "message": "Jeff is a Q&amp;A puritan.\n\nAs someone who answers alot of questions on a StackExchange site (not SO), I'm always hesitant to edit marginal questions, because my edit is going to be biased towards the answer I have in mind. That may or may not help the questioner. It feels rude for me to do that.\n\nMany programmers share a puritanical dogma with regard to closing questions and other behaviors that are likely perceived as anti-social or obnoxious to normal people. Folks talking about money, food or gardening aren't going to enjoy Usenet-style behavior."}, {"author_name": "afuzzyllama", "gravatar_hash": "610d1f10446fe748c0fc5a72728c1383", "author_url": null, "date": "Oct 04, 2011", "message": "I agree a little with Jeff on the fact that there are rep wars.  As someone who answers questions on PHP, I find that people are looking for rep on simple answers like \"how do I merge a string.\"  Whether you spend a second answering a question or 15 minutes answers a question you will still get the same amount of points for an upvote or an answered question.\n\nOne of my most upvoted answers took me (originally) 5 seconds to answer.\n\nI also just wanted to comment and say that I use SO and Careers 2.0 as a way for people to see what I have done.  It takes time to setup a blog and get a following/reputation.  Granted I could turn a blog like that into a financial opportunity down the line, but really what I do with SO is prove that I know more than the other guy when it comes to getting ahead in an interview or job posting.\n\nProbably as I become senior level this will be less relevant, but right now I think there is a lot of merit saying \"I have 100k rep on SO\" versus \"I run my own tech blog\" when it comes to a tech interview."}]}