{"response": [{"author_name": "Paresh Mayani", "gravatar_hash": "2c9f04076de133db434c7d9966ac6f6b", "author_url": "http://www.pareshnmayani.wordpress.com", "date": "Sep 29, 2011", "message": "This is the great information and Great API so far.\nBut eagerly waiting for the \"Write\" API along with \"Read-only\" mode API."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": "http://blog.stackoverflow.com", "date": "Sep 29, 2011", "message": "I also looked into how common vectorized requests are.\n\nThis is interesting because that's a distinctive part of our API (if not a novel one).\n\nTurns out about 10% of all requests have a vector, of those methods that accept vectors that is (this works out to just shy of 2.9 million requests).  While I'd like that to be higher, the user centric query patterns we found makes this understandable.\n\nThe top significant queries by # of vectorized queries are, in order:\n/posts/{ids}/comments\n/questions/{ids}\n/questions/{ids}/answers\n/users/{ids}\n\nOf those, only /posts/{ids}/comments has more vectorized requests than un-vectorized; though by a factor of 5x there.\n\nSome rough back of the envelope math suggests we saved more than 20 million round trips to our servers thanks to vectorized requests.  Assuming that each round trip takes about 50ms, we've saved users about 10 days of wait time (during the period discussed in this post)."}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": null, "date": "Sep 29, 2011", "message": "I'm also eagerly awaiting write abilities. I've almost got cached reads working in a FUSE file system, making that RW would be pure awesomeness.\n\nKind of funny, I thought chat would be a bit higher on the list of subscribers."}, {"author_name": "Kevin Montrose", "gravatar_hash": "0c0f8a17fe71547f718e013591008017", "author_url": "http://blog.stackoverflow.com", "date": "Sep 29, 2011", "message": "@Tim - yeah, we were a bit surprised that internal usage was so low.  Last time we investigated this it was nearer to 50% of total traffic."}, {"author_name": "badp", "gravatar_hash": "e64b121f4d288e1f5a34d3f4dc8ebfb9", "author_url": null, "date": "Sep 29, 2011", "message": "Somehow I'm not particularly happy that SO Live! is responsible for so many requests - 41% of all reputation calls ever - considered the quality of software and the few places I could act on reducing calls. It doesn't help it can't \"autoupdate\" or anything.\n\nMakes me feel like I really need to do something about it. Thanks for the wake up call."}, {"author_name": "George Edison", "gravatar_hash": "ddceaa7c14fb7186bc38cb5c83ca8861", "author_url": "http://www.quickmediasolutions.com", "date": "Sep 30, 2011", "message": "I can't believe that StackApplet topped the list!\n\nA big thank you to everyone who has worked so hard on the API to make it the incredibly awesome resource it is today (Kevin in particular - though I know others have had a hand in it now and then)."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.stackprinter.com", "date": "Oct 05, 2011", "message": "These are interesting stats, thank you!\nCould you please share the complete list with all the applications stats?\n\nAs an early API user, two key points have impressed me above all else: Reliability and Performance; they are simply top notch.\nSo, again, kudos to all the team.\n\nOh, these are my apps recommendations:\nthe neat Newt notifier for OsX, StackTack jQuery plugin and StackGuru to receive your daily StackExchange dose straight in your IM client.\n\nI'm pretty busy these days but I hope to give my feedback on the 2.0 Draft soon..ish ."}]}