{"response": [{"author_name": "jonnii", "gravatar_hash": "486a0111ccaa1779fdae6a6ff7fadf9c", "author_url": null, "date": "May 03, 2011", "message": "Why DC and not New York!?"}, {"author_name": "Robert", "gravatar_hash": "8412e434f40996cca46ca6c260aa9dd0", "author_url": "http://creatingcode.com", "date": "May 03, 2011", "message": "What about Texas?  [sarcasm]We have beaches also you know.[/sarcasm]"}, {"author_name": "C. Ross", "gravatar_hash": "ec4b051825229c870b5b4c0c9a371558", "author_url": "http://stackoverflow.com/users/16487/c-ross", "date": "May 03, 2011", "message": "Dates and Pricing?  A time when we would get to know dates and pricing?"}, {"author_name": "Joel Spolsky", "gravatar_hash": "95e6837f350869bfb44e069a98885c58", "author_url": "http://stackoverflow.com", "date": "May 03, 2011", "message": "The conferences will most likely be in September or October, although exact dates can’t be determined until we’ve got all the venues nailed down.\n\nThe price will be $399 for the US conferences and something similar  (albeit a bit higher due to taxes) in UK and Australia"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://about.me/cky", "date": "May 03, 2011", "message": "Ick, DC. :-(\n\nMy vote is for Chicago. Granted, it's not in Eastern Time, but is more accessible for people who live more centrally (hi Rebecca!), as well as Canadians, etc."}, {"author_name": "Joel Spolsky", "gravatar_hash": "95e6837f350869bfb44e069a98885c58", "author_url": "http://stackoverflow.com", "date": "May 03, 2011", "message": "Comments of the form \"What about ____(my city)____\" all have the same answer: No, there will not be a DevDays event in (your city) this year. There are many great cities and we only have limited resources, so choosing venues required us to make very painful decisions. Fortunately, there is an invention called an airplane, ... :)"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://about.me/cky", "date": "May 03, 2011", "message": "I take back my \"DC sucks\" comment. Well, DC does suck for a nerd, but a good friend was telling me that the cities near it, especially Baltimore, are awesome.\n\nSo hopefully the venue will be closer to Baltimore and further away from where all those scumbag lobbyists camp out. ;-)"}, {"author_name": "pfctdayelise", "gravatar_hash": "914ae4c68bfff39c8e9119bc25fbc210", "author_url": "http://brianna.laugher.id.au/blog", "date": "May 04, 2011", "message": "Woot Australia! Thank youuuuuuu! Nice not to be left out for once :)"}, {"author_name": "Jim McKeeth", "gravatar_hash": "e5ca3abec062f8174570a4b1d1c840d8", "author_url": null, "date": "May 04, 2011", "message": "In the Podcast it was \"West Coast (probably Seattle area)\" and you got me all excited. Bay Area isn't too far away though."}, {"author_name": "tim", "gravatar_hash": "94a0e83767dbc71db135454693540015", "author_url": null, "date": "May 04, 2011", "message": "I liked the one day event and I liked it in Boston.  I am also confused about the DC location - I would imagine there is greater appeal to having it in Boston or NY.  Oh well.  \n\nThe nice thing about the first DevDays was the affordability.  The amount Joel mentioned is great for a conference, but now you're adding hotel, travel and meals as well as an additional day - all significant costs - both time and money.  Those lucky enough to be in the area of an event previously only had to come up with the $99 - which I thought was the whole point of DevDays - to have an affordable one day event.  \n\nDevDays just took a turn towards being yet another expensive, inaccessible conference.  What a shame.\n\nThis policy of two days and in fewer cities pushes the average cost (not including time) to $1000-$1500 or more.  \n\nI realize the crew is trying to cater to those that complained last time, but now what I thought was the original intent is lost."}, {"author_name": "Jeffrey", "gravatar_hash": "bc49feef07133ab11b996f4ed8505b9d", "author_url": null, "date": "May 04, 2011", "message": "@tim\n\nI'm not sure this is exactly being \"inaccessible\". DC is in the middle of the east coast - it should cost less than $1000 to get a flight and one night in a hotel for this half of the country. For the target audience, I don't see how this is out-of-reach.\n\nI won't be attending, but I'm glad to see the push to make this a \"better\" conference. It helps the community as a whole."}, {"author_name": "tim", "gravatar_hash": "94a0e83767dbc71db135454693540015", "author_url": null, "date": "May 04, 2011", "message": "@Jeffrey - 2 days and $1000 is A LOT different than $99 or even $199 and two days.  I took a vacation day and paid for myself and drove to the Boston conference in 2009.   This new event certainly is less accessible.  \n\nThe whole notion of DevDays (from what I can remember) was to have an event that the rest of us can/will go to.  It was not to make just another corporate-type developer conference.  Oh well, I guess I can either try to build my own conference or look for others who want to continue the original spirit of the DevDays."}, {"author_name": "Michael Minton", "gravatar_hash": "3ee9f0e1bb5da8d8c6b5f2cee9b8e09a", "author_url": null, "date": "May 04, 2011", "message": "No love for the East coast. :("}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://about.me/cky", "date": "May 04, 2011", "message": "@tim: Re \"original spirit of DevDays\": Did you see what the guys at the Tartu, Estonia meetup did? They had a full agenda, with speakers lined up, etc. It was very well-organised, and there were about 100 people in attendance.\n\nhttp://www.meetup.com/stackoverflow/Tartu-EE/83510/\n\nI certainly think that that model is worth emulating."}, {"author_name": "Paul R", "gravatar_hash": "1977cbe0ac5ffec4f6ee5ee24363988a", "author_url": null, "date": "May 06, 2011", "message": "Did I miss the \"call for speakers\" or has this not yet happened ?"}, {"author_name": "Manoj", "gravatar_hash": "86489dd763bcf4be4a3d19548bc78002", "author_url": null, "date": "May 09, 2011", "message": "Hyderabad, India please. Next time if not this time."}, {"author_name": "Stan", "gravatar_hash": "b9ad197d64926023ac5fa1a15b3b9239", "author_url": null, "date": "May 09, 2011", "message": "DC has the strongest job market in the country http://tinyurl.com/42og6jj, and most of those jobs are in technology. It's also in the middle of the coast, with three airports, train-station, and right off of 95/295 for those driving. Solid choice, in my opinion."}, {"author_name": "Marco Cantu", "gravatar_hash": "5a8a3ffc2f683dcbe8aae3a85562519a", "author_url": "http://blog.marcocantu.com", "date": "May 09, 2011", "message": "Great idea. What is not clear to me to you plan having 4 different schedules with different speakers or brig the same event around the world? Or a mix of the two (some will be the same and some will be local speakers)?"}, {"author_name": "Alex", "gravatar_hash": "e96a421d76c1fc107a5d291c6999b2ef", "author_url": "http://alexanderdickson.com", "date": "May 09, 2011", "message": "Great idea about Australia. \n\nNow hopefully I'll be in one of those two cities by the time you guys come :)"}, {"author_name": "Jesse", "gravatar_hash": "7bb26b2a7848167e64e4da29741470b9", "author_url": "http://www.formsys.com", "date": "May 09, 2011", "message": "This sounds great - I'm planning a trip to the US around that time and been looking for a conference or something to justify it as work related.\nI just hope the venues can be nailed down soon so international travellers like myself can plan around it - September isn't far away!"}, {"author_name": "Mike", "gravatar_hash": "c98e188ba63a7875d61a77d7aaa3f5c7", "author_url": null, "date": "May 10, 2011", "message": "I'm quite disappointed that you're reducing the number of DevDay appearances by so much. In regards to the UK it's also disappointing that the conference is going to be held in London when there are plenty of other worthy cities that would probably be cheaper to host and easier to get to.\n\nBristol or Cardiff would be fantastic places to hold a conference, and for ease of transport you can't beat Birmingham. I'd like to go, but getting to London is always awkward. At least in Bristol people could drive and find somewhere to park."}, {"author_name": "Michael Chermside", "gravatar_hash": "3c2ce5e843cef58cf546b403c6233597", "author_url": "http://mcherm.com/", "date": "May 10, 2011", "message": "To everyone who is complaining that they want a conference in their own hometown:\n\nGo ahead and schedule it. Seriously... if you can organize and plan the conference, find a venue, plan speakers, and everything else then the only thing missing is publicity.\n\nThe StackOverflow guys strike me as being pretty flexible and open to creative solutions. If folks from Chicago, Boston, Bristol, Cardiff, Birmingham, or whatever other location held a conference this year, then asked next year if they could affiliate their conference with the official StackOverflow schedule, I'll bet that there would be some real interest. Step 1 would be to organize the conference yourself."}, {"author_name": "Paul Broadley", "gravatar_hash": "dac41fed4ed9736ff12db930ae1595f1", "author_url": "http://www.argussoftware.com", "date": "May 11, 2011", "message": "London!. I'll be popping along, in fact I'll bring the team!"}, {"author_name": "Mahalie", "gravatar_hash": "93c8230e89d7a7ba5dd5246aad8bdf08", "author_url": "http://23rdworld.com", "date": "May 13, 2011", "message": "I suppose SF is the obvious West Coast choice but do consider the burgeoning dev population in Seattle - not only do we have lots of big employers opening satellite offices here it might be your last chance before the whole city is one big pile of gridlock when the viaduct goes down."}, {"author_name": "Paresh N. Mayani", "gravatar_hash": "5ba63131f06e002b7648e84672644980", "author_url": "http://www.pareshnmayani.wordpress.com", "date": "May 15, 2011", "message": "We would like to have the same kind of DevDays in india, when do you plan for the same in india?"}, {"author_name": "Dan Sorensen", "gravatar_hash": "4eb23f2813f95b68c26d7b39e7c0f825", "author_url": "http://djsoren.blogspot.com/", "date": "May 16, 2011", "message": "From Portland - Loved DevDays 09 in Seattle! I'm willing to go to the Bay Area if I can work it in my schedule. (Sept is busy for us) \n\nI enjoyed the ASP.MVC, Python and jQuery talks. Really learned lots. If it's on your radar, I'd love to hear about OAuth and OpenID - I know you use them at Stack Overflow. It would be fun to hear about Micro ORMs such as Massive and Dapper. They are clever out of the box solutions to common issues.\n\nAnd like the others, I'd be happy to learn more about DVCS and HTML5."}, {"author_name": "shreesh", "gravatar_hash": "24e6d15c23e648ee8c4816aa621195dd", "author_url": null, "date": "May 26, 2011", "message": "Bangalore! BANGALORE! please! for the love of god, include Bangalore!. [hope I am being desperate enough :)]"}, {"author_name": "Andrei", "gravatar_hash": "96cc2fcb4070ca575b297c01e4ca313e", "author_url": null, "date": "Jun 03, 2011", "message": "It's still a reasonable price. Yes, hotel, plane, meals will add up, BUT, those in the US, don't forget, you are writing it off as a work-related expense! If you are paying back taxes, why not spend that money on the conference. You'd give them money back anyway. Or get paid back ;)"}]}