{"response": [{"author_name": "Justin Nelson", "gravatar_hash": "d787caaf04b85641692a24099fcee990", "author_url": null, "date": "May 11, 2011", "message": "Need more help taking care of flags?\n\nI think I know a guy who would love to help...\n\n:)"}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://quickmediasolutions.com", "date": "May 11, 2011", "message": "First of all - I like the idea of checking code online. I actually did write such a thing - it's a UserScript for the Code Golf site:\n\nhttp://meta.codegolf.stackexchange.com/questions/170/code-golf-userscript-to-help-in-navigating-the-site-v0-37-now-available\n\nIt detects code in a question and if the language is supported by CodePad, then it presents the user with a link to run the code. It's not perfect - but it works for some samples.\n\nSecondly, as for a new name for DevDays – perhaps that would make a good Meta post. My first thought: Stack Exchanges.\n\nHere’s the Meta question:\n\nhttp://meta.stackoverflow.com/questions/90828/does-devdays-need-a-new-name"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "May 11, 2011", "message": "First question is what are the chances to get skeet on the SO team :) ... he has a lot of good ideas.  A comment about the topic concerning chat.  I think you guys did a fabulous job of implementing it.  It's fast, nicely designed, and works well.  But I'll be quite honest, that effort to me seems to be wasted.  Rarely if ever do people use it...the few times I've used it either no one was talking, or everyone was simply idle.  No offense as I said, I think the implementation was done great..but it suffers from any other chat client.  I mean come on who uses AIM, Yahoo Chat, or any of that stuff anyhow.  You can argue Skype, however I think skype's success is due to telephone / communication via the web with web cam technology.  I just don't see a lot of value in stackoverflow or any stack exchange site using chat.\n\nI would of also liked to hear more from Marc G.  It seemed like he was not included in the topics and Jon Skeet is an incredible programmer, but we cannot forget Marc is also a great programmer."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "May 11, 2011", "message": "Just in case anyone was concerned - we'd actually started the podcast recording a bit late anyway, so if I'd put the dinner in at the time requested by Holly, it would have been burnt by the time we were ready.\n\nFortunately, Holly put it in shortly after she returned home, and we were able to eat with little delay.\n\nThanks to Joel, Marc, and our live studio guest Tom for a cracking evening."}, {"author_name": "Donal", "gravatar_hash": "2d927115d3eda8c02c44b306a847c95b", "author_url": null, "date": "May 11, 2011", "message": "I'd like to hear Jon Skeet talk about the difference between the .Net and Java ecosystems/communities.\n\nNot so much a comparison of the C# and Java languages, as this has aleady been done to death, but the other factors that affect the overall experience of developing on a particular platform e.g. tools, community, libraries, etc."}, {"author_name": "Tom Robinson", "gravatar_hash": "4c6128b1c3929d4900352bd3d3a82b35", "author_url": "http://www.tjrobinson.net/", "date": "May 11, 2011", "message": "Good stuff, a fun evening :)"}, {"author_name": "Svick", "gravatar_hash": "0ec0f5be7749c8cc8ccda4a809103f36", "author_url": null, "date": "May 11, 2011", "message": "Apart from Compilr, there's also ideone.com, which I occasionally use. It has very similar functionality with more languages and is free."}, {"author_name": "ChrisF", "gravatar_hash": "ee006a67bbbb535dc04afc6a03b1843f", "author_url": null, "date": "May 11, 2011", "message": "Interested to hear more about other metrics than accept rate to show community engagement. I get annoyed with the \"accept rate bullies\" but had unfortunately decided it wasn't worth doing anything about it. I will certainly start flagging such comments now."}, {"author_name": "finnw", "gravatar_hash": "1d329f562180503bd1e91997f57fcaff", "author_url": null, "date": "May 12, 2011", "message": "I agree with Jon about voting on questions but I don't like that \"You haven't voted on a question in a while\" popup.  I *do* vote on questions.  I have the Electorate badge.  I just haven't voted on any questions *today*.  That doesn't mean I have a habit of not voting on questions."}, {"author_name": "MBraedley", "gravatar_hash": "faee7c8a4f200567714ca387446d8721", "author_url": null, "date": "May 12, 2011", "message": "What do you have against Nova Scotia, Joel?  I'll have you know that there are plenty of innovative companies here."}, {"author_name": "Marc Gravell", "gravatar_hash": "b4ae7f8b50a2c32287e456394570679e", "author_url": "http://marcgravell.blogspot.com", "date": "May 12, 2011", "message": "&gt; I would of also liked to hear more from Marc G.\n\nA 4-way podcast gets pretty hectic, especially when by the time you've heard a pause (with lag etc) the pause is no longer there. I was there, honest ;p"}, {"author_name": "Tom", "gravatar_hash": "fc216778f638c87af86a6241ca36b3a2", "author_url": null, "date": "May 12, 2011", "message": "I'd like to hear him talk about Linq"}, {"author_name": "Doug T", "gravatar_hash": "680652ec4feb1969c39cfba008214ea9", "author_url": "http://ilearnstuff.blogspot.com", "date": "May 12, 2011", "message": "The \"inside baseball\" stuff is very useful for letting higher rep users know what the current goals of the community are and as a useful summary of the ongoing debates. To that extent I found Jon and Jeff's debates pretty useful. I now know that I shouldn't fear flagging stuff-- its not just for hate speech and spam -- and exactly in what cases I should feel motivated to flag."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "May 12, 2011", "message": "There is podcast spam now? (the comment at 2.52) the bizarre world of spam never ceases to amaze me. \n\nAnyway, nice podcast and a pleasant listen!"}, {"author_name": "Jim McKeeth", "gravatar_hash": "e5ca3abec062f8174570a4b1d1c840d8", "author_url": null, "date": "May 12, 2011", "message": "In addition to http://www.compilr.com/ check out http://ideone.com/ and http://coderun.com/. CodeRun looks just like Visual Studio and IdeOne lets you compile and run just about every language imaginable."}, {"author_name": "McDowell", "gravatar_hash": "9061706d2661cf0fa9f2df0eee56cf9b", "author_url": "http://illegalargumentexception.blogspot.com/", "date": "May 13, 2011", "message": "RE: What Jon should speak about\n\nI wouldn't mind hearing Jon speak on the subject of C#. I don't know C#, but looking in from the outside I see that the maintainers tend to add new language features on a regular basis. An overview of the language, starting with the syntax for version 1 and building up to version 5 would be of interest to me.\n\nSince this is a language some in the audience are likely to know in depth and some won't know (or care about) at all, I realize such a talk would be difficult to construct. The evolution of the language lends it to all kinds of metaphors; building up some sort of Heath Robinson/Rube Goldberg program; using the syntax to do cool stuff; hopefully some combination of these would be enough to keep everyone entertained."}, {"author_name": "Ninefingers", "gravatar_hash": "893b695548c4c8a5fcf91edb92785490", "author_url": null, "date": "May 13, 2011", "message": "I listened to the podcast for the first time - a good listen. \n\nOn accept rate, I suggested this a while ago on meta (I called it citizenship and compared it to Windows's system rating): http://meta.stackoverflow.com/questions/80312/why-are-votes-per-post-on-the-decrease-what-can-we-do-to-improve-this/80626#80626 The first half of the post is slightly worthless I think; the second half is sort of what you're suggesting. Note, the actual implementation of it would probably benefit from this: http://www.evanmiller.org/how-not-to-sort-by-average-rating.html i.e. **crucially** weight people's score based on the amount of information receive. So persistently bad users' scores degrade the more they abuse the system, whereas people who contribute get better scores. Weight it across valid flags, edits, votes, answers etc and accept rate.\n\nSecond thing, you mentioned languages. As someone who did a module in French at university, I've got some experience with translation. The example I'd like to point out is the phrase \"to get\" in English. There is no equivalent in French - to get on a bus = prendre le bus (to take the bus), to get up = se lever (literally to raise oneself), to get a present = could be anything, j'ai achêté un cadeau (I brought a present) ou J'ai reçoit un cadeau (I received a present). It depends entirely on context.\n\nWhat you see in the dictionary, therefore, for `to get` is a huge list of possible scenarios. You have to search through and find the one you're after. So it may be that a non-native speaker has not done this when translating an idea from Unicorn to English, for example, where the concept in Unicorn has no direct equivalent or several possible equivalents in English. That's the why.\n\nAlso, whilst google translate is improving, it isn't perfect and never will be. Therefore, perhaps users are using that (or equivalent) to check their posts.\n\nOn the subject of translation, I've been keeping this reasonably quiet, but: http://stackapps.com/questions/2392/stack-overflow-ui-translation-via-greasemonkey is a translation effort of the UI by yours truly. I took your html apart with firebug and am using greasemonkey/jquery to literally replace English strings on the UI with French ones. It isn't finished, it's still a bit buggy and I'm not a native French speaker so some translations may be off (I did it last weekend at about this hour) but I thought it might provide a template for some initial crowdsourced translations...\n\nNinefingers"}, {"author_name": "Rupert", "gravatar_hash": "a923d42ccf0b28810552f10d950faa13", "author_url": null, "date": "May 17, 2011", "message": "The stackoverflow faq describes the site as a sort of mashup between, amongst other things, a forum and a wiki. The attitude towards \"good questions\" expressed on this podcast worries me slightly as it seems to have been inherited from the forum side of this ancestry. \n\nForums have systemic problems when it comes to answering questions but these are often portrayed as faults with the users. One mentioned in this cast is that it is unfair if the questioner has put less effort into the question than the answerer puts into the answer. As a result gaps can appear in the collective knowledge as questions lacking this quality are rejected.\n\nWikis do not have this problem. Knowledge is treated as an item to be shared, its expression to be refined as much as possible. The questioner, in the case of Wikipedia, is the reader of a given page and is not expected to have put in any effort. Yet despite this, a wealth of knowledge is still developed.\n\nI believe poorly worded questions should be seen as an opportunity to ask better questions by utilising the wiki feature on stackoverflow. Judgements made about fairness, whilst accurate, lack utility and encourage people to actively ignore these opportunities."}, {"author_name": "Bill P. Godfrey", "gravatar_hash": "760bfd359153d0682dbe113dc02f81ba", "author_url": "http://billpg.com/", "date": "May 19, 2011", "message": "Jon's bit...\n\nI'd like to hear more about times and timezones, and a little about what he's learnt developing NodaTime."}, {"author_name": "rich", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Jun 09, 2011", "message": "Jon, for someone who's run his reputation to the max and clearly does care about it (from comments later on in the podcast about StackExchange hiring his rep-competitors), it's really insulting of him to say that people complain about accept-rates because they're rep-whores (paraphrasing).\n\nI mean honestly, Jon, it doesn't occur to you there would be any other reason someone would care about a questioner's accept rate other than the chance of getting a few extra rep points?\n\nAccept-rate is the most visable way to determine if the user is a hit-and-run questioner, that is someone who may not even come back to read the answers, won't vote any of them up themselves and won't offer any feeback as to whether the answers even helped. I appreciate in your annoying Ned Flanders way you want to help everyone, but answering those questions is a waste of people's time and I don't care about my rep, but I do care about wasting my time trying to help someone who doesn't even care that they're being helped.\n\nSo I don't try and be rude to users with low accept rates, but I will comment on it. If people think that's wrong (and Jeff and Joel didn't disagree with Jon as far as I could tell), then accept rate should be removed from the site. It's absolutely pointless to show a stat and then expect people not to act on it."}]}