{"response": [{"author_name": "commenter", "gravatar_hash": "643791363b9abebf0d23d5b4049486fa", "author_url": null, "date": "May 04, 2011", "message": "Thanks for clearing up the 'lunch' controversy! If I can summarise, it's totally non-negotiable, it's totally optional, and if you disagree you're an angry teenager. :)\n\nBy the way Subaru's have a big following because they do souped up rally cars. Jeep Wranglers - that's for guys who wear cutoff jeans and own a tiny dog, I believe."}, {"author_name": "CEMcFarland", "gravatar_hash": "81af1078c345dd5d3a3dc00d3c21bf60", "author_url": "http://cemcfarland.wordpress.com", "date": "May 04, 2011", "message": "StackExchange has a podcast? Awesome."}, {"author_name": "Scott Hanselman", "gravatar_hash": "719c91f5c3013e43ee46ed2bdc67f883", "author_url": "http://www.hanselman.com", "date": "May 04, 2011", "message": "It's funny you kept the random stuff at the VERY end."}, {"author_name": "JGarrido", "gravatar_hash": "91accb994e5e0def4558d9b6c36ef535", "author_url": null, "date": "May 04, 2011", "message": "Is there a podcast feed I can subscribe to from my Android device (Google Listen)?"}, {"author_name": "Billare", "gravatar_hash": "d17af858425df3cef2dc38b5a7426c4b", "author_url": null, "date": "May 04, 2011", "message": "Hanselman is just parading ignorance for profundity.   He can't tell the difference between Hacker News and Reddit?  Didn't Paul Graham write a blog post on that very thing."}, {"author_name": "Marcelo", "gravatar_hash": "1f3a0119afecf00c57fcdb88f5ca5582", "author_url": null, "date": "May 04, 2011", "message": "@Billare,\nThe fact that Paul Graham wrote something doesn't mean everyone read it.\n\nI enjoy listening to Scott Hanselman. \n\nPlease! bring Steve Yegge!"}, {"author_name": "Scott", "gravatar_hash": "6285ff8f79ce11a5c9161011137258bc", "author_url": null, "date": "May 05, 2011", "message": "Do you have a mirror? SoundCloud seems to be down."}, {"author_name": "GregB", "gravatar_hash": "8ccccf51ea96b31cef59a77a2d898e83", "author_url": null, "date": "May 05, 2011", "message": "The last two and a half minutes are amazing!"}, {"author_name": "C. Ross", "gravatar_hash": "ec4b051825229c870b5b4c0c9a371558", "author_url": "http://stackoverflow.com/users/16487/c-ross", "date": "May 05, 2011", "message": "What I really want to know is what Scott really has against the good people over at RPG.StackExchange.com? ;-)"}, {"author_name": "Justin Nelson", "gravatar_hash": "d787caaf04b85641692a24099fcee990", "author_url": null, "date": "May 05, 2011", "message": "Hmmm, I found myself disagreeing with Scott about 90% of the time when he was talking about the Stack Exchange site rules/system.\n\nI wonder how many other people have the same view point as he does."}, {"author_name": "tim", "gravatar_hash": "94a0e83767dbc71db135454693540015", "author_url": null, "date": "May 05, 2011", "message": "I want to know what the bad joke Jeff said at the beginning was supposed to be - \"Black hair\" - Scott clearly didn't appreciate that comment.  At all.\n\nAnd what is wrong with Subarus?"}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": null, "date": "May 05, 2011", "message": "There still seems to be a bit of a problem with sound levels - especially with Joel, there are times when I really strain to hear him. Is he using the same microphone as before? Are you guys still using the Levelator?\n\n(Otherwise, good show!)"}, {"author_name": "Joel Spolsky", "gravatar_hash": "d77663c217e9d27b725338c06674c94b", "author_url": "http://joelonsoftware.com", "date": "May 06, 2011", "message": "Producer Alex promised to buy me a better microphone."}, {"author_name": "JohnMcG", "gravatar_hash": "684937423429d5b6eceb9161dbe101fb", "author_url": "http://profiles.google.com/JohnMcG", "date": "May 06, 2011", "message": "I think this podcast crystallized for me the \"problem\" I have with the Stack Exchange reputation/governance system.\n\nFirst, I understand that many people reject the notion that reputation points are some type of currency.  But they are a visible number, and are the most prominent part of the careers profiles, and people do care about it.\n\nI also understand the need for some mechanisms for stewardship and clean-up in the Stack Exchange ecosystem, so it doesn't devolve into a free-for-all.  This will include some policing, and incentives for people who do that work.\n\nMy problem is that the Stack Exchange system conflates the rewards for these activities.  \"Real\" society has police officers, firefighters, and garbage collectors, but these aren't usually the professions with the most prestige, and we don't (generally) reward these people based on how aggressive they are in carrying out these duties.\n\nThis is Wikipedia's problem -- that they in essence reward people for being assholes, so they get a lot of assholes.  Here, there's a potential real-world reward for being an asshole.\n\nI'm not sure I have a solution, but I think it would include separating the rewards for stewardship activities from the rewards for producing helpful content."}, {"author_name": "Pietro Polsinelli", "gravatar_hash": "5198744cd329b6dfdb9e39b4f9794cd1", "author_url": "http://http.//pietro.open-lab.com", "date": "May 08, 2011", "message": "For the city metaphor, Jeff observations made me think that you probably are metaphorically similar to a touristic town: like Florence town center has about 50.000 inhabitants but gets millions of visitors. So the town hall has to spend (and tax) for keeping the center clean not what a town spends for a zone of 50K inhabitants, but several times that. And the central parts have to be friendly for both tourists and permanent residents...\n\nAnyway its Sunday, there are too many tourists downtown and I'm writing silly comments here."}, {"author_name": "Ian Ringrose", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "May 08, 2011", "message": "If I have a “ford” car then all the bits are “ford”, however when I use C# often I have none Microsoft bits that are part of the problem.   Hence programmer tend to overlap each other in lots more ways than “gas heads”."}, {"author_name": "Anthony", "gravatar_hash": "1e1dbaeefb595469e31863511e94b332", "author_url": null, "date": "May 08, 2011", "message": "Joel, use your radio voice. You typically start off at a decent enough volume when you begin a statement, and then you trail off into what comes off as a whisper. When you're speaking directly into somebody's ear or headset and you have their undevided attention, that probably works well. In a podcast format? Not so much. I enjoy the SE podcast, and I usually enjoyed the old SO podcast, but if you're committed to doing it, I humbly request that you treat it more like a broadcast rather than a conversation that you're just happening to record."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 08, 2011", "message": "> I’m not sure I have a solution, but I think it would include separating the rewards for stewardship activities from the rewards for producing helpful content.\n\nThis is precisely why flag weight works the way it does, completely independent of the user's reputation. It is also why validated flagging results in greater flag weight and more flags being given to the user."}, {"author_name": "Edward Tanguay", "gravatar_hash": "a9eaafb332f36840447f60dd85b94d19", "author_url": "http://www.tanguay.info", "date": "May 11, 2011", "message": "Intersting podcasts guys, glad they are back. I wonder if on an upcoming show you could talk about the possibility of extending StackExchange to a online trainer platform, i.e. giving users the tools to easily organize selected answers into lessons, and giving them the ability to more easily create structured tutorials and embed video and audio in a way that, e.g. if I want to teach a course on C#, I could easily select from the vast content of good C# questions/answers on Stackoverflow as 50-80% of the content of a course and then use available tools to build a complete course around it. Others could find the course and work through it online, or other trainers could use the course material to teach the course onsite, or use tools you provide to easily add or subtract content. It would be a good way to repurpose your content and, as you say, make the Internet a better place, in this case: to take online courses on C#, baking a good cake, or learning English grammar, etc. Other companies are attempting this (e.g. www.sophia.org) but they unfortunately suffer from a lack of participants and lack of a mature reputation system that StackExchange already has, and hence these attempts easily degrade into quagmires of low-quality content and get abandoned. StackExchange, on the other hand, already has large amounts of content ready to be turned into high-quality online courses if you would just provide trainers with the right tools to do it."}, {"author_name": "Sudipta Sarkar", "gravatar_hash": "9c8f41cbf471c978f0ec67005dc874b8", "author_url": "http://www.buybooksonline24x7.com", "date": "May 14, 2011", "message": "Books are your best friends, for they give you the access to the knowledge-land. Books let you know about the happenings around you, and BuybooksOnline24x7.Com efforts to uplift this knowledge-sharing affair further. Visit www.buybooksonline24x7.com for details."}, {"author_name": "Paul Turpie", "gravatar_hash": "0ce04b8b506882546954e79d69a5ed92", "author_url": "http://www.bendigoford.com.au", "date": "Jun 27, 2011", "message": "I don't think you guys realize that mechanics do a lot of research and training away from actual cars. I work for a car dealership and our technicians (mechanics) will often look up how to do stuff online, usually through the manufacturers sites, and occasionally on public sites and forums.\nOur guys do have access to a ruggedised laptop, but it is usually used for diagnostics than for \"howto\" information. Unlike you or I they know what they're doing with cars, and if they come across an unusual problem will just read what they need to do in the office then go and do it. They might print off a diagram for complicated stuff, but they're not watching YouTube videos at the side of the car showing them how to fix it."}, {"author_name": "anonprogrammer", "gravatar_hash": "1d4613675a4410fb815efc4ffac3e689", "author_url": null, "date": "Apr 17, 2012", "message": "\"I want to know what the bad joke Jeff said at the beginning was supposed to be – “Black hair” – Scott clearly didn’t appreciate that comment. At all.\"\n\nScott once posted a bizarre blog entry on black hair care and styling, where he revealed, among other things, that he actually aspired at one point to become a hair dresser specializing in black hair: http://www.hanselman.com/blog/ArushaTanzania2006Day24BlackHair.aspx"}]}