{"response": [{"author_name": "Ivo Flipse", "gravatar_hash": "f7ae8c8fb83e502a854e2db3410f3827", "author_url": "http://superivo.wordpress.com", "date": "May 18, 2011", "message": "You could always add a [Like] or [+1] button to have anonymous users show their satisfaction ;-)\n\nAs for the drop in traffic: how did this affect our other metrics? Because if these visitors weren't searching for us anyway, then perhaps we don't miss them either."}, {"author_name": "Justin Nelson", "gravatar_hash": "d787caaf04b85641692a24099fcee990", "author_url": null, "date": "May 19, 2011", "message": "Why are you hating on Iowa!! :)\n\nI thought you knew someone important from Iowa. :P"}, {"author_name": "balpha", "gravatar_hash": "b13dce689732844e6590da37048f0eaf", "author_url": null, "date": "May 19, 2011", "message": "Small correction: For the most part, the cache breakers (i.e. version numbers for the static files) aren't revision hashes any more, but indeed hashes of the actual file contents.\n\nAnd some CDNs don't use ugly DNS hacks (\"What IP address I'm giving you depends on were you're at\") but an even uglier hack called \"Anycast\", which basically (to my understanding of it) means having many servers with the same IP address, so the hopping stops whenever you find one of them; usually the closest.\n\nI mean \"ugly\" in the most positive sense here :)"}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "May 19, 2011", "message": "Battlefield Earth was written by L. Ron Hubbard, not Robert Heinlein.  ಠ_ಠ"}, {"author_name": "Jon Smock", "gravatar_hash": "7cf5af9e0f94976adae00ce7dfdd467b", "author_url": "http://jonsmock.com", "date": "May 19, 2011", "message": "As for putting version numbers/hash values in the name of the static files, you actually want to make it in the name of the file and not just appending ?v={version} to the end.\n\nI'm looking at the StackOverflow  now, and I see:\n\nhttp://sstatic.net/stackoverflow/all.css?v=4259c6c683b5\n\nThis should probably be:\n\nhttp://sstatic.net/stackoverflow/all-4259c6c683b5.css\n\nWhich will prevent even the dumb proxies from serving the old cached file."}, {"author_name": "Jon Smock", "gravatar_hash": "7cf5af9e0f94976adae00ce7dfdd467b", "author_url": "http://jonsmock.com", "date": "May 19, 2011", "message": "Doh, just realized that \"head\" was removed from my previous comment.  I didn't mean \"the Stackoverflow now\", I meant \"the Stackoverflow [head] now\" but with angle brachets."}, {"author_name": "Matt B", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": "http://blog.mattnworb.com", "date": "May 19, 2011", "message": "\"It’s amazing how many highly technical people don’t think to clear their browser cache when they’re having a problem with a website loading.  Always clear your browser cache and try again before contacting a site’s support team. Please?\"\n\nThis seems like it is asking a lot out of your users. Frankly, if stale resources can cause a problem for your users, then it seems like there is another problem going on - lack of proper control of these resources on the server-side (i.e. proper headers, etag validation, etc)."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 19, 2011", "message": "@mattb there are a lot, and I mean a LOT, of broken proxies on the internet. Also browser bugs. And OS issues."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "May 26, 2011", "message": "Shog has got a really cool voice!\nAnd Jeff sounds much more cheerful when he speaks than in what he writes on Meta. :) \n\nOnce my migration plans to the US have come to fruition, I hope to see you guys in person some time over a beer or something!"}]}