{"response": [{"author_name": "Neil Barnwell", "gravatar_hash": "fac42e3f137bfe0f34b8493c41d28f9e", "author_url": "http://koder.wordpress.com/", "date": "May 06, 2011", "message": "\"every time you vote until you do\" Really? Sure? Maybe \"every 15th answer vote without a question vote\". Remind us every now and again, not on every single answer vote.\n\nThose little notification boxes are *ever so slightly* more irritating than you might think..."}, {"author_name": "anonymous", "gravatar_hash": "a99d9907568d07f3210a5824c40f3b4d", "author_url": null, "date": "May 06, 2011", "message": "It would nice if you also show the average number of votes users have cast, so each user can compare his record to other users."}, {"author_name": "Roopesh Shenoy", "gravatar_hash": "8e5e0b149f4ef473a94a6b0586f1c7e0", "author_url": null, "date": "May 06, 2011", "message": "Don't try to change people, change software instead - why don't you just distribute some percentage of votes that answers receive to the question itself? It's not perfect (especially if that question does not get answers) but it will work in a lot of cases."}, {"author_name": "Bernhard", "gravatar_hash": "522bfb2b2abb791df510f18dee8f9a9d", "author_url": null, "date": "May 06, 2011", "message": "Even if the question is a good one to ask, I mostly save the up vote for questions that are well written and presented. Few people seem to put enough effort into writing a really well constructed and presented question, but some; some are just amazing. With the latter it's as if the author knows that they're contributing to a Q&amp;A styled wiki rather than just seeking an immediate answer."}, {"author_name": "Gareth", "gravatar_hash": "21053fc472ce35063e175e9cfbb78e6b", "author_url": null, "date": "May 06, 2011", "message": "I think the reason answers are voted on more, is that when you are presented multiple answers you can easily see that [this answer] is better than [that answer] – something which doesn't happen with questions."}, {"author_name": "Phil", "gravatar_hash": "518022af3db853142b3f7413175a5190", "author_url": "https://twitter.com/pombr", "date": "May 06, 2011", "message": "Jeff:\nIf someone does not vote questions up once, this is their fault. The second time this is yours!\nYou say: \"So how do we encourage people to remember the questions when voting?\"\nwell what about something simple?\nGive me the opportunity when I vote p an answer to vote up the question at the same time, in the same place, aka the same button!\nOr combine all the votes of all answers to make up for the score of a question"}, {"author_name": "Phil", "gravatar_hash": "518022af3db853142b3f7413175a5190", "author_url": "https://twitter.com/pombr", "date": "May 06, 2011", "message": "I mean you have written the answer to your concern yourself in your post:\n\"If a question is worth answering, isn’t it at least worth considering whether you should upvote it? Assuming you can remember to scroll all the way back up to get there, that is.\"\nSo my point : just make it so I can vote the question where I vote for the answer. No scrolling back up... ;)"}, {"author_name": "Jan Fabry", "gravatar_hash": "91354ef2eccac3d92ab21b03dd0eab80", "author_url": "http://www.monkeyman.be", "date": "May 06, 2011", "message": "Jeff, do votes affect the ordering on the homepage for SE sites? I know they have an effect on the redesigned SO homepage, but do SE sites still just order by \"recent activity\", and does a vote count as activity?\n\nI want to attract more experts, by highlighting the tough but interesting questions that did not get a good answer yet. Voting is a good way to indicate which questions are interesting, but I don't know whether the current homepages reflect this."}, {"author_name": "Eduard", "gravatar_hash": "74a9c07c5b31b883768def1c4eb78782", "author_url": "http://asimilatorul.com/", "date": "May 06, 2011", "message": "Another step might be to split Votes Cast category in the user profile by questions and answers, and you might create some badges for some given ratios.\n\nOr, on the first vote given to an answer, show a popup allowing me to choose to up/down-vote the question or not – there might be some medium quality question that don’t deserve an up/down-vote, but the answer might be a worthy of an up/down vote."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 06, 2011", "message": "@eduard you mean like the existing Electorate badge? :)\n\nhttp://stackoverflow.com/badges/155/electorate\n\n@jan\n\nQuestion score does not affect ordering on the default homepage active tab, however, it does affect what appears on the hot, week, and monthly tabs. It also affects the default unanswered question view."}, {"author_name": "Eduard", "gravatar_hash": "74a9c07c5b31b883768def1c4eb78782", "author_url": "http://asimilatorul.com/", "date": "May 06, 2011", "message": "@Jeff: yes, and you can add another one for a different ratio, or make it cumulative (recompute it every 1000 votes, or something like that)."}, {"author_name": "Robert", "gravatar_hash": "9ef9b66c0e0e5d7b3b9d08d317d9bf8b", "author_url": null, "date": "May 06, 2011", "message": "The most highly voted questions tend to not be questions at all:\nhttp://stackoverflow.com/questions?sort=votes"}, {"author_name": "BrunoLM", "gravatar_hash": "ef1a0f00d57917768acdc5b379ca1b28", "author_url": "http://orkutmanager.net/", "date": "May 06, 2011", "message": "I've noticed that on my user-dd and I though: \"hey this is very nice, I should probably vote more\".\n\nThen I looked at the rank and though: \"damn, I'm not the first\"\n\nI mean, this is a very nice approach, I think you got the best possible idea."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 06, 2011", "message": "@robert that's the tension, and a perfect example of why it's actually a very bad idea to have questions inherit answer votes even indirectly. I actually believe the \"fair market value\" of any question is pretty much what our economy tends to value them at -- zero.\n\nThe only thing we want to correct here is the \"oops, I forgot I could even vote on questions!\" issue as well as potentially adjustments to workflow/UI."}, {"author_name": "John Parker", "gravatar_hash": "9207dac1a08f23791251e6170b787646", "author_url": "http://www.surface.org.uk", "date": "May 06, 2011", "message": "Nice improvement.\n\nThat said, I'm not sure what constitutes a bad question that should be downvoted - there are after all mechanisms for closing/migrating off topic questions, marking as duplicates, etc.\n\nI'd therefore be intrigued as to what you think constitutes a bad question. Should a lazily composed question, or one where the answer is trivially available be deemed bad for example?"}, {"author_name": "Jan", "gravatar_hash": "be68515e3f82f46856a6f3cc3a41a274", "author_url": null, "date": "May 06, 2011", "message": "The problem with voting on questions is that it's not obvious why I should vote on questions, why it is important to vote on questions. Because it's a \"good question\"? It's completely unclear to me what \"good question\" means.\n\nEncouraging users to vote more, in this situation, only adds more confusion. We are encouraged to vote more but we still don't know why!\n\nWe should communicate better WHY it is important to vote, rather than THAT it is important to vote.\n\nSo why is it important to vote?\n\n1. Because we want good questions without good answers to be displayed at the top. Let's call it what it is then, let's call the up-vote button the \"This question deserves better answer\" button. Now it's clear what it means!\n\n2. Any other reason?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 06, 2011", "message": "> I’d therefore be intrigued as to what you think constitutes a bad question. \n\n> Because it’s a “good question”? It’s completely unclear to me what “good question” means.\n\nWow, I suggest you guys spend a few nanoseconds on\n\nhttp://stackoverflow.com/review/low-quality-posts\n\nBut even one or two femtoseconds should suffice, really...\n\n> Why can’t you scrap question voting and calculate a question score from all the metadata? (number of answers, votes on answer, page views, comments, etc).\n\nBy this metric, “What is Your Favorite Programming Cartoon?” is now the best question any human being has ever asked in the entirety of recorded time.\n\nYou were saying?"}, {"author_name": "giles", "gravatar_hash": "6224fdfd2e9ed2462baf7e5844bbd7c7", "author_url": null, "date": "May 06, 2011", "message": "Two thoughts.\n\nQuestions are using expressing a problem. It's not instinctive to reward a problem. \"Yes, great problem, I love that you have this problem, here's an up vote!\" People like to reward answers, not problems.\n\nWhy can't you scrap question voting and calculate a question score from all the metadata? (number of answers, votes on answer, page views, comments, etc). If a question generates activity and answers, and answers that people vote up, then it's a good question."}, {"author_name": "Jan", "gravatar_hash": "be68515e3f82f46856a6f3cc3a41a274", "author_url": null, "date": "May 06, 2011", "message": "Down-voting is pretty clear to me. It's because there is a _reason_ for doing it, by down-voting I want to achieve something, I want to save time for other people by saying \"This question is not worth reading, put it as low in all lists as possible\".\n\nUp-voting doesn't work that way. I have no good reason to say \"Hey, this question is useful and clear\". Why would I do that? Interestingly, on Reddit the intent is clear, I want to say \"Look everyone, this is very interesting!\" or just \"Had fun, thanks!\" My point was that for up-voting we need to be clearer with the intent."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 06, 2011", "message": "> Interestingly, on Reddit the intent is clear, I want to say “Look everyone, this is very interesting!”\n\nYou've never seen an *interesting question*? Really? I have. Of course, I've also seen a lot of <i>.. oh God .. the horror..</i> \n\nhttp://stackoverflow.com/review/low-quality-posts\n\n.. which makes the GREAT questions all the more awesome in comparison."}, {"author_name": "Joel Spolsky", "gravatar_hash": "d77663c217e9d27b725338c06674c94b", "author_url": "http://joelonsoftware.com", "date": "May 06, 2011", "message": "One of the reasons we care so much about upvoting good questions is that it will encourage people to answer them. When a question has NO answers, and you think it's good, vote it up so it stays on the home page longer and has a greater chance of getting answered (even if you don't know the answer yourself).\n\nWhat's a good question?\n\n* A question that is clearly written and presents a succinct, specific problem that Stack Overflow is perfect for answering\n\n* A question that *deserves* an answer: the Internet will be made better when the answer to this particular question is easily searchable\n\n* A question where the asker has made a good faith effort to solve the problem themselves, so it's very specific and detailed and includes a list of what didn't work\n\nVote 'em up when you see them, even if you can't answer them."}, {"author_name": "John Parker", "gravatar_hash": "9207dac1a08f23791251e6170b787646", "author_url": "http://www.surface.org.uk", "date": "May 06, 2011", "message": "@Jeff Atwood Don't get me wrong - I see lots of poorly worded, ill thought out questions. \n\nWhat I'm getting it is whether or not someone's in-ability to express their problem in a succinct manner should lead to a downvote, especially if English isn't their native language."}, {"author_name": "Simon", "gravatar_hash": "c83e213eaa13bd5381934a0126a64d9e", "author_url": "http://www.mindstorm.com", "date": "May 06, 2011", "message": "Show a bit more on the question summary (like the first couple of lines) with an even more easy mouse over to see the content (like hover the whole row).  From there click through should be quite a good metric as to how good a question is.  \n\nIf you click through because the question sucks, you can flag the question for mod attention or something similar."}, {"author_name": "Andrew", "gravatar_hash": "4a40e578100929af5126def184e1d870", "author_url": null, "date": "May 06, 2011", "message": "The decision to prevent people from voting until they have enough reputation is seemingly at odds with this desire though.  Since the content of the site is people asking and answering questions, the decision to push people into asking and answering first seems to have sprouted from a desire to create great content.  Now you have a wealth of wonderful content, and upvoting is a way of promotion some content over others.  People who find answers on your site by searching for them and not asking them initially are unable to promote those questions/answers they find useful until they contribute to the content of the site."}, {"author_name": "John Parker", "gravatar_hash": "9207dac1a08f23791251e6170b787646", "author_url": "http://www.surface.org.uk", "date": "May 06, 2011", "message": "Ah... wish I'd listened to SE Podcast #2/eighty-mumble before I commented above. :-)"}, {"author_name": "Dick Kusleika", "gravatar_hash": "549471243e0020b9aaa949bd381920bd", "author_url": "http://dailydoseofexcel.com", "date": "May 06, 2011", "message": "It seems like you're solving a problem that doesn't exist.  Are we assuming that a lack of question-votes is problematic?  We observe that answers get votes more than questions, but that doesn't make it a problem.  I observe that more people go to KFC than Popeyes.  That may be a problem for Popeyes, but I don't think we as a society should try to balance the scales.  Let the chickens fall where they may.\n\nAnd someone please give me an example of a pop-up message that solved a problem.  Just terrible."}, {"author_name": "flxa", "gravatar_hash": "1a3c4366e6435ecc5171d7f6cf8ae8b1", "author_url": "http://nfletcher.com", "date": "May 06, 2011", "message": "Why don't you add \"vote up/down question\" buttons right next to the add answer form at the bottom so people don't need to scroll back to the top to vote on the question? Even repeat the question at the bottom just above the form so that people can directly refer to it while they answer?"}, {"author_name": "Joe", "gravatar_hash": "3fed89e156eafb5725cbd72e22cbbc47", "author_url": null, "date": "May 06, 2011", "message": "I think if a question results in popular/highly voted answers then it should automatically get some of that weight.  After all I only vote up answers to questions that I have searched for and are relevant to me - the answer im voting for wouldnt exist without the question so do me a favour and put a bit of my vote on the question so I dont have to. \n\nAm I turing into a robot or are Captchas getting too complicated to read?"}, {"author_name": "ktmt", "gravatar_hash": "9bc4c646be5dfacedd4bce976edcbd34", "author_url": null, "date": "May 06, 2011", "message": "I'm with @giles. Voting questions is inherently flawed. There should be a new mechanism for keeping an important question active until sufficiently answered: kick it, ping it, nudge it... something like that."}, {"author_name": "tvanfosson", "gravatar_hash": "00aa1356e6f90fca08b36fb3c8d230c5", "author_url": "http://farm-fresh-code.blogspot.com", "date": "May 06, 2011", "message": "Leaving up the nag message until you vote on a question seems coercive and distinctly different from encouraging positive behavior through reputation, badges, etc.  The coercive nature of it may drive behavior that you don't want (\"this is annoying, I'll simply stop voting\" or \"damn, better go vote down an SO team member's question now\").  I'd suggest a different approach based on what actually makes a question useful.\n\nTo me a question is useful if I find it via search and one of the answers on it help me solve a problem I'm having.  Voting up the answer, then, is an implicit endorsement of the question's usefulness.  I suggest (a) you ask the user at the time that they vote for an answer on such a question if they also would like to vote for the question or (b) automatically add an upvote — once per day? twice per day? — when a user votes on [an answer on] such a question.  A simple date check -- is the question more than one day old? -- could suffice to distinguish between questions found as a result of search vs showing up as a new question.  You could either ignore or account for question bumping to the front page as you see fit."}, {"author_name": "Michael Kohne", "gravatar_hash": "267cfaf8c1f76da3d8b3c7576a903613", "author_url": null, "date": "May 06, 2011", "message": "I did post this on Meta SO, but I'll also say it here, possibly more clearly:\n\nA pop up isn't a gentle reminder, Jeff. It's a smack in the face. I'm trying to vote on an answer (and possibly starting to read the next answer down) and you're trying to rip my attention away from what I'm doing and put it somewhere else. NO. NOT OK. It's not OK to try to grab my attention at any time. I'm the user here. \n\nAnd let me say this as well: to my knowledge, there's NOTHING else on SE that tries to force the user into doing things. Everything else is a sort of 'benign coercion'. Why the sudden switch to such annoying methods?\n\nI agree with the plan of trying to get folks to vote more on questions, but giving me pain when I don't do what you want isn't going to accomplish that. It's going to annoy me.\n\nWhy don't you try stuffing a message in the inbox for people who don't vote on questions enough? That's something that's pretty out of the way, yet visible."}, {"author_name": "Jay Bazuzi", "gravatar_hash": "59ca40f0fafad6de52790016d2195abc", "author_url": null, "date": "May 06, 2011", "message": "There is a good reason to let answer's votes appear as part of the question's score: the real value of the question is in the answers it invites. That's where the community says \"this was useful to me\". If 10% of the answer votes funnel in to the question (and the question-asker's rep) then credit can go where it's due.\n\nIt still makes sense to keep full-valued votes on questions for reasons mentioned already: rewarding &amp; drawing attention to good questions."}, {"author_name": "warren", "gravatar_hash": "236948f12dbe8789edb8238298c61593", "author_url": "http://antipaucity.com", "date": "May 06, 2011", "message": "Funny - when I look at the question, the *first* thing I do is determine if the question has any merit, and up/down vote as I believe appropriate. \n\nThen I go look at the answers. Oftentimes, I find myself unqualified to vote on an answer, but voting on a question doesn't take specialized knowledge of the subject domain."}, {"author_name": "Shy", "gravatar_hash": "749b73007119baf94fc077c50bcc58e8", "author_url": null, "date": "May 06, 2011", "message": "To solve the workflow problem, maybe add an option to vote for the question at the bottom of the page as well?"}, {"author_name": "TJB", "gravatar_hash": "20e04754409abe97cca30b5cda369fcc", "author_url": "http://codeitalready.com", "date": "May 06, 2011", "message": "I made a small suggestion that may make question voting easier, please give it a look.\n\nhttp://meta.stackoverflow.com/questions/90171/suggestion-for-ui-to-encourage-streamline-question-voting\n\nThanx, T.J."}, {"author_name": "4rk", "gravatar_hash": "60fec2454b16f5fd5ec243fa98d71351", "author_url": null, "date": "May 06, 2011", "message": "I've always thought of it as: if I'm answering this question, it is a good enough question for me to vote up. In that respect I wonder (along the lines of what @fixa said) if submitting an answer shouldn't just vote the answer up (or popup a yes/no vote this question up? dialog) as long as you haven't already voted one way or the other. And no, this wouldn't apply to editing an answer nor editing the question."}, {"author_name": "OMG Ponies", "gravatar_hash": "84dc26c6486551ba2b477b8ec35e90dc", "author_url": null, "date": "May 06, 2011", "message": "I realize it means some coding, but as someone with the Electorate badge (http://stackoverflow.com/badges/155/electorate?userid=135152) I find the nag message insulting."}, {"author_name": "Matthew Miller", "gravatar_hash": "117c0d7cacdbd76827401b822b3037cb", "author_url": "http://mattdm.org/", "date": "May 06, 2011", "message": "http://data.stackexchange.com/serverfault/s/1165/lesser-questions-with-good-answers\n\nShows questions which have answers voted up to at least getting the Good Answer badge, but which weren't voted that high themselves. This in some cases shows questions which could Use Some Love; in other cases, it shows answers which are way too overvalued. (Often that happens when the question is humorously bad, or at least has an eye-catching title.)\n\nRight now, the \"Review\" page shows low-quality posts. Maybe it could also have something to show unbalances in questions vs. answers like this?"}, {"author_name": "Epeli", "gravatar_hash": "6398d275920f612b87785f8854abfc4a", "author_url": "http://esa-matti.suuronen.org/", "date": "May 06, 2011", "message": "Maybe this is suggested before (didn't read all the comments), but maybe you should just get rid of the question votes and simply give some credit to the person who asked the question when then answers get upvoted?\n\nGood questions get good answers?\n\nHmm… Ok, would be a bit harsh, but good questions could get some credit from the answers anyway."}, {"author_name": "Doug", "gravatar_hash": "a81a108522f894bbe6c6d14d0d90739b", "author_url": null, "date": "May 06, 2011", "message": "Because no one understands operator overloading.\n\nVotes are for answers. Now you say votes are for questions too, but the vote for a question means something different. You are overloading the \"vote\" with multiple meanings. Too much information, don't make me think!\n\nAdd a button by the question that is \"Good question/bad question\" or \"Front Page/No Page\". The action underneath can be a \"vote\", no change needed."}, {"author_name": "Joe", "gravatar_hash": "b485abb08284a8088abee223c66ca78b", "author_url": null, "date": "May 06, 2011", "message": "this solution might get a few more question votes but its like me washing dishes because my wife is nagging me to do it.  I might do it to stop the nagging but it definitely doesn't make me happy and give me an overall positive feel.  It doesn't seem inline with the rest of the \"behavior\" of the site."}, {"author_name": "RegDwight", "gravatar_hash": "9e6196f558d30d39ba5c5f1d55865dd3", "author_url": "http://english.stackexchange.com", "date": "May 06, 2011", "message": "@Neil Barnwell and Dick Kusleika: you have a point, but I don't think that it's unreasonable to expect people to vote on *one* question for every *fifteen* answers. \n\nIn fact, many of us won't even see that notification box at all. Ever.\n\nI see it as a way to encourage the blissfully unaware, \nnot to terrorize people who already do vote on questions \nevery now and then. \n\nAnd anyhow, let's just see how it works out in practice."}, {"author_name": "Simon", "gravatar_hash": "5b44db39d80dfad4a9972df9a0c69ad9", "author_url": null, "date": "May 06, 2011", "message": "What Phil said.\n\nWhen up-voting an answer, show a \"click here to up-vote the question too\"\n\nEspecially if someone is upvoting multiple answers on one question."}, {"author_name": "Ward", "gravatar_hash": "f347c53c9cb1ddcb816daeb22aaf89c8", "author_url": null, "date": "May 06, 2011", "message": "After posting a couple questions about the new system on meta.serverfault and trying it out, here's what I've concluded:\n\nIn the past, I voted a lot, and a couple weeks before this new vote structure was implemented, I had starting voting a lot again - all 30 votes for several days in a row.  I've now had a few days to vote a lot using the new system and have some observations:\n\nI don't dislike the 30 Q or A votes, *then* 10 more Q-only votes structure as much as I did initially.  \n\nMy natural vote pattern seems to be at least 10 question votes out of 30 and I have a hard time finding 10 more questions to go back and vote on.  I don't think I'll use very many of the 10 new votes very often.\n\nThe pop-ups are totally screwed up.  There's no longer a reminder when you're down to your last 5 \"normal\" votes, just the big reminder about 20 hours until you can vote again, or you have 10 more question votes.  Then you get the 5,4,3,2,1 votes left reminder on the last of the question-only votes.  At this point it's probably best to just ditch the countdown altogether.\n\nI don't think it's hard to recognize a good question, but I can't define it.  Obviously it's got to be clearly asked, but it also needs to be in some way relevant.  Not something that can be easily found in a manual or by testing, and not just a support request with symptoms that needs a lot of troubleshooting.  \n\nI don't know about others, but I'm still reluctant to \"throw away\" rep by downvoting bad questions.  If they really want bad questions downvoted, there needs to be an incentive, like +1 rep for either an up or downvote with those last 10 votes, or at least no -1 for downvoting."}, {"author_name": "Colonel Sponsz", "gravatar_hash": "cae93d12a6a39d5dc68eadf4cf45e526", "author_url": null, "date": "May 07, 2011", "message": "Here's a really good comic exploring the value of questions and answers:  http://www.kiriakakis.net/aday.html"}, {"author_name": "Rob Van Dam", "gravatar_hash": "478e998264ce53671f054b5a742bd692", "author_url": null, "date": "May 07, 2011", "message": "Several people mentioned possible UI changes but Jeff didn't respond to those so I want to suggest the same.  As I was reading I was sure the post was just lead up to saying that questions could now be voted on at the bottom of the page.  The \"we added a nag message\" conclusion was quite the let down.  I also like the idea of voting on the question after voting on the answer (nag \"did you also like the question, vote it up/down here).  Jeff, why don't you re-read your own post and follow it to it's logical conclusion: questions are more naturally voted on below the fold, further into the process you correctly described.  Part of the quality of a question is the quality of answers that it fosters."}, {"author_name": "Bryan Denny", "gravatar_hash": "3497d52dba17d86666a7bc82a2243c07", "author_url": "http://www.bryandenny.com", "date": "May 07, 2011", "message": "I think decreasing the rep value of an upvote on a question had an impact on this. As a mod on Android.SE, I find myself upvoting answers more than questions because it'll increase the overall rep of the newish SE. More rep means more users that can get more features/tools to help the community (vote to close, etc.)."}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": null, "date": "May 07, 2011", "message": "Maybe we users could be encouraged to get into the *habit* of voting, if SE presented a middle option: \"no vote\" or \"average question\" or something like that. As it is, we tend to register our opinion if the question/answer seems to have extraordinarily good or bad qualities. So, our default action (for all those things which fall into the vast yawning average middle) is no action. And this can lull us into forgetting to take action, especially on the questions, which have less priority to those of us who seek answers.\n\nAnother possibility, potentially used in conjunction with the 'middle vote', would be to remind us when we vote on an answer. Something along the lines of \"Hey, you liked/disliked this answer, but could you take a moment to rate the question?\" ... where this text also had a link to guidelines on rating questions. I like the three criteria Joel raised in his response on this thread."}, {"author_name": "quux", "gravatar_hash": "1402dd4895e7d8543543938710bc22be", "author_url": null, "date": "May 07, 2011", "message": "Oops, my bad. I see you've already implemented my second suggestion, though I think the wording could be tweaked a bit. And maybe the popup could link back to the question, or present vote buttons for the question directly (in the popup itself, I mean). Just my 2 cents (in Nigerian currency!)"}, {"author_name": "Robusto", "gravatar_hash": "4ba49e61d1be84ce3c3d84d10c7ed9d6", "author_url": null, "date": "May 08, 2011", "message": "If it's important to upvote questions, and you seem to be implying that if one answers a question one is more or less honor-bound to upvote it, then why not introduce a mechanism whereby a question gets an automatic upvote for every answer it receives? The upvotes don't have to come out of the responder's daily stock of upvotes."}, {"author_name": "Chris Walton", "gravatar_hash": "48848cf2a56d8543c02de6946cfe6794", "author_url": "http://chris-walton.blogspot.com/", "date": "May 08, 2011", "message": "If the threat to the kitten is supposed to be an incentive to vote, I think you have got it exactly backwards - shouldn't it be \"If you don't vote the kitten lives\" :-) ."}, {"author_name": "Lucidquiet", "gravatar_hash": "864c21c3f1a5bb7f99f9061699a25526", "author_url": null, "date": "May 08, 2011", "message": "I originally came to this post because a question I asked got a vote -- and the first thing that entered my head was: Why? and then the second was Who?\n\nI happen to think I got a vote on that particular question because it threw a jab at Microsoft, or it was a one of those questions that someone thought was interesting because it tried to solve something non-trivial.\n\nThe original questions from the above post. (I had to use the find for '?' to really dig them up)\n\n1) Why aren’t people voting for questions?\n2) If a question is worth answering, isn’t it at least worth considering whether you should upvote it?\n3) So, how do we encourage people to remember the questions when voting?\n\n#1) Got me.\n#2) What makes a question worth answering -- wouldn't that be any question that doesn't have an answer?  Deep answers can start to sound like noise if it is beyond the audience.\n#3) Maybe it would be better to vote on things that describe the question:  Well-written (+1), Interesting Topic (+1), Combining Tech (+1),\nGood Problem Description (+1), Non-Trivial (+1), etc.\n\nJust some thoughts,\nL-"}, {"author_name": "Anthony", "gravatar_hash": "1e1dbaeefb595469e31863511e94b332", "author_url": null, "date": "May 08, 2011", "message": "Seems like this is much ado about nothing. Good questions *do* get votes. Bad questions seem to get a lot of votes, too. There are several users who have gained a whole lot of reputation by asking tons of questions without giving anything back. We're going to encourage this further? But I don't even mean to lament this, that's for another day. It's just to say that those users who have tons of rep without answering a dern thing seemingly disprove any notion that there is a problem with too few votes on questions. \n\nMaybe our voting habit isn't the problem, perhaps the problem is your algorithm for displaying questions is flawed, and rather than fix the algorithm, you'd rather try to forcefully change behavior to fit your formula."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 08, 2011", "message": "> If it’s important to upvote questions, and you seem to be implying that if one answers a question one is more or less honor-bound to upvote it\n\nNot at all -- merely that people (and I think defensibly so, because of the page workflow) *completely forget that they can upvote the question* ... because they are so focused on answering, or processing the answers.\n\n> There are several users who have gained a whole lot of reputation by asking tons of questions without giving anything back\n\nThis might seem related, but it is in fact a different problem. But we are attacking that as well, though it is not at all the subject of this blog post. For example, we recently instituted new question limits: 6 questions per day per account (or IP) and 50 questions per month per account (or IP). There's also a lot more automatic quality checking that goes on for new users."}, {"author_name": "Stefan", "gravatar_hash": "a49df5857db7184b96beaf34a55f322a", "author_url": null, "date": "May 09, 2011", "message": "Before this popup I think I only voted for questions I searched answers for and got helped by. Like \"This question and it's answers helped me.\" \n\nThe value of an existing question for me is that I dont have to spend time writeing it down, and then wait up to a day for good answers. Time is money, and a day is worth plenty of money.\n\nBut that only counts on questions that I search answers for, so naturally I only vote for those questions. (And maybe some drive-by voting on questions I think is specially interesting)"}, {"author_name": "Troyen", "gravatar_hash": "38c4716a36624814c1e0c7fd527150a9", "author_url": null, "date": "May 09, 2011", "message": "I understand the argument for not just letting any random person vote, but as mentioned above, I'd think the people benefitting most from questions are the people coming in through search engines, and those people wouldn't have any voting privileges.\n\nI know the first several times I landed on this site were from google bringing me to some question related to my query, and the times that the question was exactly what I was looking for, I had no way of showing appreciation because you need an account and it needs 15 rep before you can upvote.\n\nIt's true that the answers in those cases helped solve my problems, but some credit has to go to the question as well for drawing out those answers."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 10, 2011", "message": "> I understand the argument for not just letting any random person vote, but as mentioned above, I’d think the people benefitting most from questions are the people coming in through search engines, and those people wouldn’t have any voting privileges.\n\nAh, but they do increment the view counter, which causes other positive things to happen.\n\nIt's like a very, very tiny vote."}, {"author_name": "Jason", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": null, "date": "May 11, 2011", "message": "I want to be able to vote on the blog posts and the responses."}, {"author_name": "Jason", "gravatar_hash": "16fdddee3335cb859fe7bb300cf02cdb", "author_url": null, "date": "May 11, 2011", "message": "I think there should be a \"side by side\" \"Hot or Not\" comparison section for the avatars, also."}, {"author_name": "Phil H", "gravatar_hash": "05e8bace9f460f632af6b699a80408e9", "author_url": "http://dropletsforming.blogspot.com", "date": "May 15, 2011", "message": "The problem is that the user doesn't see any effect from upvoting questions, whereas they see the effect of upvoting answers clearly. \n\nI see multiple answers to a question in comparison with each other - I don't upvote all answers with any merit, I upvote the best answers. \n\nSo with questions, you need to be able to:\n1. Show the user that the upvoting has some effect (for example, tell them that question voting affects their Interesting tab)\n2. Let us vote on questions when we are looking at several together - so on the questions list. One way to do that would be to let the user click on \"Good Question\" or \"Interesting\" as a step to reveal the answer box - that way the user is supplying their view on the question at the point of maximum information. It may have turned out to be more or less interesting than it first looked - some are easily googled, some have subtle depth.\n\nSo there you go, \"Good Question\" or \"Interesting\" buttons."}, {"author_name": "Denis", "gravatar_hash": "cbd7e425787691c8ec475b7eb3db470d", "author_url": null, "date": "May 25, 2011", "message": "I'd like to second two comments on how annoying the tag is. Personally, I'm on the verge of stopping to vote altogether -- questions or answers -- to stop seeing it."}, {"author_name": "Greg C", "gravatar_hash": "9eefd1a50709f4081e106b6008c14285", "author_url": null, "date": "Jun 17, 2011", "message": "why not simply add a +1 to any question, within a user voted a answer up or down or even only commented. Clicking &amp; readin it is not enough of course. But as facebook liking shows, if no like button at top &amp; end of a site, user forget to vote for a topic/article/question. So why not automize it? Downvoting a stupid question works, as answers will seldom be downscrolled"}]}