{"response": [{"author_name": "Francisco Noriega", "gravatar_hash": "dfff0518037e2f04a72cbf1801986a9b", "author_url": "http://francisconoriega.com", "date": "Nov 15, 2010", "message": "I think thats a pretty good direction to head, I wonder if there could be some more tools, and ways to link questions that are similar but with the \\dreadful\\ \\closed as duplicate of Question\\.\n\nWhat I mean is that I think that it could be beneficial to have hand picked related questions, so they would only be a few, the 4 or 5 different variations of the same question, not the huge list of Related questions we get now (and that just check to see similar words).\n\nSomething like: \n\nClosely Related Questions\n...\n...\n..."}, {"author_name": "@TeamOneJ", "gravatar_hash": "d88c6bb44c69f2acccf1d4b9628093f9", "author_url": "http://www.teamonetickets.com/", "date": "Nov 15, 2010", "message": "What would be helpful is on similar variations of the same question is to have a “these questions are/may be similar” link so we could explore the variations."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 15, 2010", "message": "@francisco @teamonej -- this already happens, to some extent, through the \"related questions\" on the sidebar of every question.\n\nIt is VERY important that semi-duplicate questions be tagged with exactly (or nearly exactly) the same tags if you want them to naturally group together, however.\n\nRemember that the \"best\" duplicates have almost no words in common, so we really need the tags to match to help the process along.."}, {"author_name": "Francisco Noriega", "gravatar_hash": "dfff0518037e2f04a72cbf1801986a9b", "author_url": "http://francisconoriega.com", "date": "Nov 15, 2010", "message": "@Jeff, yup but as I mentioned I think the list is a) way to big (I think your 4-5 # is pretty good), and b) it depends on an algorithm, which as good as it is, it isnt (and I dont know if it could be) as good as hand picked answer. I think you could use a similar mechanism to the closed as exact duplicate, but instead of closing just \"friendly\" suggesting questions that are very related"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 15, 2010", "message": "@francisco there is also Linked Questions which is built using any URLs in the question, answers, or comments: \n\nhttp://blog.stackoverflow.com/2010/04/new-linked-posts/"}, {"author_name": "Francisco Noriega", "gravatar_hash": "dfff0518037e2f04a72cbf1801986a9b", "author_url": "http://francisconoriega.com", "date": "Nov 15, 2010", "message": "oh! haha okay then forget what I said.. you are one step ahead :P\n\nI guess I was so used to see that long related list that never noticed the Link section!\n\nI guess I'm going to start using that (my current way to look for questions has been to start a new question, write the question title and use ctrl+click on good questions that look similar to what I want THAT ALSO have many answers (thats the downside of the sidebar links, no score))\n\nhave you noticed this behavior in you stats? (start many questions but not actually posting them)"}, {"author_name": "CodingSamurai", "gravatar_hash": "5d0b2b6cc58c443617e659400d52d535", "author_url": null, "date": "Nov 15, 2010", "message": "@Jeff,\n\nSince you already have the linked question's ID why not simply show the top accepted answer in the space so it says something like:\n\nThis a duplicate of Question [XXXXXX] here's the top accepted answer:\n\n[Vote total] - Answer Text\n\nTo view more answers to this question click [here]\n\nThis way you get the benefits of deduping without the negative usability experience."}, {"author_name": "David", "gravatar_hash": "887d074b9de007206639737c03fb0950", "author_url": null, "date": "Nov 15, 2010", "message": "Um, did you just inadvertently give a green light to the serial question askers to go ahead and start creating 'similar-but-not-quite-the-same' variants of every question in the system as a means of nefarious rep building?"}, {"author_name": "Rowland", "gravatar_hash": "45dabf2a552f3205db7e2c6e02f64e8b", "author_url": null, "date": "Nov 15, 2010", "message": "Well Also overtime the same question will have a different Answer... And hence will need to be asked Again!"}, {"author_name": "tzenes", "gravatar_hash": "947c457cb4e5480cb8b2f09e49794834", "author_url": "http://gaming.stackexchange.com/users/102/tzenes", "date": "Nov 15, 2010", "message": "@David that's why god invented \"mods\"\n\n@CodingSamurai, better yet you could merge the answers between duplicates and have both displayed on both questions (or have the duplicates answers displayed on another tab).\n\nI think that merging in some way \"feels\" better than leaving both open.  What I worry about is that a _full_ answer to both might need two pieces and that by not merging or closing those two pieces will end up in two different places.\n\nThe other advantages closing has (over just linking or merging) is having the \"newbie\" questions not repeated and thus flooding the site.  We both agree that too much duplication is bad, but I think we might set the bar slightly differently at what is too much..."}, {"author_name": "Dan Diplo", "gravatar_hash": "7ed6a2c2b5894c744c66710fbfadc648", "author_url": "http://www.diplo.co.uk/", "date": "Nov 16, 2010", "message": "Another reason why duplicates are not always bad is that the \"correct\" answer to a question can change over time as technology progresses (and it progresses particularly fast in the world of software development). For instance, imagine a C# question asked 5 years ago and then the same question asked today: chances are the up-voted and accepted answer of 4 years ago is probably not the best solution today since the advent of generics, LINQ etc.\n\nSimply linking a new question to an old answer isn't enough, especially if the old, up-voted answer sits at the top and newer, more up-to-date answers get lost."}, {"author_name": "Aakash Mehendale", "gravatar_hash": "d4f59ee8f45040b78ee28e784f985664", "author_url": null, "date": "Nov 16, 2010", "message": "&gt; Question duplicates aren’t necessarily our enemy. They’re more like our, y’know, frenemies.\n\n\"Frenemies\" being of course 'enemies who present themselves as, or otherwise appear to be, friends'. So, they're \"not necessarily our enemies, they're more like our enemies\". Right."}, {"author_name": "Nikita Rybak", "gravatar_hash": "6cb955d7b6e841c9f9442f87f08ca7a1", "author_url": "http://stackoverflow.com/users/330565", "date": "Nov 16, 2010", "message": "&gt; the better odds people can find the answer they’re looking for\nIf closed questions remain available, what's the difference?\n\n&gt; [closed as duplicate of Question] click here to see answers\nWhat's the problem with that? In worst case (for newbies) there could be a prominent message with link on top (like \"you're new user, read faq\" now).\nBut the whole 'clicking is bad' mantra seems rather strange to me.\n\n&gt; It’s far more common to have many subtle variations of a question.\nWith all due respect, this is wrong. People don't go searching for duplicates of reasonably sophisticated questions. Because it takes time and effort. But if you get a bang \"hell, I've seen this exact question 3 times over past 4 months\", you might spend 10 minutes searching. The perfect example is \"what does ||= mean in Ruby?\". It's not like there can be any subtle variations of this question and it _does_ happen a lot. (in particular, because you can't search for \"||=\" token on SO)"}, {"author_name": "Nikita Rybak", "gravatar_hash": "6cb955d7b6e841c9f9442f87f08ca7a1", "author_url": "http://stackoverflow.com/users/330565", "date": "Nov 16, 2010", "message": "But the biggest problem for me is following. What else action can I take if I happen to find a duplicate of this question?\n\n1) Ignore it.\n2) Post 'best answer' from the older question in the new one (with attribution or not) and gather some reputation for it.\n\nBoth options seem equally bad to me.  \n\nOverall, I think system already functions the way you describe (having 4-5 or 20 or 100 duplicate questions). So, there's really no need for any intervention from admins."}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Nov 16, 2010", "message": "You've addressed Problem 2 (http://meta.stackoverflow.com/questions/52530/are-duplicates-creating-broken-windows), but what about Problems #1 and #3?\n\nProblem #1\nDo we care that people gain reputation from easily searched duplicates?\n\nMy answer is yes... To an extent.  In one-off cases where the user didn't realize, I'm ok with it.  In cases where the user has a history of asking a lot of questions, not doing any searching, and posting duplicates, I'm not ok with it.\n\nWhy? Because that user is gaining reputation and I'm not entirely sure they've 'earned' it.  This isn't Slashdot, where 'Karma' doesn't mean anything: Here it means a lot.  For better or worse, people that don't know the system will equate higher reputation with better programmer, and since you equate the two (using Stack Overflow Careers) it's possible for you to be complicit in that. Even us. We're all complicit, but some of us care more than others.\n\nProblem #3\n\nWe've already nerfed close votes, even though the community has spoken and they believe \"Duplicate\" close votes should not be nerfed: ( http://meta.stackoverflow.com/questions/56817/can-we-prevent-some-of-the-low-quality-questions-from-entering-our-system/56829#56829 ) and there is already evidence that people aren't able to keep up with the deluge of items opened. I'd be interested to see the relative close rate today compared with what it was a year ago, or two years ago. If I get a chance to tonight, I'll pull that from the SEDE, but someone else probably has that time on their hands at the moment.\n\nI dislike duplicates as a general rule; but there are plenty of exceptions to that rule (I've listed them above). However, I will submit that sometimes duplicates are a really good thing, and I've been bitten by it where the accepted answer just links to another blog post that doesn't work for me."}, {"author_name": "Alexandre Jasmin", "gravatar_hash": "ebb42d2495567b4d80d528b06d5f3097", "author_url": "https://twitter.com/ajasmin", "date": "Nov 16, 2010", "message": "@Dan Diplo and @Rowland\n\nOld questions don't necessarily have outdated answers. People often post new answers on old questions or edit their old answer.\n\nIf you come to an old question from Google and see it's not up to date you can always post a better answer fot it."}, {"author_name": "Ian Terrell", "gravatar_hash": "5d159199cf75f783132c7274752896e3", "author_url": "http://ianterrell.com", "date": "Nov 16, 2010", "message": "@CodingSamurai and @tzenes are right:  simply closing questions as duplicates is a relic of issue-tracking systems that only purists care about.  There are more creative solutions available to the imaginative.  Redirects, question trees, network visualizations a la Github's source code viewer, handwritten guides, computer inferred metadata, recommendations...\n\nAny limitations to solving the problem of duplicate content, including saying \"It's wonderful!\" are merely artificial."}, {"author_name": "David", "gravatar_hash": "887d074b9de007206639737c03fb0950", "author_url": null, "date": "Nov 16, 2010", "message": "@tzenes re: \"that’s why god invented mods\".  Problem is the mods already have enough on their plate.  And Jeff laying down the offical law that ‘similar-but-not-quite-the-same’ variants are acceptable isn't going to help.  It also means the mods don't have a leg to stand on when they want to close a dupe but the OP can now just refer to Jeff's blog post and say 'Jeff said it was ok'.  Now I do understand, and agree with, Jeff's argument of better coverage, but this just doesn't feel like the right way to go about it.  As I said before, those users who are already pushing the boundaries on acceptable levels of question asking have just been given the OK to go mental creating even more questions.  And please also refer to @George's comment for why this is bad."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 17, 2010", "message": ">  Jeff laying down the offical law that ‘similar-but-not-quite-the-same’ variants are acceptable\n\nNot what I said; did you read the same post I wrote?\n\n\" Use the above guidelines and try to find a happy, reasonable medium somewhere in the middle there.\"\n\nI'll summarize in Cliffs Notes format:\n\n- the idea that all variants of a question can be mapped down to a SINGLE question is quite rare and often harmful\n\n- it's a good idea to have a few variants of any question to make sure we cover for people who ask the same question using totally different words; this is kryptonite to Google\n\n- more than 4-5 duplicates of a question is clearly bad.\n\nGo ahead, use judgment. It only hurts for a moment, I swear."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Nov 18, 2010", "message": "I can mostly agree with this, but there is one thing. \n\nThere are, very roughly put, two types of questions on SO: \n\n - questions to which there is a good \"standard\" answer (\"How do I get a parent element's grandfather in jQuery?\")\n\n - questions to which there is a shallow answer that is probably correct, but a deep one that mentions intricacies and complexities that are essential (Example: \"Is it safe to use jQuery with a second JavaScript framework on the same page?\" Shallow answer: \"Yes, when they don't obviously collide with each other\" Deep answer: \"Often no, because of the way the various frameworks handle and mark DOM elements internally, leading to hard-to-track bugs when cloning elements\") \n\nFor the former type, it can be expected that a large number of users will know the correct answer. It is thus perfectly fine to have a number of duplicates. \n\nFor the latter type, there are only very, very few people even on SO who can give the deep answer, and those users are unlikely to answer every duplicate. \nThe risk is that for advanced questions, there will exist 4-5 duplicates that contain the shallow answer, but not the deep one.\n\nI'm certain this is a real problem: I have seen it many times. I am therefore not convinced that what you say about permutations applies to *every* question on Stack Overflow. Not sure what can be done about this, though - I keep having the feeling that introducing the possibility of voting a question to be the \"reference question\" on a topic would be a good thing to have for *some* questions.\n\nAddendum: I pulled the “deep answer” example out of my ass, based on a real answer by user @bobince that impressed me mightily, but which I can’t find right now. It conveys the essence of the answer, but was not put 100% the way I quote it."}, {"author_name": "Ian Ringrose", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Nov 18, 2010", "message": "The cost/reward system for creating duplicates as opposed to finding duplicates seems to be a bit wrong, see http://meta.stackoverflow.com/questions/37466/give-an-incentive-for-finding-duplicate-questions \n\nHowever I agree that near duplicates can be useful, as 4 simple questions that mostly overlap can be easier to find/understand then a single complex question."}, {"author_name": "idont", "gravatar_hash": "d4ac9be18a1256909421f4096724a648", "author_url": null, "date": "Nov 18, 2010", "message": "I am sure many people feel (wrongly) that it is useless to add an new answer to answered questions.\n\nAlso, as more and more users join SO and software version changes, it is interesting to read answers to a duplicate question with a new(er)/different angle."}, {"author_name": "sampablokuper", "gravatar_hash": "31ed0754babeeb9dbf19fd055926a313", "author_url": "http://sampablokuper.com", "date": "Nov 20, 2010", "message": "\"Let me be clear — too much question duplication is bad. Absolutely.\"\n\nUnfortunately, rather than just have one awesome answers site that can intelligently bring closely related questions and answers to a user's attention, you folks have decided to create an indefinite number of sites with overlapping remits that manifestly fail to do this across site boundaries.\n\nWhile this may keep your graphic designers happy creating new skins for all these new sites, and while it may keep your advertisers happy because it makes it slightly easier for them to target their ads, it wastes users' time. It is a coding horror, Jeff; it's blood on your hands.\n\nPut your users first. Kill area51.stackexchange.com and merge all the questions and answers from stackoverflow, serverfault and all the other arbitrarily specialised (though sometimes overlapping) sites into ONE site before it's too late.\n\nThis will also solve your single sign on bug.*\n\n\n*The bug being: you don't have single sign on."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 22, 2010", "message": "@sam I believe the awesome \"one size fits all\" answers site you're looking for is here http://answers.yahoo.com/ .. enjoy :)"}, {"author_name": "sampablokuper", "gravatar_hash": "31ed0754babeeb9dbf19fd055926a313", "author_url": "http://sampablokuper.com", "date": "Nov 26, 2010", "message": "@Jeff, Yahoo! Answers has - as I'm sure you know - its own myriad imperfections. If it can be proved that (many of) these stem from having one (sub)domain serve users with myriad interests, then it's fair for the Stack Exchange network to avoid this approach and its consequent pitfalls.\n\nHowever, I have not been able to identify any such proof."}, {"author_name": "sampablokuper", "gravatar_hash": "31ed0754babeeb9dbf19fd055926a313", "author_url": "http://sampablokuper.com", "date": "Nov 29, 2010", "message": "OTOH, if you like users who post a question at somestackexchangetopic.com being told that they ought instead to have posted their question at meta.subnicheofsomestackexchangetopic.com (and being down-voted for not having done so), then I guess your strategy makes sense :)"}, {"author_name": "Nobody Real", "gravatar_hash": "f3e232ee129f31366b9e744d1e7ca942", "author_url": null, "date": "Jan 02, 2011", "message": "While I understand the desire to have \"canonical\" questions and answers... the fact is, it's rarely the case.  What's more, the very fact that questions can be \"answered\" and chosen as \"the answer\" discourages people adding better answers later.\n\nI know i'd MUCH rather provide a good answer to a new question than be one of 200 answering later.  Why?  Well, i'm much more likely to be upvoted if I provide a good answer quickly.  If I provide an amazing answer a year later with 200 other answers, chances are i'll see minimal, if any upvotes.  \n\nI think it's unreasonable to expect anyone to give a good answer to a year old question, unless that question only has a couple of answers.  Hell, if the answer has 20 or 30 answers, it may be hard to find the \"new\" answer.  Most people do not read past the first page, or second page at most.  \n\nThis is a failing in the SO \"process\".  New questions are much more likely to generate rep for an answerer than old questions.  So Duplicates are much more likely to generate a totally new answer than old questions."}, {"author_name": "JohnDoe", "gravatar_hash": "fd876f8cd6a58277fc664d47ea10ad19", "author_url": null, "date": "Jan 08, 2011", "message": "I strongly diagree.\n\nStackOverflow is rapidly heading into duplication hell for a number of reasons I'll try to summarize below:\n\n1. Pseudo Variation\n\nThere is a number of questions that come up frequently on SO that basically just differ in one tiny implementation detail. While those appear to be different at first glance, they are really ain't.\n\nExamples of those questions are \"How to extract all [elementName] from an [HTML|XML|RSS] document\" or \"How to change the format of date [X] to [Y]\". \n\nFor those type of questions, it is irrelevant whether they ask for TR and TD or for Y-m-d and d-m-Y. They are - for any practical purpose - exact duplicates. \n\nDo we really want one question for each possible element name or date formatting option a language allows? \n\n2. Technical limitations of the search function\n\nThe most obvious limitation is searching for special characters, like +-!$@% and so on. These are operators in most, if not all, programming languages. I've seen numerous questions like \"What does [operator] mean in [language]?\". There is no way (next to using Google) to find those easily on SO, so those get duplicated frequently.\n\nThe other limitation is the search functions weird evaluation of search terms. I heavily use user:me to find answers I have given in the past. I do know what I wrote in those answers but when searching for those words I often dont get any results. As a consequence I have put less and less search terms into it, but then have to wade through three pages until I find the answer I was looking for.\n\nSo even for those users who do take the time to search SO, it's not as easy as it could be to find duplicates.\n\n3. Users simply don't care\n\nThere will always be users who simply cannot be bothered to search before asking. They will ignore the compulsory Ask Advice Page and all the suggested questions on the question input form. They will ignore the faq and they will ignore the tag wiki. They *will* ask *their* question, no matter how easy it is to find the answer.\n\nThose users alone will push the amount of duplicates in the system from \"enough\" to \"too many\". If we do not want SO to be littered with duplicates, it is crucial for the community to close these duplicates or for moderators to merge them.\n\nUnfortunately, this is not happening, because\n\n4. Questions don't get merged\n\nOf all the questions I have flagged for a possible merging, exactly one was merged. I understand that merging question takes some careful consideration than just closing them. But what good is a suggested mechanism to reduce duplicates when in practise, it is only applied in very narrow situations?\n\n5. The current system is punishing finding duplicates\n\nIssue #3 wouldn't be too much of an issue if there was enough users who actually do care how the page is supposed to run. But in reality, even the most obvious duplicate will be answered because not only do people not care about them being a duplicate, but SO offers no incentive for finding them either. \n\nI am closevoting at least five to ten questions a day; most of them for being duplicates. For a lot of these questions, searching and finding an \"appropriate\" duplicate takes longer than providing a new answer (see issue #2). This will get worse the more duplicates there are (see issue #1). But despite doing this takes more effort, I do not get anything for closevoting other than a warm fuzzy feeling that I did \"the right thing\". \n\nNow, by the time I have found and supplied a suitable duplicate, those users who simply do not care, cannot or know not about suitable duplicates, provided their own answers (see issue #4). \n\nOccasionally, low-rep users will provide the link to a possible duplicate as an answer. And guess what, there will even be people upvoting them for that.\n\nIt also doesnt help that any reputation on questions that are closed as duplicate is not awarded. People just don't closevote. And why should they, when reputation is so much more valuable?\n\nLately, that warm fuzzy feeling I had for doing my community duty is no longer strong enough to fog my brain sufficiently to ignore that I am getting punished for it. \n\nI am considering not doing my community duty anymore and simply answer whatever there is two answer. That, of course, will not help the amount of duplicates. But at least I get reputation again, which would put the fun back into SO (right now it feels like housekeeping). And maybe then I can love duplicates."}, {"author_name": "Philip Ashmore", "gravatar_hash": "9e0eaa2c822639a2f006a1700903161e", "author_url": "http://www.philipashmore.com", "date": "Feb 28, 2011", "message": "In information theory terms what you're all talking about is decreasing entropy, so less bits are required to encode the (useful) information.\n\nOne way that springs to mind is to have an answer domain.\nIndividual questions connect the problem and solution domains. Similar questions with similar answers reinforce that connection, like neural nets.\n\nWhat you're looking for is a visual (number of connections?) representation of that neural net that users can navigate, maybe a hierarchy of problem and solution spaces starting from the general and quickly whittling down to specific problem and solution domain connection.\n\nThis way, users can ask \"how do I do X\" without (yet) knowing the tools to use (the problem space),\nbut they can also ask \"how do I use X to do Y\" which targets their understanding gap from the solution space - approaches or tools that people use to solve problems\nand answer questions.\n\nSo you'd need to catalog the software and approaches people use to solve problems and answer questions, that people can query like stackoverflow does now for questions."}]}