{"response": [{"author_name": "John", "gravatar_hash": "a22cd5aa8ee2982b6d52678a84634eba", "author_url": null, "date": "Nov 23, 2010", "message": "How does that fit in with book recommendations?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 23, 2010", "message": "@john I'm not entirely sure it's related; shopping recommendations are their own animal -- the intent is to buy a technical product with some set of specifications, and to make an informed buying decision, you need to have at least a rough understanding of the technical underpinnings of how the products work.\n\nIt's hard to say without more context, can you provide an example of what you mean?\n\n(that said, I can tell you that gaming has struggled mightily with [game-rec] questions and I am personally not a fan of them .. even a little http://meta.gaming.stackexchange.com/questions/tagged/game-recommendations )"}, {"author_name": "Richard Gadsden", "gravatar_hash": "3c291e7858e6b79e06889fa7dbf16d31", "author_url": null, "date": "Nov 23, 2010", "message": "boardgames has the same recommendations problem as gaming."}, {"author_name": "John", "gravatar_hash": "a22cd5aa8ee2982b6d52678a84634eba", "author_url": null, "date": "Nov 23, 2010", "message": "I was just thinking of questions that start with \"What is the best book to buy for ....\" (mostly tagged books). \n\nTechnically these are shopping recommendations and require a set of requirements followed by purchase suggestions in the form of answers. The books available will also change over time much like other products. \n\nThe issue I guess is that \"What to look for in a good X book\" would lead to a very different set of answers as often (unlike another products) without reading a lot of the book it is sometimes hard to establish if it would fit the requirement. Much the same as what you have highlighted with the game recommendations.\n\nI can see your point though."}, {"author_name": "Josh Smeaton", "gravatar_hash": "3891f38e5165127cac92a4e9e4aba688", "author_url": null, "date": "Nov 23, 2010", "message": "Heh, I think the Dual Band router question was mine."}, {"author_name": "Hanno", "gravatar_hash": "565798f3420b2682c103a5e2c48f03f8", "author_url": null, "date": "Nov 23, 2010", "message": "I like this clarification, especially the generalization in your last paragraph, since the basic notion does appear on other sites in other disguises, too. For example, a very similar issue on cooking.stackexchange.com is the difference between \"What is the best recipe for X\" and \"What are essential aspects in preparing X\". It's about \"how can I make a better decision\" vs \"what did you decide\"."}, {"author_name": "Sosh", "gravatar_hash": "28b32e959ebbbf7e418f96bcd7c1db7e", "author_url": null, "date": "Nov 23, 2010", "message": "Hi Jeff. Problem is, if you asked your model example question, and got that answer, you would still not be sure which camera to select.  The ISO supported on the camera almost means nothing in the 'good for low light' stakes. (it's just another marketing number, with many of the high ISOs unusable on point and shoots) - in reality it depends what the high ISO noise level is like for a particular camera model (I'll accept that the sensor size can inform you to a degree though).  \n\nSo really you end up having to ask \"what's a good low light point and shoot at the moment?\" anyway.  I'm sure this is the same for other products that look great on paper, but just have their own flaws and quirks.\n\nIsn't there any benefit in allowing these questions?  They may be 'labour intensive', but if the OP and answers don't mind putting in the effort, then why should anyone else care?  Sure these questions and answers will be obsolete soon, but couldn't you treat them as 'transient' in some way?  E.g. you could give them a year as a fully fledged question, and then archive them, or mark them as expired some how...  \n\nFrom another angle I would have thought that anything talking about product recommendations would be reasonably good revenue opportunity for the site."}, {"author_name": "Grzes", "gravatar_hash": "712248df6de12dd9b8ba73869a110f1f", "author_url": null, "date": "Nov 23, 2010", "message": "The problem with some of the shopping recommendations is that it is often not possible to figure out which product is better based only on data published by the manufacturer. In your example the ISO number doesn't really say everything, you want to know how good the overall noise reduction at high ISO is. Another example - I wanted to buy a graphics card that has quiet fan - its impossible to find this kind of thing without trying. Or a SSD drive  - if you take a look at any hardware review site you will notice that there is often massive difference in performance despite similar specs. \n\nSo to sum up it is always useful to know what makes a product potential good buy, but usually its not enough - the devil lies in the detail :)"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Nov 23, 2010", "message": "I wholeheartedly agree with this: To me, shopping recommendation questions always feel a bit like the  \"write some code for me\" questions on Stack Overflow. It's understandable people ask for them - I would, too! But it's not the point. The point is that you learn about the parameters important for making a good shopping decision yourself."}, {"author_name": "mxyzplk", "gravatar_hash": "fde79b61219beecc221ad3e26943a992", "author_url": "http://mxyzplk.wordpress.com/", "date": "Nov 23, 2010", "message": "I think though that you need to differentiate strongly between the two lines of reasoning here (needs lots of context vs gets outdated).  On RPG.se, there are shopping recommendation questions, but RPGs never go \"out of date\" - plenty of people still play the original version of D&amp;D from the 1970s.  There, a recommendation for GURPS is useful today, a decade ago, or a decade from now. I wouldn't want to see this as a justification for a close reason that people thought applied across SEs when it's not relevant to many of them.\n\nI don't buy the \"but you need to know all kinds of details about someone\" as a negative; same exact logic for most questions someone can ask about how to do anything that's not super trivial.  How do I write secure source code?  What kind of code, what's your company's security stance, what's your tool budget..."}, {"author_name": "Aaron G", "gravatar_hash": "b724ebca1ce4dc031f4db1215b70825e", "author_url": null, "date": "Nov 23, 2010", "message": "Responding to a previous poster, who the hell asks \"How do I write secure source code?\"  That's exactly the kind of question that should *immediately* be closed as Not A Real Question.\n\nIt's not just about obsolescence.  \"Shopping\" or \"recommendation\" questions are a pox on almost every Q&amp;A community; on Gaming and RPG, it's game-rec.  On Android and Apple and Webapps, it's app-rec.  On Programmers and Stack Overflow, it's lang-rec and framework-rec.  On Photography it's cam-rec.  Those questions swamp the site and add basically NO value because the amount to 100% unverifiable opinion.  Either you agree or you disagree, but no answer is ever truly right or wrong.  I gave up on Android after the first week because the site was something like 20% app recommendations (I hear it's gotten much better since then).\n\nWe had our own version of the \"recommendations\" questions on Seasoned Advice (cooking.SE) - recipes.  We banned them right off the bat, and we are SO much better for it.  Because it turns out that, even though it's a little more effort and sometimes still kind of subjective, there ARE ways to ask those same questions without turning them into mindless polls.  Of course, not surprisingly, there was that tiny minority of members who fought bitterly to allow them, but fortunately in our case, common sense prevailed and we ended up with a site that gets *interesting* questions that *enrich* our lives, at least in the kitchen.\n\nNow that Community Wiki mode for questions is gone (thank you Sam - I was skeptical at first but it's now very clear that it was the right decision), there is simply no excuse for people to create polls anymore, and shopping recommendations are polls.  Period.  Close 'em as Not A Real Question and get on with your lives."}, {"author_name": "Adam", "gravatar_hash": "207958aa5ac1c42448070dbab3f2dd87", "author_url": "http://stackoverflow.com/users/284685/adam", "date": "Nov 23, 2010", "message": "Good point.\n\nMaybe we should make shopping.stackexchange.com for those questions?"}, {"author_name": "BradC", "gravatar_hash": "c5c2165949f71bcd1fafbd8e694ab5f2", "author_url": null, "date": "Nov 23, 2010", "message": "Wow, very relevant issue, and something I've been thinking about recently with regard to the (still in commitment phase) Astronomy SE at http://area51.stackexchange.com/proposals/51/astronomy\n\nYou would imagine the most common question with regard to amateur astronomy would be \"what kind of telescope do I buy\", and the existing forums at www.cloudynights.com do bear that out.\n\nSo I do like Jeff's advice, but I'm still not sure how much you can totally eliminate it, since it is such a natural question in almost any hobby/topic.\n\nFurther discussion welcome on the specific astronomy site on the meta here: http://meta.stackoverflow.com/questions/70797/making-a-successful-astronomy-se"}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": "http://examinemysite.com/blog", "date": "Nov 24, 2010", "message": "Some people don't have the time to do the search even if they know the requirements. They just want the 2-3 model names recommended by a few. That's a valid objective. If these the answers get obsolete after a time period, the stackexchange platform could offer an option to delete the question after some votes.\n\nCreate a shopping stackexchange site which will carry over all these shopping questions."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 24, 2010", "message": "> It’s about “how can I make a better decision” vs “what did you decide”.\n\nParaphrased more generally -- to broaden it to all kinds of [recommendation] questions -- what I want to see is this:\n\n<b>Don't just recommend X. Explain <i>why</i> you recommend X.</b> That is:\n\n- share your personal experiences using X\n- what characteristics of X make it better than the alternatives?\n- what other things like X have you tried?\n- what is X best at? What is X worst at?\n\nShopping (at least for computer hardware and cameras) has the benefit of being anchored on concrete technical specifications that people should understand, at least a little, before buying. Extending it outward to recommendations for books, boardgames, etc means these questions are inevitably and unavoidably purely subjective -- so points #1 and #2 in Good Subjective, Bad Subjective apply in force:\n\nhttp://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/"}, {"author_name": "SSKUCE", "gravatar_hash": "b139a6d5ea2ed82bcba6d23ea9e4e27c", "author_url": "http://stackoverflow.com/users/131166/sskuce", "date": "Nov 29, 2010", "message": "I had asked a question on SU - http://superuser.com/questions/205825/looking-for-fast-rs-232-or-rs-485-interface-cards-for-windows-closed - which got closed, I presume because it's a \"shopping\" question.  The problem is, I had already Googled to the ends of the (known to me) internets, and I had a legitimate need for a card with very specific capabilities, and I needed to know if such a beast exists.  If this kind of question doesn't belong on SU, where does it belong, since there is not and probably never will be a \"highspeedserialinterfaces.stackexchange.com\"?  Granted, it got answered on SU before it got closed, but I don't think this question violates the \"spirit\" of SU's rules, just a well-meaning \"letter\" of those rules."}, {"author_name": "sal", "gravatar_hash": "5ecaf45b0d3cc881c27b83ce764d08b8", "author_url": null, "date": "Sep 25, 2011", "message": "There are two types of reader out there.  \n\nI operate on Stack Overflow as a programmer and use the site because it's great at helping me do my job better (I write scientific software).  I'm not good enough to contribute much but I like to read the experts and appreciate the help they give me.\n\nOn SuperUser I (usually) just want an answer to a tech question that's driving me nuts.  I've just tried this evening to ask a question about kit that will allow me to set up a wireless bridge between two buildings. Just like SSKUCE (above) I've spent all afternoon Googling to try and figure out if there's a piece of kit that actually works.  Tech specs aren't enough.  I already have a collection of white boxes that *ought* to work but *don't*.  I don't have time (I'm not a CS student... :-)) to fully investigate the in and outs of wireless bridging.\n\nSo - a big up-vote from me for techshopping.stackexchange.com"}, {"author_name": "Steve Bennett", "gravatar_hash": "75f5707160697b2164444fc3f5054084", "author_url": null, "date": "Oct 20, 2011", "message": "Having recently fallen afoul of this rule, and read up on it a bit, I'd like to argue against it. Jeff's example is pretty bad, his argument appears to be:\na) Asking for a good low light P&amp;S is bad, because such cameras will change over time\nb) Answering that looking for a 400 ISO camera is ok, because that answer is eternal.\n\nFirst, as a reader at the site, a) seems perfectly useful, to know that XXX camera was a good low-light camera in October 2011. If I come past in 2013, I have the context I need to discount that answer: it's two years old.\n\nSecond, his \"eternal\" answer is simply wrong. 400 ISO (ignoring actual noise performance at a given ISO setting) might be \"good\" low light performance in 2010, but do you really think that will be the same in 2020? 2030? Many (most? virtually all?) answers date for similar reasons. Even the answer to a simple question like \"How do you do X in application Y\" could be hopelessly out of date next week when the UI changes.\n\nSo: I think the premise is wrong, and the rule is annoyingly broken."}, {"author_name": "Butaca", "gravatar_hash": "0d17badfb807097c250f7c84da7b7eaf", "author_url": null, "date": "Jun 06, 2012", "message": "I had a question removed at music.stackexchange.com because of this thinking. I was asking for references (books, references, online articles, etc.) in a composition topic because I could not find literature about it. My question was deleted and the reason given was 'it is a shopping question'.\n\nPosts like these, may urge some moderators to find a pretext to delete a question and feed their authority needs.\n\nYou should be careful with posts like these."}, {"author_name": "Tanner", "gravatar_hash": "313a8c0bf8a471507a9bf6e91d62c931", "author_url": null, "date": "Jul 13, 2012", "message": "I guess that it's the collective thought that all answers to a shopping question will be taken to heart despite who provides the answer. Not so in my case, every answer I get I research the answerer before I begin to believe anything I am reading. If they only stop in stack communities to edit grammar and gain points I normally ignore them. I would hope most people also do this as well to validate their \"source\" so to speak. \n\nSo in that manner of thinking who wouldn't trust someone with 20000k+ points who routinely answers similar questions (constructive answers, not just \"umm, try this...\")? I would think that those experienced people would be your community subject matter experts. Those are the people I come to these boards to find, listen to, and learn from. If one of them tells me \"I put my job on the line every day trusting this software. It's never failed me nor caused me to lose any sleep wondering what if?. You can trust it too.\" Then that's all I need. Shouldn't matter that I posted a shopping question."}, {"author_name": "Alan McBee", "gravatar_hash": "1777c8341a895b00a84a435e1304f6e9", "author_url": "http://codecharm.com", "date": "Aug 22, 2012", "message": "I think Jeff's example was probably a little weak, too, but I do agree with the idea that the q&amp;a should at least be somewhat relevant beyond the month in which the question was posed.\n\nThat said, this policy is occasionally (more?) imposed a little more than it should. \n\nI ran afoul of it on a gray area, asking for guidance on upgrading a video adapter (I'm a software guy, not a hardware guy). Could someone have responded with specific product recommendations? Sure, but I wasn't even looking for that! I wanted to know \"Could I do it in a specific system?\" and \"How would I do it?\" \n\nBut because I didn't wrap my question with a disclaimer of \"I'm not only shopping; I don't require a specific product recommendation here,\" it got shot down. The onus was apparently on me, the new user, to know that I have to preface my questions with that specific disclaimer. The FAQ just says I shouldn't ask shopping questions. I didn't think I was!\n\nWhat value does the disclaimer add to the exchange in the q&amp;a? Not a lot. It's mostly noise. Maybe the question editing form should just have an explicit required checkbox that says \"This is not a request for specific product recommendations.\"\n\nMore to the point, my question got closed with a notice that it was \"Off Topic.\" No, it was not off topic. It's just that it was possible to answer it with specific product recommendations, and thus got summarily closed.\n\nSo, Jeff, while I totally support your guidance on people answering questions that they should not attempt to provide specific recommendations on products as a response to questions, I think you might have inadvertently set up a policy where the newer users suffer a poor experience at the hands of the advanced answerers who expect those new users to know better than to solicit questions that might have elicited a specific recommendation.\n\nPerhaps add the checkbox disclaimer (see above).\nOr instead of summarily closing questions that MIGHT solicit specific recommendations, issue a kind of warning or flag that the question seems to be bordering on a policy infringement. \nTeach the new users, don't just hammer them with a policy.\n\n* I know that technically it may be possible to edit a question after it has been closed, thus perhaps re-opening it; if so, that is far from evident."}, {"author_name": "David", "gravatar_hash": "883948009ef57110c97a6bdae6eed93f", "author_url": null, "date": "Dec 01, 2012", "message": "Having fallen afoul of this myself just recently (and, like others, unwittingly) in *answering* something I thought legit, but it turned out to be \"shopping\", I too have read around a little.\n\nMy surprising finding: that this common (and, it seems, slightly contentious) category is *not* explicitly mentioned in the FAQs:\n\nhttp://stackoverflow.com/faq#close\n\nThe FAQ should really include \"shopping questions\" in its guidance -- would help a lot, IMO!"}, {"author_name": "Qix", "gravatar_hash": "ea06a155fd0d70873a97d6a28cf712a3", "author_url": null, "date": "Jan 17, 2013", "message": "Only problem I foresee with shopping-related questions, even ones that are 'acceptable' (as described in the article) is the timeframe. If I were to ask the best computer for programming so many years ago, a lot might say a commadore 64. Obviously, that isn't the case now as times have changed.\n\nThe same can be applied to cameras, languages, etc. If someone were to look at that first acceptable camera question (which states specific models), that information may not be relevant or applicable, or even sane, in a few years' time.\n\nI would personally want to ask something more like the second acceptable camera-related question in the article. It helps more people and is time-irrelevant."}]}