{"response": [{"author_name": "John Parker", "gravatar_hash": "9207dac1a08f23791251e6170b787646", "author_url": "http://www.surface.org.uk", "date": "Nov 09, 2010", "message": "Noticed the change earlier on (the joy of being in GMT-land) - definitely a nice improvement."}, {"author_name": "David Heffernan", "gravatar_hash": "3c0aac2191718ef0309dbc034d9b9961", "author_url": null, "date": "Nov 09, 2010", "message": "Your problem is nothing to do with the organisation of the site.  The problem is that your popularity and success now means that you have more people asking questions than people willing to answer them."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 09, 2010", "message": "@david the stats don't really bear that out; we have a question discoverability problem more than anything else. Eg, users aren't driving towards the /questions/tagged page like they really should be. Now they can just hit F5 on the homepage and see a mix of things they are *probably* interested in."}, {"author_name": "Thomas", "gravatar_hash": "3c087c03ab42d32921b784d9a13e8cff", "author_url": null, "date": "Nov 09, 2010", "message": "I don't like it.\nWhy?\nMagic numbers.\nYou put in magic numbers for me, and you don't let me configure them.\nThat's not nice.\nPlease don't decide what's good for me.\nMake it configurable ASAP."}, {"author_name": "Guy", "gravatar_hash": "aa81a6370a42b90429370bcf2dfad2e8", "author_url": null, "date": "Nov 09, 2010", "message": "Just had a look at the new home page and I can certainly see more interesting quesitons (I could even answer one immediatly) and when I refresh you can see red turning to green across the board!\n\nHopefully you can feed back to us how you will measure the imapct of this change over the next few weeks to see if this was measureably successful in meeting your goal."}, {"author_name": "BleuM937", "gravatar_hash": "4172c3ddf86d5673b7d356595f760776", "author_url": null, "date": "Nov 09, 2010", "message": "I suspect my use-case for SO is not normal, but I actually prefer to see questions that have already been answered. It's very rare that there is a question that I could answer that also has not been sufficiently answered. It's good to see interesting questions *with* interesting answers."}, {"author_name": "Andrew Grimm", "gravatar_hash": "01bbb59a1c3ef9960f25a97afe7e920f", "author_url": "http://andrewjgrimm.wordpress.com", "date": "Nov 09, 2010", "message": "The simplest change you could make to improve things for me is to allow me to mark a question as read.\n\nJoerg Mittag says that he aims to read every question tagged ruby, and I pretty much aim to do the same (apart from Rails ones). Being able to mark questions as read would make that easier for me.\n\nA nice addition to marking a question as read would be being able to see what answers or edits have been made since you marked it as read, but that'd just be icing on the cake."}, {"author_name": "zendar", "gravatar_hash": "9a30aaa95d3a33a716cf3b269dade486", "author_url": null, "date": "Nov 09, 2010", "message": "Why did you remove \"Active\" tab? You could just add \"Interesting\" tab.\nI like to browse questions from time to time, just to see what people do these days.\nMaybe you could put in profile options selection which tab would I like to see as default."}, {"author_name": "cbp", "gravatar_hash": "ba5c66efe587c8fa849165915b5ff256", "author_url": null, "date": "Nov 09, 2010", "message": "Ooh i like it - whenever I had spare time to answer questions, I had taken to automatically clicking on one of my tags that I can answer well in. Having an algorithm do this for me instead is very nice."}, {"author_name": "ChrisF", "gravatar_hash": "ee006a67bbbb535dc04afc6a03b1843f", "author_url": null, "date": "Nov 09, 2010", "message": "I'm with @zendar on this.\n\nBy all means make the Interesting tab the default, but why remove the Active tab? Surely it doesn't cost anything to keep this in.\n\nI feel that you are **forcing** me to change the way I use the site rather than just **encouraging** me. I may well come round to the view that the Interesting tab is better - but let me decide."}, {"author_name": "Frankie", "gravatar_hash": "5a46c45ae5e044a4e63c9ed91b7b7c0a", "author_url": "http://pulsarcap.com/", "date": "Nov 09, 2010", "message": "So far so good.\n\nAbout wanting to see answered question you can, and should, do it by looking up specific tags.\n\nAbout allowing the user to fine-tune how he would like the first page on his own settings, all hail the customization!\n\nBut I'm pretty sure you guys will look into those as soon as you have the time. The setup as it is, in my option, works better towards the original goal of SO - having questions answered."}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Nov 09, 2010", "message": "Aha, I’d noticed there were a lot of unanswered questions with my tags of interest on the home page today. Hadn’t noticed the new tab.\n\nFine work, and fine suggestions from the other commenters."}, {"author_name": "MartinodF", "gravatar_hash": "671bb0ff14a1ab8fa4330eb50b700f73", "author_url": "http://matrix87.com", "date": "Nov 09, 2010", "message": "May I suggest taking into account the OP's accept rate too?"}, {"author_name": "VonC", "gravatar_hash": "4fc12eea3fb81ede59d064d0fdbb84ab", "author_url": "http://stackoverflow.com/users/6309/vonc", "date": "Nov 09, 2010", "message": "But... butbutbut... I don't care about the SO homepage!\nNever have. Never will.  \n\nMost of the tags I monitor can pop-up in several stackexchange sites. \nAnd since:\n- tag sets are introduced for *all sites* (last week: http://blog.stackoverflow.com/2010/11/tag-sets-on-stack-exchange/ ),\n- tag sets now display the number of new questions since the last visit (a few hours ago, http://meta.stackoverflow.com/questions/69408/could-we-have-the-number-of-questions-displayed-for-a-given-tag-set/69778#69778 )\n\n, it is \"tag sets\" FTW and forever from now on ;)"}, {"author_name": "JAngwenyi", "gravatar_hash": "1e71a017b676d937a3ed5332965d86a5", "author_url": "http://karpcom.blogspot.com", "date": "Nov 09, 2010", "message": "@MartinodF +1 Good point. I absolutely love the new layout."}, {"author_name": "Justin Nelson", "gravatar_hash": "d787caaf04b85641692a24099fcee990", "author_url": null, "date": "Nov 09, 2010", "message": "You can still see the old version by visiting the following link:\n\nhttp://stackoverflow.com/?tab=active"}, {"author_name": "Will", "gravatar_hash": "7f1cd1b68caaf0505d947e09e97c8b8d", "author_url": null, "date": "Nov 09, 2010", "message": "Some weakness (?) in the new algorithm has stuck this question:\n\nhttp://stackoverflow.com/questions/4134703/understanding-boostdisjoint-sets\n\nto the top of a lot of people's front pages.  This can't be right, as if it's one of the long-tail of never-answered questions the front-page will fill-up with them gradually, rendering the site useless."}, {"author_name": "drachenstern", "gravatar_hash": "c4cca9bfec5d5e77f625d9fbe8e37a41", "author_url": null, "date": "Nov 09, 2010", "message": "I agree with @MartinodF too ... +100 from me! Multiply the final interestingness score by their accept percentage, so if they have a zero accept, then they have a zero interestingness score.\n\nI'll put it another way, if they're not actively participating in the site and the community, then I don't feel the same joy by helping them that I do helping others."}, {"author_name": "rchern", "gravatar_hash": "9c29dbc9dd6153ac90c145547b1ae948", "author_url": "http://github.com/rchern", "date": "Nov 09, 2010", "message": "For supposedly showing me interesting questions, I'm only getting 2 or 3 that have any of my interesting tags in the top 11 questions I see without scrolling."}, {"author_name": "Aarobot", "gravatar_hash": "b724ebca1ce4dc031f4db1215b70825e", "author_url": null, "date": "Nov 09, 2010", "message": "I'm very happy to see this implemented, and I actually like that the active tag was taken away as well.  Why?  Because it'll help stop the pile-ons for bikeshed questions.\n\nThe new view is great.  I haven't updated my interesting/ignored tags in forever, but even without that, I'm seeing a whole lot of questions that actually look answerable and don't already have a billion answers.  I think this might actually inspire me to start posting occasional answers again.\n\nTag sets are great too but this is a whole other animal; as expected, I see some questions that *might* be of interest to me that simply haven't been tagged properly.\n\nThanks for all your hard work!\n\nP.S. The comment about taking into accept rate might be worth considering at some point in the future - not to use it as a blanket calculation but specifically to downgrade a question when the accept rate is 0%.  A 50% accept rate means nothing at all but a 0% accept rate is a strong sign that the author posts hit-and-run questions."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": null, "date": "Nov 09, 2010", "message": "\"I’ll be honest with you, this change makes me nervous. It’s like Colonel Sanders mucking around with his magical blend of 11 herbs and spices.\"\n\nIt makes me nervous too, but not because you're mucking around with the magic balance that used to work. You have no such piece of art. In fact, that's what you're trying to find. What you have is a simple, easy to understand and predict system and you're replacing it with a complex one in hopes of finding that magic point without filling the frontpage with garbage.\n\nI applaud you trying to find this sweet spot. Be careful though that you don't have a front page full of all the stuff no one cares about. While the good questions go whizzing off the screen."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Nov 09, 2010", "message": "Is the Top 40 scoring tags thing limited like the interesting tags are?\n\nIf not, I request that the +2,000 cap on interesting tags be removed.\n\nAlso, it'd be nice if the -10,000 for ignored tags was cumulative.\n\nOne last note: Please add the Active tab back even if you leave Interesting as the default.  Sometimes, I like reading questions for the answers others have given, and the \"sea of red\" is detrimental to that.  Doubly bad because answered questions will likely never appear on my main page due to the current numbers."}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "Nov 09, 2010", "message": "This looks like an interesting improvement. I've never really used the home page before, my default view is /questions sorted by newest. Why? The most important reason is that there's a two-line snippet of the question on the page! It's hard to write question titles (in the same way it's hard to write newspaper headlines) and most people don't seem very good at it.\n\nI'll give the new home page a try, but I know I'm going to miss the question snippet."}, {"author_name": "Matt", "gravatar_hash": "3009757364d976819b7ed378be955843", "author_url": null, "date": "Nov 09, 2010", "message": "Just another vote to leave the \"Active\" tab available for those that want it.  I often use Stack Overflow to \"sharpen my saw\" (http://www.codinghorror.com/blog/2009/03/sharpening-the-saw.html) by looking for interesting answers to interesting questions.  It is only rarely that I actually attempt to answer a question.  Learning from others' answers is often more rewarding to me than just scoring points."}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Nov 09, 2010", "message": "What is really needed is a suggestion engine, like Netflix's, which shows interesting questions based on what questions you've up/downvoted in the past, and how that compares to what questions others have up/downvoted in the past.  It can then find questions you are more likely to upvote.\n\nThe netflix algorithm is public, and does a pretty good job of this (though it's ridiculously complex)... a good open source implementation would benefit not only SO, but tons of other sites which rely on ratings as well.  Perhaps this is a good project for a rainy boring day...."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Nov 09, 2010", "message": "The new system works for me: I can see a truckload of questions that are relevant to me. Also I'm sure that the percentage of answered questions will go up, because unanswered  questions get shoved in your face repeatedly (but not in an annoying way). \n\nDefinitely feels like an improvement to me."}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Nov 09, 2010", "message": "I'm unfortunately finding that I'm having to increase my ignored list to keep certain questions that I don't (and will likely never have) an answer to, nor affects me in any way.\n\nSpecifically, I had to add C++ to my ignore list to bury this question, which is now stuck at the top of my Intersting tab: http://stackoverflow.com/questions/4135516/jvm-signal-chaining-sigpipe\n\nPlease, please, PLEASE add an option to bury specific questions from the Interesting view so I don't have to ignore tags that I might be interested in just to clean up said page."}, {"author_name": "Joe", "gravatar_hash": "fcb6a57f741812924a5ded7bfee22d12", "author_url": "http://codeharder.com", "date": "Nov 09, 2010", "message": "3 words:\nBest. Change. Ever!\n\nBefore, I had to browse through a see of questions, and finding one I knew that *hadn't* already been answered was tough. Now I see about 2-3 with every page refresh. \n\nGreat stuff, keep it up!"}, {"author_name": "Theo", "gravatar_hash": "8c21306523b16ba5dd35c3549bf90994", "author_url": "http://blog.iconara.net", "date": "Nov 09, 2010", "message": "The new homepage is great. The old one was almost the definition of information overload, but the new one solves the problem very nicely."}, {"author_name": "Zac Thompson", "gravatar_hash": "40ea08872a7ff7470a4bbe4925b0f648", "author_url": "http://zac.ca", "date": "Nov 09, 2010", "message": "Maybe I filter more than most people.  I have a lot of ignored \"tags\" which are things like \"visual-*\", \"*.net\", \"iphone*\", etc.  Looks like your homepage doesn't account for wildcard ignores.  It's no big deal for me to add them as they appear, but it would be easier not to have to."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 10, 2010", "message": "Wildcards are not supported YET but should be within the next 24 hours."}, {"author_name": "Konrad", "gravatar_hash": "f9401202ab73e624cc82800b0fff1489", "author_url": "http://madrat.net", "date": "Nov 10, 2010", "message": "So that explains why the home page stayed absolutely static yesterday, even though I refreshed every few seconds. I was so used to getting new questions with every refresh, it was like casting my net back in the sea and pulling in a new batch of fish, instead of always the same kind (that I then throw back in, because I don’t like them).\n\nWhich brings me to my question: is there a chance of getting a *link* to the “active” tab? At the moment, there isn’t one on the homepage. Of course, clicking “Questions” will display a similar view but this will change the layout of the page."}, {"author_name": "Chris", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.shrinkrays.net", "date": "Nov 10, 2010", "message": "Hi, I have a feature request - can we get the ability, atleast in SO, to search our own questions, answers and favourites?"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Nov 10, 2010", "message": "After a day of testing, I still like it very much. The only thing is that you often see questions again that you have already looked at, and deemed bad or boring or outside your scope or otherwise not worth reacting to.\n\nI assume it would be too expensive to add a minus rating for questions one has already seen?"}, {"author_name": "Ian Ringrose", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Nov 10, 2010", "message": "Please take into account the OP’s accept rate, if they up voted answers on past questions they asked  and for questions with no votes if their past questions often did not get up voted.  It may also be worth taking into account the OP rep band,  e.g. if they have more than 200 rep."}, {"author_name": "Graham", "gravatar_hash": "4039a2862643bd30e8d31568e3ff3e87", "author_url": null, "date": "Nov 10, 2010", "message": "The change has filled my home page with lazy newbie RTFM questions and hidden the interesting ones.\n\nI don't think there's a discoverability issue - I think you have far too many questions that are below the threshold of what's interesting to answer, and shoving them in people's faces doesn't solve that."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Nov 10, 2010", "message": "I can see @Ian's and @Graham's points above but the idea of filtering out newbie questions has been discussed, and resoundingly rejected every time. Please let's not introduce it through the back door (although it's more the front door in this case :)"}, {"author_name": "ix", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Nov 10, 2010", "message": "I'll echo what BlueRaja said above. You really want (and have a built a simple version of) a full blown recommender system and some way to measure how well it's performing (nr of questions clicked from the front page?).\n\nAll the techniques Netflix use are pretty straightforward, btw. But then I did do some research on the subject so maybe I'm biased."}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Nov 10, 2010", "message": "@Pekka, @Andrew Grim\n\nI kept on joking with Jeff yesterday how I want an [x] button so I can make questions go away from the list ... its a fairly tricky change, but if there is enough momentum on meta - I think its doable. \n\nwrt, taking into account the view status - its tricky - first of all technically, but also sometimes you look at stuff and actually want to revisit it and see it again, its too hard for us to make that call for you."}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Nov 10, 2010", "message": "Ian, \n\nCan you post a request WRT accept rate on meta?"}, {"author_name": "Sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://samsaffron.com", "date": "Nov 10, 2010", "message": "@Konrad, \n\nCan you try again today? We made a bunch of changes that make the page *feel* much more dynamic. (by changing sorting and weights)"}, {"author_name": "Mark Peters", "gravatar_hash": "3bfd94ddd8f9099ea5a0e3020d7c4d31", "author_url": "http://stackoverflow.com/users/228171/mark-peters", "date": "Nov 10, 2010", "message": "Love it.  This home page is immediately more useful to me than all of the previous options (combined).  Unanswered questions are getting high visibility.  It may turn out to need some tweaking but great first attempt!"}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Nov 11, 2010", "message": "The home page should be the questions page.  I don't understand why there is an \"interesting\" tab on the homepage but not the questions page, or an \"active\" tab on the questions page but not the homepage..."}, {"author_name": "Ether", "gravatar_hash": "43722cb1e955874a8eb721e9dfe101d1", "author_url": null, "date": "Nov 12, 2010", "message": "&gt; drop questions containing any of your ignored tags \n\nIMHO this should only be done if the \"Hide Ignored Tags\" preference has been checked.  Instead, apply a negative scoring to the score algorithm."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 15, 2010", "message": "@ether every question slot is on prime Manhattan real estate on the SO home page now. We can't afford to fill it with ignored tags any more."}, {"author_name": "Sarang", "gravatar_hash": "0743058708923fb416d0f20b44e7ad54", "author_url": null, "date": "Jan 11, 2011", "message": "I am agree with this. I like the idea of Interesting Tag Questions on the Home Page. However, we should also add some functionality of filtering the questions on the homepage, itself (in the sense of having most interesting tags listed on the homepage itself)."}, {"author_name": "Christopher Allen-Poole", "gravatar_hash": "4092d1b87964c221b032b0c6e28bffe3", "author_url": "http://allen-poole.com", "date": "Apr 27, 2011", "message": "You know what would make this even better? A link to \"interesting\" from the questions page. I have no idea where you'd put it, but there are *plenty* of times where I've wanted it."}, {"author_name": "IAbstract", "gravatar_hash": "0c5a5aa70c6436d498bd65ff828d4fb0", "author_url": null, "date": "Jul 12, 2011", "message": "So this formula will apply a unique display for each user?"}]}