{"response": [{"author_name": "Lucas McCoy", "gravatar_hash": "2083165026d11a172ce52453237d294c", "author_url": "http://stackoverflower/users/56555", "date": "Nov 03, 2010", "message": "WOW! Can I just say how awesome this feature is?!? \n\nWhat better way to get people to use other SE network sites then by allowing them to have all questions for a certain tag on one page."}, {"author_name": "Alexey", "gravatar_hash": "cd991227ac34793b8bae42972cbb03d6", "author_url": "http://www.peoplesnote.org", "date": "Nov 04, 2010", "message": "Is there a set of all tags not part of a tag set? Next you will have to add tag categories, then tag conglomerates."}, {"author_name": "Andrew Russell", "gravatar_hash": "eac2e824ea361ad482a00e73214b7e6c", "author_url": "http://andrewrussell.net/", "date": "Nov 04, 2010", "message": "I was so chuffed when I stumbled upon this feature! Trying to track XNA questions on both GameDev and Stack Overflow was getting tedious (yep that's my tagset in the article - tee hee I feel special)."}, {"author_name": "Bryan D", "gravatar_hash": "3497d52dba17d86666a7bc82a2243c07", "author_url": "http://www.bryandenny.com", "date": "Nov 04, 2010", "message": "I wish we could pull certain tags from certain sites and pull everything from others. For example, Android tag from all sites, but then show all questions from the android.SE (since none are tagged android as that is redundant)."}, {"author_name": "Dan Dumitru", "gravatar_hash": "dead5c6457591268b4bd4c6199fa16b6", "author_url": "http://stackoverflow.com/users/70713/dan-dumitru", "date": "Nov 04, 2010", "message": "I was doing an app with the API that was going to be exactly for this purpose.\n\nI've put it online at http://interestingwaffles.com/ exactly 2 days before you announced the Tag Sets public beta.\n\nAnd, of course, it's way behind Tag Sets, with support only for SO and other missing features, that's why I decided to drop it (I will put it off-line in 2 weeks).\n\nBut it's a nice reiteration of the old rule: be careful what you make with an API, don't choose something that's likely to be incorporated in the main product.\n(on my defense, I thought you weren't going to this, based on the status-declined on this: http://meta.stackoverflow.com/questions/11563/tab-for-interesting-questions)"}, {"author_name": "Dan Dumitru", "gravatar_hash": "dead5c6457591268b4bd4c6199fa16b6", "author_url": "http://stackoverflow.com/users/70713/dan-dumitru", "date": "Nov 04, 2010", "message": "PS: Funny, the tag set for Stack Overflow in the post is exactly my tag set, you probably picked it up because I was comparing Tag Sets to Interesting Waffles for the past 2 weeks, trying to see if there was any point in keeping my app alive.\n\n(the tag set with asp.net, asp.net-mvc, asp.net-mvc-2, c#,\ngoogle-maps, javascript, linq-to-sql, sql-server)"}, {"author_name": "Adam", "gravatar_hash": "207958aa5ac1c42448070dbab3f2dd87", "author_url": "http://stackoverflow.com/users/284685/adam", "date": "Nov 04, 2010", "message": "I would love API access to Tag Sets"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 04, 2010", "message": "@Bryan I don't agree with this (allowing all questions on a site) for the reasons outlined at\n\nhttp://meta.stackoverflow.com/questions/69237/please-allow-including-a-full-site-in-the-stackexchange-globaltag-megablender-a/69454#69454\n\nIt seems to me, to be quite at odds with what the spirit of the thing is -- tags."}, {"author_name": "Name", "gravatar_hash": "7905d373cfab2e0fda04b9e7acc8c879", "author_url": null, "date": "Nov 04, 2010", "message": "Time to start using the stackoverflow network...\n\n\"It seems to me, to be quite at odds with what the spirit of the thing is\"\n\nIf you agree that getting the questions you want with as little work as possible is a good thing, then you should probably look beyond keeping your model to solve this.\n\nIt's true that a global tag sounds like a hack, but that just means you need a better solution. This is a problem close to the core of your business: getting the questions in front of the people who can answer them without flooding anyone with things of no interest (driving them away).\n\nImproving your model to support this goal will only make you better."}, {"author_name": "Nick Presta", "gravatar_hash": "b4a08356600e1e28141b0d9fa60cbf74", "author_url": "http://nickpresta.ca", "date": "Nov 05, 2010", "message": "Please, please, please have support for creating new tags (that can be a part of a tag set) based on an arbitrary criteria. \n\nFor example, I would probably want Python and C in my tag set, but I am also interested in any question with any tag, where the votes are greater than 25. \n\nEven if the criteria was limited, say: number of votes, user who asked the question.  This would be an awesome feature and would be immediately useful, I think."}, {"author_name": "Sergey", "gravatar_hash": "0485c3c78156b334f60641c7602813be", "author_url": null, "date": "Oct 14, 2012", "message": "Thank you! It's wondeful!"}]}