{"response": [{"author_name": "foo", "gravatar_hash": "0bffea28d67872cf1d250d89461c1464", "author_url": null, "date": "Nov 03, 2010", "message": "This reminds me a question I had for you: how do you handle stale questions or answers? I thought about that when you tweeted this question:\nhttp://photo.stackexchange.com/questions/1373/what-point-and-shoots-are-good-in-low-light-conditions\nIn this particular case, the same question could be asked again every 6 months, and newer answers could be more relevant, but will they eventually become visible?"}, {"author_name": "Jason", "gravatar_hash": "0e2e822d32a7ab3d7f0b7098d03b1d16", "author_url": "http://jasonedelman.com", "date": "Nov 03, 2010", "message": "Thank goodness! I've been asking for this feature for a while now... @foo, I agree. Since tech evolves so rapidly, the answer you gave for something when jQuery was 1.3.2 doesn't necessarily apply in 1.4.3 (since \"use moar jQuery\" is the correct response to every question). I wonder if there should be a kind of \"updater\" badge for someone who is awarded the correct answer after another was already selected for like 30 days or something."}, {"author_name": "a_m0d", "gravatar_hash": "ea6c23846a2ce0df1dcf549d55ee166d", "author_url": null, "date": "Nov 03, 2010", "message": "Thanks for this - I've often desired this feature to make it easier to find questions that *really* need a look at."}, {"author_name": "John the Seagull", "gravatar_hash": "27a12fdc32baf8748018d373a973d22f", "author_url": null, "date": "Nov 03, 2010", "message": "The problem @foo mentions could be minimized via 1) Mark any rehash of the question a duplicate and 2) A new (temporary, for the question, with a notice \"hey, these are new answers, might be relevant now\") ordering that shows new answers first if there are no answers newer than, say, 6 months.\n\nOr, via having moderators mark naturally evolving questions wiki, and encouraging people to edit the accepted answer."}, {"author_name": "Nakilon", "gravatar_hash": "f91efda1043d10f4b4aee0a156e2cfd1", "author_url": null, "date": "Nov 03, 2010", "message": "It is bad, that you can filter non-aswered only by the most popular tag of them. What if I want to filter by my Fauvorite tag? Yes, I can edit URL and go to tag I need, but possibility to filter fauvorite by clicking would be much better way."}, {"author_name": "Mark", "gravatar_hash": "f920480f0962ef6646b2f966ba2c0d31", "author_url": "http://markjoslin.com", "date": "Nov 03, 2010", "message": "I think that you need to really tailor the homepage results to a user's strengths. \n\nOf course I don't know how to do this, but if someone never works with SQL, or hates SQL, then it shouldn't be on his homepage. \n\nAlso, this is why I liked that suggestion for \"categories of difficult\" for questions. I know that's, like, a really bad idea or something but if the difficult level can be that of a community-voted sliding scale (+1 for this is a difficult question -1 for this is an easy question), maybe that would work better.\n\nBut I'm just a commoner. These recommendations may SUCK"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Nov 03, 2010", "message": "Am I the only one who finds the word \"later\" in both badge descriptions to be very non-grammatical? Like something a non-native speaker would come up with.\n\nI'd prefer the clearer, but slightly more verbose, \"after it was asked\"-\n\nAnswered a question more than 30 days after it was asked as first answer scoring 2 or more\nAnswered a question more than 60 days after it was asked with score of 5 or more"}, {"author_name": "Jeff Yates", "gravatar_hash": "3b0d930715cf8f5729e177981f69f44e", "author_url": null, "date": "Nov 03, 2010", "message": "This is a fantastic addition - I'll admit that I've been lazy in learning the search syntax.\n\nAfter having just answered a handful of the \"no answer\" questions, I have to wonder how those answers will get visibility beyond just the OP? Will the front page give adequate screen-time to these neglected questions so that they can receive votes/comments/counter-arguments?"}, {"author_name": "Keng", "gravatar_hash": "15769bbea999aee421458f52e7c9d011", "author_url": null, "date": "Nov 03, 2010", "message": "What about a way to give me \"Unanswered/No Answers/Only in my Interested Tags\".  That would put me in a position NOT to try and \"next\" my way through 1500 pages to see 38 questions.\n\n\nwv: \"primates phopling\" as in something Jane Goodall wrote a paper on."}, {"author_name": "David Caunt", "gravatar_hash": "cf0f988ecebdcab90cfe346f3750f5e6", "author_url": null, "date": "Nov 03, 2010", "message": "I think we'll see this trend increase as Stack Overflow grows. As a fairly frequent user (I've answered nearly 300 questions) who mainly answers PHP and Zend Framework questions, I've noticed a common pattern in behaviour.\n\nAs Zend Framework is a framework for PHP developers, there's a smaller base of programmers who know how it works, and therefore a smaller number of users able to answer questions. This means that there's also a smaller number of users around to upvote good answers in Zend Framework questions.\n\nA question like 'How do I sum all of the values in an array?' for PHP will receive much more attention than a complex Zend Framework question for the simple reason that if you answer, and answer within around 30 seconds, you'll get a lot of upvotes. A lot of upvotes means a lot of reputation, the main motivator for answers.\n\nI won't go so far as to say there is no reward for answering the less popular/obvious questions, but those motivated by reputation alone won't bother."}, {"author_name": "Pent", "gravatar_hash": "f95f20c65f0335b7f1257b0d6812206f", "author_url": null, "date": "Nov 04, 2010", "message": "David has a very valid concern. I noticed a similar trend about a year ago with my own answers on c# and .net - the complex and interesting questions got far less attention than the trivial questions.\n\nA trivial questions gets a lot of attention (and upvotes) initially and the first few answers get most of the upvotes. The amount of upvotes for an answer perceived correct depends primarily on how fast it was answered. Writing quality, completeness or even actual correctness (as opposed to perceived correctness) don't matter much.\n\nIt's not hopelessly bad though, not yet at least. The complex/interesting/tough questions have a strength of their own - they usually don't have duplicates and have real content, so they turn up in google searches and get some attention over the long run."}, {"author_name": "Hans Passant", "gravatar_hash": "4235db1aa1b11bcddb720dbc70b34a0f", "author_url": null, "date": "Nov 04, 2010", "message": "Very wrong approach.  That statistics are easy to see from the user leagues, well less than 1 in 10 users are regularly posting answers.  This is a limited resource, expecting them to waste their time on bozo questions does *not* help anything.\n\nFix the real problem, give me a way to vote \"this question isn't good enough to be here\".  And no, I don't want to waste a rep point on it.  That requires me to comp it by getting an upvote on some other difficult question that nobody looks at.  The need is real, there's a lot of stuff getting flagged as spam that isn't."}, {"author_name": "Toby Allen", "gravatar_hash": "1e037aa722c82abdf479a505a36bf1ed", "author_url": "http://intellectualmollusc.net", "date": "Nov 05, 2010", "message": "Having just taken a look at answering some unanswered question there is a definite class of unanswerable question.  These are ones that don't make sense, don't explain the problem sufficiently well or are a 'here's my code' whats wrong type that will never be solved as the OP has moved onto more important things.  Maybe these could be marked as ONV (Of No Value) and removed from the system so as not to linger."}, {"author_name": "Alex K", "gravatar_hash": "6c1f5ef56be0525ef0230542b103946e", "author_url": null, "date": "Nov 08, 2010", "message": "This is a feature I wish SO had for a while now (almost since I joined). Ability for the Question Author (and maybe admins) to promoted a comment to an Answer (as in take if from the comment area, and create a new answer post by that user). I was looking through the questions with no answers and a lot of them are of this type. People answering in comments instead of posting answers.\n\nIn fact I personally never accepted an answer to several of my questions because the answers are posted as comments and not actual answers."}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Nov 13, 2010", "message": "I've been using the unanswered button today and really like it.  Most of the time, the question has been answered already, and I can upvote the best answer.  That way less good answers go without a vote."}]}