{"response": [{"author_name": "Pablo", "gravatar_hash": "99108829176dfbbc5d0bf3c041542a26", "author_url": null, "date": "Nov 29, 2010", "message": "Should this two points be taken into account for StackOverflow (and other sites too) ?\n\nI have seem a few questions where it's obvious the user is not going to be a positive contributor of the community."}, {"author_name": "badp", "gravatar_hash": "c81f585328c241594864f888f1154025", "author_url": null, "date": "Nov 29, 2010", "message": "I guess it went without saying that the above really only applies to GTKY questions and GTKY questions alone? :)"}, {"author_name": "Daniel Lew", "gravatar_hash": "d225ebf0faa666ac7655cc7e4689283c", "author_url": null, "date": "Nov 29, 2010", "message": "I find this amusing because just the other day I was telling a fellow SO user that one reason I enjoy the community of gaming.stackexchange.com was due to the \"identify this game\" questions.  In fact, I was probably mentioning this right as you were trying to shut it down, as I don't pay attention to the meta exchanges.\n\nTo me, shutting down \"identify this game\" questions is tantamount to the annoyance I get from Wikipedia deletionists - it's taking up barely any space and it's beneficial to someone, so why do you have to view it negatively?"}, {"author_name": "Kevin Fairchild", "gravatar_hash": "115c8abb0d51b57e4fa507caf196bc80", "author_url": "http://developmentgeek.com", "date": "Nov 29, 2010", "message": "Am I the only one who noticed two uses of \"gray area\" and one of \"grey area\"?"}, {"author_name": "tzenes", "gravatar_hash": "947c457cb4e5480cb8b2f09e49794834", "author_url": "http://gaming.stackexchange.com/users/102/tzenes", "date": "Nov 29, 2010", "message": "&gt; To me, shutting down “identify this game” questions is tantamount to the annoyance I get from Wikipedia deletionists – it’s taking up barely any space and it’s beneficial to someone, so why do you have to view it negatively?\n\nMan isn't this a good point.\n\nWhat is with those Wikipedia guys anyway? What does it hurt if I add myself to Wikipedia? Why is notable such a big deal over there?  Its like they're trying to establish a reputable Encyclopedia instead of trying to cover everything....\n\nThe problem with the logic \"it's taking up barely any space\" is that I can apply it to any question no matter how bad.\n\nThis argument of Mac vs Windows is bad, but it's taking up barely any space...\n\nNon omnes possumus omnia, my Latin teacher was always quick to remind me: You can't do everything.  What she was trying to say was: we have limited time and resources and if we spread them too thin we'll fail at everything.\n\nIts very easy to look at crowd sourcing and say: *I have unlimited time and resource* and completely ignore the consequence of trying to access them.  If we let in questions which are Bad™, then we risk eroding our community over time.  Even in small numbers these questions lead to erosion and quickly snow ball.  If you want a good example of snow balling, look at Game-Rec on gaming.se: its a mess.  \n\nSo there is a lot of value in nipping this in the bud, and there is a good reason I don't have an entry in Wikipedia (though I get a user page).  People need to lay off the Wikipedia moderators a little.  Sure their approach can feel Draconian, but sometimes when you're herding cats you have to be a little strict: that's the price we pay for drawing on every Tom, Dick and Harry on the [Internet](www.4chan.org)."}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Nov 29, 2010", "message": "Er, so the new position on whether or not to close these questions is whether or not you like the user?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Nov 29, 2010", "message": "@Pablo \"Should this two points be taken into account for StackOverflow (and other sites too) ?\"\n\nIf the question is EGREGIOUSLY off-topic, then it should be closed because it is off topic! But when the question is only kinda/sorta/maybe off-topic then you should factor in \"will the presence of this user on our site make my community better or worse?\"\n\n@BlueRaja where did I say anything about liking or not liking users? What I said was:\n\n\"based on the context, quality, and content of the question, could this user potentially be a positive contributor to your community?\n\nYes or no?\n\nIt's about the user only insofar as they are able to produce a *quality* gray area question."}, {"author_name": "melicerte", "gravatar_hash": "1a1abb12888f5e52526efaf52351cc4e", "author_url": null, "date": "Dec 03, 2010", "message": "Rule number 3 of the Pee-Wee Herman Rule:\nYou shall not forget the biker question:\n\nDid anybody tell you that this is the private club of the Satan’s Helpers?\n\nCheers,"}, {"author_name": "Jane", "gravatar_hash": "5f028d2b114933cf1bba86717c25226f", "author_url": null, "date": "Dec 03, 2010", "message": "Funny, because that clip demonstrates exactly how I feel as a female trying to join a community of mostly male programmers.  I understand what you're getting at, but I kind of wish that you had been more careful to state what it means to \"belong.\"  There are already a lot of people who feel that they don't belong in programming communities when there is no good reason why they shouldn't.\n\nDoes a Muslim woman from Indonesia with a passion for Scala \"belong\"?  I imagine that you, Jeff, would say yes.  But when you write a post about how to treat people who don't belong, you need to bear in mind that many programmers would say no."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Dec 04, 2010", "message": "@Jane I don't know how we would know any of that information.\n\nMostly I am referring to things like\n\n- can this person form complete sentences, with punctuation and capital letters more or less in the correct places?\n- can this person express a coherent thought in writing?\n- does this person appear to be angry at the audience?\n\nAll of which can be inferred from the *content* of the question itself, and has little to nothing to do with the identity of that person."}]}