{"response": [{"author_name": "Martin Beckett", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Nov 09, 2010", "message": "I assumed SO used CV because they didn't know how to get the e-acute on the end of resumé.\nOr they just like two letter abbreviations."}, {"author_name": "blufive", "gravatar_hash": "5f53c0fae4a569280d0987a6fd5a699e", "author_url": null, "date": "Nov 10, 2010", "message": "Just another datapoint: here in the UK, everyone talks about \"CVs\".  If you say \"resume\", people will look at you funny."}, {"author_name": "Dinah", "gravatar_hash": "d7903d8d8a0ef0b446d12906bc32dae8", "author_url": null, "date": "Nov 10, 2010", "message": "@blufive: I'm from the south-eastern United States. If I say *anything* to a European they look at me funny."}, {"author_name": "Steve", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Nov 10, 2010", "message": "I've always seen this as a matter of experience level.\n\nApplication - for minimum wage jobs at a fast food joint\nResume - for regular job seekers\nCurriculum Vitae - for professional career seekers\n\nPossibly snobby?... maybe but if you supply your CV to a company and their stuck on \"what's a CV?\" its often a good sign you could find a better gig."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Nov 10, 2010", "message": "@Dinah: Actually, if you're from Southeastern US, then anything you say to anyone north of the Mason-Dixon line would sound funny too. Just sayin'. :-P\n\n(I currently live in NC. However, I'm working hard to keep my New Zealand accent!)"}, {"author_name": "ix", "gravatar_hash": "01bb891a03442bf5494b7e35804c6dc1", "author_url": null, "date": "Nov 12, 2010", "message": "In many parts of Europe, CV == résumé (which y'all are pronouncing wrong, for some reason :P), and you generally don't pad out the CV you send out to companies with experience irrelevant to the job (though, for most jobs I would apply for, almost everything you list would be relevant). I've been taught it should always include your complete education and employment background, though.\n\nThen again, it varies hugely between regions, sectors and even individual companies."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Nov 13, 2010", "message": "I remember on the podcast Joel and Jeff discussing it and it basically really amounted to \\resume has a bad connotation in the US\\ so they chose CV. But then the comments on that episode revealed that CV had just as bad a connotation around the world. Not a big deal, but you brought it up. :)"}, {"author_name": "Jack", "gravatar_hash": "d8dbec34a43456856f7d219da71d6a50", "author_url": null, "date": "Nov 17, 2010", "message": "It wasn't until a few years ago that I realized that it was okay for my resume to be over one page.\n\nOne page resume/CV was drilled into my head through college and after. Then the tech interviewer at a consulting firm said \"dude your resume sucks. one page? this is garbage\"\n\nIt's now about six pages.  Good times."}]}