{"response": [{"author_name": "Mark Garcia", "gravatar_hash": "bd94e42efcd0a663a19a1fc252cec592", "author_url": null, "date": "Aug 12, 2013", "message": "These are the reasons why I turn off my adblocker in stackoverflow.\n\nAnd BTW, please tell me that freehand isn't done using a mouse. :-)"}, {"author_name": "Anonymous", "gravatar_hash": "6a4a50b0ef778273f75a3a1a436752b9", "author_url": null, "date": "Aug 12, 2013", "message": "@Mark: It's a reference to the Wow! signal. https://en.wikipedia.org/wiki/Wow!_signal"}, {"author_name": "Chandra Sekhar", "gravatar_hash": "7b7cbef75a2a4050ecbd28f8008c6f80", "author_url": "http://www.profile.kakarla.in", "date": "Aug 13, 2013", "message": "SE Careers will fix how companies hire developers,\nVery Innovative application."}, {"author_name": "Jeff Noel", "gravatar_hash": "ecbfabf24561d826836fe293c97b51e0", "author_url": "http://jfnoel.com", "date": "Aug 13, 2013", "message": "You guys are totally amazing. This will reinvent the way job applications are delivered, and job applicants are found!"}, {"author_name": "Bill P. Godfrey", "gravatar_hash": "760bfd359153d0682dbe113dc02f81ba", "author_url": "http://billpg.com/", "date": "Aug 13, 2013", "message": "Can you really guarantee that I'll never be poked with a sharp stick?\n\nWhat if I were to poke myself with a sharp stick. Will the stick patrol stop me?"}, {"author_name": "Stéphane Bruckert", "gravatar_hash": "aa56a00a9f9ee1f6a72376071da280f0", "author_url": "http://www.stephanebruckert.com", "date": "Aug 13, 2013", "message": "Your advertising system is great!"}, {"author_name": "Anna Lear", "gravatar_hash": "c7df81e0a4724e87eb5715da50a58977", "author_url": "http://meta.stackoverflow.com/users/155160/anna-lear", "date": "Aug 13, 2013", "message": "@Bill I don't know about *guarantees* per se, but so far I haven't been poked with a sharp stick. Blunt sticks are another matter entirely..."}, {"author_name": "dmi3y", "gravatar_hash": "0188f1d4ce09f74e37c74da2f1230db2", "author_url": null, "date": "Aug 14, 2013", "message": "Hey guys, wish your Wow signal was detected not only once in a while :)"}, {"author_name": "Tony", "gravatar_hash": "b9b3a45f35d04878c43212d73fbf74ad", "author_url": null, "date": "Aug 15, 2013", "message": "Yeah but who wants to live for a company? Some of the companies advertise themselves like it would be the meaning of life to work for them. See Evernote and the \"unlimited vacation policy\". See the article at http://www.washingtonpost.com/blogs/on-leadership/wp/2013/08/13/the-catch-of-having-an-unlimited-vacation-policy/. What is wrong with this world?"}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Aug 15, 2013", "message": "I first read the title as \"finding great company\" and thought that dating.stackoverflow.com  had finally launched!"}, {"author_name": "zebonaut", "gravatar_hash": "d893540a1b7b3ce6489c5ed86bee5365", "author_url": "http://electronics.stackexchange.com/users/930/zebonaut", "date": "Aug 24, 2013", "message": "I've just checked what the ads look like for my European hometown, and while there are not many (yet?), it looks promising. There appear to be real ads by real companies. Great. Here's what worries me: Once Careers.SE becomes really big, the list of jobs will likely be cluttered with job offers of contractors, consultants, freelance agencies (or whatever euphemism you prefer). Now, this isn't about working conditions at these agencies, they may not even be bad. It's about the fact that when you are employed through an agency, your agent tries to find a job position for you, and you likely end up filling a role not suited best for you, to begin with, but suited best for the agency. It's much like having headhunters take care of your job seeking needs; they're actually caring more about their own job seeking needs, with \"good enough\" being all they care about for you.\n\nMy worst job interview was through a headhunter. I had told them I wanted to do development, and they agreed. During the interview, it became clear that it was actually a sales job. Wasted time for the company, wasted time for the headhunter, wasted time for me.\n\nI got all my gigs by sending my own resume directly to the company's very own HR departments. It's a live and direct transmission, and the channel has a great signal-to-noise ratio.\n\nStack Exchange is all about a good signal strength and the lowest possible noise. Please make sure this will be your one main goal for careers.SE, too. Otherwise, it'll be just another broken job site where you find one real job offer among 20 vague blah-blahs of shiny contracting companies."}]}