{"response": [{"author_name": "Jonathan Sampson", "gravatar_hash": "a84a8714fd33f6676743f9734a824feb", "author_url": "http://sampson.ms", "date": "Aug 05, 2013", "message": "Love to see Jeff back on one of these; looking forward to listening. Discourse is a phenomenal project that will surely replace the PHPBBs out in the wild. And as always, it's so well built."}, {"author_name": "Eric Siegel", "gravatar_hash": "31975d063f893b2551f6f7d5ed6bfa8e", "author_url": "http://labs.nticompassinc.com", "date": "Aug 05, 2013", "message": "That song at the end is awesome.  Is that the Stack Exchange theme song?"}, {"author_name": "Ben", "gravatar_hash": "c3ac1e043eea3258ea1d289dcedf6844", "author_url": null, "date": "Aug 05, 2013", "message": "The link to Ben's Android development post isn't working for me."}, {"author_name": "hek2mgl", "gravatar_hash": "2ea6b0398ae82d7e96aada90b8938734", "author_url": "http://www.metashock.net", "date": "Aug 05, 2013", "message": "That's funny but not fair. To all indians: I love india (although I never was there).. You are very polite and nice people!"}, {"author_name": "Kronos", "gravatar_hash": "4d19fd706ffd7042d3b1749ff4fa9ae9", "author_url": "http://stackexchange.com/users/200902/kronos", "date": "Aug 05, 2013", "message": "Happy Birthday from Stage."}, {"author_name": "Giri", "gravatar_hash": "d42a80b4c1210d697031449b8f86df38", "author_url": null, "date": "Aug 05, 2013", "message": "One thing I am not clear is how discourse is different from these wordpress forums?\n\nCan startups use any of these features with limitations? I hope they won't be considered as small business."}, {"author_name": "ParokshaX", "gravatar_hash": "42f7158e29d1d0b9bdc3d53f9d3b8a97", "author_url": "http://www.paroksha.com", "date": "Aug 05, 2013", "message": "about India, that's not fair"}, {"author_name": "Javid", "gravatar_hash": "a876ac809850c345a154990912d5724d", "author_url": "http://www.codeforbrowser.com", "date": "Aug 06, 2013", "message": "@Ben. Works for me. Check again."}, {"author_name": "onABoat", "gravatar_hash": "808cd4a30e100117c7d74c0b5c988fbb", "author_url": null, "date": "Aug 06, 2013", "message": "U should really put a compressor on the recordings to flatten out the volume spikes in your guys speak volume, also maybe turn down on the cut off."}, {"author_name": "AlbeyAmakiir", "gravatar_hash": "fa1512d38160d0546361d2723d0949e4", "author_url": null, "date": "Aug 06, 2013", "message": "Still want statistics on how the name of the last podcast affected the listener count."}, {"author_name": "Thenrich", "gravatar_hash": "886427a445a180eb6618d77ee4ec4894", "author_url": null, "date": "Aug 06, 2013", "message": "When Jeff doesn't like a few features in a software, the whole software sucks for him. Few forum software from years ago where you have to search your post to see if someone replied exist now. Nowadays forums email you reply notifications. Either lame forums use lame forum software or the host is lazy to use something better. Most forum software are free and open source.\n\nEven stackoverflow has a feature that sucks in my opinion. You can't post a question which might produce anything resembling a list of good answers. So no \"What's a good x to y\" type of questions. I questioned a few features on meta and got enough downvotes from meta sheeple to ban me from asking again (this was cleared later). That's another feature that sucks because it can't differentiate between abusers or someone who is just active and has ideas most people don't agree with.\nAt least the stackechange people weren't hard headed and eventually introduced the \"on hold\" question status.\n\nAs for the comment about clicking to collapse a non-interesting thread which Jeff says is an extra effort. Which is faster? Clicking to collapse a multipage thread and getting the next reply to your eye level or scrolling down.. scrolling down.. scrolling down trying to find the end of the thread? Yeah.. web usability is a subjective matter. \n\nThe current forum software can be improved a lot with some basic usability enhancements. I don't understand why their developers are not improving them quickly enough.\n\nI wish Jeff good luck with Discource. Will it displace the current forums software, time will tell."}, {"author_name": "rgripper", "gravatar_hash": "f304c9ec0b65e28eafe215fa0adb5fe7", "author_url": null, "date": "Aug 07, 2013", "message": "I also find these comment plugins on some third party websites glaring. The first seconds I see it thinking: \"OMG! My avatar's here, I must have already posted something I have no idea why\"."}, {"author_name": "Lightness Races in Orbit", "gravatar_hash": "3189f1e006358ec6c65481b9605cd0e3", "author_url": "http://stackoverflow.com/users/560648/lightness-races-in-orbit", "date": "Aug 07, 2013", "message": "Ugh, just-in-time loading. I *hate* this. I HATE it with a firey passion. Ever since Facebook took all their photo and activity lists and replaced the pagination with a slow, buggy, never-ending stream of crap that I can't seek through at will but have to painstakingly load one \"segment\" at a time, even if I know that what I want is right at the end. Please don't be part of -- nay, encourage -- this horrendous trend, Jeff. PLEASE."}, {"author_name": "Henning", "gravatar_hash": "c447df18a206a74e98600817a557a3ae", "author_url": "http://henningpetersen.com", "date": "Aug 07, 2013", "message": "Jeff returns, and all of a sudden the deep, focused discussion that was great about the Stack Overflow podcast is back.\n\nStack Exchange podcast's recurring theme \"oh man, this is so bad, we cannot use *any* of this\" never happened with Jeff. He was driving this show without being aware of it."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog", "date": "Aug 07, 2013", "message": "&gt; Can startups use any of these features with limitations?\n\nOf course, Discourse is 100% open source (GPL v2) software now and forever:\n\nhttps://github.com/discourse/discourse\n\n&gt; Either lame forums use lame forum software\n\nBut nobody is upgrading all these \"lame\" forums and they seem content to sit at the old version basically forever. Another problem within the forum industry is massive resistance to any change, even a \"minor\" upgrade to a newer, slightly-less-sucky version of the forum software they already use.\n\nBut do watch the first 10-15 minutes of this, if you can:\n\nhttp://blog.discourse.org/2013/06/forums-are-dead-long-live-forums/"}, {"author_name": "Ortzinator", "gravatar_hash": "44770e6f2075241a21ab855de6838108", "author_url": null, "date": "Aug 07, 2013", "message": "@Thenrich: That's not a \"feature\", that's a type of question that the community has explicitly decided to not allow and for good reasons. And abusers are accounted for because downvoting sacrifices some of your own rep."}, {"author_name": "online project management software", "gravatar_hash": "ed5887e3fb558fd8b029dd164eb290e3", "author_url": "http://www.easyprojects.net", "date": "Aug 21, 2013", "message": "Unfortunately, cannot agree to you on Disqus. Never really liked it, not nice, not cool - just nothing. I like more vBulletin, interface is clear and understandable. Comments and the blog itself look cool."}, {"author_name": "mobile app development company", "gravatar_hash": "1367251617c1390811544058199941b1", "author_url": "http://www.scnsoft.com/services/mobile-development-services", "date": "Aug 21, 2013", "message": "As for me, I prefer more Discourse that Wordpress. And I cannot say why - it's how I feel about it. The post is nice, I'm glad you are back, I enjoyed reading the article."}]}