{"response": [{"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Apr 13, 2010", "message": "Why the need to vet the new site applications?\n\nOnes with a clear use will get an audience ones without will die, dead sites only cost you disk space and there can be a no-new question in X months=delete contract.\n\nIt seems to have the air of \"not quite getting the internet\" of large computer companies in the 90s. \nWhere somehow they would approve your website before hosting it."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 13, 2010", "message": "> Ones with a clear use will get an audience ones without will die,\n\nSo why bother with the ones that are unlikely to survive? Why not focus our efforts on the ones that <i>the community itself</i> decides have a reasonable chance of making it?"}, {"author_name": "Kevin H", "gravatar_hash": "3dc7e21f80eaeac65920752c7d315af2", "author_url": "http://www.burntpopcorn.net", "date": "Apr 13, 2010", "message": "Actually, my garage door opener only works when I'm right at the door. What overflow can I ask that on? :)"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Apr 13, 2010", "message": "&gt;So why bother with the ones that are unlikely to survive?\n\nSame reason that wordpress didn't demand proof that some Jeff guy's blog would have readers?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 13, 2010", "message": "> Same reason that wordpress didn’t demand proof that some Jeff guy’s blog would have readers?\n\nAh, but there's the difference: it only takes ONE person (of questionable talent, but still) to make a blog successful.\n\nTo make a *community* successful, you need many talented people working together. That is much, much harder."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Apr 13, 2010", "message": "@Kevin - Chiphacker might be able to help you - It's not exactly on topic, but if you phrase it asking for suggestions to improve the reception of the opener, or transmission of the remote, then you might get some good help."}, {"author_name": "Bill Paetzke", "gravatar_hash": "c91ce3d89649695f1b35ffa2a07b100e", "author_url": "http://careers.stackoverflow.com/billpaetzke", "date": "Apr 13, 2010", "message": "I like the new workflow.   \n\nPlease consider the use case of companies using this as support for their products. Make it real easy for them to invite their users to join the closed beta.  And so on. \n\nI will keep on eye on how it goes for other companies using StackExchange for product support. If it goes well, I'll push it at my employer.  I've already got them using FogBugz.\n\nI know FogCreek already uses it for their support, but that doesn't count because they didn't go through your new workflow.\n\nGood luck :)"}, {"author_name": "Bill Paetzke", "gravatar_hash": "c91ce3d89649695f1b35ffa2a07b100e", "author_url": "http://careers.stackoverflow.com/billpaetzke", "date": "Apr 13, 2010", "message": "Oh. Idea.\n\nSince you guys will host all the stackexchange sites, you could add career sites for high-performing topics.  Something like careers.topic.stackexchange.com.\n\nStackOverflow is your highest performing site, hence the first to receive a careers add-on.  I'm sure there will be other StackExchange sites out there that warrant a careers add-on.\n\nI wonder if that's part of your business plan."}, {"author_name": "rafek", "gravatar_hash": "7c3b45d8f867a5e405f8bb54424e2fdd", "author_url": "http://devMedia.pl", "date": "Apr 14, 2010", "message": "One (but important) shortcoming is that people who had planned to make business using SE platform (and have already put considerable effort -- including money -- according to this) - which was completely possible with SE 1.0 - are now in a dead end."}, {"author_name": "Stefan Thyberg", "gravatar_hash": "7e4805742d316ceeda4ee98502107cbd", "author_url": null, "date": "Apr 14, 2010", "message": "You only used Comic Sans in the mock-ups to screw with all the typographers out there, right?"}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": null, "date": "Apr 14, 2010", "message": "Stefan: That's the default font with Balsamiq, and it looks like that was what he used."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 14, 2010", "message": "Now I am glad that I didn't invest the time, money and effort into building a SE idea I had.  \n\nThis all sounds a lot like some other (overbearing) CEOs/companies who have very specific and controlling views on how the world, computing and internet should look.  \n\nYou've made it free, but the (apparent) rigidity and process are pretty good deterrents themselves.\n\nI am not convinced that non-process oriented concepts/domains will grow in the highly-defined metrics based world you define.  It works for developers and geeks, but tryi8ng to bring in an audience from other places is likely not going to work given the process steps I just read..."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 14, 2010", "message": "Say what you will about phpbb or the other frameworks that you are trying to kill - they have some things going for them that you apparently don't appreciate:\n\n- I don't need anyone's approval to use them.\n\n- The terms of service/use aren't going to be drastically changed at the whim of two guys.\n\n- I don't need to go through a year long process or meet some world-domination metrics numbers"}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Apr 14, 2010", "message": "@Tim, I tend to agree with you. This process seems overly bureaucratic, much more politburo and less hip Internet startup."}, {"author_name": "jdalley", "gravatar_hash": "001ba1c082b8213308c7026c29839c4b", "author_url": null, "date": "Apr 14, 2010", "message": "I think one of the bigger concerns for this is that it relies on the community of geeks and programmers associated with the trilogy thus far. It relies on them to come up with \"what other question topics could hit critical mass\". \n\nI'm sure there will be a lot of successful stack exchange sites that come out of the already established community members with rep &amp; badges &gt;= X, but the goal/mantra you've set will require that people outside the existing trilogy should have a say. \n\nIn some way, you'll have to draw in and give a weighted voice in the creation of new sites to people/experts external or unaffiliated with the trilogy sites. After all you need experts with connections to existing communities to get the right push to critical mass, right? Granted, once a stack exchange goes live and its questions start flowing into Google search results, new people will be drawn in. However the authority parties involved with the initial creation seem to, for the foreseeable future, stem from seasoned trilogy members.\n\n/end IMO"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 14, 2010", "message": "One other problem is that there is a huge risk for initial stakeholders and no reward...  You provide no incentive other than  your own idea that other Q&amp;A/discussion boards should die.  People have to commit to spending 60 days on the sites with the possibility that they will crash and burn and have nothing to show for it.  Not only that - there is no upside for these people.  They get no revenue or ownership.  There is only the possibility that they will be part of a somewhat better Q&amp;A site.  It seems like you've managed to remove all motivations except your own and taken away all upside and reward for new SE sites.  Communities that already exist on other platforms have little incentive to move.  Just having a better stack (a tenuous argument) is not going to fly especially if there is no motivation to move platforms."}, {"author_name": "Bill Paetzke", "gravatar_hash": "c91ce3d89649695f1b35ffa2a07b100e", "author_url": "http://careers.stackoverflow.com/billpaetzke", "date": "Apr 14, 2010", "message": "Tim makes some good points. \n\nWhat are the incentives for founders on an SE site?  Obviously, there is the satisfaction that you're creating a community about a topic you're interested in.  But that's pure volunteer/non-profit work. \n\nI'm sure there are a decent number of would-be founders who want more--perhaps money, power, or prestige.  If you don't care about that demographic, then fine. Otherwise, figure out how to market to them.  This reminds of a quote (not sure from who).  \"How will this product get [your customer] laid?\" \n\nGood luck :)"}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": "http://stackoverflow.com/users/20654/oscar-reyes", "date": "Apr 14, 2010", "message": "We will be able to have webapps Q&amp;A site after all? \n\nhttp://superwebappuser.com \n\n- How do I ... in facebook\n- How do I ... in gmail \n\n\nAnd a non-english programming Q&amp;A\n\n- ¿Por que me sale NullPointerException aqui \n\n\nString a = null; \na.length();\n\n?\n\n\n:) :)"}, {"author_name": "pw", "gravatar_hash": "4832efca59020c6d41ac38ff541f9253", "author_url": null, "date": "Apr 14, 2010", "message": "I really think you've lost the plot here and have committed a great idea to failure by over thinking it and adding too many hoops to jump through."}, {"author_name": "Jason Baker", "gravatar_hash": "b8e26b9942e7193a4fe32c407aacfef5", "author_url": "http://jasonmbaker.com", "date": "Apr 14, 2010", "message": "Sorry, but I just don't see this working.  How exactly is this going to happen with you not only encouraging but *requiring* SE sites to be designed by committee?\n\nI think the end result is just going to be a lot of sites that are inoffensive to everyone (and therefore uninspiring to anyone)."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Apr 14, 2010", "message": "@bill\n&gt;companies using this as support for their products.\nIt might work for smaller companies. A large company isn't going to have support hosted on a site that somebody else is selling the ad space on.\nIf I'm Canon and use a SE site for users of my cameras, how much am I going to have to pay to make sure that Nikon ads aren't placed there? Answer: $1 more than Nikon are prepared to pay so that there are!\n\nFor internal company Q+A sites, there probably isn't the user base to support more than a wiki and there is no way to make this private.\n\nCurrently it looks like the Geocities model - let us host your site for free and we will run ads."}, {"author_name": "B", "gravatar_hash": "608923fbf1c72405f333c5501b1af1aa", "author_url": null, "date": "Apr 14, 2010", "message": "Maybe Jobs is an investor..\n\nThe big problems: No ownership, no reward/payback, drastically changing environment, someone else decides what flies and how quickly and high it must fly. In essence using loyal users as <a href=\"http://www.codinghorror.com/blog/2009/08/are-you-a-digital-sharecropper.html\" rel=\"nofollow\">sharecroppers</a>."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 14, 2010", "message": "> How exactly is this going to happen with you not only encouraging but *requiring* SE sites to be designed by committee?\n\nThe process is there to ensure that communities have an honest chance to form, and survive, with a core of interested people. That takes some coordination. One person can make a blog successful; not so with a community. That takes a group of people working together.\n\n> No ownership, no reward/payback, drastically changing environment\n\nHow so? Ownership is assured through cc-wiki, founding member status, beta badges, and election of moderators. Additionally, the community itself will decide what the logo is, what the domain name is, and so forth. I agree that there are hurdles with design -- that's really tough to do in a group -- but we are coming up with a CSS Zen Garden sort of thing to select from to make it easier.\n\nWe've always said that the goal of these sites is to show off what YOU know, in a public way that benefits you. That's the reward.\n\nAs for the drastically changing environment, that's where we plan to really push forward the engine; for example right now we're working on an open API that works across all network sites, and an App Garden site to support the ecosystem at http://stackapps.com"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 14, 2010", "message": "&gt;&gt;\"Ownership is assured through cc-wiki, founding member status, beta badges, and election of moderators.\"\n\nBig deal.  There is no possibility of money as with the older SE sites and there is a risk that any hard work would be lost when you pull the plug on sites that don't make the grade.  \n\n&gt;&gt; \"We’ve always said that the goal of these sites is to show off what YOU know, in a public way that benefits you. That’s the reward.\"\n\nWhat you've done is put up huge roadblocks that deter people from even trying to give it a go.  You have shown that you are ready to drastically change policies any time and that does not engender trust or willingness to give it a go regardless of your best intentions.  \n\nYour definition of \"ownership\" (for us) lacks any real value - there is no control and there is no money.  Jeff and Joel \"ownership\" is rather more desirable...   Do you realize how silly \"founding member status, beta badges, and election of moderators\" sounds in relation to other rewards that can be had for the amount of effort it will take to jump through your hoops and make a site successful?  \n\nWhat would you choose:\n\n- \"Hey, look, I got a badge from Joel and Jeff.  I'm an owner.  Really.  Well, no, I don't really 'own' anything but I got this nice badge.  See.  It says it right here - 'founding member.' \"  \n\n- \"I spent my time to found my own company/work on a product and we have X clients with revenue that supports N people\"\n\nYou guys are running around with a solution looking for a problem and you think people are going to jump through your hoops for the promise of a beta badge?  \n\nMy eyes glazed over when I read all the process steps you impose on getting one of your new and improved \"communities\" to meet your requirements.  \n\nI think this new-fangled SE idea needs to bake a little bit more.  Or perhaps I am just not your target audience.  I had an idea for a SE site and was toying with the idea of making it happen, but you can bet that I'll pass on it now.  (The target audience is a pretty good demographic for revenue/ads/etc.)"}, {"author_name": "Ward", "gravatar_hash": "f347c53c9cb1ddcb816daeb22aaf89c8", "author_url": "http://www.crazyontap.com", "date": "Apr 14, 2010", "message": "&gt;&gt;&gt; - “Hey, look, I got a badge from Joel and Jeff. I’m an owner. Really. Well, no, I don’t really ‘own’ anything but I got this nice badge. See. It says it right here – ‘founding member.’ ”\n\nWorse, you might get the badge but lose control.  No matter how much they talk about \\the community owns the site and data,\\ they've got the most control over both."}, {"author_name": "Zack", "gravatar_hash": "a27764e5c0529d03018cba073e612c3a", "author_url": "http://stackoverflow.com/users/83/zack-peterson", "date": "Apr 14, 2010", "message": "I'm in the Canon/Nikon position that mgb describes above.\n\nI cannot now continue developing my Stack Exchange site. I need for my Q&amp;A site to remain operational for the long-term and also for my company to retain ownership and control of the site's content and its especially its presentation.\n\nI intended to use my Stack Exchange site as a part of my retail store.\n\nI expected it would serve:\n\n- product support\n- comparison shopping\n- product reviews\n- store policies FAQ\n- events discussion/planning\n- general advice\n\nMy partners and I have been working for months to prepopulate it with many of the frequently-asked questions our company has received via email and telephone over the years. We were seeding it with questions about our popular brands, products, service, events, etc.\n\nWe were 1-2 weeks from launching it with a large email campaign to our loyal customers. Thank God we have at least avoided that public relations nightmare!\n\nWe've been busy programming:\n\n- making product page ads that promote related questions\n- making sidebar ads that promote related products\n- customizing Stack Exchange text content\n- tweaking styles and branding\n- creating our announcement emails\n- revising our customer service email templates\n\nOur goals:\n\n- have customers provide support for each other\n- get visitors to generate search-engine-friendly content to drive traffic to our site\n- and, most importantly: build brand loyalty\n\nThis is especially frustrating because I convinced my partners that Stack Exchange was a solid investment for our business.\n\nI've been using the Stack Overflow site, reading the  blog, and listening to the weekly podcast since the very beginning and felt familiar, comfortable, and excited by the software, the company, and its owners."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Apr 14, 2010", "message": "There's something about this plan that seems off to me. I can see the influence of usenet newsgroups here, and I appreciate that, but I'm not sure that model makes sense now. Revenue sharing for founders might make sense."}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": null, "date": "Apr 14, 2010", "message": "@Zack  Email or call the stack exchange community moderator to discuss this.  I really don't think they plan on leaving anybody in the lurch"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 14, 2010", "message": "> There’s something about this plan that seems off to me\n\nCan you elaborate? This is hard to respond to. I find that financial incentives just don't work. I certainly don't do this for the money; I do it because I love it and because I believe what we're doing makes the internet better for everyone.\n\nThat said, of course money is necessary to run a business and hire and pay people, but it's not the *goal*.\n\n> Or perhaps I am just not your target audience.\n\nThe target audience is people who are interested in building a better internet -- by sharing what they know, and by contributing small slices of participatory governance.\n\nWe're not a non-profit, but we'd like to run like one -- and we'll certainly be a lot more open than, say, the cabal that runs Craigslist."}, {"author_name": "Fredrick Pennachi", "gravatar_hash": "80868923b060c85c9704f2e09fd74bae", "author_url": "http://fredrickpennachi.info", "date": "Apr 14, 2010", "message": "I really don't see why you can't do both.\n\n- Allow people that want to pay for Stack Exchanges pay for them, it's not your problem if their SE doesn't succeed in a way you think is successful.\n\n- Allow community voting and collaboration on new SO Inc. sites ala SE 2.0\n\n\nIs it really that hard?"}, {"author_name": "Dan Dumitru", "gravatar_hash": "dead5c6457591268b4bd4c6199fa16b6", "author_url": "http://WhiteboxHardware.com", "date": "Apr 15, 2010", "message": "You know what they say:\n\"If it makes no sense to anyone, and they all say you're gonna fail, you will probably have 'great success'!\"\n\nI see a bright future for Stack Exchange 2.0.\n\nWith that being said, you kind of betrayed all the SE admins that trusted you.\nThey were early adopters exactly because they trusted Joel and Jeff will do the right thing and follow their promise: \"you can make your own Stack Exchange about anything you like\".\n\nI hope at least you will keep your promise for the 3-12 months free support, and that sites like Math Overflow, Chiphacker or Force Close won't disappear simply because of your greediness."}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "Apr 15, 2010", "message": "I'm interested to know the logic behind not marketing the software to companies (or a university, for that matter), that wanted to use the platform as a support venue ala meta.  We're piloting UserVoice for some support applications and I had some thought of using StackExchange to develop a \"wisdom of crowds\" support venue for students at our University to augment our Help Desk.  We would never be able to qualify under the new rules, but we could develop (I think) a very successful and valuable local community where students help other students with various IT-related issues."}, {"author_name": "Eric Ryan Harrison", "gravatar_hash": "84d9c06ad23348c26556512289dfe6a4", "author_url": "http://ericharrison.info", "date": "Apr 15, 2010", "message": "I agree completely with almost all of the negative comments on this post.\n\nFredrick really did the best job though of summing up my final thoughts: \"I really don’t see why you can’t do both.\"\n\nWhy not do both? I like the idea of having a community-supported mechanism for getting StackOverflow to create, support, and build new community sites that everyone seems to vote on and enjoy... but why the heck not keep StackExchange functional exactly like it was pitched?\n\nThe flipside of this is: as a podcast listener, I was really on board with your (Jeff) vision of StackOverflow being our (programmers) community hosted, run, and monetized by you. But early on, you stated that one of your goals would be to release the source code as open source. I agreed with this vision and found it easy to support you.\n\nThen, sometime around episode 40 or so, when you and Joel were discussing StackExchange, you mentioned Open Sourcing the codebase and he instantly shot it down. His argument was that you can't give away the source code to the product that Fog Creek was going to offer hosted solutions for. I disagreed with his arguments completely, but he seemed to have the final say in the matter because from that point on, Open Sourcing was off the table.\n\nBut even that wasn't that bad, because I understand the monetary implications for Fog Creek. I can't fault him for wanting to make a buck. But now that Fog Creek is no longer offering hosted solutions as was originally intended, then I think releasing the source code should be your goal again.\n\nDoing so would make your arguments of ownership less ridiculous. Sure, you offer these nice data dumps, but with no system in place to read and host the data dumps, it's almost worthless.\n\nSo, I think you need to re-evaluate what it is you're doing to the community of supporters that you guys have created. You seem to be on a streak of pretty lousy decisions. If a company or group wants to pay $100+/month for you to host a StackExchange site with only 3 users, you should be super happy. That's basically free money for you with less bandwidth overhead and data storage requirements. But don't screw over the people who thought that you were going to be providing a service only to then change your mind in such a huge way and take away their choices.\n\nSeems wrong."}, {"author_name": "Donny", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyv.blogspot.com/", "date": "Apr 15, 2010", "message": "I think Stack Exchange has jumped the shark."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 15, 2010", "message": "Here's an easy one for Joel:  Would you take down your FogBugz SE site?  \n\nNo?  \n\nThen why not allow others to use/pay for the technology without going through your \"Internets according to Joel and Jeff in six and a half (not so) easy steps\"?\n\nDonny's right.  SE/SO jumped the shark in many respects."}, {"author_name": "FarmBoy", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Apr 15, 2010", "message": "Joel and Jeff are idiotic, greedy fascists.  I'd never bother reading this blog if I hadn't gotten emotionally connected to the community that they created.\n\nRelax, guys.  If you don't like the SE plans, improve the internet in your own way.\n\nGriping about the imperfections of the team that has created the best developer resource in the last five years accomplishes nothing good."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 15, 2010", "message": "@Farmboy:  \n\n&gt;&gt;\"Griping about the imperfections of the team that has created the best developer resource in the last five years accomplishes nothing good.\"\n\nHuh?  So no one can question or point out problems?  We're all supposed to be sycophantic morons with no brains?  \n\nOn the contrary - any good leader or company listens to \"gripes\" and typically that accomplishes more \"good\" than listening to people fawn over you all day long.  \n\nAlso, where do you draw the line with unquestioning loyalty?  Do they get a free ride forever?  What if Jeff and Joel decided to disseminate viruses or do something else questionable - would they still get a free pass \"because they invented the best developer resource ever\"?\n\nA number of people have invested significant time, effort and money into the technology/platform.  Not to raise these issues is just idiotic."}, {"author_name": "FarmBoy", "gravatar_hash": "d7f82cba9dbc95e901b4280ab315bbf1", "author_url": null, "date": "Apr 15, 2010", "message": "&gt; We’re all supposed to be sycophantic morons with no \n&gt; brains? \n\nNot all of us.  But 19 out of 20 commenters here assume greediness/carelessness/stupidity whenever the team makes a decision that is different than expected.  You guys are in lockstep.\n\nMaybe, though, the SO/SE team has thought longer, harder, and with far more vested interest about the SE problems than the rest of us.  So they come up with a bold new plan.  \n\nIt may succeed, it may fail.  But the current course of action was failing, and I'm glad to see that they are trying something that has the possibility to be better.\n\nSure, point out problems.  I'm sure they all benefit from some of the comments here.  But griping helps nothing.\n\nWhen you say:\n\n&gt; This all sounds a lot like some other (overbearing) \n&gt; CEOs/companies who have very specific and controlling \n&gt; views on how the world, computing and internet should \n&gt; look.\n\nIt isn't very helpful.  Has that been your SO experience?  Don't they deserve a little slack?  A little presumption of good intentions?  Whatever."}, {"author_name": "sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://community-tracker.com", "date": "Apr 15, 2010", "message": "First Jeff, I find it laudable that you want to make the internet a better place, I wish you lots of luck with this adventure. I think that overall this is good for the internet and the SE sites. Once you regain control you can stop SE sites competing with other SE sites like the very unfortunate onstartups / statrtups.com fiasco. \n\nThis also protects SO in many ways from SE competition, if anything splinters off from SO it will still be under the SE blanket and presumably a question migration mechanism can be put in place. \n\nAs to the reward scheme I think it is really tricky, the new VC push means that SO will be bleeding money while stuff ramps up. If it had to share non-existant revenue it would only bleed faster. It also seems that this scheme is more about getting traffic and figuring out later on how to monetize."}, {"author_name": "Ward", "gravatar_hash": "f347c53c9cb1ddcb816daeb22aaf89c8", "author_url": "http://www.crazyontap.com", "date": "Apr 15, 2010", "message": "&gt;&gt;&gt;  But 19 out of 20 commenters here assume greediness/carelessness/stupidity \n\nSince Joel and Jeff mentioned VCs, speculating about what they - and their money - have to do with this is natural.\n\nOther than that, I don't see anything here or on the SE blog comments assuming anything about why they're making this change.\n\nAnd as tim says, what's wrong with questioning this or pointing out problems?  The people who are posting here are probably the ones who are most interested in what happens to the sites/communities, so their feedback is worth listening to."}, {"author_name": "Eric Ryan Harrison", "gravatar_hash": "84d9c06ad23348c26556512289dfe6a4", "author_url": "http://ericharrison.info", "date": "Apr 15, 2010", "message": "&gt; Maybe, though, the SO/SE team has thought longer,\n&gt; harder, and with far more vested interest about the\n&gt; SE problems than the rest of us. So they come up with\n&gt; a bold new plan.\n\n&gt; It may succeed, it may fail. But the current course\n&gt; of action was failing, and I’m glad to see that they\n&gt; are trying something that has the possibility to be\n&gt; better.\n\nWell, that's part of our complaint. We don't care that they have to try a lot of different things. We don't care if they consider things a failure. We're (or at the very least just me) concerned that Joel and Jeff have built a community (which we VERY much appreciate) and then pitched a commercial product to us based on the infrastructure of the community and then got some early customers and for whatever reason decide they didn't like going down that path.\n\nIt would be OK with me if they decided to change and kept both \"pathways\" running at the same time. Let the current users continue (or heck: begin) to pay for the SE service while running the voting mechanism for sites that StackOverflow want to own.\n\nIt would have also been OK if from the very beginning they told us \"We will always be willing to give you all of your data, but you'll never get our source code\" because I would have happily just started writing a similar system that could read their data. Maybe PHPOverflow or something.\n\nThere are just about 101 different things they could have done at different times in the past year that would have made this not as big of an issue.\n\nBut at this stage of the game? They're basically telling us \"We're willing to change our minds at any time about anything.\" \n\nAbsolutely NOTHING is offlimits to them. \n\nThis is an extreme example and is probably NEVER going to happen, but just imagine if in a year Jeff and Joel decide \"Stack Overflow isn't making enough money to cover our costs. We should institute a 'premium member' package.\"\n\nA week ago, I would have said \"Sweet! Joel and Jeff have always been up front with us before. This is good news.\" and then go pay them to upgrade my account. Because, after all, Joel and Jeff made SO specifically because they hated Experts-Exchange (for good reason).\n\nHowever, this blog post signifies a new era in \"StackOverflow\". It's basically the era of \"we are now willing to do anything we want at any time in the interest of profit.\"\n\nThat might not even be true. But it's certainly how I (and probably others) perceive this. So in my extreme example given about premium accounts, I now have serious doubts that at some point in that future timeline that maybe not enough people are signing up for premium accounts and Joel and Jeff decide \"Hey, let's try to restrict some of this content to premium members only to increase conversions.\"\n\nAnd blam, now SO is Experts-Exchange. \n\nSo yeah, I think we have a right to be concerned, at the very least. The way a company makes decisions on small things (like new products offered for free during a beta period) is an indicator of how they might be willing to make decisions on bigger issues.\n\nI'm also aware that SE was in \"beta\" and that nothing was \"set in stone\", so really all of the people that had a Stack Exchange site maybe shouldn't be surprised. But I think Joel and Jeff should have a little bit more internet-common sense about what \"Beta\" means to people these days. These days beta means \"Some things may be broken, and we may or may not be able to fix those things. We might also make significant changes in how a thing looks or how it physically functions.\" \n\nBeta has not meant \"we're going to test the waters with a product on a large number of users to see if the product is viable, and if not, completely take it away.\" Most people willing to make a StackExchange site probably expected things to change, but the last thing they expected was for StackExchange to stop being a thing they could actually use."}, {"author_name": "sam", "gravatar_hash": "3dcae8378d46c244172a115c28ca49ce", "author_url": "http://community-tracker.com", "date": "Apr 15, 2010", "message": "Re: Eric\n&gt; It would be OK with me if they decided to change and kept  both“pathways” running at the same time. Let the current users continue (or heck: begin) to pay for the SE service while running the voting mechanism for sites that StackOverflow want to own.\n\nNot meaning to be a psychophant or anything, I take a fair bit of offence with that rant. \n\nFor me, software as a service SE never really made much sense or gelled with the SO philosophy. \n\n- For me one of SOs most important attributes has always been the CC licensing. This was not enforced in SE sites, which I felt was wrong in quite a few cases. \n\n- SE started creating some sites which got out of control with ads, just to potentially pay bills. This is something that also did not gel with the SO philosophy \n\n- The relationship between SO and SE was never clear. At least now its clear they are both under the same umbrella. \n\n-  It was clear by looking at traffic and number of SE sites that starting to charge would not cover hosting + salary for 3 devs. \n\nFor me the change is way more inline with the original SO spirit. \n\nI think that plenty of products will pop up to cater for companies that need support portals, in fact, I think I do a better job at customer support (where Q&amp;A is a component, the community is smaller, you need a KB and better means of messaging) and would welcome fog creek as customers :)"}, {"author_name": "Eric Ryan Harrison", "gravatar_hash": "84d9c06ad23348c26556512289dfe6a4", "author_url": "http://ericharrison.info", "date": "Apr 15, 2010", "message": "Sam: You make valid points and I agree with you that SE as a model doesn't fit as nicely with SO (as a tech platform). I would have preferred they keep with the initial plan of just Open Sourcing it. But I still think that getting rid of a hosted service when they've already got people using the hosted service is just bad for everyone.\n\nA hosted solution is PERFECT for a company (profitable already) that wants to use the StackOverflow for private internal use or for a front-facing customer service community. Companies would probably not care about the price if it was easy to use and had a good clean interface for their users.\n\nThe problems you mention with SE sites putting ads all over the place is an example of the failed marketing of SE. Instead of a bunch of people saying \"I want to build a SE community around topic X, but I need to find a way to monetize it to pay the monthly costs\", I think it should have been marketed as \"If you have an existing product or service, here is a hosted version that you can pay us to run for you.\" Those entities would be using the platform as a support driver instead of a potential profit source. \n\nI think SO would excel in that sort of situation and SE could be a profitable business model in those situations. And the super-delux package with local hosting of a pre-built machine fits well in that model. Your bigger enterprisey customers (like the government) would have no problem with that huge price point if they could put the box in their datacenters. I think the model was viable.\n\nWhat was broken was the marketing. It should have never been pitched to the SO community as \"Come build a StackOverflow-like site for any topic you want\" \n\nAnd you're absolutely correct that there are better companies providing better software for customer support and things of that nature. But there aren't a lot that work like StackOverflow (excluding all the clones). There were a lot of mistakes made all around, but I still think it's worse for StackExchange, StackOverflow and Fog Creek in the long run to terminate the \"StackExchange\" concept in mid-stride. As I stated before, I have lost some of my trust for them and will be wary of any promises they make in the future."}, {"author_name": "Fredrick Pennachi", "gravatar_hash": "80868923b060c85c9704f2e09fd74bae", "author_url": "http://fredrickpennachi.info", "date": "Apr 15, 2010", "message": "I think I figured out why the new plan feels a bit \"off\".\n\nIt's because the logic is flawed and most of us can intuitively feel that.\n\nThe mission statement is along the lines of making the internet a better place for finding good answers to specific questions.\n\nAnd \"ghost town \" sites detract from the overall quality of answers being returned by searches for specific questions.\n\nAnd multiple sites with the same focus prevent each other from gaining the critical mass of users necessary to inspire experts to participate and create quality answers.\n\nHowever, given that people who like the Q&amp;A model will likely transition to another Q&amp;A platform the only thing that will have changed is that \"ghost town\" sites will no longer be hosted by SO Inc. The internet is not a better place and Google will still return the results it feels are relevant to whatever query.\n\n\nThis is the disconnect that I think some people are feeling."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Apr 15, 2010", "message": "&gt; Can you elaborate? This is hard to respond to.\n\nYeah, I realize my comment was a bit vague. I'll email you a more thoughtful reply in the next few days. I'd really like to see these efforts succeed, but it seems like you're making some missteps."}, {"author_name": "B", "gravatar_hash": "608923fbf1c72405f333c5501b1af1aa", "author_url": null, "date": "Apr 16, 2010", "message": "&gt;&gt; No ownership, no reward/payback, drastically changing environment\n\n&gt; How so? Ownership is assured through cc-wiki, founding member status, \n&gt; beta badges, and election of moderators. Additionally, the community\n&gt; itself will decide what the logo is, what the domain name is, and so forth.\n\nOwnership of domain name (as in whois), ownership over which software to use, ownership over direction of the site, ownership over the decision if the site should live on or not. Badges doesn't really cut it.\n\nCC-licensed data is good, but it only goes so far. If the founding members of one SE site decides that SE no longer is right for their site, their only option is to fork the data and get a new domain name (e.g. therealstackoverflow.com).\n\n&gt; We’ve always said that the goal of these sites is to show off what YOU know,\n&gt; in a public way that benefits you. That’s the reward.\n\nAllow me to quote the afore-linked codinghorror post:\n\n# In essence, any website where user generated content is the website, \n# that is also a for-profit business (not a non-profit organization, \n# ala Wikipedia) -- is effectively turning their users into digital \n# sharecroppers. Digital sharecroppers typically get nothing in return\n# for the content they've provided, and often give up all rights to what\n# they've created.\n\nSure, you can argue that cc-licensed data assures rights to created work. Try to fork Wikipedia and see how that goes. What 'founding members' of SE sites is supposed to create is *not* answers and replies. They are assumed to create a community, and all rights and ownership over that community rests fully with the VC funded Stackoverflow.com LLC."}, {"author_name": "B", "gravatar_hash": "608923fbf1c72405f333c5501b1af1aa", "author_url": null, "date": "Apr 16, 2010", "message": "I think this basics of this idea could work given two conditions:\n\n1. Run by a non-profit.\n2. The rulers of the non-profit (J &amp; J) [ should | must ] not have politburo power.\n\nI always thought that SE-1 was unintuitive, because it encouraged canibalism. The thinking behind SE-2 makes much more sense. But, Imho, it prerequisitises organizational changes that have doesn't seem to have been taken into consideration."}, {"author_name": "Tarek Demiati", "gravatar_hash": "ac4d7d7c9f09a4256242946b98facce6", "author_url": "https://twitter.com/tarekdemiati", "date": "Apr 16, 2010", "message": "Joel : Why would I have to go through the pain of writting a sales pitch for a community site that I will never truely owned and that I can't monetize either"}, {"author_name": "Paul Nathan", "gravatar_hash": "fc3225dc3119500fcbf7af646a83c914", "author_url": null, "date": "Apr 16, 2010", "message": "Ownership implies control. Control/ownership of posts is a very nebulous concept and I have never seen anyone take it seriously. Control means that I can download the SE software and install it onto a local server, for a license fee, and SE, Inc. has nearly nil say about it except for the licensing question.\n\nWhat this move does is shut down various people who were planning to launch a business or extend their business software, based upon prior forward-looking statements and plans made by SE. \n\nFurther, this was an unexpected move, according to the public business communications that transpired. In effect, this yanks the people like Zack who spent a lot of work preparing for launching their SE and monetizing it.\n\nI had considered bringing up a SE for some specialized topics, but had not had the time or expected ROI to do so.\n\nIt's not that, standalone, it's a bad idea, but taken with the history, it is not particularly pleasing. \n\nAt this point, I'd rather bring in an open-source clone and use it for private/local FAQs or monetized sites, because it is evident that I can not 100% depend on SE, Inc. to provide consistent supply and long-term planning for their products.\n\nArguably, like sam said, there just couldn't be enough money coming in for a long time for costs - but as a consumer, that isn't my concern.\n\nOh well.\n\nSO is a great site, and it's great software supporting it."}, {"author_name": "William S", "gravatar_hash": "8b489b4ee39f6c3c53e6219272be26cf", "author_url": null, "date": "Apr 17, 2010", "message": "I'll wait and see how this plays out but let me give a non-programmer perspective.  I've been following SO for awhile because, like everyone else, I admire its Q&amp;A format.  I've worked hard for years to build a very successful site that helps normal people and I've been looking to incorporate a forum.  \n\nNow right off the bat I will say - I am in this to make money.  This is all business to me.  Others may say that they don't do it for the money and they want to build a better internet, but ultimately that is hogwash.  Ultimately, anyone who seriously invests time and money into a website or forum is looking for a return on their investment.  (Just like SO's investors, right?)\n\nAs a site owner with time, money, resources and a successful site to feed into a forum, I just don't feel the need to seek approval through this committee process.  I don't see how the committee will help achieve \"critical mass\" - whatever that is.  Let the market determine which SE sites will be successful.  I'm happy to compete with another SE site on the same topic as mine because I know I will outwork and outspend them.  That's how business works.\n\nThe guys at SO seem smart to me so I'll wait and see.  It's just odd that they pulled the plug after only a few months.  This causes regular business folks like me to wonder whether to invest with their platform or seek out alternatives.  People who are serious about their internet business certainly do the research and will read about this latest plan with skepticism - not just about the plan, but about whether the SO owners are worthy partners.\n\nWell, too late to turnback now SO, I wish you luck."}, {"author_name": "Joel", "gravatar_hash": "ff4fcce308200db766517210582cd6cf", "author_url": "http://bestattendance.com", "date": "Apr 17, 2010", "message": "So they're getting a bunch of VC money with no idea how they'll make a profit.  According to Joel's blog post, \"We believe that if our platform creates value for a large number of users, we will have opportunities to make money.\"  Wow does that sound familiar.\n\nYou know, I had an idea like that once.  It was a jump to conclusions mat.  You see, it would be this mat that had different conclusions written on it that you would jump to."}, {"author_name": "Nick", "gravatar_hash": "fc8d4185fa3b625094482ef462159f57", "author_url": null, "date": "Apr 18, 2010", "message": "I kind of thought that this was inevitable really, so I'm not that surprised.\n\nHowever, I do think that Jeff is being slightly disingenious when he talks about community ownership etc. Yes, the information is indeed generated by the community and, yes, it is published under \"creative commons\" but Stack Overflow LLC is, understandably, looking for the best way to maximise income and SE 1.0 was definitely not it.\n\nThe ironic thing is that Jeff vehemently criticised people like Jason Calacanis of \"digital sharecropping\" and yet I can see little difference in the business model. I'm not complaining - I don't really care and have found this latest episode amusing to observe - but I wish Jeff would tone down his whole \"community love letter\" thing because it's really starting to make me nauseous."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 18, 2010", "message": "+1 for Nick.  i had the same thoughts as you."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 19, 2010", "message": "> vehemently criticised people like Jason Calacanis of “digital sharecropping” and yet I can see little difference in the business model\n\nJust go to mahalo.com and stackoverflow.com to compare -- you honestly see \"little\" difference in these two sites?\n\nI find that difficult to take seriously."}, {"author_name": "Nick", "gravatar_hash": "fc8d4185fa3b625094482ef462159f57", "author_url": null, "date": "Apr 20, 2010", "message": "Hmm, I said \"business model\" not \"sites\".\n\nI have no personal axe to grind other than the fact that I've always found your brand of Community Kool-Aid hard to swallow and I was wondering if recent events have, perhaps, left me in a slightly larger minority than it used to be. I'm not a fan of mahalo.com and never go there; I have listened to the Stack Overflow Podcast from the beginning - I admit that I did particularly enjoy the Jason Calacanis episode - and have dabbled on the site now and then.\n\nI am still genuinely and unrhetorically curious about how you reconcile your strong feelings on \"the community\" and \"digital sharecropping\" (http://www.codinghorror.com/blog/2009/08/are-you-a-digital-sharecropper.html) with your new plans for Q&amp;A world domination?\n\nPS. Nothing personal, Jeff. I wish you and Joel the best of luck in your venture."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 20, 2010", "message": "&gt;&gt;\"ust go to mahalo.com and stackoverflow.com to compare — you honestly see “little” difference in these two sites?\n\nI find that difficult to take seriously.\"\n\nThe visual/surface stuff is not what they/he is talking about.  Are you really not sure what the concern is?  I find that difficult to take seriously.\n\nThe problem appears to be that you've now turned what was a great site into what you have been complaining about and stating contempt for - using other people's labor to make money for yourself.  (or for Joel and the investors anyway)  The 6 steps/iron fist of control on the sites doesn't do much to help the PR either.\n\nMahalo and SE 2.0 share the same business model: Get people to answer each others' questions and the owner of the site(s) make the money (not the people doing the work)  We don't know how we/you'll make money but someday piles of money will come rolling in and in the mean time we will use OPM to fund the operation.\n\nThe only things missing are the Tesla and the bulldogs.  Well, to be fair, you two don't seem to have the unbearable attitude and arrogance of Mr. Calacanis)\n\n(To be clear - Taco is way cooler than a few sloppy bulldogs)"}, {"author_name": "Nick", "gravatar_hash": "fc8d4185fa3b625094482ef462159f57", "author_url": null, "date": "Apr 20, 2010", "message": "Btw, my question \"Is SE 2.0 digital sharecropping?\" on meta.stackexchange.com mysteriously disappeared within minutes yesterday with absolutely no explanation whatsoever? Either there's a bug or it was simply deleted. Assuming that it was the latter, I'd love to know why. As far as I could tell, it wasn't offensive in any way and I felt that it was a legitimate question asked in an appropriate forum, so why wasn't it left to the community to decide its fate? Perhaps I'm seeing a conspiracy where there really is none but that smells a bit like censorship to me."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 21, 2010", "message": "> The problem appears to be that you’ve now turned what was a great site into what you have been complaining about and stating contempt for – using other people’s labor to make money for yourself.\n\nIf you see it that way, you're in the wrong place.\n\nThe point of Stack Overflow (et al) is to get your questions answered, and to \"pay it forward\" by helping others answer their questions, too. It's a virtuous cycle -- and you might even learn something along the way.\n\nParticipating doesn't make Stack Overflow look good -- it makes *YOU* look good. It's part of owning your online presence and leveraging it to get you a better job and higher profile. Everything we do is to support this, including open creative commons licensing of all the contributed content.\n\nI enjoy providing a public commons where people can learn from and help each other, while leaving a trail of nicely archived, infinitely searchable internet breadcrumbs for the next intrepid explorer to follow in their path.\n\nI believe in improving the internet, one tiny slice of effort at a time.\n\nIf you don't believe in that, fine, but like I said -- <i>you're in the wrong place</i>. Perhaps there's somewhere else on the internet that might be more to your liking? Or, maybe you could found a website that does what we do but in a way that is more suited to your particular needs?"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 21, 2010", "message": "&gt;&gt;\"If you don’t believe in that, fine, but like I said — you’re in the wrong place. Perhaps there’s somewhere else on the internet that might be more to your liking? Or, maybe you could found a website that does what we do but in a way that is more suited to your particular needs?\"\n\nJeff, I get it - you want to change the world and make it better.  That is great.  You are missing the other point though.  \n\nI'm not in the wrong place - the place changed drastically.  The place used to be something that attracted (among others) entrepreneurs who wanted to build their own SE site (which was marketed as exactly that) and they could monetize it as they'd like, etc.  \n\nThis new 2.0 with the 6 steps to greatness pulls out the rug and now SE, Inc. owns the direction, site, monetization, etc.  \n\nI really don't care how good I look on the internets.  I spend my time building value and if I can't participate in the upside then I (and others) will pursue other things.  \n\nRegardless of your altruistic goals of making us all look good and saving the internets, your investors are in this for the money.  That means SE and Joel and you are in it for the money.  You have a fiduciary responsibility to them. You HAVE to be in it for the money. The song and dance claiming otherwise holds water no more.  \n\nThis is why the \"digital sharecropping\" has come up - the people who contribute their time, energy and knowledge get nothing while according to the BIG PLAN, the shareholders of SE are going to be making money.  You can't deny that aspect of it and it is disingenuous to keep ignoring that.\n\nI am certainly not trying to take anything away from you guys - congrats on the success and I support your rights to take this in whatever direction you choose.  You guys deserve to make money.  More power to you.  The problem is the discontinuity between the criticism and your answers to those criticisms.  \n\nNot open-sourcing the code, retaining control of the direction of the sites, and keeping the revenue within SE is the point of the criticism.  You may view your actions and goals in a different light than the targets of your sharecropping post, but essentially SE is the same thing: Get people to create content, then make money from that content without sharing it with the creators of the content."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 21, 2010", "message": "> I’m not in the wrong place\n\nYou are in the wrong place; every angry, critical comment (dozens to date, across the last 12 months) you've written here on this blog indicates that. Nothing we do will satisfy you.\n\nHint: you're in the wrong place.\n\n> I really don’t care how good I look on the internets. I spend my time building value and if I can’t participate in the upside then I (and others) will pursue other things.\n\nI encourage you to follow up on this, and find a place where you can be happy and get paid, I guess. Or, you could keep posting criticisms here on every blog post, if that's more enjoyable to you. \n\nThe endless negativity isn't constructive, and starts to be grating and destructive. These are the kinds of things we eventually block people for because they're harming themselves and our community. "}, {"author_name": "Ortzinator", "gravatar_hash": "44770e6f2075241a21ab855de6838108", "author_url": "http://blog.ortz.org", "date": "Apr 22, 2010", "message": "&gt;The problem is the discontinuity between the criticism and your answers to those criticisms. \n\nTim, I think what Jeff is getting at is that the Stack Exchange community is built on a philosophy more than a business model. So any criticisms you have fall on deaf ears because you obviously don't share this philosophy.\n\nIt's like it's the 1960's and you're a Communist living in the U.S. expecting to get taken seriously."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "Apr 22, 2010", "message": "@Ortzinator\n\nI understand what you are saying, however \"...Stack Exchange community is built on a philosophy more than a business model...\" is great - right up until the investors came on board.  (I also presume you intended the irony that I am the communist in your analogy)\n\nI re-read my comments on this post and it appears Jeff is reacting/responding more to my other comments on other topics, not this one.  (He's right - I have been critical of a few issues and policies - in some cases very visibly)\n\nIt is clear from his threat of banning (and his condescension) that he wants me to go away or stop commenting.  I think Jeff misunderstands my criticisms - but you are right that I have some fundamentally different beliefs than he does (on a wide variety of topics).  \n\nI'll respect the request to be quiet and stop rocking the (programming) boat.  \n\nJeff: My intent was not to hurt your community.  Regardless of my intent, you feel my activity does so, or threatens to do so.  I wish you and the SE venture all the best.  Thanks for bringing us SO - it is a pretty helpful little corner of the internets."}, {"author_name": "Jack", "gravatar_hash": "59a1c42c2a0adcac12cc7c5ba1ad1727", "author_url": "http://www.surrealroad.com/features", "date": "Jun 02, 2010", "message": "It seems to me that there's a flaw in the proposed measurement of commitment, namely the assumption that existing stack overflow contributers are more \"valuable\" than new users.\n\nIf I want to start a site about gardening, then surely it is unlikely that the top tier of people answering questions on java/C#/etc are more likely to make that site a success than an avid gardener who had no prior experience of stackoverflow.\n\nThe consequence of this is that its likely that the majority of sites that reach beta would ultimately fit a demographic in accordance with that of stackoverflow-- this one's specifically for Linux, this one's about CODECs and so on; and if that is the case, why bother doing this at all?"}, {"author_name": "Jason", "gravatar_hash": "80745505d3dd9f885ac49b400e183f41", "author_url": null, "date": "Jun 02, 2010", "message": "I think @Jack has a point.\n\nHow will topics that are not interesting to existing members (or don't have enough existing members who are experts) but clearly have a community get through this process?"}, {"author_name": "Joel Box CIO Mondial-IT", "gravatar_hash": "4f787627ec5a14d7b6773cf3ade177c4", "author_url": "http://www.mondial-it.nl", "date": "Jun 03, 2010", "message": "Hum, guys, It seems to me to come from a very negative impression of business owners and CEO's. Many great products and sites are the concerted effort of the people in those companies. Excluding companies from offering great q&amp;a services is, excluding a major part of the web and excluding the drivers with the back-bone to make things successful. \n\nIn my opinion this approach will drive many of us to develop our own \"stack exchanges\", when did creating your own competition become a good business sense?\n\nIn my opinion your original billing-model was the issue. The prices of $270 to $5000 are apparently not inline with the perceived value. I would suggest to fix that instead of \"dropping out\".\n\nWhy not have a look at the business models of Drupal, Joomla and Magento products; great software and with an ever increasing reach.\n\nStack exchange is one of greatest pieces of software, I do hope it will one day available to us all and with great merit for the creators."}, {"author_name": "Joel Box CIO Mondial-IT", "gravatar_hash": "4f787627ec5a14d7b6773cf3ade177c4", "author_url": "http://www.mondial-it.nl", "date": "Jun 03, 2010", "message": "Quote \"Stack Exchange Q&amp;A site only works when it has critical mass: enough people have to go there every hour so that questions get answered. \"\n\nI would work equally well when a few dedicated professionals would bring the answers, think of physicians, product experts, owners, etc.\n\nThe thinking is bit to narrow on the software process, many more questions can be asked not only peer to peer by also novice to assigned peers (to start with)."}, {"author_name": "curious", "gravatar_hash": "247eadef269610825edc3dcb5591bd05", "author_url": null, "date": "Jun 03, 2010", "message": "why not allow both types? SE1.0 and SE2.0?  If I am a product company and I want to have SE application be available for all my clients, where i would answer questions and have others contribute as well, i would pay for it and not spend a year developing it internally."}, {"author_name": "Itay Moav", "gravatar_hash": "ada681281032e89d41010e7533e7fe69", "author_url": "http://phpancake.sourceforge.net", "date": "Jun 04, 2010", "message": "Sounds like toooo much bureaucracy for a site..."}, {"author_name": "Jim Wyllie", "gravatar_hash": "798a3b1c6c01cc07b037c5470312600f", "author_url": null, "date": "Jun 06, 2010", "message": "What I don't really understand with the negative comments: the value of Stack Overflow is the user base.  Forum software is a dime a dozen: anyone can start a community.\n\nIf you don't like the SE model, starting your own SE site with someone else's software isn't difficult at all.  There's very little stopping another piece of run-of-the-mill Web 2.0 forum software, or incorporating large aspects of whatever you like about the trilogy of sites into someone else's software.  That is, of course, if someone else didn't do it yet.\n\nApple tried an all-controlling model for software and deployment (the apps store has a lot of parallels to this) and it seems to have worked out well for them.  And there are always people who buck the control aspect and would rather spend time in a bazaar than a cathedral, regardless of how well-maintained it is.  Ok: go get yourself some bazaar-generated forum software and go to it.  There are merits to both approaches.\n\nPersonally?  I think the creation process is overbearing and I know I wouldn't go through with it.  But I've always been a bazaar kind of guy anyhow :)"}, {"author_name": "Scott", "gravatar_hash": "75f2720fd85b9fb3d1d1d3918a5257de", "author_url": null, "date": "Jun 08, 2010", "message": "Too many rules. The faq is too long.  That alone makes this a barrier to people.  Stop trying to hit this \"change the world and make it better\", using the word \"world\" something like 9 times in this post/faq.\n\nThe community will sort it out. Popular sub exchanges will bubble to the top, less popular ones will not get used and die off.  Reddit has tons of sub reddits that overlap.  The smaller ones just fade away.\n\nThis reduces rules and confusion.  So now we have ask/answers, Mahalo, Wikipedia, and a handful of others, plus all the various stack*'s. It is all too much.  This needs to get simpler, not more complex, which to me, seems just what you are doing.\n\nI have a strong feeling you could see traffic jump by 20% over a months time if you would offer norma logins, and not openid.  The official openid login does not even work reliably, and never remembers me.  Maybe the tech related Stacks know how to use it, but StackCoffeeDrinkers does not.  Registration barriers are the killer of all sites, as you don't know what you are missing, they never get into your site to be part of a metric."}, {"author_name": "Chris Lively", "gravatar_hash": "e2e5ae48ba8cb80b89bbc5fb14c8f8f8", "author_url": "http://www.livelyconsulting.com", "date": "Jun 09, 2010", "message": "Jeff,  \nIf you truly believe in the community should be responsible for picking which exchanges exist, what they look like (logo, design, etc), what the domain name is, etc then maybe you should let the community determine the direction of your company..\n\nWhen the community says \"implement this feature!\" then do it; if the community says \"we think you ought to release this as a private label!\" then do that.  After all, you want others to submit to the community rules.\n\nSo far, you seem to have a split personality on this.  To clarify, you want everyone to be beholden to the desire of the community, except you.  Unfortunately, this won't work long term.  It never has.\n\nThe reality is, that you won't truly let the community go that far.  Instead, you want to maintain control over it's future, guiding it down the paths that you believe it should go.  Personally, I agree with this way of doing things.  \n\nHowever, to then ask others to put the sweat, blood and tears into creating something while turning all control over to you...  Well, that doesn't work.  And drawing comparisons to truly decentralized things is an apples to oranges deal.\n\nGood luck though."}, {"author_name": "Orlando", "gravatar_hash": "0e13f9ad307e2643fdf366db7f356dd6", "author_url": null, "date": "Jun 11, 2010", "message": "Man, I'm super bummed at this change. I've developed a niche application and am in need of a great Q&amp;A framework for support. I'd be happy to pay a reasonable price (along the lines of what forum/community providers like Ning charge.. and in fact am), but i'm not about to gamble that my proposal will be 'accepted' when it's highly unlikely my target audience is currently here."}, {"author_name": "Hostile Fork", "gravatar_hash": "4718212e95d7adea8c412379e7f542e9", "author_url": "http://hostilefork.com", "date": "Jun 12, 2010", "message": "Truly making the Internet better involves decentralizing the system so that each user controls their information and authority network.  This should apply whether someone writes a movie review, posts a cat picture, or participates in programming Q&amp;A.\n\nA Creative Commons license for data is an important piece of the puzzle.  But it's only a piece, and current  technology still has heavy network effects.  For instance - if a policy change makes me decide StackOverflow is not for me, what exactly am I supposed to do with my questions and answers?\n\nMy only choice is an unappealing one: to take a dead snapshot of content--probably without editing history--that is only \"alive\" on StackOverflow.  So having ideas different from the \"community\" (which is actually a \"benevolent dictatorship\") means I'm railroaded into creating another Internet ghost town.  There's no way inherent in the system to reorganize information under another umbrella, yet keep it alive in both places.\n\nWant to make something truly revolutionary?  Show me a working system which can utilize the approval process you describe -but- does not *depend* on it.\n\nRight now you're telling people who object to your plan that StackExchange is \"not for them\".  Instead, you could build technology which gives splinter communities no less ultimate authority than you allow yourself.  That way I can filter to see one point of view or the other... or if I don't feel like taking sides I can see both worlds.\n\n( Think of the difference between Facebook-style hegemony and the recent pitch for Diaspora: http://www.joindiaspora.com/project.html )\n\nEmbrace this idea and be a true pioneer!  Or ignore it and my bet is you'll eventually wind up being... some guy's website.  :)"}, {"author_name": "Stephen Kellett", "gravatar_hash": "88e63373598f22c174053ff0078ab42a", "author_url": "http://www.softwareverify.com", "date": "Jun 14, 2010", "message": "Thats a real shame. \n\nWe were going to try using SE for a community based on our software tools. We liked SO, how it works. Happy to pay for it if it turned out our customers liked using it.\n\nBut we're not happy that this functionality could just be removed with 3 months notice because SO decide they don't want us anymore, rather than us deciding we don't want to pay the bills.\n\nIts a most bizarre business model - actively deleting customers that want to pay. You've got other posters before me saying the same thing.\n\nWe did set the SE site up, but never modified our site to put the links in to take it live. Good job we never got around to it, we'd be about 3 or 4 months in by now if we had and then we'd have to rip the carpet from underneath the community that we had built. Marvellous! Not.\n\nAs a previous poster suggested, you should be offering a dual path option:\na ) Pay if you want to, and get a guaranteed SE that its up to you to run successfully (or not!)\nb) Don't pay, and live by the SO/SE community create/live/die rules.\n\nYou did have (a) but not (b).\nNow you have (b) but not (a) and any previously created under (a) are now effectively in a guillotine wondering if someone will let go of the rope. Nice!"}, {"author_name": "Chris Pall", "gravatar_hash": "7f07010669c0baa7b4ca5198d96fd751", "author_url": null, "date": "Jun 15, 2010", "message": "I'm late to the party but:\n\nThis makes a lot more sense. It seems like in the process of vetting the site, you're going to help potential exchanges through the process of how to make the site successful as well as centralizing the process of creating said websites which will also help them to be successful. It's even better than what I just said, but as someone who created an unsuccessful site (wasn't sure where to go with it) -- I applaud this move."}, {"author_name": "Jason", "gravatar_hash": "2f3802e6f28dae567a87a51fd2c00ad5", "author_url": null, "date": "Jun 15, 2010", "message": "&gt; We’ve always said that the goal of these sites is to show off what YOU know, in a public way that benefits you. That’s the reward.\n\nI love SO. I evangelize the site all the time and would've loved to start an SE site. This Beta was so short though ... I had no idea it even started before it was over.\n\nHowever, while I'm pretty sure I have a really great idea for a SE site, I want to make some money and profit from it in some measurable way. If I just give it to you, you will make money and profit from it.\n\nThat won't cut it. I want a real reward."}, {"author_name": "Wayne Walter", "gravatar_hash": "3c3dea5474696dc4cbc14e06ce255217", "author_url": "http://www.tickzoom.com", "date": "Jun 19, 2010", "message": "The fundamental problem with the announcement above is the people who made the decisions. The list of participants for brainstorming ideas sounded like a lot of non-users.\n\nWhen you want a business to thrive, it must be driven by the desires of users.  The owners, programmers and others succeed or fail based on their skill at translating the requirements of users into cleverly designed software to fill the need.\n\nThis decision was entirely made based on the programmers determining the requirements. In software development, that's equally as bad as the foxes being in the hen-house.\n\nAny decision on the direction of Stack Exchange must include the following:\n\n1. Operators of some of the \"successful\" StackExcchange 1.0 sites. (They must know something useful right?)\n\n2. An invitation should have gone out to highly trusted users of the trilogy who have ideas for additional sites.\n\n3. Some interviewing of many of the \"unsuccessful\" Stack Exchange 1.0 owner would have been good to explore A) where they really unsuccessful? B) why were the owners continuing to pay for a \"unsuccessful\" site?\n\nFrom 3 you would have learned that a lot of people want to use the Stack Exchange software for reason like product support which never compete with your vision of planetary domination and who will never join your effort. Instead they'll spend their money on some other software.\n\nNOTE: You want a revenue stream that grows \"organically\", right?  How could anything be more organic that programmer, like myself using and loving stack overflow and then recommending it to the company we work for as the basis of their own product support.\n\nWhen you have that scenario, then you have full time support people paid to answer questions, then users will get the answers they need.\n\nThose scenarios will never get approved by a committee of already trusted users willing to commit their time.\n\nSo you have walked away from a very real viable revenue stream of easily millions every year.\n\nOh well. We will never consider Stack Exchange for this type of usage now unless you sell the source code because we can never trust an SaaS from you again."}, {"author_name": "Stephen Kellett", "gravatar_hash": "88e63373598f22c174053ff0078ab42a", "author_url": "http://www.softwareverify.com", "date": "Jun 21, 2010", "message": "@Wayne Walter.\n\nYou hit the nail right on the head. Seems like you had the same idea for using Stack Exchange that we did (and others, from reading all the posts). None of these people will now use Stack Exchange.\n\nMy email to the Stack Exchange team on this subject has gone unanswered.\n\nEmail to them during the beta did get answered.\n\nSeems like they don't care about the opinions of those that disagree."}, {"author_name": "ForwardMover", "gravatar_hash": "b55483f342f5e979a4046bf314f22136", "author_url": null, "date": "Jun 29, 2010", "message": "1. Stack Exchange will now be free.\n2. We’re changing the way that new Stack Exchange sites are created to move to a more democratic, community process.\n3. The content of these new, community-created Stack Exchange sites will be publicly owned under a Creative Commons license, instead of being owned by individuals or businesses.\n\nSounds collectivist, no?\n\nBut what part of this is NOT collectivist? Somebody must own something and receive some Usufruct (aka profit) from that ownership, right?"}, {"author_name": "Igor Kryltsov", "gravatar_hash": "7c98619419efb5c12e2799aae5f89d41", "author_url": "http://www.deepshiftlabs.com/dev_blog/?lang=en-us", "date": "Jul 02, 2010", "message": "\"Q: I am interested in creating a private, internal Stack Exchange inside my organization.\n\nWe no longer offer such a product.\"\n\nThis is why I think 10 times before using web service which is locking. Well what you can do with data export file? Create own application and stop developing own application asking your users to wait?\n\nFor private/support sites - http://answers.37signals.com is much safer way - simpler, quicker but 100% own app."}, {"author_name": "Lance May", "gravatar_hash": "75a939b48fe3d6784bbfb6628ca082df", "author_url": "http://www.lancemay.com", "date": "Jul 02, 2010", "message": "Wow. I'm not wanting to fuel the flame(r)s here, nor is this an attempt to get on Jeff's bad side (for not wanting to be smote), but seriously... how many people are looking into clones now? Show of hands? ;)"}, {"author_name": "Ronny", "gravatar_hash": "2f18a281f9f8a30e4c491037d938be5c", "author_url": "http://www.ronnyo.com", "date": "Jul 12, 2010", "message": "OK. Having read all the above:\n- I fully understand the ideas behind this move, and believe the motives behind it are really for the good of everyone.\n- It's never nice to cut existing customers, moreover without a proper notice, but sometimes you have to do that.\n- If you trule believe in what you wrote, close all SO sites so there'll be only one. Most of your current users are both developers, super users, webapps develoeprs etc. so RIGHT NOW we have too much options and the talent gets scattered all around. What do you gain from having different sites - Separate tag clouds? Different Branding? Doesn't worth it if you split the communities. Have one internet-sized community for everything, and find another solution for tagging and branding topic-domains.\n\n- The SE software could be really useful for known reasons. Initially I thought you could offer it only for ethernets, but that's old and everyone wants a web-app these days. But what if you monitor the sites, and in the TOS note that SE sites should never compete with the subjects SO sites cover?\nOnly problem is that limits you to your current topics. Otherwise you could just open a new site and kill current SE sites on that topic, which would be just awful.\n\nI love the SE software, but appreciates your desire to create great communities. Please try to think of a more creative solution to offer both."}, {"author_name": "Vince", "gravatar_hash": "9d4889e5679a5bdc79ec5b950c445142", "author_url": null, "date": "Jul 12, 2010", "message": "If you take a look at stack overflow, it's hardly a place where only highly technical questions exist. It's hard to police quality questions and duplicate information from other sites.\n\nHow does this new platform plan to takle this?"}, {"author_name": "Khalid", "gravatar_hash": "3dd86ffac31f7bdf2addfc497a3ded5e", "author_url": null, "date": "Jul 25, 2010", "message": "What benefits will the owner get?"}, {"author_name": "Andy G.", "gravatar_hash": "c8622088aa8c134f4a3ab8955c05a213", "author_url": null, "date": "Aug 19, 2010", "message": "I have to agree with a many of the critical posters: SE/SO seems to be sidestepping the monetary points on \"ownership\",  and taking a pedantic, high-handed position to boot!\n\nI love StackOverflow.  I can imagine profitable forums using this software interface.  Now, like so many ohers, I must find or build a comparable clone.  Why?  Because if I take the time (with others) to create a community, I feel entitled to help govern that community, and participate in its monetization.  That is ownership from the community-builder's point-of-view, and it is precisely what is being sacrificed and not-talked-about.\n\nAs an aside to Jeff: I find your posts on this blog to be a threatening, offensive and incomplete.  Not only do you pass by a slew of interesting posts to target one critic, but you clearly do so in a bullying manner.  All the while never directly addressing the underlying concern: why castrate the community-builders if not for Joel &amp; Joe's financial concerns?\n\nOh, and before you remind me -- yes, I know, this is no longer a place for me.  I think you might be surprised to find that it quickly becomes \"no longer the place\" for many...."}, {"author_name": "Alacks", "gravatar_hash": "4916626a6ee00771d35dcef8c85d88f8", "author_url": "http://www.wikipedia.com", "date": "Aug 21, 2010", "message": "This is an amazing great effort in the specified field of the desired topic in modern scenario.....\n\nAlacks\n===============================================\n<a href=\"//www.wikipedia.com\\\" rel=\"nofollow\">knowledge</a>"}, {"author_name": "Jamie Folsom", "gravatar_hash": "1d65d62f8f64139829daf2ef3afa4e88", "author_url": "http://newsfromthefuture.org", "date": "Nov 18, 2010", "message": "Why aren't you using stack exchange to figure this out? Seems like a logical choice"}, {"author_name": "antivirus technical support", "gravatar_hash": "0acda523a3781f234b86598ba9bb0d0f", "author_url": "http://suntechville.net", "date": "Feb 22, 2011", "message": "get exclusive technical support for all your computer software related issues like, virus removal ,pc tuneup and optimization,troubleshooting windows errors, setup and installation of any software,slow pc.  <a href=\"http://suntechville.net\" rel=\"nofollow\">computer technical support</a>"}, {"author_name": "Spyware", "gravatar_hash": "baef74edaca7894ed1da15a2d48aa1b1", "author_url": "http://www.spywarenews.org/", "date": "Jun 11, 2011", "message": "Am I too late for the fun?"}, {"author_name": "shekhar", "gravatar_hash": "3b91a74545337d07b504d2abe7432150", "author_url": "http://www.iwillstudy.com", "date": "Oct 12, 2011", "message": "Hey guys after reading your views i fell in another worlds \nheads off to your way of thinking guys\nThnaks"}, {"author_name": "Rubel", "gravatar_hash": "90ca2d8052edeb5722f123e3a191227f", "author_url": "http://www.jwincome.com", "date": "Jul 31, 2012", "message": "Hey I like how simply you explained the process.\nMine was pretty much the same and I can not agree more on following those steps to get more clients.\nI also noticed that sometimes, unless you make it real clear by telling people you are for hire, \nthey may think you just blog for sake of blogging, lol, so any time I would remind my readers \nI provide services it would bring more clients at the same time.<a href=\"http://www.jwincome.com\" rel=\"nofollow\">Income planning</a>"}, {"author_name": "Joel", "gravatar_hash": "3bcc766b6e29e938326edbf4d95b6629", "author_url": "http://supernepal.com", "date": "Sep 11, 2012", "message": "You guys don't do the podcasts anymore?"}, {"author_name": "Evan Carroll", "gravatar_hash": "605442f85418d858e2ce1e1aea2092bb", "author_url": "http://www.evancarroll.com", "date": "Dec 11, 2012", "message": "&gt; Igor Kryltsov\n&gt; Jul 2 2010\n&gt; This is why I think 10 times before using web service which is locking. Well what you can do with data export file? Create own application and stop developing own application asking your users to wait?\n&gt; For private/support sites – http://answers.37signals.com is much safer way – simpler, quicker but 100% own app.\n\nmauahahaha, silly goose they're run by profit-driven capitalists too! Adopting proprietary software, like at large wisdom, is a mistake that teaches only through experience."}]}