{"response": [{"author_name": "Bernhard", "gravatar_hash": "522bfb2b2abb791df510f18dee8f9a9d", "author_url": null, "date": "Apr 29, 2010", "message": "I say no. Reason:\n\n\"separate from the two usual social environments\"\n\nMy third place is somewhere else, separate and unrelated to the parent or meta site. It's Twitter, or my Google home page, or anything \"separate from the two usual\" sites."}, {"author_name": "cori", "gravatar_hash": "a8dfb17f9483b5eb3b489e87578f7bbf", "author_url": "http://kinrowan.net", "date": "Apr 29, 2010", "message": "I think that's a great idea!\n\nI'm a fairly light-weight participant in the sites - i think they are tools made of awesome, but have never really felt the pull of the community that's grown up around them.  I also don't have a lot of ego invested in my rep on any of them.  But for people who do have that investment, the IRC channel (which I have visited a few times) seems like an unfair \"advantage\" with an accompanying technical barrier for many folks.  Putting some of that layer of the  community on the web here it would be more accessible seems like a good deal all around."}, {"author_name": "John Rudy", "gravatar_hash": "32dcb4e95fd5eb20c0f61d1ba3468242", "author_url": "http://flickr.com/photos/johnrudy", "date": "Apr 29, 2010", "message": "Oh God, please, no. This kills off our Meta argument that the Trilogy is not a social network in one fell swoop. If people are interested in chatting and hooking up with one another, they will find ways -- Twitter, IRC, etc. -- without you needing to divert development resources away from the core mission.\n\nOn the other hand, a certain Meta user who's rep chart looks like a cliff would *love* it."}, {"author_name": "Sean Patterson", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://dillieodigital.net/blog", "date": "Apr 29, 2010", "message": "Yes! Yes! Yes! A \"third place\" is definitely needed. I agree that it would only add more value to the community. Ideally you'll find that the guy down voting your answers isn't really a jerk out to get you, and you have a lot in common.\n\nA few random ideas for subdomains off the top of my head:\n\nthirdplace.stackoverflow.com\nsocial.stackoverflow.com - nah, too web 2.0ish\noffline.stackoverflow.com - funny and appropriate\n\nKeep up the great work."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 29, 2010", "message": "Comments are always welcome here, but if you want to discuss this in more specific terms on meta with voting and editing and Markdown so forth:\n\nhttp://meta.stackoverflow.com/questions/48249/web-based-irc-for-the-trilogy"}, {"author_name": "Jonathan Sampson", "gravatar_hash": "3eada417ab749e3a7a5d51d451b2cc3a", "author_url": "http://sampsonresume.com", "date": "Apr 29, 2010", "message": "This is a tough one - a part of me says \"Yeah! Real-time interaction with the community!\" while another says \"A 'third place'? Really? Is this not getting a bit bloated?\"\n\nHave you considered scratching the idea of making this a third place, and instead making it an appendage of the second (meta.foo) place? I'd be curious as to what necessitates the need for a completely new site, rather than adding a \"Chat\" tab to the meta portion.\n\ncaptcha: kidnaped presidency"}, {"author_name": "jake", "gravatar_hash": "87ea936495cdab72ce5965f2dbc7e601", "author_url": null, "date": "Apr 29, 2010", "message": "Chatroom.\nthe word you are looking for is chatroom. besides, we already have twitter. mebbe a place where all the tweets are seen and people can chat (tweet) directly (@) with each other."}, {"author_name": "Sean Patterson", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://dillieodigital.net/blog", "date": "Apr 29, 2010", "message": "oh, and one question... how much of this was motivated from the \"mustache hunters\" converstation you had with Scott Hanselman on Hanselminutes? 8^D"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 29, 2010", "message": "> a part of me says “Yeah! Real-time interaction with the community!” while another says “A ‘third place’? Really? Is this not getting a bit bloated?”\n\nI know some of the moderators have specifically asked for something like this, though -- even just for coordinating moderator duties."}, {"author_name": "Tom Horn", "gravatar_hash": "7bb5f2493a0683f05729bfd93c4c8636", "author_url": "http://www.cannonade.net/bio", "date": "Apr 29, 2010", "message": "Definite yes from me.  There are moments when my enthusiasm for SO runneth over and a healthy environment to vent would be nice.  \n\nAlso ... unicornoverflow.com ..."}, {"author_name": "Innes", "gravatar_hash": "621f8e6cbc704e17eb6680fd99478973", "author_url": null, "date": "Apr 29, 2010", "message": "Hmmm.\n\nWhat about fightcluboverflow.com?"}, {"author_name": "HardwareGuy", "gravatar_hash": "fcfc36d64bd909df102dc91c961554af", "author_url": "http://www.google.com/", "date": "Apr 29, 2010", "message": "And chat.unicornoverflow.com can be phpbb.  Perfect!"}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": "http://echoreply.us/tech/", "date": "Apr 29, 2010", "message": "Jeff, I'd wait until the API is fully cooked. Its relatively easy to implement a nice / ajaxy 'chat 2.0' that is _tailored_ to SE sites, using the API.\n\nIn fact, once baked, don't be surprised if one emerges. I'm working on one, I bet other people are too. \n\nWhen you reach this caliber of programming talent, its just silly not to implement something home grown."}, {"author_name": "Slavo", "gravatar_hash": "528f3acc8d119dcc6c7817deda454251", "author_url": "http://www.slavoingilizov.com", "date": "Apr 29, 2010", "message": "For me it would get bloated even with the second place. Meta for Stackoverflow was about discussing the engine and it worked because the site itself was for programmers who knew how they could build it, or at least give ideas. Now that the engine is mature, no site needs a meta. No unicorn lover would care to talk about the site for unicorns. No musician would care to talk about the site for musicians. Etc.\n\nI might be wrong here, Jeff, but I don't think a non-programmer community can have a StackExchange community as big as Stackoverflow. And don't get me wrong - the value of the second and third sites is there and obvious, I just don't think there's enough of it to drive a whole separate site."}, {"author_name": "dlux", "gravatar_hash": "bf96be7112ca1d4fd622a6fe9e46d298", "author_url": null, "date": "Apr 29, 2010", "message": "An \"off topic\" site is definitely needed if you want to grow a community around the site, because it gives like-minded people a place to talk about unrelated stuff.  Just about every popular online forum has a thriving off-topic section.  If you don't want that content to be on the meta site, then sure, a third location would be needed.\n\nNow...does the SE engine work well for off topic discussion?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 29, 2010", "message": "The feature would behave very similarly (but simplified, of course) to Campfire. Watch the brief video to see what that means.\n\nhttp://campfirenow.com/tour"}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": "http://echoreply.us/tech/", "date": "Apr 29, 2010", "message": "@Slavo - there remains discussion on the community (and commentary on its health as a whole) which really does not belong on the promoted Q&amp;A site. Every topic is going to bring different personalities to the table, which means each community has to decide what is and is not appropriate.\n\nFor instance, code-golf on SO.\n\nHowever, I feel that the 'meta' and 'social' aspects can be combined into one, especially since the API is nearly feature complete."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Apr 29, 2010", "message": "So, only tangentially related--would you require that it be just \"unicornoverflow.com\", and not \"www.unicornoverflow.com\", even if the site creator prefers the www?"}, {"author_name": "Adam Fields", "gravatar_hash": "e80b75dbbfe4c0af7557b22ed1b68de4", "author_url": "http://workstuff.tumblr.com", "date": "Apr 29, 2010", "message": "Now you need a fourth place where you talk about whether it's appropriate to have a third place or not."}, {"author_name": "Casey", "gravatar_hash": "110c3930cadc4091ee35d37dad78539c", "author_url": null, "date": "Apr 29, 2010", "message": "Perhaps heresy, but rather than having separate Q+A structured meta discussion and free form \\chat\\, have you considered *not* using the Stack Overflow engine for meta discussion?"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Apr 29, 2010", "message": "A lot of technical forums have a lounge/take-it-outside/general forum. I think it helps if members can discuss some opinion in an answer without it turning into a comment/voting war in the answer.\n\nBut it needs an engine where replies can have threads - which seems to be against the philosophy of SO, however easy it might be to implement."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 29, 2010", "message": "@mgb the real-time / IRC aspect of this is critical, though, and a key part of what differentiates it as the \"other place\". Not sure that's what I'm hearing from you."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Apr 29, 2010", "message": "No realtime is critical if you want to limit your site to a single timezone.\n\nThe main requirement for a general discussion is for a discussion to branch off into numerous threads. Otherwise once you have three conservations going on at once - either a moderator has to manually split it up, or you need to quote huge chunks of the previous posts to establish where you are.\n\nThe forums at dpreview.com are probably a good model."}, {"author_name": "Paul Nathan", "gravatar_hash": "fc3225dc3119500fcbf7af646a83c914", "author_url": null, "date": "Apr 29, 2010", "message": "I know. phpBB.unicornoverflow.com! \n\n:-)\n\nBut, seriously, the Third Place for SOFU exists. It just isn't formalized and sealed with the top-level approval. \n\nI have serious qualms about official IRC style chat-channels where there isn't a 24/7 moderator to keep jerkfaces banned. Bullys happen. Further, it's remarkably hard to maintain more than 2 threads of conversation in a real-time chat. Abstractly, forums are great for that. phpBB isn't all that, but it's a great advantage over the old hand-rolled forum software that didn't bubble new threads to the top of the page.\n\nSo ... maybe the SO team can come up with UnicornBB that is awesome?"}, {"author_name": "Tilendor", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": null, "date": "Apr 29, 2010", "message": "A) I dunno if a third domain is warranted.  This seems to be a piece of meta.  I second the vote just to add another tab to meta.\n\nB) Communities need somewhere to socialize outside of the rules.  Wikipedia has talk pages, many many forums have off topic groups, I totally agree that meta(+?) is needed.\n\nC) When I read about this third place, I immediately thought you were going to say careers.unicornoverflow.com.  Would that be part of the service and business model?  What if thats a criteria for starting a site?  That people could get jobs related to the Q&amp;A theme in question."}, {"author_name": "Kev", "gravatar_hash": "a9840656ceee0faa528806c4c04a9399", "author_url": null, "date": "Apr 29, 2010", "message": "I think this is an interesting idea and I think you should suck it and see. If it adversely affects the quality of the current meta then you can always turn it off.\n\nRun it as a beta with the caveat that if it turns sour then you hit the kill switch. Nothing ventured, nothing gained."}, {"author_name": "Craig S Walker", "gravatar_hash": "422cf4dc76e15f9e64ccb5145deb57a4", "author_url": "http://softcraft.ca", "date": "Apr 29, 2010", "message": "So my initial answer would be \"no\". At least, it doesn't seem to be solving a problem that I experience.\n\nOTOH, during the last podcast, you were talking about how SO was \"a place to get answers\" and there were other places to \"talk and meet new friends\". Before SO/SE these were integrated (example being the NZ .NET users' group). SO/SE came along as a way to improve the \"getting answers\" part, leaving the \"discussion\" part a bit out in the cold.\n\nMy immediate thought when listening to this was \"well, if SO built the discussion part, then they'd have the perfect system.\"\n\nWhich is, of course, what you're proposing here.\n\nThe only caveat: maybe SO shouldn't be the ones \"monopolizing\" this aspect of the community, and leave it for others to concentrate on. But IMO we could do a lot worse than the SO team applying themselves to this problem too."}, {"author_name": "giles", "gravatar_hash": "6224fdfd2e9ed2462baf7e5844bbd7c7", "author_url": null, "date": "Apr 29, 2010", "message": "good idea, no harm in having a third place. If it doesn't get used for particular sites, switch it off for those.\n\nI would call them either\n\nhome.unicornoverflow.com\nsocial.unicornoverflow.com\n\nI can imagine that only the very large sites would require them though. Perhaps only activate the third place when a site reaches a certain critical mass to avoid dead locations. When the meta site starts generating a certain volume."}, {"author_name": "Will", "gravatar_hash": "b32a129ace0693b2455d0ffc43e4235d", "author_url": "http://statestreetgang.net", "date": "Apr 29, 2010", "message": "I always thought \"OffTopic\" or an even shorter \"OT\" would be awesome great.\n\nRelated:\nhttp://meta.stackoverflow.com/questions/798/can-we-ask-stupid-questions-here-or-give-stupid-answers-closed"}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": "http://stackoverflow.com/users/20654/oscar-reyes", "date": "Apr 29, 2010", "message": "Hey Jeff, why don't just use e-mail instead!!! LOL"}, {"author_name": "Jonathon Watney", "gravatar_hash": "0f0f5d11143921e700f2d98a2a7850cb", "author_url": null, "date": "Apr 29, 2010", "message": "Hmm, this seems awfully similar to this unpopular idea: \n\nhttp://meta.stackoverflow.com/questions/38315/partner-with-traditional-forums-to-support-open-ended-discussions\n\nAt least if Stack Overflow partnered with an existing site or used existing software new software wouldn't have to be written.\n\nThe \"third\" place sounds like a good idea but I've always thought the third place developed organically. People tend to gravitate to what they know (Twitter, forums, IRC, etc). Stack Overflow integration with those third places sounds like it would be lower risk and less work for staging this idea."}, {"author_name": "Brad Gilbert", "gravatar_hash": "6a81b9b2f0280da70b19d2dddcd8dc03", "author_url": "http://b2gills.blogspot.com", "date": "Apr 29, 2010", "message": "I would consider StackOverflow.com as the work space, and Meta.StackOverflow.com as \"Home\" where you go to unwind after a long day."}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Apr 29, 2010", "message": "Yes.\n\nA big reason why people have hobbies and interests is to find like-minded folks who become friends. I know many/most of my friends have come from pursuit of similar interests.\n\nKeep in mind that doing this right is potentially a harder problem than creating a high-quality, self-sustaining Q&amp;A site on a particular topic."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "Apr 29, 2010", "message": "I'm just waiting on the fourth place: dating.stackoverflow.com"}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Apr 29, 2010", "message": "First of all, thankyou Jeff for being open-minded about this. \n\nI've been banging on about Stackoverflow for a while now being an 'anti-community' (a term I described in a comment on Scott Hanselman's blog). I think Stackoverflow functions despite this because of the sheer number of people involved who are not only interested in programming, but have a real need to trade knowlege.\n\nI think the 'third place' is totally necessary for Stack Exchange 2.0 because of the more niche subject areas you'll be going into and the fact that many other subjects are more about discussion than facts.\n\nI'm not so massively behind it for Stackoverflow itself. However, I can only so upsides, even if they aren't as huge. It means you can eliminate off-topic posts about unicorns from meta without seeming like a killjoy for starters :)\n\nIf people don't want to chat, if it's done right, there's zero impact on the main site."}, {"author_name": "rbp", "gravatar_hash": "3d8c280edaafd988742f45e81f89d24a", "author_url": "http://isnomore.net", "date": "Apr 29, 2010", "message": "bar.unicornoverflow.com :)"}, {"author_name": "http://photographr.info", "gravatar_hash": "dd6c985d22e3bf6ea849e8d2e6750d76", "author_url": "http://photographr.info", "date": "Apr 29, 2010", "message": "A 3rd place would be good, I'd toyed with a few ideas for this on the http://photographr.info SE site, and while it didn't eventuate due to other priorities, I could still see a need for it.  After all, not everything is questions and answers.\n\nAn alternative might be to introduce a \"banter\" tag or question type (similar to marking something community wiki) that gives a \"question\" different behaviour, and can be hidden/ignored by those who aren't interested.  I don't think this works as well as the campfire approach though."}, {"author_name": "J. Pablo Fernández", "gravatar_hash": "931970b8dc51b72e05e3a12b88612d61", "author_url": "http://pupeno.com", "date": "Apr 30, 2010", "message": "Yes."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "May 01, 2010", "message": "First, for the naming, I'd call it social.stackoverflow.com rather than \"chat\"\n\nbut no, I don't think it's needed or desirable. One of the best qualities of SO, in my opinion, is that it's not a \"community\" in the usual web community sense. There aren't cliques or ruling elites or people talking behinds each others backs, or any of the other social cruft that comes with communities.\nThere aren't groups of friends who *always* come to each others aid in comment discussions.\n\nStackOverflow is a strictly businesslike phenomenon. I don't go there to talk to my pals, I go there to ask and answer programming questions. And while I have gotten to know a number of people in this way, it's happened by noticing their answers, checking their profile, and from there, finding a link to a blog or twitter profile, not by chatting to them about our hobbies.\n\nOne of the things that makes the site so approachable is that it's not a tight-knit group of friends. You don't feel like a newcomer or intruder when you sign up, because there never was any chat/getting to know each others/socializing going on that you could have missed out on. If you introduce a social dimension, you're effectively creating another aspect for us to keep up with if we want to stay in the loop. Suddenly it's not just about what amazing answer Jon Skeet wrote yesterday, but also what he wrote in thread X on the social subsite.\n\nThe last thing I want to see is SO become fully self-sufficient. I don't want it to become a bubble world completely isolated from the rest of the internet. I think it's better to openly say \"if you want to chat to your pals, take it to Twitter or Facebook or a forum or IRC or whatever else you can think of\".\n\nI think such a social subsite is at best unnecessary, and at worst, counterproductive and harmful.\n\nIt might work for individual SE sites, but I'm not sure, and it'd have to be enabled on a per-site basis.\n\nThe meta site was different because it served a need that could not be fulfilled elsewhere. We had nowhere to ask what the official rules of participating on SO are, or discuss whether those rules are ideal.\n\nThe internet is full of excellent places to chat, send messages and cute pictures of kittens."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "May 01, 2010", "message": "If the moderators need somewhere to coordinate their efforts, or your two dev teams need the same, that's a problem that has to be solved, but I'm not sure a general-purpose social dimension to SO/SE is the best idea.\n\nI don't think us normal users would benefit from having a place to kick back together and chat."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 02, 2010", "message": "> I don’t think us normal users would benefit from having a place to kick back together and chat.\n\nJalf, I don't necessarily disagree with anything you said.\n\nAnd yet.. and yet.. \n\n.. there are some AMAZING programmers on Stack Overflow, people I *deeply* respect, and I would love the chance to 'meet' them in a less formal realtime chat like environment. For a variety of reasons."}, {"author_name": "Matt", "gravatar_hash": "fa2c3cc712e8f9a60f2369f842216e06", "author_url": null, "date": "May 02, 2010", "message": "I don't understand why we'd need a chat.  Why not instead include a blog."}, {"author_name": "Scott", "gravatar_hash": "629cfe92c00bcb6a8cb13834a3b23e17", "author_url": "http://reusablecode.blogspot.com", "date": "May 02, 2010", "message": "I continue to be amazed that people are still using IRC. What makes the Internet great is the fact that its stateless. You can do something, come back later, and see what you missed. The only way to get this experience on IRC is to be constantly lurking. (And of course most IRC chatter is useless as opposed to useful.)\n\nIf you're going to go through with it, I suggest calling it noise.stackoverflow.com"}, {"author_name": "Martijn Laarman", "gravatar_hash": "05dfef403d6eae502a63616b800910af", "author_url": null, "date": "May 03, 2010", "message": "Didn't spolsky state:\n\nIf it's a core business function -- do it yourself, no matter what.\n\nhttp://www.joelonsoftware.com/articles/fog0000000007.html\n\nThe opposite should thus also be true. A more social aspect to SO would be great but to get in touch with someone on SO usually means see if they have a website and see from there. \n\nSo maybe it would be more mutually beneficial to allow for more \"get in touch with me\" meta data on the profile. \n\nMaybe even implement private messages as a feature for people with more then a certain level of points.\n\nBoth would feel a lot more integrated."}, {"author_name": "Tony", "gravatar_hash": "886427a445a180eb6618d77ee4ec4894", "author_url": null, "date": "May 03, 2010", "message": "Yes go for it. I have advocated for such a less formal cut and dry place to have some informal discussions around the questions. Meet people and get friendly.\n\n\nIt's purely optional so anyone who doesn't like the idea, simply just don't go there!"}, {"author_name": "Gareth", "gravatar_hash": "b5343f584b0e77db2361e3d2f66bd2e8", "author_url": "http://waves.ky", "date": "May 04, 2010", "message": "collab.unicornoverflow.com \n\n* Allow users to form groups not naturally arising from the main site (say friends from work, user group, project maintainers etc.)\n* Chat/'Wall'\n* Allow for meta discussion about questions amongst the group. Group members can see the discussion either on the main site or on the collab site.\n* Allow the group to designate questions they want to watch collectively.\n* Allow the groups or individuals to designate tags/searches they want to monitor.\n* Maybe allow team members to answer questions from a team account? (team reputation is implied here, maybe multiple people contribute to the answer)"}, {"author_name": "Kathy Sierra", "gravatar_hash": "817266e3cef23a3bf8df470e5634eab9", "author_url": null, "date": "May 04, 2010", "message": "My husband and I are still arguing over this one (he says 'yes', I lean toward 'no'), but in the end, we both did agree that if the site/community is working for people, then at least *some* version of an OT space is probably good for sustainability. Nobody has to go there, but it's meaningful for those who do. \n\nThis need not be (and in my opinion SHOULD not be) a \"social network\" or even a lightweight version of one. It is simply the OT space. And OT != \"anything goes\" or \"free for all.\"\n\nMy biggest concern for OTish spaces in a pure-tech environment, though, are that they can so easily deteriorate in unimaginable ways. (At least unimaginable for many geeks.) I think both Jimmy Wales and Craig Newmark once agreed that if you think *political* topics are emotionally charged, that's NOTHING compared to the discussions on... *pets*.\n\nSo, you know, moderation and clear cultural standards, etc.\n\nAnd by the way, when it's time for horseoverflow, I'm so there."}, {"author_name": "Evan", "gravatar_hash": "9798931483c6fe5af55ec68698ffd0a0", "author_url": null, "date": "May 09, 2010", "message": "How about chatroulette.unicornoverflow.com\n\nThen you'd have the largest online chat sausagefest with nothing but old hairy guys showing their members... :)\n\nIn all seriousness. Live chat isn't needed for answer threads because the inline comment system accomplishes the revision process well enough as is.\n\nJeff, if you're looking for a medium to connect with other developers. Add social identities to the user profile section to open up lines of communication.\n\nJust plug in the twitter API. Displaying user's full twitter feed might add a lot of unnecessary fluff. So it would be beneficial to look into tweet filtering. I know it can be done already, I just don't think anybody has done it well yet.\n\nThink along the lines of how people filter gmail messages username+filter@gmail.com. I don't know if it would be possible to do the same in twitter.\n\nIt seems ridiculous that people attach all unrelated streams to one identity without filtering. In the 'real world' we naturally live multi-faceted lives and compartmentalize domain specific details automatically. I'd call this the #1 reason Web 2.0 is still socially retarded.\n\nWhatever you do, don't clone twitter. That would defeat the purpose of shared identities (and the reasons why you guys use OpenID as the main ACL mechanism in SO).\n\nIf you want general chatrooms, just create some IRC channels. I know most *doze devs don't understand IRC and that sucks. But the risks (wasted time) of writing a chat platform outweight the benifits (free mature and easily deployable) of using IRC.\n\nI know Joel and Jeff are MS fanbois to the extreme so please, no derisive snorts. Seriously though, use IRC or reinvent the wheel at your VC's expense."}, {"author_name": "mohammad al-rawabdeh", "gravatar_hash": "f7bff1b875d857b1a8825b5cbffb6921", "author_url": null, "date": "Sep 11, 2010", "message": "yes"}, {"author_name": "Peter", "gravatar_hash": "cc4351cf93e1da88941a1bf244d14a4c", "author_url": null, "date": "Sep 16, 2010", "message": "Completely unnecessary. If you want to meet outside of the Q&amp;A area go outside. You can help with going outside by providing doors (social identities on other platforms), like msn, twitter, facebook, youtube accounts.\n\nDo what you can do best, and that is the Q/A platform. Leave the other fields for people who know it better. If you start discussing questions in a social forum, the answer might never be document on the question and is not easily reachable by the standard user. Even if you link the question directly to the \"offline\" discussion (and save the discussion for later use) you might not find the info you need in all those comments left there.\n\nIf I want to meet with my colleagues after work we go to a bar and not to the company cafeteria."}, {"author_name": "ig", "gravatar_hash": "807d13e9795fc57b752fd38845650134", "author_url": null, "date": "Sep 17, 2010", "message": "Could you please add a close button for the yellow notification bar? It's really distracting, especially because it looks very similar to the \"new activity\" notification bar.\n\nThank you."}, {"author_name": "Adkins", "gravatar_hash": "1eb55b1e4047e4f407f79e4570590155", "author_url": "http://www.adkins-software.com", "date": "Oct 22, 2010", "message": "I say the third place is actually a really good idea.  However the name chat is just not doing it for me.  Why not keep with this \"third place\" idea and just give it the domain of http://third.unicornoverflow.com ?"}, {"author_name": "Wim ten Brink", "gravatar_hash": "ef98abf337028364146aa99b39c25a8a", "author_url": "http://workshopalex.deviantart.com/", "date": "Oct 22, 2010", "message": "Not chat.stackoverflow.com but like this page, **blog**.stackoverflow.com ;-)\n\nThe generic site would be for questions and answers. The meta site would be for discussions about those Q&amp;A's. The blog site would be for anyone with over 5000 points (because I don't have 10.000 yet!) to just post some interesting stories that could be useful for others with additional space below it for others to add comments. Thus, someone could create a blog entry about the use of record types within class types in Delphi and it's practical use, if combined with record methods. :-)\nBasically, the blog would allow people to share (technical) knowledge without anyone else asking for it.\n\nBut then there's the issue of points. If we have a generic, meta and blog site, we should not have points for each site separately! They should be combined in a single pool, thus someone who helps a lot at meta would also be able to moderate on the generic page.\n\nAnyway, the third page should not be for short chats, but for longer blog items that share some really practical information."}, {"author_name": "Wim ten Brink", "gravatar_hash": "ef98abf337028364146aa99b39c25a8a", "author_url": "http://workshopalex.deviantart.com/", "date": "Oct 22, 2010", "message": "Btw, congratulations to Origin Interactive Media for registering the domain unicornoverflow.com this fast."}, {"author_name": "Flavius", "gravatar_hash": "147005ecf961e5ce27569897fc06d0a0", "author_url": "http://yet-another-project.com", "date": "Oct 22, 2010", "message": "Broken links: unicornoverflow.com, meta.unicornoverflow.com\n\nPlease fix them or use the RFC-compliant example.com/example.org."}, {"author_name": "BrunoLM", "gravatar_hash": "ef1a0f00d57917768acdc5b379ca1b28", "author_url": "http://stackoverflow.com", "date": "Oct 22, 2010", "message": "It would be hilarious if `unicornoverflow.com` and `meta.unicornoverflow.com` were redirects.\n\nThe word `chat` is fine if it's a chat. If it's a place to discuss about the site in real-time I guess the word `chat` should go away entirely. I can't think of a name for it right now..."}, {"author_name": "Margus", "gravatar_hash": "dcf61c8c44424e96b2bf831d78aa1774", "author_url": null, "date": "Oct 22, 2010", "message": "Is it only me or it seems like strip-down version of Google Wave. Anyway I think it is American way of thinking, that more choice is better (And people who think differently do not have to use it)."}, {"author_name": "Rocket", "gravatar_hash": "31975d063f893b2551f6f7d5ed6bfa8e", "author_url": "http:/NTICompassInc.com", "date": "Oct 25, 2010", "message": "Why isn't http://unicornoverflow.com a site?"}, {"author_name": "Ken", "gravatar_hash": "97d540da0aee796ba07e9420099552b4", "author_url": null, "date": "Oct 25, 2010", "message": "If this might help get subjective, code-golf, and interview-questions off of SO proper, then I'm all for it!"}, {"author_name": "webbiedave", "gravatar_hash": "592fdcbe9cb4cd1be95b1ce33e8c3717", "author_url": null, "date": "Oct 25, 2010", "message": "If we have this, we definitely shouldn't call it \"chat\" as people will just use it to get realtime chat support on their programming issues (which is exactly what's happening now in many rooms).\n\nI think the sub-domain should be more indicative of it's purpose, like \"social\" or even something more obscure like \"fire\" so that it's something that will be eventually stumbled upon by folks. Who wants their free-of-charge third place to have a giant neon sign pointing to it? It gets too loud and people move on. Just a thought."}, {"author_name": "Annonymous", "gravatar_hash": "c5ff48ef0d61d01e9eb039ca0ac91859", "author_url": null, "date": "Oct 25, 2010", "message": "\"we definitely shouldn’t call it “chat” as people will just use \"\n\nLol looks like Jeff Atwood doesn't believe in consentual solutions"}, {"author_name": "Tim", "gravatar_hash": "a3d300de0ad63d1e44197164a0b265c9", "author_url": null, "date": "Oct 25, 2010", "message": "How about the word \"community\"?  It is more generic than \"chat\", which is good if you want to do things other than chat, and it implies a social-networking kind of vibe."}, {"author_name": "Thomas Kammeyer", "gravatar_hash": "85a596d14be45608c2370c3d8867f261", "author_url": null, "date": "Oct 25, 2010", "message": "I think the idea is a bit off base, but understandable in these days of \"reality television\".  That's what this idea is like:  third places happen naturally from a need... you can't just make one.  It negates their effectiveness.  \"making a third place\" is, to me, oxymoronic, just like \"reality TV\"."}, {"author_name": "Michele Costabile", "gravatar_hash": "ee5652e43abb257959dc1ea418150088", "author_url": null, "date": "Oct 25, 2010", "message": "I see that after five posts you proposed to bring the discussion to meta, with good reason.\nI guess the same thing would happen a lot on a pseudo IRC channel.\nIt would also be great to be able to ask clarifications to someone in real time, like \"what did you mean with incrementing the pointer?\".\nBut then the answer would be lost in the primary assets in stackoverflow.\nI think a good solution could be a private chat button, fired by, say, a green ball near somebody's name. You read an answer, something is unclear, you ask the guy in real time.\nI cannot see a lot of other use cases in which I would need fast interaction with someone."}, {"author_name": "magallanes", "gravatar_hash": "780572ac3c178eabe2be5a41f05a5c48", "author_url": "http://www.southprojects.com", "date": "Oct 25, 2010", "message": "if redundant then discard.\nnuff said."}, {"author_name": "Anon", "gravatar_hash": "c510febb9bed68b5cc4a09f076701e0f", "author_url": null, "date": "Oct 27, 2010", "message": "I think a system to send messages can be useful, not necessarily chatting, but a more private environment for communicating. Also having a forum for less formal questions and discussions (which are forbidden in the main site) is going to be more useful."}]}