{"response": [{"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "Apr 24, 2010", "message": "Second!\n\nDO'h!"}, {"author_name": "Frank Krueger", "gravatar_hash": "3eef89c1710742937cc74bf88da9dff8", "author_url": null, "date": "Apr 24, 2010", "message": "This was a very entertaining episode.\n\nListen, if for nothing else, to Scott begging Jeff to understand that a UI that works for programmers may not work for SE2.0's world domination plans.\n\n(I wish I had the clip of Joel's earlier remark on the SO podcast \"Oh no, you're not going to talk about that Zen garden thing!\")\n\nAll very good. It came very close to making me believe that this new scheme isn't as crazy as it sounds."}, {"author_name": "Michael Pryor", "gravatar_hash": "83678606ffe33ee7c1fb50b97338daed", "author_url": "http://stackoverflow.com", "date": "Apr 24, 2010", "message": "I await the onslaught from the fresh water aquarium enthusiasts."}, {"author_name": "Scott W.", "gravatar_hash": "7a03f436e9458527368e5eaa45f85d40", "author_url": "http://moms4mom.com/", "date": "Apr 24, 2010", "message": "I think we're all interested in seeing how SE 2.0 turns out, and it certainly makes some sense to get people who are familiar with the platform *and* interested in the next topic to be the ones to start the next site.  Starting a site without anyone who knew how to use the platform would be really hard."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 24, 2010", "message": ">  a UI that works for programmers may not work for SE2.0’s world domination plans\n\nI personally think the average UI for phpBB is *incredibly* dense and complex.\n\nAlso, the fixation on the front page is a bit strange if you consider that any real user will start on a question page (from a web search) and spend most of their time on question pages.\n\nKind of a red herring overall."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "Apr 24, 2010", "message": "@Jeff: I'm not necessarily disagreeing or saying that the front page is too busy, but one thing to bear in mind is that two other factors can easily lead people to a front page:\n\n- Word of mouth: \"Have you tried site xyz? It's great!\" Imagine you're in an existing community which might want to look at a Stack Exchange site - would you mention the site in general, or a particular question?\n\n- Memory: suppose you first visit a site by way of a question someone else has asked... then you want to ask your own question, or see what else is there. You don't have a bookmark yet to go to the \"Questions\" view or something like that... so you're likely to just type in the site name. Even if the *very first* visit is to a particular question, the *next* visit may well not be."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 24, 2010", "message": "See:\n\nhttp://meta.stackoverflow.com/questions/47762/is-the-stack-overflow-homepage-too-confusing-or-too-complicated\n\nReader's digest version -- view this screenshot and tell me which one you think is too hard for \"normals\".\n\nhttp://img682.imageshack.us/img682/8304/homepagesvbulletinvssta.png"}, {"author_name": "Pekka", "gravatar_hash": "628d6cb4c2ad9d7b38a62f76a3bb7651", "author_url": null, "date": "Apr 24, 2010", "message": "I don't think the idea of keeping discussion and social networking (largely) out of the picture is typical of *programmers*. It is typical of *professionals*, and as such, it's in sync with the stated goals of the project. I bet Jeff's Dad and his pals would be all over a site that gives quality answers on bowmaking, regardless whether it provides an opportunity to \"hang out\" or not, as long as it is the best place to get answers on bowmaking.  \n\nAlso, the idea that a phpBB site is easier to understand for a newbie is *ridiculous*. I use some phpBB sites from time to time and I am relieved! when I'm done and can go back to SO, head hurting from  tons of unnecessary, cluttery bells and whistles. I find it hard to believe that people like Scott’s Dad (or my Mum, for that matter) will have less trouble using SO’s straightforward design than a phpBB page.\n\nI'm still not sold on the business principle of SE 2.0 as a whole, though. Of course money is not the glue that brings people together. But money is the grease that makes people willing to do the more tedious tasks that running a community entails. The shit jobs. The new model sees the community do those jobs - and the whole process of hatching, nurturing and growing a new community, and the painful cutting off of failed ones - for free, while SE keeps the thumb on the ultimate decision what is going to be monetized when and how."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 24, 2010", "message": "> But money is the grease that makes people willing to do the more tedious tasks that running a community entails. The shit jobs\n\nThere are no \"shit jobs\" on Stack Overflow. There's only tiny slices of minor effort contributed by everyone. \n\nIf you see a piece of trash, pick it up and throw it away. If enough citizens do that just once per day -- and we try mightily to make it as easy and effortless as possible -- the whole city stays clean.\n\nNo need to hire a janitorial staff. I do my small part, and so do thousands of others. "}, {"author_name": "Pekka", "gravatar_hash": "628d6cb4c2ad9d7b38a62f76a3bb7651", "author_url": null, "date": "Apr 24, 2010", "message": "&gt; There are no “shit jobs” on Stack Overflow. There’s only tiny slices of minor effort contributed by everyone. \n\nand it works well, I know. Building a new community from scratch is a different beast, though, in my opinion. Unlike you, I have little practical experience in it but I expect it will take more effort that just picking up some litter, done by a core of dedicated people. In SE1.0, the deal was that those dedicated people took the risk of building the community, chipped in some money to prove it, and had a shot at making (some) money from it in return. This is now gone, and the only people with a shot to make money from it are now you. I just think that if the kind of SO community support that is now planned for SE, commitments and all, would have been added to the SE1.0 recipe, it would have worked, and worked in a way I personally would have liked much better, and felt better contributing to. \n\nAnyway, it's a ballsy decision, maybe the majority of people is fine with the approach, and we will see anyway. There is also the up side that this way, communities might come up specific and important to regions where $129 a month is a salary. (Please tell me SE2.0 is not going to be english only!)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 25, 2010", "message": ">  I just think that if the kind of SO community support that is now planned for SE, commitments and all, would have been added to the SE1.0 recipe, it would have worked, and worked in a way I personally would have liked much better, and felt better contributing to.\n\nImpossible. Matter and anti-matter.\n\nI don't care if you want to pay me $129 per month. Money isn't an effective way to build a community. I'd argue introducing money is actually more *dangerous* to a community than anything else.\n\nWhat is meaningful, and what I *do* care about, is that you can convince me that you LOVE the topic, and that together we can build a community of others who also love the topic. \n\nhttp://www.codinghorror.com/blog/2008/05/its-clay-shirkys-internet-we-just-live-in-it.html\n\n\"In the past, we could do little things for love, but big things, big things required money. Now, we can do big things for love.\""}, {"author_name": "Pekka", "gravatar_hash": "628d6cb4c2ad9d7b38a62f76a3bb7651", "author_url": null, "date": "Apr 25, 2010", "message": "Jeff - hmm. But wouldn't the spirit of what you are saying be most accurately reflected by a Wikipedia style Non-Profit?"}, {"author_name": "Kevin M", "gravatar_hash": "f5947f1a32e8002f02ae53b98a09faf3", "author_url": null, "date": "Apr 25, 2010", "message": "Keeping the can of worms open for the moment, comparing the typical phpbb's starting page with SO's is missing the point when considering taking SO to the world of everyday Internet users.\n\nBOTH page layouts make the same assumption about the visitor: that they already understand how the application works.  And sadly, nothing could be further from the truth once you outside the \"technical\" community.\n\nWhile Jeff makes a great point about the high proportion of visitors accessing the site from a search engine and thus \"entering\" on rather deeply positioned page, that does not address the use case of a site visitor needing to know \"what is this site I've found and how does it work\".\n\nThe point is we can anticipate a site visitor asking this no matter how they encountered the site.  The current design does not address this case as well as it could.\n\nFurther, will other communities actually be different that SO's traditional communities?\n\nI think so, absolutely.  As was discovered during the search for SF moderators, (and as Jeff has pointed out out many times on the podcast 1.0) communities exhibit subtle differences that can really matter, and small UI changes can make a seemingly disproportional difference - good and bad.\n\nFortunately, simple and basic UI/UX principles can help sort all this out. Test designs on real candidate users, perform A/B testing, etc.  Move the issue with a design out of \"opinion/debate\" arena and into the domain of actual user behavior.\n\nAnd by all means keep pursuing the goal of 2.0; it's worth it!"}, {"author_name": "Pekka", "gravatar_hash": "628d6cb4c2ad9d7b38a62f76a3bb7651", "author_url": null, "date": "Apr 26, 2010", "message": "To elaborate on my Non-Profit comment above. I can totally understand somebody having invested years of time and probably also lots of money into a product, not wanting to turn that product into a nonprofit. There is certainly no moral obligation to do so, and I'm sure being a nonprofit comes with bureaucratic shackles that limit flexibility in some business decisions. I think you have done outstanding work with Stack Overflow, I admire the integrity with which it is run, and you deserve to make lots of money out of it. But this specific SE2.0 idea would feel much, much more right to me if it had a clear definition of the financial side that values the great effort some core people are going to be putting into building those communities. A nonprofit would be the perfect way to do that in my opinion.\n\nAnyway, no matter which way it goes, I'm very interested to see how all this works out."}, {"author_name": "Pekka", "gravatar_hash": "628d6cb4c2ad9d7b38a62f76a3bb7651", "author_url": null, "date": "Apr 26, 2010", "message": "And as for the interface, I totally agree with Kevin. When you're building a site for bow hunting, then fetch Scott's dad, sit him down in front of a computer and watch him closely while using it! An afternoon of doing that will probably show what needs to be changed to make a bow hunting SE site work."}, {"author_name": "Roger Barnes", "gravatar_hash": "dd6c985d22e3bf6ea849e8d2e6750d76", "author_url": "http://photographr.info", "date": "Apr 27, 2010", "message": "@Jeff, to be honest, I find the vBulletin grouping of topics to be far more approachable, compared to a list of the most recent questions.\n\nTo that end, I think SO/SE etc could do well to make the most popular tags more of a priority than recent questions, perhaps by using the most common tags to group the most recent questions (in a forum style way of grouping threads into topics).\n\nThe rest of the site wouldn't have to work any differently.  For example, my http://photographr.info site might group the latest questions into \"gear\", \"technique\", \"lens\", \"software\" and possibly \"other\" to catch the rest that don't have a popular tag."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 30, 2010", "message": "@Roger see Matt's mockup. It's interesting\n\nhttp://meta.stackoverflow.com/questions/47762/is-the-stack-overflow-homepage-too-confusing-or-too-complicated/48074#48074"}, {"author_name": "Greg Bray", "gravatar_hash": "da1209aa320f9bbebbf128ac6a0751d3", "author_url": "http://blog.theg2.net", "date": "May 04, 2010", "message": "I thought the same thing about the mockup. The only problem is that one of the more difficult tasks right now is setting up your Interested and Ignored tag lists. Hiding questions that do not interest you is probably the biggest thing you can do to make the homepage and question page more enjoyable, as it greatly reduces the signal to noise ration. Adding a \"Click the topics that interest you\" and \"Click the topics that you would like to ignore\" screen right after somebody creates an account would greatly help end users customize the site to their personal tastes."}]}