{"response": [{"author_name": "Jonathan Sampson", "gravatar_hash": "3eada417ab749e3a7a5d51d451b2cc3a", "author_url": "http://sampsonresume.com", "date": "Apr 16, 2010", "message": "This is awesome - I definitely want to visit this Museum in the future, and being able to stop by and get my picture with the Stack Overflow brick would be well worth the trip from Atlanta.\n\ncaptcha: chores undercover"}, {"author_name": "BCS", "gravatar_hash": "d68f8d8798ee2da0d94cda6d7a544c23", "author_url": null, "date": "Apr 16, 2010", "message": "Last time I hard about that place I thought it sounded cool. Then yesterday, I was looking for someplace to park while I meet someone in the area and happened to run across it by chance. Now you blog about it. (third time it's \"Enemy\" action ;)\n\nA bit off topic but they have a working Babbage engine on display. I find that cool both from a training standpoint (I'm an Mech Eng by training) and a professional/hobby standpoint (I'm working as a software developer)\n\nWell worth an hour at least, and it looks like they are expanding!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 17, 2010", "message": "BCS, at the moment the \"visible storage\" area (which is awesome) is temporarily closed while they improve and revamp the museum:\n\n> The more professional approach to showing some of the museum's 100,000 artifacts and hundreds of hours of video footage—most of which are currently socked away in storage—is a preview of techniques Hollar and his curatorial staff will use in an overhaul of the entire museum scheduled to open in October 2010. The renovation will double the museum's exhibit space to 25,000 square feet and aim to help visitors construct a story line around the collection, says Hollar.\n\nhttp://www.businessweek.com/technology/content/jun2009/tc20090630_165557.htm"}, {"author_name": "-dan", "gravatar_hash": "48fd7c03aa90c23a2602ebc3837e0f31", "author_url": null, "date": "Apr 19, 2010", "message": "How about:\n\nStack Overflow \nWorld Knowledge\nand Information\nSorted and Ranked\nfor Consumption"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Apr 19, 2010", "message": "@BCS (off-topic)^2\nIf anybody is currently trapped in London by the wrath of Thor. \nThe Science museum in London has a Babbage difference engine, an analytical engine and the printer."}, {"author_name": "Sosh", "gravatar_hash": "28b32e959ebbbf7e418f96bcd7c1db7e", "author_url": null, "date": "Apr 20, 2010", "message": "On a related theme, for those who might have not seen it, the BBC did a drama of sorts last year about the UK home computer 80s heydays (Spectrum, Clive Sinclair, BBC micro etc.)\n\nIt's rather entertaining, quite funny, and well worth watching if you have a spare hour. (I don't know how familiar some of it will be to US viewers, but would still recommend):\n\nhttp://www.youtube.com/watch?v=2y8IkcUGV9w&amp;feature=related"}, {"author_name": "Dave", "gravatar_hash": "200225a606fb60085321c7d3e81eab6a", "author_url": "http://www.101domains.com/", "date": "Apr 22, 2010", "message": "I'd love to give the museum a try at some point. I didn't even know it existed until today!"}]}