{"response": [{"author_name": "Tyler Breisacher", "gravatar_hash": "e689265ee24e0874ae8a90827c4783e7", "author_url": "http://trojansax.blogspot.com", "date": "Apr 25, 2010", "message": "\"As I’ve mentioned probably ad nauseam at this point, people have the uncanniest knack of asking multiple, nearly identical questions with almost zero words in common. But there’s a bright side to this dark cloud: a small tweak to the words used in the titles can help “nudge” questions into more natural groupings.\"\n\nYes, as long as it really is a small tweak and not a complete rewording to make the two titles more or less identical. If two people asked the same question with completely different wording, that's a GOOD thing, because the next person to search for that same question may use similar wording to the first asker, or to the second. I just hope people don't take this as meaning \"identical questions should always have identical titles\"."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 26, 2010", "message": "Tyler, agreed, title edits should generally be additive when possible -- unless you're removing \"noise\" words that either don't help or actively harm the matching.\n\nI can think of a few title words that tend to match the wrong stuff, or stuff in different contexts, etc.\n\nAs I said in the post body.. \"small tweak\". I'm not proposing completely rewriting the titles, just making them better.\n\n(While you'd think tags could carry the brunt of the matching algorithm, it really does take a good tag match plus a reasonable title match for any \"related\" algorithmic solution to work.. even a little.)"}, {"author_name": "Ben", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Apr 26, 2010", "message": "The simplest way to avoid duplicate questions would be to have search terms ANDed by default."}, {"author_name": "Motti", "gravatar_hash": "6183c6f9d621a125cd3aa0f7ae324285", "author_url": "http://lanzkron.wordpress.com", "date": "Apr 26, 2010", "message": "Is the number of linked questions displayed limited somehow?"}, {"author_name": "Ivo", "gravatar_hash": "f7ae8c8fb83e502a854e2db3410f3827", "author_url": null, "date": "Apr 26, 2010", "message": "Uhm Jeff? The first two linked articles link to questions that were closed because they were a dupe of this one. \n\nI understand a dupe can hold answers the main/original question doesn't, but if they don't it's not really a useful link now is it?\n\nPlus if you want to make it easier for 'experienced users' to retitle a question, then give me inline retitling!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 26, 2010", "message": "Ivo, it must be that way otherwise how could we satisfy...\n\nhttp://meta.stackoverflow.com/questions/36366/please-provide-a-table-of-duplicates\n\n?"}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Apr 26, 2010", "message": "Just a quick, undeveloped thought: is it worth exposing the internal difference between “Related” and “Linked” questions in the interface?\n\nCould linking instead be folded into the “Related” algorithm?\n\n(I have no suggestions on how to do this.)"}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "Apr 26, 2010", "message": "(Oh, and my recaptcha was “yearned received”. I love stories with a happy ending.)"}, {"author_name": "Ivo", "gravatar_hash": "f7ae8c8fb83e502a854e2db3410f3827", "author_url": null, "date": "Apr 26, 2010", "message": "If you were to merge/mix the Related and Linked questions, perhaps you could order them by the amount of views, upvotes or upvoted/accepted answers? \n\nThat way at least you reduce the noise a little by putting them lower on the list.\n\n@Jeff: I understand this way the implementation is clear and easy to understand. If you were to change the sorting order, it's already more likely that people will find their answer by clicking on the first link rather than SOMEWHERE in the list of links..."}, {"author_name": "AnonJr", "gravatar_hash": "428f62d7106d907001f1b3a7366b7820", "author_url": null, "date": "Apr 26, 2010", "message": "While I agree that there shouldn't be two similar - but different - lists, perhaps we should keep them separate until it looks like the new list is working like it should and then we can figure out how to integrate the two together?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 26, 2010", "message": "I don't feel that manual user linking (Linked) and automated machine linking (Related) should be mixed together; they're very different things.\n\nRelated is a bit more of a random walk through a topic, whereas Linked is things your peers have indicated are conceptually related to the current topic.\n\nThere's a reason Linked is higher up than Related; it has more value since it was contributed by users."}, {"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "Apr 26, 2010", "message": "What a great feature! Was badly needed."}, {"author_name": "Brad Gilbert", "gravatar_hash": "6a81b9b2f0280da70b19d2dddcd8dc03", "author_url": "http://b2gills.blogspot.com", "date": "Apr 26, 2010", "message": "The only problem I can see with this, is that some questions are going to have a **LONG** list of links. Particularly the FAQ's on Meta."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Apr 26, 2010", "message": "&gt;The simplest way to avoid duplicate questions would be to have search terms ANDed by default\n\nNo, to avoid dupes you want as many false negatives as possible so the person writing the question gets a lot of possible dupes to check before they ask theirs.\nWith ANDed terms there would be almost no dupes suggested - unless they hit on exactly the same words.\n\nWhen you are searching for an answer to a specific question you want AND so you get few false negatives."}, {"author_name": "Ben", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Apr 26, 2010", "message": "@mgb, my hunch is that people search for an answer (AFAIK search is OR), don't find it, and then ask a question. I don't know if Jeff&amp;co have put an ajax spy on the list of dupes, but I wouldn't be surprised if 50% of the time or more, users don't even scroll the list."}, {"author_name": "Simon P Stevens", "gravatar_hash": "9587b96f4baf903b6a2413de77e8a737", "author_url": null, "date": "Apr 27, 2010", "message": "Nice feature. I like it.\n\nI understand that you are saying that the lists should be seperate, but is it worth considering somehow not displaying entries in \\related\\ if they have already been displayed in \\linked\\. Seems to me that your just wasting space by displaying the same entry twice, once in each list."}, {"author_name": "Ether", "gravatar_hash": "43722cb1e955874a8eb721e9dfe101d1", "author_url": null, "date": "Apr 28, 2010", "message": "It's good to see this up. However, I think you misunderstand what \"bidirectional\" means. :)"}, {"author_name": "Arjan", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "Apr 28, 2010", "message": "Some limit to the number of links might be useful, but then: how to determine which links are most important? Maybe the most recent ones?\n\nFor example: see the looooong list at http://stackoverflow.com/questions/1732348/regex-match-open-tags-except-xhtml-self-contained-tags (and a scaled-down screen capture at http://img.skitch.com/20100428-dfs8qfy1cmyfagby45jtnucx3f.png )"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 02, 2010", "message": "@arjan good point.\n\nWe now cap it at 50 and it uses a variant of the standard hot sorting algorithm to put the \"best\" linked posts at the top (score, # answers, # views, answer scores)"}]}