{"response": [{"author_name": "Steve Wortham", "gravatar_hash": "7c4d1e4f8701946b8391d009d8d85221", "author_url": "http://regexhero.net/", "date": "Apr 13, 2010", "message": "Well done Jeff.  Your decision to go with OpenID has only helped OpenID develop into something great.\n\nMy decision to adopt OpenID for my own site came about simply because by the time I was ready to do it, Google had added support for it, and there were clever OpenID selector interfaces out there ready for me to use.  And of course, just as you use the DotNetOpenAuth project, so do I."}, {"author_name": "donnacha", "gravatar_hash": "9f6cdebb40c95b2770ba5bf788720aaa", "author_url": "http://wordskill.com", "date": "Apr 13, 2010", "message": "Whatever it's merits elsewhere, OpenID was an unmitigated disaster on Stack Exchange."}, {"author_name": "Kibbee", "gravatar_hash": "2b568071163c0d009635cfa63cf6e6ac", "author_url": "http://www.kibbee.ca", "date": "Apr 13, 2010", "message": "One nice feature of OpenID that I use is the ability to delegate the openID verification.  So I can set up my own domain name, and then put a tiny bit of XML on that page that tells the site (like stackoverflow) to go to some other openid Provider (in my case MyOpenID).  The big plus is that I have complete control over my Open ID account.  If MyOpenID goes down, I can just switch to another provider. I think anybody who has their own domain name should go for this option."}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Apr 13, 2010", "message": "I think it's a bit weird that in some ways the trilogy sites are run as one (abiliy to move questions), but at treated seperately (logins, profiles) in other ways. I assume it's a deliberate decision to not consolidate logins, but it is a useability PITA to have to log in up to 4 times when you use a new machine.\n\nThe Gmail login fix especially seems like a kludge. Is there any reason you didn't use cross-site requests to detect if a user is logged in on any of the sites and automatically log them in?\n\nCaptcha: Spanish baldwin"}, {"author_name": "Shaun Finglas", "gravatar_hash": "5fa64738b2b35539637c51e7a098587b", "author_url": null, "date": "Apr 13, 2010", "message": "Interesting.\n\nWill you be doing ASP.NET MVC - One Year Later? It will be nice if the gap wasn't so far between, but I understand you're a busy man."}, {"author_name": "Doug", "gravatar_hash": "f3520932a6f244f67e8ac13803c14860", "author_url": "http://www.diaryofaninja.com", "date": "Apr 13, 2010", "message": "I too am a big supporter of DotNetOpenAuth (not financially) but think not having to reinvent the wheel that it has become my defacto standard for OpenID support in the .Net space\n\nAdditionally i think Open ID is the shiz... not having an \\account\\ in 100 places makes it so much easier to get access to something without having to worry so much about telling them who you are all the time and keeping that information updated.\n\nSO's support of Open ID was one of my main reasons for getting so active - it makes it so easy for someone drifting by in the QA world to contribute"}, {"author_name": "example", "gravatar_hash": "23463b99b62a72f26ed677cc556c44e8", "author_url": "http://example.com", "date": "Apr 13, 2010", "message": "Why would you try to use OpenID as a \"fingerprint\"? Google obviously didn't want people surreptitiously tracking their users, which seems reasonable to me. \n\nThe nice thing about Open ID is that anyone can host there own.  And I do.  I don't want my user account controlled by anyone else. And it's not!"}, {"author_name": "Andrew Arnott", "gravatar_hash": "ebc5e94561110bbfb1ea487665849fdc", "author_url": "http://blog.nerdbank.net/", "date": "Apr 13, 2010", "message": "Great write-up.  I just came from an OpenID Summit near San Jose, CA and we have some great ideas filling the spec development pipe that will hopefully resolve some of the remaining issues you have with OpenID."}, {"author_name": "AlmostAlive", "gravatar_hash": "ea94e3294e71915034746618b1e2ae23", "author_url": "http://www.crazyontap.com", "date": "Apr 13, 2010", "message": "One year later and I *still* haven't signed up for StackOverflow.  The OpenID paradigm still seems overly complicated and ties me to all kinds of other providers and systems.  What's great about a username and password is it's simple, and obvious, and familiar.  My browser saves my username and password information (and syncs it to the cloud) making it no fuss at all.  \n\n&gt; We have to keep move forward on fixing the login explosion problem, because the status quo sucks.\n\nOpenID sucks as well.  So you might not be part of one problem, you're just part of another.  Either way, mandating this craziness is bound to turn off some users, myself included."}, {"author_name": "Rob Gilliam", "gravatar_hash": "c68cda7956348b2d5492fd8b04cb38b9", "author_url": null, "date": "Apr 13, 2010", "message": "Agree with AlmostAlive. The requirement to switch out to another site to log into StackOverflow is one of the reasons I'm hardly ever there - it's just too much hassle to log in \"on spec\"."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 14, 2010", "message": "> What’s great about a username and password is it’s simple, and obvious, and familiar.\n\nSo are horses, but I'd rather build roads for cars.\n\n> The requirement to switch out to another site to log into StackOverflow\n\nYou don't, though -- once the one-time cookie is set, you never have to think about it. It's really quite effortless, at least through the major providers (Google, Yahoo, MyOpenID).\n\nAlso, if you're really gung ho about never getting with this crazy communist tinfoil hat OpenID stuff, you can still participate without ever registering. And, the login page will now let you recover your cookie for the unregistered account, provided you've given us a valid email address."}, {"author_name": "Doekman", "gravatar_hash": "b83de2466ffbd28e6493ee2fcd796978", "author_url": null, "date": "Apr 14, 2010", "message": "Because of StackOverflow, I'm now an enthusiastic OpenID user. \n\nHowever, why do you \"demand\" an email address of Google OpenID users. I think this is an invasion of privacy. If a user chooses to have different identities on StackOverflow and SuperUser, I consider that his/hers decission. \n\nWhy not offer the choice to the user: if you want to link StackOverflow sites to one and other, you need to supply an email address.\n\nThe only reason I can think of (I don't buy the usability defence), is commercial (ads and stuff)."}, {"author_name": "Peter", "gravatar_hash": "62e243a3f26aafa0eacb0371c4170a49", "author_url": null, "date": "Apr 14, 2010", "message": "The OpenID requirement was the primary reason I did not use StackOverflow. I like my anonymity, thank you very much, and I'm just too lazy to create a new gmail account just for SO"}, {"author_name": "Slavo", "gravatar_hash": "528f3acc8d119dcc6c7817deda454251", "author_url": "http://www.slavoingilizov.com", "date": "Apr 14, 2010", "message": "I'm expecting the post about the third technology lock-in (ASP.NET MVC) with your opinion about the progress it has seen."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": null, "date": "Apr 14, 2010", "message": "Um... I'm one of your gmail openID users, and you have my e-mail, but you won't be able to match it up.  Why? Because I use the emailname+sitename@gmail.com whenever I sign up for a new service.  Now I could change that maybe, but if I want different gravatars on the sites (and I have a different one I like on meta and another on serverfault) I have keep the e-mail addresses distinct."}, {"author_name": "-dan", "gravatar_hash": "48fd7c03aa90c23a2602ebc3837e0f31", "author_url": null, "date": "Apr 14, 2010", "message": "Doesn't work for me, and as far as cookies go - I have them deleted every time I close my browser. \n\nI don't keep a history and I don't keep cookies.  It's a security issue for me.  We are being tracked all over the internet I leave plenty of digital crumbs to pick up, but I honestly believe too much harm is being done, even by those that claim to do no evil.  \n\nI tried the openId and I never was able to get it to work a second time, to be honest I didn't put that much effort into it because it's just not worth it.  \n\nYou might be surprised at how many people walk away because of the pain in the ass factor.\n\nYou may love it, you may believe it's the best thing on Earth, hell it may be the best thing on Earth, but when it comes to users if they don't get on board, you lose anyway. Being right doesn't mean you win.\n    \nJust my 2 cents waiting on change"}, {"author_name": "R. Bemrose", "gravatar_hash": "7618ff7a4952a494b8f41bd0df646790", "author_url": null, "date": "Apr 14, 2010", "message": "In other words, you've had to special-case a specific OpenID provider.\n\nRemind me again why this is better?\n\nCoincidentally, both captcha words I got are relevant to this topic: uncertainties islands"}, {"author_name": "Michael Pryor", "gravatar_hash": "83678606ffe33ee7c1fb50b97338daed", "author_url": "http://stackoverflow.com", "date": "Apr 14, 2010", "message": "If you made stackoverflow.com an openID provider, you'd get rid of the last remaining objections from the people who just want a username and password."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Apr 14, 2010", "message": "> Um… I’m one of your gmail openID users, and you have my e-mail, but you won’t be able to match it up. Why? Because I use the emailname+sitename@gmail.com whenever I sign up for a new service.\n\nGoogle sends back your actual email address, which is stored in a database column that is only writable at login time and cannot be edited by anyone; the editable email you change is in a different column.\n\n> In other words, you’ve had to special-case a specific OpenID provider. Remind me again why this is better?\n\nIt is a bit of a special case (more of a trust whitelist, really) but when you're dealing with the 800 lb gorilla of OpenID, that's just how the world works. When Google moves, you move. Or you get crushed.. same with anyone in the Apple, Microsoft, etc ecosystem.\n\n> You might be surprised at how many people walk away because of the pain in the ass factor.\n\nWalk away from what? The fact that we offer completely unfettered anonymous participation, like Wikipedia? There's nothing to walk away *from*. Heck, as long as you're willing to juggle a browser cookie in pepetuity you could stay an unregistered user and generate 50k+ in rep."}, {"author_name": "James Schend", "gravatar_hash": "6a6953862709066352ee4227343c39e0", "author_url": null, "date": "Apr 14, 2010", "message": "I don't want to use OpenID because it means my data is held hostage by at least 2 parties: StackOverflow itself, and my OpenID provider. As you mentioned, if your OpenID provider folds (or simply decides not to provide the service anymore), you're kind of screwed.\n\nSure you can add a *second* OpenID identity, but the average user won't think of doing that until after the first is already down-- meaning, after it's already too late.\n\nI mean, look...\nTechnically: the issues above.\nUsability: being redirected from site to site while logging in. Having your data made inaccessible through the actions of a third-party outside of your control.\nFeatures: inability to combine OpenIDs. For example, if you have a LiveJournal and Google ID, and you decide you want to log into both using your Google ID, you can't without creating a brand new LiveJournal account. (This is something you can do with *every* alternative, including Passport.)\n\nSure you can *fix* these problems by paying for a domain name, web server and knowing XML, but see the \"usability\" point above.\n\nI get what you're saying about managing logins, and how it sucks. But there *has* to be something better than OpenID... OpenID is awful. So, so many problems. And the more people implement OpenID in its current (sucky) form, the less likely it is it'll ever be improved due to momentum.\n\nEven more annoying, you're *forcing* users of this site into OpenID because *you personally* have an issue with logins. What if I don't have an issue with logins? What if I don't mind using a username and password for every site? What if I *prefer* to do it that way? Nope! No choice! You're not smart enough to make your own choice, it's our way or the highway."}, {"author_name": "Kiz", "gravatar_hash": "62faec946afdcb64643025242a47bf07", "author_url": null, "date": "Apr 15, 2010", "message": "When Mozilla broke Weave I ended up just abandoning the accounts that I used it for. Luckily I didn't use it for anything remotely useful, but I was still very peeved."}, {"author_name": "Chris W. Rea", "gravatar_hash": "ff2449ce63c14c6416566197c3f67d4f", "author_url": "http://www.basicallymoney.com", "date": "Apr 15, 2010", "message": "Re: \"we can now potentially associate your accounts, across all of our websites, automatically\" ... this will be particularly useful for the new Stack Exchange \"2.0\" sites that will operated by Stack Overflow.  :-)"}, {"author_name": "Chris Messina", "gravatar_hash": "8403e20f058363f718144dd51faa65a7", "author_url": "http://factoryjoe.com", "date": "Apr 16, 2010", "message": "Thanks for this write up Jeff. OpenID certainly isn't perfect, but I agree with you that once there a greater migration to cloud-delivered services, the idea that a single browser instance will or should have all of your passwords will seem quaint.\n\nOf course your audience is more technical than the average audience, and are willing to jump through more hoops to secure their identity online. Finding the right balance of features, functionality, and privacy-preserving features is a core goal of the OpenID community.\n\nTo James Schend I'd ask if he uses a webmail provider of any kind? Or if he banks online? I certainly understand that there will always be people who don't want to rely on others to protect or store their data, but increasingly I find that keeping data on my local harddrive just means that I have more worries about backing up my data, and that the data becomes less valuable over time because it's harder to share.\n\nThat might just be specific to me and how I use the web, but as it is, I own my identity because I host my own OpenID. When I sign up for any new service these days, most still ask me for an email address or password — and it seems much more dangerous to use or reuse one of my rotating password than to treat them as a relying party.\n\nI'm also bullish about OpenID — and it takes experiments like yours to tease out the opportunities to improve the technology."}, {"author_name": "American Yak", "gravatar_hash": "2f58cb403e6ebe31e6ff19ea534e8f40", "author_url": "http://www.americanyak.com/", "date": "Apr 17, 2010", "message": "It's amazing just how much resistance there is to this technology.  I happen to be one of those rare people who would *rather* use my gmail email address as *the* OpenID (ala, webfinger) --\n\nURLs are annoying, and even though you're providing login option buttons for major providers (Google, Yahoo, AOL, even WordPress and Blogger), so that URL handling is done natively through the \"click-through\" process, it makes so much more sense semantically to use an email address for what it was intended: identity.\n\nIn any case, I've been a major fan of stack overflow for the very adoption of OpenID.  It does seem there's much user interface/usability questions that still need to be solved (I'm a UI guy), and I wouldn't exactly say the interface is fully intuitive (redirecting where for what?), but I'm still placing my faith in the whole process -- in time we'll develop better discovery methods, and browsers will probably hold the technology natively to make things more robust and powerful.\n\nMy ultimate opinion?  There should be some standards adopted by in the HTML5 spec that utilize these new technologies: OpenID, OAuth, ActivityStreams, etc."}, {"author_name": "Emil Cohen", "gravatar_hash": "2644dffbc4189d1c72727e133f542cd7", "author_url": "http://www.emilcohen.com", "date": "Apr 17, 2010", "message": "Superior writer, OpenID is a safe, faster and easier way to log in to web sites. with social networks websites are the new web internet there is nothing like the OpenID ideal solution for the new web.\nand i'm sure there is alot more to come apps and exciting new features that will make OpenID one of the most valuable player in the world of the new internet : )"}, {"author_name": "sam.hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": "http://sam.haslers.info", "date": "Apr 19, 2010", "message": "Couldn't you redirect all logins through one of your domains so that google only ever sees that domain?"}, {"author_name": "andy", "gravatar_hash": "6b6d607c73fccfe066ec6adb37b17621", "author_url": "http://thatandyrose.tumblr.com", "date": "Apr 19, 2010", "message": "Hey Jeff, in the context of you \"One Year Later\" series, perhaps you could talk about LINQ2SQL and your future ORM plans. I'm a great supporter of LINQ2SQL, despite it's kind of... abandonment, for lack of a better word. It would be cool to hear about your thoughts on it.\n\nthanks\n\nandy"}, {"author_name": "Arjan", "gravatar_hash": "a74dd7ceb0511cc47943c74950bcb904", "author_url": null, "date": "May 20, 2010", "message": "@James,\n\n&gt; I don’t want to use OpenID because it means my data is held\n&gt; hostage by at least 2 parties: StackOverflow itself, and\n&gt; my OpenID provider.\n\nBecause of the latter, I've simply set up to be my own OpenID provider (not just use my own URLs). Can be as easy as http://siege.org/projects/phpMyID"}, {"author_name": "nomash", "gravatar_hash": "bdc7df6df74a7ae5c0154a94ffd1564d", "author_url": null, "date": "Aug 26, 2011", "message": "As a site owner, I refuse to add support for openid, it's not my problem you have 40 passwords you have to remember.  I don't have 40 passwords only a few but I group them according to website ie one password for all forums, one password for all banking, one password for misc, etc.\n\nI'm also not a big fan of all the increase use of third party sites ie social commenting, etc.  You will never see a facebook or any other third party commenting system on my website.  Site owners are giving up their ownership to third parties, that's how America lost their mojo."}, {"author_name": "fuckthisshit.myid.net", "gravatar_hash": "553734729b61f0961a504135397cd58b", "author_url": null, "date": "Oct 01, 2012", "message": "As a user of the web, openID sucks.\n\nMore and more sites that I want to use present the openID obstacle to me. If I really want to use the site I have to create a new email address and openID every time. This just sucks. Especially when the providers block my email address provider, have broken signup form validation and unreadable and ocassionaly broken captchas.\n\nThe larger sites won't suffer, because they have a large audience. So alienating a small percentage won't bother them. \n\nBut honestly. Screw you guys for making my life harder."}, {"author_name": "ficiek", "gravatar_hash": "32ca0886c7e7f19b1edfcf90cb13c700", "author_url": "http://sourcedrops.com", "date": "Oct 16, 2012", "message": "\"If I really want to use the site I have to create a new email address and openID every time.\" What?"}, {"author_name": "Betsey", "gravatar_hash": "b89b00261751771750b5339a992e54d5", "author_url": "http://windowtowall.blogspot.com", "date": "Dec 03, 2012", "message": "Truly no matter if someone doesn't understand then its up to other visitors that they will assist, so here it happens."}, {"author_name": "Kristian", "gravatar_hash": "84ae8d02a9fcf306df3e159918a0a63a", "author_url": null, "date": "Dec 16, 2012", "message": "Why are people so upset about using OpenID which lets them sign in with a couple of clicks? The only viable alternative is the tried &amp; tested method of using an email address to sign up and then making people check their inbox and click a verification link.. which is just manually doing what OpenID does.\n\nWikipedia is less anonymous if your not logged in as it publishes your IP address as an identifier with contributions you make."}]}