{"response": [{"author_name": "Mark Beukers", "gravatar_hash": "1059b0ac1ead5a69e5911479bfae03e4", "author_url": "http://libget.com", "date": "Apr 23, 2010", "message": "Congratulations on finally moving out of the hole that is svn."}, {"author_name": "Gavin", "gravatar_hash": "6fce8bc2418f78e9d5fad4e5eb6af7ec", "author_url": "http://pedantic.co.za", "date": "Apr 23, 2010", "message": "My favourite part is being able to work while offline and still commit your changes."}, {"author_name": "oddparity", "gravatar_hash": "7e703eb7204356b6d0737238d7bfa195", "author_url": null, "date": "Apr 23, 2010", "message": "An important point to note is that you can get some of the benefits of a DVCS today even if your employer doesn't switch. Both Git and Mercurial have excellent integration with SVN, so you can create your own repository and tie it to your company's SVN server. There's a quickstart for Git here: http://www.viget.com/extend/effectively-using-git-with-subversion/\n\nAll my interaction with SVN these days is through Git, and I don't understand how I survived earlier."}, {"author_name": "Damien", "gravatar_hash": "6fa1cdda524d49996a8bc6917328de3d", "author_url": "http://www.dmathieu.com", "date": "Apr 23, 2010", "message": "Great ! Could you tell what made you choose Mercurial and not Git ?"}, {"author_name": "Ben", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Apr 23, 2010", "message": "I'm a GUI-wuss too, but something about git made me give it a try anyway. I think it's the simplicity of the 'object model' (http://book.git-scm.com/1_the_git_object_model.html) which got me interested. \n\nAnd the easy branching &amp; magic merging (and it IS magic!) got me hooked. So by the time I got round to downloading git extensions, I'd got used to the command line and git gui/gitk.\n\nThe other thing I like is that you don't have to tell it about filename changes. Which means Visual Studio can do it's thing, and git 'just knows'. No stupid workarounds."}, {"author_name": "Matan", "gravatar_hash": "0bb7bf3089b704277bac6d9acc7bb22b", "author_url": null, "date": "Apr 23, 2010", "message": "@Damien Code sharing with the team at NYC, Jeff says that in the post."}, {"author_name": "JosephCooney", "gravatar_hash": "4e0bb82c98f2e45d3ccb94ec5be0a5e3", "author_url": "http://jcooney.net", "date": "Apr 23, 2010", "message": "I've used Mercurial for about 2 years and never touched the GUI tools. The command-line is where it's at."}, {"author_name": "B", "gravatar_hash": "28bdd5298558caad2744c8b32ad913c9", "author_url": null, "date": "Apr 23, 2010", "message": "@Matan: The other obvious direction would be to mandate the NYC-team to use the same VCS as the rest of the Valuable Associates."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://johntopley.com/", "date": "Apr 23, 2010", "message": "@B Fog Creek had already moved to Mercurial after two of the smart fellows there managed to persuade Joel et al of the benefits of DVCS. Fog Creek were using Subversion before. See http://blog.bitquabit.com/2009/11/10/dvcs-as-code-review/"}, {"author_name": "Tim Post", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": "http://echoreply.us/tech/", "date": "Apr 23, 2010", "message": "Its about time :) Kiln is an awesome tool and a natural progression from Subversion."}, {"author_name": "Chris", "gravatar_hash": "d57d8b027fe943f061b6187d870443a7", "author_url": null, "date": "Apr 23, 2010", "message": "(While there are differences between Mercurial and Git, the differences are not hugely significant any more; they are basically the Pepsi and Coke of DVCS.)\n\nWhy do I only ever hear mercurial users say this? Ask a git user if git and mercurial are the same and most will tell you they are radically different."}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "Apr 23, 2010", "message": "The two reasons why Mercurial and Git are worth switching from SVN?\n\n1. gitignore/hgignore instead of the clunky \"magic metadata\" that svn:ignore is\n2. Proper Branching/Merging. SVN got a lot better, but having a branch as a copy always felt weird, mainly because it leads to the trinity of tags/branches/trunk and because you always have to construct/remember the URLs of the repository. All that stuff should be hidden as an implementation detail.\n\nI don't know how well branching in Mercurial works (I heard people recommend cloning the repo instead?), but I know that I fell in love with git after using it for a while.\n\nTooling isn't even needed that much, I mainly used tooling in VS2010/Subversion to to not check in crap (bin,obj etc.) which isn't a problem anymore with .gitignore and for Visual Diff/Show Log which works well enough with gitk."}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Apr 23, 2010", "message": "Maybe git users are just more anal. I mean, git does come from the world where people fight over the differences between Linux distributions, ignoring the fact that not only are they all basically the same, but also that Linux isn't much different to other unices, or even that all modern mainstream operating systems employ essentially the same concepts due to the hegemony of unix and the C programming language and standard library. Things are more similar than the are different. If you don't believe me, compare Unix/Windows to z/OS and see how different things could have been."}, {"author_name": "Brendon", "gravatar_hash": "13bf2d79c001944892d0791c13e1c274", "author_url": null, "date": "Apr 23, 2010", "message": "Great to see you drop svn, you'll never look back."}, {"author_name": "James", "gravatar_hash": "1774ddd4e8364ef05eaf4871e93f678d", "author_url": null, "date": "Apr 23, 2010", "message": "What sort of workflow is the SO team going to be using with Hg?  Are you going to use branches or Mercurial Queues?"}, {"author_name": "Paul Nathan", "gravatar_hash": "fc3225dc3119500fcbf7af646a83c914", "author_url": null, "date": "Apr 23, 2010", "message": "Branching in hg is different than git. git has the conception of pruning dirty trees. hg has the conception of never rewriting history. There are certain effects of this difference that I don't fully understand, but the effect is that there is a different."}, {"author_name": "Steven A. Lowe", "gravatar_hash": "4c263fe87d408564a9e5f6d1e519aed4", "author_url": null, "date": "Apr 23, 2010", "message": "Joel's tutorial is enlightening, to say the least."}, {"author_name": "Jakub Narębski", "gravatar_hash": "672aa8b373071ef9f06db563d1c08d77", "author_url": null, "date": "Apr 23, 2010", "message": "The most important diference between Subversion (and other centralized VCS) and Mercurial (and other distributed VCS) is that (at least by default) centralized VCS promote update-merge-commit workflow, while distributed VCS promote commit-then-merge workflow - which is much safer.  Also Subversion had and to some extent still has worse support for branchy workflow; like Linus said its ease of merging that is important, not how easy is to create a branch (fork).\n\nSO has some answers about differences between Subversion and DVCS, and differences between Mercurial and Git."}, {"author_name": "B", "gravatar_hash": "28bdd5298558caad2744c8b32ad913c9", "author_url": null, "date": "Apr 23, 2010", "message": "@John: Thanks, that makes sense. And together with Joel's tutorial and the 'hosted by Fog Creek'-part makes going in that direction the more obvious choice of the two."}, {"author_name": "John A", "gravatar_hash": "e48547648dff8d70c9a9fd3663d150d7", "author_url": null, "date": "Apr 23, 2010", "message": "I love the comment If you are still using SourceSafe, get the hell off my lawn.  What about those of us that are still using SCCS? (and by us I am in fact implying that my employer is still primarily on SCCS, with a little of RCS/CVS thrown in the mix)"}, {"author_name": "Steven", "gravatar_hash": "585dee8f1d99f06db4aa7549c72f4890", "author_url": null, "date": "Apr 23, 2010", "message": "Welcome to 2002."}, {"author_name": "Daniel Molina", "gravatar_hash": "563a4acb7f96818f73aac531f3f60a60", "author_url": "http://coder.cl/", "date": "Apr 25, 2010", "message": "My FOSS projects are really small, so moving to GIT or Mercurial isn't justified. I will keep using Subversion until they grow enough and I will get more developers involved on them :)"}, {"author_name": "Charles", "gravatar_hash": "2b22bc2038c24cb33dfe26bafae502c9", "author_url": null, "date": "Apr 25, 2010", "message": "John A.: I'm not sure if you can still buy/download it, but if you want a pretty good DVCS on top of SCCS, Sun's old Teamware product did a pretty good job. Its major deficiency is probably that it relies on a distributed filesystem for its repository actions (meaning that both must be accessible as file paths on the system running the commands), though it's possible to work around this.\n\nSee: http://docs.sun.com/source/806-3573/TeamWareTOC.html\n\nIt was EOL'd a while ago though, so I think you'd have to find someone with an old copy."}, {"author_name": "Grant", "gravatar_hash": "c24646fadce91fe3b868a99b386f386e", "author_url": null, "date": "Apr 25, 2010", "message": "This will probably start a flame war, but the native windows version of git is based on a fork.  It's not part of the official git distribution.  Sure it's not that a big deal.  And yeah, you can install cygwin and use an official version from that, but thats a little annoying if you're not already using cygwin.\n\nWith things being (basically) equal between mercurial and git, if you have developers on windows boxes, many people are going to pick the one where the main project supports windows in a normal way.\n\nDo you want to end up in a situation where some sutler bug in the fork renders your windows and unix/mac repositories incompatible?\n\nIt's the same reason many people are uncomfortable using mono on linux for something serious.  Sure it works, but it's a bit of a second-class citizen vs .NET."}, {"author_name": "Gath", "gravatar_hash": "b92900c4f298016ef88f532dd99691b6", "author_url": null, "date": "Apr 25, 2010", "message": "Molina, till u use branching in DVCS on small projects you will appreciate that your projects are not any small to take advantage of DVCS. I use Git on personal projects and i can tell you it awesome!"}, {"author_name": "yogsototh", "gravatar_hash": "e536b92667e2150c01628f4031974fa2", "author_url": "http://yannesposito.com", "date": "Apr 26, 2010", "message": "At first, congratulation to have switched to a DCVS. This will clearly be the new way to control version.\n\nBut I must say there is a *huge* difference in using git instead of Hg. I don't believe differences between these two are like the Pepsi/Coca one.\n\nWith git you can make the work of many in branches in only one branch. Then after a long work, put each of your modification in the branch you choose. \n\nPratically, that mean you can work a long period of time without taking care of the DCVS. And organize the commit after you worked on many different things. With Hg it is simply not possible to do that. You have to code for one thing, then create a new branch for a new thing and work in that branch etc...\n\nOf course this kind of work has a meaning when you're used to have many branches (one for each bug fix, each amelioration, etc...)"}, {"author_name": "Matt", "gravatar_hash": "db55a20e7e93431697f6a966bd2708d3", "author_url": null, "date": "Apr 26, 2010", "message": "There's some discussion of hg vs. git, but what about bzr? \n\nI'm new to the whole DVCS thing and those three are the ones I'm looking at."}, {"author_name": "ignaci", "gravatar_hash": "001c619e403b31af5a07c224d3719d63", "author_url": "http://www.cmcrossroads.com", "date": "Apr 26, 2010", "message": "Good to see we're starting to cross the chasm!\n\nJeff mentions all DVCS are still a little bit \"raw\". Let me add a comment about another DVCS that's worth having a look at and it's everything except \"raw\": Plastic SCM. http://codicesoftware.blogspot.com/2010/03/distributed-development-for-windows.html."}, {"author_name": "Dmitrij", "gravatar_hash": "751166e5acd4d30266f00f56a2fd864d", "author_url": null, "date": "Apr 26, 2010", "message": "&gt; With Hg it is simply not possible to do that.\n\nUm, really? I'm doing this every day with mq and histedit."}, {"author_name": "James Iry", "gravatar_hash": "72b1a6b08fd8bb3068bd281974461c3e", "author_url": "http://james-iry.blogspot.com", "date": "Apr 26, 2010", "message": "Instead of the hg init tutorial, which seems to be a tad confused about some very basic facts, I recommend Mercurial: The Definitive Guide (http://hgbook.red-bean.com/). It's got a nice, tutorial introduction, continues into some real depth, and is available in online free-as-in-beer form or for purchase in dead tree form."}, {"author_name": "Jeremy Brayton", "gravatar_hash": "fd765402fab076396044261cec883d67", "author_url": "http://braytonium.com/", "date": "Apr 27, 2010", "message": "Grant: OMG thank you. Something about git on Windows *never* felt right and I couldn't put my finger on it. It is more like a 3rd or 4th class citizen but Windows was never its focus to begin with which I find pretty ironic but that's how Linus rolls.\n\nThe decision that finally pushed me to Mercurial was a future prospective employer using Kiln. So I grabbed the source and started compiling but I wanted SVN history during my initial imports. The headache of getting swig and python integration built when I had originally left it out made me further despise SVN. Somewhere along the 1.6 branch (not a jump from 1.5 like you'd hope), the main configure script broke the BerkeleyDB arguments so I had to research and poke until I figured out which child (apr) needed this and adjust by making my own higher level build script that built each peice accordingly I've only used twice now and I've hated both times.\n\nTortoiseSVN is perhaps the absolute best tool I've ever used. TortoiseMerge is phenominal. Now that I've started to get used to how Hg works, the absence of branches/ tags/ trunk/, etc I can safely say I won't be looking back into that sea of tragedy that luckily a front-end tool hid from me. Had I not been the one tasked with compiling the source I would have never known any real headache.\n\n\nJeff has outlined some of my pain points in switching as TortoiseHg and SVN are very different tools where things are not and will not be 1:1. It requires a lot of unthinking that TortoiseSVN just flat out did for me without any need to formally research. Hg on the other hand has needed a manual to guide me almost from second one which is not bad but it is the \"problem\" Jeff mentions on Twitter. If I have to think and research before every action, yes it does mean I am a n00b but I'm hoping at some point this will become routine knowledge. Because these tools are in an infantile stage, however, I feel obligated to keep my head \"in the books\" and study each change with a fine toothed comb.\n\nI suppose that's the price we pay for early adoption though."}, {"author_name": "Josiah Kiehl", "gravatar_hash": "44fa0745a224eabd917a753b7921b593", "author_url": "http://bluepojo.com", "date": "Apr 27, 2010", "message": "The biggest difference between git and hg is that git has GitHub. Hg does not."}, {"author_name": "Nick DeVore", "gravatar_hash": "47385a9853559168d25cd8789f0c7f79", "author_url": null, "date": "Apr 27, 2010", "message": "What a flip from http://www.codinghorror.com/blog/2008/04/setting-up-subversion-on-windows.html\n\nGlad to see we can all change.  Inspired me to make the leap to git."}, {"author_name": "u62", "gravatar_hash": "221fc94982b5b7295f025c4386edb877", "author_url": null, "date": "Apr 27, 2010", "message": "Josiah&gt; github is just a big circle-jerk for open-source fanatics. It's irrelevant to people who need source control for their actual work."}, {"author_name": "Ronald Pottol", "gravatar_hash": "30f5f0416c7d0c64240539085558bf9a", "author_url": null, "date": "Apr 27, 2010", "message": "If you want DCS, a nice gui, and are willing to pay, there is what convince Linus to start using version control:\n\nhttp://www.bitkeeper.com/"}, {"author_name": "Dheeraj", "gravatar_hash": "16979837ff6376b1ce313667f6f606b9", "author_url": null, "date": "Apr 28, 2010", "message": "[\"the tools are still a bit .. raw\"]\n\nAre you kidding? TortoiseHg is way more awesome than the crappy SVN tools."}, {"author_name": "Dmytrii Nagirniak", "gravatar_hash": "73ba2d202efab9804e1e344f2079f605", "author_url": "http://www.ApproachE.com/", "date": "May 10, 2011", "message": "Just curious what Continuous Integration and Deployment tools are used?\n\nCheers,\nDmytrii."}]}