{"response": [{"author_name": "TildalWave", "gravatar_hash": "fe9695ecf5357e79060712ad77ce7c4d", "author_url": null, "date": "Feb 21, 2013", "message": "Guys, [cinnamon can be dangerous](http://digitaljournal.com/article/323339) in larger amounts! Go easy on it! LOL"}, {"author_name": "SoboLAN", "gravatar_hash": "8feac14b86e6408e19694122993e7935", "author_url": null, "date": "Feb 21, 2013", "message": "I thought you guys forgot about this thing... it's been some time since the last podcast.."}, {"author_name": "Anoynmous", "gravatar_hash": "e511dabf9d2f0437be4736825d65a0af", "author_url": null, "date": "Feb 22, 2013", "message": "I like Joel's opinions for socializing research and banning copyright.\nDon't understand why people think this means a dictatorship, especially ignoring the fact that the US government is currently killing civilians without due process, talking about ignoring the real elephant in the room while day-dreaming about an imaginary one."}, {"author_name": "JS Bangs", "gravatar_hash": "26a6b978dd7b7f8ea7dd446cff12cf5c", "author_url": "http://jsbangs.com", "date": "Feb 22, 2013", "message": "This podcast was very painful in the middle, because Joel made two assertions of fact which are entirely false.\n\n1) It has never been the case that your property rights extend to the middle of the earth. For centuries, <i>mineral rights</i> have been distinct from <i>property rights</i>, which means that the right to the rocks and ores hundreds of feet below your house does not necessarily lie with you, the landowner. See: http://en.wikipedia.org/wiki/Mineral_rights\n\n2) It's not the case that universities and NIH do most productive pharma research. This is an urban legend which continues to circulate for what I guess are ideological reasons. Here's a ranty rebuttal, with lots of links to more substantive discussions: http://pipeline.corante.com/archives/2010/09/24/avandia_goes_down_a_research_rant.php"}, {"author_name": "Peter Wone", "gravatar_hash": "dcd9836a94720caadd7dfc82d1df627d", "author_url": "http://statelywonemanor.wordpress.com", "date": "Feb 24, 2013", "message": "Podcast # 23 repeats a time honoured misconception: you all seem to think that when a publisher charges $25 for a book and gives $1 to the author, that the other $24 goes straight into the back pocket of the publisher. This is malarkey. \n\nPenguin Australia – and I got my info directly from the national manager in a fascinating chat we had in the early nineties – makes all of its profit from about 3% of its catalogue. Most book runs are negative earners. That means each bestselling author’s sales are carrying the poor sales of the other 97%. That’s about 33 to 1. It costs a bomb to print, package, warehouse, transport and merchandise, and creditors don’t like to wait. \n\nSo when publishers pay at 25 to 1 it’s actually pretty generous, and this is why they love reliable bestsellers like Stephen King.\n\nThe situation is actually pretty similar with music labels. If you think about it most bands are utter shite. A recording contract essentially says “Hello unemployed arty wanker, here’s an unsecured loan for two years worth of weed, wine and women plus all the pizza you can eat, see what you can come up with.” Occasionally some of them produce something halfway saleable and it has to cover the bad debts of all the other stoners.\n\nDon’t get me wrong, I’m not in favour of such toll collectors. The internet and other technological advancements mean that you no longer need a studio or a distribution chain: their services are no longer required. So long and thanks for all the fish. But they aren’t quite the evil gougers people make them out to be."}, {"author_name": "Diederik Hattignh", "gravatar_hash": "1a5cbaad056fbc8550118c334f609440", "author_url": null, "date": "Feb 25, 2013", "message": "Erm, hate to bring up the site itself here, but http://blog.stackoverflow.com/category/podcasts/ only has podcast #40. Almost missed a few because of that."}]}