{"response": [{"author_name": "Jorge", "gravatar_hash": "d4f7d15de2abdec49cacaac7d14f00fc", "author_url": null, "date": "Feb 01, 2013", "message": "I've been working remotely for 5 years now and we've always persistent chat and email, but I can't say enough good things about how Google Hangouts has really made things so much better. \n\nIt really is a killer product, especially lately where you can integrate with google docs and just bash out brainstorms and documents quickly.\n\nThere are some drawbacks to working remotely, mostly the constant human to human interaction (which Hangouts do help with, but it's not the same). Coworking places seem to be getting more popular though if you're looking for an \"office\" environment with a more traditional watercooler effect."}, {"author_name": "Cate", "gravatar_hash": "293a075ffa8372c860003c4f6f236d91", "author_url": null, "date": "Feb 01, 2013", "message": "I am so much more productive when I get to work from home. Surrounded by my dogs, peaceful music, no drive by interruptions from people so that I can make them log tickets or send emails so I can keep track of what I'm doing and still focus on tough code. Our company is slowly coming around to WFH days, and I get two a week. Those are the days I set aside to focus on my toughest tasks, because I know I'll have 2 extra hours (no commute) and be able to focus and concentrate better."}, {"author_name": "Vishal", "gravatar_hash": "a3620a4bc567e95119dd867b46c5ec64", "author_url": "http://screenhero.com", "date": "Feb 01, 2013", "message": "We've been working on a tool for collaborative screen sharing (called Screenhero).  Everyone gets their own individual mouse cursor and it's pretty fast with low lag.  A lot of our early users are distributed development teams that have started using Screenhero instead of Google Hangouts/Skype for screen sharing.\n\nSo far they've been finding it awesome for remote code reviews, pair programming, debugging etc.\n\nWe have a beta available for Mac at http://screenhero.com.    If you guys are on Mac check it out and let us know what you think?  Would love to get your team's feedback on how useful it is for working remotely.  (Windows is coming soon!)"}, {"author_name": "M1EK", "gravatar_hash": "95cf560a66d608439012edbe7b887cd8", "author_url": null, "date": "Feb 01, 2013", "message": "I agree with this 100% - but the fad towards strict agile practices where everybody has to be in the same open-plan office (whether a misinterpretation or not, this is how most people think it's supposed to go) are making it even harder these days to remotely work than it used to be."}, {"author_name": "Mike T.", "gravatar_hash": "8acf9959670a1ca942d9287677cfb1fa", "author_url": "http://www.teamtwigg.org", "date": "Feb 01, 2013", "message": "Cate has a great point! I'm more productive with my time than if I was at a desk.\n\nDo almost all my \"extra work\" remotely...joomla has been such a great place to play for web development and I've enjoyed open source. I run things from phones, tablets, laptops...at baseball games...from just about every conceivable place...\n\nKids laughed at me the other day because I had three laptops open...opening HN on my blackberry...running a site through its paces on a tablet...lol...love doing things at home...\n\nI run about 20 websites from small to large projects...in my spare time...it pays for the extras in life...wish I could get over the hump to doing things from home all the time.\n\nSo you're hiring...hmmm...sounds cool.\n\nMike T."}, {"author_name": "Ekrem Onsoy", "gravatar_hash": "b81bef51ecfe9e417184f6f7ed453a75", "author_url": null, "date": "Feb 01, 2013", "message": "I was working for a private bank as a DBA last year and I quit. I have begun to work for a logistics company remotely. This way, I am way productive because I do not spend about 3-4 hours in traffic in a day. I am not even talking about the stress as a consequence of this. At work, there are too many things that can distract you such as phone calls, colleagues etc. This way I am all alone when I want to be and I can deeply concentrate what I do as others mentioned, in a peaceful athmosphere."}, {"author_name": "Pierre Lebeaupin", "gravatar_hash": "68795690302f37a7119d8e340c73e4c9", "author_url": null, "date": "Feb 01, 2013", "message": "I think one corollary of #3 is that, due to phase transition effects*, there has to be a minimum proportion of telecommuters in the team/company for it to work; having just one telecommuter in the team because he moved away and no one else working remotely is not going to work.\n\n*thing ferromagnetism, water freezing, or minority languages that do or do not survive depending on whether the proportion of native speakers is above a certain threshold"}, {"author_name": "Dennis", "gravatar_hash": "ca848f95af282749e72d2bac4cc3fc87", "author_url": null, "date": "Feb 01, 2013", "message": "How do you work out the lack of emotion, and all the possible interpretations of persistent chat and email?\nA nice read though :) I recognise a lot of points made."}, {"author_name": "Kevin Stricker", "gravatar_hash": "be35d273f59f56c8de25f74e219cca49", "author_url": null, "date": "Feb 01, 2013", "message": "Even with a two year old and a screaming newborn in the house I'm a lot more productive at home than I want to be after a 45 minute drive to work =) Today, I'm in the office incidentally. *Ahem* Time to get back to work."}, {"author_name": "Calum", "gravatar_hash": "d7c3d219e88121b9e1fc6b2156f2ff7f", "author_url": null, "date": "Feb 01, 2013", "message": "I've worked at home more often than not for the past ten years, and dread having to find a new job where I can't do the same. Though like most large IT companies, the one I work for wouldn't dream of passing any confidential information through Google's servers, so no hangouts or docs for us..."}, {"author_name": "Allen Conway", "gravatar_hash": "2311a032d27f8278b61dac7574a00931", "author_url": "http://allen-conway-dotnet.blogspot.com/", "date": "Feb 01, 2013", "message": "This is a great article. Too bad so many companies have a close minded policy which often stems from a distrust of their employees. This creates fear that the employees will be less productive if at home and a manager can't keep a 'watchful eye' upon them. This is more commonplace outside the tech world I believe."}, {"author_name": "Fred Stluka", "gravatar_hash": "e01fce977c341b46ac8402ba91142245", "author_url": "http://bristle.com", "date": "Feb 01, 2013", "message": "Don't forget about screen-sharing apps like join.me.  \n\nLike Google Hangout's screen sharing, but allows you to give control of the shared keyboard/mouse to any of the viewers.  I use it for spur of the moment support, training, demos, and other screen sharing, because it is a single click on an e-mailed link for a viewer to see your desktop, and less than 60 seconds for you to install it, share your desktop, and send that e-mail invite.  \n\nIt's the kind of thing that I can suggest in the middle of a meeting:  \n- I can't picture it.  Why don't you show me the problem on your computer via join.me, and I can fix it for you.\n- Huh, what's that?\n- It's really quick and easy.  I'll tell you what to do, then I'll hold my breath until I see your screen.\n...\n- Wow!  That was easy.  Thanks!\n\nSee my review at:\n    http://bristle.com/Tips/Internet.htm#join_me\n\n--Fred"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Feb 01, 2013", "message": "Great post.\n\nWhat David does NOT believe in, however, is proper HTML numbered lists. Clearly. :)"}, {"author_name": "Joe A", "gravatar_hash": "5c7aaa32a3a74d37f136e6b980c35976", "author_url": null, "date": "Feb 01, 2013", "message": "I am a software developer and have been working from home for the past year and love every minute of it! As others have said, most companies don't get it. I get solicitations daily from recruiters on LinkedIn about great jobs very very far away that I will never consider. Companies love to locate their offices in hyper expensive area where their C-levels can afford but the developer has to commute 45 minutes each way, then they complain as to why they can't find good developers."}, {"author_name": "Lorenzo Dematte", "gravatar_hash": "85e5c60ca8616d3c9269378baec34972", "author_url": null, "date": "Feb 01, 2013", "message": "Great article! I completely agree on everything, but I especially like two points: \"You have to commit to it as a team (and a company)\". The shift has to happen at a global level, otherwise telecommuters will be \"half-citizens\". \n\"they must be self-motivating and proactive\": that is, in my opinion,  something you should always look for in a developer, regardless of he/she will telecommute or not. Especially in a small-ish and young company. \nI usually describe it as \"enthusiasm\" :) the willingness to do better, the feeling that devs are really enjoying themselves in what they do. There are many developers that just do what they are told to do. It's not bad, per se; I have worked with skilled developers that are not proactive, but they do not shine, they do always need to work with someone who \"drives\" them. And this clearly does not work if you telecommute.\n\nAlso, I second your choice for Trello + Google docs, even for non-remote teams. It's just perfect, it gives you the right degree of flexiblily!"}, {"author_name": "Lorenzo Dematte", "gravatar_hash": "85e5c60ca8616d3c9269378baec34972", "author_url": null, "date": "Feb 01, 2013", "message": "Also, I do understand why people works more at home, while not taking a toll on personal life: commuting. On a good day, I spend two hours commuting. On a bad day, 3 hours. I would happily spend that time coding (I actually try to do it while I'm on the train, but it's not really the same). When I work from home, I spend more hours working, more hours with my wife, and I'm less stressed by transport (road-rage, late public transport, ...)"}, {"author_name": "Simon Hawkin", "gravatar_hash": "2be0d7a95cf75ba55aaa7d58a271d7de", "author_url": null, "date": "Feb 01, 2013", "message": "@Dennis: the \"lack of emotion\" may be an advantage."}, {"author_name": "Chris AtLee", "gravatar_hash": "694bbd7f4420b0874e3577f1fd5dd28a", "author_url": "http://atlee.ca", "date": "Feb 01, 2013", "message": "Agreed 100%\n\nThe release engineering team at Mozilla are mostly remote from one another. Our manager John put together a great presentation about working remotly: http://oduinn.com/blog/2012/04/04/we-are-all-remoties/\n\nwe're also hiring :)"}, {"author_name": "Nikita", "gravatar_hash": "bc373b69c4ca5e618d08ae719b2a51a0", "author_url": "https://twitter.com/nmtitov", "date": "Feb 01, 2013", "message": "I'd like to find remote job in iOS or Erlang-related stuff :) Have been working remotely since 2008"}, {"author_name": "Cristina C", "gravatar_hash": "daac6d23a830471d4f7d00f533f4320d", "author_url": "http://www.parakaleo.us", "date": "Feb 01, 2013", "message": "Very helpful article, David. \nI work for a non-profit organization and this year we are growing but only 2 of us live in the same city, so remotely it is, at least most of the time. It's a big change as we adapt to new work responsibilities and especially to new, creative and effective communication channels that work for everyone. We are still in the process of establishing what works best for us. What you've described as happening in your company helped me consider new ways to keep us all in the same page while we grow and continue the work we do. Thanks."}, {"author_name": "Cezar", "gravatar_hash": "fb1d7bd4fe188a5c093ae1f590c91c2a", "author_url": null, "date": "Feb 01, 2013", "message": "What do you think of partial remote? I find that I'm more productive when I can go in some of the week and work remotely the rest of the time."}, {"author_name": "Luciano", "gravatar_hash": "d9c0d5eab1e7375b63d1c99e3dd6e34b", "author_url": null, "date": "Feb 01, 2013", "message": "So how do you deal with salaries for people from other countries, other currencies, other taxes?"}, {"author_name": "Justin Dorfman", "gravatar_hash": "21a46ad06bed3b803d41cb2b8d6b1433", "author_url": "http://maxcdn.com", "date": "Feb 01, 2013", "message": "Couldn't agree more with: \"It lets you hire good people who can’t move.\"\n\nI have the pleasure of working with remote SE engineers (Geoff, Sam, Kyle &amp; Ben) and I have to say they are some of the brightest people I have ever met."}, {"author_name": "Sergey Shteyn", "gravatar_hash": "111415ff4c49ef9887b70fc8c6f7799e", "author_url": null, "date": "Feb 01, 2013", "message": "Great article ! Some work areas don't provide an environment where developers can focus in delivering a quality product without being being forced to multitask on too many items. Working from home can help you focus without distraction, unless there are family distractions.  I found working at night the most productive."}, {"author_name": "Freeman LaFLeur", "gravatar_hash": "21299d7e8f3d2b6ff894b961f92aa780", "author_url": "http://www.freemanlafleur.com", "date": "Feb 01, 2013", "message": "Loved the article! We took our 12 person team remote in June of 2012 and couldn't be happier. We use many of the same tools you outlined here and from the comments it seems the remote workforce is really finding empowerment through Google+ Hangouts. You can read about our experience in firing our office here: http://freemanlafleur.com/how-we-fired-our-office/"}, {"author_name": "Rimian", "gravatar_hash": "8bf1c9d4005ec592ac518840559db996", "author_url": "http://wheresocksgo.com", "date": "Feb 01, 2013", "message": "You can also work in your underpants."}, {"author_name": "Joe", "gravatar_hash": "d0bcd7aabddbb66264ce78dad565e93f", "author_url": null, "date": "Feb 01, 2013", "message": "Does Fog Creek still not permit remote workers?"}, {"author_name": "Joe", "gravatar_hash": "d0bcd7aabddbb66264ce78dad565e93f", "author_url": null, "date": "Feb 01, 2013", "message": "@Rimian Or work sans-pants."}, {"author_name": "Michael Scharf", "gravatar_hash": "d40184fad0ff8e98f9bfea8116551695", "author_url": "http://michaelscharf.blogspot.de/", "date": "Feb 01, 2013", "message": "I am working as a developer remotely since 18 years. When I started working full-time remotely I used a modem to get internet access and traveled once a month to the company with a sun sparc station in my luggage to synchronize my work... Telephone was expensive (working form Germany for an Austrian company). Email was my friend...\n\nThe most difficult times have been when I felt excluded from what was going on -- when the local team forgot that I exist. When teams are re-shuffled and management or direction changes it can be very difficult. Once a team is in a good steady state everything is fine. \n\nMembers in the office are in a much stronger position than remote members. It can be *extremely* difficult to try (form a remote position) to get into a team form outside, if you are not invited... \n\nIf you are remote a chatting and phoning is essential -- if you are local those can be seen as disruptions. \n\nIf there are multiple remote workers and some local team members, there is a danger that two \"virtual\" teams emerge -- one local and one remote. One team doing real chat and the other having remote chats.\n\n\nTherefore hints and suggestions in this post (and in Jeffs post) are important. If you hire remote team members (in different time zones) the way you work and interact has to change. \n\nMichael"}, {"author_name": "t", "gravatar_hash": "bc15444a580f1dbafbe4b355bfea8b24", "author_url": null, "date": "Feb 01, 2013", "message": "I work on a team that is across time-zones.  I work more than the normal hours but they are scattered across the clock, India when I'm about to go to bed or just after I get up, Europe early, I'm in EST, but the main office is in California.  My hours are disjoint, but when I'm busy and the team is too I work more.  But I can go out on errands in the middle of the day and avoid traffic when I need to."}, {"author_name": "Federico", "gravatar_hash": "303b0a741a14439b53c23ce4c9e28a12", "author_url": "http://fedmich.com/works/stackoverflow/", "date": "Feb 01, 2013", "message": "This is great guys, glad to hear you accept working remotely.\nMix of remotely working and occasional meetups/coming to office are the best though.\nSeeing the office &amp; your colleagues once in a while in person helps in motivation and getting more inspired to do your best.\n\nI'll give it a shot and hope I can work with you.\nYou mentioned New York, NY (telecommute) (relocation offered)\nHow far would you be able to help?\nCould you help out a guy from the other side of the globe?\nI'm in Singapore now, but definitely wanted to visit NY very much"}, {"author_name": "Conrad", "gravatar_hash": "e474a1fc05f99edcf67915512bf9cff2", "author_url": null, "date": "Feb 01, 2013", "message": "This is the most important point. \"#3: You have to commit to it as a team (and a company).\"\n\nI used to work from home but I can't stand the isolation. You put a huge burden on the rest of the in-office team to include you in the conversation. Basically, someone will have to replay the daily lunch conversation to you. How many time do you think people will do that before they get bored and just left you out?\n\nYou also miss out on the decision making process. By the time a decision reach your ear, the three headed monsters might have gone down the path too far for you to inject any opinion."}, {"author_name": "Frank", "gravatar_hash": "9e0965e6ab6e0652b11b1cd3dad33609", "author_url": null, "date": "Feb 01, 2013", "message": "We also love using hangout for meetings. But we use the Symphonical app within the hangout to organize our tasks. Easy UI and it's allmost like Trello."}, {"author_name": "SoboLAN", "gravatar_hash": "8feac14b86e6408e19694122993e7935", "author_url": null, "date": "Feb 02, 2013", "message": "I think allowing people to work remotely is an excellent feature of a modern and serious company in 2013. However, it has to be implemented correctly (!).\n\nOne issue though: It's probably best if you have your remote employees come into the office at regular intervals, for meetings and/or socializing. Maybe once every 2 or 3 months ? If people meet face to face a few times, it's much easier for them to become friends and therefore work better together."}, {"author_name": "Dennis", "gravatar_hash": "d3036f38776d38ede0e6d8d8ce0e15b9", "author_url": "http://www.thoughtandtheory.com", "date": "Feb 02, 2013", "message": "Do you guys hold yearly meetups for everyone like other remote focused software teams? Or do you fly people in on a more regular basis? I find that while remote works out well, a balance of seeing the whole team together really helps on the less tangible aspects of being happy at a job.\n\nFor instance, I think automaticc [sp?] flys people in every year to a destination so that people can get a little face-to-face interaction."}, {"author_name": "Bob Jarvis", "gravatar_hash": "dde6276eccc198c3dbaf0142ba25ea70", "author_url": null, "date": "Feb 02, 2013", "message": "I dislike working at home (not FROM - AT) and much prefer to go into the office.  At home there are too many distractions.  At work I can focus on working.  And...honestly, when I'm home I want to be HOME - not at Office Extension West."}, {"author_name": "Richard", "gravatar_hash": "beab519e33fcd27720da9365bf7027e9", "author_url": "http://richardgriffiths.azurewebsites.net", "date": "Feb 02, 2013", "message": "I have to tell you, I'm sending this page to my boss-who is also the main developer and MD. We're moving to fancy new offices, double the distance away from me = a minor wage drop in increased time and costs to attend work.\n\nYet in the last two weeks I've put in an extra 40-50 hours at home, to make my day job easier. I wrote an API and editor for our custom content stored in a proprietory fashion. A thing that would not have happened at all at work, the best one can do there is some quick hacks that work. Those hours were definitely NOT work to me though, I just got a bee in my bonnet and couldn't stop. Now a job in our company that could only be done by someone ok with variations of database work can now be done by someone who is simply good at writing, experienced in the business domain itself and fairly logical.\n\nAll as a result of working at home. I shall produce a LOT more stuff this way in an attempt to convince them that office attendance bears no resemblance to productivity :)"}, {"author_name": "Simon", "gravatar_hash": "e863fce93163aa4c79fd4e527343c719", "author_url": null, "date": "Feb 02, 2013", "message": "It does sounds like a great place to work, but on your hiring page, there are location specified. How come? Remotely, but only for certain locations :-) ?"}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Feb 02, 2013", "message": "Awesome post!\n\n\"You lose a clear distinction between work and the rest of your life\" was very true for me.  I had to learn to keep track of my actual working hours to keep a private life :)"}, {"author_name": "Jan Schaumann", "gravatar_hash": "bd2d4a630b89e2ab93144d3967cabe06", "author_url": "https://twitter.com/jschauma", "date": "Feb 02, 2013", "message": "Great to see you making a good case for remote employment!  Too many companies or managers are still skeptical about letting their employees out of their eyesight.\n\nOne observation I've made is that I am much better at working 100% remotely than if there is a local office and I go in two or three days a week.  With that being an option, I always felt (perhaps imagined) peer pressure to be in the office, while if that is not even an option, work flows more easily.  (Constraints are friends.)\n\nThe other really important thing to remember is, I think, that everybody has a different work flow, and what may work for one of your remote employees may not work for the other.  Seems obvious, but still worth noting.\n\nFinally, a shameless plug: just the other day, I answered an internal question about what people/teams can do to facilitate remote employment (much along the lines of what's written here), and I ended up putting the response online at http://www.netmeister.org/blog/remote-employment.html"}, {"author_name": "Brad Rhoads", "gravatar_hash": "1d28d12ef1c0835cf44a45814d073bab", "author_url": "http://www.ontherhoads.org/brad", "date": "Feb 02, 2013", "message": "Just curios, do you guys do SCRUM? Are things any different for/with the remote guys than the in-house guys?"}, {"author_name": "Jin Yang", "gravatar_hash": "2f3a2044890a5d94f0096ebfaf3f3177", "author_url": "http://www.8164.org/", "date": "Feb 02, 2013", "message": "I want your delicious NYC HQ beef jerky."}, {"author_name": "Chad Saxon", "gravatar_hash": "b61a268bf22e668137cb825adc61e0a2", "author_url": "http://geeksweep.com", "date": "Feb 02, 2013", "message": "Anyone out there hiring iOS developers who are ok with remote work? Send me a shout :)"}, {"author_name": "Martin Pool", "gravatar_hash": "5347c683b6963f418d1b16c65917bf3f", "author_url": "http://sourcefrog.net", "date": "Feb 02, 2013", "message": "How often do you physically meet up?  We did a lot of remote work at Canonical, and found that getting teams in the same place for a week a couple of times a year made a big difference to the member's esprit de corps."}, {"author_name": "Christine", "gravatar_hash": "c60e505cde90c9dec37063b51864e201", "author_url": null, "date": "Feb 02, 2013", "message": "Working remotely sounds great --- not really practical for many surgeons, Home Depot staff, Walgreen's pharmacists, etc.   A bit of inequality in the workplace, it seems."}, {"author_name": "Vlad", "gravatar_hash": "6794f72ec5bbec4a701ec555915fd788", "author_url": "http://lazarenko.me", "date": "Feb 02, 2013", "message": "It is truly great that you provide an opportunity for people who cannot commute and couldn't get it otherwise. I take my heat off to you for that. Keep up making the world a better place!"}, {"author_name": "Beto", "gravatar_hash": "a3e18455c061dd5eaf6497cf1114cce0", "author_url": null, "date": "Feb 02, 2013", "message": "I've been working remotely for about two years with a New York firm (from 3500 miles away) and I think it is the best that could happen to me in many ways. I never liked being stuck in stressful traffic to be hopelessly stuck in a office and back for starters - I feel endlessly more productive on my own home office, built exactly like I want and with the peace of being home. I even dared to take work with me across Europe for three months. Anywhere with a good Internet connection was office.\n\nI agree with many of the points here, and the fact that it takes lots of self-discipline to make remote work... Well, work. People who need to be told what to do at every second are not cut out for this. This said, there have been some times where discussing issues face  to face would be better and simpler than going through emails and video chats. The ideal environment, I think, would be a combination of WFH and occasional physical meetings for truly important issues.  But all in all we seem to go through fine."}, {"author_name": "Vagabond Artist'", "gravatar_hash": "955b0f515d07de1f7c401506fba38325", "author_url": null, "date": "Feb 02, 2013", "message": "It was nice when it all first started\" Husband working from Home\"   Like when the kids were young.... But my empty nest is never empty and I am never alone unless he's gone......   Like to Japan\"      For 3 weeks.... But after 10 years of him working from home\" IT'S NICE..... but then.  I need my territory back, It's hard to do MYWORK.  With anyone ARROUND....      He is away as I type.... The kids are both in UK, I am alone and I paint..... It's all or nothing. He is ALLWAYS working, home or away, that sucks... \nI'd say this.   If you do work from home....stick to a absolute time line, I am very Unhappy I seem to never have his attention, and he is ALLWAYS deducing...but\nIs why he gets the BIG BUCKs so IM TOLD....\nCrapp.. Anyone want to buy a painting....... Heheheh peace"}, {"author_name": "eigentor", "gravatar_hash": "8de3a2fccec56eec4ba08f604e531caf", "author_url": "http://rufzeichen-online.de", "date": "Feb 03, 2013", "message": "I love mix and match: If the office is in my town, having a desk there and shifting between home office and office. I also work most productively from home, and Hangouts and stuff are very good for communicating with the team.\n\nBut sometimes I need an evironment change for refreshment. This can be either way from home to office or the other way round. For me that works perfectly.\n\nOh, and allow more part-time workers. I work about three days (self-employed now) and this is just how much I can take of client work. In understand full-time is the norm that works for most, but someone who is really spot-on on his 20 hours he works for the company might be a very productive asset you miss out on if you would not allow him to go part-time."}, {"author_name": "Ashish", "gravatar_hash": "60dba47ff0bfcbca57265fd2c76fe623", "author_url": "http://www.sankalplabs.wordpress.com", "date": "Feb 03, 2013", "message": "i totally second the views expressed. I was working remotely on-off in my previous org &amp; can relate to some of the productivity aspects mentioned.I wonder why many companies still dont promote this culture."}, {"author_name": "John Locke", "gravatar_hash": "288f43b2e85b2451c08aa86f0e0453ad", "author_url": "http://www.lockedowndesign.com", "date": "Feb 04, 2013", "message": "I am mystified why more web development companies do not embrace the distributed team. If the excuse is they want to work with people face to face, we have Google Hangouts and Skype. \n\nYou raise an excellent point: you can see what people actually get done, not just how many hours they were at the office. And hiring remotely gives you the largest talent pool available, not just the people nearby."}, {"author_name": "Gayle Buchanan", "gravatar_hash": "69e3fd232c26127c9519e9ce7c244a9c", "author_url": "http://www.onlinebookkeepers.co.nz", "date": "Feb 04, 2013", "message": "Nice post, coming up to 20yrs working from home with a slight break helping my husbands company in downtown Auckland, I still get the 'Oh I wish I could work from home' and yet they do nothing about it.\nSkype has been an absolute god send and with more and more clients (CA's) using it there are a ton of business owners being more productive and less stressed.\nThumbs up to mainstream finally starting to embrace the power of chat and cloud based application - of course kiwi made xero.com is helping all of us grow"}, {"author_name": "Rob", "gravatar_hash": "b31aaf710c959aae76fc8aa2b2bcc31f", "author_url": null, "date": "Feb 04, 2013", "message": "@David: Great post and insights. Can you tell us how you create and invite people to persistent Google Hangouts? For some reason, Google doesn't explicitly support this use case. I've tried one hack method but the user experience isn't that elegant."}, {"author_name": "Kalen", "gravatar_hash": "c92556123177bd35a5d59c1dc7045720", "author_url": null, "date": "Feb 04, 2013", "message": "@David, thanks for the excellent article!  \n\nYou mention focusing on work that's actually getting done vs. butts in chairs.  Have you guys uncovered any relatively generic ways of measuring productivity objectively?  Or is it more of a matter of managers making a mental switch in how they're thinking about developer time being spent?"}, {"author_name": "unstacked", "gravatar_hash": "d8ed85073054427468bc29d5f6a0dd2d", "author_url": null, "date": "Feb 04, 2013", "message": "You believe this because you will earn money from this. Its impossible to work remotely if you are human.\n\n\nStacked zombies with no brain."}, {"author_name": "epe", "gravatar_hash": "b7c4773bf935187fde5f60f966b32516", "author_url": null, "date": "Feb 04, 2013", "message": "I've been telecommuting for about 12 years now. The first 10 years was in a larger company in which our small, distributed group of developers regularly had to justify telecommuting to upper management, despite being extremely productive. Eventually we ended up with new management that served up an ultimatum--move near an office or you're fired.  I can't even describe to you how stupid this was, since at least one individual was being told to commute so he could work *by himself* in a small branch office, and the remaining team was still spread over 2 or 3 offices (meaning we communicated electronically anyway). The attitude seemed to be 'If I have to drive in, then so do you,' even where it made no sense whatsoever.\n\nI tried going into the office, but after 10 years telecommuting, I was so miserable in a cube farm with all of its distractions and the extra hours commuting every week that I quit and got a job with a small company that's almost entirely made up of remote developers.  Couldn't be happier."}, {"author_name": "Christian", "gravatar_hash": "b16b62df06bf1d90b7b6136cb3ee1a04", "author_url": "http://resume.christianziebarth.com", "date": "Feb 04, 2013", "message": "Cezar brings up an excellent point. \"Telecommuting\" does not have to mean that you never ever see the person. Perhaps they live close enough to the office where they can go in for some face time every Tuesday afternoon, or every Friday morning. I have actually done that: meet when you need to, work on your own when you don't need to be in a group.\n\nI think companies fear the word \"telecommute\" because they think it means they have \"cut the leash.\" But a slacker is a slacker whether they are in a traditional office or working remotely and you will find that out within a month or two wherever they are. And, yes, remote workers tend to be more productive, call in sick less, etc.\n\nCompanies could save a lot on office space by allowing telecommuting and employees can save on gas and society can save by having less cars on the road and the environment can save by having less pollution. It's win-win all around."}, {"author_name": "Christian", "gravatar_hash": "b16b62df06bf1d90b7b6136cb3ee1a04", "author_url": "http://resume.christianziebarth.com", "date": "Feb 04, 2013", "message": "\"It's impossible to work remotely if you are human.\"\n\nExcept that people actually do it, unstacked.\n\nGayle, people might want to do it but are not allowed by their companies to do it. You would think that the web development industry would be one of the first to allow telecommuting but so many web dev companies are dead set against it and usually without knowing why. They still have the \"this worker must be getting work done because their butt was in one of our chairs for at least 8 hours a day\" mentality."}, {"author_name": "Sergiy", "gravatar_hash": "dd1f9edbf47f3980394227cb16eabe5b", "author_url": "http://www.assembla.com", "date": "Feb 05, 2013", "message": "I agree with all points in article. Remote development is great thing. StackExchange is not the only company who succeeded in remote development, in Assembla we've been doing this for years - and this is really cool :). During this time we've been using/improving our own tools, dedicated for distributed development, like online ticket management system or online code tools management. Our development/release process is designed for both \"in-office\" or remote developers. I think, we are even more \"remote\"  - now, we have people from about 14 countries in our team: developers/testers/PMs, who are working from their countries. And this is cool too :) \nWe also helping companies to become more effective by introducing our way of development/releases/managing projects and people. Our company is just live confirmation of the article. Working remotely IS effective :)"}, {"author_name": "Stéphane", "gravatar_hash": "381fa72ea7857873d832707b0f16fe0f", "author_url": "http://www.stephanethomas.com/", "date": "Feb 06, 2013", "message": "David, could you explain how you work with people living outside the US? I mean from a practical point-of-view: do you incorporate a subsidiary in each country or just rely on freelance contracts? How do you handle paperwork? How do you handle exchange rates which are sometimes not in favor of the US dollars?"}, {"author_name": "Chris Courtright", "gravatar_hash": "927748cf9964767a4926bc837d0c26a3", "author_url": null, "date": "Feb 06, 2013", "message": "What are some key collaboration capabilities that should be in place for teams executing Agile projects but have widely geographically separated team members? We are transitioning more of our IT efforts from waterfall to Agile methods with most of our early projects being performed by teams that are co-located within a single campus. We now want to start leveraging our offshore team members and I'd like to make sure we have the capabilities in place that gives us the best odds of success. So far I've seen email, and screen sharing, and video chat (for a few? for everyone?), persistant chat, IM, task management, and some others. How do folks handle the daily standup that Agile efforts use when there are such big differences in timezones?"}, {"author_name": "Scott Alexander-Bown", "gravatar_hash": "e86e5dcb2b81622818b4b24ca3c1beec", "author_url": "http://alexander-bown.com", "date": "Feb 06, 2013", "message": "Great article. Thanks for the Trello tip, it's was exactly what I've been looking for."}, {"author_name": "mike c", "gravatar_hash": "b0dc7ac5d526b0c77cdd6332120c58c6", "author_url": null, "date": "Feb 06, 2013", "message": "Great read, how are you doing persistent hangouts? Keeping them going 24/7? Couldn't find info about that."}, {"author_name": "Peter Wone", "gravatar_hash": "dcd9836a94720caadd7dfc82d1df627d", "author_url": null, "date": "Feb 07, 2013", "message": "I've been sick for nearly a week and although strictly this is not sanctioned work-from-home and they will deduct it from my sick leave, nevertheless I did more work here than I usually do in the office: I got bored, and it took my mind off how crappy I felt (and being upright improved breathing). I was surprised to be fairly effective while ill, since the application was far from familiar territory, with a lot of learning required. I speculate that this was due to reduced mental speed preventing my mind from skittering all over the place. It seems to me that work from home would work well for me, even were I in top health."}, {"author_name": "Vlad", "gravatar_hash": "0db4068fd307dd9b7e09cd5e1c67b06e", "author_url": null, "date": "Feb 08, 2013", "message": "I've been working for about 2 years in a large company with a several distributed offices around the world. Other members of my team were in different country so I had no any communication benefits when sitting at office. I asked for ability to work from home at it was accepted. It's about 2 years already I am working from home. I can't even imagine now that I will return to office job. I am much more focused at home, that on stupid open space. As a result I am much more productive. My schedule is more flexible. Every working day I have 2.5 hours more for a life."}, {"author_name": "mike g", "gravatar_hash": "f4388ef8c3312f80c685a4e97584b182", "author_url": null, "date": "Feb 10, 2013", "message": "Not only has working remotely made me more productive, it allows me to spend more time with my family since I'm not stuck in traffic for 2 hours a day.  Once you get used to the goto meetings, Skype, email and occasional phone call, u realize u can actually work anywhere. Also I find I can take a bike ride during the day, and work at night, if I want, so working at home gives new meaning to flexibility.  For so long, the paradigm has been, to do an 8 hour day in the office, in a cubicle, in a building that sits in some ugly remote parking lot.  A shift to remote work has made for a better life, and at the same time, a more focused, pleasant, and efficient work environment."}, {"author_name": "Simon Schenk", "gravatar_hash": "33a6b7ad3bc818326f28648b9f830094", "author_url": "http://doctivity.io", "date": "Feb 12, 2013", "message": "Thanks for the great article! At http://doctivity.io we work almost exactly as you describe (persistent chat, hangout, trello) for more than two years now and we never looked back. Of cause this requires some soft skills that the team needs to learn. One advantage we currently have is that we are all on the same time zone. We do a daily standup to sty up to date on what everyones doing and we to a weekly review and planning meeting. As an additional tool we use and develop doctivity.io, a sthe document management tool made for small and distributed teams. It offers a timeline view and richt integration of comments, video calls and more, which allows the team to easily stay up to date with what everybody is doing. Just as Stack Exchange we believe with a good team and the right tools, remote working is the best you can do."}, {"author_name": "Broadcasting", "gravatar_hash": "449375fa391cf45164e7990ef4e0317b", "author_url": null, "date": "Feb 16, 2013", "message": "Create an Office: Designate an area of your home to be your office space. This should be away from any household distractions. Having a desk near the television would be an example. Getting into a soap opera will not bring money into the home. A quiet section of the home is recommended, if at all possible. If you can hear what is going on with others in the home then you might get tempted to join them or feel the need to handle a problem. Treat this job as any other and you can join in when you get back from work."}, {"author_name": "Phil Byrne", "gravatar_hash": "8fc00f9d3d544dbdafc3d6850814c835", "author_url": "http://www.liveworkabroad.com", "date": "Feb 17, 2013", "message": "I have also been working as a remote worker for a number of years and find that being location independent is the way to go. I work from a number of locations throughout the world and combine my travel and work. \n\nMy team and clients all work remotely and I second the opinion that having face to face and easy contact is vital. I also strongly recommend having a separate office/room away from your living area to ensure that you can separate home and work and not allow it to blur into one."}, {"author_name": "Splaktar", "gravatar_hash": "0a84b79f00354795a82b54edc8436fb3", "author_url": null, "date": "Feb 22, 2013", "message": "Great Article! I worked remotely for 4 years for a major software corporation. I experienced just about everything that you mentioned. \n\nOf course we had some people who just imagined me sitting on a beach drinking piña coladas instead of working everyday. But I know that it made me a whole lot more productive.\n\nThings went really great with it until my manager was changed. Then things got real bad as they shuffled my manager 4 times in 1 year. All of the replacements were fairly new to management and really didn't get any of the tools or needs of remote workers. We also had an upper management push for 'pair programming' where developers would sit at the same desk and/or do sit down/over the shoulder code reviews daily. Upper management pushed this on everyone and did not even consider providing tools or training for remote workers.\n\nSo I also understand the comments about Agile and other practices that have become common lately. They can often be twisted or ignorantly applied in a way that isolates, ignores, or rejects remote workers.\n\nIt was a great experience while it lasted and I had management who understood / supported it. I am happy to be working in an office now, but I do enjoy a few WFH days per month. I would love to get onto a schedule at some point where I was in the office 2 days and WFH 3 days. But we'll see how things work out.\n\nThe saving in time, stress, and expense of not needing to commute and meet a dress code every day should not be under estimated!"}, {"author_name": "Nicole Miller", "gravatar_hash": "72b80ad05d9116263ebd9d960437436f", "author_url": "http://www.justoutsourcing.com", "date": "Feb 24, 2013", "message": "I think the best part of this article is the \"Sound like the kind of place you’d like to work? We’re hiring, especially developers and designers\" line. That's the way to put things in context!"}, {"author_name": "Peter Walke", "gravatar_hash": "9043308ae43ea17afb84e5c6abc743c1", "author_url": null, "date": "Feb 25, 2013", "message": "Interesting to see things also going the other way in tech... \n\nhttp://allthingsd.com/20130222/physically-together-heres-the-internal-yahoo-no-work-from-home-memo-which-extends-beyond-remote-workers/"}, {"author_name": "John O'Duinn", "gravatar_hash": "79053cfd1062e294423a702ee2adc560", "author_url": "http://oduinn.com", "date": "Feb 26, 2013", "message": "hi David;\n\nDelighted to hear that you still believe in working remotely. Me too! Here, at Mozilla's Release Engineering group, the numbers speak for themselves:\n\n* 16 people\n* 15 locations\n* 4 non-adjacent timezones\n* 0 in \"HeadQuarters\"\n\nWe've been doing this for 5.75 years now, and have turned the group from a classic-burnout-operation into one of the highest retention rates in Mozilla. \n\nAll while:\n* reducing turnaround time on an emergency-security release from 4-6 weeks to ~17 hours\n* reducing new-feature release cycles from variable 12-18 months to predictable 12 weeks\n* building out support for new products like FirefoxOS\n* and lots more goodness... \n\nMore details, and slides with all our tips+tricks, can be found here:\nhttp://oduinn.com/blog/2013/02/24/we-are-all-remoties-at-haas-mba/\n\n\nI think its fair to say that being geo-distributed is working quite well for us. Oh, and yes, we're hiring!\n\nThanks again for the blog - really great read.\nJohn."}, {"author_name": "anna marie etcheverria", "gravatar_hash": "8b14e3540b9c4786cd0e42e9b6c71969", "author_url": "http://www.flipsideworkspace.com", "date": "Mar 01, 2013", "message": "I thought this article was fantastic! I hope you don't mind, but I linked it to my recent blog post titled: Celebrating my 10-Year Anniversary as a Teleworker, This Month at www.theawkwardgawker.com.  What you wrote is important and I wish I could force everyone I know to read it.  :)"}]}