{"response": [{"author_name": "VonC", "gravatar_hash": "7aa22372b695ed2b26052c340f9097eb", "author_url": "http://stackoverflow.com/users/6309/vonc", "date": "Oct 08, 2011", "message": "If email is your thing, don't forget the only other email setting you can set on Stack Exchange: the one for tag sets -- you can subscribe to a tag (or set of tags) and get an email when new questions arrive (up to every 15 minutes!), as explained in the blog post:\n\nhttp://blog.stackoverflow.com/2010/12/subscribe-to-tags-via-emai/ \n\nIt isn't for the same purpose as \"unread inbox notification\", but it is a reminder about another great feature: tag sets.\n\nhttp://blog.stackoverflow.com/2010/11/tag-sets-on-stack-exchange/"}, {"author_name": "Hendrik Brummermann", "gravatar_hash": "900952cb86814ff8ff512d9d2c9ba02b", "author_url": null, "date": "Oct 08, 2011", "message": "An RSS feed of the global inbox would be useful."}, {"author_name": "Michael A. Puls II", "gravatar_hash": "304d6e1b17c5bdd141f9dc5aef93587b", "author_url": null, "date": "Oct 08, 2011", "message": "I absolutely love how things work at my.opera.com (for blog posts and forum threads). There's a subscribe button. You click to subscribe and then you get instant email notification for every comment, even if you haven't visited the site to check the first notification. This works not only for threads and blog posts you started, but for any thread or blog post.\n\nYou also have a subscription list that you can load to easily see what you're subscribed to.\n\nYou can also subscribe to the feed for each blog, forum, blog post and forum post, which is awesome too. But, subscribing to the rss feed for a blog or forum is generally more useful for getting notifications about new posts than monitoring existing posts.\n\nmy.opera.com is just so awesome with this stuff. I get instant notification of everything so I can stay engaged in the site. Not only that, but since I get a notification for each comment, I can open the link from each notification in a new tab. This allows me to have each comment focused in a separate tab, which makes things easier to process.\n\nmy.opera.com just presents all this stuff in a very accessible way. I love it.\n\nI like email notifications better than rss feeds because emails get stored on my IMAP server. With feed messages, only so many are stored on the feed page and the older ones only exist locally on my computer. Feeds are good, but I like having the subscription list on the site, not in my browser.\n\nIn short, I rely on email almost completely to get *instant* notification from all kinds of lists, sites and services. I would love for stackoverflow to have a subscribe button right out in the open on every page that gives me instant notification of new answers (and optionally new comments and optionally edits). That would be so awesome. The experience at my.opera.com is much better in this area."}, {"author_name": "menachem", "gravatar_hash": "345d8e4d4c819fd8af141e26a85be31e", "author_url": null, "date": "Oct 09, 2011", "message": "I would love a feature to get notified every time someone else posts an answer/comment to a question you answered. I've you've invested enough time into the question to give an answer, you might be interested in what other people have to say."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Oct 10, 2011", "message": "That green arrow is definately snag-it."}]}