{"response": [{"author_name": "Xavi", "gravatar_hash": "4df1cfae6e8c7fbdb013818785318aa7", "author_url": "http://xavi.co", "date": "Oct 19, 2011", "message": "Jeff, when you have a guest on the show, please let them talk.  We understand you have thought about this a lot, but the purpose of guest to provide a new prospective.  Constantly talking over your guest completely defeats the purpose."}, {"author_name": "Christopher Allen-Poole", "gravatar_hash": "4092d1b87964c221b032b0c6e28bffe3", "author_url": "http://allen-poole.com", "date": "Oct 19, 2011", "message": "+1 to Joel's point vis-á-vis learning the code through not asking questions. That is a policy we should all follow and <a href=\"http://www.allen-poole.com/wordpress/2011/10/what-i-look-for-in-a-co-worker/\" rel=\"nofollow\">look for</a>."}, {"author_name": "Doug T", "gravatar_hash": "680652ec4feb1969c39cfba008214ea9", "author_url": "http://ilearnstuff.blogspot.com", "date": "Oct 20, 2011", "message": "The problem with \"gamifying\" is you're not reaching the people who simply don't care. THEY'RE the ones working jobs they hate and producing code that nobody is proud of. They're the ones you need to reach somehow. And you can't trick them into caring with rewards. They may do what it takes to get a reward, but ultimately they don't care about the end result. Sure those who do care will have fun in whatever game you want to create out of it and may find it useful. They'll exchange fun useful info via stackoverflow because they like being smart, useful, and showing off. They'll plow through hell, high water, wait eons and endure all sorts of other unpleasantness to get the result they care about. They don't need a game to guide them. \n\nAnd sure some of the non-intrinsically motivated may even be intrinsically motivated by something else. And maybe they should go do that. But maybe they're intrinsically motivated by learning about 19th century Turkish Army uniforms. But here lies the rub. Economics is the real problem. They'll never get a job doing that. They have kids to feed. They need to BS their way through whatever career they can tolerate that pays well and gets health care and gets the kids through school. Maybe that's hating being a software engineer. Maybe that's hating being a dishwasher. Whatever. They need the money, and gamification can't fix the fundamental economics at play.\n\nNot to mention its so yuppy-esque of us to project our own love for our job and life onto every possible profession out there. The guy who made our iPhone is certainly not going to be excited about a game for the uber-complex battery installation procedure he does 5000 times a day. The guy who delivers newspapers doesn't have the romantic life depicted in the NES Paperboy games, no matter how much we try. Its just work that needs to get done and you either get a feeling of satisfaction from it or you don't."}, {"author_name": "cwallenpoole", "gravatar_hash": "1186a46e65dbea4c8900d524c613f926", "author_url": "http://allen-poole.com", "date": "Oct 20, 2011", "message": "@Doug Actually, as someone who is not always fond of his current position, I have to say that, for a while, I found quite a bit of satisfaction, and more than a little bit of relief, in helping out at StackOverflow. I was able to get 16,000 points in 100 days and the game kept me coming back.\n\nNow, I've toned it down a bit since then. I've started doing more consulting work, and I've begun to do some serious blogging, but none of that would have happened were it not for SO. My involvement with SO would not have happened but for the game component. Somehow (after being a member for 2 years without making a peep), I realized that if I took the time and energy, I could do really well at this, and all of the little rewards that they talked about in the podcast <em>really</em> helped. Unexpected badges were exciting, getting close to different goals was awesome too. (I wish they would publish our percentiles in the different tags, because knowing that I was in the top 10% for PHP really helped me get involved too).\n\nI will even go so far as to say that the game was a redemption. And I was definitely tricked by the rewards.\n\nAs to the argument, \"Gamification won't help people who hate their jobs,\" you're right. But my experience is that if someone really hates something, he won't really be interested in doing things the right way anyway. Hell, that's part of what hate does. Fixing should not be part of Stack Overflow. That's a job for a religion-focused stack exchange like Christianity or Judaism.\n\nAnd as to the idea that the people who work in factories will not be interested in gamifying their work, well, that argument is specious. <a href=\"http://www.kmjn.org/notes/soviet_gamification.html\" rel=\"nofollow\">By some accounts</a>, that was more or less how Stalinist Russia managed to get any work done.\n\nI'm sorry if you, or those near you, don't find your work terribly enjoyable, but that is not really the issue here. The goal, as near as I have seen it, is to get the people who would normally sit out to be a little bit more involved. Once they have passed that initial threshold of non-motion, then the incentives are there to keep that person involved.\n\nOn a more religious note, I do feel compelled to say that if someone is intent on being miserable, that person will almost certainly continue to be miserable. If the person is intent on being cheerful, it is very likely that they will be cheerful.\n\nSincerely,\n-- Chris Allen-Poole\n\nP.S. \"Non-intrinsically\" is \"extrinsically\""}, {"author_name": "Pete W", "gravatar_hash": "00f20a5ab37ee65957d1ebf8aad8f09f", "author_url": null, "date": "Oct 21, 2011", "message": "I came here to say the same as Xavi. I'm 20 minutes into the podcast and the majority of it has been Jeff talking at length. Several times he's talked over James, who was trying to get a word in. \n\nI hope the rest of the episode is better."}, {"author_name": "THenrich", "gravatar_hash": "886427a445a180eb6618d77ee4ec4894", "author_url": null, "date": "Oct 21, 2011", "message": "The SO podcast doesn't seem to be fed from IT Conversations anymore."}, {"author_name": "Pietro Polsinelli", "gravatar_hash": "5198744cd329b6dfdb9e39b4f9794cd1", "author_url": "http://http.//pietro.open-lab.com", "date": "Oct 22, 2011", "message": "Beautiful podgast, very interesting angle on gamification. Thanks."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "https://profiles.google.com/codinghorror1", "date": "Oct 23, 2011", "message": "I felt like there was a lot to cover, I had a long list of things to talk about. If you want to hear more Extra Credits, please listen to the episodes referenced -- we exhorted everyone to do this 3 or 4 times in the podcast.\n\nS1, Episode 17: \"Easy Games\"\nhttp://penny-arcade.com/patv/episode/easy-games\n\nS1, Episode 18: \"Skinner Box\"\nhttp://penny-arcade.com/patv/episode/the-skinner-box\n\nS2, Episode 4: \"Achievements\"\nhttp://penny-arcade.com/patv/episode/achievements\n\nS2, Episode 9: \"Tangential Learning\"\nhttp://penny-arcade.com/patv/episode/tangential-learning\n\nS2, Episode 10: \"Gamification\"\nhttp://penny-arcade.com/patv/episode/gamification\n\nS2, Episode 11: \"Gamifying Education\"\nhttp://penny-arcade.com/patv/episode/gamifying-education\n\nS3, Episode 4 + 5: \"Game Addiction\"\nhttp://penny-arcade.com/patv/episode/game-addiction-pt.1\nhttp://penny-arcade.com/patv/episode/game-addiction-pt.2\n\nI can't recommend these highly enough. You'll get the extremely condensed version in the SE podcast -- reflecting our take on these topics -- but Extra Credits  has far more detail than we can possibly cover in a 1 hour podcast."}, {"author_name": "Elena", "gravatar_hash": "3b702dacc7bf30bf39b6b0026110edbb", "author_url": null, "date": "Oct 26, 2011", "message": "This was one of the best audio commentaries that I have ever heard. Gamification, the Skinner box, the Industrial era attitude of \"if you're not suffering, you must not be doing it right\", an education system based on subtracting points when it could be adding points, how we are being manipulated by corporations as they gamify their advertising, a sense of agency - this was all fascinating food for thought. Great, intelligent analysis by all involved. Thanks! I'll definitely check out the Penny Arcade episodes."}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://patrickmcelhaney.com/", "date": "Oct 28, 2011", "message": "Gamification has come up often on http://ux.stackexchange.com/ , which is probably a better home for the subject than Game Developers."}, {"author_name": "eqwe", "gravatar_hash": "9ef2ea6d536ddbd919ddfdcce5b80f87", "author_url": "http://www.yyy.in", "date": "Nov 08, 2011", "message": "qewwq"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "Nov 10, 2011", "message": "Please, please, please let interesting guests get a word in edgewise.  The first part of this episode is soooo uncomfortable."}]}