{"response": [{"author_name": "Christopher Allen-Poole", "gravatar_hash": "4092d1b87964c221b032b0c6e28bffe3", "author_url": "http://allen-poole.com", "date": "Oct 26, 2011", "message": "As someone who has worked in Pharma for the past four years:\n\n* I really wonder if it would even be possible to get medical doctors invested in this site in even the distant future through \"overlapping circles.\" They are a reach market which should be targeted to get real investment. It was our experience that it was difficult to get referrals from within the community, but then, we were advertisers.\n* A good deal of the pharmaceutical research is confidential/secretive. That will cause problems in creating an open community.\n* You will need lawyers to at least make sure that you have appropriately navigated medical law -- if a doctor excessively endorses a product that can have legal implications in some circumstances. I don't know what that might mean for a site like SE, but this is something which should be looked at.\n* If you do get doctors involved, I suspect that it will be difficult to get advertisers -- in addition to the comment above, there are some very dramatic legal problems with advertising to doctors. This actually was a major cause for the failure of the site medicaltidbits.com.\n\nI did a little more extensive writing on the <a href=\"http://www.allen-poole.com/wordpress/articles/stackoverflow-moderators/\" rel=\"nofollow\">moderator problem</a>, just a long-winded editorial."}, {"author_name": "David McCllenad", "gravatar_hash": "3992ceb74b3472c8a406a1100d357bf0", "author_url": null, "date": "Oct 26, 2011", "message": "Pivot always reminds me of that Friends episode where they are moving the couch:  http://www.youtube.com/watch?v=9BaOXDobBPw"}, {"author_name": "Nick P.", "gravatar_hash": "63e9c00d834cf45871a1326daaeecccd", "author_url": null, "date": "Oct 26, 2011", "message": "Glad you brought Eric on!"}, {"author_name": "Doug", "gravatar_hash": "a81a108522f894bbe6c6d14d0d90739b", "author_url": null, "date": "Oct 26, 2011", "message": "Twins. Let me speak from experience (3 year old twins plus a 7 year old). In a way Jeff can understand.\nTwins != baby * 2;\nTwins == baby^2;\n\nSleep while you can."}, {"author_name": "djeidot", "gravatar_hash": "3604ace72c84b9daa2df60fec03a760a", "author_url": null, "date": "Oct 27, 2011", "message": "@Doug: 1 baby squared is still 1 baby... right? :P"}, {"author_name": "Joakim", "gravatar_hash": "af2086724492db5f10fc69523eced77e", "author_url": null, "date": "Oct 27, 2011", "message": "\"Starcraft, which is just mining a lot of gold\" - Wait what?\n\nAnd chess is just moving a bunch of pieces..."}, {"author_name": "lucas pottersky", "gravatar_hash": "a645867072faac356a611963c7b1b2f7", "author_url": null, "date": "Oct 27, 2011", "message": "lool, look at this Stackoverflow's copycat:\n\nhttp://answers.jguitar.com/"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Oct 28, 2011", "message": "lucas - this is osqa, it isn't stackoverflow.\nAnd the blog entry is probably not the right place to discuss that?"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Oct 28, 2011", "message": "Jeff 'Stackoverflow hardly ever has bugs' Atwood - except in the early days when we knew Jeff had edited the code by the fact that you couldn't search for 'c++'"}, {"author_name": "Kyle", "gravatar_hash": "e655ab825a4bd2f23b90c85d57c3ee01", "author_url": null, "date": "Nov 02, 2011", "message": "I love the podcast in general but instead of letting Eric Reis talk about his book you guys went into stack exchange minutia. Let the guests talk more!"}, {"author_name": "Tyson", "gravatar_hash": "bf8f45e0eeb60d023dfb474ea6e7eb44", "author_url": null, "date": "Nov 02, 2011", "message": "I would have loved to hear about the continous deployment concept Eric was championing.  I'd like to hear how they do it.\n\nI second that it would have been good to hear more from Eric.\n\nAlso Jeff, you may not play BattleField and Minecraft, but others and I do.  You feel strongly about these playstyles being exclusive, and project that feeling on how you feel the site might work.  It sounds close minded. I play many games of all genres as do so many that I know.  I've found gaming to be a useful reference site.  Give it a fair shake."}]}