{"response": [{"author_name": "nikic", "gravatar_hash": "b4ec98df44deb80b1576283152670358", "author_url": null, "date": "Oct 12, 2011", "message": "\"There are only two kinds of programming languages: those people always bitch about and those nobody uses.\" - That's the main reason why PHP, C and all other popular languages are so much ranted about, but other langs like Go never get much criticism."}, {"author_name": "Tim", "gravatar_hash": "989d2ed50d09a5c071c52ea4423ccc70", "author_url": null, "date": "Oct 13, 2011", "message": "First half is just complaining that 'Language Designers' can't design a language that people actually want to use.  What a shock, someone who lives in academia has no idea what industry needs and feels the need to insult the languages that people actually use because they don't conform to the academic definition of perfection."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Oct 13, 2011", "message": "I think that's a bit unfair. It's not that ivory tower academics (necessarily) design languages that are unsuitable - it's that there are two requirements for a successful language.\n\n1, It has to be familiar (ie look like 'c') - so Java, C#, Python all caught on but lisp didn't. I don't know why Perl managed - probably because it was used by non-programmers!\n\n2, It has to have supporting libraries to actually do some work. The most perfectly language is useless if you can't talk to the screen/network/database/printer etc. So only languages that can use existing 'c' libs have caught on. \nBut it is why the web has been so fertile for new languages - if all you have to do is output html then you don't need much infrastructure.  Perhaps .Net will become a great place to try new stuff (like f#) ?"}, {"author_name": "Alexander", "gravatar_hash": "51a1a1af759c9075f2dd2bdac618cfed", "author_url": "http://www.superoferte.org/", "date": "Oct 14, 2011", "message": "THANK YOU!!! I so appreciate this site.This is news I need to know."}, {"author_name": "Chris", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.shrinkrays.net", "date": "Oct 14, 2011", "message": "Can you be cool *and* be a programmer?"}, {"author_name": "Anthony", "gravatar_hash": "6e98f68591ab3cd8ad706b6f4302e9d5", "author_url": null, "date": "Oct 14, 2011", "message": "@Chris you can be cool... but not a programmer at the same time. It's all truly a state of mind =P"}, {"author_name": "Christopher Allen-Poole", "gravatar_hash": "4092d1b87964c221b032b0c6e28bffe3", "author_url": "http://allen-poole.com", "date": "Oct 14, 2011", "message": "PHP is not all bad. <a href=\"http://www.allen-poole.com/wordpress/2011/10/dont-be-hatin-a-defense-of-php/\" rel=\"nofollow\">Don't be hatin'</a>."}, {"author_name": "Annoying", "gravatar_hash": "4fdce145bab6d27d69e34403f99fd11c", "author_url": null, "date": "Oct 15, 2011", "message": "While the podcasts are appreciated, you know what is REALLY annoying? How the speakers constantly interrupt and talk over each other..."}, {"author_name": "Adam", "gravatar_hash": "41abd662006cfff4748c40d983674631", "author_url": null, "date": "Oct 15, 2011", "message": "That was one of the best SE podcasts for a while. I really enjoyed Joel and Paul geeking out over language design and trading opinions about startups. Paul was an excellent guest: smart and able to challenge Joel without being rude or overbearing."}, {"author_name": "Mark", "gravatar_hash": "ca610ae24db70bdcc576716dd17b87d6", "author_url": "http://stackoverflow.com/users/292219/mark-mclaren", "date": "Oct 17, 2011", "message": "I really liked Paul’s interpretation of Rice's Theorem: \n\n\"Anything that is interesting can't be rigorously analysed!\""}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Oct 18, 2011", "message": "Heh. As a mainly PHP developer who started with Pascal and Delphi back in the day (and is itching to delve into something new!), I can confirm many of the criticisms you guys make - especially dynamic typing, and the fact that most people using it don't have a programming background. It's not a good language to start programming with, for sure. Still, it does have its uses in the hands of a disciplined developer; starting with PHP 5, it is possible to create really good OO code in it; and there is no better way to deploy apps quickly, and dirt cheap in terms of hosting and supports. I agree it's not a greatly designed language in many respects, but a lot of what the web is today is built on it there's no need to hold your nose too high.\n\nWhat is really sad, though, is the lack of quality learning resources for the language, and the amount of crap code people come up with every day on SO is depressing. But if PHP weren't the choice of those coming from design, learning HTML and then PHP as their first experience, it would be some other language... \n\nAnyway, a very interesting and entertaining conversation!"}, {"author_name": "Joe Fitzsimons", "gravatar_hash": "e0aa5c01fbd1313fbd1bf7dd48526ea7", "author_url": "http://blog.jfitzsimons.org", "date": "Oct 18, 2011", "message": "@Christopher: Rather hilariously when I click through the link to your defense of PHP, right at the top of the page there is a PHP warning from your wordpress stats plugin."}, {"author_name": "Jake McGraw", "gravatar_hash": "033f3c1767386d93b1f17010205e7091", "author_url": "http://jakemcgraw.com", "date": "Oct 18, 2011", "message": "I had this long hyperbole about tools vs products, but you know what? @Chrisopher Allen-Poole nailed it in http://www.allen-poole.com/wordpress/2011/10/dont-be-hatin-a-defense-of-php/\n\nComplain all you want, all of us banging out fugly PHP will keep doing it because we enjoy building things, and not waxing poetic language features. Did Java/Python and building on top of GAE make NewsLabs any more successful?"}, {"author_name": "Jake McGraw", "gravatar_hash": "033f3c1767386d93b1f17010205e7091", "author_url": "http://jakemcgraw.com", "date": "Oct 18, 2011", "message": "http://blog.paulbiggar.com/archive/why-we-shut-newstilt-down/#failing-to-choose-wordpress\n\ntldr; Paul admits building a custom CMS over choosing WordPress was the wrong decision and was largely made because of his disdain for PHP.\n\nLiterally, missing a once in a lifetime business opportunity because you couldn't swallow some PHP. Yeesh.\n\nThis is my main argument against PHP critics. Don't tell me, show me. Show me the C++, Java, Python, Ruby, Dart, Server-Side JS, Lisp or Haskell equivalents to WordPress or Drupal or Magento? Off the shelf, zero config, works everywhere and easily customizable."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Oct 18, 2011", "message": "Well, it's impossible to deny that PHP has some serious problems. And Wordpress won't win any clean code awards internally, and is *fat*... But on the other hand, it's also undeniable that it *works.* If you need to set up a blog, you usually end up with WP. Myself included"}, {"author_name": "Rowan", "gravatar_hash": "69508d56d6f19e31adc0c3f062f262a2", "author_url": null, "date": "Oct 24, 2011", "message": "Easily the best podcast since the early. More like this please."}, {"author_name": "Tim", "gravatar_hash": "35088d991f9fed960fdd0d7de20176d4", "author_url": null, "date": "Oct 26, 2011", "message": "Joel mentioned an article he wrote about the risks of using bleeding edge technologies. I think he called it \"up [something] creek without a [something]\". Does anyone have a link to that article?"}, {"author_name": "Tim", "gravatar_hash": "35088d991f9fed960fdd0d7de20176d4", "author_url": null, "date": "Oct 26, 2011", "message": "Found it. The mention was at 27:40, the article is \"Up the tat without a tutu\". http://www.joelonsoftware.com/articles/fog0000000026.html"}, {"author_name": "S.Malyshev", "gravatar_hash": "b036d052cc50683fd7d372c56f977525", "author_url": null, "date": "Nov 04, 2011", "message": "Where this idea that PHP was \"inspired by VBScript\" came from? PHP has  very little in common with VBScript, except for supporting &lt;% tag (which nobody actually uses) and it doesn&#039;t have &quot;VBScript-like syntax&quot; and I don&#039;t think I have ever seen VBScript ever mentioned on PHP lists as an example to follow. And of course the &quot;default property&quot; in VB described there has noting to do with PHP. \n\nAs for the &quot;not being sure what the syntax for reference was&quot; thing I tried really hard to understand what it could be about and couldn&#039;t. I&#039;m not sure anybody on the podcast could either. \n\nI don&#039;t mind PHP being criticized, but please could it be criticism based on actual knowledge and not something that somebody heard somewhere, probably about another problem with another language and he&#039;s not even sure what he&#039;s talking about? \n\nAs for designing languages, I think it&#039;s a fallacy to think you can predict what people want and build this neat and nice thing that everybody would use and you won&#039;t have to change. In most cases it would not work, so either language would change or people wouldn&#039;t use it. PHP was created for people to use it, not to fit somebody&#039;s notion about how language should look like. \n\nAs a PHP developer I&#039;m sorry Paul felt PHP developers are &quot;poisonous&quot; people. I don&#039;t feel this way but maybe it&#039;s because I can not feel my own poison. \n\nAs for the culture of PHP list being in any way related to Israeli culture - it is particularly funny as people from Israel very scarcely participate in the discussions on the list at all. Again, we get criticism which is completely lacking any factual base."}, {"author_name": "HaskellElephant", "gravatar_hash": "8eb2178645e26d829aaa67925c41b4cc", "author_url": null, "date": "Nov 16, 2011", "message": "I think to say that Haskell never gained any traction is too harsh, judging from the number of haskell packages available over time: http://i.imgur.com/aAbsc.png, it is a growing community. It is true that it isn't truly popular, but there are those who use it every day, just have a look at questions tagged Haskell on stackoverflow!"}]}