{"response": [{"author_name": "trevel", "gravatar_hash": "25aaacae957d6b06189b8a5c814a9ed8", "author_url": null, "date": "May 18, 2009", "message": "And who moderates the moderators? \n\nOr to put it another way, what provisions have you made to deter/correct when you get a rogue moderator?"}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://donnyvblog.blogspot.com", "date": "May 18, 2009", "message": "Are these guys getting paid for this?"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "May 18, 2009", "message": "@Donny V no they are not, only guy payed atm i think is Jarrod"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 18, 2009", "message": "> what provisions have you made to deter/correct when you get a rogue moderator?\n\nLogging, primarily.. I am fairly anti-log, but in the case of moderator actions they are heavily logged."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "May 18, 2009", "message": "This is pretty much my view of what a moderator should do too, which I brought up in the nomination thread.\n\nSpeaking of which, it's been a week and a half into the one week voting period. Who is our new moderator?"}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": "http://www.stackoverthrow.com", "date": "May 18, 2009", "message": "I'd volunteer to be a moderator, but being on a boat (boat-programming)  means I have to share some time at the sails and helm and don;t have the time to spend on SO."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "May 18, 2009", "message": "I hope the moderator won't go off closing all questions he deems 'off topic'. I.e questions about productivity/career/general programming issues. The current close/re-open system does a good job at keeping off topic questions away while also keeping interesting questions (as chosen by the community) open."}, {"author_name": "erickson", "gravatar_hash": "ffbf4e85b8ffbae4e9039b9c0cf07bc8", "author_url": null, "date": "May 18, 2009", "message": "*misses boat-programming*"}, {"author_name": "Oorang", "gravatar_hash": "74c236638d43b713794e529cd59e9aa1", "author_url": null, "date": "May 18, 2009", "message": "Community moderators is fairly brilliant idea and I support it. But might I suggest restricting their access to personal profile information? In the event someone bots themselves mod access I'd just as soon not have that info compromised. \nWould it possible to keep that a privilege reserved for only admins or \"appointed\" moderators? \nI can't really think of a functional reason they would need that info. At the very most they should have access to edit offensive profiles. But I don't think they need my email and birthday? Bit of a privacy issue."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 18, 2009", "message": "> but being on a boat (boat-programming) means I have to share some time at the sails and helm and don;t have the time to spend on SO.\n\nlol. Oh, the boat programming... \n\nhere's some boat programming trivia for you. That photo of the (fake) boat that was in the original post is literally a 10-15 minute drive from here, if even that, at the Richmond marina. You could visit the \"original\" boat from boat programming and do some refactoring!\n\n> But I don’t think they need my email and birthday?\n\nWell, they need access to email because part of moderation is dispute resolution and we like to do that by contacting users directly."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "May 19, 2009", "message": "&gt; We like to do that by contacting users directly.\n\nDidn't Joel have some idea of sending people snail mail to confirm their identity."}, {"author_name": "Robert MacEwan", "gravatar_hash": "11acdd278b6f1b3da35da58f8c88fbfc", "author_url": "http://www.macewan.org", "date": "Oct 12, 2010", "message": "How does one go about volunteering to be a moderator?"}, {"author_name": "Collins", "gravatar_hash": "16995fc9a9473b294e17674ccd057b73", "author_url": "http://mytsupp.info", "date": "Nov 03, 2010", "message": "Moderation by the community is good assuming that the community you are referring to is also screened - as in appointed by the main moderator, also if its a totally public screening a vote system may be used."}, {"author_name": "phil c", "gravatar_hash": "1db75a0dab7fae91c15e655817f7605e", "author_url": null, "date": "Nov 09, 2010", "message": "You were right! I apologize for getting bent out of shape, my praise of WOT, in the hindsight, that a new day can give, was spammish, even though left in the best of intentions!  Its one of those overly zealous actions of the newbie.  Here is my post on the 'superuser.com' ratings page at WOT that I left, along with top marks on the rating scales:\n\n\"Great site! Seems people go out of their way to help, and they take a personal responsibility to keep things in order! I only used it once, but it has to be as good as any help site that I have used!\"\n\nHere is a comment I left on my page:\n\n\"Recently used superuser.com.  Great site!  I guess I got a \"little bent out of shape\" when my praise of WOT was \"edited out\" for being  \"spammish\"' .  In hindsight they were accurate.  No one more fervent than newbie!....\"\n\nPlease forgive me.  You have an awesome resource that I'd like to continue to use, with the blessings of the community and I believe in reciprocating whenever possible!\nPeace AND Blessings! phil (glil@Wot) seattle"}, {"author_name": "toni", "gravatar_hash": "92baf4ce1fa75ad35c3c57a606a17ab5", "author_url": null, "date": "Nov 16, 2010", "message": "i have a question regarding moderators doing edits of someonelse posts.\n\ni posted my first question on stackoverflow today regarding some scala continuation stuff.\n\ni noticed that my post has been edited 2 or three times by the samo moderator correcting minor spelling issues (i typed my post on a mobile device). without adding further value.\n\nis this truely something a moderator is expected to do?"}, {"author_name": "matt", "gravatar_hash": "875b592087c435ab4a8d533cda9b69c1", "author_url": null, "date": "Dec 07, 2010", "message": "@toni Expected to? No. Editing of other's posts is open to anyone with more than 2000 rep. It's not a moderator privilege.\n\n&gt; Moderator votes are binding. Any place we have voting — close, open, delete, undelete, offensive, migration, etc — that vote will reach the threshold and take effect immediately if a single moderator casts a vote. \n\nIt would be better if moderators could *choose* whether their vote is binding or not. With all mod votes automatically being binding they lose opportunities to participate in the community as a normal user when moderation is not actually required."}, {"author_name": "T Duncan Smith", "gravatar_hash": "5a1f1e38a966a7bfdc223ae886974999", "author_url": null, "date": "Apr 30, 2011", "message": "So what recourse do I have if my post is deleted? I made a post that was not only not in violation of any rules I know of, but pretty meaningful. Mark Trapp deleted it. I can't find any way to contact him on his stack page, or I would have contacted him first.\n\nBut should my post really have been deleted? I know he deleted it before I made my edit, but I really am a good witness to the early days of \"agile.\" I would think you would want that at least. Anyway, I can't see anything in my initial post that would warrant a delete."}, {"author_name": "ManjotSIngh", "gravatar_hash": "aa555c2a2020aa0b93a4d2f4c53de4d4", "author_url": null, "date": "May 19, 2011", "message": "Hi,\n\nWhat if moderator take decision doesn't correct or might be decision taken in mis-understanding,there might be politics that people will make a group n start flagging against user.At that time how moderator deal with the circumstance!!!!r person should be allowed to say in his/her defence."}, {"author_name": "Anna Lear", "gravatar_hash": "66c88a90c2bad25fd0eadd696e7a5f50", "author_url": null, "date": "Jun 02, 2011", "message": "@T Duncan Smith\n&gt; So what recourse do I have if my post is deleted? I made\n&gt; a post that was not only not in violation of any rules I \n&gt; know of, but pretty meaningful. \n\nOpen a post on the meta site for the site where your question got deleted, provide some detail on which question you're talking about and why you think the deletion was a mistake. Another moderator can (and will) review the situation.\n\n@Manjot\nSame thing. Moderator decisions can always be disputed on meta."}, {"author_name": "lrq3000", "gravatar_hash": "9275f0e17dc5e423f989ed6bf6cbab11", "author_url": null, "date": "Jun 16, 2011", "message": "Interesting read, but the moderator system isn't very innovant nor foolproof. I think that you ought to make a real moderator policy with a clear view on what moderators can and cannot do (not only technically, but ethically too), and who and how arguments will be settled between moderator vs user's contestations or moderator vs moderator."}, {"author_name": "bingjie2680", "gravatar_hash": "5e0ea9baaa2e521581209355fa7b4ce5", "author_url": "http://yjlblog.com", "date": "Jun 24, 2011", "message": "I think we all have common sense what to moderate and not just moderate randomly and unreasonably. it is a community of trust."}, {"author_name": "Sue", "gravatar_hash": "d51548078a95619b23c9afb9e13e7de0", "author_url": null, "date": "Aug 26, 2011", "message": "How can you get a moderators decision checked when you are unable to place a question on the meta site because you do not have enough rep points due to the moderators actions?"}, {"author_name": "John Drefahl", "gravatar_hash": "7b9b42ae13385ec98f5e990a13537455", "author_url": null, "date": "Aug 29, 2011", "message": "I normally don't have a problem with Moderators, but when their egos actually hinder the process of discovery it hurts everyone one.\n\nCase in point, I post a link to an app that is a solution to hundreds of people who are unable to get their Sony X10s to be recognized by Android ADB.  The tool is hosted on Rapidshare.\n\nPeople, half the apps on the net are hosted on a Rapidshare!\n\nNone the less, I pushed the file to my own server for hosting.. and gave access to individual drivers via my drop box.. yet, Now I can't post answers.\n\nMods grow up, and please.. reinstate my account to I can save countless others from wasting 10 hours trying to find drivers and apps to allow ADB recognition of Android Prototype Devices."}, {"author_name": "Anna Lear", "gravatar_hash": "66c88a90c2bad25fd0eadd696e7a5f50", "author_url": null, "date": "Oct 01, 2011", "message": "@TTB: What are you trying to get out of? Stack Overflow? \n\nTo delete your account on any Stack Exchange site, follow the procedure described here: http://meta.stackoverflow.com/questions/5999/can-i-delete-my-account\n\n@Sue: Same as above if you want to delete your account. Disputing moderator actions can be done by flagging the post that you think was acted on incorrectly or by posting to the site's meta."}, {"author_name": "Sue", "gravatar_hash": "d51548078a95619b23c9afb9e13e7de0", "author_url": null, "date": "Oct 05, 2011", "message": "Thanks for the reply Anna.I was unable to post to the site's meta because I didn't have enough points. Aside from that it is to late now because the post has been removed now. It was strange because the moderator's reasons contradicted each other and I had also received votes for the post, so it was sensible and appreciated by other users. I can only think that the moderator in question was drunk with power and abused it."}, {"author_name": "Jerry", "gravatar_hash": "072b3b981a4e5bd0f572159a2c9df7cb", "author_url": null, "date": "Oct 13, 2011", "message": "A few days ago, I found an answer on serverfault that I thought was good, and that asked me for my improvement. So I added a good chunk of answer to it.\n\nSince I don't have edit privileges there, it went into some queue, where a moderator rejected it with the somewhat strange claim \"that my edit would change the answer too much.\"  But the edit didn't change the answer at all, which was left completely intact, but clarified it, and added some important details regarding how to secure the answer.\n\nI was not notified of this rejection.  And yes, since I am unpaid just as much as the moderator, it somewhat rankles that this obviously good faith and correct edit is just rejected.\n\nI will remember this anytime stackoverflow or one of its sites ask me to improve an answer.  The response will be no.  It's a waste of time.\n\nSo I think it's a shame that there seems to be no way to directly address/email/im/notify a moderator or anyone that can reject an edit, and nothing in the community that suggests a moderator should directly communicate with the user he is moderating."}, {"author_name": "Chris S", "gravatar_hash": "71838b1ccd71421a3fc3db6612ba83c1", "author_url": "http://stoneyforest.net/~chris", "date": "Oct 13, 2011", "message": "@Jerry\n\n&gt; the edit didn’t change the answer at all\n\nThe edit added substantial commentary to the existing answer. While the core recommendation remained the same, the Answer was substantially modified to include new opinions and view not expressed by the original author.\n\nMay I offer our sincerest apology that you misunderstood \"improve an answer\". It is not to say that the answer should be vastly expanded beyond the original author's intent. It is asking to fix obvious minor errors, such as typos, grammar, formatting, and occasionally style (even style \"corrections\" can be subjective).\n\nIt is possible to contact many active members of the community though chat (link at the top of each site). A rejected edit suggestion can not be reversed (at this time), but they can often help."}, {"author_name": "John Gabriel", "gravatar_hash": "80a8a9b6d3ec5759ab345b4ee91a6f9d", "author_url": "http://thenewcalculus.weebly.com", "date": "Nov 04, 2011", "message": "The link I provided contains the answer to the question I had commented on. It's too bad that you are deleting it because your readers would learn much more than can be otherwise learned on a site like this."}, {"author_name": "Sarin Jacob", "gravatar_hash": "21d927d3e83a654345170cd870b2b6b5", "author_url": null, "date": "Nov 11, 2011", "message": "Hi,\nMy answers in stackoverflow are being deleted because I give a site link for reference. I give a tutorial site for getting better understanding to their problems. Curreently I am being banned from sending any questions. I could not find any links to reply back, How can I report my Issue???\nThe site which I gave was refered in apache struts site itself."}, {"author_name": "iEvolutiOne", "gravatar_hash": "bd01b09a4809393d7db933af05296341", "author_url": "http://w2sparta.blogspot.com", "date": "Nov 17, 2011", "message": "I answered 1 question while passing through which the moderator happened to describe part as a 'rant,' and subsequently put a minus 1 and deleted part. I edited it put a verified link to the answer and post became a comment and deleted. I do not want a + or -, nor an 'Editors' badge, nothing really, but to moderators Kyle and Nathan: Here you can cover our words and always come out the champion (they assume you dealt with something and protected them). So on behalf of a dose of reality ... Welcome to Sparta (This and the posts will be displayed and linked to my blog W2Sparta. If you comment there, I WILL POST IT)"}, {"author_name": "marc11h", "gravatar_hash": "914b71331f0b3d9fef890a407192d594", "author_url": null, "date": "Dec 08, 2011", "message": "I had a post inaccurately closed as a duplicate by a moderator. I believe that there was not an appropriate review of the variations in the coding approach to assess the two posts a duplicates, in fact they were not at all from the same web page.\n\nI did have an issue with the StackOverFlow site not allowing me to ASK a new question. Everytime I clicked the link, one of my previous questions was dispalyrd in edit mode. Even after a reboot, and returning to the site the problem persisted. \n\nThe only way to finally clear that post was to edit it enough to submit it as new post. I then marked it as answered. (My rep wouldn't let me admin the post any other way.) Another user copmlained about a dup post and the moderator closed another unrelated post as a dup.\n\nWhat's up with that? I don't even seem to have a way to contact the mod and get this cleared it up."}, {"author_name": "Tony Dallimore", "gravatar_hash": "7647caae40a358f96e6c8e6a2bf29aa4", "author_url": null, "date": "Dec 14, 2011", "message": "I was attempting to answer a question but it became clear, via an exchange of comments, that the question did not accurately reflect the OP's requirements.  I had too many questions for a comment so asked then in an fake answer.  The OP responded by rewriting the question so it was clear.  I deleted all my comments that related to the original question.  I rewrote my true answer to reflect the new question and attempted to delete my fake answer.  When I clicked the delete button it turned into a vote-to-delete button which did not seem appropriate.  Instead I replaced the text with an explanation of why the answer was no longer relevant and flagged it.\n\nA moderator, NullUserException, deleted it but left a comment saying I could of used the delete button.\n\nThere is, as far as I can tell, no way of responding to a moderator's response to a deleted answer.  Is there a way of doing so other than this forum?\n\nWhy cannot I delete my own answers?"}, {"author_name": "naresh", "gravatar_hash": "40c9c203add6529ef9e9027129372e7e", "author_url": null, "date": "Mar 18, 2012", "message": "How can i directly interact with the experienced android developers personally means by the email id."}, {"author_name": "Lynn Crumbling", "gravatar_hash": "3dcfd60c6ca9b117a522163504ab431f", "author_url": null, "date": "Mar 29, 2012", "message": "Lately (the last 6 months), it seems like so many users have taken to adding comments to this nearly 3-year-old blog post discussing the ideology on moderation. \n\nThis would be fine, except the comments in question such as \"why was my  \" are all best suited for meta.\n\nIf you your changes were moderated, and want to talk about it, do not post here. Click on the \"meta\" link in bar on the top of SO, and post in there."}, {"author_name": "Lynn Crumbling", "gravatar_hash": "3dcfd60c6ca9b117a522163504ab431f", "author_url": null, "date": "Mar 29, 2012", "message": "Post mechanism ripped out part of my last comment. Second sentence should read:\n\nThis would be fine, except the comments in question such as \"why was my [edit|post|answer] [deleted|closed]\" are all best suited for meta."}, {"author_name": "MAC", "gravatar_hash": "d83636788cc092a035f825ebc42f1b39", "author_url": null, "date": "May 23, 2012", "message": "Moderators are like project managers. Something you think you don't need until the need arises."}, {"author_name": "Tim", "gravatar_hash": "3f0d9090f8a3fa9ba5df8417fc85db91", "author_url": null, "date": "May 26, 2012", "message": "That's the polite way of noting that project managers are like colostomy bags."}, {"author_name": "Jer", "gravatar_hash": "7debd72a4995ec027ad87943b7d11edb", "author_url": null, "date": "Jun 24, 2012", "message": "The mod \"QAven Dreamer\" deleted my well written answer failing to grasp the relevance of the totally legitimate useful insights which I had implied.  I question the integrity of mods who lack the intelligence to moderate properly and this persons ignorance is not healthy for the community. \n\nI was not even able to explain to \"QAven Dreamer\" what he/she had overlooked so irresponsibly and I'm not impressed at all. \n\nI would expect this comment too will get deleted but I realize it is unfair of me to judge the integrity of all the mods based on the actions of one. \n\nHave a great night!"}, {"author_name": "salmanasad", "gravatar_hash": "fc8a8d3ddbfdd99b3c64daeb5a52602b", "author_url": null, "date": "Jun 28, 2012", "message": "Hi,\n248 posts with the same problem were posted, i tried to post same answer on all posts and my account is blocked and my posts got deleted. Poor set of rules. why you allow multiple questions having same problem but not same answer for all those duplicate questions?"}, {"author_name": "Soonts", "gravatar_hash": "85e40659204cfce6af6416271727aedf", "author_url": "http://const.me", "date": "Jul 09, 2012", "message": "OK, theoretically it's fine.\n\nPractically however, what should I do if the moderator removes my answer?\nThat's by the way was the only real answer to a question (the accepted one was just a discussion)?\n\nOf course I've clicked \"flag\", and of course it was ignored."}, {"author_name": "James Mortensen", "gravatar_hash": "d4518e6223a1a82f53dc4919d0165151", "author_url": "http://pm.stackexchange.com/users/34/jmort253", "date": "Jul 27, 2012", "message": "@Scoonts - As mentioned elsewhere in the comments, bring up the deleted answer on the site's meta. Moderators have a tough job that involves taking action, and very few users respond to a deleted post with complete acceptance.\n\nPosting on meta serves 2 purposes:\n\n1. It gives you an opportunity to make your case for having the answer reinstated. Moderators are human and sometimes make mistakes.\n\n2. It gives you an opportunity to learn why your post was removed and what you can do in the future to prevent that from happening.\n\nRemember, the main reason people oftentimes exclaim that Stack Exchange was a helpful resource for them is because we do a great job eliminating noise. Hope this helps."}, {"author_name": "Jagra Arun Garapata", "gravatar_hash": "0e10a1ed960980b6616f150135150389", "author_url": null, "date": "Aug 15, 2012", "message": "I have a problem with a moderator, that I believe has acted rudely and inappropriately in a comment to a well formed question.  He made no comment or suggestion about the question itself.   He instead made snarky comments because I had added the word update and a date and time to an edit rather than relying on the edit log.  Hardly a devastating breach of rules or even tradition.\n\nI emailed his published email to address my concerns discretely and privately.  He responded by suspending my account and taking away all (but 1) of my reputation points which blocks me from either flagging the comment on the question I believe anyone would find offensive or posting my concerns more publicly on meta.  \n\nThis seems increasingly like an abuse of moderator power and far outside the spirit of the sites.  \n\nI would appreciate if this issue would receive a fair review by other moderators on the specific cite or by someone from SE itself.\n\nHappy to provide additional details.  What do I do now?  Please feel free to contact me at the supplied email address."}, {"author_name": "Ramchandra Apte", "gravatar_hash": "050ae0ed6f7fa82b40e8672ea26b43c3", "author_url": "http://ramchandraapte.blogspot.com", "date": "Aug 25, 2012", "message": "Is being under 13 (but accepting the privacy policy) a valid reason for suspension?"}, {"author_name": "nicholas_jordan", "gravatar_hash": "6fd171430d7b32e8e296228e3e5a64f8", "author_url": null, "date": "Oct 07, 2012", "message": "@salmanasad [Jun 28 2012] people do not realize that for some 248 posts if done to the rules is humanly possible therefore assume it to be an intruder ~ it bears congruence with processor handling nulls on some arch / ignoring them on others"}, {"author_name": "Justin Buser", "gravatar_hash": "dc71aa6ccecacc27dd5529043844596e", "author_url": null, "date": "Oct 19, 2012", "message": "The SO community moderation has potential but it needs to be significantly restructured. I feel like I'm getting directed to stack exchange / overflow more and more these days and leaving shortly thereafter feeling disappointed and or angry / upset.  \n\nI see this kind of thing ALL THE TIME in here:\n\nhttp://stackoverflow.com/questions/3573266/android-binder-example \n\nThe poster had asked a perfectly reasonable question, a question in fact that was closely related to information that I was myself looking for. Unfortunately Will the \"Moderator\" had decided to \"close it\" citing this pile of nonsensical gibberish as the reason:\n\n\"As it currently stands, this question is not a good fit for our Q&amp;A format. We expect answers to be supported by facts, references, or specific expertise, but this question will likely solicit debate, arguments, polling, or extended discussion.\"\n\nIf the irony of this \"reasoning\" doesn't immediately register after having read the users question I'll break it down for you:\n\n\"As it currently stands, this question is not a good fit for our Q&amp;A format.\"\n\nThe question is about the reasons for using C vs C++, which for the more junior programmers out there are the two languages in which 99% of Stack Overflows occur, subtle irony to be sure, but amusing enough to be worth pointing out. \n\nThe real kicker though is the fact that he follows it up with: \n\n\"We expect answers to be supported by facts, references, or specific expertise, but this question will likely solicit debate, arguments, polling, or extended discussion.\"\n\nExpect answers to be supported by facts, references, or specific expertise. It would have been exceedingly easy for the poster to respond with: http://stackoverflow.com/faq , a document which any intelligent person would agree clearly welcomes his exact type of question, essentially providing the aforementioned fact/reference/etc... \n\nUnfortunately however, instead of allowing the user to elaborate or rephrase his question, Will  shut him down out of hand. NOT because the question had generated an unwelcome slew of opinion based responses / arguments, but because it was Wills OPINION that the question MIGHT LEAD TO EXTENDED DISCUSSIONS.\n\nIt's hard to believe that this guy, who apparently has no expertise outside of some rudimentary .NET ( http://stackoverflow.com/users/1228/will?tab=questions&amp;sort=views ), has been given the power to unilaterally decide whether or not another user has the right to ask a question in an open forum like this.  I'm getting angry again now, so I'll leave it at that."}, {"author_name": "Eric", "gravatar_hash": "76ced421878bd595cffecdaf995827c8", "author_url": "http://klickitmedia@gmail.com", "date": "Nov 04, 2012", "message": "\"The short answer is, as little as possible!\"\nI disagree with this post.  They do as much as possible to look good, edit posts, flag posts, when I see some of theirs  way more off topic and subjective."}, {"author_name": "Subrata Chattopadhya", "gravatar_hash": "9a609493166f05945254f9e180dfd191", "author_url": null, "date": "Jan 08, 2013", "message": "Robert closed my question stating that there are similar question answered, I went through every single one of them and couldn't resolve my problem, so I asked. I really appreciate if you close a question, make a reference to another question that really answer my question."}]}