{"response": [{"author_name": "trevel", "gravatar_hash": "25aaacae957d6b06189b8a5c814a9ed8", "author_url": null, "date": "May 30, 2009", "message": "Some warning that it updates the profile might be nice (assuming there isn't) -- as I can see someone using this to tag a friend with the responses, and thus updating their own profile is definitely an unwanted consequence of using it."}, {"author_name": "martin", "gravatar_hash": "10d9b4ad7e219328dc37fc9afac9aa10", "author_url": null, "date": "May 30, 2009", "message": "Why isn't it possible to subscribe to other questions (not asked by me)?"}, {"author_name": "David Schmitt", "gravatar_hash": "f41b1342c973956dba590327908cb349", "author_url": "http://stackoverflow.com/users/4918/david-schmitt", "date": "May 30, 2009", "message": "Why isn’t it possible to upvote trevel's answer? ;-) (and martin'S as well, if we're at it)"}, {"author_name": "dbr", "gravatar_hash": "edf857d71f672d8f411ef6b8376316b8", "author_url": "http://neverfear.org", "date": "May 30, 2009", "message": "..yet still no RSS feed for a users recent responses? :("}, {"author_name": "configurator", "gravatar_hash": "483f450d6f4eb49aed37ee44a35470eb", "author_url": "http://blog.tapuchim.com/", "date": "May 30, 2009", "message": "If you can subscribe to a single question/answer, I'd like an option to subscribe to a non-daily-digest, i.e. a mail as soon as there's an answer. I'd also like to see comments in the mail. On the other hand, that would make actually visiting the site and checking redundant..."}, {"author_name": "aleemb", "gravatar_hash": "a61faad7455911544b828476e9f21a10", "author_url": "http://aleembawany.com/", "date": "May 30, 2009", "message": "Instant notifications would be nice. I once wrote a question that people felt should be a community wiki but by the time I got back to it 10-15 minutes later, it was already closed and it seems like a waste of a perfectly interesting question [ http://stackoverflow.com/questions/749358/what-was-stack-overflow-built-with-closed ].\n\n&gt; And don’t worry — as with every email we send, there is a one-click global unsubscribe if you don’t want to get any more emails from us.\n\nIt's easy to trust SO to do the right thing.\n\nI still get replies from theads on MIX09 site I subscribed to months ago. The email on Contact Us page doesn't work. There is no unsubscribe option on the site or in the emails that I get. I believe the first email did have a link but I deleted that one. I used to get a spam message every 2-3 days until I set a filter to block all their mail just recently."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 30, 2009", "message": "> Why isn’t it possible to subscribe to other questions (not asked by me)?\n\nUse RSS, it's linked at the bottom of every page ... email is a courtesy intended for the question owner."}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "May 30, 2009", "message": "Is there anything in place to stop a user from putting an arbitrary email address in that field? That is, is the email address validated before regular emails are sent to it?\n\nI think the checkbox prompt should be just \"[ ] Notify me daily of any new answers\" or perhaps \"[ ] Notify me (jatwood@...) daily of any new answers\" with no option to change the email. Changing the email here seems like a suboptimal user experience."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 30, 2009", "message": "Greg, we don't have email addresses for a lot of users (unlike 99% of internet sites that have registration, we don't require it), so this is an opportunity to opt in to email in the general sense as well.\n\nI just checked the data:\n\n# of registered users who have accessed the site in the last 60 days:\n\n50,269\n\n# of registered users with no email:\n\n17,140"}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "May 31, 2009", "message": "# of registered users with no email and non zero rep?"}]}