{"response": [{"author_name": "Oliver Giesen", "gravatar_hash": "13c44ef2d9d79dcca761a584be868def", "author_url": null, "date": "May 07, 2009", "message": "Right. Great!\n\nNow please switch the order of the \"ignored\" and \"interesting\" sections (there are already several duplicates about this on UV).\n\nI like to use the interesting tags also as a navigational instrument but as I also have a quite large list of ignored tags I always have to scroll down first before I get to the interesting tags. This would be much easier if simply the interesting tags came first and the ignored tags only somewhere further down - where I could properly ignore them, so to say. ;)"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "May 07, 2009", "message": "First, kudos on the new feature. This will make it easier to pare down my list of interesting/ignored tags.\n\nHowever, with this new partial matching feature, you might want to also rethink the edge case of what happens when a question has both interesting and ignored tags, or when a single tag is triggered by a partial match in both interesting and ignored. The current behavior, which is to have both the orange background and an opaque white foreground, is probably not the correct approach. Also, if you have \"Hide Ignored Tags\" checked in your preferences, the question won't appear at all.\n\nWhile this may seem like the correct thing to do, personally I would prefer the approach that an interesting tag supersedes an ignored tag, for much the same reason why it's a bigger deal for a spam filter to have false positives than false negatives. Ideally I should only be able to look at questions I'm interested in on Stack Overflow, but I would much rather see one that I'm not interested in than to not see one that I am interested in."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 07, 2009", "message": "> personally I would prefer the approach that an interesting tag supersedes an ignored tag,\n\nThen, apparently, you need to engage in fistfights with the 50% of users who want it to work the OTHER way.\n\n(just based on UserVoice feedback..)\n\n> Now please switch the order of the “ignored” and “interesting” sections (there are already several duplicates about this on UV).\n\nok done! will go tonight."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "May 07, 2009", "message": "@Jeff Atwood:\n\nI couldn't find the UserVoice comments you're referring to. Most of the talk on UV about interesting and ignored that I can find is about either placing the interesting tag list above the ignored tag list on the front page. However, it does look like Sam Hasler made this suggestion many months ago and had it marked as \"completed\":\n\nhttp://stackoverflow.uservoice.com/pages/general/suggestions/38895-ignored-tags-shouldn-t-be-hidden-if-they-re-also-interesting?lang=en\n\nIn any case, if there is indeed legitimate opposition to making interesting supersede ignored, why not allow people to have it whatever way they want by including it as a preference?"}, {"author_name": "Crossbrowser", "gravatar_hash": "7a72ffed0a1cd0141f4da8587624092c", "author_url": "http://crossbrowser.net", "date": "May 07, 2009", "message": "@nobody_ I'm on the side that would prefer if \"ignored\" tags superseded \"interesting\" tags.\n\nThe way I see it is if the question is about anything that I don't like (or even hate), I don't even want to check it out. Chances are that I won't even be able to answer it anyway."}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "May 07, 2009", "message": "&gt;Thus, in a beautiful kind of synchronicity, we used Stack Overflow to build Stack Overflow, while simultaneously building a web of improved links for future programmers to help find their way.\n\ndo that 65,535 more times and you will cause a stack overflow."}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "May 07, 2009", "message": "Are only asterisks supported? So I can't have an expression for \"any tag starting with java, except javascript\"?"}, {"author_name": "Zhaph - Ben Duguid", "gravatar_hash": "ef3e872b7359633a74dc57bd708fde22", "author_url": "http://www.doodle.co.uk/Blogs/", "date": "May 07, 2009", "message": "I too use the interesting tags as a navigational aid - as it stands at the moment though, the wildcards aren't supported in the urls:\n\nSetting up an interest tag of asp.net* and following it only gets me those questions tagged as asp.net, not those tagged as asp.net*, so I now have no quick way to check out those questions tagged just asp.net-mvc, asp.net-2.0, etc."}, {"author_name": "Keng", "gravatar_hash": "15769bbea999aee421458f52e7c9d011", "author_url": "http://www.TheMacroHook.blogspot.com", "date": "May 07, 2009", "message": "\"We built a thing that .. helps us build the thing.\"\n\nIsn't that some sort of high level evolved quine?  80)\n\nhttp://en.wikipedia.org/wiki/Quine_%28computing%29"}, {"author_name": "dbr", "gravatar_hash": "edf857d71f672d8f411ef6b8376316b8", "author_url": "http://neverfear.org", "date": "May 07, 2009", "message": "Hm, seems like this could cause problems for C* language questions.. http://en.wikipedia.org/wiki/C*"}, {"author_name": "Jared", "gravatar_hash": "5ff1e1b35d1fc13baf08d807fb2097a7", "author_url": null, "date": "May 07, 2009", "message": "@Zhaph\n\nI think I'm having a similar problem. I type asp.net* and it just autocompletes and says asp.net. Basically the feature as described in Jeff's post is not working (Safari 3.0, Leopard) on the right hand side. It works on the preferences page."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://www.johntopley.com/", "date": "May 07, 2009", "message": "Thank you!"}, {"author_name": "Kevin Dente", "gravatar_hash": "23c1e2063688620b75b248e08c0d5c24", "author_url": "http://weblogs.asp.net/kdente", "date": "May 07, 2009", "message": "It's only a matter of time before Stack Overflow becomes self-aware and begins to improve itself."}, {"author_name": "Tom", "gravatar_hash": "31e32ecb7309ad47e1ecdd34f4c26529", "author_url": "http://ritter.vg", "date": "May 07, 2009", "message": "Okay, I think your edits were entirely offbase.  You basically took the top voted accepted answer, deleted its content, and replaced it with better content.  It's saying \"Hey, if your answer is better than someone else's, don't bother posting it, just replace the top-voted answer with your own!\" \n\nI think it's the entirely wrong approach - can you imagine what the site would be like if everyone did that?"}, {"author_name": "Patrick McElhaney", "gravatar_hash": "bd6f67362bcdd7790623d740169d9e67", "author_url": "http://stackoverflow.com/users/437", "date": "May 07, 2009", "message": "@Crossbrowser wrote:\n\n\"The way I see it is if the question is about anything that I don’t like (or even hate), I don’t even want to check it out. Chances are that I won’t even be able to answer it anyway.\"\n\nWell, you don't have to check it out. How hard is it to read the title / tags, see that it's about some thing that you hate, and move on?\n\nThe way the system works now, if a question has both interesting and ignored tags, I don't have an an opportunity to decide whether the question is worth checking out. \n\nAnd frankly, I think the site should cater to those of us who are curious, who won't blindly rule out any technology as /never/ interesting."}, {"author_name": "Paolo Bergantino", "gravatar_hash": "80ae8ec34e9e3e66c5be50733afaa44e", "author_url": null, "date": "May 07, 2009", "message": "Agree about 1000 times with Patrick McElhaney - if a question is about .NET (which I don't know/care for) but it also has a Javascript tag and I'm able to help while seeing some .NET code that I'm not familiar with, all the best!"}, {"author_name": "Jonik", "gravatar_hash": "0bd656eb14c50299b2744f80e69459bf", "author_url": null, "date": "May 07, 2009", "message": "Tom: \"Okay, I think your edits were entirely offbase. You basically took the top voted accepted answer, deleted its content, and replaced it with better content.\"\n\nHeh, I was wondering if someone would bring that up. And right you are; the shortcut they took does not really fit the etiquette of editing posts in my view, because it compeletely changed the meaning of that answer.\n\nhttp://stackoverflow.com/questions/14593/what-is-the-etiquette-for-modifying-posts\n\nI guess the Right Thing to do would have been to add a new answer and just wait it to gather upvotes and perhaps eventually become the top (or even accepted) answer."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 07, 2009", "message": "> You basically took the top voted accepted answer, deleted its content\n\nUtterly untrue -- the original content of the answer IS still there. Go check!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 07, 2009", "message": "> as it stands at the moment though, the wildcards aren’t supported in the urls (when you click on the URLs with the wildcards)\n\nNo, this isn't supported..\n\n> I type asp.net* and it just autocompletes and says asp.net\n\nDon't autocomplete -- hit ESCAPE on your keyboard. If you autocomplete you will erase the wildcard."}, {"author_name": "Zhaph - Ben Duguid", "gravatar_hash": "ef3e872b7359633a74dc57bd708fde22", "author_url": "http://www.doodle.co.uk/Blogs/", "date": "May 08, 2009", "message": "&gt; No, this isn’t supported..\n\nWhere's the \"yet\"? ;)\n\nThanks for switching the order by the way!"}, {"author_name": "Zhaph - Ben Duguid", "gravatar_hash": "ef3e872b7359633a74dc57bd708fde22", "author_url": "http://www.doodle.co.uk/Blogs/", "date": "May 08, 2009", "message": "Added a uservoice suggestion for it:\n\nhttp://stackoverflow.uservoice.com/pages/1722-general/suggestions/184775-allow-wildcards-in-url"}, {"author_name": "Jack M.", "gravatar_hash": "9ecd2f59de5e03ba481723637fc74fad", "author_url": "http://stackoverflow.com/users/3421/jack-m", "date": "May 08, 2009", "message": "One thing that seems \"broken\" to me is that when you click on a wildcard tag, such as \"gwt*\" it takes you to [gwt].  Why not make it take you to the list of all matching tags?\n\nCurrently searching for two tags gives you something like this:\nhttp://stackoverflow.com/questions/tagged/gwt%20gwt-rpc\n\nSeems a fairly simple tweak to make:\nhttp://stackoverflow.com/questions/tagged/gwt|gwt-rpc\nshow questions for either gwt or gwt-rpc, and giving warm fuzzies when you click a wildcard tag.\n\nJust a thought."}, {"author_name": "Tom", "gravatar_hash": "31e32ecb7309ad47e1ecdd34f4c26529", "author_url": "http://ritter.vg", "date": "May 08, 2009", "message": "&gt; Utterly untrue — the original content of the answer IS still there. Go check!\n\nOkay, correct.  But the spirit of the edit was changing the original answer \"Look in the documentation\" to \"Use this plugin\".  Does it matter in this case?  Not really. But it does set a bad example, and I'm sure there are people out there who would do the same thing with more... destructive, manipulative, or egregious results."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "May 08, 2009", "message": "Jeff:\n\nWould you mind closing the UserVoice ticket for Ignored/Interested tag order change: http://stackoverflow.uservoice.com/pages/1722-general/suggestions/136828-switch-the-ignore-interesting-tags-order-it-s-confusing\n\nAlso, it seems like posting a comment on the blog was a more efficient way to get this changed than posting a suggestion on UserVoice.  I assume part of it is that you happened to be looking at the tag code when the blog comment was made.\n\nBut the design of UserVoice seems better tuned to suggestions about new badges and such than to usability issues and bugs.  Anyone can get behind a fun, new feature to vote it up.  But a bug might only be noticed or reproducible by a few people.  A usability feature, like the one you just fixed, might be too subtle for people to notice in their conscious mind but be bugging them constantly in the subconscious.  Popular != important.\n\nWhen I first read the UserVoice ticket by chance, I instantly understood what had been bothering me under the surface.  Now that the tags are reversed, it's like lifting a (very tiny) burden from my mind.  Thanks for the change!"}, {"author_name": "pyrochild", "gravatar_hash": "efc240b92c810467398594d294662e9b", "author_url": null, "date": "May 08, 2009", "message": "\"We built a thing that .. helps us build the thing.\"\nStack Overflow is well on its way to becoming self-aware."}, {"author_name": "Iraimbilanja", "gravatar_hash": "9b4e0447e8d049ba853fe368765f6f76", "author_url": null, "date": "May 17, 2009", "message": "Wow, I just came here to say I really appreciate the feature! One of the best improvements you've done.\n\nIf you do any further work on the ignored/interesting feature, that would rock! =:)\nIt's probably my fave StackOverflow feature because it addresses my biggest pain point - it's hard to find the stuff I'm interested in, and it will probably always be."}, {"author_name": "mafutrct", "gravatar_hash": "a7c22254d91baa9ca18786a9d46549f0", "author_url": "http://mafutrct.wordpress.com", "date": "Jul 14, 2009", "message": "Great feature, thank you. I'm glad SO is working so smoothly."}, {"author_name": "Buy Tights", "gravatar_hash": "09a9c1da5200834acdfc44a2a978b63e", "author_url": "http://www.tighswear.com", "date": "Dec 01, 2010", "message": "Nice, I've just 1.5 hours trying the puzzle of a Jquery selector"}]}