{"response": [{"author_name": "Assaf", "gravatar_hash": "d01891f2b521660ac24839d6473d1d8f", "author_url": null, "date": "May 20, 2009", "message": "Superbly implemented IMO. Thanks guys for taking the time to implement these important features right."}, {"author_name": "Keith Stenson", "gravatar_hash": "939f29a42d144267f88db408af9cca73", "author_url": "http://kstenson.com", "date": "May 20, 2009", "message": "This is a really nice feature, I also agree that duplicate questions are not always a bad thing, people structure questions in different ways. \n\nBeing able to easily find and link duplicate questions is a excellent feature!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 20, 2009", "message": "> Superbly implemented IMO\n\nIt's all Geoff and Jarrod -- they deserve the kudos, I'm only the messenger!"}, {"author_name": "RobWells", "gravatar_hash": "8769281d99f8fe9c208fd6a926c383d1", "author_url": null, "date": "May 20, 2009", "message": "G'day Jeff,\n\nA big thanks to Geoff, Jarrod and yourself for implementing my suggestion!\n\nWhat Geoff and Jarrod have come up with is so much better than what I was expecting. 8-D\n\nI owe you guys a beer next time I'm over there.\n\ncheers,"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "May 20, 2009", "message": "I don't know: it's a big improvement certainly, but imo this still fails to address the worst problems associated with how duplicates are handled.  Namely:\n\n* It still discourages new users (the ones most likely to ask duplicate questions), because their question still ends up aggressively closed.  Ultimately this will come back to bite you.\n\n* It still doesn't link forward from the original, and so the question with least information tends to become the canonical source for the topic.\n\n* It still makes it difficult to update a topic.  'Originals' will become obsolete or dated over time, but if new 'duplicate' questions are always closed right away they don't ever get the chance to have the same kind of community input for the current state of the art on that topic that the original did."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "May 20, 2009", "message": "It is missing the ability to specify multiple duplicates, which is often the case as in http://stackoverflow.com/questions/887213/how-do-you-stop-work-on-a-project-mid-way-coz-the-clients-difficult-and-rude (now deleted).\n\nTwo other comments:\n\n1. Jeff I just discovered you deleted http://stackoverflow.com/questions/871453/which-language-and-or-platform-of-development-gives-you-the-most-fun-as-a-develop. To quote Homer, I give that seven thumbs up!\n\n2. I LOLed at the comment about us being programmers so we're wondering what if there are 5 different close reasons cos I was wondering that before I finished reading that sentence. :)"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "May 20, 2009", "message": "Of course the \"5 different reasons\" scenario isn't the only tie-break situation: \"2 with 2 votes and 1 with 1\" probably comes up more often :)\n\nI love the new feature, but I'd agree with the requests here to allow multiple references, and to create backlinks too. (Ideally the backlinks should be removed if the duplicate is then deleted, of course...)\n\nI'd also ask for the \"suggested duplicates\" to be visible even before the question is closed, as per http://stackoverflow.uservoice.com/pages/1722-general/suggestions/194739-show-potential-duplicates-after-dup-close-votes\n\nBut hey, it's a *great* start :)"}, {"author_name": "Daniel", "gravatar_hash": "ef62e78fd520a622778e3c2d151cc64f", "author_url": null, "date": "May 20, 2009", "message": "@cletus - I would assume that you can chain all of the duplicates together, and thus linking to one of them links all of them together.  (I haven't tried marking anything as a duplicate yet though, so I don't know.)\n\nIs there a way to retroactively apply duplicates to already-closed dupes?"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "May 20, 2009", "message": "hmm, why does this sound familiar? http://stackoverflow.uservoice.com/pages/1722-general/suggestions/101286-show-the-reason-a-close-vote-was-given"}, {"author_name": "BCS", "gravatar_hash": "d68f8d8798ee2da0d94cda6d7a544c23", "author_url": null, "date": "May 20, 2009", "message": "vote++ on close-as-duplicate inserting backlinks"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "May 20, 2009", "message": "@cletus: it kinda does support multiple duplicate links, although not from a single person (5 close voters can apparently submit 5 duplicate links). \n\nLooks like there's an issue with identifying duplicate duplicates though...\nhttp://stackoverflow.com/questions/887552/reflection-effective-awesome-necessary-uses-closed\n\n-randomly said"}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "May 20, 2009", "message": "&gt; It still discourages new users (the ones most likely \n&gt; to ask duplicate questions), because their question \n&gt; still ends up aggressively closed. Ultimately this \n&gt; will come back to bite you.\n\nI don't like the effect question closures have on new users either.  But I don't think this is a good reason to keep an exact duplicate open.  The new user will see the link to the original question, and ultimately get there answer.\n\nIts nothing like the spiked door to the face that a new user gets for being a little too vague, or asking a marginally forbidden topic."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "May 20, 2009", "message": "what happens if 5 people vote for 5 different reasons? Please, i'm dying to know ;)"}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com", "date": "May 20, 2009", "message": "If it still works as it did, the last person will be the decider of the close. (as in what message will be placed)\n\nYes it's a strange way to do it, but that's how it is."}, {"author_name": "Oorang", "gravatar_hash": "74c236638d43b713794e529cd59e9aa1", "author_url": null, "date": "May 20, 2009", "message": "@Click Upvote\n\nMe too:) I'd guess highest reputation but here are some others: \nFirst vote, last vote, random selection, special category, position of the planets in relation to the stars:)"}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "May 21, 2009", "message": "I don't think closing questions *necessarily* has a bad effect on newbies. It depends on how it's handled.\n\nI've seen some people who will vote something down, plaster 'DUPLICATE!!!!' all over the question, vote to close and then leave a comment to the effect of 'OMG U R SUCH A N00B USE THE SEARCH OR GOOGLE OMG OMG OMG'. Yeah, that's a real turn off.\n\nGenerally speaking however I don't vote down duplicates, particularly for new users, where it's simply an honest mistake. This is especially the case since the search on SO is, well, not great. Using google is better but you can't really expect a newbie to know that (yet).\n\nVoting down seems punitive and pointless.\n\nThere's no reason you can't be positive and courteous while pointing someone to a duplicate and I'm honestly surprised and somewhat disheartened when they aren't."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 21, 2009", "message": "some tweaks went out tonight, as well as some bugfixes. No major changes yet, though.\n\nREMINDER: it is very important that the tags strongly match on duplicate questions! The closer the questions are, thematically, the more tags they should have in common."}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "May 21, 2009", "message": "I'm wondering if the close as duplicate search logic is any different than the suggested answers logic when a question is asked, the search logic, or the logic that fills the related questions in the sidebar (I've no idea if those are all the same, either).  I've voted to close as duplicate when the duplicate question didn't appear in the sidebar and I knew the question was a duplicate because I'd already answered it.  Unless someone else has already provided a duplicate I often have to resort to google with site:stackoverflow.com to find one.\n\nI actually like the feature (and some of the suggested improvements, though I can see where they might be hard to do and break the existing schema), but I hope you're also addressing what I consider to be one of the weakest features in SO: search.  Unless this has improved as well I can see there being a lot of frustration with this improvement."}, {"author_name": "theman", "gravatar_hash": "40ae6a389169b134c62fc18970be740c", "author_url": null, "date": "May 21, 2009", "message": "i dont get what that char to int question is about?  a char is just a small integer?  of course printf(\"%d\", '1') will print 49, go to asciitable.com and look at '1' and see what the decimal value is."}, {"author_name": "LKM", "gravatar_hash": "7bd3e3921826863ff689ff4d08d35fea", "author_url": "http://ignorethecode.net", "date": "May 21, 2009", "message": "The duplicate question thing got me thinking... If somebody closes an older question as a duplicate of a newer question, will the newer question be closed and the older be retained?"}]}