{"response": [{"author_name": "Jon Smock", "gravatar_hash": "7cf5af9e0f94976adae00ce7dfdd467b", "author_url": "http://jonsmock.com", "date": "May 28, 2009", "message": "Jeff, you struggled with having this community/wiki-data-driven thing that no one person owns bred with running a business.  The way to think of it is probably that SO is a platform, so you deserve to host ads and make money in as much as your platform is the best medium to discuss what we're discussing.  The information is still free, and we're all contributing, but your team has put the sweat in to make it possible, and you should be compensated.  Not that I have to tell you that, but there's no reason to feel conflicted about it."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "May 28, 2009", "message": "http://www.dotnetrocks.com/dnr_photos/JeffAtwood.jpg\n\nWe need your glasses to make fire!"}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "May 28, 2009", "message": "http://wdb.sad17.k12.me.us/teachers/bburns/com/documents/literature/lof/media/piggy.gif"}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://www.johntopley.com/", "date": "May 28, 2009", "message": "CodeRush for Delphi by Eagle Software let you embed diagrams in your source code about ten years ago. I remember that whenever Borland released a new version of Delphi, Mark Miller who was the developer of CodeRush had to race to get a compatible version out the door because it was so intimately tied with the innards of the IDE!\n\nI looks like CodeRush is now a Visual Studio add-in."}, {"author_name": "Darren Kopp", "gravatar_hash": "6bdef69e9f0f98bebcf8acc2a9ff25cd", "author_url": null, "date": "May 28, 2009", "message": "yes, flight of the conchords are done. HBO doesn't think they are done done, but they don't have another season planned."}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "May 28, 2009", "message": "\"Why can’t rich comment be put in source code as comments?\"\n\nBecause there is no need to!  Maybe once in a while it would be nice, but usually ASCII is more than sufficient.  Any kind of more advanced formatting means you're tied to the IDEs that support it, and when you check in source code your version control better know how to handle them or diffs/merges are going to look awful.  And if you like making quick changes in Notepad or VI, too bad, you're going to see a lot of garbage."}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "May 28, 2009", "message": "The \"someone big links to you\" effect is particularly noticeable on Twitter, too. Within minutes of a tweet from Joel, my follower numbers had gone up massively.\n\nAnd yes, it's always lovely to get a link from someone you respect.\n\nJon"}, {"author_name": "Michael Stum", "gravatar_hash": "411cf599ae9fe1ef80d40644c83c0f78", "author_url": "http://www.Stum.de", "date": "May 28, 2009", "message": "That's the Dave Winer posting Joel referred to I think:\n\nhttp://www.scripting.com/stories/2007/07/20/thanksToJoelSpolsky.html"}, {"author_name": "Joel Spolsky", "gravatar_hash": "d77663c217e9d27b725338c06674c94b", "author_url": "http://www.joelonsoftware.com/", "date": "May 28, 2009", "message": "@Michael, no, I was talking about when Dave linked to me way back in 1999 I think. At that time joel on software was at joel.editthispage.com."}, {"author_name": "Ola Eldøy", "gravatar_hash": "36c905c1a5d3270d1d01a99773256b2d", "author_url": null, "date": "May 28, 2009", "message": "Mylyn is an example of an IDE pugin that *made* it into the main product (Eclipse). Mylyn is also, imho, an obvious example of cool stuff still missing in Visual Studio. For further pointers, check out Torkild Resheim's \"Visual Studio vs Eclipse\" blogpost at http://torkildr.blogspot.com/2009/05/ive-been-fighting-uphill-battle-against.html"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "May 28, 2009", "message": "@Jon Smock \nI don't think Jeff was personally conflicted about making money from SO. It's more about the balancing act between being open enough that people will contribute (would you write answers for free on the 'hyphen site' ?) vs being closed enough to make money.\n\nThe choice of licence is always a business decision - even in open source you are bidding to attract developers to your project"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "May 28, 2009", "message": "“Why can’t rich comment be put in source code as comments?”\nThere is often a need in numerical software, people often resort to writing the mathematical equation in tex in the comments (most physicists can sight read tex).\nKnuths literate programming took this approach where you write the documentation in a markup language and the code is generated for this. Essentially the code becomes comments to the specs rather than the other way around.\n\nIt would be no more difficult for the IDE to support eg. html markup in source and deal with attached files than it is for it to deal with graphical resources like icons already."}, {"author_name": "Aaron Seet", "gravatar_hash": "3c4fe77ab5bf8851c0dd7da1b3d3960c", "author_url": "http://icelava.net", "date": "May 28, 2009", "message": "Funny, i got into this profession realising i don't know enough about this industry and world of computing, which is what fuels my drive to move forward, learn, and progress.\n\nNearly ten years of IT work i still don't think i am anywhere close to knowing enough, forget about knowing a lot.\n\nHow do folks, young or old, really convince themselves they have reached Mount Everest? perhaps the lack of oxygen?"}, {"author_name": "tvanfosson", "gravatar_hash": "fb599bac7c1f602a2ea455951d6da209", "author_url": "http://farm-fresh-code.blogspot.com", "date": "May 28, 2009", "message": "At one point I was considering doing the multimedia comment thing as my PhD thesis.  Unfortunately, multimedia suffers the same sort of problem that traditional documentation -- it's usually out of date.  Even worse, multimedia is even more expensive to maintain.  Imagine that you record a snippet of what you were thinking when you wrote a piece of code then attached it.  What happens when (not if) you refactor it?  How do you \"edit\" your recorded snippet? Do you now have to delete it and re-record all of it over, correcting the bits that were wrong?  Do you leave it and append another snippet amending the previous explanation?   You can't just leave it, because now it's wrong.\n\nEventually I concluded that it's much better just to write code that's as clear as possible and explain the things that aren't obvious.  Doing it the most lightweight way possible makes the most sense because eventually you'll need to update it or delete it as it becomes out of date.  Even comments are hard to keep in sync with the code and should be taken with a grain of salt."}, {"author_name": "Marc Gravell", "gravatar_hash": "b4ae7f8b50a2c32287e456394570679e", "author_url": "http://marcgravell.blogspot.com/", "date": "May 29, 2009", "message": "VS2010 offers (via the WPF architecture) all manner of possibilities for interaction with code; for example:\nhttp://visualstudiogallery.msdn.microsoft.com/en-us/793d16d0-235a-439a-91df-4ce7c721df12 (there is a whole gallery of this stuff). But maybe not at 60fps ;-p"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://csharpindepth.com", "date": "May 29, 2009", "message": "The business about \"you shouldn't care about the language, it's entirely unimportant\" didn't sit quite right with me. Which language you pick has a *huge* impact on what idiomatic code will look like - if you try to write C++ code in Java (which I've seen) you'll end up with a mess. If you use F# but make everything mutable, never use recursion etc you'll end up fighting it every step of the way.\n\nThe programming languages you learn affect how you think about problems, which is why I believe it's worth knowing a variety - for example, if you know SQL, C, Python, Java and F# you'll get a reasonably rounded view of the world. You can apply *some* of the ideas from one paradigm in another (for instance, writing functional code in C# often feasible, but without things like tail recursion some aspects don't work terribly well) so it's nice to get a broader idea of what solutions are out there.\n\n(I wasn't particularly *recommending* those languages, by the way - but they cover a broad set of paradigms. You could swap out F# for Haskell, Python for Ruby etc.)\n\nJon, still 7 minutes away from finishing the podcast..."}, {"author_name": "Jakob Engblom", "gravatar_hash": "264da7eaed95d22ac2f9e2dbace242a4", "author_url": "http://jakob.engbloms.se", "date": "May 29, 2009", "message": "On the topic of plugin developers and their plight... I think that plugins that as you say \"plug the holes\" in a product are doomed in commercial settings.  But you still want a good plugin architecture in order to enable connections between tools and allow custom plugins inside organizations.\n\nFor example, VMWare has some visual studio plugins to integrate reverse debugging and other VMWare features with Visual Studio.  That kind of integration between tools is immune to being subsumed by Microsoft (I guess if they did provide that themselves, it would make VMWare happy as it saves them money). \n\nAnother example where a commercial tool has a successful business model with plugins is Matlab -- there are hundreds of analysis packages available for Matlab for all kinds of fields, many of them developed by academics who then share the revenues with the Mathworks company.  In principle, Matlab could develop these themselves, but why would they? In this way, they ensure a stream of qualified add-ons without spending their own development resources on it. \n\nYet another example are things like integrations between IDEs and source control systems like Rational Clearcase or build systems like Rational Buildforge. Sure, an MS might attempt to replace that entire system, but for the enterprises using these tools, it makes lots of sense to integrate with Visual Studio. There is no conflict of interest here. \n\nIn a sense, the Apple iTunes Application store is also an example of leveraging plugin developers to create an attractive platform. It is clear that some really useful iPhone apps will be designed-out by Apple in years to come... but the model they have with revenue sharing currently makes apparent sense to a lot of developers.\n\n/jakob"}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "May 29, 2009", "message": "A few years ago when I was in college, I used a microprocessor-assembly development environment (TExAS [http://users.ece.utexas.edu/~valvano/sim.html ], coincidentally developed at U Texas) that operated on RTF files. Images could be embedded in the code, and syntax highlighting was actually part of the file.\n\nI never needed to embed an image in the code; but I can see that it could be useful for projects more complicated than mine were. (The examples in the manual showed a timing diagram embedded in the code, but I didn't use timing diagrams until a later course.)\n\nNowadays, I have been known to put ASCII art into my Java code for illustration purposes."}, {"author_name": "bbache", "gravatar_hash": "cfbfa843e48fc7364ee59e3407769662", "author_url": null, "date": "May 29, 2009", "message": "Joel was on fire this week, especially in the last half an hour. I propose a new rule to the podcast drinking game: Joel pondering a word. For example, \\twitter...\\ this week, and \\accrethe... accrethe... what's an accrethe?\\ (made up/misprounounced by Jeff) last week."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 30, 2009", "message": "Accrete is a word, and I pronounced it correctly.\n\nhttp://www.thefreedictionary.com/accrete\n\np.s. SUCK IT :)"}, {"author_name": "Philoushka", "gravatar_hash": "9272c0c8d58d928962ba24b407af280d", "author_url": null, "date": "May 30, 2009", "message": "Throughout the discussion about \"vendors making products to fill other products' holes\", I couldn't help thinking about AntiVirus vendors. There's a whole flippin industry centered around the security holes of Windows. I can't believe it didn't even get a mention :)\n\nCaptcha: miserthe"}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jun 02, 2009", "message": "It's also a viable business where the app/IDE is really just a framework and your add-ons provide the business solution. This is big in CAD where lots of industry specific add-ons sit on top of say autocad."}, {"author_name": "Jon Galloway", "gravatar_hash": "63c32b4489d13b17d23fd9db1505bdf9", "author_url": "http://weblogs.asp.net/jgalloway", "date": "Jun 02, 2009", "message": "As Marc said, VS2010 supports many of the things you were asking about via WPF and MEF. It's in public beta and there are already a lot of good extensions available:\n\nhttp://coolthingoftheday.blogspot.com/2009/05/extending-vs2010-sdk-is-out-scott.html\n\nComplain about the status quo, or download the future?"}, {"author_name": "Ryan Barrett", "gravatar_hash": "71509c133412b51803153871a8de560b", "author_url": null, "date": "Jun 03, 2009", "message": "RE: rich comments in IDE\n\nMicrosoft could couple the OneNote system with Visual Studio to make an really nice implementation of this which is real easy to use and does everything you'd ever want to do.  All indexed."}, {"author_name": "Jason Roberts", "gravatar_hash": "9e78fee96788a731fa99a69e86b1ded1", "author_url": "http://www.techzinglive.com", "date": "Jun 03, 2009", "message": "I've been listening to the Stack Overflow podcast since episode one and have enjoyed it immensely. But I'd be curious to know how many listeners the podcast actually has - 5K, 20K, 100K? Also, how many did it have at the beginning? Jeff has a sizable readership and Joel has a large following and popular website so I would imagine that the podcast must have started out with pretty good numbers."}, {"author_name": "Clay Mayers", "gravatar_hash": "bfe62caafd6d4574ac9191b61661776e", "author_url": null, "date": "Jun 03, 2009", "message": "Is there a reference to the reasoning as to why Microsoft didn't infringe Stac's patents?  I thought the controversy was that the Jury based the decision on personalities and not on the technical merits leaving it essentially undecided.\n\nThis is also true for the part Stac lost in that same lawsuit; misappropriation of a trade secret."}, {"author_name": "Doug", "gravatar_hash": "a81a108522f894bbe6c6d14d0d90739b", "author_url": null, "date": "Jun 10, 2009", "message": "I just found this and it reminded me of the plug in ecosystem discussion.\nhttp://www.ismashphone.com/2009/06/15-apps-rendered-obsolete-by-the-new-iphone-.html\nYou can be made obsolete on any platform. Basically the new iPhone 3G S will have features and apps built in just like popular third party apps."}, {"author_name": "Brian Sullivan", "gravatar_hash": "3184c0c8926dde9558fdb7facdadf530", "author_url": null, "date": "Jun 17, 2009", "message": "On Interview feedback.\n\nWhile some people may ask what could I have done differently in the interview. \n\nMost really want to know why they were not hired. \n\nIn most cases, something like 'we are looking for someone with more knowledge/experience in leadership/design/knowledge'\n\nOne I have had to use more than once. 'The answers you provided to interview questions where inconsistent with the experience cited in you resume' \nRead: You padded the resume too much."}]}