{"response": [{"author_name": "John Sheehan", "gravatar_hash": "54b75f6fbf4434162bfcda6b0cb9b86b", "author_url": "http://john-sheehan.com/blog", "date": "May 06, 2009", "message": "Good luck to whomever gets the Fog Creek position. Sounds like an awesome opportunity!"}, {"author_name": "AgentConundrum", "gravatar_hash": "cfd1684ea3df74d506f58377b6da5a72", "author_url": "http://appscanadian.ca", "date": "May 06, 2009", "message": "I haven't listened to the podcast yet (I tend to do that in bed, my non-technical girlfriend loves it because she says it puts her right to sleep), but wasn't the 1-year anniversary two weeks ago since there were two weeks where we didn't have a podcast?\n\nCongrats regardless, keep up the great work."}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "May 06, 2009", "message": "@AgentConundrum:\n\nAccording to the dates on the podcasts inside my iTunes, the first podcast was released on April 16, 2008, the one-year anniversary of which was almost three weeks ago.\n\ncapcha: clangs hammocks"}, {"author_name": "AgentConundrum", "gravatar_hash": "cfd1684ea3df74d506f58377b6da5a72", "author_url": "http://appscanadian.ca", "date": "May 06, 2009", "message": "@nobody_:\n\nThanks for correcting me. I thought there might've been a third \"sorry, no podcast\" weeks, but could only think of two off the top of my head (both, oddly enough, while I was on vacation)"}, {"author_name": "forkedcode", "gravatar_hash": "1d1c24206c807b2c41d9d1a2736ac02c", "author_url": null, "date": "May 06, 2009", "message": "Interesting news about fogcreek forking the code.  Is this Joel saying - \"Jeff, someone needs to productize this, so we can ship to different markets and languages and then sell the code base for $, and make money (apart from ads)\".  Is this joel and co looking at jeff's management and saying \"we need to now take control, because jeff doesn't have the experience with products, at the moment we have a LOB web site, not a product we can make money from.  I bet joel will make a lot of money on this, while jeff misses the boat.  Jeff, you have put some great ideas into this product, get with the plan!!! Wouldn't it be cheaper / easier to get a developer to fix bugs, while jeoff's team does the port ?  Jeff says he's a control freak, is this a time he needs to let go of the existing site, and then spend say 3 months on making it a product (not a web site).  Why isn't jeoff the team lead ?"}, {"author_name": "Runevault", "gravatar_hash": "136e6123607d431f363ff873fe80b870", "author_url": "http://runevault.com", "date": "May 06, 2009", "message": "FYI for testing a website you can use Selenium which ties into your browser and can access the DOM IIRC, and definitely can search for the existence of words in a document at a minimum if it can't look at the dom.\n\nBest of all you can write your tests in multiple languages including C#, though the core piece you are tying into is in Java.\n\nwww.seleniumhq.org"}, {"author_name": "Zoredache", "gravatar_hash": "d545ccc68d16b9d921e6c6f0404a1048", "author_url": "http://serverfault.com/users/984/zoredache", "date": "May 07, 2009", "message": "Re: the bit about the pool.ntp.org.\n\nIt is a cluster of ntp servers provided by volunteers.  Joel got one random server, and Jeff got a different.  Occasionally, there will also be running on the same IP as the ntp service. This is entirely normal.\n\nTo learn about it please see http://www.pool.ntp.org/\n\nThe pool.ntp.org project is a big virtual cluster of timeservers striving to provide reliable easy to use NTP service for millions of clients without putting a strain on the big popular timeservers."}, {"author_name": "rm", "gravatar_hash": "3a3fb77c01514093da4c10f806ae4284", "author_url": null, "date": "May 07, 2009", "message": "lol @ the last 10 seconds of the podcast"}, {"author_name": "DrewG", "gravatar_hash": "dc5e4e4387374e20efffa31eb7608ef9", "author_url": null, "date": "May 07, 2009", "message": "serverfault... am I right in thinking that it really is _only_ for pro sysadmins ?  That you do not want technical home users asking questions about their own equipment, whether it's about building a new system or fixing/upgrading an old one ?"}, {"author_name": "tinkertim", "gravatar_hash": "84432a12912341ff38e157b3d2f4d145", "author_url": "http://echoreply.us", "date": "May 07, 2009", "message": "Even the folks at Citrix / Xensource see the value of StackOverflow :) See <a href=\"http://blog.xen.org/index.php/2009/05/04/qa-system-for-tracking-stack-overflow/\" rel=\"nofollow\">this post on Xen.org</a>.\n\nI think Serverfault is going to be wildly popular, perhaps surpassing SO :)"}, {"author_name": "DrJokepu", "gravatar_hash": "973c6e2cf1ae9f6615dd883eb14597b1", "author_url": null, "date": "May 07, 2009", "message": "Lol @ the new downtime page. Someone was really creative (and had an awful lot of free time)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 07, 2009", "message": "> serverfault… am I right in thinking that it really is _only_ for pro sysadmins ? \n\nYes, the rule of thumb I am using is that if the question is related to hardware *you paid for yourself* (unless you run a small biz) it is probably off topic. This is just a rule of thumb, but I think a pretty good one.\n\n> http://blog.xen.org/index.php/2009/05/04/qa-system-for-tracking-stack-overflow/\n\n@tinkertim nice! I'm still trying to cultivate links to the sysadmin community, as I am at best a bush league sysadmin.. so any help in that area for serverfault.com is greatly appreciated.\n\n> lol @ the last 10 seconds of the podcast\n\nhttps://twitter.com/codinghorror/status/1725840633"}, {"author_name": "matt b", "gravatar_hash": "c11c60c7e6d29cb4b87f3c0a3b692181", "author_url": null, "date": "May 07, 2009", "message": "Agreed with the poster above that you guys might want to look into Selenium for automated testing as far as the presentation layer of your app goes.\n\nAlso, I'd suggest Canoo Webtest as well.\n\nHearing Jeff's and Joel's discussions of unit tests makes me wonder sometimes if you guys are talking about the same thing when you say \"unit tests\" as the rest of the community is; most of the discussion on this podcast around unit testing seems to revolve around \"How do you test Javascript and CSS to prevent breakages?\" \n\nI don't think most developers would put that under the umbrella of \"unit testing\", but rather automated web testing. I think that most people would consider \"unit testing\" for your controllers, DAO code, business logic, etc.\n\nI just hope too many people aren't turned off of the idea of unit testing and \"TDD\" based on Jeff and Joel's discussion (and partial dislike) of them."}, {"author_name": "theman", "gravatar_hash": "535397b708dc316389dd4041a2797496", "author_url": null, "date": "May 07, 2009", "message": "rejoice"}, {"author_name": "Juan Manuel", "gravatar_hash": "0e082774401a8f7760c401e06925699c", "author_url": "http://www.juanformoso.com.ar", "date": "May 07, 2009", "message": "This episode was kinda boring... looking forward to the next one"}, {"author_name": "Robson", "gravatar_hash": "db863db0e6dfd5b032b5a8c440c7f0ca", "author_url": null, "date": "May 07, 2009", "message": "You discuss how to tie StackOverflow accounts to ServerFault accounts. I don't know about Yahoo, but you can ask Google not only to authenticate the user but also to give you his email address. That way, you can link accounts together by the email address."}, {"author_name": "Kevin Dente", "gravatar_hash": "23c1e2063688620b75b248e08c0d5c24", "author_url": "http://weblogs.asp.net/kdente", "date": "May 07, 2009", "message": "WatiN is another useful tool for driving web UIs for integration style testing."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "May 07, 2009", "message": "When you search my name in Google, the only thing on the first page that's actually me (as opposed to someone else named Chris Upchurch) is my Stack Overflow user page."}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "May 07, 2009", "message": "\"I don’t think most developers would put that under the umbrella of “unit testing”, but rather automated web testing.\"\n\nI think that's kind of the point.  Unit tests are good, but some of the advocates go over the top hyping them.  Some things just aren't really testable."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "May 07, 2009", "message": "Checking people's online presence sounds like it would be dangerous in the 'land of too many lawyers'.\n\n1, Make up a relatively uncommon name and create a web site with some pro choice / pro life / pro drugs / pro CVS rant\n2, Apply to global mega corp and get rejected\n3, Check server logs and sue.\n4, Profit"}, {"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "May 07, 2009", "message": "\\1, Make up a relatively uncommon name and create a web site with some pro choice / pro life / pro drugs / pro CVS rant\n2, Apply to global mega corp and get rejected\n3, Check server logs and sue.\\\n\nSo long as the employer isn't the government, there's no grounds for a lawsuit if an employer rejects you for any of those views.  The only protected categories are age, race, religion, sex, and national origin (under federal law, some states add a few others like sexual orientation to the list)."}, {"author_name": "Abdu", "gravatar_hash": "823048c003a3159b3adc1ee146b91114", "author_url": null, "date": "May 08, 2009", "message": "Joel says that he hasn't seen any changes on the hyphen site aka experts-exchange.com. I am not sure what he's expecting. An established business doesn't change just because a competitor sprung up a few months ago. No one knows if EE is huring because of SO .. yet. \n\nEE has questions about programming, software and (the sum of network, hardware and other IT areas). Cumulatively, it's still a magnet for IT people.\n\nserverfault is coming out soon and if Jeff &amp; Joel have another question site for software, EE IS DOOMED FOR SURE. It will be just a matter of time. \n\nWhy would anyone pay them if the SO family of sites provides the same for free."}, {"author_name": "Jack", "gravatar_hash": "9560d349988f17c973302586e64e33db", "author_url": null, "date": "May 08, 2009", "message": "The hyphen site has been running ads in craigslist for sysadmin, developer and intern positions for the last month or two. \n\nhere is an example:\n\nhttp://slo.craigslist.org/sad/1146164752.html"}, {"author_name": "Andreas", "gravatar_hash": "99452c24fc279b31a0cb798fd9f39035", "author_url": null, "date": "May 09, 2009", "message": "The big database refactoring has been mentioned several times, but I've never seen or heard what the outcome was. \nOr have I just not been paying attention?\nHow much did it improve the performance on the DB? Any interesting lessons learned?\nI would love to see a blog post or a discussion on the podcast on this topic."}, {"author_name": "John Topley", "gravatar_hash": "3b687a35025c05dbc7627af428dff0da", "author_url": "http://www.johntopley.com/", "date": "May 09, 2009", "message": "You should get someone from the hyphen site on the podcast. It'd be great!"}, {"author_name": "Cwan", "gravatar_hash": "4178f05ea5f8b50de9736db866aa0480", "author_url": null, "date": "May 10, 2009", "message": "You're discussing the pains of merging with svn and, at least as I get it, basically says a distributed VCS is the way to go. Ever considered or evaluated Perforce? Merging is just so smooth (relatively speaking, of course)."}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "May 11, 2009", "message": "I have a feeling you guys aren't using subversion merging  correctly.  We've been branching all non trivial tasks and merging them back into our stable trunk with no problem for years. \n\nhttp://stackoverflow.com/questions/35646/do-you-continue-development-in-a-branch-or-in-the-trunk"}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "May 12, 2009", "message": "...and a bugfix has never went MIA from merging.  \n\nIt sounds like maybe you used one of the wrong merging types or else you only selected the last revision to merge in, and you were supposed to select the range of revisions since the branch was created."}, {"author_name": "Jonas Elfström", "gravatar_hash": "9e36aeb20f1b4a763043d3ce4942b454", "author_url": "http://alicebobandmallory.com/", "date": "May 12, 2009", "message": "Joel mentions that NTP needs an open inbound port. That is not the case. NTP uses UDP and not TCP and that is also often a show stopper in enterprise environments."}, {"author_name": "paulgreg", "gravatar_hash": "d7f5906049cc3fbc05ba75682f536ce4", "author_url": null, "date": "May 12, 2009", "message": "I disagree strongly about the \"testing\" part of the podcast.\n\nUnit testing (as TDD) is a very good practice !\nYou may avoid it but tests are the better \"assurance\" you can afford while refactoring for non-regression.\n\nOf course, you won't test everything but, for example, you may have some integration test which logs in your application (using Selenium for example, a browser driver). So, if you refactor that part, you will detect any problem between CSS and JavaScript (because Selenium pilots a real browser) like the problem you had.\n\nOf course, they are more costly to develop and to maintain but I totally think it's worth the value.\n\nAlso, you will not test this way every part of your application but, at least, you should do this kind of integration test for basic actions : login, create a question, post an answer,...  \n\nHere's 2 good SO questions/answers on that subject :\nhttp://stackoverflow.com/questions/67299/\nhttp://stackoverflow.com/questions/781763"}, {"author_name": "Mike Polen", "gravatar_hash": "07d1b488333dac4c96fe2150b8080ee5", "author_url": "http://mwpolen.blogspot.com", "date": "May 20, 2009", "message": "I came across this quote today and it reminded me of the question from Tom: “As a startup entrepreneur, what steps should you take, if any, to protect your intellectual property?”.\n\nDon't worry about people stealing an idea. If it's original, you will have to ram it down their throats.\n  - Howard Aiken"}]}