{"response": [{"author_name": "DrJokepu", "gravatar_hash": "973c6e2cf1ae9f6615dd883eb14597b1", "author_url": null, "date": "May 06, 2009", "message": "How long will be the elected moderator's \"mandate\"? Is it for life, or are we going to have \"moderator elections\" regularly?"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "May 06, 2009", "message": "To make a more informed decision, can we examine the candidates' voting records? Before selecting someone as a moderator, I’d like to know how many times they’ve voted to close, reopen, and mark a post as offensive, as well as how often they’ve had their edits rolled back by other users."}, {"author_name": "Andrei Rinea", "gravatar_hash": "ea70b38ea893494ee0cd177adc0f54e5", "author_url": "http://blog.andrei.rinea.ro", "date": "May 06, 2009", "message": "When will we see results? Will there be partial results? :P"}, {"author_name": "Fábio Gomes", "gravatar_hash": "5c951404673ae426a82c0b0e1f385d34", "author_url": "http://yacoding.blogspot.com", "date": "May 06, 2009", "message": "John Skeet will win for sure, even without being on the list."}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "May 06, 2009", "message": "+1 for Simucal"}, {"author_name": "wcoenen", "gravatar_hash": "df6cf33b05610b10c0d63b9e3c3654d4", "author_url": null, "date": "May 06, 2009", "message": "Moderators should be old wise men. After a quick look through the ages of the candidates, that means +1 for S.Lott :-)"}, {"author_name": "chakrit", "gravatar_hash": "104c34a4803355ade79413372205138a", "author_url": null, "date": "May 06, 2009", "message": "Simucal +1\n\nBut... why Jon Skeet's not on the list?"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "May 06, 2009", "message": "Keeping diversity in mind, I first went through the list and disqualified anyone for whom C# was one of their top  5 tags (including myself).  That left a much smaller field:\n\nGreg Hewill\nTomalak\nBill the Lizard\nJonathan Leffler\nBill Karwin\nS.Lott\nlitb\nPaul Dixon\nPaul Tomblin\nPax\n\nI'll keep my choice from that group to myself, but really any of these should make a decent moderator.\n\nAlso: neat that each time you view the page it lists the candidates in random order."}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "May 06, 2009", "message": "Oh, and how bout adding some \"voting closes on ....\" text to the vote page?"}, {"author_name": "Rob", "gravatar_hash": "29d4625b3e15ecef1ff05565fbfacd58", "author_url": null, "date": "May 06, 2009", "message": "@chakrit - I think he recused himself."}, {"author_name": "Ólafur Waage", "gravatar_hash": "89b8f4a7429270308ac301bf7605f974", "author_url": "http://www.cznp.com/", "date": "May 06, 2009", "message": "@DrJokepu 4 more years!!"}, {"author_name": "Jon Skeet", "gravatar_hash": "6d8ebb117e8d83d74ea95fbdd0f87e13", "author_url": "http://msmvps.com/jon.skeet", "date": "May 06, 2009", "message": "@chakrit/Rob: Yup, I declined the nomination. As per one of the podcasts, Jeff would have been reluctant to accept me anyway, for similar reasons to the ones I gave for declining.\n\nThat being said, everyone go vote for Marc Gravell. The more time he spends moderating, the less time he'll have for catching up with me ;)\n\nJon"}, {"author_name": "Jess Sightler", "gravatar_hash": "eac4001b8c054ee994480f0a6e2cdcf8", "author_url": "http://www.jroller.com/jsight/", "date": "May 06, 2009", "message": "I second the notion that I'd like to see more of their voting patterns to make this decision.  Its hard to decide who is the best moderator (voter) based upon their questions and answers alone."}, {"author_name": "gulzar", "gravatar_hash": "a9eb8fdbd01419726d854976400b48f3", "author_url": null, "date": "May 06, 2009", "message": "Good Luck guys!! Tough to select just one."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "May 06, 2009", "message": "\"I walked through the first 30 comments to that post and gathered up the nominations (except the self-nominations and those who recused themselves), and voting is now open\"\n\nConveniently left off one controversial nomination which was originally nominated at the 26th comment. *rubs chin*"}, {"author_name": "Guy", "gravatar_hash": "d9f2c02c23a3013166710a1d24bca056", "author_url": "http://guyellisrocks.com", "date": "May 06, 2009", "message": "You said \"I cast my vote; have you cast yours?\" to encourage everyone to vote. What you should have said is \"Have you got your 'Suffrage' badge for voting?\" - that would have been more of an enticement... :) (I have voted.)"}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "May 06, 2009", "message": "@TheTXI: I was wondering about that too. Does banning count as an automatic un-nomination?"}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "May 06, 2009", "message": "@Guy, Suffrage badge!  Great idea.\n\nEveryone keeps coming up with clever badge ideas.  I need to start trying to come up with some!"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "May 06, 2009", "message": "@TheTXI: What do you think would've happened here had RichB been nominated? The point is to reduce the drama, not throw more fuel on the fire."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "May 06, 2009", "message": "@Toast: If Rich B had been nominated he would have gotten a couple votes and probably would not have won (something he himself was quite realistic about).\n\nThe only drama that would have been caused over him getting the opportunity to be up for vote would be from people like you who attempt to make a huge deal over the slim tiny chance that he may possibly out of the blue low probability snowball's chance in hell he might be voted an SO moderator. \n\nIf you intentionally disqualify someone from the running, at least be up front about it, or own up to not being able to accurately count to 30. I'm not going to make any sort of attempt to get him on the ballot (obviously too late about that), I just think it's disingenuous to brush it under the rug and act like there isn't a missing nominee."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "May 06, 2009", "message": "@mmyers:\n\nThat's would I would guess, which I don't have any sort of problem with (just be honest about it). Otherwise I am left assuming that Jeff &amp; the team can't count to 30 in terms of the comment posts, which although unrealistic would be much more humorous."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "May 06, 2009", "message": "@Simucal:\n\nHow about you get awarded a Clever Badge Idea badge everytime you come up with a new clever badge idea?\n\n*waits for Simucal to facepalm himself for not having thought of -that- one as well*"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "May 06, 2009", "message": "Some interesting tidbits gleaned from the comments to the nomination post:\n\nI wasn't nominated until _far_ after the 30th comment (#66).  I checked because I was surprised to see my name up there.  Rather a large stretch of his \"or so\" remark :)\n\nSteven Lowe recused himself.\n\nRichB is not currently eligible, with only 11 rep.  Must be in the penalty box."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "May 06, 2009", "message": "@Joel: a quick check of the Users page shows 7,158 for Rich B... But another user named RichB (no space) has 11 rep."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "May 06, 2009", "message": "Joel Coehoorn: \n\nYou're looking at the wrong Rich. Rich B is not in the penalty box right now and is over 7,000 rep.\n\nhttp://stackoverflow.com/users/5640/rich-b\n\nI was a bit confused you said that at first because I was wondering what the hell he could have possibly done to get \"boxed\" again seeing as how he hasn't been terribly active on the site for a few days."}, {"author_name": "Code Slave", "gravatar_hash": "0a638176c7349e10fe82e6e65f2b069f", "author_url": null, "date": "May 06, 2009", "message": "@TheTXI:\nI think the Ground Rules in the Nomination thread lend some insight as to why, even is some of them are subjective. This has already been hashed out in previous threads, and I don't see a need to stir the pot this time."}, {"author_name": "TheTXI", "gravatar_hash": "75c1b8bc6bd8631a53b246e43caf4dc6", "author_url": null, "date": "May 06, 2009", "message": "@Code Slave:\n\nAll that is probable, all I'm looking for is a little transparency seeing as how there are multiple holes in what Jeff said on this blog (as noted by Joel C's post about not actually being nominated until well after the 30th comment). \n\nIn all honesty I would rather have total obfuscation (i.e. not telling us at all the \"method to their madness\" in compiling the list of nominees) because at least then it wouldn't feel like they are saying one thing and doing something completely different."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "May 06, 2009", "message": "@TheTXI: You are the one courting drama, not me. I said that Rich would make a bad moderator, not that he should be disqualified. I had enough faith in Rich's popularity to not care whether he was nominated or not.\n\nAnd maybe Jeff should have just said that he accepted \"all valid nominations from the first 30 or so comments\", that way it would've included Joel's nomination since \"30 or so\" is a fuzzy number and would explain Rich B's as not being a valid nomination due to being boxed and all the commotion on the site caused (either directly or indirectly) by his actions.\n\nAnd it's not me you have to worry about. It's the people like Click Upvote and Kev who like to cause disturbances to prove a point. I just talk a lot."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "May 06, 2009", "message": "How much transparency do you need?\n\nGiven the rules set up for nominations, it should be pretty clear that Rich B failed some of the requirements. Which means he was never \"legally\" nominated, and therefore, not included in the actual voting either. The rules for nomination were explicitly mentioned in the nomination blog post. Do you really need Jeff to add \"oh by the way, anyone who does not fulfill the requirements I explicitly listed will not be considered nominees\"? Shouldn't that be obvious? Isn't that why he listed the rules in the first place? \n\nYou forget that the list of nominees is not simply the list of names dropped into the comments on the nominations post. It is that list *except anyone who fail to live up to one or more of the ground rules explicitly listed\". As toast says, perhaps he should have been explicit and said that he accepted \"all *valid* nominations\", but really, I'd have thought that was implicitly understood. Why would he accept invalid nominations?\n\nBut thanks for bringing it up. We really need some more drama here. Adding more fuel to the fire is such a constructive thing to do. We really need to ensure that *everyone* knows all that Rich B has done wrong, in the name of transparency.\n\nNow can we please move on?"}, {"author_name": "Joel Coehoorn", "gravatar_hash": "0a699f767c7195e9c00d85083c6cd914", "author_url": "http://stackoverflow.com/users/3043/joel-coehoorn", "date": "May 06, 2009", "message": "@toast: he did say \"or so\" at the end of the _other_ blog post.  But 66 is not usually \"or so\" relative to 30.\n\n(captcha: The predator)"}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "May 06, 2009", "message": "@Joel: I just counted non-comical nomination posts (i.e. where people weren't just having a laugh nominating themselves on the basis of pony love) and there are only 43 nomination posts in the entire 250.\n\nMeta indeed."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "May 06, 2009", "message": "And to be honest, I think Jeff just started reading through, stopped when it got all meta and called it 30 without actually bothering to count."}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "May 06, 2009", "message": "For whatever it's worth, I think openness should be a criterion for becoming a moderator.  People who reveal more about themselves seem less likely to make destructive moderator decisions.  So my personal preference would be for those who:\n\n1. Use their real names in their profiles.\n\n2. Use their real pictures.\n\n3. Include a link to a web presence outside of Stack Overflow. \n\nWhen I look at the list of candidates, the people who don't use their real names and pictures tend to stick in my mind since they are different.  I think any of them would be good choices.  But like hiring a programmer, it seems best to set a high standard and risk screening out great candidates in order to get the best moderator.\n\n@Joel Coehoorn - considering diversity of technical background seems an excellent criterion as well.\n\nCAPTCHA: jury's sights"}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "May 06, 2009", "message": "@Jon Ericson:\n\nI agree that openness is a valuable trait for a moderator. Nothing worse than getting slapped down with no explanation given.\n\nHowever, I must respectfully disagree with your implication that those who fail to reveal irrelevant personal details are therefore unsuitable. Two of the people I nominated - Simucal and Pax - fail on at least one of your three criteria (and possibly fail all three); yet they've both proven themselves valuable members of SO. \n\nA real-looking name and a real-looking picture mean nothing; behavior means everything. Each user page provides a lengthy history of each user's behavior on SO, a history that is somewhat more difficult to manipulate than a username, picture, and personal website."}, {"author_name": "Gamecat", "gravatar_hash": "0b4b433679e1fb52f7e2ef4ea492496d", "author_url": null, "date": "May 06, 2009", "message": "Voted.\n\nMay the best candidate win ;-)."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "May 06, 2009", "message": "+1 BillTheLizard :)\n\n\n(CAPTCHA=\"neighbor proud\" ... ::shrugs::)"}, {"author_name": "Paul Tomblin", "gravatar_hash": "99660662e89949a4b53cd97bc199ead1", "author_url": "http://blog.xcski.com/", "date": "May 06, 2009", "message": "Geez, only one vote?  This isn't going to be easy.  (Unless I can vote for myself)"}, {"author_name": "Jon Ericson", "gravatar_hash": "8989210e0bee8c33c698cfbb79a2afe7", "author_url": null, "date": "May 06, 2009", "message": "Shog9:\n\nI myself fail one of my criteria. (I don't link to my personal website.)  I'm not saying that those who have online identities that are separated from their offline identities are unsuitable.  Rather I'm suggesting a way to winnow down the list a bit.\n\nAll of the candidates seem to have a long history of good behavior on Stack Overflow.  But the question isn't what they've done in the past.  Rather it's how they will behave in the future if they become moderators.  It's my (possibly irrational) opinion that moderators who have links to the world outside of Stack Overflow will think twice before behaving poorly as moderators.\n\nIn any case, I'm more interested in getting the number candidates down to something reasonable than I am in eliminating someone unfairly.  In fact, the two candidates you mentioned were among those I considered voting for myself.  And there are several other good choices that got scratched out.  Even so, I still have a handful of candidates that I have to chose from."}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "May 06, 2009", "message": "@Jon Ericson,\n\nI agree somewhat that it would probably make people feel better if the candidates had some personal info listed on the page.\n\nI also agree with Shog9 that peoples history on the site is the biggest indicator above anything else.\n\nIn any case, I added my name to my profile.  My profile could still use some love though."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "May 06, 2009", "message": "@Jon Ericson:\nOk, fair enough then - whatever works for you. I used eeny-meeny-miny-moe... ;-)\n\nAhh... time for some\nCAPTCHA: Wednesday Catnip"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 06, 2009", "message": "I just voted for the person with the most awesome avatar image, myself.."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "May 06, 2009", "message": "Jon Ericson,\nSince you brought it up, I might as well come right out and say that that is my real name and picture.  I thought you'd all like to know that for the past several months you've been taking the advice of a cartoon lizard.  I hope that doesn't change the way anyone votes."}, {"author_name": "Shog9", "gravatar_hash": "ae15c48f686a0ecb39848f980b296611", "author_url": "http://www.shog9.com/", "date": "May 06, 2009", "message": "Wow... Now i wish i'd voted for Bill..."}, {"author_name": "Eddie", "gravatar_hash": "3d184a8ef609eaabcaabd0dd19196a74", "author_url": null, "date": "May 06, 2009", "message": "@Bill the Lizard:  Does this mean you have a cousin in the insurance biz?"}, {"author_name": "Simucal", "gravatar_hash": "503dc458e66746c5ac681e7057d209dd", "author_url": null, "date": "May 06, 2009", "message": "@Eddie,\n\nHonestly, if so then he might be the best choice.\n\nHe could help people save money on their car insurance AND provide useful moderation to the community at the same time.\n\n\"Closing this post as argumentative.  Also, if you haven't already looked into it, Geico could save you a lot of money on your car insurance as well.\""}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 06, 2009", "message": "> Rich B is [has] over 7,000 rep.\n\nYes, but at the time of nominations, he did not.\n\n> I think Jeff just started reading through, stopped when it got all meta and called it 30 without actually bothering to count.\n\nPretty much. I should have closed comments on that earlier."}, {"author_name": "Jon Cram", "gravatar_hash": "28d3858fd164c191d05954e114adeb9a", "author_url": "http://webignition.net", "date": "May 07, 2009", "message": "The pedant in me wonders why the voting page doesn't grey-out, or otherwise de-emphasise, the voting buttons once your vote has been cast. Not that it matters in the slightest.\n\nCaptcha: Steffens Apple - I'll add that to my list of potential band/book names."}, {"author_name": "Konrad", "gravatar_hash": "f9401202ab73e624cc82800b0fff1489", "author_url": "http://madrat.net/", "date": "May 07, 2009", "message": "Uh, I can’t decide … :-(\n\nI don’t want to vote for Marc for pretty much the same reason that Jon declined his nomination. Otherwise, he’d be perfect."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "May 07, 2009", "message": "What with recent discussions (on IRC, at least) about people who've been nominated who didn't really want in, I'm wondering if the voting should have instead been done using STV (http://en.wikipedia.org/wiki/Single_transferable_vote) or the like.\n\nIn my view, first past the post requires _way_ too much voting strategy, like deciding whether the person you're voting on is likely to win, rather than whether you think they're the best person. It leads to the silly two-party system like you see in the US. :-D"}, {"author_name": "Oscar Reyes", "gravatar_hash": "c40d853adf30734cdc25de5a9f1aa6df", "author_url": null, "date": "May 07, 2009", "message": "&gt;... is shown in random order every time ...\n\nWhy is it, that we as programmers always include this kind of things while organizing something? :) :) :) \n\nOnce at work, we were organizing an internal soccer league. I took the email list, randomize it and create the teams ( it was a disaster btw, I didn't include any condition to make sure our local Maradona and Pele were placed at different teams ) \n\n\nIn other situation, I created using random the pairs for gifts interchange at holly days, that was a success!!.\n \nA non-technical friend of mine ask me once? Why is it that you guys always come with the \"random\" thing. \n\nPerhaps because we know it is available?\n\n\n\nAbout the reputation needed. I think 1,000 would have been a better number. 1k rep shows that you have been involved for a while at SO and probably have had more opportunities to get to know the candidates. \n\n\nCongratulations for SO 1st year!!! :)"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "May 07, 2009", "message": "@Oscar: Random order removes any perception of bias, like favouring the first person to get nominated (if sorting by ID), or the person with last names starting with A, etc."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "May 07, 2009", "message": "I'm actually starting to have some concerns about this process.\n\nFirstly, if you look at the top 25 users, 16 of them are there and 1 would be if he didn't withdraw (Jon Skeet). For the same reasons that Jon withdrew, are these the best people to be spending time moderating instead of doing what they normally do, which imho adds the most value, and that is answering questions.\n\nSecondly, what exactly is the job of the moderator going to be? My view is it should be a largely hands off force of last resort kind of thing to settle disputes and so on but that's just my opinion. I'm not sure if it's ever been stated what Jeff &amp; co are expecting from a moderator and what stnadards they should be upholding. This is important information in voting.\n\nLastly, we have 25 or so names on the voting list but only a single vote. This is called a first past the post system that is used wideley in elections but is really not a good idea once you get a large number of parties involved. There are some names on that list that will never win, not because there is anything wrong with them but simply because they just aren't that well known.\n\nIt's somewhat unfortunate that how well you're known is going to be a large deciding factor in all this and the way to get known is to answer the questions in tags that are most often used and viewed. And that basically means C# so chances are the \"winner\" will be one of the big C# contributors. That's going to exclude--or at least disadvantage--some otherwise good candidates.\n\nBut back to the FPTP system: just like in presidential elections, a vote for a minor party is a wasted vote. This'll change voting I think so that it will be *heavily* skewed towards 5 ppeople or less (imho). I'm certainly going to be interested to see the results.\n\nIt's hard to say if this process will achieve the desired outcome though because we don't really know what that outcome is, other than to have another moderator of unknown function."}, {"author_name": "litb", "gravatar_hash": "31a1c40a45079decc7f5525d2a873481", "author_url": null, "date": "May 07, 2009", "message": "Hey all :) I've just seen myself on that mod-vote page. It's so sweet but i'm afraid i wouldn't make a good mod. I missed to state it on that other blog-thread. \n\nThanks to all who felt litb was a good mod. But i guess I'm too much of a nerd to be a good mod anyway. Can someone remove me from that vote-list please? Cheers :)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 07, 2009", "message": "> I’m wondering if the voting should have instead been done using STV (http://en.wikipedia.org/wiki/Single_transferable_vote) or the like\n\nHow does STV help if only one person is being chosen? I'm reading that article and it seems you have to have multiple winners for that strategy to make sense?"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "May 07, 2009", "message": "@Jeff Atwood:\n\nAt the top of the article it says that in an election with one winner that STV is the same as Instant-runoff voting:\n\nhttp://en.wikipedia.org/wiki/Instant-runoff_voting\n\nI would actually greatly prefer this approach because it would enable me to select several candidates that I feel are best for the job and rank them. This way, if my first choice doesn't have enough votes to be elected, my vote will go to my second choice, etc. In situations, like this, where there are a lot of candidates, it's a much more fair process than whomever got the most votes."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "May 07, 2009", "message": "In Australia we actually use a preferential voting system (http://en.wikipedia.org/wiki/Preferential_voting). Basically it works like this:\n\nFor each seat there are a number of candidates. When you vote you put them in order from 1 to N. If someone gets more than 50% of the initial 1 (primary) votes they win. If not (this is often the case), the person with the LEAST primary votes gets eliminated. All those that voted for that person have their votes redistributed to their second choice.\n\nThis process continues until someone has more than 50% of the \"primary\" votes.\n\nIt's so much fairer than a FPTP system that I really can't believe how many countries continue to use FPTP and runoff elections."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "May 07, 2009", "message": "I wish the SO blog has an upvote functionality, because I'd be upvoting both nobody_ and cletus's answers. :-)\n\nBut yes, whether it's called STV, IRV, or PV (a rose is a rose by any other name), I'm in support of any of those. :-D"}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "May 07, 2009", "message": "@cletus: That's a great system! With that in place in the U.S., I'd have voted for Ron Paul (and I know a number of others who would have also). I can definitely see how it would help third/fourth/fifth parties get a foothold -- which is why it probably doesn't have a chance.\n\nAnyway, I still haven't voted for a moderator because none of the candidates is perfect; I'll probably just end up picking one at random right before the deadline."}, {"author_name": "toast", "gravatar_hash": "dd17763d6069a9697fbcfa67295e5064", "author_url": null, "date": "May 07, 2009", "message": "There's always a runoff style system.\nhttp://en.wikipedia.org/wiki/Nonpartisan_blanket_primary\n\nAnd you wouldn't have to change any mechanisms behind scenes."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "May 07, 2009", "message": "I agree that there are too few votes per user for so many candidates, but this isn't a bad system.  The echo chamber that is the blog and IRC people might be surprised at how the voting turns out when it's controlled by the 10,266 200+ rep users.\n\nI wonder if it will indeed be the most attractive or memorable avatar/name.\n\nFun stuff!\n\n-Adam\n\nReCaptcha: skyjack Hanoi"}, {"author_name": "Paolo Bergantino", "gravatar_hash": "80ae8ec34e9e3e66c5be50733afaa44e", "author_url": null, "date": "May 07, 2009", "message": "I got bored so I made a list of the top tag for each nominated user:\n\njava       2\nc++        4\nsql        1\nphp        1\npython     1\nsubjective 3\nc#         6\nc          1\njavascript 1\nmysql      1\n\nI am pretty sure whoever wins is going to end up being in the C# camp, and that only leaves the mysql/php/python/javascript questions (which I, admittedly, zealously monitor) without someone to settle conflicts. I know this was brought up in the original nomination post, but like it or not people are going to be more attentive to \"their\" tags than to others. Is anything going to be done to address this?"}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "May 07, 2009", "message": "@Paolo Bergantino: \"like it or not people are going to be more attentive to “their” tags than to others.\"\n\nI haven't found that to be the case.  The 10k+ moderator tools are tag agnostic, and usually the uber-moderator isn't going to need to do anything, except to those posts that are out of the ordinary, and they will show up in the tools.\n\nI don't think the moderator should take action on an item unless the normal community process isn't working.  So their normal browsing/asking/answering habits shouldn't actually make much difference.\n\n-Adam"}, {"author_name": "Greg Hewgill", "gravatar_hash": "747ffa5da3538e66840ebc0548b8fd58", "author_url": "http://hewgill.com", "date": "May 07, 2009", "message": "Like litb, I seem to have missed the original announcement of moderator nominations. (I was on holiday, read my blog if you're curious where I went!). Also like litb and Jon Skeet, I don't have a lot of interest in actually being a moderator, and was sort of surprised not to have been given the opportunity to accept or decline the nomination.\n\nI wonder how this voting process will work if the top voted user (whoever they are) declines the position."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "May 07, 2009", "message": "@Greg: that's an interesting point.\n\nJust for the record: are you withdrawing or would you accept?\n\nAnyway, that issue wouldn't be a problem with a preferential system. You simply rerun the vote as if that person and any votes for them didn't exist (so it would start with some people's secodn choice being treated as their first).\n\nI agree that people are more attentive to \"their\" tags, which is why I brought up the issue that the next moderator will most likely be another C# guy.\n\nThe other issue though is timezone. It's not terribly useful if, say, all the mods are only active in the same 10-12 hour window. We should be striving for more coverage than that so should be looking at who is active when the other mods currently aren't."}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": null, "date": "May 07, 2009", "message": "Please Mister Atwood, can I have my vote back?"}, {"author_name": "Imran", "gravatar_hash": "09d9b10ad83581c21328d44e48c77b9d", "author_url": null, "date": "May 07, 2009", "message": "Why can't we change our vote once it's cast? (not that I regret my choice)"}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "May 07, 2009", "message": "@Sam, @Imran: Your vote is precious, and it is donated to charity immediately upon use, to feed internet orphans.\n\nDo you really want to take your vote back from those bandwidth hungry orphans?\n\nPlease reconsider.\n\n-Adam\n\nrecaptcha: inanest\nHow does it _know!?!_"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 07, 2009", "message": "votes for moderator candidates who recused themselves were returned, and a message was inserted into these users' stackoverflow notification queue to let them know they can vote again."}, {"author_name": "Jason Punyon", "gravatar_hash": "44302dd1c18f747ba4fff5f689c475ba", "author_url": "http://jasonium.com", "date": "May 10, 2009", "message": "How long before people want the poll functionality for their own SO questions?\n\ncaptcha: serges TorrobaSabicas"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "May 10, 2009", "message": "@Jason: That's opening up a huge can of worms, in my humble opinion.\n\nShould that be implemented, should a preferential voting system be in place, at least at the option of the poll maker? (See comments above.) What rep threshold is required to cast? (In the case of non-preferential voting:) Should poll results be viewable before the poll is closed? How long should the poll be? Should people be able to adjust their votes during the lifetime of the poll?\n\nShould there be more than one question allowed in the poll? If so, how many?\n\nIn a way, I'm playing devil's advocate; however, I feel that some features are much harder to make \"publicly available\" than it is to be usable for the site owners only."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "May 10, 2009", "message": "Recommended reading, on the complexity of implementing seemingly-simple things:\n\nhttp://steve-yegge.blogspot.com/2009/04/have-you-ever-legalized-marijuana.html"}, {"author_name": "Jason Punyon", "gravatar_hash": "44302dd1c18f747ba4fff5f689c475ba", "author_url": "http://jasonium.com", "date": "May 10, 2009", "message": "@Chris: I was half joking.  I think most of the SO users know that Jeff and Co. are making the site better and they're fine with that.  There's a small percentage that see functionality and WANT NOW.  Someone will demand that the poll functionality be added to the site for general use even though that's not the intent of the site..."}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "May 11, 2009", "message": "So when does the voting end? Must be within a day or two. Will we get to see the complete results or just who the winner is?\n\nCaptcha: Elly subjoin"}, {"author_name": "mmyers", "gravatar_hash": "3dd46fff5f873b7026ba6bae47a0f3b4", "author_url": "http://stackoverflow.com/users/13531/mmyers", "date": "May 12, 2009", "message": "My voting method:\n\n1. Make a spreadsheet with as many relevant statistics as possible on all the candidates, plus myself and Jon Skeet as controls (yes, I know Jon Skeet is not a data point).\n2. Ignore most of the statistics.\n3. Filter out anyone who has c# or subjective in their top three tags (c# for reasons mentioned earlier, and subjective so people won't have leverage on the new moderator. Can you imagine what would happen if Bill the Lizard closed a question for being subjective and off-topic, while leaving Jon Skeet Facts open?). That leaves only five candidates: Jonathan Leffler, Shog9, Bill Karwin, Paul Dixon, and Tomalak.\n4. Filter out anyone from the US (that way, all the moderators won't be asleep at the same time). That leaves Paul Dixon and Tomalak.\n5. Randomly decide between the two.\n\nI chose Paul Dixon; may the best person win!"}, {"author_name": "cletus", "gravatar_hash": "2f364c2e36b52bc80296cbf23da8b231", "author_url": null, "date": "May 15, 2009", "message": "Isn't the week for voting up? Aren't we overdue for an announcement/decision?\n\nWho is the lucky winner?"}, {"author_name": "Danny Wilson", "gravatar_hash": "0b15e2fcef0b5ad3e0a3151ee621223e", "author_url": "http://onlinetouch.eu", "date": "Jun 05, 2009", "message": "Hey Jeff and Joel,\n\nI'm listening to this episode right now and was wondering if you guys ever heard of http://seleniumhq.org/  .. i guess not. Could be helpfull in testing the UI part of the website."}]}