{"response": [{"author_name": "Chris", "gravatar_hash": "b6b87721c444078a99633d6ed9352cec", "author_url": null, "date": "May 30, 2009", "message": "So when will SU launch?\n\n4-6 weeks? :-)"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "May 30, 2009", "message": "Is this the $10k domain name?\n\nhttps://twitter.com/codinghorror/status/1965603283\n\nAnother thing: will discussion of SO/SF/SU be allowed/encouraged on SU? If so, this will definitely solve the meta-discussion problem."}, {"author_name": "Marco", "gravatar_hash": "e7f3eb127c979c3be007f1134944e7cd", "author_url": "http://www.marco.org/", "date": "May 30, 2009", "message": "Congratulations, guys. It's a great name, and it's wise to provide a place for the sort of discussion.\n\nI'm glad to see Stack Overflow doing so well and expanding so quickly."}, {"author_name": "Darren", "gravatar_hash": "bb40691d8b7509db80e7679e2bed33fe", "author_url": "http://codesmart.wordpress.com", "date": "May 30, 2009", "message": "Fantastic!  Just what the PC Doctor ordered!"}, {"author_name": "gyaresu", "gravatar_hash": "97c2512d40d3d5df4e09fed853795ff2", "author_url": "http://gyaresu.org", "date": "May 30, 2009", "message": "This is going to be interesting."}, {"author_name": "Nathan Bowers", "gravatar_hash": "8ef1faca1032b44b8ca486a4e52501ed", "author_url": "http://uxhero.com", "date": "May 30, 2009", "message": "It would be nice if we could keep identity and rep across SO, SF, and SU instead of starting over.\n\nDig the name. SuperUser is more optimistic than the names of your other properties :-)"}, {"author_name": "d03boy", "gravatar_hash": "f22989906d98bcccf76f16fcf33d7c08", "author_url": "http://codertips.com", "date": "May 30, 2009", "message": "Very happy to hear this. Now if only it was shared rep :)"}, {"author_name": "dennis", "gravatar_hash": "215056e1d2d4b5ce5f5837c445dba4d5", "author_url": "https://twitter.com/CoderDennis", "date": "May 30, 2009", "message": "Shared  rep isn't a good idea. Being an expert in one area doesn't make one an expert in all areas. Great trilligy analogy! Looking forward to the new site. Cool domain name!"}, {"author_name": "Kevin Peterson", "gravatar_hash": "abbf0dee6e6967ebcbcb9f5261442365", "author_url": "http://kdpeterson.net", "date": "May 30, 2009", "message": "I'd argue that shared rep isn't a horrible idea. I'd say best case would be shared rep, but with an icon indicating which site was the largest contribution to your rep.\n\nIf not shared rep, shared accounts with different rep on different sites would be nice."}, {"author_name": "tom", "gravatar_hash": "80249086b1bd0d24c2307fe787b55e91", "author_url": null, "date": "May 31, 2009", "message": "Crying for shared rep between the sites misses the point:  Your reputation is a measure of how active you are on the site, and how much your answers and input are appreciated.  \n\nIf it's from another site than the one your on then it doesn't measure anything useful.  \n\nIf you have no rep on the new site, then it's because your not a part of that community, so either get out and earn some or ignore it because you don't go there anyway!"}, {"author_name": "Jarrod", "gravatar_hash": "2dfa19bf5dc5826c1fe54c2c049a1ff1", "author_url": "http://stackoverflow.com/users/3", "date": "May 31, 2009", "message": "Caveat: superuser.com will allow no use of \"Jar Jar\"; coding that in right now.\n\nThe trilogy shall remain pure."}, {"author_name": "Ivan Zhakov", "gravatar_hash": "cab853284719020f2c0a1961a51a81ea", "author_url": null, "date": "May 31, 2009", "message": "I am surprised why the superuser and not entrepreneurship as Joel's business of software forum?"}, {"author_name": "jimka", "gravatar_hash": "fa1789adb2c7c3062c3323cdd3d22a8c", "author_url": null, "date": "May 31, 2009", "message": "I hope that's not the official logo :D"}, {"author_name": "Jakub Narębski", "gravatar_hash": "672aa8b373071ef9f06db563d1c08d77", "author_url": null, "date": "May 31, 2009", "message": "Would there still be problem maintaining the same identity across different services using Google OpenID provider?"}, {"author_name": "rob", "gravatar_hash": "33641b106d8d05737ab4792a6c833891", "author_url": null, "date": "May 31, 2009", "message": "Paying some domain squatter is over rated. Google is where the traffic comes from"}, {"author_name": "Sam Hasler", "gravatar_hash": "5377323bbe24824de512a6a077fc77a3", "author_url": "http://sam.haslers.info", "date": "May 31, 2009", "message": "&gt; Caveat: superuser.com will allow no use of “Jar Jar”;\n\n@Jarrod got something against Java? ;)"}, {"author_name": "Click Upvote", "gravatar_hash": "833df8cee775eea743cb1172dfcd3809", "author_url": null, "date": "May 31, 2009", "message": "On superuser can we also ask discussion questions?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "May 31, 2009", "message": "> On superuser can we also ask discussion questions?\n\nthe rule is that your question has to be about computers. We already have valid discussion questions on SO and SF ; I don't know why SU would be any different in that regard.\n\n> will discussion of SO/SF/SU be allowed/encouraged on SU?\n\nDiscussion of SO/SF/SU is not about computers, is it?"}, {"author_name": "kibbee", "gravatar_hash": "2b568071163c0d009635cfa63cf6e6ac", "author_url": "http://www.kibbee.ca", "date": "May 31, 2009", "message": "Great that people finally have a place to ask the non-programming, non-sysadmin type questions, but I worry about this site. I wonder who will want to sit around and answer questions like, Why doesn't my video card work.  Which will be followed up with answers like, \"Reinstall the driver\".  I mean if you had a quarter for everytime someone recommended \"reboot\" or \"reinstall\" as the solution to a problem, you'd probably be a very rich man.  Anyway, I just feel like it would be the blind leading the blind, and that all the people with a lot of knowledge to fix these problems will be spending most of their time on more challenging and interesting problems on stackoverflow and serverfault.  \n\nAnyway, I don't mean to sound like a pessimist, and I wish you good luck with the new site, but I'm just a little leary of the \"everything goes\" type forum, where any type of question can be asked."}, {"author_name": "Tony", "gravatar_hash": "d550a813bf30f1a47849d49e2ba04c43", "author_url": "http://blog.tonyswebdesign.com", "date": "May 31, 2009", "message": "Great. Server Fault wasn't really my thing, but I can imagine myself using this site.\n\nI'm assuming your getting a better log (and one that matches the style of so/sf) for superuser?"}, {"author_name": "jake", "gravatar_hash": "87ea936495cdab72ce5965f2dbc7e601", "author_url": null, "date": "May 31, 2009", "message": "jeff,\nyou are the most provocative and annoying blogger i know to date the i still continue to read. this idea is the reason i have been looking for. the reason that keeps us coming back for more and more abuse.\n\nthanks jeff"}, {"author_name": "kip", "gravatar_hash": "c621039e41aef415ad25054da3bf3f9a", "author_url": "http://www.vacant-nebula.com", "date": "May 31, 2009", "message": "Of course, you can't expand any more now, or the fourth site will be doomed to be \"The Phantom Menace\", indisputably the worst movie in the series, and arguably one of the worst movies ever made, ever."}, {"author_name": "Ben Hyrman", "gravatar_hash": "ff84018dfd98f00105c3204d3e447b46", "author_url": null, "date": "May 31, 2009", "message": "I like it. However, how about a site that aggregates all three, StackFaultUser.com ;-)\n\nWait... if we worked a 'T' in there too..."}, {"author_name": "Jader Dias", "gravatar_hash": "3d575ee50a8388454791b5f8e2841ba2", "author_url": "http://hourlyapps.blogspot.com", "date": "May 31, 2009", "message": "@Jeff\n&gt; Discussion of SO/SF/SU is not about computers, is it?\n\nOf course it is! I mean, if get it right SU is not only about hardware, it is also about software, and software includes everything: SO, SF, SU, pc games, etc right?\n\nIt's even about biology if you think that everything is inside The Matrix (just kidding about the last one)."}, {"author_name": "Jader Dias", "gravatar_hash": "3d575ee50a8388454791b5f8e2841ba2", "author_url": "http://hourlyapps.blogspot.com", "date": "May 31, 2009", "message": "So when the logo design contest starts?"}, {"author_name": "Micheal J.", "gravatar_hash": "7c08fef7eb80784161013a4003cca497", "author_url": "http://chealion.ca", "date": "May 31, 2009", "message": "The Super User logo as it stands now *is not* the logo that will actually be used correct?\n\nI'd much rather see a logo that fits in style with the other two *and* doesn't feel like I'm enjoying the 1990s with animated gifs, word art jpgs and Under Construction signs everywhere."}, {"author_name": "Mike", "gravatar_hash": "c98e188ba63a7875d61a77d7aaa3f5c7", "author_url": null, "date": "May 31, 2009", "message": "I can't help but feel a bit sceptical about this. Digg was originally a tech website and look how that went. If people are given such a long leash I can't help but see SU becoming nothing but a general tech forum. I was hoping for a theoretical website, like for Computer Science, as the amount of students visiting SO looking for help from disgruntled programmers in the real-world warrants it.\n\nEither way, I hope I'm wrong and that this website turns out to be a success. Now, I'm off to make a SO-clone CS website..."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "May 31, 2009", "message": "So what exactly is this? I mean, really, I don't understand exactly. Someone mentioned Digg. Is this like where you rate your favorite social bookmarking site or your \n\nI know the description there of ServerFault is for \"Sysadmins and IT Professionals\" but I mean that's really just kind of a vague way saying \"computer/network/etc related problems.\" If someone wants help diagnosing POST problem with some motherboard they bought, it makes sense to go to ServerFault. Otherwise, you're just fracturing.\n\nAlso, as far as a CS clone of SO; eh, I don't think so. Why can't that be serviced by SO? Sure, on some of those questions there are anti-intellectual, \"academics is ivory tower bs\" sort of nonsense responses but you can just ignore or downvote those people. That's just too much fracturing."}, {"author_name": "kunjaan", "gravatar_hash": "d524b69e8957a7c88f2e4a9bd65cd970", "author_url": null, "date": "May 31, 2009", "message": "I dont understand. Will it be \"How do i fix my computer\" forum or \"What are the models of computation\" forum?"}, {"author_name": "Paul", "gravatar_hash": "69f504d0e0c2c7d7b7215f488b028edd", "author_url": "http://tardate.blogspot.com", "date": "May 31, 2009", "message": "Ben Hyrman says:\n&gt; I like it. However, how about a site that\n&gt; aggregates all three, StackFaultUser.com ;-)\n\nYes, I think I want SuperServerOverflow.com;-)\n\nI'm a big fan of what Jeff and Joel are doing, but I've been wary of the tack they've taken to cement brick walls in place between the \"programmers\", \"sysadmins\" and soon perhaps \"power users\". \n\nI think I'd prefer it to be more like a virtual communities sharing a common infrastructure (not just code). Feel and behave like separate sites most of the time, but let you work in the grey areas just as easily...\n\nOh well... but for now, I'm keen to see how the new site evolves."}, {"author_name": "Paul D. Waite", "gravatar_hash": "240d5b71429f8b782b029e19349ec435", "author_url": "http://pauldwaite.co.uk/", "date": "May 31, 2009", "message": "Woo! Nice going guys, sounds excellent."}, {"author_name": "Craig Oliver", "gravatar_hash": "17632b8cd6c5f620cbbd7563b0bc4550", "author_url": "http://www.craigmoliver.com", "date": "May 31, 2009", "message": "So what's next?  Three crappy prequels?"}, {"author_name": "Damien", "gravatar_hash": "10d86b0f045954872d8b184d0737ff42", "author_url": null, "date": "May 31, 2009", "message": "Have you considered a discussion forum for the meta-discussion and community stuff?"}, {"author_name": "Donny V", "gravatar_hash": "67846ae2be88daca08dac5117c677305", "author_url": "http://comicsinventory.com", "date": "May 31, 2009", "message": "I understand why you guys are doing this. This is like the commercial version of SO. Basically its for any Joe that has a computer question. Should be a great money maker with the ads. You can get dell ads now. ;-)"}, {"author_name": "Mike Wills", "gravatar_hash": "c6f775f60a5fcbb079b6afad351e8d53", "author_url": "http://mikewills.name", "date": "May 31, 2009", "message": "Is the site live? I can't hit it."}, {"author_name": "Stephen A. Goss", "gravatar_hash": "06f4639cd80930603ddc21a248673c2e", "author_url": "http://blog.deliciousrobots.com/", "date": "Jun 01, 2009", "message": "This is fantastic, I felt like suggesting a site like this, but it seemed too obvious. I was afraid there would be a few more specific sites (computer-builders, software-testers, etc) before we just got the everything-else-computer-related-goes site. BTW, which site would professional software QA people go to? Depends on the question? SO for tool scripting, unit test building, SF for test server deployment and maintenance, and SU for everything else? \nCAPTCHA : appearance surly"}, {"author_name": "Ohmz", "gravatar_hash": "40bd6fa511aed8cab1e12bb104b88b4e", "author_url": "http://www.ohmz.net", "date": "Jun 01, 2009", "message": "@Stephen A Goss: I think there are many testing questions already on sack overflow, as in manuy companies the programmers also do the testing. (Sadly)\n\nThis is great When does the Beta start?"}, {"author_name": "Alistair", "gravatar_hash": "a79d49c9011206ca3bf940f9ce545fab", "author_url": "http://www.lyxi.co.uk/", "date": "Jun 01, 2009", "message": "BobbyShaftoe: diagnosing a random user's POST problems is exactly what ServerFault is NOT there for, and what SuperUser is designed to help with.  ServerFault is for people who are managing other people's machinery as part of their (paid or non-paid) role; SuperUser is for \"experienced\" computer users with problems with their own/local setup."}, {"author_name": "Mike", "gravatar_hash": "4b036005dc3205b2a19ef616d8ca2ee6", "author_url": "http://Www.Beweb.co.nz", "date": "Jun 01, 2009", "message": "Hey, I like the logo!"}, {"author_name": "Andrea", "gravatar_hash": "d442474b9c83d51a32049cd3f61cb44f", "author_url": null, "date": "Jun 01, 2009", "message": "While SO and SF _need_ to be in English I think you should localize SU. A potential user of SO or SF would google directly in English, a potential user of SU would not. If you ever need to translate it in Italian I'd be happy to help you :P :)"}, {"author_name": "Daniel Martin", "gravatar_hash": "cf6d0868b2b4c69bac3e6f265a32b6a7", "author_url": "http://dtm.livejournal.com", "date": "Jun 01, 2009", "message": "@Kibbee: In reference to your statement \"Anyway, I just feel like it would be the blind leading the blind, ...\", I \"worry\" about that too, but I already consider sections of stackoverflow as having devolved into that.  There's something broken in the behaviors the reputation/voting system encourages - that I'm not smart enough to propose a solution for or even completely diagnose - that leads to herd voting FAILs such as is seen if you search for \"Bubble sort homework\"."}, {"author_name": "Adam Davis", "gravatar_hash": "51301603f62b97a6fecdeeb3a5d41eca", "author_url": "http://www.ubasics.com", "date": "Jun 01, 2009", "message": "Interesting!  Instead of a well defined theme, superuser is simply defined as what it is not.\n\nBy providing such a 'pressure relief valve' though, the editors and moderators can take a harder line on SO and SF, and simply shuffle the questions to SU that are even close to the line of not being programming or IT related.\n\nBTW, I think the naming scheme is now firmly set.  The name must be a two word name, with the first word starting with an s.  The second word describes a major problem in the field - fault, overflow, and user.  If we got rid of all the faults, overflows, and users we'd eliminate ~78% of the problems in these fields.\n\nThis means the food version (computer user nourishment website) will probably be called 'saltyfat' - it both describes the main ingredients of the snacks of choice for most computerusers, the first word starts with s, and fat is a major problem for a lot of people interested in this topic.\n\n-Adam"}, {"author_name": "Paul", "gravatar_hash": "69f504d0e0c2c7d7b7215f488b028edd", "author_url": "http://tardate.blogspot.com", "date": "Jun 01, 2009", "message": "Alistair says:\n&gt; BobbyShaftoe: diagnosing a random user’s POST\n&gt; problems is exactly what ServerFault is NOT there \n&gt; for, and what SuperUser is designed to help with.\n&gt; ServerFault is for people who are managing other\n&gt; people’s machinery as part of their (paid or\n&gt; non-paid) role; SuperUser is for “experienced”\n&gt; computer users with problems with their own/local setup.\n\nAlistair, there is only one glaring problem with this.\n\nHow do you think help desk systems like Remedy work? Years of experience have shown that the most efficient workflow is achieved by having all users (expert and newbie alike) come through the same \nchannel, after which they can be triaged (something we IT types belated learned from the medical profession).\n\nI would prefer to see the SO-cousins working in this mode. The question may initially be asked on serverfault as a sysadmin question. Other community members may recognise it as a scripting/programming problem and flag it for stackoverflow (at which point the question appears in both contexts). The eventual answer may be an Excel power user hack and the community may decide to narrow the question down to superuser.com only.\n\nBy segmenting users at the point of entry, the system fundamentally destroys any ability to shuffle, share and expose people to the relevant communities.\n\nListen to the stackoverflow podcast to prove the point. I have lost count of the number of times Jeff &amp; Joel have started talking about some stupid newbie question (suitable only for SuperUser.com), only to later conclude that it helped bring out some really useful point (that deserves to be on StackOverflow)"}, {"author_name": "Bob", "gravatar_hash": "9b9a000ea1b4f9f9a083a32a3bdd1a0a", "author_url": null, "date": "Jun 01, 2009", "message": "I agree that rep shouldn't be shared across the sites, but I think it would be nice and helpful if the moderation abilities you have are shared across the sites. \n\nSo your moderation abilities for any site would be determined based on your highest rep across all the sites.\n\nThis would be especially helpful when the sites first launch."}, {"author_name": "Dillie-O", "gravatar_hash": "27ff4e53d6db5e5233fcdbf412604541", "author_url": "http://dillieodigital.net", "date": "Jun 01, 2009", "message": "+1 on SuperServerOverflow.com\n\nSo I'm guessing SuperUser will be the ideal place to have a lot of those \"meta overflow\" type questions for best comic and the like without the edit/flame wars that ensue?"}, {"author_name": "MattH", "gravatar_hash": "8364802a3e4700212ed0807fbe008cb8", "author_url": null, "date": "Jun 01, 2009", "message": "Congrats!  I love the SO engine and it's great to see the horizons broadening.\n\nI definitely see a challenge in differentiating between ServerFault and SuperUser.  I grok the difference, but I suspect there are a lot of superusers that *think* they are system administrators."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jun 01, 2009", "message": "@Alistair,\n\nWhat is the qualitative difference between:\n\n\"My motherboard won't POST\"\n\nand \n\n\"The motherboard belonging the company that pays me hundreds of thousands of dollars a day won't POST.\"\n\nIf there are more experienced people at SF, I'd rather put my question there than the digg like site. It seems strange."}, {"author_name": "BobbyShaftoe", "gravatar_hash": "526f22eb98e81ea305bdcf777e4f733d", "author_url": null, "date": "Jun 01, 2009", "message": "@MattH\n\n\"I definitely see a challenge in differentiating between ServerFault and SuperUser. I grok the difference, but I suspect there are a lot of superusers that *think* they are system administrators.\"\n\nI get what you're trying to say, but I could also say \"I know a lot of system administrators that *think* they are (real) system administrators\" or you could say the same for programmers etc.  I mean I think its the same sort of crass distinction someone would make if they said \"Since we have StackOverflow for programmers can we have a ScriptErrorResumeNext site for people who use VB?\"\n\nI agree with what @Paul said. To say ServerFault is just for some group of elite system administrators or people managing Big Iron is a bit silly. Jeff talked about wanting to use SF to answer his questions, particularly about issues hosting SO, SF, and so forth. SO certainly doesn't run on Big Iron and neither are most people working on that. If they are, great, let's add them to the mix. Also, if someone is an active contributor to the [cisco-pix] and [cisco-router] tags but has some strange Word problem on his home laptop, why shouldn't he be able to ask his regular community?"}, {"author_name": "Klelky", "gravatar_hash": "24b0bc1aa9599ca5b59300376b12a8b2", "author_url": null, "date": "Jun 02, 2009", "message": "I think its a good idea (I've just seen my first question on ServerFault tagged as should-be-onsuperuser which is why I'm here!) but...\n\nThe thing that I really like about SO is that all of the questions are in one place and you find what you want through the tags. Driving these artifical walls between things seems to be against that idea. Are the moderators going to spend a lot of time shifting questions between forums and are the users going to know where the questions have disappeared to?\n\nThe cynical part of me sees this as a way of dividing the market so that ads can be more easily targeted - but surely thats not necessary as the ads could be tailored to the content being viewed?\n\nAnyway - I've been waiting for the equivalent of SU to come along and based on the good work done so far on SO I'm sure it will be a success. Good luck!"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 02, 2009", "message": "@Klelky\n\nI think it's extremely rude to tag something as \"belongs-on-superuser\" when the site doesn't even exist yet, so I deleted the tag from your question. Also, I somewhat agree with your position on the  artificial/arbitrary divisions between the sites. While I'm not against the idea of having questions appear on one site versus another, I think that it could (and should) have been done in a way that allowed much more fluid movement between the sites (and even, potentially, coexisting on more than one)"}, {"author_name": "nobody_", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": null, "date": "Jun 02, 2009", "message": "@Klelky\n\nI just reread my first sentence, and it sounds like it's directed towards you, when it was intended for the retagger, Kara Marfia. Sorry for the confusion.\n\ncapcha: temple mishap"}, {"author_name": "Wedge", "gravatar_hash": "441c2fc2c06a0f9d736798d180e42154", "author_url": null, "date": "Jun 02, 2009", "message": "I look forward to using this site in 6-8 weeks."}, {"author_name": "Nicholas Flynt", "gravatar_hash": "37141b83346fb33de2a015cb0d536f99", "author_url": "http://www.darknovagames.com", "date": "Jun 02, 2009", "message": "To those who are questioning the difference between Server Fault and Super User, I personally think the difference is pretty clear.\n\nServer Fault - designed for administrators of large networks, or people dealing with remote servers. The software and technical issues here is mostly reserved for programs designed to deal with many clients at once, such as Apache.\n\nSuper User - a site for questions pertaining to a user's individual PC. Information here is more geared towards client-side programs, and Operating System configuration, such as installing Windows programs, and troubleshooting registry problems, etc.\n\nIt's not meant to be a distinction between \"I maintain a big business so my questions are more important\", rather, it's made to be a dividing line between the kinds of problems discussed. A server will be running very different software than a home PC. That said, if you're trying to set up something that *would likely* be done a lot on real business servers (like a test server for Apache, to use the example again) then your question is still quite appropriate for Server Fault. \n\nThe distinction is more to categorize the problems than to decide that certain problems are more important than others. Someone who is good at answering linux server problems doesn't want to have to wade through a sea of windows client problems to look for an answer, and vice versa. I think that's the point of them being separate sites.\n\nBut that's my opinion of course. I plan to use *both* sites, since I maintain a lot of different servers, and also consider myself a power user at home."}, {"author_name": "Drew Gibson", "gravatar_hash": "dc5e4e4387374e20efffa31eb7608ef9", "author_url": null, "date": "Jun 02, 2009", "message": "+1 for the new 3rd site guys... it was an obvious move but one that'll be gratefully received I'm sure :)\n\nCheers !"}, {"author_name": "Klelky", "gravatar_hash": "24b0bc1aa9599ca5b59300376b12a8b2", "author_url": null, "date": "Jun 02, 2009", "message": "@nobody_ To be honest, I thought the re-tagging was ok. It brought me to this blog post to find out what it was all about and if there are rules about what is meant to be on SF then I can see how my question was possibly not valid.\n\nBack to the main point about dividing the community... I think is really interesting that Jeff is going down this route as (inspired by Stackoverflow) I am really trying to push my work's disparate community discussion forums together.\n\nSomeone else above makes the point that google is the start point for most users, so maybe it doesn't matter that people are less likely to go from one site to another. Perhaps putting these divisions in place gives a focus to the sites for the regular users and there are less users than we might imagine who have an interest in more than one of the trilogy.\n\nAll that said - I think SuperUser could be huge in its own right!"}, {"author_name": "Peter Boughton", "gravatar_hash": "e915239e11bb00291ce4e4b17b83bc66", "author_url": "http://blog.bpsite.net", "date": "Jun 02, 2009", "message": "&gt;&gt; ... SO/SF/SU ...\n\nHeh, can't we have the official abbreviation of STackoverflow as ST ?\n\nThen it becomes: ST/SF/SU\n\n:D"}, {"author_name": "Dean Nolan", "gravatar_hash": "268787c7ffe5c47829ff7d6866afe22b", "author_url": "http://www.deannolan.co.uk", "date": "Jun 03, 2009", "message": "The talk about combining the three sites and the names that were posted reminded me of the South Park episode with ManBearPig. ;)\n\nHalf Man, half Bear, half Pig!"}, {"author_name": "Adam", "gravatar_hash": "75cb87c19b9980b9e235c88dc64c2099", "author_url": null, "date": "Jun 03, 2009", "message": "Can you guys add one more site something for Designers? Designflaw maybe? Because you guys keep closing interesting threads on usability because it's not directly programming related."}, {"author_name": "Jon", "gravatar_hash": "a6740001b6d51965cd4e8ebcc52e847f", "author_url": "http://www.jonwinstanley.com", "date": "Jun 05, 2009", "message": "Does anyone have the schema for the files? I am struggling importing them into SQL server.\n\nThanks,\nJon"}, {"author_name": "Matthew Martin", "gravatar_hash": "d4b54f20961e060c8bf09ddd72bac292", "author_url": "http://mistersql.com", "date": "Jun 07, 2009", "message": "Where will I post questions about scripting for Windows Home Server?"}, {"author_name": "Micheal J.", "gravatar_hash": "7c08fef7eb80784161013a4003cca497", "author_url": "http://chealion.ca", "date": "Jun 07, 2009", "message": "Is there any news about when the beta for SuperUser.com will be launching?"}, {"author_name": "Amr ElGarhy", "gravatar_hash": "82890754a297fb58779843f97f001556", "author_url": "http://amrelgarhy.com", "date": "Jun 09, 2009", "message": "Congratulations, just one hint, i see that the super user logo is not nice as the previous great logos for SO and SF.\nHope its not the final logo,\nBut this is just my personal point of view."}, {"author_name": "Svish", "gravatar_hash": "84683da772d924ce3c1de6b597d463f8", "author_url": null, "date": "Jun 11, 2009", "message": "Looking forward to that site! serverfault is not a very friendly site..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jun 16, 2009", "message": "logo design contest for superuser.com :\n\nhttp://blog.stackoverflow.com/2009/06/logo-design-contest-for-superuser-com/"}, {"author_name": "Pablo Santa Cruz", "gravatar_hash": "8bfe11db2bc539a6f339f3a044946153", "author_url": "http://pablo.tocorre.com", "date": "Jun 16, 2009", "message": "Awesome. Congrats Joel and Jeff. Great trilogy."}, {"author_name": "Syed Tayyab Ali", "gravatar_hash": "86d5460063b298b5c7574f8c95b5c1de", "author_url": "http://syedtayyabali.blogspot.com", "date": "Jun 17, 2009", "message": "It would be great hit."}, {"author_name": "Deepak Mittal", "gravatar_hash": "b3fb96ed6ade01960eec4deeacb540d3", "author_url": "http://www.IntelliGrape.com", "date": "Jun 18, 2009", "message": "Very nice. I am very excited to see it; and I hope it becomes as popular &amp; useful as SO &amp; SF."}, {"author_name": "Admir", "gravatar_hash": "5ea646ff4c1c89f3d68c546e37582c9a", "author_url": null, "date": "Jun 23, 2009", "message": "I do not know did someone already mentioned that will \nbe great if We can collect points from all three sites\nin one user."}, {"author_name": "Nicholas Bieber", "gravatar_hash": "cb9e249283eea099f5cc5a3e48fe04f4", "author_url": "http://assemblism.com", "date": "Jun 25, 2009", "message": "Did Noah get paid good money for his domain?  or did he get a shirt load of points and badges?"}, {"author_name": "Arnis L.", "gravatar_hash": "325c9f943f00dd67bdbe6a1ebd95e0cb", "author_url": null, "date": "Jul 04, 2009", "message": "Just wanted to say that logo is great (the one which won in contest)."}, {"author_name": "Hassan Yousef", "gravatar_hash": "a6156e47bb9ba0126c3ffabea7005778", "author_url": null, "date": "Jul 13, 2009", "message": "best of luck and success for your Trilogy"}, {"author_name": "Rog", "gravatar_hash": "090f49bf9b2e297229b3a89d9ab0933c", "author_url": "http://roggablog.blogspot.com", "date": "Jun 05, 2011", "message": "Can't wait for the prequels ;-)"}]}