{"response": [{"author_name": "Neil Fein", "gravatar_hash": "a3988c74befe682a08e8461f005106df", "author_url": "http://magnificentnose.com", "date": "Jan 28, 2011", "message": "Long overdue. I'm looking forward to seeing how this works in practice!"}, {"author_name": "Ward", "gravatar_hash": "f347c53c9cb1ddcb816daeb22aaf89c8", "author_url": null, "date": "Jan 28, 2011", "message": "I wonder how many people are like me: don't care.  \n\nLike a lot of people, I watched Area51 in the beginning to see what was happening with a few proposals I liked, but now I check maybe once every couple of weeks, and never poke around much.\n\nMaybe an Area51 meta will get some people back in..."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 28, 2011", "message": "> I wonder how many people are like me: don’t care.\n\nThat's completely normal!\n\nIt's akin to local government: do you really care what's going on with the government of your city, town, or state right now?\n\nSome people do, but the typical case is that you care most when something you care about is being proposed to discussed. In other words, when a law is introduced to make {thing you love} illegal.. or a zoning ordinance is being passed that lets your business operate in a certain area.. or the speed limit is changed in your neighborhood to protect your kids.\n\nI would only expect people to participate heavily on Area 51 during the time when <b>a site proposal they care about</b> is in discussion, commitment, or beta phases."}, {"author_name": "Jonathan Sampson", "gravatar_hash": "a7d4d02a322cf02edc7f4ce8e699dc7f", "author_url": "http://sampsonblog.com", "date": "Jan 28, 2011", "message": "Great new addition, although this image of a bull getting antsy waiting for the gate to open so it can begin bucking sticks in my head as people probe attractive site suggestions that are not yet launched - they're just itching to ask, answer, and dialog."}, {"author_name": "Benny", "gravatar_hash": "5b6b13aff53a1540e83e59410d5139c4", "author_url": "http://www.bens-wiki.co.cc/", "date": "Jan 28, 2011", "message": "At last. A place were we all can fight if our sites should be comined!\n\nAt least I can debate the Sports one with BenV."}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Jan 31, 2011", "message": "Maybe this will finally allow a sports proposal to get off the ground!"}, {"author_name": "Evan Plaice", "gravatar_hash": "9798931483c6fe5af55ec68698ffd0a0", "author_url": null, "date": "Feb 05, 2011", "message": "I'll personally fight a generic sports proposal. The issue of organically growing sports proposals is the scope of the current community not the scope of the proposals.\n\nI mean... 202+ technology proposals? Really?"}, {"author_name": "Mike Wills", "gravatar_hash": "c6f775f60a5fcbb079b6afad351e8d53", "author_url": "http://mikewills.me", "date": "Feb 09, 2011", "message": "I have a great idea for a Government 2.0 site for IT people in government to see how others have done solved x problem. But I can't see the proposal link anymore was it removed?"}]}