{"response": [{"author_name": "Adam", "gravatar_hash": "fcbf8b1d0bffb1b55239250bd3e1f321", "author_url": "http://suspensaodedescrenca.worpdress.com", "date": "Jan 08, 2011", "message": "Wouldn't it be acceptable to add a comment to a answer reporting that it worked and thanking for it?"}, {"author_name": "Bill P. Godfrey", "gravatar_hash": "760bfd359153d0682dbe113dc02f81ba", "author_url": "http://billpg.com/", "date": "Jan 08, 2011", "message": "How about allowing a low-rep user to comment, but hiding it until someone approves it?"}, {"author_name": "Macneil", "gravatar_hash": "b0ca2e8d2ef589088de0420f0661f52b", "author_url": "http://profshonle.blogspot.com/", "date": "Jan 08, 2011", "message": "How about allowing provisional upvotes? Any user can click on \"up,\" but they won't count until they've gained the required rep. This could give users an incentive to gain reputation: The \"investment\" in upvotes they've made is waiting for further action."}, {"author_name": "James", "gravatar_hash": "73b68dc9e874bd9295d39cda7cd5a231", "author_url": null, "date": "Jan 08, 2011", "message": "thanks"}, {"author_name": "swapneel", "gravatar_hash": "8041c86d00df369e606d713181316955", "author_url": null, "date": "Jan 08, 2011", "message": "How about a Thank you button (same as facebook the Like button) which will allow any user to say thank you."}, {"author_name": "Dan Fabulich", "gravatar_hash": "0ded147122e1c318a63340568904762b", "author_url": null, "date": "Jan 08, 2011", "message": "I think this proposal goes against human nature.  The point of saying thank you is to make a personal (ideally public) gesture of gratitude. \n\nPaying it forward doesn't fill any of the social roles that \"thank you\" does.\n\nEven upvoting, when allowed, doesn't do the right thing, because upvoting is anonymous.\n\nThere should be some non-anonymous thing I can do to communicate that I (personally) appreciate your response.  Until that happens, you'll just get more answers like \"Thanks!  Oh, here's some extra text to try to fill up 30 characters.\"\n\nPeople have suggested a \"Like\" button; Quora has an explicit \"Thanks\" button.  Both of those work.\n\nFurthermore, I think you'll see a lot more people posting great answers when they get the positive feedback from a personal \"Thank You.\"  It feels good to receive thanks.  Why cut off a positive social outlet like that?"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jan 08, 2011", "message": "I kind of like the idea that @swapneel mentioned, a simple thank you button.  Sort of like facebooks \"I like this\".\nI just don't know the best way to implement such a mechanism.  Would we allow anyone to click the \"Thank You\" link / button or only allow the originator of the question?\n\nBut I do agree with Jeff that it was worth doubling the count of characters for an answer.  Short answers are usually not good answers."}, {"author_name": "Neil Fein", "gravatar_hash": "a3988c74befe682a08e8461f005106df", "author_url": "http://magnificentnose.com", "date": "Jan 08, 2011", "message": "I agree with @Dan, a thank-you really needs to be immediate and public. However, I don't see any harm in making new users wait a little while before they can do that. Perhaps shorten the period until they can comment? That would solve more than one problem! \n\nThe */review page is wonderful, I've already found a question on bicycles that needed attention. Is it visible to all users or just mods?"}, {"author_name": "Amirreza Soudi", "gravatar_hash": "50fcd5e3783a9d9cbc9844b02f7553d2", "author_url": null, "date": "Jan 08, 2011", "message": "I think you must add Thanks vote similar to normal vote, but in thanks vote all member can see who thanks this person."}, {"author_name": "McDowell", "gravatar_hash": "9061706d2661cf0fa9f2df0eee56cf9b", "author_url": "http://stackoverflow.com/users/304/mcdowell", "date": "Jan 08, 2011", "message": "I like the review pages but feel the \"first answers\" and \"first questions\" pages would work better if the lowest ranked posts came first.\n\nQuestion pages are already quite busy. I wouldn't like the clutter of extra \"Thank You\" gubbins."}, {"author_name": "MPelletier", "gravatar_hash": "d66398326ad20e17b924b6efae9a7a33", "author_url": null, "date": "Jan 08, 2011", "message": "Thanks for doing this Jeff. You're making SO a better place.\n\n\n-- Warning, this comment is flagged for deletion."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 08, 2011", "message": "> Question pages are already quite busy. I wouldn’t like the clutter of extra “Thank You” gubbins.\n\nThis is my thinking as well. Thanks is nice and all, but it's ultimately *clutter*. And compared with paying it forward and contributing another valid answer, well, there's no comparison. We explicitly suppress the former in favor of the latter and rightly so.\n\nHowever, this idea of \"pending upvotes\" is interesting. I wonder if we could just let unregistered and under 1 rep users 'pretend' to upvote and have the incremented count show just for them but for nobody else.\n\n> I like the review pages but feel the “first answers” and “first questions” pages would work better if the lowest ranked posts came first.\n\nTricky because there are two goals here -- reward great stuff and flag not-so-great stuff. I don't want it to become a punitive tool."}, {"author_name": "Felix", "gravatar_hash": "2863e506256679592c6d824b2a1b69a5", "author_url": null, "date": "Jan 08, 2011", "message": "You could provide a list of users who upvoted a certain post (similar to Facebook's likes, where you can get a list of users who liked something). Going further, you could also show a list of users who downvoted a post, which would (hopefully) make them feel more obliged to also leave a comment."}, {"author_name": "tim", "gravatar_hash": "c3f783693e0a6dc68407a617d1a64864", "author_url": null, "date": "Jan 08, 2011", "message": "The fact that votes are anonymous is probably the major driving force for the \"thanks\".  People want their thanks attributed.  f you can figure out a way to do that within y our system you will likely take away all motivation for a written \"thanks\".\n\nI know that there are many times my questions are not so easy to answer and the solution comes after piecing together information from multiple posts.  No single one is accepted or better than the others, so perhas a +11 for an upvote form the original asker?\n\nI dunno - in any case, find a way to take away the motivation/replace it and you'll fix the behavior you don't like."}, {"author_name": "MPelletier", "gravatar_hash": "d66398326ad20e17b924b6efae9a7a33", "author_url": null, "date": "Jan 08, 2011", "message": "Looking at the result pages, I'm really surprised that, for \"thanks\" analyses, the simplest of criteria was most likely not included: answerer's user ID is the same as the asker's. It's very often the case, but you'd think those cases would be investigated first and be given top priority."}, {"author_name": "bear in the woods", "gravatar_hash": "a72bf0cec516c5bb4b8ef648d6d028e0", "author_url": null, "date": "Jan 08, 2011", "message": "Dan has pointed out the crux of the issue:\n\n\"I think this proposal goes against human nature. The point of saying thank you is to make a personal (ideally public) gesture of gratitude.\"\n\n\"Paying it forward doesn’t fill any of the social roles that “thank you” does.\"\n\nInstead of trying to have pending votes, special flags, restrictions on new users, etc ... have a special \"Thanks it worked for me\" counter, which is entirely separate from the question or it's upvotes.\n\nThis provides another metric for not only the validity of the question, but also the usefulness and suitability of the answer which was given.\n\nOver time, the number of 'thanks' can also improve the voting/ranking/quality considerations of the question itself.\n\nTL;DR: Add a \"THANK YOU (non-anonymous)\" counter as a second metric of question/answer quality."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 08, 2011", "message": "> The fact that votes are anonymous is probably the major driving force for the “thanks”.\n\nNo, the driving force is that these users either don't want to register, or don't have 15 reputation. And answering is the one thing you can do <i>immediately</i> as a brand new anonymous user.\n\n> Wouldn’t it be acceptable to add a comment to a answer reporting that it worked and thanking for it?\n\nIt’s not great, but it’s far more acceptable than an answer of the same form.\n\nThe best “thanks” comments do more than just say “+1 thanks!”; they add some nugget of additional information, such as “I can confirm this works in Zorblitz 3.5 too!”"}, {"author_name": "MPelletier", "gravatar_hash": "d66398326ad20e17b924b6efae9a7a33", "author_url": null, "date": "Jan 09, 2011", "message": "How about a rule that users under 15 rep can't answer their own questions? Problem solved at the root."}, {"author_name": "Sergey", "gravatar_hash": "ba3471d06663efdc5407cce51ab6a87d", "author_url": null, "date": "Jan 09, 2011", "message": "How about integrating Flattr into topics/answers?\nThis way users will be able to add flattr IDs to their profiles, and every \"Thanks\" will bring them a bit of money."}, {"author_name": "Scott W.", "gravatar_hash": "7a03f436e9458527368e5eaa45f85d40", "author_url": "http://moms4mom.com/", "date": "Jan 09, 2011", "message": "Well, if you had a \"This helped me!\" button (similar to the Like button) then you could use it to display your pay-it-forward message, so you're teaching at the same time that you're fixing a problem (removing the incentive to leave short thank-you messages).  Just a thought."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Jan 09, 2011", "message": "&gt; How about a rule that users under 15 rep can’t answer their own questions? Problem solved at the root.\n\nThat would only solve a fraction of the problem.  The large majority of \\thank you\\ answers that I see are not posted by the person who originally asked the question.  In addition to that, the person who asks a question can already post comments on any answer regardless of their reputation, so they already have the option to specifically thank the answerer that helped them."}, {"author_name": "Ryan T", "gravatar_hash": "6c08091427764bcb7e0623c69603c27c", "author_url": null, "date": "Jan 09, 2011", "message": "Dan Fabulich nailed it. This proposal goes against human nature."}, {"author_name": "Richard", "gravatar_hash": "5c02448625cbd7b19e68f93bcbaaabed", "author_url": null, "date": "Jan 10, 2011", "message": "Why not make it so that everyone can see who up voted a particular post? You don't have to display it right there on the page as it would probably add some clutter but just so that if anyone wants to look they can see who up voted them.  That way the poster gets public credit and the up voting system gets used an intended."}, {"author_name": "Rocket", "gravatar_hash": "31975d063f893b2551f6f7d5ed6bfa8e", "author_url": "http://NTICompassInc.com", "date": "Jan 10, 2011", "message": "+1 Thank you :-D"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 10, 2011", "message": "> Dan Fabulich nailed it. This proposal goes against human nature.\n\nHuman nature ain't all it's cracked up to be.\n\nhttp://meta.stackoverflow.com/questions/74372/non-anonymous-thanks-or-like-button/74420#74420"}, {"author_name": "Franck", "gravatar_hash": "718cc04f852856ec562ea7cd7095b873", "author_url": null, "date": "Jan 18, 2011", "message": "Thank you.\n\n\n\n\n\n\n\nJoke. I am a passive user of stack overflow, cause I don't feal good enough to answer most unanswered questions. But it's still a important tool for me, and \"thank you\" answers don't bug me much, since they naturally get at the bottom of a question page.\n\nBut if those answers bug you, there is one thing I learned from doing software for us programmer. We are not any better than an average user.\n\nYou will never succeed in teaching stackovervlow users not to say thank you in an answers, those user already told you thousand times they wan't to do so. You've got to listen to them.\n\nThey're gonna keep on saying thank you in the answer's textarea cause it's easy and it feals natural. If you push them not to do it, you're pushing them not to use an intuitive feature of the page, and a big red button labelled \"Do not press\" is at best frustrating.\n\nSo I would suggest the addition of an answer category, that could be \"Answer\" or \"Thanks\", with if possible an auto detection on 15 chars lenght answers containing the word \"Thank\". Don't give points of any kind on \"Thanks\" answer, don't compute any stats on them, and let them at the very bottom of the page.\n\nHaving put in place stackoverflow yourself proove your more advanced than I am in power users software, but I strongly fealon that very point than blocking most thank you answer is impossible without frustrating casual users of your site. You don't get to decide of all of your product's features. If your users can do something, they will and it's better be part of yopur product for good."}, {"author_name": "Francesco Gallarotti", "gravatar_hash": "0c51caa689a5e7c5cb302d0769383115", "author_url": "http://www.gallarotti.net", "date": "Feb 23, 2011", "message": "I still need to understand why there is a 15 rep min req to vote up an answer. It makes absolutely no sense to me"}, {"author_name": "andsien", "gravatar_hash": "651c2c63c2da92d0efb2d8e32603803e", "author_url": null, "date": "Feb 24, 2011", "message": "Felix suggestion is much better. But one problem how should it be labelled? 7 thanks or 1 thanks? Kinda awkward though."}, {"author_name": "aditya menon", "gravatar_hash": "55d7fb2e6e2c49f5bfa2bf873eb06d09", "author_url": "http://adbhuth.in", "date": "Mar 03, 2011", "message": "excellent post, funny picture. thanks! :P but your sentiment is exactly what made me register and try to answer questions, even though this is first time i'm reading this post :) cheers!"}, {"author_name": "Mike Schinkel", "gravatar_hash": "81df87e0d3e269d6fa6a17c6914fd656", "author_url": "http://about.me/mikeschinkel", "date": "Apr 03, 2011", "message": "Jeff,\n\nPersonal thanks has value to many people; I know you don't value it but it would be nice if you would appreciate that others do. \n\nSo here's an idea to combine with the \"pending up votes\" idea; when someone up votes ask them if they would like their vote to be seen as a public thanks. If they say yes then ask them to register first, which could capture more registrations. And if they are registered than notify the thanked user of who thanked them in the same place where users currently only get to see up votes. \n\nAnd to see the list of thanks could require a click so that it wouldn't even be visual clutter.\n\nSomething to consider.\n\n-Mike"}, {"author_name": "cHao", "gravatar_hash": "e92a9af9e53cc8e5af575c4b18b34c21", "author_url": null, "date": "May 20, 2011", "message": "@Francesco:\n\nI imagine part of the reason there's a rep requirement for voting is so that someone has to have participated in the system before they can be part of it.  One semi-decent answer can get you over 15 rep, so it's not a terrible burden.  If anyone and everyone could vote, though, i could easily see there being someone who has a thousand sock puppets to upvote all of his answers (or downvote all of the others), thereby robbing votes of most of their meaning and voters of most of their say."}, {"author_name": "Sam", "gravatar_hash": "7905d373cfab2e0fda04b9e7acc8c879", "author_url": null, "date": "Nov 29, 2012", "message": "Nothing says thank you more than a firm palm to the ass"}, {"author_name": "awe", "gravatar_hash": "bb430dc40c4648586562d2ef22c8557b", "author_url": null, "date": "Jan 14, 2013", "message": "What about a \"Thank you\" button with option to write some more personal note if the simple \"Thank you\" is not enough. Then the thank you, along with any additional note, is shown to the post owner along with other StackExchange notifications. Then this is a temporary thing that will not litter the posts, and people that wants to say thank you, has a way of doing that"}, {"author_name": "awe", "gravatar_hash": "bb430dc40c4648586562d2ef22c8557b", "author_url": null, "date": "Jan 14, 2013", "message": "Along with thew \"Thank you\", it could also automatically cause an upvote, if not already done."}]}