{"response": [{"author_name": "Bogdan", "gravatar_hash": "78d5ead3319c87a115fb35184f8a9530", "author_url": "http://www.gridpulse.com", "date": "Jan 14, 2011", "message": "I like the whole whistle/weight \"the boy who cried wolf\" idea :)"}, {"author_name": "Luk", "gravatar_hash": "64859df4af98a47ac3e86808a18143ad", "author_url": null, "date": "Jan 14, 2011", "message": "Is there a feedback on the quality of your own flagging? So the user knows if their reports are appreciated or if he's a (maybe unsuspecting) nuisance?"}, {"author_name": "Kyle Cronin", "gravatar_hash": "325e29323813381fff4f0ed5c986c98b", "author_url": "http://careers.stackoverflow.com/kyle", "date": "Jan 14, 2011", "message": "What's actually different about a flag from a user with high weight versus a user with low weight? Is it sorted higher in the flag list? Do moderators see the weight ranking? Do \"high weight\" users get more flags? Or is there simply a \"broken\" threshold where flags from low weight users are silently ignored?"}, {"author_name": "Ton Plomp", "gravatar_hash": "8c5037040f70d1be06117c739302841d", "author_url": null, "date": "Jan 14, 2011", "message": "I tried to flag my own post to move it to ui.stackexchange.com.\nHowever the options were limited to:\n-meta\n-serverfault\n-superuser\n-webmasters\n-programmers\nIt would be nice to have a dropdown in that list as well. (current rep = 655).\nScreenshot at http://screencast.com/t/8dCuVN5wM7e."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 14, 2011", "message": "@ton we don't unlock rare migration paths because they are clutter, and often wrong. We only unlock the top 4 (+ meta) migrations that occur in practice.\n\nFlag it for attention instead and indicate where you think it should be migrated in the textbox."}, {"author_name": "Bill the Lizard", "gravatar_hash": "fc763c6ff6c160ddad05741e87e517b6", "author_url": "http://www.BillTheLizard.com", "date": "Jan 14, 2011", "message": "Kyle,\n\nIt does look like a user's weight is used to sort posts in the queue.  Also, Marc had mentioned somewhere on Meta that this was planned.  I don't see a user's weight ranking anywhere on the queue page or on their profile.\n\nJeff,\n\nThanks for all the new moderator tools you've been rolling out recently.  I really like the idea of \"bronze, silver, gold...\" levels of whistle blowing.  Maybe that could be used to grant special privileges at some point?  (Maybe even a diamond moderator nomination.)"}, {"author_name": "Borror0", "gravatar_hash": "7d2cf5a9c2b110205d2bfab54dbc8b3c", "author_url": null, "date": "Jan 14, 2011", "message": "On Atheism.SE, we sometimes have problems with atheists who are intolerant towards theists (they're crazy, irrational, stupid, etc.). Here's the problem: since we're among atheists, those posts *do* get upvoted and, if not kept under control, Atheism.SE could become a circle jerk for anti-thiests.\n\nWould it be proper to flag these posts as \"it is not welcome in our community\"?"}, {"author_name": "Noctrine", "gravatar_hash": "f7625efbd4e4848b4a0b3ca851f058ca", "author_url": "http://about.me/JesseDorsey", "date": "Jan 14, 2011", "message": "@Borror0\n\nI believe that it would be proper to flag them as such because they are being offensive or abusive."}, {"author_name": "David", "gravatar_hash": "eeb8484c0e5e80c3fc17483fb6fbe9d0", "author_url": null, "date": "Jan 14, 2011", "message": "Excellent idea, I have actually never even used the 'flag' feature beforehand but I'll keep that in mind to use it properly in the future."}, {"author_name": "Jonathan Sampson", "gravatar_hash": "a7d4d02a322cf02edc7f4ce8e699dc7f", "author_url": "http://sampsonblog.com", "date": "Jan 14, 2011", "message": "Fantastic updates, team! Watching Stack Overflow evolve since its launch is a great way to study how a website ought to respond to such a tremendous rise in popularity, and how to properly scale in the social medium. Keep up the great work - we're all enjoying the education."}, {"author_name": "AttackingHobo", "gravatar_hash": "0f47d8d088dfa4f8040680fd8f2112fe", "author_url": null, "date": "Jan 14, 2011", "message": "@Jeff Atwood, Do we get a whistle so we can see what our flagging status is. Or some other kind of feedback."}, {"author_name": "BoltClock", "gravatar_hash": "a2d818d801ce38a33807f68fdd92043a", "author_url": "http://NOVALISTIC.com", "date": "Jan 14, 2011", "message": "That \"not an answer\" flag option is something we've been dying for. That, coupled with /review, is going to be really helpful in weeding out drive-by posts.\n\nAnd as a long-time Newgrounds author, I'm very pleased that something similar to their whistle level system is being put in place on SO. Let's hope the number of spam-but-not-really-spam flags drops..."}, {"author_name": "Jardel Weyrich", "gravatar_hash": "a7dffcc86140441472cfb6119375a9d7", "author_url": "http://stackoverflow.com/users/298054/jweyrich", "date": "Jan 14, 2011", "message": "Great improvement!\nI always felt the old flagging choices were not adequate for migrations and such. I avoided flagging migrations various times because I thought it would bother moderators about something that shouldn't need their attention."}, {"author_name": "Time Machine", "gravatar_hash": "fb6b00fdfa29e2987bcd010e66db12d0", "author_url": null, "date": "Jan 16, 2011", "message": "'It doesn't belong here' and 'Not an answer' look the same to me."}, {"author_name": "Soner Gönül", "gravatar_hash": "8ab9df5b19c34688c170765678fb13b0", "author_url": "http://sonergonul.net", "date": "Sep 20, 2011", "message": "@Time Machine\n\nI disagree. My opinion ‘It doesn’t belong here’ means your answer is valid but it belongs another SE sites. 'Not an answer' means answer is not valid or it is irrelevant about the question."}]}