{"response": [{"author_name": "Benjol", "gravatar_hash": "17326c3e593a14ed7f509359c6f28283", "author_url": null, "date": "Jan 17, 2011", "message": "Aarobot, epic answer, tl;dr?\n\nWhatever next?! :)\n\nThat said, I entirely agree, but I suspect that poll questions will keep coming, no matter how many times you lop off their heads.\n\nHow about a ‘fourth place’? :)"}, {"author_name": "davidThomas", "gravatar_hash": "fa1a6c145457af7ee58efb9409d3b899", "author_url": null, "date": "Jan 17, 2011", "message": "<blockquote>your answer is provided along with the question, in a variant of “I’ll go first”. If you can authoritatively answer, it’s not a real question.</blockquote>\n\nDoesn't that totally contradict the final sentence of the <em>first section</em> of the <a href=\"http://stackoverflow.com/faq#ask\" rel=\"nofollow\">FAQ</a>:\n\n<blockquote>It's also perfectly fine to ask and answer your own question, as long as you pretend you're on Jeopardy: phrase it in the form of a question.</blockquote>\n\nOr should there be some form of courteous \"no, <em>you</em> first\" time delay between the asking and answering?\n\n(...gosh, I wish there was a preview-comment button. The suspense of wondering if the mark-up is allowed is...weird.)"}, {"author_name": "Chris McKee", "gravatar_hash": "51a17b9288b3466a6c1939bd836b17aa", "author_url": "https://twitter.com/chrismckee", "date": "Jan 17, 2011", "message": "Browsing around the many, many, stacks that exist now; the creation of serverfault, programmers, wordpress, android etc, etc; seems to have created a new niche of troll like moderators who move posts from Stackoverflow, the once concentrated mass of users and questions, into these varied holes of marginalisation. \n\nWordpress posts for instance would previously have been seen by the thousands of PHP users who trawl stackoverflow; now its seen by around 1200 users a day...\n\nWho cares if a question isn't written properly, people come to these sites to get answers. \n\nThe cooking &amp; photography sections were good examples of new stacks; but separating off android/wordpress etc from the stack has created a dilution in the knowledge pool, and thats a real shame."}, {"author_name": "Caleb Cushing ( xenoterracide )", "gravatar_hash": "e990c7cdac81e570939c4d5b17303b42", "author_url": "http://www.xenoterracide.com", "date": "Jan 17, 2011", "message": "I like that this is now part of the FAQ, but we'll no longer have a list of alternative sites?"}, {"author_name": "Skilldrick", "gravatar_hash": "2b0a93dc132be4bf3b15b50c8a7e8089", "author_url": "http://www.skilldrick.co.uk", "date": "Jan 17, 2011", "message": "How about questions like http://stackoverflow.com/questions/1711/what-is-the-single-most-influential-book-every-programmer-should-read ? I think that's an incredibly useful resource.\n\nIt would be a shame if those kinds of questions were banned wholesale. (I know the majority are rubbish, but don't throw the baby out with the bathwater)"}, {"author_name": "Phil Pursglove", "gravatar_hash": "ee753c26051b3cc45094e20aa73b93a1", "author_url": "http://philpursglove.blogspot.com/", "date": "Jan 17, 2011", "message": "Am I right in thinking that \"If your motivation for asking the question is “I would like to participate in a discussion about X”, that should go to programmers.stackexchange.com?"}, {"author_name": "Jeff", "gravatar_hash": "6d81d6dc131240aff73b92c2777f1737", "author_url": null, "date": "Jan 17, 2011", "message": "You should probably point them to chat. That would be the place for those sort of discussions."}, {"author_name": "Iszi", "gravatar_hash": "8f8571493d71202986f2a6ab0dbd7c23", "author_url": null, "date": "Jan 17, 2011", "message": "I must disagree with the statement \"If you can authoritatively answer, it’s not a real question.\"  While I understand this was meant in the context of subjective questions, that sentence in itself is a bit too global in scope.\n\nThere have been several times where I have come across a tricky issue that I've been able to solve on my own, and later decided to post as a question on one of the StackExchanges.  My foreknowledge (and, sometimes, self-posting) of the answer does not invalidate the value of the question.  In fact, it actually increases the value of the question since it will have a definitive answer already posted, which has been tried and proven."}, {"author_name": "Jeff", "gravatar_hash": "6d81d6dc131240aff73b92c2777f1737", "author_url": null, "date": "Jan 17, 2011", "message": "@Iszi\n\nI think the key phrase was this:\n&ldquo;in a variant of &lsquo;I’ll go first&rsquo;&rdquo;\n\nIf you just plain have the correct answer, that is different."}, {"author_name": "AaronSieb", "gravatar_hash": "013fbfb6411dbf971dc8623af1096ddb", "author_url": null, "date": "Jan 17, 2011", "message": "@Jeff I think part of the point people are trying to make is less about what is/isn't allowed, as it is that the wording is blatantly contradictory to a new user who doesn't have the context of blog/meta discussions from the past couple years to sort things out.\n\ni.e. The target audience of the FAQ..."}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Jan 17, 2011", "message": "Questions like http://programmers.stackexchange.com/q/2846/3249 may not be productive, I think they're lighthearted fun, and it's a mistake to ban or close them."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 17, 2011", "message": "> I like that this is now part of the FAQ, but we’ll no longer have a list of alternative sites?\n\nThis has not changed, it just got pushed down by a bit more text.\n\n> It would be a shame if those kinds of questions were banned wholesale.\n\nThe guideline for poll questions isn't that they are not allowed, it is that they must be <i>constructive</i>.\n\n> I must disagree with the statement “If you can authoritatively answer, it’s not a real question.” While I understand this was meant in the context of subjective questions, that sentence in itself is a bit too global in scope.\n\nI agree, and I think I will change that to something like... \n\n\"your answer is provided along with the question, in a variant of “I’ll go first”. If you are answering your own question and expecting even more answers to come along, it’s not a real question.\"\n\n> Questions like http://programmers.stackexchange.com/q/2846/3249 may not be productive, I think they’re lighthearted fun, and it’s a mistake to ban or close them.\n\nSee Robert's response here\n\nhttp://meta.programmers.stackexchange.com/questions/971/a-place-for-the-subjective-fun-questions/977#977"}, {"author_name": "01", "gravatar_hash": "a21e127246faca4eb270b636e4467e84", "author_url": null, "date": "Jan 18, 2011", "message": "ROTFL!!!!\n\n\t\nedited Oct 26 '10 at 17:43\n\nclosed as not constructive by Walter♦ 10 hours ago\n\nYou guys rock."}, {"author_name": "abel", "gravatar_hash": "68ac212db6abbb7f228d54dca9f613f0", "author_url": null, "date": "Jan 19, 2011", "message": "There is a tiny recursion in point number three, when you use the word \\constructive\\ to describe how \\constructive\\ subjective questions should be.\n\nThat makes the foundation buggy, but whatever!"}]}