{"response": [{"author_name": "Ironicnet", "gravatar_hash": "22835fabf4fc28d990ebc46e78b767a5", "author_url": "http://www.ironicnet.com", "date": "Jan 28, 2011", "message": "A question, why Lucene and not Solr?\nIt's a great layer over Lucene!"}, {"author_name": "Mpdreamz", "gravatar_hash": "05dfef403d6eae502a63616b800910af", "author_url": null, "date": "Jan 28, 2011", "message": "Solr would give tags an incredible boost as you can treat tags as facets. To me having it run as a seperate server makes it more controllable not less but good news for stackexchange search. Is AND now the default over OR though?\n\nAlso check out elasticsearch its distributed nature is a bliss"}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.systempuntoout.com", "date": "Jan 28, 2011", "message": "That's a great integration, love it."}, {"author_name": "Lucas Arruda", "gravatar_hash": "b4a8c65887f9fed0970287904e92b3d3", "author_url": null, "date": "Jan 28, 2011", "message": "@Ironicnet,\nAs far as I know, Solr uses Lucene Java. Dunno if it can use the .NET version."}, {"author_name": "Carson McDonald", "gravatar_hash": "91ea0a69e05914fc423ea6a388e51d21", "author_url": "http://www.ioncannon.net", "date": "Jan 28, 2011", "message": "Is Lucene backing the API search too?"}, {"author_name": "Martin S.", "gravatar_hash": "6af21a0b03355d81d880c5b95f4e90dd", "author_url": "http://blog.dileno.com", "date": "Jan 28, 2011", "message": "Congratulations for bringing in a better search!\n\nRegarding the Solr questions: Solr would've been incredibly good for SO, and it's perfectly possible integrating it with .NET, either sending search queries to Solr through the normal XML file interface or using the SolrNET library to do so :)\n\nKudos!"}, {"author_name": "Mauricio Scheffer", "gravatar_hash": "eeb2fbb30532904e05b670840e85219b", "author_url": "http://bugsquash.blogspot.com", "date": "Jan 28, 2011", "message": "@Lucas Arruda: Just as with any traditional relational database, there are Solr clients for just about any platform (including .NET of course). The fact that it's built on top of Lucene Java doesn't matter at all. And, as mentioned above, you get faceting and great scalability for free, which you don't get with raw Lucene(.net)."}, {"author_name": "Jonathan Sampson", "gravatar_hash": "a7d4d02a322cf02edc7f4ce8e699dc7f", "author_url": "http://sampsonblog.com", "date": "Jan 28, 2011", "message": "Nice work, Nick! Great to see another new face on the team. Keep up the great work, guys."}, {"author_name": "Kevin", "gravatar_hash": "bd84fd2c8e983f81b604673e1359ec64", "author_url": null, "date": "Jan 28, 2011", "message": "Very nice Stack team! \n\nLucene.NET does work remarkably well, though it is quite behind the Java version. You could also of course the Java Lucene hosted in SOLR, for example Telligent's Community Server software switched from Lucene.NET to SOLR.  \n\nOut of curiosity, did you consider Microsoft's FAST ESP (FSIS) search platform?"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 28, 2011", "message": "> Lucene.NET does work remarkably well, though it is quite behind the Java version.\n\nIt was my understanding that Lucene is barely changing at all, and the changes they are making to the project at this point are .. minor (like adaptations to new Java language constructs, etc). I understood that the problem Lucene is trying to solve is basically solved, and has been for years, so it's basically just an increasingly esoteric list of small and minor tweaks to a very mature, stable search platform.\n\nAnyway, that's why being \"behind\" for 6-12 months doesn't seem too relevant."}, {"author_name": "Christopher W. Allen-Poole", "gravatar_hash": "4092d1b87964c221b032b0c6e28bffe3", "author_url": "http://allen-poole.com", "date": "Jan 28, 2011", "message": "Balderdash!  We expect your searches to provide better results than Google: you have a smaller problem domain :-).  (<a href=\"http://www.codinghorror.com/blog/2011/01/trouble-in-the-house-of-google.html\" rel=\"nofollow\">Once</a> <a href=\"http://www.allen-poole.com/wordpress/2011/01/knock-on-google-because-i-can/\" rel=\"nofollow\">again</a>, I'll wager that most of us would prefer to wait an extra minute than get mediocre results).\n\nBut (and I know, I'm just some fool who has no idea how many lines of code are in the Stack Exchange source or how infinitely complicated the algorithms are (It's great being a user)), I would say that it could be argued that it has a way to go still.\n\nMy standard is still the search for int str python compare.  Whereas on Jan. 5th, the first result which had the word \"compare\" (or a variant) in it (even in the answers) was <a href=\"http://blog.stackoverflow.com/2011/01/the-wikipedia-of-long-tail-programming-questions/#comment-55930\" rel=\"nofollow\">forth</a>, you now need to go entry 6.  I'm not even talking about *relevance* to the query, I'm talking about *making sure the term searched for appears in the results* and that those results get higher ratings."}, {"author_name": "Paige Cook", "gravatar_hash": "d419cfab98211f2a7c8db908016eb743", "author_url": "http://paigecsharp.blogspot.com", "date": "Jan 28, 2011", "message": "Jeff,\n\nYou are mistaken to think that \"Lucene is barely changing at all\". That is a very vibrant community, see http://lucene.apache.org for more details. I agree with comments, that SO should implement Solr as it is considered a \"best practice implementation\" of Lucene and most people that implement Lucene directly end up building Solr anyhow. Of your 4 motivating factors for switching, Solr can meet the first 3. Regarding the 4th one about setting up an external service, yes that would be required and is more work and creates a dependency. But  the power that Solr would bring to the search results on SO is worth it."}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jan 28, 2011", "message": "So finally we can search for terms like std::vector without the '::' causing it to return no results!\n\nJust out of interest, since Google re0index your site almost continually and many of your searches come from Google, can't you just use Google search in your own search box?"}, {"author_name": "Mauricio Scheffer", "gravatar_hash": "eeb2fbb30532904e05b670840e85219b", "author_url": "http://bugsquash.blogspot.com", "date": "Jan 28, 2011", "message": "@Jeff: As Paige said, there's a lot going on currently in Java Lucene, for example Twitter's recent contributions for real-time indexing: http://engineering.twitter.com/2010/10/twitters-new-search-architecture.html"}, {"author_name": "Wyatt Barnett", "gravatar_hash": "0dd7d17a52e2ae3784518ed795b73526", "author_url": "http://blog.wyattbarnett.net", "date": "Jan 28, 2011", "message": "Great to hear about the improvements, I definitely like what I see here.\n\nThere is quite a bit of activity on the Lucene.NET mailing list and there is a formal incubator proposal in the works -- see http://mail-archives.apache.org/mod_mbox/lucene-lucene-net-dev/201101.mbox/browser and http://wiki.apache.org/incubator/Lucene.Net%20Proposal respectively."}, {"author_name": "michael herndon", "gravatar_hash": "2b1cbb1909cc8b816404bbfb7dbf910b", "author_url": "http://www.wickedsoftware.net", "date": "Jan 28, 2011", "message": "When asking about Solr, the point in this posting \"No external search service dependency\", probably covers the why.  \n\nWhile solr is a powerful tool, as a programmer its just has a much cleaner feel when you are not required to install an extra runtime, extra configuration, and have another item that you must start up and try to figure out how to get it baked into your deploy strategy.     \n\nEven if there was a solr.net version, adding an extra service is not always worth the trade offs to an in house development crew.  \n\nAlso having actual source code and the ability to work with it in one's preferred native langage or extend it can be a key deciding factor.  SO is on the .net stack and is probably more inclined to use tools that is also built or designed for such.  \n\n\nNot everyone is going to agree, but then everyone has their preferences on what they value most and that differs from person to person and system to system.  \n\n@Paige Cook\n\nits generally pays to be a little more tactful  and humble when correcting someone.  \n\n\"You are mistaken to think that \" comes off too strong and a bit indignant and will possibly alienate people from checking out any valid point that you may have to convey."}, {"author_name": "Maxim Zaslavsky", "gravatar_hash": "319bd6ef9c9c8d876f731150cb4951c7", "author_url": null, "date": "Jan 28, 2011", "message": "Quick question - how did you implement Lucene.Net usage? I'm trying to use Lucene.Net in an albeit smaller ASP.NET MVC application. Are you doing something similar to http://stackoverflow.com/questions/3480974/proper-structuring-of-lucene-net-usage-in-an-asp-net-mvc-site ?"}, {"author_name": "Paige Cook", "gravatar_hash": "d419cfab98211f2a7c8db908016eb743", "author_url": "http://paigecsharp.blogspot.com", "date": "Jan 28, 2011", "message": "Thanks for the feedback @micheal heardon You are correct, I was not very tactful and humble. I do apologize for starting off my comment that way, as I certainly do not want to alienate anyone."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jan 28, 2011", "message": "First thanks to Jeff, I did get my SO .\nBut I don't know if it's just me but is there some sort of advanced search on the site?  Something where I can limit my search to a specific tag ?"}, {"author_name": "Nick Craver", "gravatar_hash": "52b6e4f1831bcd153f645a14f29aa185", "author_url": "http://stackoverflow.com/users/13249/nick-craver", "date": "Jan 28, 2011", "message": "I see a lot of comments for Solr and asking why we didn’t go that way.  I agree in most cases it’s the way to go; however it doesn't really fit our goals.  Rarely is a solution one-size fits all, so let me share some thoughts of ours on why we went non-Solr route:\n\nWe have a web tier of 10 servers; unless we wanted a Solr server on each we're still just wasting hardware.  Another huge factor is that given we have a very minimal configuration of IIS on that tier, adding Java and another server (software, Solr) would *immensely* complicate our setup and build/deployment process compare to what it is now.\n\nGiven our deployment setup, making search changes in C# is trivial.  Also, it allows us to control the result weight, threading, and monitor everything going on across all servers.\n\nManaging how 81 databases (currently, and growing!) are indexed, at what speed, interval, thread count…all the while being able see what each is doing (for example: what’s the latest Post/Answer it’s up to?) is not something we can do *easier* with Solr.\n\nI don’t not-recommend Solr, it’s a great search platform – I *absolutely* recommend it…it just doesn’t fit *our* needs or setup better than using Lucene directly does."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jan 28, 2011", "message": "Ok that was a silly question I found it on the search page:\n\nIf that's not specific enough, you can narrow your search even further:\n\n•to specific tags \n[tag] apples oranges\n[tag] [another-tag] apples oranges\n\nAlso to answer someone else's question I think it still is a OR rather then an AND in search.  And finally you can still use google search within this site.  Try going into the search box and hitting enter or putting a \"*\" in there.  It takes you to a page that has buttons for BING, Google, and DDG search.\n\nI like it!  And Jeff I meant SO TS if you get my jist.  Thanks it was nice :)"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jan 28, 2011", "message": "I agree with Nick, solr is nice but it could really complicate there entire setup.  I for one like and welcome the change.  Great job Nick!"}, {"author_name": "cgr", "gravatar_hash": "4a0339e1dcd17ad4b5fb5f47cb1f53c8", "author_url": null, "date": "Jan 28, 2011", "message": "Can you post more technical information about your Lucene configuration?  For example, what does your Document look like?  Thanks!"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 28, 2011", "message": "> My standard is still the search for int str python compare. Whereas on Jan. 5th, the first result which had the word “compare” (or a variant) in it (even in the answers) was forth, you now need to go entry 6. I’m not even talking about *relevance* to the query, I’m talking about *making sure the term searched for appears in the results* and that those results get higher ratings.\n\nPut a plus in front of each term if you are demanding each one be present no matter what, e.g.:\n\n+int +str +python +compare"}, {"author_name": "Stephen", "gravatar_hash": "cbc8e2240caacb5300ad2869487be5e0", "author_url": null, "date": "Jan 29, 2011", "message": "I bet that was fun, as much as I appreciate the efforts of lucence.net, it is almost copy and paste porting, and lucence itself isn't a great codebase (the .net lib throws ApplicationExceptions's) for minor method call issues.\n\nFrom what I can understand, the value in the library is the algorithms; like stemming and tokenization etc.. it would be great to have a well written .net ground up build of these algorithms."}, {"author_name": "michael herndon", "gravatar_hash": "2b1cbb1909cc8b816404bbfb7dbf910b", "author_url": "http://www.wickedsoftware.net", "date": "Jan 29, 2011", "message": "@Stephen, that will possibly be in the works for the next year, there is a new lucene.net proposal currently being voted on. \n\nhttp://wiki.apache.org/incubator/Lucene.Net%20Proposal\n\nThe biggest factor that will allow for a more idiomatic .net api and or even possible ground up port of lucene will be people voicing that they want this in the mailing lists and willing participants.  \n\nThe most interactive place that you can voice this is probably the lucene.net dev mailing list here:  \n\nhttp://mail-archives.apache.org/mod_mbox/lucene-lucene-net-dev/\n\nnot to spam this thread in any capacity, but to allow people the option of voice their concerns and desire of direction for lucene.net, that includes SO programmers and etc."}, {"author_name": "THenrich", "gravatar_hash": "886427a445a180eb6618d77ee4ec4894", "author_url": null, "date": "Jan 31, 2011", "message": "SO's search documentation needs more work. Maybe I should read Lucene's search syntax to better use SO's search.\n\nhttp://meta.stackoverflow.com/questions/76959/documentation-on-search-is-not-clear-and-its-confusing"}, {"author_name": "tss", "gravatar_hash": "9336dad268467381befa1d4133be9ceb", "author_url": null, "date": "Feb 01, 2011", "message": "Good discussion on going with Lucene and not Solr for this use case. There are also other packages like ElasticSearch and SearchBlox that build on top of Lucene to make it simpler to create search."}, {"author_name": "matt wilkie", "gravatar_hash": "875b592087c435ab4a8d533cda9b69c1", "author_url": "http://www.maphew.com", "date": "Feb 02, 2011", "message": "@jeff said \"+int +str +python +compare\" so the results *have* have those words. Why isn't that the default? Why add more typing?"}, {"author_name": "Chris", "gravatar_hash": "f8869c89889c2ceff0fc7d7a253d9f8b", "author_url": "http://www.shrinkrays.net", "date": "Feb 03, 2011", "message": "It'd be good if someone could convert Solr to C# so that it runs on IIS:\n\nhttp://lucene.apache.org/solr/\n\nSolr makes Lucene a lot more accessible than its current state (which for lucene.net seems to be semi-commercial?)"}, {"author_name": "Andrey", "gravatar_hash": "508343db9ca2d7cfbabe6685c5cd9521", "author_url": "http://asptuts.ru", "date": "Feb 25, 2011", "message": "Many thanks for the info!"}, {"author_name": "Markus", "gravatar_hash": "0dcdb9aa3dd943e2f12d1ba6bfa11358", "author_url": "http://www.naxma.com", "date": "Mar 08, 2011", "message": "I'm glad to hear that. I love using Lucene.net with C# too, but had some serious remorse not using any ready built distribuited engines like SOLR or ELASTICSEARCH.\n\nSo how do you distribute - or better said synchronize - your index between your servers? It's a every month question at the newslist but everybody is recommending soething different."}, {"author_name": "David", "gravatar_hash": "5d3406d066a397bd167b703a20fec440", "author_url": "http://www.nyc-software.com", "date": "Mar 21, 2011", "message": "This is great for Lucene.Net, hopefully you guys will inject the energy needed to get this on a newer version of .NET and add utilize some more of the multithreading Libraries"}, {"author_name": "Praveen", "gravatar_hash": "f445f1822920775a11b3f7265969f1f1", "author_url": null, "date": "Aug 03, 2011", "message": "If Google is doing a better job, then why not leave it to Google?\n\nGo Green !!!"}, {"author_name": "joão", "gravatar_hash": "aff579bb341cbd04108a977087f2c269", "author_url": "http://none", "date": "Oct 18, 2011", "message": "It's good for us: users. Thank God for competition!"}, {"author_name": "James Moore", "gravatar_hash": "065736055c18fc6e81babd5d4f0bd9fc", "author_url": "http://blog.restphone.com", "date": "Dec 11, 2011", "message": "\"Put a plus in front of each term if you are demanding each one be present no matter what, e.g.:\n\n+int +str +python +compare\"\n\nI've always thought this was crazy.  Not a little bit wrong, but absolutely insanely no-possible-way-can-anyone-think-this-is-even-close-to-a-good-idea wrong.  If I'm searching for technical issues, I want everything I ask for.  Virtually always.  OK, have an advanced mode where you can do an OR search, but in no way could you ever think that making this the default was the right thing to do.\n\nBefore the change, I rated StackOverflow searches as D-.  The new system doesn't fix a horrible flaw, so it's still D-."}, {"author_name": "David", "gravatar_hash": "e9de3d74c8096272e20552966f0af679", "author_url": null, "date": "Apr 01, 2012", "message": "@James Moore\n\nI guess the reason for the '+' in front of the search term is that you can sometimes use '-' to indicate what you want to exclude from your search result. It's almost never used by most people."}]}