{"response": [{"author_name": "Ralph Rickenbach", "gravatar_hash": "09eb3720b1c9d33bedd35a3bd47ec1c9", "author_url": "http://rickenba.ch", "date": "Jan 24, 2011", "message": "Congratulations. You have become an integral part of my professional work and a valuable source of information I would not want to miss. I am looking forward to the further development, as you push forward into areas uncharted by programmers in the future (like http://area51.stackexchange.com/proposals/1817/biblical-hermeneutics?referrer=sRPc-3Di_skN5QfMOt5KEg2)."}, {"author_name": "Liam", "gravatar_hash": "faf9707decc36ef2b987bfb120af9e3b", "author_url": "http://www.LiamBateman.net", "date": "Jan 24, 2011", "message": "Great news, great write up! But how will Stack Enchange become profitable? Whats the plan going forward?"}, {"author_name": "Ian Ringrose", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Jan 24, 2011", "message": "This is a great start, but is only the start….  \n\nThere are still lots of programmers that I work with, that have never asked (or answered) a question on Stack Overflow, therefore SO still has a long way to grow.\n\nThe issue is now how to keep up the quality of the questions and answers, I still find SO very useful, but sometime I feel I am not getting as useful answers as I did in the past, maybe it is just me…\n\nIt seems that the real experts are the first people to find a site, and then everyone else comes along…"}, {"author_name": "Reid", "gravatar_hash": "d713b518378126cdb09fb08843f8a030", "author_url": null, "date": "Jan 24, 2011", "message": "I must object to the first graph. It is misleading. Because you chose 6M instead of zero as the baseline, it looks more like 1000% growth rather than 131% as noted in the text.\n\nPlease correct this error.\n\nTake a look at Tufte's Visual Display of Quantitative Information. It's a fun read besides."}, {"author_name": "Geoffrey Van Wyk", "gravatar_hash": "fffd92bafcc0c8d002c733674e93602a", "author_url": "http://roadsofcode.wordpress.com", "date": "Jan 24, 2011", "message": "Why do you guys not get a second Rovio that somebody with the highest reputation (or some other metric) for the week can use to visit the StackExchange office?"}, {"author_name": "Rory Alsop", "gravatar_hash": "9d6d6668824d7b3fe9f630e67a2bf279", "author_url": "http://www.7elements.co.uk", "date": "Jan 24, 2011", "message": "Amazing - and I think there is a lot more growth potential, as thus far the penetration in some areas is low. I only heard of SE in November, despite having been in IT since, well, Neanderthal times, and am finding that a good percentage of my network hadn't heard of it either, so I have happily committed to increasing that exposure (specifically for the security.stackexchange site, but also more generally for SE)\nI hope 2011 delivers even more success.\n\nRegards\n\nRory"}, {"author_name": "Grzes", "gravatar_hash": "712248df6de12dd9b8ba73869a110f1f", "author_url": null, "date": "Jan 24, 2011", "message": "Congratulations!"}, {"author_name": "Anonymous", "gravatar_hash": "abaa804f27443fa86b039c4cae0d0864", "author_url": null, "date": "Jan 24, 2011", "message": "Hi,\n\nCongratulations! :)\n\nI was thinking about how one can improve the area51 process to get a better idea of presence of experts. I have an idea: add a checkbox to the commitment dialogbox stating \"I am an expert in this topic\". You can also use users opinions about each other by adding a checkbox near the name of each committed user that others can check to state their opinion that that user is an expert on the topic. I think it worth trying and can refine the area51 process considerably. Remember, many experts know each other."}, {"author_name": "Tshepang Lekhonkhobe", "gravatar_hash": "88e60659e997d36af3ff348b3251e1a6", "author_url": "http://tshepang.net", "date": "Jan 24, 2011", "message": "As we've come to expect, another high quality post, full on good humor."}, {"author_name": "CarlosK", "gravatar_hash": "cef457d5728f7b65e12423d3d7d0cea4", "author_url": null, "date": "Jan 24, 2011", "message": "And these great results without any big HYPE. (like quora)"}, {"author_name": "Sara", "gravatar_hash": "05cd0c924cba660419d5a8ad2a2a107e", "author_url": "http://GirlDeveloper.com", "date": "Jan 24, 2011", "message": "Congrats, guys! Exciting to see your growth!"}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.systempuntoout.com", "date": "Jan 24, 2011", "message": "Congratulations! You are awesome, that is all!\nOh, by the way, we deserve a special edition podcast."}, {"author_name": "Craig Tataryn", "gravatar_hash": "ceb09c840b0bb7c0a70d722d1c712e89", "author_url": "http://basementcoders.com/", "date": "Jan 24, 2011", "message": "Love the sites guys, keep up the great work!"}, {"author_name": "Olly", "gravatar_hash": "870c0161b20f329c2d329f0a3795da76", "author_url": "http://www.freeagentcentral.com", "date": "Jan 24, 2011", "message": "Impressive growth.  How about writing a post about how you manage all those remote developers on a day-to-day basis.  What tools do you use to communicate individually, as a group and for planning the development?"}, {"author_name": "Dave", "gravatar_hash": "6f0efd477208f51d145bea6d7272256e", "author_url": null, "date": "Jan 24, 2011", "message": "Can we have more detail on the standing desks? Pictures?"}, {"author_name": "Robert Cartaino", "gravatar_hash": "9dfd656461a1d0a2db33f3ed4183f4c0", "author_url": "http://stackoverflow.com/users/98786/robert-cartaino", "date": "Jan 24, 2011", "message": "@Olly: \n\n&gt; How about writing a post about how you manage all those remote developers on a day-to-day basis.\n\nWe use the SAME EXACT TOOLS you use in Stack Exchange -- No kidding. Meta and chat... toss in a bit of email and the occasional Skype call and that's pretty much how we collaborate, crowd source, vet ideas, and coordinate tasks."}, {"author_name": "drachenstern", "gravatar_hash": "c4cca9bfec5d5e77f625d9fbe8e37a41", "author_url": "http://stackoverflow.com/users/109749/drachenstern", "date": "Jan 24, 2011", "message": "I love SE and have envagelized far and wide about being a SE user, and how amazing it is. I, for one, wish to see SOIS become the de-facto question asking site.\n\nI'm just waiting on the meta.GrandCentral.SE site where people can post \"I need more info on XYZ, where do I go\" with redirect ability from site-specific mods."}, {"author_name": "Nathan Blevins", "gravatar_hash": "82964b177b30f9b1fd114bdec21d30b2", "author_url": "http://www.nathanblevins.com", "date": "Jan 24, 2011", "message": "I am loving SO.  It is a great asset.  My biggest issue now is people ripping off your sites and then getting higher google rankings!  I know that Jeff has griped about this quite a bit, but, man, its frustrating!!  \n\nIt would help me greatly if you had a search function that searched every stack site rather than just the one I am at.  At that point, I could cut out the middle man (google) and just use your sites!  :)\n\nKeep up the good work!"}, {"author_name": "Brian R. Bondy", "gravatar_hash": "84af4c25398f072ce1462795fd67bf49", "author_url": "http://www.brianbondy.com", "date": "Jan 24, 2011", "message": "Congratulations!\n\n&gt; But seriously, when was the last time you met a programmer who didn’t use “El Stack”?\n\nI was helping with an event at the University of Waterloo and several CS students have never heard of it.   Just shows there is even more growth potential and things should continue to look promising."}, {"author_name": "Jordan", "gravatar_hash": "5562031090a7991ae3daa47e8adc26e7", "author_url": null, "date": "Jan 24, 2011", "message": "Joel,\n\nAwesome! Just Awesome. My rep is only about 4,000 or so, but the value I've received is far more than that. Cheers!"}, {"author_name": "Justin A", "gravatar_hash": "18f957b9fc9dc60927d0a2a2657f264e", "author_url": null, "date": "Jan 24, 2011", "message": "Joel - can we have more info (new blog post) on the equipment your team in NY are using? We all know what Aeron chairs are (woot!) but the table? monitors? computers and stuff? \n\ncan we have a few photos, assuming it's not infringing on any security or stuff, or even links to google images of the products your staff are using.\n\nBTW, I can one-up your couch. We have a Darth Vader and a Storm Trooper in our foyer. Oh, and a Terminator. All Life Size, blah blah blah.\n\nPlease, Joel?\n\nThread Hijack: Gawd this captcha is getting hard for us humans to read :("}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jan 24, 2011", "message": "Justin - take a look at Joel's various blog posts about the fogcreek offices, eg  http://www.joelonsoftware.com/items/2008/12/29.html"}, {"author_name": "Justin A", "gravatar_hash": "18f957b9fc9dc60927d0a2a2657f264e", "author_url": null, "date": "Jan 24, 2011", "message": "@mgb : cheers! that's pretty helpful. nice :)"}, {"author_name": "sachin", "gravatar_hash": "18b716943596e24bd580c08d5cc2a1f3", "author_url": "http://qtp.blogspot.com", "date": "Jan 25, 2011", "message": "Congratulations..still you have miles miles miles to go...keep up the good work..."}, {"author_name": "Jake", "gravatar_hash": "34bd5aecc67f3aa8794bef48d51ce1fa", "author_url": null, "date": "Jan 25, 2011", "message": "I'd like to second Reid's request for a correct version of the first column chart. Left as it is, it looks like a text book example on \"How to Lie with Charts\"...."}, {"author_name": "Warren B.", "gravatar_hash": "f005a18055274d480f95250b81624b8f", "author_url": null, "date": "Jan 25, 2011", "message": "Congratulations, gentlemen.\n\nThe burn rate for a downtown office with thirty some-odd people is pretty significant. You'd be surprised how quickly $6 million can disappear.\n\nBest of luck selling all that lucrative...err...ad space!"}, {"author_name": "Dave McNulla", "gravatar_hash": "82270219349732c881bd50f534c397f8", "author_url": null, "date": "Jan 25, 2011", "message": "Nice job. I go to Stack Overflow on a daily basis. I've had some tough questions answered (if they weren't tough, they would have been answered by google, no?), and I've tried to help some people too. Community is awesome."}, {"author_name": "Earlz", "gravatar_hash": "6fc5e3f98fb1113576b50672ae42c05c", "author_url": "http://lastyearswishes.com", "date": "Jan 26, 2011", "message": "Stackoverflow has been an invaluable resource to me. There is still many more people out there that have somehow never used it. I'm sure those people have came across at least one google stackoverflow result. \n\nThat's the thing you have going for you. Most of the time when I go to google something, I almost always end up with either a stackoverflow question, or pointless trash(which I make a question for :) ). Surely if these people keep seeing google results, they'll wonder \"hmm. Maybe I should try this site\""}, {"author_name": "Andrew Grimm", "gravatar_hash": "01bbb59a1c3ef9960f25a97afe7e920f", "author_url": "http://andrewjgrimm.wordpress.com", "date": "Jan 26, 2011", "message": "\"If, as planned, we continue growing at 51% a month\"\n\nI know this is sarcasm, but does the growth in Stack Exchange look more linear rather than exponential?"}, {"author_name": "Guy S.", "gravatar_hash": "6a9585f2d8e8f07a83712a5dc61e35f9", "author_url": null, "date": "Jan 30, 2011", "message": "Congratulations, Joel.\n\nI'm a huge proponent of the site, but as an old-school web developer who was building things in the late 90s (not playing GoldenEye on Nintendo 64 unlike the majority of your audience), and with a disdain for revisionist history, I take issue with your statement \"the expert Q&amp;A model that Stack Overflow pioneered\".\n\nThe reality is the hyphenated-site-whose-name-we-shall-not-mention actually pioneered the model that you use a full decade before Stackoverflow came into existence:\n\nhttp://www.google.com/patents?vid=6064978\n\nIn short, I find your claim intellectually dishonest and akin to the Vanilla Ice defense:\n\nhttp://www.youtube.com/watch?v=JippcFJsSFw\n\nThe reason I bring it up is even though we all want you to succeed, be cognizant of your own hype. I don't want to comb through Google results in a few years to see you tatted-up, complete with awkward hip-hop sensibilities, flipping homes online.\n\nBowie is forever."}, {"author_name": "matt wilkie", "gravatar_hash": "875b592087c435ab4a8d533cda9b69c1", "author_url": "http://www.maphew.com", "date": "Feb 02, 2011", "message": "as @Dave said above, \"Can we have more detail on the standing desks? Pictures?\". To which I'd add \"brand name?\", \"suppliers?\""}, {"author_name": "cynical investor", "gravatar_hash": "d40fb0035455ae77061f473380a2345f", "author_url": "http://www.thecynicalinvestor.net", "date": "Feb 02, 2011", "message": "Good post Joel, it is good you write from time to time, I used to follow you at joelonsoftware.com"}, {"author_name": "nellbryant", "gravatar_hash": "a7d4d42b1d1bbe033c1660328b7f915c", "author_url": null, "date": "Feb 04, 2011", "message": "I searched a lot to get answers and this site always pops up in google so I thought what was it? I officially joined in after I heard a talk from Scott Hanselman of Microsoft... Indeed, it was a cool networking site for developers!"}, {"author_name": "Paulo Santos", "gravatar_hash": "49490fc6113db81448b7ccfd0a41633a", "author_url": "http://bytefood.blogspot.com/", "date": "Feb 15, 2011", "message": "Congrats!\nI wonder what are your plans about foreign language sites.\nAlso, when will we have another Stackoverflow podcast?"}, {"author_name": "Paolo", "gravatar_hash": "ad4cbc90f7526dc0c55f7117e30fe8c0", "author_url": null, "date": "Apr 23, 2011", "message": "Terrific!\nAre you also making money?"}, {"author_name": "บัตรเครดิตกสิกรไทย", "gravatar_hash": "1b5af8b5d546f3071257468a43229c24", "author_url": "http://www.creditcardkbankthai.carcashplus.com/", "date": "Aug 17, 2011", "message": "Your article is very good. It is a good idea for the general reader like me. Thank you very much."}]}