{"response": [{"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Jan 11, 2011", "message": "Yay, I posted the first comment for once!\n\nSeriously though, very interesting results. The age range is about what I would have expected... and it looks like a lot of people have quite a bit of experience. (Keep in mind that what the user reported and what may actually be the case may differ.)\n\nWaaay too many web developers :P\n\nYeah, C++ 28.5%!!!"}, {"author_name": "Adam", "gravatar_hash": "207958aa5ac1c42448070dbab3f2dd87", "author_url": "http://stackoverflow.com/users/284685/adam", "date": "Jan 11, 2011", "message": "Thanks for sharing the data. It's very interesting.\n\nThe lack of Blackberry users is not surprising. I think that Blackberries have been seeing a decline recently and since StackOverflow users are likely to be early adopters they will switch faster than most. Also, Blackberries are more common among Enterprise users and these demographics show that StaverOverflow users tend to work for smaller companies.\n\nWhich StackExchange sites were covered by this survey? Will there be surveys of the non-programming related sites?\n\nIt'd also be cool to have data associated with user profiles. For example I'd like to know how years of experience correlates with Reputation score."}, {"author_name": "Dave Anderson", "gravatar_hash": "e74e7299da165db42a5a461e150b82ff", "author_url": null, "date": "Jan 11, 2011", "message": "More tasty stats to chew on. One thing I'd be interested in, especially with the indicated spread of years of IT experience, is who's coming to mainly ask questions and who's here to give answers. I know my question to answer ratio is about 1:10. I'm sure this is available somewhere but I've not had enough coffee yet to find it. Did I miss this in another post?"}, {"author_name": "Kev", "gravatar_hash": "6bfb56d99a26f5f97cd4822fba0364fb", "author_url": "https://twitter.com/teh_klev", "date": "Jan 11, 2011", "message": "I thought the \"Which best describes the size of your company?\" question was a bit broken.\n\nI work for a 14 man outfit but which has been around since 1997 so I'm not sure how you'll be able to draw any useful conclusions from those numbers.\n\nOther that, fascinating."}, {"author_name": "Juliet", "gravatar_hash": "d0d6f5c811ce1fd03862088f33dccc9a", "author_url": null, "date": "Jan 11, 2011", "message": "So out of 1000 respondants, only 7 live in Nebraska.\n\nI knew I wasn't the only Nebraska programmer."}, {"author_name": "Pies", "gravatar_hash": "4e190ebf0c8c40a10127dd833791ceda", "author_url": "http://sputnik.pl/", "date": "Jan 11, 2011", "message": "Our company is small, but I wouldn't classify us as a startup. We like to be small and we don't need many people."}, {"author_name": "scunliffe", "gravatar_hash": "282eed17fcb9682bb2816697482b64ec", "author_url": null, "date": "Jan 11, 2011", "message": "For page 12 \"What type of project are you developing?\" I don't recall if it was a multiple selection question or not but I think it should have been.\n\nWhat if I'm working on a: \"Web Based SaaS Platform for Enterprise Mobile\"? ;-)"}, {"author_name": "KMan", "gravatar_hash": "c7cf5f8467d9c0763cdf0d039168bca7", "author_url": "http://izlooite.blogspot.com", "date": "Jan 11, 2011", "message": "Man! I need a microscope for Australasia 1.0%, response count only 29?!!"}, {"author_name": "Akku", "gravatar_hash": "12882bf2ab3e1eb82443df73c506449a", "author_url": "http://www.ithoughts.de", "date": "Jan 12, 2011", "message": "I think when arguing about certain questions that no poll was ever completely fair. \n\nI tried to look at the iPhone vs. Android aspect that can be found in this survey, as I find it pretty interesting as the survey targeted developers and I think you may be able to draw conclusions here. I hope stackoverflow won't mind my use of the numbers (if so please message me):\n\nhttp://www.ithoughts.de/stackoverflow-survey-what-phones-do-developers-prefer"}, {"author_name": "Gabe Moothart", "gravatar_hash": "6960eab88e6e00020d2751e48019cd59", "author_url": "http://codingpatterns.blogspot.com", "date": "Jan 12, 2011", "message": "I was very surprised by the salary results. 68% of respondents have more than 6 years experience, and the median compensation is only 60k?"}, {"author_name": "Dan Burton", "gravatar_hash": "8d59503078761ba50620cbee4348882e", "author_url": "http://unknownparallel.com", "date": "Jan 12, 2011", "message": "I have a few criticisms.\n\nFirst of all, less than 50% is not a majority, it is a plurality.\n\nAlso, the \"Smart Phone Wars\" section is misleading. The data was drawn from responses to the question: \"Which technology products do you own? (You can choose more than one)\". But the percentages were erroneously (though only implicitly) applied to \"smartphone subscribers\".\n\nAccording to a simple spreadsheet check, the figures for StackOverflow smartphone-users are 39.6% iPhone, 35.1% Android, 8.0% BlackBerry, and 17.3% other."}, {"author_name": "Tim", "gravatar_hash": "250a629ab6e574a05822731b50eecba3", "author_url": null, "date": "Jan 12, 2011", "message": "People tend to include non-professional experience (hobby, high school, college) when saying how long they've been doing something."}, {"author_name": "McDowell", "gravatar_hash": "9061706d2661cf0fa9f2df0eee56cf9b", "author_url": "http://stackoverflow.com/users/304", "date": "Jan 12, 2011", "message": "@Dave Anderson\n\n&gt;One thing I’d be interested in, especially with the indicated spread of years of IT experience, is who’s coming to mainly ask questions and who’s here to give answers.\n\nIf I'm not mistaken, you can estimate that from the monthly data dump (does that include user age fields?)\n\n@Gabe Moothart\n\n&gt;I was very surprised by the salary results.\n\nNote that only 37% of respondents are from the US. It's a tough statistic to gauge the import of; the cost of living varies so much even within countries."}, {"author_name": "Alison", "gravatar_hash": "3b5c0e139db4767c91454f6705d61717", "author_url": null, "date": "Jan 13, 2011", "message": "Thanks everyone for your feedback. It would be great to be able to tie the general demographics back to user stats (reputation, badges, questions, answers), but unfortunately since this was an anonymous survey, we're not able to do that.\n\n@Adam - we targeted the Stack Overflow users via the original blog post and banner ads on Stack Overflow. We will definitely look to do a Stack Exchange-wide survey, but probably not until August which will mark Stack Exchange's 1 year anniversary."}, {"author_name": "Brian Mackey", "gravatar_hash": "b2028885d939a335af8333da70d06310", "author_url": "http://www.brianmackey.net", "date": "Jan 13, 2011", "message": "So we have a bunch of 20something web developers with 11+ years of experience making about 60k a year.  Career change?"}, {"author_name": "lewellen", "gravatar_hash": "62c32c6293d483fc7e1d545c4b9a0ac3", "author_url": "http://antimatroid.wordpress.com", "date": "Jan 13, 2011", "message": "I would be great to have access to the raw data behind the survey results. Any chance of an anonymized data set becoming publicly available?"}, {"author_name": "Alison", "gravatar_hash": "3b5c0e139db4767c91454f6705d61717", "author_url": null, "date": "Jan 13, 2011", "message": "@lewellen I can provide you with the anonymous raw data. Just send me an email alison@stackoverflow.com and I'll send it to you."}, {"author_name": "Rene Saarsoo", "gravatar_hash": "543d0222ea3269453527c07141d48e4b", "author_url": "http://triin.net", "date": "Jan 19, 2011", "message": "&gt;&gt; I was very surprised by the salary results.\n&gt; Note that only 37% of respondents are from the US.\n\nIndeed. I was too surprised by the salary results, but quite the other way around. You see... our prime minister makes 60K."}, {"author_name": "paidsurveys?", "gravatar_hash": "ca9f670b13109d882b32960736dc10ca", "author_url": "http://getpaidfillingsurveys.com/", "date": "Feb 07, 2011", "message": "68.4%, really? :) Wow..\n\nWhat happened to BlackBerry? In my opinion it rocks. Far better than others 2."}, {"author_name": "Drainage surveys", "gravatar_hash": "b1af65c08dda80ede86ed6a11e31c087", "author_url": "http://www.centremaps.co.uk", "date": "Jun 25, 2011", "message": "Brilliant post! I'm kinda curious regarding the results and it's a good thing that you post it in the site. By the way, I'm wondering what user demographics means? I'm kinda not sure with this."}]}