{"response": [{"author_name": "badp", "gravatar_hash": "c81f585328c241594864f888f1154025", "author_url": null, "date": "Jan 05, 2011", "message": "I agree on the premise of having One Reference Question with One Reference Answer -- usually, if many people stumble on the same problem, that's because there's no one good enough reference on the topic, so we might as well make one!\n\nI'm not comfortable, however, with the idea of taking over one question and blowing it up to the particular case. That goes against the \"respect the author\" fundamental premise of editing and will get in the way of the asker if his particular problem didn't happen to be one of the general pitfalls."}, {"author_name": "Jan", "gravatar_hash": "b85b2f1a077fc0f068d539425ddd2c84", "author_url": null, "date": "Jan 05, 2011", "message": "Maybe you need a system to reward people (reputation) who make good edits or identify duplicates?"}, {"author_name": "George", "gravatar_hash": "9ed3482ccbb461fbf8796b251caf8f4d", "author_url": "http://blog.yapb.net", "date": "Jan 05, 2011", "message": "I move to implement the features I outline in <a href=\"http://meta.stackoverflow.com/questions/52530/are-duplicates-creating-broken-windows\" rel=\"nofollow\">Are Duplicates Creating Broken Windows?</a>. :-)"}, {"author_name": "Joel Spolsky", "gravatar_hash": "d77663c217e9d27b725338c06674c94b", "author_url": "http://joelonsoftware.com", "date": "Jan 05, 2011", "message": "@badp As long as a user gets an answer they can understand to the specific question they asked, it doesn't hurt to edit their question. It certainly doesn't hurt to edit it for grammar and typos, and it doesn't even hurt to remove unnecessary specifics (changing someone's domain name to \"example.com\" for example). \n\nA lot of times the original question is so hopeless, either because it's in extremely poor English, or because the asker is deeply, deeply confused about something, that the question, as written, is not answerable. In those cases I argue that you should feel free to edit it into an answerable form, making your best guess as to what the asker was looking for. If you get it wrong, the asker can always come back and ask another question.\n\nAlso -- sometimes a user will ask a specific question (\"My server has been hacked! Help!\") with a lot of specifics (see for example http://serverfault.com/questions/218005/my-servers-been-hacked-emergency ). Once the asker gets their original question asked, if someone wants to edit it to clean it up enough for posterity (removing confusing anecdotes, etc), it's Making the Internet Better so why not?"}, {"author_name": "David Heffernan", "gravatar_hash": "3c0aac2191718ef0309dbc034d9b9961", "author_url": null, "date": "Jan 05, 2011", "message": "+1 Jan\n\nI don't think the problem lies with those answering. It's with those asking that don't know how to do even the most basic web search.\n\nIf you didn't answer these questions and always closed as duplicates then I think you'd discourage newcomers.\n\nWhat you need to do, in my view, is either find a way of purging the dross after a sufficient period of time, or improving the search so that the dross didn't show up. Neither is easy!"}, {"author_name": "David Heffernan", "gravatar_hash": "3c0aac2191718ef0309dbc034d9b9961", "author_url": null, "date": "Jan 05, 2011", "message": "One thing that could usefully be done would be to find a way to remove all the questions on malloc/realloc/free. There only needs to be a single one. You could probably cut the size down by double digits percent if you cracked that one!!"}, {"author_name": "Kobi", "gravatar_hash": "fd75cd399cd893182d6e3d06d738d6d4", "author_url": "http://kobikobi.wordpress.com/", "date": "Jan 05, 2011", "message": "This post confuses me. The second bullet when editing a question is \"clarify meaning without changing it\" - which is the general consensus in meta discussions. I don't think we can just edit questions to a general question we'd like to answer.\nAs for FAQs - they are almost useless. It is almost impossible of a new user to find the per-tag FAQs - the closest they get is the automatic \"Related Questions\", which isn't even based on the tags...\nI don't have a suggesting to recurring questions, but I don't really see one here..."}, {"author_name": "chtrlShiftBryan", "gravatar_hash": "48f50f7d3617aa50f19993dec175a007", "author_url": null, "date": "Jan 05, 2011", "message": "Are you overlooking the laziness factor? It is much easier to quickly compose a new question and have it answered then it is to search and read through a bunch of questions that may be close but not totally relevant.\n\nThe person who knows the answer can easily understand it is a duplicate question. It requires a lot of effort on the person who is asking to determine this."}, {"author_name": "Ryan", "gravatar_hash": "264b03a0c01fc7d59e9db773315c5942", "author_url": "http://ryanmartinsen.com/blog", "date": "Jan 05, 2011", "message": "This actually answered a question I had earlier today about outdated answers like this one: http://stackoverflow.com/questions/76420/best-php-ruby-python-e-commerce-solution\n\nNow I just need some reputation points... :-P"}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jan 05, 2011", "message": "I agree with Joel, it certainly does not hurt the original originator of the question if his or her question is clarified.  As he said, the best thing is this all works like Wikipedia, the author can then re-edit back (knowing that again it may be edited).  I've seen cases were the subject (the actual question) didn't match the actual content of that question.  Someone edited it and I was easily able to go back and answer that question."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jan 05, 2011", "message": "I think in the long term, there is no alternative to rewarding the identifying of good duplicates. After all, it's not only about finding a duplicate question - if at all possible, it's about finding one in which the OP is actually going to find a good answer! This process often takes more time than answering the question yourself, and will need some kind of reward. \n\nIn the same vein, I think the system will need some way of quickly finding questions with the best answers. As it stands, you need to browse through potential duplicate questions to identify those with highly-upvoted answers."}, {"author_name": "Pekka", "gravatar_hash": "100a6c42a31a56e882475725d65537f8", "author_url": null, "date": "Jan 05, 2011", "message": "Also, as an addendum, maybe Stack Overflow needs a new close reason: \"Localized duplicate of generic question X\". This could help put a plug e.g. into the constant stream of \"how do I rewrite an URL\" mod_rewrite questions, most of which can be answered with a generic quick mod_rewrite introduction, and a small amount of common sense. At the moment, there is no way to deal with those questions other than \"too localized\" - and that is simply not being used, because SOers are mostly nice people and hesitant to close valid questions."}, {"author_name": "Tomas Sancio", "gravatar_hash": "7b5810dc45114ef1fe455f6cc52d082b", "author_url": "http://www.koona.com", "date": "Jan 05, 2011", "message": "By attempting to predict your search, Google already does this with a few keywords. Their engine (or somebody else's) will eventually evolve to bulletin boards."}, {"author_name": "Scott", "gravatar_hash": "c6aa04e2d0c9d53ce9133fbf9c16b6b8", "author_url": null, "date": "Jan 05, 2011", "message": "Answer #N:\nThe SO search function almost never finds anything useful. You can tell search isn't and wasn't a priority just by the UI design- no highlighting, same color as the background, and its placement on the page ignores Fitt's Law.\n\nMy solution to the deficient search function is to use google's advanced search features to filter out scrape sites and use a few trusted sources who I've identified to be expert in narrow fields as complimentary search terms.\n\nAnswer #N+1:\nSince your users provide your content, you're dependent on their ability to frame questions and tags in a meaningful way. Good luck on that one- the overlap between skilled programmers and willingly proficient technical writers is vanishingly small."}, {"author_name": "Dave Täht", "gravatar_hash": "4752057c8b126d948886fee444243ae2", "author_url": "http://gnugol.taht.net", "date": "Jan 05, 2011", "message": "Although I like stack overflow, I have two major problems with it.\n\n1) It is unusable with a text mode browser (elinks) or on a small screen (handheld). \n\nTry it with elinks. Shudder.\n\nThen imagine you are partially blind and use a speech synthesizer for many things. Feed the output to a speech synthesizer if you like. Listen to how many irrelevant things and links are part of the \\answer\\ to a given question. Even a sighted user has to filter all that stuff out to go from question to answer.\n\n2) It doesn't integrate with emacs. I know, I'm being snarky...\n\nUsenet and usenet faqs were far more flexible in these regards. \n\nBecause I actually use stackoverflow, and like the reputation based concept, maybe I'll take a stab at the json interface with gnugol and emacs to see if I can make it more navigable."}, {"author_name": "David Heffernan", "gravatar_hash": "3c0aac2191718ef0309dbc034d9b9961", "author_url": null, "date": "Jan 05, 2011", "message": "@dave it's fine on a hand held if you use the correct browser which is Opera"}, {"author_name": "Travis", "gravatar_hash": "3740b508fb7c60ad79d9bc43eb05c48e", "author_url": null, "date": "Jan 05, 2011", "message": "It's rough, it's tough, it hurts, and it's has lots of ouchies. But we should be able to answer with a simple \"RTFM\"."}, {"author_name": "Adam", "gravatar_hash": "207958aa5ac1c42448070dbab3f2dd87", "author_url": "http://stackoverflow.com/users/284685/adam", "date": "Jan 05, 2011", "message": "Great post. I agree that editing is important to prevent answers from becoming obsolete. The goal of creating canonical answers to everything is laudable.\n\nOne issue with editing old questions and answers is that they are basically dead. They receive no attention from the answerer community. True, people find them in searches, but when a question is first asked there is a buzz of activity around it. People are correcting answers, asking clarifying questions in the comments, etc. There should be a way of rejuvenating a question. All the old answerers should be notified to take a look at it again as it is now obsolete and needs more attention. It should show back up on the main page or something. I don't have a solution to this problem. Maybe questions can be marked as expired by a moderator and old answerers will get a message in their inbox to review their work?\n\nThere is no incentive (outside of altruism) to edit old questions. There should be more badges and reputation points awarded in this area.\n\nThere is only a short window of time to edit a question to make it more general. After that people answered it already and you can't fundamentally change a question after it has already been answered. The right thing to do is probably to answer the specific question and within the answer link to the general one. If there is no general form of the question you should create one and answer it. The FAQ mentions asking and answering your own question, but I don't see much of that on SO."}, {"author_name": "Still", "gravatar_hash": "77b793fd0acded958e1e3a3d5fb404c9", "author_url": null, "date": "Jan 05, 2011", "message": "Even with all these features, I still could make a replica of Stack Overflow in a week, using Rails. I just don't want to."}, {"author_name": "Russell", "gravatar_hash": "2e1d0dbb862f63559a2787f8b2e90b3d", "author_url": "http://russelldavis.blogspot.com", "date": "Jan 05, 2011", "message": "\"Don’t answer questions that have already been answered elsewhere. Yeah, you might earn a couple of points of reputation...\"\n\nI'm a little surprised to read this, as I'm pretty sure Joel has written about using incentives correctly. Telling people not do something but then rewarding them for it seems counterproductive."}, {"author_name": "Jose Ziviani", "gravatar_hash": "c595e7e39220dfc22a13f0831567aba7", "author_url": null, "date": "Jan 05, 2011", "message": "I agree with David but besides users who don't know how to search there are people who doesn't know even *what* to search. \n\nAnyway, IMHO the Related Questions displayed after you type the question title could be improved. If I type \"is select * good?\" none of those related question brings me something useful. The same for \"should I use free or delete in c++\" or \"Can I allocate memory using malloc in c++\"."}, {"author_name": "Randy", "gravatar_hash": "736e7475192b209298ea6fd940866352", "author_url": null, "date": "Jan 05, 2011", "message": "@David I agree.  The problem is with the Questioner.  If a person wants the question answered quickly, then the best way is to *look for duplicates* before asking.  Or am I naive?  And in fact, as you ask a question on SO, it displays possible matching questions.  (However, I just tested it with \"What's better: SELECT * or SELECT c1, c2, c3?\", and an actual duplicate was about 10 questions down.)\n\nIs it possible that many of duplicate questions are coming from reputation whores?\n\nRandy -- askedandanswered"}, {"author_name": "Christopher W. Allen-Poole", "gravatar_hash": "4092d1b87964c221b032b0c6e28bffe3", "author_url": "http://allen-poole.com", "date": "Jan 05, 2011", "message": "I agree with Mr. Heffernan, at least in part.  SO is often used by those looking for quick answers and when they don't find those in the first three results of a search, they will create a new, often poorly worded, version.\n\nBut, on the other hand, often, someone will ask a question and not even realize that the answer exists, but using different keywords.  Looking at the SO Meta example <a href=\"http://meta.stackoverflow.com/questions/9686/what-is-the-most-rampant-duplicate-on-stack-overflow\" rel=\"nofollow\">mentioned</a>, it is clear that the first two questions (http://stackoverflow.com/questions/112803/what-is-the-best-web-prototyping-tool and\nhttp://stackoverflow.com/questions/952558/what-kinds-of-tools-do-you-use-for-conceptual-design-of-your-software) from the accepted answer are targeting the same data, but the questions phrased entirely differently *and* the applied keywords don't apply.  These two authors probably did not intend to create the difference, but a search for the terms of one would rarely yield the data from the other.\n\nSome of the searches don't return the best results either.  Search for str int python compare and the first three results don't have the word \"compare\" in them.  It isn't until the forth search result that you will find something which actually addresses the question at hand.\n\nMoreover, as a UI perspective, I think that there is a mistake in the placement of SO's \"search tips\".  It is also visually \"out of the way\" -- it is in a right column, an area generally relegated to menu bars and meta data which is generally \"unimportant\".  In Bing and Google \"advanced search\" is something which is fairly prominent in a search result display page.  Yahoo a little less so -- the user has to click options.  But access to advanced is still in prime real estate in all cases.\n\nAnother thing which SO might benefit from is the format which is used by the search engines.  Google will generally return four lines: Title, two line description, and then a short version of the URL.  It takes up about half as much space as the typical SO response.  This means that I can see twice as many results without any interaction beyond the initial search.\n\nWith <a href=\"http://www.iprospect.com/about/researchstudy_2008_blendedsearchresults.htm\" rel=\"nofollow\">49% of the general public</a> unwilling to search beyond page 1 of search results (and developers are people too), there should be real concern over making those results appear bloated.  I know that a lot of the data presented is imporant (and I will always prefer to look at questions with positive votes), but there is a lot of extra in there as well. (Is user icon really relavent to a search?)\n\nPerhaps this is unfair.  I don't have to deal with laying out changes.  I certainly am not involved in the CSS which would be involved (though I think that this would largely be just that: CSS and nothing more).  But this is what the rest of the world does with searching.  Further, if searches cannot reliably return pages with all search terms in them (or at least cannot place them as the first result), maybe it would be worth considering."}, {"author_name": "BlueRaja", "gravatar_hash": "460167b95ff5a363d3977ddb56cfe074", "author_url": "http://www.blueraja.com/blog", "date": "Jan 05, 2011", "message": "\"Don’t answer questions that have already been answered elsewhere. Yeah, you might earn a couple of points of reputation..\"\n\n-So, to discourage this, why not redact reputation points awarded to answers from questions that are closed as \"exact duplicate\"?"}, {"author_name": "Andrew O'Reilly", "gravatar_hash": "6bda6c4d8073ef20daeef4d0eec24618", "author_url": null, "date": "Jan 05, 2011", "message": "Right now the reward system on stackoverflow is geared very much towards asking and answering questions. If you want stackoverflow to become more of a wiki then you need to adjust the rewards accordingly.\n\nPersonally I actually like that stackoverflow is a river of questions. If a topic requires a single collaboratively edited webpage then it belongs on wikipedia. I see and use stackoverflow as more of a conversational site and as in real life not every conversation has to be wholly unique to be interesting. \n\nThe way I see it duplicates also provide some value in and of themselves. The questioner gets a specific answer and the answerer gets experience in writing a complete solution and both parties get feedback on how well they did."}, {"author_name": "Rob K", "gravatar_hash": "525dac0c4812e8e8753935590b40ddb6", "author_url": null, "date": "Jan 05, 2011", "message": "\"Don’t answer questions that have already been answered elsewhere\"\n\nSo motivate us not to. Give us points for pointing out the pre-existing answer. Take away points for answering duplicate questions. But give the users motivation to do the \"right\" thing."}, {"author_name": "Justin James", "gravatar_hash": "0d221d930d28b2ff00e2ffdd63a90745", "author_url": "http://blogs.techrepublic.com.com/programming-and-development/", "date": "Jan 05, 2011", "message": "Unfortunately, my experience with Stack Overflow (and all other Q/A sites too, include Expert Exchange, MSDN Forums, etc.) is that the hard questions never get answered. The easiest thermometer of \"will this question get an accurate answer?\" is, \"have I been able to find the answer with a search engine?\" If not, you probably won't get an answer on a Q/A site. At least, that's been my experience. In fact, one of my principles is that whenever I discover a solution to a problem that I could not get an answer to on the Q/A sites (including Stack Overflow), I answer my own question there and mark it as \"answer\", and then blog about it as well. This is my contribution to the world in this regard. :)\n\nJ.Ja"}, {"author_name": "Brian Edminster", "gravatar_hash": "c019fdbb20672e38f57a5854b67a74a1", "author_url": null, "date": "Jan 05, 2011", "message": "@Joel - I think what you're trying to say is cleanly covered by a paraphrased quote from Tony Robins:\n\n\"To get better answers, we need to ask better questions.\""}, {"author_name": "Andomar", "gravatar_hash": "200c020bef60e4d9c4c4ba1c85442026", "author_url": null, "date": "Jan 05, 2011", "message": "The lack of example good canonical answers in your post is the proverbial sign on the wall.\n\nCanonical questions are like software manuals.  To paraphrase your blog post:\n1. Users can't find the canonical answer, and if they could, they wouldn't read it.\n2. In fact, users can't find anything, and if they could, they wouldn't want to."}, {"author_name": "Leo Petr", "gravatar_hash": "d02d308183106380d8a2aac4eb77b7be", "author_url": "http://lpetr.org/blog/", "date": "Jan 05, 2011", "message": "Some AI at the question submission stage could help with this.\n\n\"Your question appears similar to these five questions that already have answers. Are you sure you want to submit?\""}, {"author_name": "scottnottheotherscott", "gravatar_hash": "6bc2027c02b592c3bdbd6a58084508ac", "author_url": null, "date": "Jan 05, 2011", "message": "@David Heffernan\n\nThere's an ongoing Catch-22. When you are new to a problem domain, you lack the background (in particular, the vocabulary) to search effectively.\n\nIt's very hard to tell which search results are relevant, because you're not entirely sure what the search terms mean in the first place. In a world of jargon and domain specific language, you can't effectively read or write and so the archives are (largely) inaccessible to you.\n\nSo you seek out a person who speaks natural language and can interpret. AKA posting a question.\n\nThere will *always* be people who can't search. Not because they are lazy, but because really... they can't."}, {"author_name": "Joshua Flanagan", "gravatar_hash": "10adb7caa4eff9c02d244172bc8db6df", "author_url": "http://joshuaflanagan.lostechies.com", "date": "Jan 05, 2011", "message": "People tend to optimize around what is measured. You created an incentives system that was effective enough at keeping people interested and getting the site where it is today. And I mean that in both the positive and negative way. It has a lot of questions and answers, because that is what people are rewarded for. Now you've detected a flaw in the reward system - this post sounds like you've realized you need to fix it (but aren't exactly saying that)."}, {"author_name": "SCdF", "gravatar_hash": "eb2c9961d9729359e086e9dcf6312ff9", "author_url": null, "date": "Jan 05, 2011", "message": "This is all very true, but 99% of SO et al users are not going to read this blog, and 95% of the 1% are going to forget about it in a month.\n\nWhat I guess I'm asking is, how is SO et al going to change to avoid this, because writing a blog post urging your users to change isn't going to accomplish that change."}, {"author_name": "Sergei Korolenko", "gravatar_hash": "a2cd375e10170e437f0db4ae1891efb5", "author_url": null, "date": "Jan 05, 2011", "message": "It's just the way incentives work now: answering lots of easy but popular questions that were already answered dozens of times before for an average contributer is a much is safer strategy paying off in reputation.\n\nThere is no penalty in asking a question there answer already exist on the site, on the contrary the more popular the question the easier to get reputation for asking it.\n\nI don't think that writing a blog entry will change the situation. The incentives system need to be adjusted to reward the kind of behaviour site founders expect."}, {"author_name": "Tim", "gravatar_hash": "76f781fecfe75083b282592f16f9f9d7", "author_url": null, "date": "Jan 05, 2011", "message": "This might not pertain exactly to the problem that this post is discussing but I'd like to share my thoughts.\n\nProblem with Stack Overflow is that you need high reputation points to edit. Way too high. I often see answers that can be improved through my quick edits but I can't, so I leave.\n\nHere is what typically happens:\n\n1. I have a problem\n2. I search google\n3. I click on a Stack Overflow link\n4. It either solves my problem or at least points me in the right direction.\n5. I finally solve my problem and gain a knowledge that I can contribute.\n6. I come back to the site to add my knowledge but all I can do is add another answer.\n\nAt this point, Stack Overflow becomes just another Q&amp;A forum for me. So, I leave.\n\nWhere as Wikipedia just lets me edit. Although I rarely create new content, I constantly make good edits. This has been the biggest turn off for Stack Overflow for me.\n\nStack Overflow advertises all these great features but it's never available for me. I can't even vote down from the start. This high wall of barrier has demotivated me from creating useful content for Stack Overflow.\n\nMaybe I'm a special case, but if Stack Overflow is about cultivating the long tail shouldn't the barrier of entry be low?\n\nThen again, what do I know. :("}, {"author_name": "George Edison", "gravatar_hash": "bba8a1d044a8309d5f9b562ddd3b8bef", "author_url": "http://www.quickmediasolutions.com", "date": "Jan 05, 2011", "message": "So this is why I suddenly started getting rep. from my answer to \"What is the most rampant duplicate on Stack Overflow?\"\n\nBut I agree... this is certainly a problem all right."}, {"author_name": "Justin James", "gravatar_hash": "0d221d930d28b2ff00e2ffdd63a90745", "author_url": "http://blogs.techrepublic.com.com/programming-and-development/", "date": "Jan 05, 2011", "message": "Tim -\n\nThose are my *exact* experiences with Stack Overflow as well! It's too hard to get to the point where I can make meaningful contributions in a way that doesn't involve answering lame questions where \"RTFM\" or \"learn to use a search engine\" would not be valid answers. I can't even knock down rep for people who give \"answers\" to my questions where they clearly didn't read the question.\n\nJ.Ja"}, {"author_name": "brian d foy", "gravatar_hash": "edd8638efe875601bfe394a8aea5b16d", "author_url": null, "date": "Jan 05, 2011", "message": "I've basically stopped paying attention to Stack Overflow because, at least in the Perl section, it's been overrun by people who have realized that there are easy answers to get with almost no work. There are a lot of good people answering questions, but Stack Overflow is now chewing through them just like Usenet and Wikipedia did. The consensus system doesn't work. Someone needs to be the boss.\n\nI think Stack Overflow had the potential to make the internet better, but now its noise level is equalizing with all the other sources. The system of incentives is skewed in the wrong direction. I agree with much of what George proposes.\n\nDespite Joel commenting \"Once the asker gets their original question asked,\", that's not how it is. I have a pretty high edit count, and there was always been pressure to not edit. I agree with Joel on how it should be, but in practice that's not how it has been and how people think of \"their questions\" or \"their answers\"."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.systempuntoout.com", "date": "Jan 05, 2011", "message": "Give an incentive for finding duplicate questions and remove the reputation (+ some interest) earned from answering a question that is later closed as a duplicate.\nhttp://meta.stackoverflow.com/questions/37466/give-an-incentive-for-finding-duplicate-questions\n\nSearching for duplicates is pretty frustrating when in the meanwhile you see the other people answering the question for +25 reps without any effort.\n\nfix it and we will see.."}, {"author_name": "Xaade", "gravatar_hash": "7e8f972382645ebe8e980e7501642327", "author_url": null, "date": "Jan 05, 2011", "message": "This is fine as long as the generic question/answer is adaptable enough to be easily understood by the person wanting the specific answer.\n\nWhat to do with the blue wire may be easily answered by what to do with a five wire hookup on system x, but it doesn't really help someone looking for what to do when they can't find the blue wire, unless the topic also addresses missing wires (and covers differences in case if there are any)."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 05, 2011", "message": "Those arguing for \"remove reputation from dupes\" have no idea of the Frankenstein monster you'd be creating.\n\nThat would be an awesome rep-denial tool for griefing others, first of all. \n\nSecond, it creates a MASSIVE disincentive to participation -- even if you had no idea there were duplicates, you could be bushwhacked at any time even if you contributed a *fantastic* answer. Oops sorry dupe! Zero rep, buddy! Bzzzzt! Go away! Take your awesome answer elsewhere!\n\nIncentives are fine, but penalties are an incredibly bad idea and would actively hurt users and the network."}, {"author_name": "Dave Täht", "gravatar_hash": "4752057c8b126d948886fee444243ae2", "author_url": "http://gnugol.taht.net", "date": "Jan 05, 2011", "message": "I was a little miffed by the comparison of stack overflow to a USENET FAQ, so...\n\nI spent the afternoon prototyping a gnugol engine that could parse the json output that stackoverflow provides into a format that I can deal with. I got it sort of working a few minutes ago. Screenshot:\n\nhttp://nex-6.taht.net/images/usecase.png\n\nYou'll note that my little tool - shows 10 results in roughly 710x289 pixels.\n\nThis is roughly 1/6 of my available screen area on my laptop.\n\nFor comparison, here is a screenshot of stack overflow for something approximating the same search, with my tool overlaid on top. \n\nhttp://nex-6.taht.net/images/usecase2.png\n\nIt shows 2 results, while using all of my available screen area.\n\nWhen I'm working, and being productive, my screen usually looks like this: \n\nhttp://toutatis.isc.org/~d/oslec/Matrixdesktop.png\n\nThis was on a monster 3 screen beast, I have about 1/2 as much screen space available now.\n\nSince I'm down from 3 screens to two, at present, I hope you'll understand why I find it difficult to participate in the modern internet to the extent that I did in the USENET days, and I find interacting on most forums ducedly timewasting and inconvenient. USENET at least had kill files and scoring - built in and invisible rather than up front, on every page.\n\nSome asides:\n\n+ your json api is well documented. Thank you.\n- There seems to be no way to go from a question to an answer in a single query. It would be nice if the API would supply both the text of the question and the recommended answer in one go.\n- The search titles interface to the json api takes 7-10 seconds to complete. Searching google with a site:stackoverflow.com restriction takes 384ms and yields a screen-full of more relevant results. \n+ Your search (not json) engine interface uses an opensearch API\n- The fastest I've seen a result with that API took 709ms. \n\n(I am based in colorado if that helps your speed of light calculation)\n\n- Searching titles with json or using your is nowhere near as effective as searching google with a site restriction of your site.\n\nAgain, it's the EXTRA distance stackoverflow invokes between a question and an answer that's the problem here.\n\nIt might help (others) somewhat if the question(s) and (best) answers were actually on the same page on the search results, perhaps folded, using javascript.\n\n- from reading the api, I don't see support for vote up/down built in. (then again, my eyes hath glazed over)\n\n- Stackoverflow UI could take better advantage of the wider screens now available as there is a lot of whitespace in the second screenshot.\n\nPlease note that I would not make these comments unless I actually liked using stack overflow. I do, I just can't stand the UI.\n\nOld school FAQs and usenet still have their place, and I would like it if it were possible to meet somewhere closer to the middle between these two extremes.\n\nThanks for listening."}, {"author_name": "Justin James", "gravatar_hash": "0d221d930d28b2ff00e2ffdd63a90745", "author_url": "http://blogs.techrepublic.com.com/programming-and-development/", "date": "Jan 05, 2011", "message": "@Jeff Atwood -\n\nI have a tendency to agree. Someone who gives a \"go look here\" answer should be rewarded, because the answer is correct. Someone who essentially rewrites the \"go look here\" answer should get a LOT less of a reward, though, because now they're just duplicating content. Why *should* they be rewarded for repeating what has already been said? Someone giving a unique answer to a duplicate question should get the biggest reward of the three, because they've added a lot of value.\n\nThe solution to the duplicate post issue, as many have hinted at (including Joel's original post) or stated outright, is better duplicate detection by the system at the time of post, and better search functionality.\n\nBut there has to be something more to the solution. Every time I've used Stack Overflow (and again, this is not unique to Stack Overflow... the only similar place that ever gets better than \"no results\" is MSDN Forums, because I can get an MVP or Microsoft employee to answer, and play the \"Gold Partner Card\" as needed), I could not get an answer to any question where the answer did not exist on a search engine. Period, end of story. If Stack Overflow can't answer a question better than Google, Bing, or Yahoo!, what's the point? I get the feeling like the only questions that truly get answered are the ones where it's an obvious answer or a top 10 search results answer.\n\nJ.Ja"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 05, 2011", "message": "> Maybe I’m a special case, but if Stack Overflow is about cultivating the long tail shouldn’t the barrier of entry [for editing] be low?\n\nNo, you're right, this is something we're working on at the moment for sure, a way of allowing anonymous users to contribute edits.\n\nDoesn't necessarily help with duplicates, per se, but it has HUGE implications for letting everyone edit the long tail of questions."}, {"author_name": "Sosh", "gravatar_hash": "a217e17ee044d9d33d2bd8dd51909c41", "author_url": null, "date": "Jan 06, 2011", "message": "Sorry, but I think suggesting people should edit questions significantly (by e.g. making them more general) just to 'make the internet (or SO) better' is a terrible idea. If I had asked a bad question, I would rather it be closed than be morphed into someone else's interpretation of the right thing to ask.  This happens sometimes already in the form of smart-arsed answerers telling people they are asking the wrong question, and then going on to sidestep the question completely.  Unless it's complete crap, the question should belong to the asker.\n\nI suppose I would advocate continued 'education' for question askers.  Oh, and for dupes - please improve the search engine on SO! It's not very good at the moment.  I almost always need to use Google (why not just use Google internally?)"}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.systempuntoout.com", "date": "Jan 06, 2011", "message": "&gt;it creates a MASSIVE disincentive to participation\n\nyes, imho you need to disincentive the participation on duplicate questions. Why should I search for duplicate questions and try to close them when people can answer them and earn reps? Where is the incentive to follow a good behaviour here? Am I missing something?\n\nIf you are answering a possible duplicate question you should have the \"I'm walking on a mine field\" feeling."}, {"author_name": "Adrian", "gravatar_hash": "dd70bd2239c046e2f68e6ef886af2e71", "author_url": null, "date": "Jan 06, 2011", "message": "I much prefer incentives than disincentives - my suggestion for shooting down in flames would be some sort of award or page ranking to rejuvinate the older quality responses. There have been times where I've posted a reply where I've referenced and linked an earlier Q&amp;A because of it's value. Would there be some way to recognize the value of the earlier replies from the number of links or references to the Q&amp;A? Recognition in the form of rep points, bump it's popularity in some way, either higher rankings in the search or related searches etc."}, {"author_name": "Andy E", "gravatar_hash": "8d29878cdfd503749fcb000f9be987f4", "author_url": null, "date": "Jan 06, 2011", "message": "Disincentivising answering duplicates isn't a great idea, not all duplicates are easy to find and quite often they're found because a user recalls seeing the same question before - obviously that doesn't happen right away all the time so some answers are posted before the dupe is found.  In that case, the user deserves to keep their reputation if they've taken the time to throw in a good answer.\n\nThe problem I have with the system is that people often ignore the close votes when they have enough rep to agree with them - especially if they've already \"invested\" an answer in the question. I have a hard time believing they don't see it when they're actively involved in answering comments and updating their answers whilst conveniently not noticing the \"Possible duplicate of...\" comments.\n\nThe idea of incentivising finding duplicates has been tossed around and I'm surprised that nothing has been put in place, considering this blog post appears to be encouraging this behavior."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Jan 06, 2011", "message": "I think a part of the problem is that SO lacks support for reusing answers. Often, these \"duplicates\" are really different questions but with overlapping answers.\n\nBut our only tools are either \"close entirely, and redirect to an existing answer\", or \"leave open, and duplicate a lot of information\".\n\nWhat if there was a middle road, where we could write new answers to new questions, and it was just made easier to create and refer to small \"factoids\" too small to constitute a full answer, but describing a single piece of commonly used information?\n\nThen when I come across a question where I know the answer overlaps another common answer, I could write a thin answer \"shell\" providing a bit of context and relating it to the OP's problem, and then just drop in a reference to the canonical description of whatever the OP needs to know.\n\nJust thinking out loud here. \n\nBut whatever the solution, I think a big part of the problem is that we lack flexible tools for dealing with \"non-duplicate questions with duplicate or overlapping answers\", or more generally, a way to reuse answers (or pieces of answers) we already wrote."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Jan 06, 2011", "message": "Refactoring tools for answers, I guess is a good way to summarize my comment above.\n\nWe're programmers, it seems like this should be an obvious idea, doesn't it? When we keep having to write the same information in our answers, allow us to factor it out so it is only stored once, and can be maintained easily, but while allowing us to refer to it from all our different answers."}, {"author_name": "Huseyn Guliyev", "gravatar_hash": "9e4dc670d9ec7cbd9e3b306c1e89dad0", "author_url": null, "date": "Jan 06, 2011", "message": "I agree with points, but we have to look at reasons why people are asking duplicate questions. The main reason is that they can not find the same question asked earlier.\n\nI have to say, as much I love stackoverflow, I hate its search engine. It returns everything but the question I am looking for. \n\nAfter trying it number of times I go to google and find the question I was looking for in stackoverflow at google. Yes, google searches stackoverflow better than stackoverflow itself.\n\nI am sure everybody values their time and they wouldn't ask the question again if there is also an answer already. Why to bother writing question, waiting for answer, if there is already one.\n\nI hope Jeff is reading this too. Please, improve search at stackoverflow. The duplicate problem and many other will be resolved immediately.\n\nThanks, for this great resource."}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 06, 2011", "message": "> If you are answering a possible duplicate question you should have the “I’m walking on a mine field” feeling.\n\nAnd they are supposed to know this is a duplicate, how? Perhaps for THAT PERSON, this is the first time they have ever seen that question."}, {"author_name": "Paul", "gravatar_hash": "fb6024472a3e6ffd0ce777ec1db3790a", "author_url": null, "date": "Jan 06, 2011", "message": "Hello Joel!\n\nAre you sure rewriting specific questions into general ones is a good idea?\n\nFixing grammar, factual errors and bad style is certainly an improvement but generalization has some side effects.\n\nWhen people ask specific questions then it's usually because formulating an efficient generalization is beyond their ability.\n\nBy making a question \"cover a wider area\" one removes it from the grasp of people still struggling with basic stuff. As a result, the specific question will get asked again.\n\nIn my opinion, generalization destroys the initial focus of the question and will not reduce the influx of the \"same old same old\"."}, {"author_name": "-dan", "gravatar_hash": "48fd7c03aa90c23a2602ebc3837e0f31", "author_url": null, "date": "Jan 06, 2011", "message": "Part of the problem, as I see it, is that people asking the question may not be asking the question the same way it was previously asked.  If you don't use the right wording, or something close to it, you won't find it, so it will be asked again and again and again.\n\nThis is especially true when trying to solve a coding problem, there are always multiple ways of asking the same question, so why not allow for multiple headings? \n\nThe way a new programmer asks a questions is not at all the same way an expert will. Chances are the newbie doesn't have the vocabulary to ask it the same way, and isn't this about teaching? \n\nJust a thought that might make the internet a better place."}, {"author_name": "Adrian", "gravatar_hash": "dd70bd2239c046e2f68e6ef886af2e71", "author_url": null, "date": "Jan 06, 2011", "message": "&gt; but we have to look at reasons why people are asking\n&gt; duplicate questions. The main reason is that they can\n&gt; not find the same question asked earlier.\n\nThat may be one reason, however I suspect that for many they can't be bothered to look for the earlier answer, no matter how good the search engine is. There are several users who seem to have a scatter gun approach popping off several questions in a matter of minutes. Hoping that the others will do the searching for them."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.systempuntoout.com", "date": "Jan 06, 2011", "message": "&gt;And they are supposed to know this is a duplicate, how? &gt;Perhaps for THAT PERSON, this is the first time they &gt;have ever seen that question.\n\nYou are absolutely right, but some people is answering questions even with one or more close votes and that's not fair for the other people who spent time to search for duplicates.\nI totally agree that it is a difficult beast to tackle, but since it's not working at all maybe it could work a little better with a little bit of \"fist of justice\".\n\nIn my opinion the point is: to deter people in asking duplicate questions, discourage people to answer them giving incentives to find duplicates instead."}, {"author_name": "-dan", "gravatar_hash": "48fd7c03aa90c23a2602ebc3837e0f31", "author_url": null, "date": "Jan 06, 2011", "message": "You're not going to stop people from being lazy and creating duplicates instead of searching, that's always a factor, and until someone writes some pretty cool code to automatically detect duplicates, that problem will exist.\n\nBut I have always found it a nightmare to find answers to some questions only to find out that the answer is there if only you knew the question (how it was originally asked).  \n\nHaving multiple headings for the same answer will help greatly.  And by this I mean you can see all the headings for the same answer listed line by line. As in (another way this question was asked)\n\nThis solves many problems:\n1.  It helps people find the answer.\n2.  It teaches people better ways of asking the question(new vocabulary)\n3.  Cuts down on duplicates.\n4. Better Internet."}, {"author_name": "jalf", "gravatar_hash": "5794f28dc1aba7a8844933816a6fa2c9", "author_url": null, "date": "Jan 06, 2011", "message": "@systempuntoout: nor is it fair to those who go to the effort of actually providing quality answers, if someone arbitrarily decides \\this looks like a duplicate\\ and votes to close it. It works both ways. And personally, when there is a conflict I tend to side with the people answering questions, over the people *closing* questions.\n\nSeems people might be losing sight of the goal here. Catching duplicates has no intrinsic value. It only matters in so far as it makes SO a better place to find answers to your questions.\n\nIf people answer duplicate questions instead of closing them, the only real downside is that we end up with a lot of duplicated information, which we as programmers tend to dislike, and which makes it harder to ensure that all of it is correct and up to date."}, {"author_name": "systempuntoout", "gravatar_hash": "97b24d533eab5a093a1085903745b33c", "author_url": "http://www.systempuntoout.com", "date": "Jan 06, 2011", "message": "@jalf\nwell, here in Italy we usually say: \"You can't have a full bottle and a drunken wife\".\nIn my opinion, you can't defeat the duplicate questions problem without losing something with value."}, {"author_name": "Paul", "gravatar_hash": "fb6024472a3e6ffd0ce777ec1db3790a", "author_url": null, "date": "Jan 06, 2011", "message": "@systempuntoout\n\nAre you sure duplicate questions are the equivalent of a sober wife?"}, {"author_name": "Dave Täht", "gravatar_hash": "4752057c8b126d948886fee444243ae2", "author_url": "http://nex-6.taht.net/posts/Screen_Space/", "date": "Jan 06, 2011", "message": "Perhaps the most constructive suggestion I can make is that I would like there to be a \\short stack overflow\\, much as I just outlined on my blog (http://nex-6.taht.net/posts/Screen_Space/), that wouldn't compete for screen space with all my other applications. It would be kind of cool to have a jabber interface as well, that would make interacting with the site faster and simpler."}, {"author_name": "Jim Dodd", "gravatar_hash": "0338cd8dd88230b3b0a96bb1a5e946e2", "author_url": null, "date": "Jan 06, 2011", "message": "The Search on Stack Overflow is not its best feature but I would suggest just using Google (or Bing or others) as the default. I just searched for some key words I'd looked at days ago and Search did not offer any meaningful help - EXCEPT that it suggested using:\n\nsite:stackoverflow.com/questions \n\nat Google and that returned terrific results. Why not just do that in the Search box? Take the keywords and pass them to Google with that command line?\n\nOn the other hand, I'm afraid most people don't like taking the time to search for existing questions/answers before asking their question. But I think Stack Overflow is a great step forward. Not perfect but at you are getting better."}, {"author_name": "matt wilkie", "gravatar_hash": "875b592087c435ab4a8d533cda9b69c1", "author_url": "http://www.maphew.com", "date": "Jan 06, 2011", "message": "There are a lot of very good thoughts and observations presented here. I hope they're all given due consideration.\n\nI'd like to underline two themes that have been true in my experience at stack exchange sites. They've both been mentioned before but I think I have something to add.\n\n(a) I'm \"guilty\" of a several duplicate questions. I *always* search before I post, and I conscientiously read through at *least* the first page of results (though admittedly sometimes at speed and without attention to detail). If I ask a dupe it's because I couldn't find the pre-existing one. Sometimes it's because I don't know the right words, and sometimes it's because the SO search engine returns too many irrelevant results. It's never because I'm too lazy to work for it.\n\nIt's a lot easier to be conscientious and thorough now that I have a comfortable amount of reputation under my belt. When a raw newbie there's a lot of pressure to up the rep count as quickly as possible in order to participate more meaningfully. The memory of being chastized and downvoted for adding a new answer to a question instead of a comment still stings a bit (I didn't have enough rep to comment). This means the strata of users which are most likely to ask dupes, newbies, is the same strata which is most likely to benefit from asking a dupe (a lot of dupes get an upvote or two before the dupe is noticed/discovered). (((as an aside, this same pressure for fast upward mobility also contributes to asking questions without thinking about them carefully first.)))\n\n(b) Old questions are basically dead to the community of experienced answerers. It's very hard to revive an old question and get attention focussed on it."}, {"author_name": "pdr", "gravatar_hash": "7de857de33d5ad2d7e433bc8d459315f", "author_url": null, "date": "Jan 06, 2011", "message": "Agree with the many comments about the search. I couldn't find an answer to a question last week even though I knew it was there, having found it a few days earlier.\n\nHere's a thought no one has brought up yet:\n\nAnswering simple questions earns you quick reputation. Answering difficult questions often earns you very little, because so few people can verify the answer. Most of the simple questions have already been answered and had been answered long before I became active on SO.\n\nDespite knowing this, I have answered a good few difficult questions while I've been here answering easy ones. Reputation is not a major driving goal for me, but if I were getting none by answering only difficult questions, I would be less inclined to turn up.\n\nIf you take away my ability to earn easy points, you possibly don't get my participation.\n\nHowever, I understand the need to keep the site's archive clean. So why not allow people to mark a question as a duplicate and then later - say one week after the asker has accepted an answer - remove it, or better still, merge the answer pool somehow.\n\nAnd reward that high-effort job well. Make it something that the experienced members feel a need to do. Make it more valuable to them than spending time answering questions which have been answered before; let the new members answer those for a first time?\n\nIf someone has a reputation of over 100K, 10 points for each upvote on a difficult question is worth nothing to them. But 100 points for taking the effort to merge a marked duplicate with the original might be worth plenty."}, {"author_name": "Ceilingfish", "gravatar_hash": "bafc05c35c2812b72187911d7bbb09ab", "author_url": null, "date": "Jan 07, 2011", "message": "Given that we do have multiple questions in the wild, and in some cases many copies have useful answers would it be possible to add references to other usefully answered questions on the same topic.\n\nAt the moment the closest we have is the Related questions, but they don't seem to have any weighting to questions with highly uprated answers.\n\nAlternatively, we could migrate useful answers from duplicate questions to the canonical question. However that would reduce the richness of the search terms for the question and the answer would not make much sense in the question it was moved to, unless it was given context."}, {"author_name": "Tim Barrass", "gravatar_hash": "4225dbf0254a965b70e024c58c58750f", "author_url": null, "date": "Jan 07, 2011", "message": "For what it's worth -- you've created a great Mechanical-Turk-style general-coding-questions site that really encourages people to answer low-to-mid-level questions. \n\nI mean that sincerely -- I realise it's not your intent -- and I think the competition to understand, translate and rephrase questions quickly is actually useful.\n\nI agree with @pdr; I'd suggest keeping it as it is, and rewarding people richly (archivists) for trawling through the duplicates and merging them up *somewhere else* if you want to maintain a clean archive of canonical questions. You've almost got two distinct populations of experts; it might be good to make use of that."}, {"author_name": "Dmitry Streblechenko", "gravatar_hash": "3b4d3781f7941d22f935aaddcae62055", "author_url": "http://www.dimastr.com", "date": "Jan 07, 2011", "message": "Unless the number of the duplicates is unmanageble, I really do not understand what the problem is.\nThere are much bigger (at least IMHO) problems with stackoverflow that prevent me from participating more.\nI much prefer the MS forums (http://social.msdn.microsoft.com/Forums/en-US/categories), even if their scope is limited to the Windows and MS specific questions.\n\n1. E-mail notifications: they are only sent for the questions that I asked. How about the questions that I *answered*? How about the threads that I do not participate in (because I cannot add anything of value), but still want to track?\nThe notifications are far from being real-time. If somebody reponds to a topic that I am interested in, let me know *now* so that I can provide a real-time feedback.\n\n2. I really do not understand the \"no signatures\" policy. Yes, I point people to my web site and plug my products. Selling my products is how I make money. Yes, I want people to see my signature when I provide a relevant answer and one of my products might help them. Why is it wrong? The only way for me to get more impressions is to *answer* questions. Isn't this what everybody wants?"}, {"author_name": "sbi", "gravatar_hash": "2e25a2a0d5cdd1217903cbf88e2b4fd3", "author_url": null, "date": "Jan 07, 2011", "message": "@jalf: \n\"If people answer duplicate questions instead of closing them, the only real downside is that we end up with a lot of duplicated information, which we as programmers tend to dislike, and which makes it harder to ensure that all of it is correct and up to date.\"\n\nI fully agree, except for the word \"only\". IMO duplicates _are_ a real problem. The quality of answers depends a lot on the day of the week and time of day (U.S. business hours?) the question was asked (plus a few other factors) and varies wildly. If you have dozens of duplicates for a question, you have dozens of answers voted to the top which are of a wildly varying quality. If the community's efforts would be channeled into answering one question instead, this one question could have high quality answers. \n\nSee http://meta.stackoverflow.com/questions/73991/the-wikipedia-of-long-tail-programming-questions for a discussion of this blog post."}, {"author_name": "Tim Barrass", "gravatar_hash": "4225dbf0254a965b70e024c58c58750f", "author_url": null, "date": "Jan 07, 2011", "message": "So even the discussion here is duplicated somewhere else? How apt."}, {"author_name": "Rusty Shackleford", "gravatar_hash": "2085b9877cfd0322d790206e7d7a956d", "author_url": null, "date": "Jan 08, 2011", "message": "Isn't the solution obvious? \n\nYou need to add sites for recipes(aka how to's)\n\nTag it with Java 6, or Rails 2.x, or Apache 2, or whatever.\n\nThis would reverse the current situation. Instead of asking questions and praying that someone will answer, why not have people answer them before it gets asked?\n\nReputation and all that can work the same, you can even force the same format that most recipe books have. A problem statement, a solution, and a short discussion. Then allow people to comment/edit it if something is not clear.\n\nSomething like this would have infinitely more value then the current stack exchange setup."}, {"author_name": "JonH", "gravatar_hash": "fab2c5dd38161cb858b6cbdbfa6189a3", "author_url": null, "date": "Jan 08, 2011", "message": "@Rusty Shackleford\n\nThat is easier said then done.  Think about it for a minute, how are you going to write up an FYI for a specific problem that involves various technologies.\n\nIt's really not that easy so an FYI is not the answer to this challenge.  Also think about the number of people that will come to a site like this and look through a \"general\" fyi list, surely it's not going to cover even 50% of the questions asked."}, {"author_name": "Rusty Shackleford", "gravatar_hash": "2085b9877cfd0322d790206e7d7a956d", "author_url": null, "date": "Jan 08, 2011", "message": "It will definitely cover the questions that get repeated."}, {"author_name": "RP_Joe", "gravatar_hash": "031cbbbc24863565ff9f66a368478ad7", "author_url": "http://Seoplannow.com", "date": "Jan 08, 2011", "message": "I have two problems with the Stack overflow model. \nBefore I post I look for dups.\nWhen I search and find 5 pages of questions, I am not going to read 5 pages. 1 page yes, but not 5. \n\nIf its a hard question, normally I have spent many hours on it before posting, there might be few answers. Its possible none are the answer. In a day or so the question is essentially dead. No one bothers to answer it. \n\nNow its a fantastic system. I am stunned how fast I can get answers, which may be why there are so many dups. Its still early and I am optimistic these problems can be solved. PLEASE keep up the good work."}, {"author_name": "01", "gravatar_hash": "585ea878830771b4c493dce5f7acb652", "author_url": null, "date": "Jan 09, 2011", "message": "So you are in favore of re-writting homework questions? this could be fun!"}, {"author_name": "01", "gravatar_hash": "585ea878830771b4c493dce5f7acb652", "author_url": null, "date": "Jan 09, 2011", "message": "I just generalize 2 question and it feels good :) but its hard to make it compatible with answers :/"}, {"author_name": "eryksun", "gravatar_hash": "460e6e299e385fd46df156c85a1dd55f", "author_url": null, "date": "Jan 09, 2011", "message": "IMO, a little structure can't hurt and could even improve the search results. Why not create a new question that links to similar questions?  Add a collapsible element to each question that contains forward links to related questions and also an automatically generated element that contains links to referring questions. These lists would be sortable by time, score, etc. There's no need to delete any question unless it's just a bad question. Over time the best questions with the best answers will percolate to the top and bad questions will sink to the bottom toward negative infinity, certainly below any reasonable noise floor."}, {"author_name": "Ian Ringrose", "gravatar_hash": "699a9b2caefb52530d1c872bb2932d21", "author_url": null, "date": "Jan 10, 2011", "message": "-&gt; If a person wants the question answered quickly, then the best way is to *look for duplicates* before asking.\n\nI think often best way is the other way round, write the question as that help you understand your problem.  Post the question, then look for duplicates and *vote to close your own quesion\" if you find any good duplicates."}, {"author_name": "Damien Wintour", "gravatar_hash": "cd5c5f1d4b4f98a163bdb88476281b2b", "author_url": "http://www.necessaryandsufficient.net/", "date": "Jan 11, 2011", "message": "Isn't the real problem the detection of duplicate questions (before they get answered)? Why rely on manual detection. Sure you have a lot of users but people are lazy."}, {"author_name": "Tim Barrass", "gravatar_hash": "4225dbf0254a965b70e024c58c58750f", "author_url": null, "date": "Jan 12, 2011", "message": "FWIW I currently approach this by answering a question if I can, as quick info is often useful. \n\nThen I'll search for duplicates and include and I find as edits to my answer, and comments in the question. \n\nI don't see that this is unreasonable, as there's two things going on on SO: a very short term conversation about a problem, and a long term archive of canonical information."}, {"author_name": "David Anderson", "gravatar_hash": "c21efe10ae3a9e334ff24cce02bcf510", "author_url": null, "date": "Jan 17, 2011", "message": "It seems the best way of avoiding duplicate questions would be to answer them before they are asked.\n\nPut a box below the question edit box with suggested searches. Use AJAX to do an instant search for the question as the user is typing. \n\nOftentimes the user will see his/her exact question below and click on the answer instead of continuing to write their own question.\n\nInstead of telling the user to google questions before they ask, do it automatically."}, {"author_name": "Christopher W. Allen-Poole", "gravatar_hash": "4092d1b87964c221b032b0c6e28bffe3", "author_url": "http://allen-poole.com", "date": "Jan 17, 2011", "message": "Not to harp on the same issue, but search-ability remains a major problem.  This problem: \n<a href=\"http://stackoverflow.com/questions/4717915/diffrence-between-x-and-x\" rel=\"nofollow\">Diffrence between x++ and ++x</a> is an exact duplicate of any number of stackoverflow questions, but if you put the title into search, you get no results.  Now, if you were a newbie, how would you know how to phrase this question so that you could find the duplicates?  ++x, x++ do not show anything.  Is it fair to expect newbies to know the name of incrementers?  \n\nWhat about ternary operators?  I know that there are a number of duplicates there too.  How would a newbie know that?"}, {"author_name": "tzenes", "gravatar_hash": "947c457cb4e5480cb8b2f09e49794834", "author_url": "http://gaming.stackexchange.com/users/102/tzenes", "date": "Jan 18, 2011", "message": "Every time I see a duplicate where someone has literally copied my answer from another question (instead of voting to close as duplicate), I die a little inside.\n\nI work very hard to write very good answers and, and this may sound vain, I like getting credit for my hard work.  To see someone lift my answers (sometimes with attribution) and receive reputation for it, sometimes more than my original answer, is frustrating for me.\n\nI realize that you don't want to disincentivise, but I can't help but feel this is the result of not having a better MERGE operation.  If questions that were close as duplicates were able to merge answers (in some fashion) that people would be less likely to lift answers on to every new duplicate.\n\nNow I realize discussing a MERGE operation is no easy feat, but I do think it could be accomplished as long as you also provide for a FORK; this would make for more easy unwinding of MERGEs and even allow for splitting of questions with disparate parts.\n\nUnfortunately, as it stands it feels as though people are disincentivised to close as duplicate, and that is harmful to YE OLDE TIMERS"}, {"author_name": "Eric Zhao", "gravatar_hash": "f7b208fb8883433c7ec03c0fc204aaba", "author_url": null, "date": "Jan 19, 2011", "message": "So many people mentioned about how to prevent dross by improving search. And I think SO has the ablility to search better than the current on (or Google site:stackoverflow.com).\n\nMy idea is SO can try to do search when users has input the detailed questions and are ready to submit the question.\n\nIn old way of search, users can only input a few words. It's hard to match the existing questions using just a few words. Also, one thing can be described in many different ways.\nBut if users're going to submit a questions, they must input a lot of detailed descriptions of their questions.\nThe search engine can get better result using these detailed descriptions. Then show result before submit."}, {"author_name": "Liang Zhu", "gravatar_hash": "b72095d1f9c64e8de4a0e39051fdded9", "author_url": null, "date": "Jan 20, 2011", "message": "I agree with the general principle not to pollute the internet with huge amounts of duplicate Q&amp;A (by \"duplicate\" I mean the same \"root cause\" and same \"fix\") by closing dupilcate and generalize canonical answers. \nThe problem is you have to get people do this smartly, which is hard, or it might hurt the new comers who even don't have the skills to ask 'good' question yet.\nCouple ways achieving this\na) Only allow smart people do this -- Can't think of a way to implement this\nb) If people do it unsmartly, there is a way to detect and fix. It might help allow the question opener to thumb up/down on the edit and count this in the editer's credit. \nc) Only allow edit(duplicate/generalize) after a certain period, eg: one month. So this won't hurt the newbies allow them get immediate answer to what they need. And it's OK to leave the jam questions searchable on google for a month, as they will go away eventually.\n\nLast but not least, Joel i'm a big fans of you :)"}, {"author_name": "Maxim Veksler", "gravatar_hash": "d67dc06a6330e7043f85896351fd7e83", "author_url": "http://bytecoded.blogspot.com", "date": "Jan 25, 2011", "message": "You want us to help make the stackoverflow wiki better, that's great we love what you have built and it's super useful BUT... if you want us to take part in the effort help us in return: Make the stackoverflow knowladge database freely accecible! Not just by HTTP but by a simple download of the whole context. Much like wikipedia allows people to download it's database. Give us the option of setting up an internal stack over flow site (release the code!) Help the community.\n\nMaxim."}, {"author_name": "mankoff", "gravatar_hash": "d5325234ab93b0841b7a3f8a69288080", "author_url": "http://kenmankoff.com", "date": "Feb 04, 2011", "message": "After using the SE sites for a while and gaining quite some reputation on some of them, I have found two major flaws in the system and wonder how they can be addressed.\n\n1) How does the system handle when a wrong answer has been selected? In this case, right answers can get more votes, but wrong is still selected and shows up first. By wrong I mean objectively non-optimal when others are objectively more optimal (we are programmers, after all). This can be because a neophyte asked and eagerly accepted the first answer, which was good enough, and are no longer participating and notice other answers. Or perhaps the question has been edited to become more general, duplicate (or near-duplicate) questions point here, and more general answers are submitted. Again, the original asker is not involved, and therefore the selected \"right\" answer does not get updated. How does the SE system handle this?\n\nThe second major problem is somewhat related and is: Staleness. Ask a general question, it is answered for OS X 10.5. A while later 10.6 comes out, the question is still valid, but the answer is now totally wrong, perhaps even dangerous on the new system. There is a preference for new questions to be active, gain votes, gain answers, etc. Hence the issue of staleness. I can edit the question to make it clear it was for a 10.5 system, edit the 'best' answer with 10s of votes to make it mention it is a 10.5 solution, add a 10.6 solution, but the 10.6 solution will just not gain much notice because the original question is a year old.\n\nPeople might google the Q, come across the A, read the 10.6 stuff as that is relevant, but not being part of the community, they'll just use the info and go on their way, not bothering to vote what is now the 'more correct' (as more people are now running 10.6 than 10.5) answer up. It is stale.\n\nAny thoughts on these two scenarios is much appreciated."}, {"author_name": "John Arbaugh", "gravatar_hash": "5c3a905a8010d1325c489aa26eee52c0", "author_url": null, "date": "Feb 28, 2011", "message": "I think Eric Zhao is on the right track - search for their answer and present them with the results before they can actually submit.  \nAdditionally all the original questions and edited questions are a gold mine for making the system smarter about finding duplicates and directing anyone who does not know \"how\" to ask the question to the right answer. If I ask a question about \"x++, ++x\" and similar questions exist that are closed as duplicates then point me to the right answer about using increment operators anyway.  Get the system to learn the way real people ask questions by mining the questions people ask, or at least searching all the questions asked (before any editing) and returning corrected results."}, {"author_name": "Amrinder Arora", "gravatar_hash": "e8f91b07dbc64f768b15c20f2b3842d5", "author_url": "http://www.standardwisdom.com", "date": "Apr 12, 2011", "message": "One problem that I have had with SO is simply those smart alecs trying to point out that the question is wrong and this would be a wrong feature to build and point me to a remotely similar question (that uses a different DB server and different SQL dialect, but is \"otherwise just the same question\")."}, {"author_name": "Marcus Adams", "gravatar_hash": "67b4e3ecd5ddf336913e1654c986081e", "author_url": "http://mediapluck.com", "date": "Jun 06, 2012", "message": "I have a problem that when I vote to close a question as a duplicate, I get no backup since all the readers who stick around have weighed in with answers, and they're not motivated to vote."}]}