{"response": [{"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jan 18, 2011", "message": "\"in good standing\" suggests it's possible to be a member not in good standing.\n\nWhat do I have to do? Is gross moral turpitude involved?"}, {"author_name": "jjnguy", "gravatar_hash": "d787caaf04b85641692a24099fcee990", "author_url": null, "date": "Jan 18, 2011", "message": "I'm so bleeping excited!  May the best candidates win!\n\n@mgb, users can get suspended for various reasons."}, {"author_name": "Benny", "gravatar_hash": "ee98cccb68318cf0ec167c05fd3ace7e", "author_url": "http://bens-wiki.co.cc", "date": "Jan 19, 2011", "message": "I would like to say I envie you all for this election and have I hope the SE/SO/SU new mods have great fun."}, {"author_name": "W", "gravatar_hash": "3c9ad5d14fc97d072d507dfcf9b83822", "author_url": null, "date": "Jan 19, 2011", "message": "I think more than 30 candidates should enter the Primary, since else the reputation cutoff gets a bit too high. Perhaps make the cutoff a fixed 10k instead of using 30 slots."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://stackoverflow.com/users/13", "date": "Jan 19, 2011", "message": "@W: Yes, agree, since the cutoff is already turning out to be that way (and it certainly will be at least that, by the end of the nomination period, even if we exclude the current two joke nominations)."}, {"author_name": "Chris", "gravatar_hash": "f90960f7668c6575ca35b9f57db997e1", "author_url": "http://unsliced.myopenid.com", "date": "Jan 19, 2011", "message": "\"10 or less\"??  \n\nModerator: can you update this to \"10 or fewer\"? ;)"}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://about.me/cky", "date": "Jan 19, 2011", "message": "@Chris: No. It's \"less\", not \"fewer\", because the C++ standard decreed so. It's \"std::less\", not \"std::fewer\". :-P\n\n(More seriously, I do take your point.)"}, {"author_name": "Jeff Atwood", "gravatar_hash": "51d623f33f8b83095db84ff35e15dbe8", "author_url": "http://www.codinghorror.com/blog/", "date": "Jan 19, 2011", "message": "@chris\n\nno thank you :)\n\nhttp://english.stackexchange.com/questions/495/less-vs-fewer\n\n\"In addition, less is normally used with numbers (less than 10,000) and with expressions of measurement or time (less than two weeks; less than four miles away). \""}, {"author_name": "Jeff O'Neill", "gravatar_hash": "13451d2fb1dcbc64ad4e8bd0d0bf40d4", "author_url": "http://www.openstv.org", "date": "Jan 19, 2011", "message": "Another semantic point.  You are using Meek STV to count the votes, and STV stands for \"single transferable vote.\"  The idea is that each voter gets a single vote and that single votes consists of multiple rankings (three in this case).  In the description above, however, you say that each voter can cast three votes.  This is not accurate since, for some voters, their vote will go entirely to their first choice and the second and third choices will not get any portion of their vote."}, {"author_name": "Chris Jester-Young", "gravatar_hash": "729442eea8d8548842a6e0947e333c7b", "author_url": "http://about.me/cky", "date": "Jan 20, 2011", "message": "@Jeff O'Neill: Are you splitting hairs? I read the description of the voting to simply mean that you get to place three ranking votes, and your first-ranked one gets used first, and only falling through to the second- and third-ranked if your first-ranked person gets eliminated."}, {"author_name": "Andy", "gravatar_hash": "e5906408c4fc2a0489827ce6ed2bc091", "author_url": null, "date": "Jan 24, 2011", "message": "@Jeff Atwood: I believe \"fewer\" is correct here. \"Less than 10,000\" is correct if you're referring to the number itself, which you aren't; the phrase was \"10 or less candidates\".\n\nCorrect: \"The number 9,999 is less than 10,000.\"\nCorrect: \"There are fewer than 10,000 candidates.\""}, {"author_name": "mgb", "gravatar_hash": "7010f170ec917b56e173f3978c459e0e", "author_url": null, "date": "Jan 25, 2011", "message": "Vote totals are shown on voting page. \n\nIt's generally not a good idea to show votes already received in an election, it tends to mean people just vote for the leading candidate and so whoever gets a head start wins.\n\nIn 'real world' elections most places ban any opinion polls or reporting of results once voting opens."}, {"author_name": "Ether", "gravatar_hash": "43722cb1e955874a8eb721e9dfe101d1", "author_url": null, "date": "Jan 25, 2011", "message": "This blog post really needs to be linked to from http://stackoverflow.com/election -- I had to go to meta to search for \"wtf is a primary\", as there is no description of the process on the main election page. Not all of us are Americans or have the same assumption about how elections work."}, {"author_name": "Ether", "gravatar_hash": "43722cb1e955874a8eb721e9dfe101d1", "author_url": null, "date": "Jan 25, 2011", "message": "Re STV and \"you have three votes\", actually with STV the voter gets *one* vote, which is allocated across one or more candidates according to the rankings.\n\nFurther, I really disagree with the idea that one may only rank three candidates. Since the ballots are being counted electronically, there is no loss to allowing the voter to rank as many candidates as he chooses, and indeed this provides maximum choice. If I may only rank three candidates, I may resort to voting for less optimal (but more popular) candidates in the hope that at least one of my rankings ends up counting for someone, rather than voting according to my true preferences."}]}